{
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_john-holden/content_19.html": "Manor ward councillor\nShadow Executive Member for Highways, Environmental and Traded Services / Opposition Spokesperson for Licensing Committee\nContact information\nHome address:\n24 Elmwood\nSale\nM33 5RN\nPhone: 0161 962 1849\nMobile: 07752 667453\nCommittee appointments\nTerm of Office\n- 10/06/2004 - 10/06/2026",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_dr-shengke-zhi-would-hear-your-views-councils-budget-proposals-and-overall-performance/content_57.html": "Dr Shengke Zhi would like to help deliver a better plan for Altrincham and focus on your priorities.\nPlease take a few minutes to complete the survey, Shengke will share your views with the council and lobby for action on issues that are most important to you.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_dylan-butt/content_43.html": "Hale Barns ward councillor\nDeputy Leader of the Conservative Group / Shadow Executive Member for Finance, Change and Governance / Chair of Health Scrutiny Committee\nContact information\nCorrespondence address:\nTrafford Town Hall\nTalbot Road\nStretford\nManchester\nM32 0TH\nPhone: 0161 928 8813\nEmail: [email protected]\nCommittee appointments\nHale Barns & Timperley South Ward\nConservative\nTerm of Office\n- 10/06/2004 - 10/06/2027",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_rob-duncan/content_34.html": "Manor ward councillor\nShadow Executive Member for Housing & Advice / Vice-Chair of Children and Young People's Scrutiny Committee\nContact information\nCorrespondence address:\nTrafford Town Hall\nTalbot Road\nStretford\nManchester\nM32 0TH\nEmail: [email protected]\nMobile: 07977 290823",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_contact/content_42.html": "If you would like to speak to us on any issue, local or national, or would be interested in receiving details of the benefits of Conservative Party membership, please contact your local associations using the information provided or the press officer.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_save-altrincham-hospital-labour-dont-care-we-do/content_64.html": "Despite millions of pounds being spent on our Minor Injuries Unit, including on the cutting-edge technology within, Trafford's Locality Board, who are responsible for Altrincham Hospital, have decided that the Minor Injuries Unit should be closed permanently and not reopened to patients.\nThe Trafford Labour Party, who are in control of Trafford Council, have refused to join us in demanding that the Labour-led Integrated Care Board fully re-open our hospital.\nAltrincham has had a hospital for over 100 years, so to close this department and force patients to travel to Wythenshawe or Trafford is unacceptable. This short sighted decision will add extra pressure to both of those hospitals, increase waiting times and add more strain on local healthcare services including GP practices.\nThousands of residents have so far announced their support for our campaign, so why not sign our petition and help get our Minor Injuries Unit re-opened",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_lisa-hancock/content_49.html": "Bowdon Ward Councillor\nLisa Hancock is honoured to have been elected as the councillor for Bowdon Ward.\nLisa is a graduate Technician in Traffic & Safety, and former Transport Planner, and as a local resident she can see the issues around traffic, potholes and roads in our area.\nLiving in the area and passionate about local issues she is delighted for this opportunity to make a difference.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-conservatives-criticise-labour-budget-council-tax-soars/content_30.html": "Trafford Council passed its budget on Monday, 5th March, with Trafford Conservatives voting against the proposals. The budget raises serious concerns, especially the 7.49% increase in Council Tax — a significant blow to residents already struggling with the ongoing cost of living crisis. Residents are being asked to pay more for less, facing rising costs without any noticeable improvement in services.\nCouncillor Evans, Leader of Trafford Conservatives, stated:\n“The budget that has just been passed by Trafford Council fails to address the pressing financial challenges facing our borough. Trafford Council’s reserves are at historic lows, budget gaps are widening, and yet money continues to be wasted. For instance, £2 million has been spent on care homes that are either boarded up and unused or running at reduced capacity.”\nThe Trafford Labour administration has been in power for seven years. Greater Manchester has also had a Labour mayor since the position was created. With a Labour government and only Labour MP's, Labour has full control at every level — locally and nationally. Yet, instead of taking responsibility, Trafford Labour continues to shift the blame onto the Conservatives.\n“Labour have been in control of Trafford Council since May 2018,” added Cllr Evans. “It is concerning that Labour councillors seem confused about who is actually in charge.”\nResidents don’t have to look far to see the Council’s failures. Trafford’s roads are deteriorating, basic services are falling short, and financial mismanagement continues to threaten the Council’s stability. Despite these issues, Trafford Labour has shown no willingness to make the difficult decisions needed to fix the situation and avoid potential bankruptcy.\nIn response, Trafford Conservatives drafted a responsible alternative budget that addresses these financial challenges head-on. Unlike Labour’s plan, the Conservative proposals are focused on cutting waste, improving essential services, and ensuring better value for money for Trafford residents.\n“We had put forward a clear and sensible plan for the budget but it never made the light of day. What they are currently seeing from Labour is record-breaking Council Tax increases and worsening services across the board,” said Cllr Evans.\nThe Trafford Conservatives remain committed to standing up for residents and holding Trafford Labour to account for their failures.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_claim-wages-through-coronavirus-job-retention-scheme/content_12.html": "Claim for 80% of your employee’s wages plus any employer National Insurance and pension contributions, if you have put them on furlough because of coronavirus (COVID-19).\nBefore you start\nYou’ll need to:\nWhat you’ll need\nTo make a claim, you will need:\n- to be registered for PAYE online\n- your UK bank account number and sort code\n- your employer PAYE scheme reference number\n- the number of employees being furloughed\n- each employee’s National Insurance number\n- each employee’s payroll or employee number (optional)\n- the start date and end date of the claim\n- the full amount you’re claiming for including employer National Insurance contributions and employer minimum pension contributions\n- your phone number\n- contact name\nYou also need to provide either:\n- your name (or the employer’s name if you’re an agent)\n- your Corporation Tax unique taxpayer reference\n- your Self Assessment unique taxpayer reference\n- your company registration number\nIf you use an agent who is authorised to act for you for PAYE purposes, they will be able to make a claim on your behalf. If you use a file only agent (who files your RTI return but doesn’t act for you on any other matters) they won’t be authorised to make a claim for you and you will need to make the claim yourself. Your file only agent can assist you in obtaining the information you need to claim (which is listed above). We are making the claim process as straightforward as possible.\nIf an agent makes a claim on your behalf you will need to tell them which bank account you would like the grant to be paid into.\nIf you’re putting more than 100 employees on furlough\nIf you’re claiming for more than 100 furloughed employees, you’ll need to upload a file containing each employee’s:\n- full name\n- National Insurance number\n- payroll number (optional)\n- furlough start date\n- furlough end date (if known)\n- full amount claimed\nThe format of the file you upload must be either:\n- .xls\n- .xlsx\n- .csv\n- .ods\nHow to claim\nYou’ll need the Government Gateway user ID and password you got when you registered for PAYE online.\nOnline services may be slow during busy times. Check if there are any problems with this service.\nAfter you’ve claimed\nOnce you’ve claimed, you’ll get a claim reference number. HMRC will then check that your claim is correct and pay the claim amount by Bacs into your bank account within 6 working days.\nYou must:\n- keep a copy of all records, including:\n- the amount claimed and claim period for each employee\n- the claim reference number for your records\n- your calculations in case HMRC need more information about your claim\n- tell your employees that you have made a claim and that they do not need to take any more action\n- pay your employee their wages, if you have not already\nContacting HMRC\nWe are receiving very high numbers of calls. Contacting HMRC unnecessarily puts our essential public services at risk during these challenging times.\nDo not contact HMRC unless it has been more than 10 working days since you made the claim and you have not received it in that time.\nContact HMRC about the Coronavirus Job Retention Scheme.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_cdn-cgi_l_email-protection/content_31.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_privacy/content_25.html": "This document outlines how Trafford Conservatives processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Trafford Conservatives\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Trafford Conservatives .\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Trafford Conservatives , or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Trafford Conservatives via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-labour-keeps-council-obsolete-green-belt-development-plan/content_66.html": "At the March 2023 Trafford Council meeting, Conservative councillors brought a motion to the Council meeting to request an immediate withdrawal of Trafford Council from the Greater Manchester Places for Everyone Plan. Places for Everyone is a joint long-term development plan of nine of the Greater Manchester districts. In Trafford, the Plan has two strategic development allocations sites at Timperley Wedge and at New Carrington.\nNew Carrington is a proposed allocation for 5,000 homes in total and includes the release of 169 hectares of Green Belt land. New Carrington is also proposed for 350,000 square metres of employment floorspace for industry and warehousing. Timperley Wedge is a proposed allocation for 2,500 homes in total including the release of 100 hectares of Green Belt land. Timperley Wedge is also proposed for 60,000 square metres for employment land in total.\nThe motion brought to the Council meeting by Cllr. Dylan Butt and Cllr. Rob Duncan stated that as the Secretary of State for Levelling Up, Housing and Communities had recently said that as it will be the responsibility of local authorities to determine how many homes can be built, Places for Everyone is unnecessary. In addition, the motion requested that Trafford Council withdraw from the plan; that housing need should be determined in consultation with the community with a reinforced brownfield-first approach and that Timperley Wedge and New Carrington should not be included as development sites in a future Local Plan. The ruling Labour Group on the council however voted against the motion and the council will remain in the Places for Everyone plan.\nCommenting on the vote, Cllr. Dylan Butt, local government election candidate for Hale Barns and Timperley South ward said “Labour’s plan to build on Timperley Wedge will see the release of Green Belt land between Timperley and Hale and will reduce resident’s access to green, open space and will reduce physical activity opportunities at a time when the Labour administration are claiming that they are addressing the climate emergency and reducing health inequalities. Following the Secretary of State’s announcements, Places for Everyone is no longer required and the council should instead be making a public commitment to protect the borough’s precious Green Belt.”\nCllr. Rob Duncan local government election candidate for Manor ward added “Labour’s decision to reject the Conservative Group motion to protect Green Belt land will see the destruction of carbon capturing wetland moss and decimate wildlife at Carrington Moss.\n“Although Trafford Council remains part of the Places for Everyone submission the council currently has no adopted Local Plan. As such the housing need calculation made within Places for Everyone is now obsolete and not in line with national guidance. It’s very regrettable that Labour has chosen to remain in a flawed plan which will decimate 269 hectares of precious Green Belt land in Trafford.”",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_have-you-returned-your-postal-vote/content_54.html": "Tweet Let us know you've voted below Postal Vote Current Postal Voting Get involved Your details Leave this field blank Have you returned your postal vote? Yes No",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_nathan-evans-0/content_48.html": "Hale Barns and Timperley South Councillor\nLeader of the Conservative Group and Shadow Executive Member for Economy & Regeneration\nConservative councillor for Hale Barns and Timperley South Ward\nContact information\nCorrespondence address:\nTrafford Town Hall\nTalbot Road\nStretford\nManchester\nM32 0TH\nEmail: [email protected]\nMobile: 07976 379448\nCommittee appointments",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-newsletter/content_38.html": "I am delighted to introduce this year's Spring Newsletter for Trafford Conservatives and the work we are undertaking for our residents.\nThis Spring issue includes articles on moving forward and the focus on the North and the Northern Powerhouse and the part that Trafford residents must have in that . On both national policy and local opportunities.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_bowdon-vale-post-office/content_55.html": "The Co-Op in Bowdon Vale is set to close its post office counter in February 2025.\nMany local residents have reached out to us to express their profound disappointment with the closure.\nThe closure will mean there will be no post-office in Bowdon, and residents will need to travel to either Hale or Altrincham.\nYour local Conservative Councillors Phil Eckersley, Lisa Hancock and Shengke Zhi oppose the closure and are campaigning to keep it open for residents to use.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-conservatives-call-free-short-stay-parking-help-our-high-streets/content_11.html": "Trafford Conservatives call for free, short stay parking to help our high streets\nWith the news that Trafford Council is to receive Government funding to prepare for the safe opening of high streets and other retail spaces, Trafford Conservatives are calling on the Labour administration at the Council to kick-start the Trafford economy by offering free, short stay parking in the borough.\nParking for 2 hours in a council car park in Trafford is a disincentive for residents when they can park for free at other locations in the borough. By offering free, short stay parking, Trafford Conservatives believe that visitors will be encouraged to return to towns and district centres.\nCllr. Dave Morgan, Shadow Executive Member at Trafford Council for Housing and Regeneration said “We all know how valuable our high streets are and how vital they will be to getting Trafford back up and running. With the Council to receive Government funding to support a range of safety measures that will help local businesses get back on track, now is an ideal time to review car parking charges in our towns as we move into preparing for the reopening of non-essential retail.\n“Councillors are regularly contacted by residents who are frustrated with Council parking charges when they can park for free in some non-council operated car parks. To level up and support our high streets, Conservatives are calling for this small change which would be funded by government grants and would boost Council income in the long-term through helping to retain rate paying businesses in our town centres.\n“As part of Trafford Conservatives campaign to support out town centres, there is also a short survey that residents can complete to share their views on parking in the borough. The survey can be accessed at https://www.traffordconservatives.com/news/trafford-conservatives-call-free-short-stay-parking-help-our-high-streets “",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_archived-campaigns/content_47.html": "Dr Shengke Zhi would like to hear your views on the Council's budget proposals and overall performance Dr Shengke Zhi would like to help deliver a better plan for Altrincham and focus on your priorities. Please take a few minutes to complete the survey, Shengke...\nSave Crossford Bridge Playing Fields Sale Sharks have broadcast they want to come home to Sale. Their proposed move is to Crossford Bridge Playing fields. This move came out of the blue to many...\nHave your say on the future of Timperley Wedge and Carrington Moss! The Labour leadership in Trafford have overseen a bitterly disappointing redraft of the GMSF. After making many promises not to in the last election campaign...",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_labours-green-bin-tax/content_50.html": "TRAFFORD LABOUR’S £50 GARDEN WASTE FEE SPARKS OUTRAGE\nLabour-run Trafford Council is facing a backlash over its decision to charge local residents £50 to have their green bin emptied. A reduction is available if you can pay on-line, if you’re not confident with a computer or don't have access to the internet or use a smart/mobile phone, you’ll end up paying more - we think this is unfair.\nThe move, which has ignited fierce criticism from residents and Conservative Councillors alike, adds yet another unfair financial burden on households, especially vulnerable groups.\nLocal residents have voiced concerns that the introduction of the green bin levy could lead to an increase in fly-tipping and garden waste burning, with many arguing that the fee unfairly targets those on fixed incomes, older residents and those with gardens.\nTrafford's Conservative Councillors are concerned that Labour is for the seventh year running, planning to increase Council Tax and this time it's by 7.49%. Add to that the Mayoral precept, all this will see hundreds of pounds added to our council tax bill at a time when folk are already worried about their heating bills. With Labour's decision to remove the £300 Winter Fuel Allowance for thousands of pensioners, it seems that Labour's idea of \"vote for change\" is to make residents pay more for less.\nGive us your views, fill in the survey:",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_michael-taylor/content_28.html": "Hale Barns and Timperley South Councillor\nShadow Executive Member for Leisure, Arts, Culture & Heritage\nMichael Taylor Councillor for Hale Barns and Timperley South\nTerm 10/06/2023\nContact information\nCorrespondence address:\nTrafford Town Hall\nTalbot Road\nStretford\nManchester\nM32 0TH\nEmail: [email protected]\nMobile: 07974 044751",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_say-no-migrant-hotels-our-area/content_69.html": "Altrincham and Sale West to house 296 Male Asylum Seekers.\nAs your local Conservative Councillors, we believe this practice is unacceptable and must be addressed urgently. Be it in Altrincham and Sale or any other areas in Trafford.\nThe impact of this situation on our community cannot be overstated. In the case of the Cresta Court, Altrincham has worked hard to rebuild its reputation as a vibrant town, recently being awarded, \"Best British High Street\", from the dark old days in 2010 of it being a Ghost Town when 30% of the shop units where boarded up.\nLabours' current use of hotels for asylum seekers undermines the crucial role these establishments play in supporting our local tourism industry and economy and breaks their own manifesto promise.\nWe are also aware of growing safety concerns within the community. Many residents feel uneasy about the implications of housing asylum seekers in Altrincham's hotels, so close to our schools, we must prioritise the well-being of our constituents. A fact that seems to be lost on our Green Councillors and our Labour MP and council.\nFurthermore, we are alarmed by the lack of a coherent plan from the Labour Party and the Green Party who seem content to allow this imposition without objection and appear to be more concerned about the new hotel guests than the residents we are elected to represent. Their position seems to be, to impose with no consultation, regardless of the significant challenges we face from their decisions.\nTo demonstrate local concern, we are launching a petition to address the use of any further of Trafford's hotels for this purpose and demand the council push for the urgent closure of this facility and return it to support our town. We encourage all residents to add their names and share their thoughts with us, so we can present a unified voice to the Government and our MP, who has been notably absent in this discussion.\nYour support in this matter is crucial. Together, we can advocate for a solution that respects the needs of our community while addressing the broader issues at hand.\nThank you for your attention to this important matter. we look forward to your support.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_trafford-pothole-patrol/content_71.html": "Is Trafford Labour's Pothole Crisis Affecting You?\nTired of potholes, neglected roads, and blocked gullies? Fed up with cycle lanes taking priority over essential maintenance?\nWe hear you! Report your issue here, and we’ll fight to get it sorted. Let’s ensure the Council knows your concerns.\nSee it? Report it! We’re on your side.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_trafford-labours-749-council-tax-fiasco/content_5.html": "Trafford Labour have mismanaged our council into financial ruin, and now they’re making you pay for it. Instead of being honest with residents, they’ve gone behind closed doors to strike a deal with Angela Rayner—making Trafford one of just six councils imposing a massive 7.49% council tax hike this May.\nThat means adding hundreds of pounds more on your bill, without even giving you a say. Labour should have held a referendum, but instead, they chose secrecy. Worse still, they’re borrowing just to cover daily expenses, digging us deeper into debt. Enough is enough—it’s time to hold them accountable.\nNow, they’re blaming their failures on the Labour Government’s National Insurance increase, claiming it has cost them millions. But why should you carry the cost of Labour’s incompetence?\nAnd let’s not forget—just 18 months ago, Labour, Greens, and Lib Dems awarded themselves a 40% pay rise, with Green councillors saying it wasn’t enough!\nWe have sent a letter to Trafford Labour Leader Cllr Tom Ross, demanding his resignation. No leader should remain in post after overseeing such financial chaos.\nLet us have your views, so we can hold Trafford Labour to account, fill in our survey.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_more-crossings-trafford/content_44.html": "Trafford Council have been looking for a traffic warden / lollipop attendant which they had not managed to fill for over 18 months.\nThis traffic warden was for the junction at Harboro Road / Moss Lane.\nCouncillor Rob Duncan wrote to the Deputy Chief Executive Sara Saleh for a further update.\nThe link to the job is not live anymore so no further applications can be taken- but Trafford Conservatives understand that the role has not yet been filled.\nIn the interim, Councillor Rob Duncan has launched a campaign for a crossing at Harboro Road / Moss Lane.\nTo see his video on this, please visit: https://www.facebook.com/video.php/?video_id=508665208227708\nTrafford Conservatives would like to see more crossings in the borough, in general, as pedestrian safety (especially of school children) is of paramount importance.\nWe would very much like to hear the views of the residents of Trafford borough, so if you could please fill out our survey we would very much appreciate hearing from you.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_feed/content_56.html": null,
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_labours-proposal-axe-school-crossing-patrols-across-trafford/content_41.html": "Labour’s proposal to cut funding for school crossing patrols in Trafford, aiming to save £100,000 money, which could be used to protect children. But instead been squandered on unnecessary projects such as cones along the A56 and Labour giving themselves (index linked) 40% pay rise. Many are questioning why the safety of children seems less important than lining the pockets of politicians.\nFormer Broadheath ward councillor Dr. Kaushik Chakraborty has long campaigned for improved pedestrian crossings at the dangerous junction of the A56 and Sinderland Road. Despite his persistent efforts, the Labour-led council has failed to take action. Dr. Chakraborty says, \"What guarantees do we have that these crossings will ever go ahead?\"\nIn response to the proposed cuts, Cllr Nathan Evans, leader of the Trafford Conservative group, is demanding that the council prioritise children’s safety. He says, “We are calling on Labour to put their money where their mouth is—install the Pelican, Puffin, and Toucan crossings first, before considering axing the school crossing patrols.”\nResidents are being urged to have their say on Labour's plans to reduce children’s safety and potentially eliminate school crossing patrols from the borough. Have your say below",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_type_Borough-Councillors/content_51.html": "Nathan Evans Hale Barns and Timperley South Councillor Leader of the Conservative Group and Shadow Executive Member for Economy & Regeneration Borough Councillors\nDylan Butt Hale Barns ward councillor Deputy Leader of the Conservative Group / Shadow Executive Member for Finance, Change and Governance / Chair of Health Scrutiny Committee Borough Councillors\nRob Duncan Manor ward councillor Shadow Executive Member for Housing & Advice / Vice-Chair of Children and Young People's Scrutiny Committee Borough Councillors\nJohn Holden Manor ward councillor Shadow Executive Member for Highways, Environmental and Traded Services / Opposition Spokesperson for Licensing Committee Borough Councillors\nDr Shengke Zhi Bowdon ward councillor Shadow Executive Member for Climate Change / Vice-Chair of Standards Committee Borough Councillors",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_join/content_14.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_stay-updated/content_45.html": "Tweet Stay updated with news from your area by filling in the form below Stay Updated Current Your details Get involved Leave this field blank First name Last name Email Mobile number Postcode Address ID Address Parliamentary constituency Admin county Admin district CED Admin ward Parish I would like to be kept up-to-date by the Conservatives on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_save-crossford-bridge-playing-fields/content_63.html": "Sale Sharks have broadcast they want to come home to Sale. Their proposed move is to Crossford Bridge Playing fields. This move came out of the blue to many including the clubs that are already on the site. The site is well used and home to Sale United United Football Club, Sale Harriers and Old Alts ,which together enjoys memberships of over 1.1k children, 200 volunteer coaches, 12 schools and is also used by over 2000 children every week.\nRob Duncan Conservative Candidate for Priory Ward who is working with the clubs says: \"On top of the clubs that play on Crossford bridge playing field, there is the long history and love the community have for the green space. The site is Green Belt, used by dog walkers, families and known for its wildlife. All this will be affected if this goes ahead, add this to the planned infrastructure, buildings and match day traffic\".\nSale Sharks are proposing to build a 12,000 + capacity stadium.\n\"It's clear that much of the present green space will be taken up with car parking, an issue that is suffered by Sale Sharks at their present stadium. One can only imagine the increase in cars, coaches, litter, noise and pollution that will come hand in hand with this proposal and blight the lives of the residents\"\nRob says: \"The clubs are not seeking to halt the return of Sale Sharks to Sale but that the Save Crossford Bridge campaigners are seeking for meaningful consultation with all interested parties to find an alternative site which will be mutually beneficial to both local communities and Sale Sharks\"",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_events_feed/content_53.html": null,
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_about-us/content_9.html": "We're Trafford Conservatives Councillors, covering all of Trafford.\nThe proudest achievement of the Trafford Conservative Team has been the support and relentless fight we have undertaken to maintain Trafford’s outstanding education system.\nConservatives Support a diverse range of education, by standing up for choice.\nOne of the main reasons people tell us that they move to Trafford is for our Schools, Trafford is recognised as one of the best boroughs in the country for education.\nWe believe that investment in our early year’s benefits everyone.\nTrafford Conservatives have fought to keep -\nAcademies, Faith schools, Grammar schools, private schools, free schools - a diversity of academic choices.\nThe Labour, Liberal Democrats and Green Party seek to dismantle our educational choices here in Trafford, taking it back to the 1970's with one school fits all mentality - It didn't work then and it won't work now.\nTrafford Conservatives will seek to:-\n- Stop the CAZ\n- Keep Council Tax low\n- Protect our schools and build a new one\n- Deliver more Bobbies on the Beat on the streets of Trafford\n- Bring in weekly grey bin collections\n- Deliver outstanding Social Care\n- Protect the Green belt with a building strategy focusing on brown field sites and a Local Plan\n- Work with business to make Trafford the go to place to start or grow a business\n- Develop a Tech Corridor in Trafford that focus on innovation and media\n- Make Trafford a borough of sporting excellence working with our sporting legends\n- Reduce the use of plastic in the borough and focus on a recycling strategy\n- Lead on reducing air pollution with Green incentive schemes such as Electric Vehicle Charging Points throughout the borough free to use for 2 years to incentive people to move to electric vehicles and an “Every Spare Space” tree planting scheme\n- Fill the potholes and Fix the pavements\n- Invest in a long term meaningful cycling strategy working with our schools\n- Produce a balanced budget\n- Offer free parking for 2 hours in council car parks across the borough, make parking 'free after 3pm' from November to January, to help our High Streets thrive.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-green-and-labour-councillors-vote-against-national-inquiry-despite-shocking-827-rise/content_40.html": "Your Conservative Councillors are demanding accountability after Green and Labour councillors in Trafford failed to support a Conservative-led motion calling for a national inquiry into child exploitation. This comes despite an alarming 827% increase in reported cases within Trafford, a statistic that has left many residents shocked and outraged.\nDuring the council meeting, Conservative councillors asked their colleagues whether they had reviewed the official report detailing the scale of cases in the borough. Despite no clear confirmation that they had even seen the report, Green and Labour councillors still voted against an inquiry, choosing silence over action.\n“This is not about politics; this is about protecting vulnerable children,” said Cllr Eckersley Deputy Leader of the Conservative Group \"With such a massive rise in reported cases, we need transparency, accountability, and action – not silence.”\nThe refusal to back a national inquiry raises serious concerns over the council’s commitment to addressing CSE and safeguarding children. The Trafford Conservative Councillors are calling on Trafford Labour and Greens to immediately reconsider its stance and for local MPs to step in and demand an urgent review.\nWe are now exploring additional measures, including:\n- Submitting a Freedom of Information (FOI) request to get further information.\nPressuring local and national media to highlight the council’s inaction.\n“We will not allow this issue to be ignored. Cllr Nathan, Leader of the Trafford Conservative group, believes, \"Every child in Trafford deserves to be safe, and every resident deserves to know that those in power are taking this crisis seriously.”",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_accessibility/content_15.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_proposals-islamic-centre-and-mosque-masjid-thorley-lane/content_24.html": "As your local Councillors, we would like to inform you about an important development.\nWe have recently learned that the Altrincham and Hale Muslim Association (AHMA) is in discussions with Trafford Council regarding the construction of an Islamic Centre and Mosque (Masjid) on Thorley Lane, opposite the World of Water/Pets site. The proposed mosque is planned to accommodate up to 1,800 people and will be 2.5 storeys high, including a rooftop terrace and 94 parking spaces.\nWe believe it is essential to keep you informed about any new proposals that could impact our area. More importantly, we want to hear your thoughts and opinions on this matter so we can effectively represent the views of our community, especially if the proposal progresses to the planning stage.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_altrincham-and-sale-west/content_37.html": "Trafford Conservatives is the combined voice of all of the councillors spread over the three constituencies that make up our borough. If you have any questions please feel free to contact us and we will put you in touch with the relevant person or association email [email protected]\nWe have vacancies in some of our wards and are looking to welcome new candidates. If you are interested in getting involved in our \"make a difference where you live politics\" then please contact us.\nIf you wish to contact the ASWCA office please see below\n1st Floor, Kennedy House, 31 Stamford Street, Altrincham WA14 1ES\nTel: 0161 904 8828\nE-mail: [email protected]",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_saturday-7th-december-small-business-saturday/content_33.html": "Saturday the 7th of December is Small business Saturday\nYour Conservative councillors asked for free parking over the festive season to support our high streets, jobs, and wellbeing.\nTrafford Labour said NO\nLabour doesn't understand business rates prop up council coffers.\nThriving businesses pay money back into the system.\n#shoplocal FSB Greater Manchester Small Business Saturday UK Conservative Councillors' Association",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_about-rss/content_16.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-receive-extra-ps2269790-support-local-care-homes-through-coronavirus-pandemic/content_59.html": "The Government has announced that Trafford is to receive a share of a £600 million Infection Control Fund, launched to reduce the transmission of coronavirus on care homes.\nTrafford will receive £2,269,790 to support local care homes. There are currently 1746 care home beds registered in the borough.\nThe funding will be used ensure that care homes can continue their efforts to halt the spread of coronavirus by helping them cover the costs of implementing measures to reduce transmission. This includes:\n- Rolling out training on infection control for staff\n- Reducing transmission by supporting providers to reduce workforce movements\n- Stepping up NHS clinical support to care homes\nThe fund comes on top of £3.2 billion that has already been made available to local authorities to support key public services, including social care, since the start of the crisis. It forms part of a wider package of support the Government is making available to care homes, which includes ensuring all care homes have they support they need with staffing and accessing PPE, and providing a named clinical contact from the NHS for every single care home. The named contact will assist care homes with weekly check-ins to review patients while helping staff with the use of equipment and medication.\nThe Government has also rolled out a new wellbeing package for social care staff, including two new helplines, led by the Samaritans and Hospice UK, to support care staff with their mental health and welling.\nCommenting, Cllr. John Holden, Shadow Executive Member for Adult Social Care at Trafford Council said:\n“Care staff are the heroes of this pandemic – working tirelessly to support those in our community who need it the most.\n“I do not underestimate how challenging a time this is for people living and working in care. This new funding will make a real different to local care homes in Trafford.\n“By putting in place stronger prevention, we can ensure that we continue to drive coronavirus out of our care homes, making them safer and better able to look after people who need it the most.”\nHealth Secretary Matt Hancock said:\n“This £600 million Infection Control Fund will help as we continue to reduce infections in care homes and save lives.\n“From the very start of this outbreak, we have been working to protect our brilliant social care workforce and the most vulnerable in our society.\n“Our package sets out clearly the extra steps local councils and care homes should be taking as we stamp out the spread of this virus.”\nCommunities Secretary Robert Jenrick said:\n“We have already provided councils with over £3.2 billion during this pandemic so that they can respond to the immediate pressures they are facing, including supporting social care.\n“This new funding will be distributed to councils based on the number of care home beds in their area and will be passed on quickly to care providers. It will fund new measures to reduce the transmission of coronavirus in care homes, minimise infection, keep staff and residents safe and, ultimately, save lives.”",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_cllr-john-holden-urges-trafford-residents-protect-themselves-uk-reaches-historic-milestone-10/content_22.html": "- More than 10 million people across the UK - including 1,126,027 in the North West - have now received a COVID-19 booster or third jab to protect themselves and their loved ones this winter.\n- Cllr. John Holden is calling for vulnerable people in Trafford who have not yet come forward to do so as soon as possible to help build our wall of defence and keep people safe over the winter months.\n- The Conservative Government is making it easier than ever to get topped-up by allowing people to book their appointments five months after their second dose from Monday and making booster jabs available at walk-in centres without appointments.\nCllr. John Holden, Shadow Executive Member at Trafford Council for Health, Well-being and Equalities has welcomed the news that 1,126,027 people in the North West have received their COVID-19 booster or third jab as the Conservative government continues to step up efforts to ensure that vulnerable people are fully protected against COVID-19 over the winter.\nThe latest figures show that more than 10 million people across the UK have received their COVID-19 booster or third jabs, ensuring the vital protection they have secured from their first two doses is maintained over the winter months.\nA total of 10,062,704 people have received their booster and third jabs in the UK. 45,836,791 people have had two doses (79.7%) and 50,234,416 people have received one dose (87.4%).\nSeven in 10 over 80s and three in five over-50s in England are already vaccinated with top-up jabs.\nNHS England will be inviting another three million people who will become eligible for their booster next week. More than 13 million invites, including texts, letters and emails, have already been sent to eligible people in England so far asking them to book their booster online through the National Booking Service. The additional letters due to land next week will mean around 16 million invites have been sent in England since the NHS booster programme began.\nThe National Booking Service was updated on Monday 8 November to allow those eligible for a booster vaccine - people over 50 and those most at risk of COVID-19 - to pre-book their jab five months after their second dose.\nPeople will still receive their vaccine six months after their second dose, but the change will speed up the vaccination programme by allowing people to receive a jab the day they become eligible, rather than waiting for a convenient appointment.\nPeople will also be able to book by calling 119 and can get vaccinated at hundreds of walk-in sites across the country six months after their second dose without an appointment. Those eligible can use the NHS online walk-in finder to locate the most convenient site.\nCOVID-19 booster vaccines have been delivered or booked in at every older adult care home in England where safe to do so, with almost nine in 10 care homes already visited.\nCommenting, Cllr. Holden said:\n“It is absolutely fantastic news that 1,126,027 people in the North West have received a booster dose or third vaccination, which will offer life-saving protection to them and their loved ones this winter.\n“Those people, including everyone who has got their third jab in Trafford are part of the ten million people across the country who have already received a booster jab. I would urge anyone who is eligible and hasn’t yet come forward to get a booster jab as soon as possible, by booking online or at one of our local walk-in sites.\nWe can all do our bit this winter to protect our loved ones and the NHS, and to stay ahead in the race against the virus, by taking up the offer of a vaccine as soon as we are eligible”\nCommenting, Health Secretary Sajid Javid said:\n“More than 10 million people across the UK now have the vital protection boosters provide, building our wall of defence and keeping people safe over the winter months. We know immunity begins to wane after six months, particularly for the elderly and at-risk groups, and booster jabs will ensure our most vulnerable are protected over the winter.\n“It’s never been easier to get your top-up jabs now that those eligible can book in advance or visit hundreds of walk-in sites across the country.\n“Please do not delay - get your vaccines as soon as you can to protect yourself and your loved ones this winter so we can keep the virus at bay.”",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_Join/content_17.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_people-power-removed-labour-trafford-council/content_60.html": "Trafford Conservatives are distraught to learn that the Labour administration is seeking to remove the power to petition the local Council in public, along with a series of other changes to Trafford’s constitution that will make scrutiny of the administration much more difficult.\nThe most concerning of these changes is the attempt to move the hearing of petitions from full Council meetings to Executive meetings, which even then will only be heard at Executive at the discretion of the Executive. Trafford Conservatives wonder whether inaction over previous petitions is part of the reason for this change.\nSome of you may also remember the Liberal Democrat supported petition, in November of last year, to introduce a pedestrian crossing on Park Road in the vicinity of the Heyes Lane and Stoney Bridge Lane junction in Timperley. This was a petition that was fully supported by Trafford Conservatives, and we note the Council is quick to take action on issues affecting the north of the borough but slow to take action on issues affecting the south of the borough. To date, no action has been taken to introduce a pedestrian crossing. (see point 36 at: Agenda for Council on Wednesday, 22nd November, 2023, 7.00 pm (trafford.gov.uk))\nTrafford Conservatives wonder whether the Labour administration is now reducing the people power of petitions at full Council to avoid the scrutiny of the public on issues that directly affect and matter to residents. This is concerning as the chain of the events that has led to the suggestion of these constitutional changes arose out of Trafford Conservative’s desire to ensure Trafford Council focused on local issues directly affecting residents.\nOn Wednesday the 20th of March of this year, some may remember that the Conservative Party Group put forward a motion asking the Council to limit the scope of Council motions to focus on local issues. This motion was then amended to set up a Constitutional Working Group. The recommendations of the Constitutional Working Group will undoubtedly make scrutiny of the Labour Council much more difficult. Some of these recommendations include:\n- Petitions will not be read at full Council meetings but will instead by heard by the Executive at Executive meetings.\n- Questions are going to be limited to two questions per party group.\n- A time-limit of ten minutes per Council meeting will be allotted to questions as a whole.\n- Questions will not be read out in full at Council, instead only supplementary questions will be read out at Council meetings.\n- The number of motions at Councils is going to be limited to one motion per opposition group.\n- The total number of motions per Council meeting will be limited to 5 motions.\nThese changes to the constitution of Trafford Council are going to make it much more difficult for opposition party groups (The Conservative Party Group, The Liberal Democrat Group, and the Green Party Group) to scrutinise the actions of the Labour administration. Astonishingly, the entire point of the Conservative motion, to ensure motions are relevant to local resident’s issues, has been discarded- and the Constitutional Working Group has instead been used to limit the ability for opposition groups and members of the public to scrutinise the administration. The Conservative Party Group intends to pressure Trafford Council to consider the serious damage these changes would do to the ability to scrutinise administrations.\nThe report is public and can be read online at:\nTrafford Conservatives encourages all interested members of the public to read the recommendations in this public report.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_category_Local-News/content_27.html": "TRAFFORD CONSERVATIVES CRITICISE LABOUR BUDGET AS COUNCIL TAX SOARS 15th March 2025 Trafford Council passed its budget on M onday, 5th March, with Trafford Conservatives voting against the proposals. The budget raises serious concerns... Local News\nNew Defibrilator Installed at Sale West Community Centre 7th February 2025 Trafford Conservatives were delighted to see a new defibrillator installed at Sale West Community Centre after community efforts and funds were provided by BRSK... Local News\nTrafford Green and Labour Councillors Vote Against a National Inquiry Despite Shocking 827% Rise in Child Exploitation Cases in Trafford. 30th January 2025 Your Conservative Councillors are demanding accountability after Green and Labour councillors in Trafford failed to support a Conservative-led motion calling... Local News\nTrafford Conservatives Raise Alarm Over Rising Cases of Child Sexual Exploitation in Trafford 30th January 2025 Trafford Conservatives Raise Alarm Over Rising Cases of Child Sexual Exploitation in Trafford Trafford - In light of the ongoing national conversation about... Local News\nLabour Propose to Axe School Crossing Patrols in Trafford 13th December 2024 Labour's proposal to cut funding for school crossing patrols in Trafford has sparked concerns among local communities, with residents warning that these vital... Local News\nMayor Burnham to investigate Altrincham Minor Injuries Unit 5th December 2024 Trafford Conservatives have been running a long-standing campaign on the closure of Altrincham Minor Injuries Unit and note that the closure of Altrincham Minor... Local News\nSaturday the 7th of December is Small business Saturday 3rd December 2024 Saturday the 7th of December is Small business Saturday Your Conservative councillors asked for free parking over the festive season to support our high streets... Local News\nLABOUR'S HATED GREEN BIN TAX PROPOSAL 18th November 2024 TRAFFORD LABOUR'S £45 GARDEN WASTE PROPOSAL SPARKS OUTRAGE AMONG LOCAL RESIDENTS AND OPPOSITION COUNCILLORS Trafford’s Labour-run Council are proposal to... Local News\nGroup Leader Councillor Evans writes to Council Leader Councillor Ross 23rd October 2024 Conservative Group Leader, Councillor Nathan Evans, has formally written to the Leader of the Council, Councillor Ross, to complain about the abhorrent remarks... Local News",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_GMSF/content_72.html": "The Labour leadership in Trafford have overseen a bitterly disappointing redraft of the GMSF. After making many promises not to in the last election campaign, Trafford Labour are still proposing to release vast swathes of green belt - more than any other council in Greater Manchester.\nTrafford Conservative Councillors feel that Andrew Western, the leader of Trafford backed by the Liberal Democrats & Greens, have dealt a bitter blow to the South of the Borough and are amazed it has led to this disaster. There is still time to stop this attack that will transform Ashton Upon Mersey, Timperley, Hale Barns, Hale, Altrincham with the arrival of up to 9,000 new residents. All this as an easy way to boost council tax revenue at the expense of the character and charm of our beloved area.\nIn Bolton and Stockport - where the Labour Party do not have overall control of the Council, more progress has been made in reducing green belt take, for example in Bolton not a single acre is being released for residential development. It is clear that where the Labour Party have overall control, they are imposing their plans to build on green belt and providing nothing but vague promises on new transport links.\nNearly two years on from the original draft - the Labour Mayor and Labour Council have failed to listen to the concerns people raised first time round and until they do, these plans cannot be supported and the Conservatives will oppose.\nHave your say by completing the survey below!",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_wythenshawe-and-sale-east/content_13.html": "Trafford Conservatives is the combined voice of all of the councillors.\nIf you have any specific issues or questions for Wythenshawe and Sale East area please feel free to contact them on [email protected] or visit their website at https://www.wseconservatives.org.uk/",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_get-involved/content_36.html": "Become a member today and pledge your support for the Conservative Party locally and nationally.\nhttps://www.conservatives.com/join\nBy becoming a member you will be financially supporting the party in its campaigns around Trafford, helping us to take back control of the council.\nIf you would like to assist further and campaign for the Conservatives here in Trafford, please contact your respective Constituency / Ward office on the ‘Contact Us’ page.We’re looking for people who want to speak up for their local community, who can make a difference to our Borough and who want the Conservatives to win.\nBecoming a councillor\nWe’re looking for people who want to speak up for their local community, who can make a difference to our Borough.\nIf you’d like to know more about becoming a Conservative Candidate for the next Council elections in May 2022\nclick here https://www.local.gov.uk/be-councillor\nhttps://public.conservatives.com/static/documents/General_Terms_and_Con…",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_labours-hated-green-bin-tax-proposal/content_23.html": "TRAFFORD LABOUR'S £45 GARDEN WASTE PROPOSAL SPARKS OUTRAGE AMONG LOCAL RESIDENTS AND OPPOSITION COUNCILLORS\nTrafford’s Labour-run Council are proposal to introduce a £45 annual fee for the collection of garden waste has sparked significant backlash from opposition councillors and local residents, who have branded the plan a TAX and an unfair financial burden, particularly on vulnerable groups. This on top of labour removing the Winter Fuel Allowance for pensioners, and adding an additional £100.00 on to your average council tax bill is one step too far.\nThe new fee would apply only to households that \"opt in\" for garden waste collection, with an additional charge for residents who are unable to pay online of £5.00.\n“A Tax on the Poor and Vulnerable”\nCllr John Holden, Manor ward councillor and Shadow Executive Member for Highways, Environmental and Traded Services / Vice-Chair of Scrutiny Committee said, I strongly condemned the proposal, describing the fee as a “punishment” for residents with gardens, including those in social housing. He also expressed concern that the £45 charge would disproportionately affect lower-income families and vulnerable residents, calling it a “tax on the poor and vulnerable.”\n“I object to this proposal, especially the additional £5 charge for those who can’t pay online. This move unfairly targets pensioners and those who are least able to pay, many of whom are already struggling with the cost of living,” Cllr Holden said. “The council is going after the most vulnerable in our society with this measure, and it’s ageism at its worst.”\nFly-tipping and Public Health Risks\nFurther criticism came from Cllr Rob Duncan, Conservative Councillor for Manor ward, who warned that the fee could lead to an increase in fly-tipping and the illegal burning of garden waste. He argued that this would create significant environmental and public health issues, exacerbating the very problems the council should be working to solve.\n“Introducing this charge risks driving up fly-tipping, which will have a damaging impact on our local environment and put additional strain on our already overstretched waste management services,” Cllr Duncan said.\nLocal Residents Speak Out\nLocal residents have expressed frustration over the proposed fee, with many arguing that it places an additional financial strain on households already struggling with rising living costs. Some have raised concerns about the fairness of the charge, particularly for those on fixed incomes or in vulnerable situations, such as pensioners.\n“I can’t afford this charge,” said one local resident. “I already pay my council tax, and now I have to pay more for something that should be a basic service. It feels like they’re just taking more from people who have the least.”\nUse the QR code or the link to send us your views https://www.traffordconservatives.com/campaigns/labours-green-bin-tax",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_altrincham-residents-survey/content_67.html": "Skip to main content\nTrafford\nConservatives\nMain navigation\nCampaigns\nPeople\nAbout us\nNews\nGet involved\nContact\nStay Updated\nTrafford\nConservatives\nAltrincham Residents Survey\nTweet\nAnswer below and tell us what you think will improve Altrincham!",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_cookies/content_20.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_new-defibrilator-installed-sale-west-community-centre/content_2.html": "Trafford Conservatives were delighted to see a new defibrillator installed at Sale West Community Centre after community efforts and funds were provided by BRSK.\nSome of us were proud to be able to attend the Grand Reveal of the new defibrillator at Sale West Community Centre.\nThis has come about after months of tireless campaigning by local residents and it is a joy to see these plans come to fruition.\nAidan Jackson's fundraising for community defibrillators has been working to fund defibrillators in the community. BRSK Broadband very generously provided the entire amount for the defibrillator for Sale West Community Centre. Aidan's campaign are still looking to fund further defibrillators in the community and their page can be found here:\nhttps://www.facebook.com/Aidansteddybearchallengefundraiser\nAlso in attendance was Ricky 'The Hitman' Hatton, who attended the boxing gym in Sale West Community Centre from the age of 11- going on to become a household name in boxing as a sport. It was a great pleasure to have Ricky Hatton in attendance for this event.\nAs Councillor Rob Duncan says - \"It was a great evening, with many in attendance and it was a joy to see this campaign finally come to fruition. Defibrillators are life-saving machines and seeing more of them in our community can only be a good thing. As local Councillors, when residents have issues that they care deeply about we are always open to helping them in any way that we can. It was very generous of BRSK Broadband to fund the defibrillator in full, and it was also great to see Ricky 'the Hitman' Hatton return to his old haunt for the grand reveal of the defibrillator installation.'",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns/content_39.html": "Proposals for an Islamic Centre and Mosque (Masjid) on Thorley Lane As your local Councillors, we would like to inform you about an important development. We have recently learned that the Altrincham and Hale Muslim Association...\nDunham and Warburton Buses Dunham and Warburton face a reduced bus service since the introduction of the new Bee Network. Better public transport is a top priority for our communities. At...\nTrafford Labour's 7.49% Council Tax Fiasco Trafford Labour have mismanaged our council into financial ruin, and now they’re making you pay for it. Instead of being honest with residents, they’ve gone...\nLabour's proposal to Axe School Crossing Patrols across Trafford Labour’s proposal to cut funding for school crossing patrols in Trafford, aiming to save £100,000 money, which could be used to protect children. But instead...\nLABOUR'S GREEN BIN TAX TRAFFORD LABOUR’S £50 GARDEN WASTE FEE SPARKS OUTRAGE Labour-run Trafford Council is facing a backlash over its decision to charge local residents £50 to have...\nSay NO to Migrant Hotels in our area Altrincham and Sale West to house 296 Male Asylum Seekers. As your local Conservative Councillors, we believe this practice is unacceptable and must be...\nBowdon Vale Post Office The Co-Op in Bowdon Vale is set to close its post office counter in February 2025. Many local residents have reached out to us to express their profound...\nTrafford Pothole Patrol Is Trafford Labour's Pothole Crisis Affecting You? Tired of potholes, neglected roads, and blocked gullies? Fed up with cycle lanes taking priority over...\nSave Altrincham Hospital - Labour don't care, we do. Despite millions of pounds being spent on our Minor Injuries Unit, including on the cutting-edge technology within, Trafford's Locality Board, who are...\nMore Crossings in Trafford Trafford Council have been looking for a traffic warden / lollipop attendant which they had not managed to fill for over 18 months. This traffic warden was for...\nHelp Lisa, Shengke and Phil to Protect the Jubilee Community Centre The Jubilee Community Centre is at risk, with the Council placing it on its disposal list and seeking buyers. Cllr Lisa Hancock, Bowdon ward councillor, is...",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_conservatives-encourage-young-people-trafford-apply-new-railcard/content_29.html": "Teachers can encourage their students to take advantage of a new railcard for 16 and 17 year olds, that is soon to be launched by the Conservative Government.\nMany young people rely on trains to get to school, college and work and Conservatives are determined to ensure that rail fares are affordable for young people and their parents across the country. The new railcard will guarantee 50 per cent off all rail travel until the cardholder reaches their 18th birthday. When introduced in September, the new railcard is expected to benefit up to 1.2 million young people.\nThe release of the railcard, in time for the new school year, follows the hugely successful launch of the 26-30 railcard earlier this year, when 11,000 cards were sold on the first day alone. Now all young adults, from the ages of 16 to 30, will benefit from cut-price fares, helping them with the cost of living.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_cllr-john-holden-calls-people-trafford-get-their-jab/content_35.html": "· Cllr. John Holden, Shadow Executive Member at Trafford Council for Health, Well-being and Equalities is supporting a huge national advertising campaign to encourage people to protect themselves and their loved ones from Covid-19 and flu this winter, and the NHS from additional winter pressures.\n· Major national companies including Boots, Lloyds Pharmacy and Asda have come together to join the Government in supporting the vaccination drive across the UK.\n· This year the Conservative Government is rolling out the biggest flu programme in the history of the UK with 35 million people eligible for a free flu vaccine.\nCllr. John Holden has welcomed a nationwide advertising blitz, which launches today, encouraging people to get their COVID-19 booster and flu jabs to protect themselves and their loved ones this winter.\nThe colder weather in the winter months favours transmission and experts have warned there could a significant flu surge and continuing or rising Covid-19 cases. That is why the Government is pushing the biggest winter vaccine campaign ever for Covid-19 and flu, including in Trafford so people can help protect not just themselves and their loved ones this winter and play their part in reducing pressure on the NHS.\nThe multimedia campaign will run on outdoor billboards, broadcast and community radio and TV to support the national vaccine drive.\nThe television advert hitting screens today asks people to “get vaccinated, get boosted, get protected”, and features Michelle, an NHS nurse, explaining the benefits of the flu jab and COVID-19 booster vaccine. The new television advert will be seen in primetime spots alongside Emmerdale and Coronation Street as well as daytime shows such as This Morning and Loose Women. Targeted digital channels will also carry the campaign adverts including social media platforms, digital radio and online video such as YouTube.\nVaccines provide the best possible protection against infection and serious disease and so it is vital people come forward for both Covid-19 jabs and flu vaccines. The Covid-19 booster programme was launched to prolong protection into winter, and for those aged 12 – 15 it is so important to come forward for a single dose to reduce transmission in schools and keep pupils in the classroom.\nThis year will see the country’s biggest flu programme in history with 35 million people eligible for a free vaccine. Starting this week, the country’s leading pharmacies have joined forces to encourage people to come forward and get their free flu vaccine and COVID-19 booster jab when eligible. Alongside independent pharmacists, Boots, Lloyds Pharmacy and Asda – who together have 5,000 pharmacies across the UK – have backed the call for people to get vaccinated for the best possible protection this winter.\nPeople will be invited for the COVID-19 booster jab when it’s their turn - if they have not been contacted within a week of reaching 6 months since their second jab they can call 119 or book online. Those who are eligible for a free flu vaccine can book an appointment through their GP surgery or local pharmacy.\nCommenting, Cllr. John Holden said:\n“Thanks to the people in Trafford who have come forward to get their jabs, we’ve been able to open up the country and make progress back towards normal life.\n“Over four million people across the country have already received a booster jab. I have already had my 3 Covid-19 jabs and the flu jab too. It is vital that each and every one of us continues to play our part – to protect our loved ones and the NHS, and to stay ahead in the race against the virus, by taking up the offer of a vaccine.\n“Through a renewed national effort to get jabbed against Covid-19 and flu, building on the biggest flu programme in history, we can continue saving lives by building up our protection against the virus ”.\nCommenting, Health Secretary Sajid Javid said:\n“Our vaccine programme is building a wall of defence across the country and our booster rollout is now well underway with more than 4 million jabs in arms.\n“As we go into winter, it is vital that eligible people get their booster jab and their flu jab to protect themselves, their loved ones and the NHS.\n“This is a national mission and I’m hugely grateful to the public, volunteers and NHS workers rolling out jabs. It is fantastic to see some of our biggest high street pharmacies give their backing to the winter vaccination programme.”",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_questions-trafford-council/content_21.html": "Today Trafford Council heads in to its first full Council meeting this evening under new constitutional rules.\nTrafford Conservatives oppose the new constitutional rules brought forward by the Labour led committee and spoke against these changes at the time:\nPeople Power Removed by Labour at Trafford Council | Trafford Conservatives\nNow these changes have taken full affect today for the first Council meeting where these new rules are applied. The Conservative Party Group has been allotted two questions to be answered in Council, hampering the ability of opposition to properly scrutinise the Labour run Council.\nThe prepared answers to these questions also leave much to be desired. We include these below:\nQuestion submitted by Councillor Zhi:\n“As the Bowdon Councillor representing the residents of Oldfield Brow, I am deeply concerned about the ongoing lack of action regarding road safety around Oldfield Brow School. At the Council meeting on 20th March, a petition was submitted and recognised requesting immediate safety measures for the area. Since then, despite the seriousness of the issue, no tangible action has been taken.\nOn 3 September, a car accident occurred on Taylor Road, close to the Oldfield Brow Primary School, necessitating the response of two first responder medical vehicles, an ambulance, and a police car. This incident highlights the urgency of addressing road safety concerns without further delay.\nWhile I acknowledge that Oldfield Brow is now on the waiting list for the School Streets programme, this alone is insufficient. The Council must take immediate steps to mitigate the risks before another incident occurs. I am asking the Council for a clear and decisive update on what specific actions will be taken, and when, to ensure the safety of residents, parents, children, and the wider community in Oldfield Brow?\"\nResponse:\nRoad safety is a widespread concern and the Council would like to do more to provide physical measures on our roads to address resident’s concerns. Historically the Council received significant government funding for widespread highway capital projects, but regrettably this is no longer the case.\nIn order to prioritise action the Council monitors collision and casualty data across Trafford to identify any patterns of collisions where interventions can be justified to improve road safety. The collision history for the whole area of Oldfield Brow, including Taylor Road, has been analysed and there are no recorded collisions involving personal injury recorded over the latest 5 year period for which data is available from Greater Manchester Police (2019 – 2023). This is no reason to be complacent but this data does not provide a demonstrable requirement to take urgent intervention action when taking into context the whole Borough.\nAs you might expect, owing to the size and age of the road network, the Council receives many requests to introduce highway improvements such as lower speed limits, traffic calming, new pedestrian crossings, better footways and cycleways etc.\n‘School Streets’ are being introduced as a means of addressing some safety concerns near schools. There is a growing demand for this type of treatment that restricts vehicular access to streets outside schools during opening and closing times. Owing to the number of schools that have shown interest in having a school street treatment there is priority list, and Oldfield Brow Primary School has been added to the list.\nIn the meantime, we have made an assessment of the existing provision of School warning signs and have identified where improvements can be undertaken. We anticipate carrying out the work in the next 2 – 3 months and will share detailed information with the school and local Members shortly.\nQuestion submitted by Councillor Evans:\n“New Forest District Council have announced this month that all Council run carparks will be free at weekends in the run up to Christmas. This is to encourage shopping in the local area, and to support small local businesses to thrive.\nIn previous years, several Greater Manchester Councils, including Trafford, have made parking free in council run car parks after 3pm, to support local businesses. Last year both Wigan and Salford announced their Free After Three schemes.\nWill Trafford Council be announcing a Free After Three scheme for Christmas this year?\"\nResponse:\nLike last year, we will not be announcing a ‘free after three’ parking scheme in the lead up to the holiday season. We do encourage visits to our high streets and centres, relaying the offer of public transport, active travel and the use of our car parks throughout the year. We’ll regularly review our parking tariffs to help ensure they’re attractive to our customers.\nOur parking charges contribute to the upkeep, maintenance, and operation of our car parks and nearby realm. Reducing / eliminating parking charges after 1500 would reduce our revenue and affect the quality of service we’re able to provide. The weeks leading up to the holiday season often sees an increase in visitors, offering free parking could worsen congestion for others. Additional costs relating to the administration and complexities with communicating the changes have also led to the decision.\nWe do offer year around free parking on a Sunday, to encourage visits to our centres – generally when there is more capacity to encourage visits. Regent Road car park is also available for shoppers who want to stay longer than 2 hours in Altrincham. Parking is also free after 5pm on street (in most places) and after 6pm in council car parks. Our website provides information on our locations and tariffs.\nThese responses from the Labour Party leave a lot to be desired. It seems they have plenty of resources to allocate time and money to ensure the safety of roads near schools in the north of Trafford borough, but when schools like Oldfield Brow Primary School require the same effort to ensure safety, Council resources are few and far between.\nAt a time when small local businesses would benefit from a boost, the long-standing Free-After-Three scheme that was routinely offered by Trafford Council when it was Conservative-led, appears to have been all but abandoned. Parking at the Trafford Centre, meanwhile, remains free benefitting the many big chains with outlets at The Trafford Centre. High streets in Sale, Altrincham, and elsewhere in Trafford borough, however, will not benefit from the same free parking those making trips to The Trafford Centre enjoy.\nTrafford Conservatives will continue to scrutinise the Labour-led Council wherever we are still allowed to do so. The ability to scrutinise Council narrows on a daily basis.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_labour-propose-axe-school-crossing-patrols-trafford/content_65.html": "Labour's proposal to cut funding for school crossing patrols in Trafford has sparked concerns among local communities, with residents warning that these vital services could be phased out, potentially replacing them with Pelican or Toucan Crossings. This plan, aimed at saving £100,000, has led to heated debates about the safety of children and the effectiveness of alternative measures.\nThe familiar figures of the \"Lollipop Men and Women\" who ensure the safe crossing of children at local schools may soon become a thing of the past. Labour’s proposal suggests the phased replacement of these patrols with automated crossings, such as pelican, puffin, and toucan crossings. While these crossings could offer some safety benefits, there are concerns about the human touch being lost in safeguarding young children, especially those who may need extra assistance.\nFormer Broadheath ward councillor, Kaushik Chakraborty, has long been advocating for improved pedestrian crossings at the dangerous junction of the A56 and Sinderland Road. Despite his efforts, the Labour-led council has failed to implement any solution, leaving local residents frustrated and worried about the ongoing risks to children’s safety. Conservative councillors argue that the Labour council’s focus on cuts rather than proactive safety measures is putting vulnerable road users at risk.\nAdditionally, Councillor Nathan Evans has expressed frustration with Labour's inability to fill crossing patrol vacancies. He highlighted that when a vacancy in Manor Ward became available, it was only through the efforts of Conservative Councillor Rob Duncan that the issue was resolved. Cllr Duncan took to social media to advertise the position, sending the details of applicants to the council, who then successfully recruited a new school crossing patrol officer.\nIn response to the proposed cuts, Evans and other local officials are calling on Labour to prioritise children's safety. They are demanding that the council trial pelican, puffin, and toucan crossings before considering axing the school patrols. These crossings, which are designed to provide safer crossings for pedestrians, could offer a compromise by addressing both safety concerns and budget constraints.\nConservative councillors are demanding Labour put in the new crossings first and trial them before any other action. The loss of school crossing patrols could have a significant impact on the safety of children, and they believe it is crucial for the council to explore all options before making such a drastic decision.\nConservative councillors are not willing to let the safety of their children be compromised in the name of cost-cutting.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_category_National-News/content_4.html": "The Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News\nKemi gives a speech at the Alliance for Responsible Citizenship Conference 18th February 2025 On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values National News\nRebuilding Trust with our new Immigration Policy 10th February 2025 Kemi’s new plan for immigration shows the Party is back in the service of the British people National News\nKemi’’s First Speech of 2025: Rebuilding Trust 27th January 2025 Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party National News",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_phil-eckersley/content_32.html": "Bowdon ward councillor\nShadow Executive Member for Health & Care\nConservative councillor for Bowdon Ward\nContact information\nCorrespondence address:\nTrafford Town Hall\nTalbot Road\nStretford\nManchester\nM32 0TH\nEmail: [email protected]\nMobile: 07974 044755\nCommittee appointments\nTerm 10/06/2023-10/06/2027",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_group-leader-councillor-evans-writes-council-leader-councillor-ross/content_61.html": "Conservative Group Leader, Councillor Nathan Evans, has formally written to the Leader of the Council, Councillor Ross, to complain about the abhorrent remarks made by Cllr Thomas in the full Council meeting on Wednesday the 16th of October. Councillor Simon Thomas, a Labour Councillor for Flixton, stated in reference to Hale Barns & Bowdon residents in regard to Winter Fuel Allowance payments:\n“those in the ivory towers and let’s be honest the people that most of the Tories represent at the moment in Bowdon, Hale Barns, that don’t need £300” – Councillor Simon Thomas.\nThis is particularly ironic given that both the wards of Hale Barns & Timperley South, and Bowdon currently house the highest number of elderly residents of all Trafford Wards. According to the 2022 Office of National Statistics (ONS) data: 24.8% of residents in Bowdon are aged 65 and over, and 24.8% of residents in Hale Barns & Timperley South are aged 65 and over.\nAccording to the same data, Hale Barns & Timperley South and Bowdon also house the highest number of residents over the age of 80 of all the wards in Trafford. 8.4% of residents in Bowdon are over the age of 80, and 9% of residents in Hale Barns & Timperley South are over the age of 80 (this is approximately 1 in every 11 residents).\nIt is these areas of Trafford, with the highest number of elderly residents (who most benefit from Winter Fuel Allowance), that Councillor Thomas insists do not have any need for Winter Fuel Allowance. But it is not just the inaccuracy of the statement made by Councillor Thomas, it is the general attitude towards the south of Trafford borough that is highly concerning as well as deeply offensive.\nThis is part of a particularly pernicious pattern when it comes to the Trafford Labour Group. One of the prime other examples of this attitude to the south of the borough, include the Health Scrutiny Committee discussions around the closure of the Altrincham Minor Injuries Unit, during which Councillor Sophie Taylor stated:\n‘we have possibly a very niche service for a very small sector of the population who are probably the least deprived, and I’m just glad to hear that this wider review is going to be undertaken really, because it almost sort of suggests or begs the question: is this service actually needed?’\nSee here: Trafford Labour flip-flops on Altrincham MIU as unit set to close | Trafford Conservatives\nThen there have been the responses to ongoing issues with traffic near Oldfield Brow Primary School, in the south of the borough, and the dangers this presents for primary school aged children. Multiple very successful ‘School Streets’ programmes have been launched, all in the north of the borough- in response to the car accident on Taylor Road near Oldfield Brow Primary School, the response is simply that this is not an urgent enough issue to be dealt with. Surely, it cannot be the case that the safety of school children in the south of the borough is less of a concern than the safety of school children in the north of the borough, and yet the differences in responses can be seen quite starkly.\nSee here: Questions for Trafford Council | Trafford Conservatives\nThese pervasive and unacceptable attitudes towards residents are part of a larger pattern of dismissiveness towards issues faced by those in the South of Trafford Borough. Councillor Simon Thomas’ comments were just a particularly ‘full mask-off’ nasty expression of these attitudes. Nonetheless, Group leader Councillor Nathan Evans has written to the Council Leader asking for action on these appalling comments expressed in Council on Wednesday the 16th. Please see this letter attached.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-labour-flip-flops-altrincham-miu-unit-set-close/content_70.html": "Trafford Conservatives are disheartened to hear the news that Altrincham Minor Injuries Unit is set to close. We are also equally baffled by the response of the Labour Party, given that they voted against the Council Motion put forward by our Councillors proposing that Council write to the relevant authorities to urge them to ensure that Altrincham Minor Injuries Unit remain open.\nThis can be seen here: https://www.facebook.com/OC4ASW/posts/202929429523356/\nIt has been interesting to watch Labour change position on Altrincham Minor Injuries Unit where previously they hounded Trafford Conservatives for engaging in so-called ‘populism’ on this issue. Trafford Conservatives can see that Labour MP Connor Rand is going to raise this issue in Westminster- again off the back of Trafford Conservatives and Parliamentary Candidate Oliver Carroll’s campaign to keep Altrincham Minor Injuries Unit open.\nRegarding just how much Labour’s position has changed on this issue- you can see this quote from Labour Councillor Sophie Taylor, where of Altrincham Minor Injuries Unit, she states:\n‘we have possibly a very niche service for a very small sector of the population who are probably the least deprived, and I’m just glad to hear that this wider review is going to be undertaken really, because it almost sort of suggests or begs the question: is this service actually needed?’\nVideo of this can be seen on Facebook via Oliver Carroll’s campaign page:\nhttps://www.facebook.com/share/v/8e3CbsEAjvNQ4zuH/\nAdditionally, you can see how much their position has changed through simply reading older posts on this issue on Trafford Labour’s own website, we would not normally link to Trafford Labour however, you can read what they have previously stated for yourself:\nTrafford Conservatives demand better than shutting down vital services permanently and see this as the thin edge of the wedge of selling off the building altogether. Over 1500 people signed our petition making it clear the Altrincham Minor Injuries Unit is needed. Long trips to Wythenshawe are a waste of resources that increase the amount of travel people undertake.\nThe closing of Altrincham Minor Injuries is a vindictive attack on residents, and we are calling on Lib Dems and Greens to support our demands to make life easier for families.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-young-people-have-greater-voice-regarding-climate-emergency/content_52.html": "Trafford council declared a Climate Emergency in November 2018, which committed the council to tackle climate change and work towards carbon neutrality for the borough of Trafford as well as for the Council by 2038. In terms of engaging residents regarding the emergency, one of the key actions was the council holding a Citizens Panel in November 2021, involving over 30 Trafford residents. The outcomes from the panel have been used to help to develop a Carbon Neutral Action Plan for the borough.\nCllr. Shengke Zhi from Bowdon ward is keen that the voices of young people are heard regarding the Climate Emergency and brought a motion to the January 2023 Council meeting to ask that a Youth Council for climate change be established in Trafford. Commenting on the request, Cllr. Zhi said “Having declared a Climate Emergency, it is now the council’s duty to cut emissions, increase biodiversity, protect our communities and adapt services to minimise the impact of climate change, adapt waste collections and protect more vulnerable residents including those receiving adult social care, women, children and young people.\n“I believe that young people have been under-represented and their voices are largely missed in Trafford regarding the climate emergency. Young people are more vulnerable to the climate emergency than older adults who have better paid work, more qualifications and capital, and stronger networks. The ramifications include increasing anxiety about climate related disruption, food poverty and energy poverty. That is why I asked that the council establish a platform, where young people can be engaged, to understand their needs on climate actions and work with young people together and in a meaningful way on this profound challenge.\n“While the ruling Labour Group on the council did not commit to establishing a Youth Council for climate change, I am pleased that the council did commit to work urgently with families, schools and communities to deliver a fresh approach to ensuring young people’s voices can be heard by engaging with them and identifying how best they wish to raise their concerns about our climate emergency.”",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com/content_1.html": "Welcome to Trafford Conservatives. We're an active local group and we rely on volunteers and donations to bring about positive changes for our communities. We're here to help, so please don't hesitate to get in touch.\nHelp us take action on local issues and build a better Britain.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people/content_6.html": "Nathan Evans Hale Barns and Timperley South Councillor Leader of the Conservative Group and Shadow Executive Member for Economy & Regeneration Borough Councillors\nDylan Butt Hale Barns ward councillor Deputy Leader of the Conservative Group / Shadow Executive Member for Finance, Change and Governance / Chair of Health Scrutiny Committee Borough Councillors\nRob Duncan Manor ward councillor Shadow Executive Member for Housing & Advice / Vice-Chair of Children and Young People's Scrutiny Committee Borough Councillors\nJohn Holden Manor ward councillor Shadow Executive Member for Highways, Environmental and Traded Services / Opposition Spokesperson for Licensing Committee Borough Councillors\nDr Shengke Zhi Bowdon ward councillor Shadow Executive Member for Climate Change / Vice-Chair of Standards Committee Borough Councillors\nMichael Taylor Hale Barns and Timperley South Councillor Shadow Executive Member for Leisure, Arts, Culture & Heritage Borough Council Candidates",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_type_Borough-Council-Candidates/content_46.html": "Michael Taylor Hale Barns and Timperley South Councillor Shadow Executive Member for Leisure, Arts, Culture & Heritage Borough Council Candidates",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_stretford-and-urmston-conservative-association/content_3.html": "Stretford and Urmston Conservative Association have their own website at https://www.stretfordandurmstonconservatives.uk/\nYou can also contact the Association by emailing [email protected]\nStretford and Urmston Conservative Association have their own website at https://www.stretfordandurmstonconservatives.uk/\nYou can also contact the Association by emailing [email protected]",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_category_Articles/content_10.html": "Trafford Conservatives call for free, short stay parking to help our high streets 27th May 2020 Trafford Conservatives call for free, short stay parking to help our high streets With the news that Trafford Council is to receive Government funding to... Articles\nClaim for wages through the Coronavirus Job Retention Scheme 21st April 2020 Claim for 80% of your employee’s wages plus any employer National Insurance and pension contributions, if you have put them on furlough because of coronavirus... Articles\nTrafford Newsletter 2nd February 2020 I am delighted to introduce this year's Spring Newsletter for Trafford Conservatives and the work we are undertaking for our residents. This Spring issue... Articles\nConservatives encourage young people in Trafford to apply for new railcard! 9th July 2019 Teachers can encourage their students to take advantage of a new railcard for 16 and 17 year olds, that is soon to be launched by the Conservative Government... Articles",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_help-lisa-shengke-and-phil-protect-jubilee-community-centre/content_68.html": "The Jubilee Community Centre is at risk, with the Council placing it on its disposal list and seeking buyers.\nCllr Lisa Hancock, Bowdon ward councillor, is acutely aware of just how valuable this building is - frequent using the centre herself - and says, \"So many local people use this facility regularly, and it's a real life line as one of the very few spaces that we have in the area for the community to meet and hold birthday parties, baby groups, keep fit activities, etc. We must act now to ensure Labour guarantee it is foremost in any developer's plans to build on this land.\"\nCllr Dr Shengke Zhi, another of the ward's councillors, says \"We firmly believe that the Labour-run council should only consider future development of the site if the developer commits to ensuring that they build a new community centre within any proposed development. We should be investing in and improving our community assets, not simply selling them off to the highest bidder with no concern for the needs of the community. Please sign our petition to show the Council our united front.\"",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_mayor-burnham-investigate-altrincham-minor-injuries-unit/content_62.html": "Trafford Conservatives have been running a long-standing campaign on the closure of Altrincham Minor Injuries Unit and note that the closure of Altrincham Minor Injuries Unit (MIU) is not in line with the Labour Party’s own manifesto commitment to expand Urgent Treatment Centres.\nThe closure of Altrincham Minor Injuries Unit has also resulted in a lack of accessible healthcare facilities in the south of Trafford Borough and is strongly opposed by residents.\nTrafford Conservative Councillors brought a motion to full Council in November of last year on this issue. Former Conservative MP Sir Graham Brady campaigned on this, as well as the 2024 Conservative Parliamentary candidate, Oliver Carroll. As many of you may remember, however, Trafford’s Labour Council voted *against* the Conservative motion on the Altrincham Minor Injuries Unit – and have since had the gall to pretend that they’ve always been against the closure of Altrincham MIU.\nLabour MP, Connor Rand, has also campaigned on this issue arguing against the closure of Altrincham MIU – jumping aboard the Conservatives campaign on this issue.\nIt is clear that Trafford Labour are, at best, divided on the issue of Altrincham MIU and it would help if they were honest with the public about that.\nOur interest on this topic peaked when we saw the question put to Manchester’s Labour Mayor, Andy Burnham, posed by a resident in Timperley, Valerie. Valerie asked about the Minor Injuries Unit in Altrincham and if it could be re-opened. Even more interesting was Mayor Burnham’s response (taken from the mayor’s account on x):\n“Andy said he would look into this and thinks there should be more walk-in options across GM through his work chairing the Integrated Care Partnership.”\nSee here: https://x.com/mayorofgm/status/1864625240329888246?s=46\nWith Connor Rand MP against the closure of Altrincham MIU, and with Mayor Burnham promising to investigate the issue further- can Labour’s confusion over where they stand on Altrincham MIU finally be put to bed?",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news/content_18.html": "TRAFFORD CONSERVATIVES CRITICISE LABOUR BUDGET AS COUNCIL TAX SOARS Saturday, 15 March, 2025 Trafford Council passed its budget on M onday, 5th March, with Trafford Conservatives voting against the proposals. The budget raises serious concerns, especially the 7.49% increase in Council Tax — a significant blow to residents already struggling with the ongoing cost of living crisis. Residents are being asked to pay more for less, facing rising costs without any noticeable improvement in... Local News\nNew Defibrilator Installed at Sale West Community Centre 7th February 2025 Trafford Conservatives were delighted to see a new defibrillator installed at Sale West Community Centre after community efforts and funds were provided by BRSK... Local News\nTrafford Green and Labour Councillors Vote Against a National Inquiry Despite Shocking 827% Rise in Child Exploitation Cases in Trafford. 30th January 2025 Your Conservative Councillors are demanding accountability after Green and Labour councillors in Trafford failed to support a Conservative-led motion calling... Local News\nTrafford Conservatives Raise Alarm Over Rising Cases of Child Sexual Exploitation in Trafford 30th January 2025 Trafford Conservatives Raise Alarm Over Rising Cases of Child Sexual Exploitation in Trafford Trafford - In light of the ongoing national conversation about... Local News\nLabour Propose to Axe School Crossing Patrols in Trafford 13th December 2024 Labour's proposal to cut funding for school crossing patrols in Trafford has sparked concerns among local communities, with residents warning that these vital... Local News\nMayor Burnham to investigate Altrincham Minor Injuries Unit 5th December 2024 Trafford Conservatives have been running a long-standing campaign on the closure of Altrincham Minor Injuries Unit and note that the closure of Altrincham Minor... Local News\nSaturday the 7th of December is Small business Saturday 3rd December 2024 Saturday the 7th of December is Small business Saturday Your Conservative councillors asked for free parking over the festive season to support our high streets... Local News\nLABOUR'S HATED GREEN BIN TAX PROPOSAL 18th November 2024 TRAFFORD LABOUR'S £45 GARDEN WASTE PROPOSAL SPARKS OUTRAGE AMONG LOCAL RESIDENTS AND OPPOSITION COUNCILLORS Trafford’s Labour-run Council are proposal to... Local News\nGroup Leader Councillor Evans writes to Council Leader Councillor Ross 23rd October 2024 Conservative Group Leader, Councillor Nathan Evans, has formally written to the Leader of the Council, Councillor Ross, to complain about the abhorrent remarks... Local News\nQuestions for Trafford Council 16th October 2024 Today Trafford Council heads in to its first full Council meeting this evening under new constitutional rules. Trafford Conservatives oppose the new... Local News\nThe Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_node_121/content_8.html": "Become a member today and pledge your support for the Conservative Party locally and nationally.\nhttps://www.conservatives.com/join\nBy becoming a member you will be financially supporting the party in its campaigns around Trafford, helping us to take back control of the council.\nIf you would like to assist further and campaign for the Conservatives here in Trafford, please contact your respective Constituency / Ward office on the ‘Contact Us’ page.We’re looking for people who want to speak up for their local community, who can make a difference to our Borough and who want the Conservatives to win.\nBecoming a councillor\nWe’re looking for people who want to speak up for their local community, who can make a difference to our Borough.\nIf you’d like to know more about becoming a Conservative Candidate for the next Council elections in May 2022\nclick here https://www.local.gov.uk/be-councillor\nhttps://public.conservatives.com/static/documents/General_Terms_and_Con…",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_news_trafford-conservatives-raise-alarm-over-rising-cases-child-sexual-exploitation-trafford/content_58.html": "Trafford Conservatives Raise Alarm Over Rising Cases of Child Sexual Exploitation in Trafford\nTrafford - In light of the ongoing national conversation about grooming gangs, Trafford Conservatives have requested and reviewed local data on Child Sexual Exploitation (CSE) and are alarmed by the startling rise in cases within the borough. Between 2021 and 2024, the number of reported CSE cases has surged by an astonishing 827.27%.\nThe data reveals a concerning trend, with 102 cases reported in 2024 alone. This sharp increase raises serious questions for both the local community and the authorities responsible for safeguarding children in Trafford.\nWhile grooming and CSE have historically been associated with certain parts of Greater Manchester, such as Oldham and Rochdale, Trafford Conservatives are deeply concerned that the borough may now be facing its own growing crisis. The rise in cases over the past three years underscores the urgency of addressing this issue before it escalates further.\nCouncillor Nathan Evans, Leader of Trafford Conservatives, stressed the gravity of the situation:\n\"One case of child sexual exploitation is one too many. The rapid increase in reported cases over the last few years is deeply worrying, and we must understand why this is happening. It is especially concerning that all of Trafford's Labour MPs in Altrincham and Sale West, Stretford and Urmston, and Wythenshawe and Sale East voted against a public inquiry into this issue. As Conservative councillors, we will not be complacent when it comes to the safety of our young people.\"\nAdditionally, the Complex Safeguarding Annual Report for 2022-23 raised alarm over ‘evidence of victim-blaming language’ in the handling of cases. Trafford Conservatives believe this issue must be addressed urgently. In the field of child protection, victim-blaming is not only harmful but counterproductive to efforts to prevent and address exploitation. It is critical that all those working in child safeguarding are vigilant in ensuring such harmful attitudes are not perpetuated.\nTrafford Conservatives are calling for immediate action from Trafford Labour. We demand to know what law enforcement and child protection services have been involved in addressing this issue, and why this alarming data has not been raised with councillors or subjected to a thorough investigation. We will not rest until Trafford Labour, who control the council, can assure us that every young person in the borough is safe from exploitation.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_campaigns_dunham-and-warburton-buses/content_26.html": "Dunham and Warburton face a reduced bus service since the introduction of the new Bee Network.\nBetter public transport is a top priority for our communities.\nAt a recent meeting in Dunham, The Greater Manchester Mayor committed to bringing forward a full review of Trafford’s bus services.\nResidents' priorities, and needs included (but were not limited to):\n• Improved reliability\n• Increased frequency\n• Extension of existing bus routes\n• Reinstate evening services\nTransport for Greater Manchester (TfGM) has agreed to work towards addressing these issues, and a follow-up meeting is to be scheduled, with the mayor noting this would be by May.\nIn order to assist with gathering everyone's views, we are seeking to have your input.\nRest assured, we will continue to push for these commitments to be delivered and will hold the mayor accountable to ensure our residents receive the reliable public transport they deserve.\nPlease complete our bus survey below and share what concerns you most and how you feel the situation can be improved.",
  "https_www_traffordconservatives_com_/https_www_traffordconservatives_com_people_dr-shengke-zhi/content_7.html": "Bowdon ward councillor\nShadow Executive Member for Climate Change / Vice-Chair of Standards Committee\nContact information\nCorrespondence address:\nTrafford Town Hall\nTalbot Road\nStretford\nManchester\nM32 0TH\nEmail: [email protected]\nMobile: 07977 290830"
}