{
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_aboutcllrmariabowtell/content_2.html": "Get to know your\nReform UK Councillor, Maria Bowtell\nIt all started in 1990, you could say 1989 when my parents got married but let us not dwell on that. I was born in Bridlington and enjoyed many summers and winters growing up on New Pasture Lane, I spent my teen years on either northside or southside beach with my friends after school and didn't do too badly academically although the Combined Cadet Force was the main motivation to attend school for me. I loved every moment of camps and learning drills, sailing, shooting, flying, and even went on a run occasionally, not that you'd see me running these days. What I am trying to get at is, that I grew up here, I stayed out late and I made the most of our beautiful coastline swimming in the sea and eating doughnuts when I wasn't working a summer job making them down on our working harbour.\nHaving moved away in my 20s for my career aspirations I worked hard on my professional skills in various roles. I also have the most wonderful CV gap due to having my Son in 2012 and watching the Olympics with him asleep on my chest was a highlight year for me. After a stint in management, I found a passion for project management, I worked full time and studied Prince 2 Practitioner course along with other useful process and people management courses. I moved around England over a 10 year period including a stint in Essex, and all I can say about that is South End has nothing on Bridlington!\nI moved back to Bridlington at the end of 2020, having missed my family so much. Covid19 restrictions stopping me from travelling home sooner only compounded my desire to be back by the sea and surrounded by friendly East Yorkshire folk.\nIt was a busy time after moving back to Bridlington, I started working locally up at Carnaby for incredibly supportive and flexible employers in the Crab and Lobster industry. In recent months I have become more aware of my family history as my mum's maiden name Jewitt is featured on the Gansey Girl statue situated on the Harbour. My name Bowtell is lesser known but goes back generations in Bridlington too.\nMoving back to Bridlington coincided with me going back to Church. Through a love of worship music and many years of my younger life spent at Christ Church, when I moved back it felt like coming home in a spiritual way which is hard to explain if you've not 'felt' God's presence before. I attend and help where I can at Emmanuel Church on Southside and I couldn't be more thankful for the people God has put in my life to support and encourage me. They have enabled me to become the a Ward Councillor for Bridlington.\nPlease take some time to explore this site and I hope you know who you'll be voting for and representing you a little better now. I am here to listen to your story and hear what you need for an improved lifestyle in this beautiful county full of kind and inspiring people. Feel free to reach out if you have any questions or ideas on how we can heal and grow this incredible part of the world we call home.",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_post_eastridingcouncillorbowtell2023summary/content_9.html": "2023 reflections of a new ERYC councillor\n- Councillor Maria Bowtell\n- Jan 1, 2024\n- 3 min read\n2023 has been the most challenging yet rewarding year of my life so far.\nIt truly is an honour to serve my community. Being a ward councillor for ERYC has been eye-opening. Do you know over 10,000 staff deliver hundreds of services across the East Riding? That is to over 340,000 residents spanning Bridlington to Goole.\nI have spent over 100 working hours in council meetings since October (I was going to go back to May and count, but diary history is only three months, but I estimate 8 to 12 hours a week in meetings). As a councillor, I also get emails and calls from residents on ranging issues such as:\nPotholes and uneven pavement\nDog fouling and fly-tipping\nCouncil home maintenance\nAnti-social behaviour\nHighways and speeding\nSupporting local business\nA highlight this year, not including the room-spinning experience of the Count Day on the 5th of May 2023, was having the responsibility of Chairing the Children and Young People Overview & Management Scrutiny Sub-committee. It was a great experience. As the Vice-chair, I am constantly practising the skills I need to make a difference.\nAs a political back-bencher, I thoroughly enjoy my role in scrutinising decisions and have been involved in many of these scrutiny meetings, including:\nChildren and Young People\nHealth and Wellbeing\nOverview Management\nSafer and Stronger Communities\nI even stood up in the council chambers to speak for the democratic right to proportionate representation in these scrutiny meetings. Full council meetings this year have been pretty lengthy (5hours!!), which is something I didn't know before being elected. It doesn't bother me now that all the meetings are recorded Live and steamed on YouTube, which certainly has taken some getting used to. If you have a few spare hours and want to see me in action, watch on the East Riding of Yorkshire Council YouTube channel.\nAs part of my desire to make a difference, one of my biggest challenges is to find a balance. I am a councillor, mother, and employee. I am also involved with the following (which have their own schedule of meetings):\nPublic Governor - York and Scarborough Teaching Hospital Foundation Trust\nCouncil representitive on North East Inshore Fisheries & Conservation Authority\nTrustee - Bridlington Health Forum\nTrustee - East Coast Community Churches Music Festival (and choir)\nTrustee - Bridlington School\nLooking to 2024, I hope to refine my key responsibilities, balance and focus areas. It would be great to receive feedback from residents on what they feel my priorities as a councillor should be. I will always prioritise residents' emails and will continue to help steer our council to ensure that our part of East Riding is and continues to be a place people want to live, work and retire.\nAnyone who knows me knows how much I love Bridlington. I want to encourage and build strong and resilient communities and develop growth. Ensuring the future prosperity of our town is my desire. If you have any ideas but don't know how or where to start, it would be great to hear from you. It is and always will be a team effort that gets things done!\nThank you for your support and many blessings for 2024. It's going to be a great year. I will keep you posted with online updates monthly and get out physical leaflets every six months. (Call this my resolution if you'd like to be more visible to you all).\nBest wishes always from your Conservative Bridlington Councillor,\nMaria Bowtell\n01262 475881\nMy year in some pictures :-)",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_post_the-future-of-our-hospital-meeting-24th-jan-2023/content_6.html": "The future of our Hospital - meeting 24th Jan 2023\n- Councillor Maria Bowtell\n- Jan 19, 2024\n- 2 min read\nAs both a trustee of Bridlington Health Forum and a public governor for York and Scarborough Teaching Hospitals Foundation Trust, I have unique insight into the work going on to secure the long-term plans and prosperity of our brilliant but vastly underutilised district hospital.\nThere is a unique opportunity:\n24th of January 1 pm\nBridlington North Library\nCome and hear the health forum priorities, plans and ideas for what we're trying to achieve. Have your say on what matters to you. Martin Barkley, York Trust's new chairman has accepted the invitation to join us. He is keen to hear your thoughts. Martin will take your questions and share his findings.\nAs a resident born in Bridlington District Hospital, I have aspirations for it to thrive. We have a modern estate with enormous potential, currently underutilised for its intended purpose - serving the areas of remote coastal communities.\nOn a personal note, as a resident (not as a councillor, governor or trustee). I would like to see the following in Bridlington District Hospital:\nPalliative care (so loved ones can be close to home if not in it)\nMore consultants lead outpatient clinics (removing the need to go to Malton e.g. when you have issues with your eyes, skin or bladder)\nFrailty services\n24/7 Urgent treatment centre (with extra resources in summer months due to population swell)\nIncrease in diagnostic testing capability and capacity\nGrowth of the award-winning surgical teams\nLong-term thinking, supported by a robust coproduced plan and strategy delivered through clear milestones, timescales and outcomes is long overdue.\nIt is a fantastic time to get involved and have your say. The Trust is currently undertaking the vital task of setting out its strategy for the years to come.\nRebalancing NHS investment towards Bridlington Hospital to restore local care, and develop our healthcare services, will give security and support recruitment for those considering NHS careers and a vocation in local healthcare.\nI hope you will add your voice and show your support to the Bridlington Health Forum on the 24th. I am excited to see our joint efforts secure a brighter future for the health services in our beautiful town.\nSee you soon,\nMaria Bowtell\n''Sow you seed in the morning, and at evening let your hands not be idol, for you do not know which will succeed, whether this or that, or whether both will do equally well.''\nEcclesiastes 11:6 NIV",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_wardcouncillorblog_categories_updates-and-thanks/content_7.html": "top of page\nWard Councillor for Bridlington Central & Old Town\nMARIA BOWTELL\nHome\nAbout\nContact\nBlog\nMore\nUse tab to navigate through the menu items.\nAll Posts\nInspiration\nUpdates and Thanks\nWe did it! Thank you\nThank you! to everyone who voted, not just for me, but for anyone putting in the effort to enable our democracy to work. You have...\nCouncillor Maria Bowtell\nMay 7, 2023\n2 min read\nbottom of page",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_wardcouncillorblog_tags_health/content_11.html": "top of page\nWard Councillor for Bridlington Central & Old Town\nMARIA BOWTELL\nHome\nAbout\nContact\nBlog\nMore\nUse tab to navigate through the menu items.\nAll Posts\nInspiration\nUpdates and Thanks\nThe future of our Hospital - meeting 24th Jan 2023\nThe future of Brildington District Hospital. Have your say at a public meeting 24th Jan 1pm, Brid North Library\nCouncillor Maria Bowtell\nJan 19, 2024\n2 min read\nbottom of page",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_wardcouncillorblog_categories_thoughts/content_13.html": "top of page\nWard Councillor for Bridlington Central & Old Town\nMARIA BOWTELL\nHome\nAbout\nContact\nBlog\nMore\nUse tab to navigate through the menu items.\nAll Posts\nInspiration\nUpdates and Thanks\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nbottom of page",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk/content_1.html": "MARIA BOWTELL\nWard Councillor for Bridlington Central and Old Town\nI was honoured to stand as your Reform UK Parliamentary Candidate in Bridlington and the Wolds in the 2024 election securing over 10,000 votes.\nThe support recieved really was encoraging and East Yorkshire showed a clear appetite for the policies and aspirations of the Reform UK Party.\nCurrently representing Bridlington Central and Old Town as a ward councillor and group leader, I will continue to strive for the best outcomes for our area, at all levels of politics.\nHere you'll find my recent blog posts:\nBridlington, Driffield, Hornsea and our stunning villages and market towns have some excellent community foundations that must be built on and improved, please comment and let me know how you think this can be achieved!\nHELLO\nI started this personal political website and blog with the goal of offering readers a glimpse into my thoughts and experiences. What started out as trying to help my community, has evolved into a dynamic vision to see real positive change within Bridlington, the East Riding of Yorkshire and the whole Nation in fact. I hope to have this site packed with information about various topics that are near and dear to me in the coming months and you can find out more about my background on the about page.\nTake some time to explore the website and my social pages and see for yourself what makes me so passionate about East Yorkshire, and what subjects I am eager to step up to the plate for local residents about. Please don't forget to let me know what you'd like to see in our area!\nTell me; what do you want to see in our area?\n01262 425881\nBridlington, East Yorkshire, ENGLAND",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_post_we-did-it-thank-you/content_12.html": "We did it! Thank you\n- Councillor Maria Bowtell\n- May 7, 2023\n- 2 min read\nUpdated: Nov 2, 2023\nThank you! to everyone who voted, not just for me, but for anyone putting in the effort to enable our democracy to work. You have indicated your faith in me with your votes, and I plan to honour that choice made by the 23%.\nWith your votes, you chose to trust me, as a Ward Councillor for Bridlington Central and Old Town. You have all encouraged and blessed me with an important role, to be your voice. Not to be served but to serve.\nIt was a hard-fought campaign with many more ups than downs, and walking the streets and lanes within the Bridlington and surrounding villages has been invaluable.\nGetting to know you as residents has been my favourite part. I will continue to get out and meet you all, whether on a dog walk, social event, parish or town council meeting or bumping trollies in the supermarket!\nI will continue to thank personally all those who helped canvass, cooked for me, told me to rest and reminded me to pray and trust in God and his plan for my life.\nThank you! Again, I cannot thank you enough for the position I now find myself in. I hope to bring a 'sparkle' and influence to meetings enabling restoration, protection, improvements, growth and many of God's intended blessings throughout the East Riding of Yorkshire.\nAn oath of office is this week! I will declare all my potential conflicts of interest, and get some IT equipment, an official email address and other bits and bobs. It will be a steep, valuable and exciting learning curve. My thirst for knowledge to empower us will sustain me in this transition to becoming the best councillor for you I can be.\nI will write separate blog posts about the campaign and my priorities of God, Family and Others. So keep your eyes out if you want to know more about me. With this Blog, I hope to provide you with transparency and updates on exciting news heading our way in the East Riding.\nPlease continue to pray for all those entrusted with this honour. Thank you to my church family, who have supported and encouraged me on this path.\nGod's blessings to you all.\nMaria\nCllr Maria Bowtell\nBridlington Central and Old Town Ward\nPreviously known as: Councillor Ibbotson",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_post_reformuknhspolicybypccmariabowtell/content_5.html": "Isn't reforming the NHS the bigger priority?\n- Councillor Maria Bowtell\n- Apr 10, 2024\n- 3 min read\nYou may have heard the update from Reform UK about our plans to save the NHS. Let us get waiting lists to zero in 2 years!\nI back these plans and how the party plans to fund them. I don't think our 1% contribution to global carbon emissions is as important as improving our nation's health.\nBut what do you think?\nWhat is MORE important to you?\nNet Zero in 25 years\nRestoring the NHS and tackling waiting lists\nThe problems in the NHS are significant\nHospital beds have been cut from 300,000 to 141,000 while the population has grown by 20%\nPer head of population, NHS spending is similar to other Western countries. Sadly, the NHS is being let down by incompetent management, bureaucracy, waste, and scandals.\nThe NHS has a leadership crisis. This will take time to fix. It is about structure and motivation.\nI want to add some relevant 'meat to the bones' as your local parliamentary candidate for Bridlington and the Wolds. Some of the things I would change:\n1. Cut waste\nAs a recently resigned Governor of York Trust, I have seen first-hand the volume of waste within our hospitals.\nToo many top managers and 'Inclusion and Diversity' roles. I would rather see more nurses and so would staff.\n2. Stop Centralisation\nBring services back to coastal and rural areas like ours. Getting a train and a taxi to an appointment is not just costly in time and money. For a urology (bladder) appointment in Malton, it is not kind to have to travel far. We had a consultant clinic in Bridlington not that long ago? ... poor management decisions again to centralise at the detriment of the East Riding patients.\n3. Prioritise reducing waiting lists over Net Zero\nCarbon-neutral Bridlington Hospital (at the cost of 4.7mil) is a green elephant. The hospital has empty wards and halls.\nTo send local patients across 1.7 million miles of poorly maintained roads to sit in traffic at often congested city hospitals like York is diabolical. That is IF the patient or their carer is fortunate enough to have a vehicle!\nIn the press conference the funding for these ideas was covered, all of Reform UK's policies have been costed. The long and short of it is to scrap Net Zero and prioritise our NHS.\nMore detail and costings can be found on the Reform UK policy page linked here.\nReform UK has made the following pledges, I will fight for:\nTransform Doctor and Nurse Availability.\nAll frontline NHS and social care staff are to pay zero basic rate tax for 3 years. This will help retain existing staff and attract back many who have recently left. We want the best staff with patients, not in offices behind desks or retired.\nUse Independent Healthcare Capacity.\nCut waiting lists by using UK & overseas providers. The vast majority do not mind who delivers the cure, we just want the pain gone. This independent sector includes many not-for-profit health providers that provide some of the best care. Organisations such as Nuffield Health and Marie Curie, which provide end-of-life cancer care are charities. We want to encourage more of these organisations to end the NHS crisis.\nTax Relief of 20% on all Private Healthcare and Insurance.\nWe will incentivise people who can afford to pay more. This will improve care for all as pressure on the NHS is significantly reduced. Those who rely on the NHS will enjoy faster, better care. Independent healthcare capacity will grow rapidly, providing competition and reducing costs. Firms should be encouraged to offer staff health insurance - this will become standard. Labour will instead add VAT on independent healthcare, which will make the NHS worse off.\nDoctor and Nurse Training.\nEnd training caps for all UK medical students. Write off student fees pro rata per year over 10 years of NHS service for all doctors, nurses & medical staff.\nThere are also plans thereafter here are a couple of my favourites:\nCut waste, Bureaucracy and Unnecessary Managers.\nFocus on results, not targets. Nail down better prices using economies of scale. Better IT for example. Review all Private Finance Contracts in NHS. Significant savings potential. Remove Lifetime Cap on NHS Pensions. This causes 70% of surgeons to reduce their hours.\nExcess Deaths and Vaccine Harms Public Inquiry.\nExcess deaths are nearly as high as they were during the Covid pandemic. Young people are overrepresented.\nAs a Trustee for Bridlington Health Forum we have our next Public meeting with guest speaker Andy Kingdom from East Riding of Yorkshire Council coming to present some stark facts.\nIt would be great to see as many residents as possible but be warned we usually have to turn people away so be early to get a seat.\nThe meeting will be followed by the health forum's Annual General Meeting.\nHope to see you soon and it would be amazing to get your feedback and ideas on how you think we should tackle restoring our NHS.\nMay God bless you,\nMaria Bowtell",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_contactcouncillorbowtell/content_3.html": "top of page\nI'm here to listen to local people so get in touch!\nThe East Riding of Yorkshire Council website has some great resources, and can tell you who is currently elected and what a councillors role is but please feel free to contact me with your questions if you'd like to know my thoughts and definitely if you'd like to share your own.\nbottom of page",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_post_maria-bowtell-devolution-thoughts-myth-busting/content_8.html": "Maria Bowtell - Devolution Thoughts & Myth Busting\n- Councillor Maria Bowtell\n- Jan 6, 2024\n- 3 min read\nThe third-party-run consultation period is now live! Residents can share their thoughts on the potential East Riding of Yorkshire and Hull City Council's Mayoral Authority Devolution Deal.\nI've felt compelled to share my thoughts on the consultation due to much cynicism and false info seen on social media comments. As an informed member of the elected council who voted, 50 For and 1 Against, to put this deal out to residents (because it's what we collectively and cross-party believe to be in residents' best interests. Not some 'Tory Con' or at the benefit of some 'Boys club')\nSome other social media comments write; ''done deal'' and ''it's just a tick-box consultation''. I want to clarify. It is a third party conducting the impartial consultation. The majority of your councillors agree and want this deal to go ahead. Therefore, we are sharing the consultation with our positive opinion, well, because we are positive about it. I desire that residents take the time to understand, ask questions and then complete the consultation from an informed position.\nI do believe we will miss out if we do not devolve. The money and investment will keep going to the areas with mayors already devolved otherwise! I am keen to get as many informed, unbiased responses to the consultation on a mayoral authority solution as possible in the time we have. I want your response to be genuinely based on your opinion of the actual deal and reality, and not based on social media experts' commentary.\nIn response to the comments (trying not to take them personally) about ''all councillors being corrupt''. This deal has been a topic of meetings since May. For anyone who wants to question integrity, I would ask you to watch our meetings and make up your mind with the evidence in the public domain. There are very few meetings that are not publicly available.\nPlease vote at every opportunity. Vote for candidates you want to represent you and use your democratic right to vote for people you trust to be informed and make decisions for you. There is also the option, could you stand to be a councillor yourself? (let me know if this interests you!)\nSpeaking of democratic rights and those frustrated about the lack of a referendum process. Elected councillors representing you voted not to go to the referendum, costing you over half a million of your council tax money. Uninformed comments seem to think funding the new mayoral authority comes from council tax; this is also incorrect as it is from central government. A great point about a mayoral authority is that you get to vote on who your Mayor will be, making them accountable to you.\nWe don't know who our Mayor would be. I will be backing local and passionate candidates. I hope for someone who oozes the Nolan Principles. A Mayor who can deliver ambitious growth plans strategically across East Yorkshire. All being well, I will support whomever they may be to spend all this extra funding wisely and fairly. I will be disappointed if the majority who complete the consultation prefer to let Westminster continue to choose who, where and when to spend money they've taken from the hardworking residents of East Yorkshire.\nA Mayoral Combined Authority Devolution brings more money and decision-making back into local hands. That is why I am unashamedly in support of it.\nPlease read the document and the questions before making up your mind and sharing your thoughts. Links below:\nThank you for reading. Contact me with your thoughts and questions via email at any time.\nMany blessings,\nMaria Bowtell",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_post_mariabowtelldefectstoreformuk/content_10.html": "Why has Maria Bowtell Defected to Reform UK?\n- Councillor Maria Bowtell\n- Mar 1, 2024\n- 2 min read\nToday I have informed the East Riding Council and the Leader that I will no longer be a councillor under the Conservative group.\nFrom 1st March 2024, I will be a Reform UK councillor for Bridlington Central and Old Town. I am also excited to announce I am the Parlimenarty Candidate for Bridlington and the Wolds in the next general election for Reform UK.\nI want to reassure those I currently represent, that I still represent you and have the same goals and beliefs as I did when I was elected. As a Reform UK councillor, I will have the freedom to vote as I please. You will continue to have my best efforts as a ward councillor for Bridlington, Bempton, Buckton, Boynton and Grindale.\nAnyone who knows me knows of my passion for improving access to and provision of health care services. The Hospital has always been close to my heart (I was born in it). It's with this in mind, along with many other national issues, which I do not feel either of the main two parties have a grip on, that has driven me to look for the alternative.\nAfter reviewing the Reform UK Draft Contract and speaking to those closest to me and some Reform UK members, it feels right to step up and become the genuine alternative choice for Bridlington and the Wolds in the next general election.\nWe need levelling up, in healthcare, economics and transport, to name a few. I will fight hard for our area like no other.\nIt would be an honour and privilege to represent Bridlington, Hornsea, Driffield and all our stunning villages in Westminster. I love East Yorkshire and I will do anything for it.\nIt is going to be an exciting year. I hope you join me to protect and enhance East Yorkshire for all generations.\nPeace be with you and all those you love,\nMaria Bowtell\nReform UK Parlimantary Candidate for Bridlington and the Wolds",
  "https_www_mariabowtell_co_uk_/https_www_mariabowtell_co_uk_wardcouncillorblog/content_4.html": "top of page\nWard Councillor for Bridlington Central & Old Town\nMARIA BOWTELL\nHome\nAbout\nContact\nBlog\nMore\nUse tab to navigate through the menu items.\nAll Posts\nInspiration\nUpdates and Thanks\nIsn't reforming the NHS the bigger priority?\nCouncillor Maria Bowtell\nApr 10, 2024\n3 min read\nWhy has Maria Bowtell Defected to Reform UK?\nCouncillor Maria Bowtell\nMar 1, 2024\n2 min read\nThe future of our Hospital - meeting 24th Jan 2023\nCouncillor Maria Bowtell\nJan 19, 2024\n2 min read\nMaria Bowtell - Devolution Thoughts & Myth Busting\nCouncillor Maria Bowtell\nJan 6, 2024\n3 min read\n2023 reflections of a new ERYC councillor\nCouncillor Maria Bowtell\nJan 1, 2024\n3 min read\nWe did it! Thank you\nCouncillor Maria Bowtell\nMay 7, 2023\n2 min read\nbottom of page"
}