{
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_sam-campaigns-stop-new-housing-development-ageas-bowl/content_15.html": "The Lib Dem-led Eastleigh Borough Council are considering approving yet another assault on our local infrastructure. And, this time, their target is West End.\nDespite the traffic already resulting from years of overdevelopment, Eastleigh Borough Council are considering an application to squash 172 more houses, a 142-bedroom hotel and even a 71-bedroom care home into the land adjacent to the Ageas Bowl. That means 100s more cars trying to squeeze through West End village at rush hour, 100s more cars trying to find a car-parking space around the Ageas Bowl, and 100s more cars polluting our community. Who in their right mind could think that this is a good idea?\nBut, the thing is, Sam is not convinced that the Lib Dem-led Eastleigh Borough Council are always interested in good ideas for our community. Instead, with over £500m worth of debt (and counting…!), Sam's hunch is that they are keen to see as many building projects approved in our community as possible to try to collect some additional council tax to pay down this debt. And that’s just not acceptable.\nPlease sign the petition below against this development and, together, let's stand-up against this overdevelopment.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_feed/content_23.html": null,
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_accessibility/content_8.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_category_Local-News/content_20.html": "Sam launches campaign for improved bus connectivity 22nd March 2024 Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh, has launched a campaign to improve bus connectivity in Eastleigh, Chandler's Ford... Local News\nSam campaigns against overdevelopment in Valley Park 11th February 2024 The Test Valley local plan has been published, and a significant housing development (with ~1070 new dwellings) has been proposed for Velmore Farm, an area of... Local News\nSam campaigns to stop new housing development at Ageas Bowl 18th December 2023 The Lib Dem-led Eastleigh Borough Council are considering approving yet another assault on our local infrastructure. And, this time, their target is West End... Local News\nSam campaigns to retain Winchester Hospital A&E and maternity services 2nd December 2023 Sam Joynson, the Conservative Party Parliamentary candidate for Eastleigh & Chandler's Ford, has launched a campaign on behalf of Eastleigh's residents to stop... Local News\nSam Joynson picked for Eastleigh 17th July 2023 The Conservative Party has selected its Parliamentary Candidate for the Eastleigh constituency for the next general election. At a meeting on Saturday evening... Local News",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_campaigns_campaign-new-eastleigh-police-station/content_16.html": "For too long, crime and anti-social behaviour has been an issue across the borough of Eastleigh.\nThe Conservative Government is stepping-up to this issue by opening a new police station in Eastleigh Town Centre and putting 582 new police officers on the streets of Hampshire.\nBut we know that we must go further. That’s why Sam Joynson is launching a survey to understand the policing priorities of local residents, so that both (i) the new Eastleigh police station can be designed in a way that best fits the needs of Eastleigh and (ii) new policing initiatives can be designed around resident priorities. Please share your ideas and suggestions below.\nSam said “as a former lawyer, I am fully aware of the impact that crime has on individual livelihoods and the broader community. And that’s why I’m determined to do something about it, so we all feel safe again.”",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_sam-campaigns-against-overdevelopment-valley-park/content_19.html": "The Test Valley local plan has been published, and a significant housing development (with ~1070 new dwellings) has been proposed for Velmore Farm, an area of land adjacent to Valley Park.\nSince being selected to be the Conservative Party Parliamentary Candidate for Eastleigh and Valley Park at the next general election, Sam has campaigned tirelessly against overdevelopment across our community, with recent campaign successes including having a leading role in blocking ~200 new houses at the Ageas Bowl.\nSam's position on new housing developments is clear. Housing across Eastleigh, Valley Park and Hampshire is needed, but any developments must be conducted in a manner that minimises the impact on local residents. This means that proposed developments should include the infrastructure to support them, meaning - at the very least - additional roads, schools and local NHS provision should be included in any plans.\nIn light of the clear lack of sufficient additional infrastructure included in the plan for Velmore Farm, Sam is therefore campaigning to change the current form of this plan to protect our community in Valley Park and Chandler's Ford. Sam knows how bad the traffic can already be in Valley Park and just how stretched the local GP services are, and therefore has significant concerns about the almost total lack of additional service provision in the current plans for the site. He also shares the worries of local residents about the number of properties and density of the proposed development, and the impact that this will have on Valley Park's unique countryside and open spaces.\nSam has launched a petition for local residents to join the calls to stop the overdevelopment of Valley Park, and asks you to sign this below. He has also encouraged as many residents as possible to respond to the Test Valley local plan consultation here (https://www.surveymonkey.com/r/6W7JMTD) by Tuesday 2 April 2024.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_about-rss/content_11.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_campaigns_lets-cut-crime-hampshire/content_12.html": "For too long, crime and anti-social behaviour has been an issue across the borough of Eastleigh.\nThe Conservative Government is stepping-up to this issue by opening a new police station in Eastleigh Town Centre and putting 582 new police officers on the streets of Hampshire.\nBut I know that we must go further. That’s why I want to understand the policing priorities for Eastleigh's residents so that, with the opening of the new police station and the surge in police numbers, we can maximise this opportunity to make our community a safer place.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_cdn-cgi_l_email-protection/content_6.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_sam-joynson-picked-eastleigh/content_21.html": "The Conservative Party has selected its Parliamentary Candidate for the Eastleigh constituency for the next general election. At a meeting on Saturday evening, the members of the Conservative Party in Eastleigh selected Eastleigh South resident, Samuel Joynson, 31, to fight the election.\nAt the meeting, Sam's pitch to members was that he was local, relatable and experienced.\nSam lives today with his fiance - who works at Southampton University - in the Lakeside area of the Eastleigh South ward. He stated that he therefore understood the concerns of the people of Eastleigh, and wanted to fight overdevelopment, increase police presence in the town centre and tackle the Lib Dem council's 'highly irresponsible' £500m+ debt.\nHailing from a single parent family and a state comprehensive education, Sam pitched that he had experienced first-hand the pressures of the cost of living growing up, and therefore was ready to tackle the pressures that families across the constituency are facing with empathy and compassion.\nSam practiced as a lawyer for 4 years, and now works as an international business consultant. He promised the meeting that he would bring the skillset gained from this professional experience to serve and represent the people of Eastleigh.\nPaul Homes MP, the current Conservative MP for Eastleigh, says \"I am absolutely delighted that local campaigner, Sam Joynson, has been selected to stand for the Conservatives at the next General Election.\nBeing a resident of Eastleigh, Sam knows the issues that we all face across the Borough and I have no doubt he will be a superb Member of Parliament, putting Eastleigh residents first every step of the way.\nA qualified lawyer and senior business consultant, Sam brings a wealth of real-world experience, compassion and innovative ideas to Eastleigh. He says, \"I am thoroughly looking-forward to working with Sam and making our Borough an even better place to live and work.\"\nUpon winning the vote, Sam stated that his ambition was, \"to be the MP for Eastleigh for many years to come, overseeing the transformation of Eastleigh into a place of high-tech, high-quality jobs hailing from the new government-funded Solent Freeport.\"",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_sam-campaigns-retain-winchester-hospital-ae-and-maternity-services/content_10.html": "Sam Joynson, the Conservative Party Parliamentary candidate for Eastleigh & Chandler's Ford, has launched a campaign on behalf of Eastleigh's residents to stop the closure of Winchester Hospital's A&E and consultant-led maternity services.\nSam recognises that these services form part of the critical local healthcare provision for Eastleigh's residents, and has called on the clinician-led NHS Hampshire & IOW Integrated Care Board to reconsider its proposals.\nTo bolster this campaign, Sam has launched a petition on behalf of Eastleigh's residents calling for the NHS Hampshire & IOW Integrated Care Board to retain Winchester Hospital's A&E and maternity services in their current form.\nPlease sign this petition here:",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_events_feed/content_22.html": null,
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_sam-launches-eastleigh-bloom-2024/content_5.html": "Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh, has launched the 'Eastleigh in Bloom 2024' competition. Sam said that he launched the initiative \"to bring our community together in a manner that showcases the very best of the natural world in Eastleigh.\" He added that, if he becomes the MP, he intends to \"make this an annual celebration of nature in our community.\"\nTo enter the competition, entrants must submit a photo of the natural world anywhere in Eastleigh, Chandler's Ford, Bishopstoke, Fair Oak, West End or Valley Park to Sam by 31 May 2024 via either email ([email protected]), Facebook message to 'Sam Joynson for Eastleigh' or by tagging 'Sam Joynson for Eastleigh' in a post. Example photos might be of a vista from your hike across the fields surrounding Bishopstoke, a flower-bed in your garden in Boyatt Wood, or a wild animal that you spot on a family stroll in the Stoke Park Woods. Entrants should specify in their submission whether they would either like the photo to be (i) posted with a public accreditation to their name or (ii) posted with the entrant's name omitted.\nSam will shortlist the entries for the public vote on 31 May 2024. The winner of the competition will then be selected via a public vote on Facebook in the first week of June, with the winner announced on Friday 7th June.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_campaigns/content_2.html": "Let's cut crime in Hampshire For too long, crime and anti-social behaviour has been an issue across the borough of Eastleigh. The Conservative Government is stepping-up to this issue by...\nCampaign for new Eastleigh police station For too long, crime and anti-social behaviour has been an issue across the borough of Eastleigh. The Conservative Government is stepping-up to this issue by...",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_privacy/content_9.html": "This document outlines how Sam Joynson processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Sam Joynson\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Sam Joynson.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Sam Joynson, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Sam Joynson via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_category_Articles/content_13.html": "Sam launches Eastleigh in Bloom 2024 7th May 2024 Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh, has launched the 'Eastleigh in Bloom 2024' competition. Sam said that he launched... Articles",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_contact/content_3.html": "Skip to main content\nMain navigation\nHome\nAbout Sam Joynson\nNews\nContact\nContact\nLeave this field blank\n[email protected]\nSam on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_cookies/content_17.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news/content_7.html": "Sam launches Eastleigh in Bloom 2024 Tuesday, 7 May, 2024 Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh, has launched the 'Eastleigh in Bloom 2024' competition. Sam said that he launched the initiative \"to bring our community together in a manner that showcases the very best of the natural world in Eastleigh.\" He added that, if he becomes the MP, he intends to \"make this an annual celebration of nature in our community.\" To... Articles\nSam launches campaign for improved bus connectivity 22nd March 2024 Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh, has launched a campaign to improve bus connectivity in Eastleigh, Chandler's Ford... Local News\nSam campaigns against overdevelopment in Valley Park 11th February 2024 The Test Valley local plan has been published, and a significant housing development (with ~1070 new dwellings) has been proposed for Velmore Farm, an area of... Local News\nSam campaigns to stop new housing development at Ageas Bowl 18th December 2023 The Lib Dem-led Eastleigh Borough Council are considering approving yet another assault on our local infrastructure. And, this time, their target is West End... Local News\nSam campaigns to retain Winchester Hospital A&E and maternity services 2nd December 2023 Sam Joynson, the Conservative Party Parliamentary candidate for Eastleigh & Chandler's Ford, has launched a campaign on behalf of Eastleigh's residents to stop... Local News\nSam Joynson picked for Eastleigh 17th July 2023 The Conservative Party has selected its Parliamentary Candidate for the Eastleigh constituency for the next general election. At a meeting on Saturday evening... Local News",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk/content_1.html": "Campaigns Let's cut crime in Hampshire For too long, crime and anti-social behaviour has been an issue across the… Campaign for new Eastleigh police station For too long, crime and anti-social behaviour has been an issue across the… Latest News Sam launches Eastleigh in Bloom 2024 Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh,… Sam launches campaign for improved bus connectivity Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh,… Sam campaigns against overdevelopment in Valley Park The Test Valley local plan has been published, and a significant housing… Find me on Twitter Find me on Facebook Am I your candidate? Enter your postcode to confirm that Sam Joynson is your candidate. Postcode My map\nLet's cut crime in Hampshire For too long, crime and anti-social behaviour has been an issue across the…\nCampaign for new Eastleigh police station For too long, crime and anti-social behaviour has been an issue across the…\nSam launches Eastleigh in Bloom 2024 Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh,…\nSam launches campaign for improved bus connectivity Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh,…\nSam campaigns against overdevelopment in Valley Park The Test Valley local plan has been published, and a significant housing…",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_map-locations/content_14.html": "Skip to main content\nMain navigation\nHome\nAbout Sam Joynson\nNews\nContact\nMy map",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_about-sam-joynson/content_4.html": "Sam Joynson grew up in Dorset in a single-parent family. He was educated at his local state comprehensive school and sixth form. Whilst at sixth form, he balanced his studies with weekend work in the staff kitchen of his local hotel.\nSam went to university at the London School of Economics, where he studied International Relations and History. During his time at LSE, he became an accomplished debater, winning a number of national competitions and qualifying for the European Debating Championships. Upon graduation, he chose to pursue his passion for debate and reason, attending law school before then qualifying as an international lawyer at a leading British law firm.\nSam worked as a lawyer for ~4 years, before then winning a scholarship to INSEAD, a leading business school. He obtained an MBA at INSEAD, before then refocusing his career on management consultancy, the profession in which he works today.\nOutside of work, Sam is a keen adventure traveller, and, in 2019, was awarded a Fellowship of the Royal Geographic Society. His travels have taken him from the jungles of the Congo to K2 in northern Pakistan, and have been fuelled by a desire to better understand the people and cultures of our world.",
  "https_www_samjoynson_uk_/https_www_samjoynson_uk_news_sam-launches-campaign-improved-bus-connectivity/content_18.html": "Sam Joynson, the Conservative Party's Parliamentary Candidate for Eastleigh, has launched a campaign to improve bus connectivity in Eastleigh, Chandler's Ford, Valley Park, Bishopstoke, Fair Oak and West End.\nSam stated \"it is quite clear that there are big gaps in our local bus network, and these need to be filled. Improved bus connectivity empowers those without access to a car, reduces traffic on our roads and reduces our community's carbon footprint.\"\nSam added \"I'm launching a grass-roots campaign to improve our bus network, with the first step being the launch of a survey to better understand what all residents want from their public transport services. I will then consolidate the responses to this survey, and present the findings to Hampshire County Council, campaigning hard to plug the gaps identified by residents.\"\nTo be part of this effort to transform our local transport network, please fill-in the survey below."
}