{
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_news_st-georges-day/content_7.html": "🏴 I’m proud to be English. Especially on days like today where we can celebrate our heritage, values, and everything that makes our country great.\nHappy St George’s Day.\n🏴 I’m proud to be English. Especially on days like today where we can celebrate our heritage, values, and everything that makes our country great.\nHappy St George’s Day.",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_contact/content_3.html": "If you have any issues you think I might be able to help with, or have any ideas on how we can make South West Hertfordshire even better, please do feel free to contact me. If you are unsure on whether I can help, please check out my FAQs page which I hope will help. Please fill out the contact form below and I will respond as soon as possible.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_parliament/content_9.html": "Tweet Here, you can see Gagan Mohindra's latest speeches and appearances in Parliament (provided by theyworkforyou):\nGrassroots Sports | Culture, Media and Sport | Commons debates Certain sports often remain inaccessible to women and girls early on, making it harder for them to join later.\nGrassroots Sports | Culture, Media and Sport | Commons debates What steps she is taking to support grassroots sports venues.\nGrassroots Sports | Culture, Media and Sport | Commons debates Certain sports often remain inaccessible to women and girls early on, making it harder for them to join later.\nGrassroots Sports | Culture, Media and Sport | Commons debates What steps she is taking to support grassroots sports venues.\nGrassroots Sports | Culture, Media and Sport | Commons debates Certain sports often remain inaccessible to women and girls early on, making it harder for them to join later.\nGrassroots Sports | Culture, Media and Sport | Commons debates What steps she is taking to support grassroots sports venues.",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk/content_1.html": "Rickmansworth Waterways Trust 24th April 2025 Read full article Special Educational Needs and Disability Support Building Accessible Local Infrastructure Facebook Gagan writes letter to DBC regarding Shendish Manor and Hill Farm 24th April 2025 Read full article Flooding Safer Streets Podcast St George’s Day 23rd April 2025 Read full article Protecting the Green Belt and Waterways Supporting Local Businesses and High Streets Contact Westminster OfficeHouse of Commons, London SW1A 0AA0207 219 3000[email protected]On FacebookOn Instagram",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_surgeries-0/content_2.html": "If you would like to request an appointment with me, please fill in the details below and supply as many details as possible.\nIf on this occasion I cannot provide you with an appointment, I would be more than happy to reply to any concerns you have or wish to discuss through email.\nPhotos may be taken for use on social media. If this is a problem, please indicate this.",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_radio-gagan-podcast/content_4.html": "In order to try and keep constituents updated with my activity as their Member of Parliament, I have decided to record a monthly podcast called Radio Gagan!\nOn the programs will be discussing my day-to-day activity, general issues from constituents and my take on the current situation in politics and in the wider UK context. I hope you enjoy these episodes!\nYou can access my podcast on either Spotify or YouTube below:",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_campaigns_building-accessible-local-infrastructure/content_8.html": "Public transport is vital to so many residents in South West Hertfordshire and I remain committed to improving existing services and seeking to expand them where needed. The COVID-19 pandemic changed the way we work, interact and even travel. I have been made aware that passengers using rail and buses has decreased in the last few years meaning many operators have had to cut back on the services they can provide.\nI will continue to work with operators on how I can help support them to ensure that public transport remains accessible to everyone across the constituency.",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_campaigns_safer-streets/content_6.html": "Every person should feel safe whether it be out and about or in their own home. I am proud that Hertfordshire is one of the safest places to live in the country, but I am continuing to work with local police forces and the Hertfordshire Police and Crime Commissioner, Jonathan Ash-Edwards, on improving neighbourhood policing.\nI have been pleased to take part in 'ride-alongs' to see what an excellent job our local Police Officers in keeping us safe and cracking down on those committing serious crimes.",
  "https_www_gaganmohindra_org_uk_/https_www_gaganmohindra_org_uk_newsletter/content_5.html": "Every month, I produce a Newsletter to inform my constituents of everything I have been doing, both in the constituency and Westminster as their Member of Parliament. If you would like to receive my Newsletter straight to your Inbox, please do sign up using the form."
}