{
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-spurrell-elected-as-merseyside-police-crime-commissioner/content_28.html": "Emily Spurrell has been elected as the Police & Crime Commissioner of Merseyside.\nEmily thanked voters across Merseyside after she collected 178,875 votes, taking more than half the first preference count and was elected the winner on Saturday 8th May.\nThroughout her campaign, Emily has promised to deliver visible and accountable policing, give victims and communities a greater voice and push for a fairer and more effective criminal justice system.\nWithin her manifesto, she has pledged to introduce police scrutiny panels, hold regular public meetings with the Chief Constable, and give victims a louder voice by establishing a Victims’ Panel to give victims and survivors the opportunity to highlight how services can be improved and hold the police and her to account. She has also spoken of her commitment to working with key partners to create a Violence against Women and Girls strategy.\nEmily said: “I’m absolutely delighted that the public of Merseyside have given me the mandate to serve as their next Police and Crime Commissioner.\n“I promise to be a visible and proactive Police and Crime Commissioner, acting as a powerful voice on behalf of all the communities of Merseyside on policing and community safety issues. I want people to see the value and the importance of this role and I will demonstrate it over the next three years by standing up for our region and demanding better for local people.\n“I’m also determined to give victims of crime a greater voice. Sadly too many victims still feel let down by the police because they have moved on to their next crime. I want people on Merseyside to feel the police and the criminal justice system is on their side and I will challenge all the agencies involved in this process to do better for the people they are there to protect.”\nEmily will officially take office on Thursday 13th May.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_category_news_page_3/content_73.html": "Tackling shoplifters is a priority as Safer Business Action Week springs into action\nMerseyside PCC Emily Spurrell is urging retail and business workers to help tackle shoplifters by reporting any criminal incidents or abuse they experience. It comes as Merseyside Police kick-started Safer Businesses Action Week with a conference that brought together Liverpool BID, Northwest Regional Organised Crime Unit’s SaferCash, Northwest Cyber Resilience Centre, Whitechapel Centre, Counter Terrorism…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_pcc-calls-on-community-groups-as-proceeds-of-crime-funding-gives-back-to-garston/content_12.html": "Emily Spurrell is calling on community groups, charities and organisations in Garston to apply for a share of £25,000 funding, made available using money seized from criminals.\nFrom today (Monday 4 December), community groups operating in Garston, or intending to use the funding within this area, can apply for grants of up to £5,000 to deliver a project focused on youth engagement and intervention.\nThe funding has been made available using funds seized from criminals under the Proceeds of Crime Act.\nWith the focus on projects which aim to reduce and prevent crime and antisocial behaviour through youth engagement and interventions, bidding groups will have to go back to the classroom and pitch their ideas to a group of schoolchildren from primary and secondary schools.\nThey will decide who receives a share of the £25,000 funding pot at the Giving Back to Garston participatory budget event in February 2024. It will take place at The Academy of St Nicholas and bring together students from the Academy and five local primary schools to take part in the voting – St Austin’s, Garston CE, Banks Road, Gilmour Juniors and Holy Trinity.\nMerseyside’s Police Commissioner Emily Spurrell said: “This is a fantastic opportunity for those organisations in Garston, who contribute so positively to their communities, to benefit from the ill-gotten gains of criminals.\n“By taking the money out of the pockets of criminals and putting it back where it belongs, we can channel it towards the areas that need it most, helping to grow local groups, increase opportunities for our young people and create safer, stronger places to live for us all.\n“Merseyside Police will never give up in its pursuit of criminal gangs and we are determined to prevent those who inflict misery on our communities from benefitting financially from their illegal activities.\n“The money we seize from those who seek to harm our communities, will instead now be used for good – enhancing the vital work our brilliant third sector organisations do within their communities and I look forward to hearing their pitches at the event in February, and seeing who the schoolchildren choose to be beneficiaries of this funding.\n“I would encourage all local groups to apply for a share of this funding focused on making our communities better places to live, work and play in the months and years to come.”\nThose applying for the fund can be from a Garston based voluntary or community group or intend to use the funding to benefit residents in this specific area.\nAll applications for funding must demonstrate how they will contribute to the key theme of ‘Youth engagement and intervention’.\nFind out more and how to apply here. The closing date for entries is 4pm on Monday 8 January 2024. Successful applicants will be announced at the Giving Back to Garston event in February 2024.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_police-crime-plan/content_68.html": "In October I launched my Police and Crime Plan, which sets out our priorities for the next four years for how we build a safer Merseyside\nThe Chief Constable reports back to me on progress made against these priorities, which include proactive policing, supporting victims and a focus on preventing offending.\nIt’s my job to hold the police to account and make sure they deliver on the plan so if you know areas where the police could do better please do let me know. You can contact me at emily@emily4merseyside.com.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_latest_page_7/content_17.html": "Emily Spurrell chosen as the Labour Party candidate for Merseyside Police and Crime Comissioner\nI am delighted to have won the nomination to be Labour’s candidate in next year’s Police and Crime Commissioner elections here in Merseyside. It has been a privilege to speak to so many people over the last three years, and especially the last six weeks of this selection process, about policing and criminal justice. I…\nRead more\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_vision-zero-launch/content_24.html": "Deaths and injuries on our roads are neither acceptable nor inevitable. They are preventable. That’s why we have launched Vision Zero – an ambitious new Plan which sets out how Merseyside’s Road Safety Partnership, as a collective, want to reduce the number of fatalities and casualties on our region’s roads, with the ultimate aim there are no avoidable collisions on our roads – making them safer, cleaner and greener for everyone.\nFind out more – Vision Zero strategy launched to drive road safety across Liverpool City Region: Merseyside Police and Crime Commissioner (merseysidepcc.info)",
  "https_emily4merseyside_com_/https_emily4merseyside_com_improvement-works-in-huyton-completed-following-pcc-funding/content_72.html": "Earlier this year, a programme of improvement works commenced at Primrose Court in Huyton as part of the Safer Streets project.\nThe works are now complete and include a new road surface, street lighting, the installation of CCTV, boundary fences and security devices for homes on the estate – all of which are aimed at preventing anti-social behaviour and making residents feel more secure in their homes. A number of empty homes that were in disrepair have also benefitted from upgrades by the home owners to bring them back into use.\nThis complements the ongoing work already taking place in the area including police high visibility patrols and clean-up operations to remove fly tipping and graffiti.\nAs well as this key infrastructure and enforcement work, Knowsley’s Crime and Communities Team has been working closely with the local community to understand their needs. This has resulted in stronger links established with young people, parents and community leaders, who are all working with partners to improve their local area.\nNew children’s play equipment has been installed at Hillside Community Centre, as well as improvement works to the surrounding green spaces.\nThe works, totalling £367,000, have been funded by the Home Office’s Safer Streets Fund, which was secured by Merseyside’s Police Commissioner.\nPrimrose Court was identified as a priority area due to historic issues caused by the street being un-adopted and left unlit and in a poor state of repair by the original developers. As a result, the area attracted incidents of fly tipping and anti-social behaviour.\nMerseyside Police and Crime Commissioner Emily Spurrell said: “Tackling anti-social behaviour is a priority for me and our local authorities and partner organisations. I’m committed to improving safety right across our communities so that the people living in them feel more secure. That means focusing our efforts in areas where we know local people are facing challenging issues.\n“Sadly, this part of Knowsley was one those areas where we had seen incidents of crime and ASB spike but through this Safer Streets project we’re focusing on putting practical, effective solutions in place to reduce ASB and make it a safer, cleaner and healthier place to live.\n“It’s great to see the work that’s been delivered so far and the vital difference this is already making in helping to provide safer more engaging spaces to live in and I look forward to seeing how this project will continue to change things for the better.”\nCllr Shelley Powell, Cabinet Member for Communities and Neighbourhoods added: “We know crime and anti-social behaviour in Primrose Court has been an issue and one we and our community safety partners including Merseyside Police and the Merseyside Police and Crime Commissioner have been addressing for some time.\n“I’m delighted work has now been completed to improve the area and address a number of priority issues for local residents so that we can create long-term change and rejuvenate the area.”\nBerna Thompson, from Hillside Neighbourhood Centre, said: “It’s been great to see the community come together and work with agencies for the benefit of the local area. The improvements delivered here at the community centre have been identified by the young people from the local community and include a minibus for the centre, which will be an invaluable asset and additions to the community centre that will be enjoyed for many years to come. We are all passionate about our local area and we are incredibly proud of what has been achieved.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_category_social-media/content_52.html": "Skip to content\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nCategory:\nSocial Media\nFair and Effective Criminal Justice System Video\nSunday 21 March 2021\nSupporting Victims and Communities Video\nSaturday 20 March 2021\nVisible and Accountable Policing Video\nFriday 19 March 2021",
  "https_emily4merseyside_com_/https_emily4merseyside_com_over-37000-people-to-benefit-from-community-safety-projects/content_56.html": "More than 37,000 people across Merseyside are set to benefit from 20 projects funded by the region’s Police Commissioner to help increase safety and boost community spirit in their areas.\nA community café for older people, a horticultural project for young people and a host of projects focused on tackling anti-social behaviour are all among the initiatives which have been awarded grants from Emily Spurrell’s new Neighbourhood Resilience Fund.\nNeighbourhood groups are also set to use the funding to improve a shared garden, install CCTV, run classes for young people and hold sessions to increase community cohesion.\nThe Commissioner launched the Fund in June to help foster and maintain more resilient, safe, and caring communities across Merseyside.\nIt is designed to give community groups across Merseyside a small but vital cash boost to work with local police teams to solve problems in their area, and protect their neighbourhoods, while encouraging residents to be alert and aware of issues.\nAmong the organisations receiving funding are Onward Homes who have received a grant to provide two community hubs in areas which have been blighted by ASB. The events in Beechwood on the Wirral and on the border between North Liverpool and Knowsley will provide a safe space for residents to discuss their concerns with the police and other partners.\nAlso among the recipients are Maghull Town Council who will use the funding to create a Youth Council to increase understanding of what provision young people would like to see in the town and support the development of a volunteering scheme.\nSeveral other organisations, including Rawden Residents Associations, Liscard Community Links and Team Oasis, will also use their grants to help transform and improve their spaces and create community gardens.\nFunding will be used by the Fazakerley Federation to hold a weekly breakfast morning, while Age UK Wirral will put the money towards creating a community café in West Kirkby.\nThe launch of the Neighbourhood Resilience Fund is a key way the PCC is delivering on her priority of Supporting Victims and building Safer Communities.\nMerseyside’s Police Commissioner Emily Spurrell said: “Merseyside is full of communities that care. We benefit from having lots of brilliant community organisations which are working hard to make their areas safer, more resilient, and better connected.\n“I launched my Neighbourhood Resilience to help support their efforts and empower local people to take action.\n“From creating new communal spaces and green places to community cafes, breakfast clubs, improved CCTV and events to improve cohesion, there were some fantastic projects put forward.\n“Whether it’s enabling a grassroots group to kickstart a new project or improve and expand their existing work, these grants are all designed to cultivate local resilience and security, whilst offering reassurance to the most vulnerable people living in their areas and boosting community spirit.\n“I can’t wait to see the impact they have over the coming months and years.”\nGroups applying to the funded needed to show how their project would prevent crime, increase community safety and cohesion, improve the environment or wellbeing of their community, make their roads safer, engage young people or build and enhance local networks.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_youre-safe-here-scheme-rolls-out-in-liverpool/content_79.html": "In response to the awful homophobic attacks we saw over the Summer, I partnered with LCR Pride and Liverpool Nightlife CIC to launch the You’re Safe Here scheme.\n53 venues have now completed the training and signs like the one pictured will be appearing across Liverpool to provide a safe place for people to go if they are feeling vulnerable.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_call-for-improved-protection-for-vulnerable-adults-in-custody/content_27.html": "As the national PCC lead for Custody, I have called for the provision of an appropriate adult service to be a statutory service to ensure no vulnerable adult such as those with a learning disability, is left without support in custody.\nAs the national PCC lead for Custody, I have called for the provision of an appropriate adult service to be a statutory service to ensure no vulnerable adult such as those with a learning disability, is left without support in custody.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_money-seized-from-criminals-to-be-used-to-protect-businesses-from-cyber-attack/content_16.html": "Up to 300 Merseyside businesses will benefit from the first free police-backed cyber resilience programme in the region, launched by the North West Cyber Resilience Centre\nThe Merseyside Cyber Security Programme has been funded by Merseyside’s Police Commissioner Emily Spurrell and Merseyside Police Chief Constable using money and assets seized from criminals through the Proceeds of Crime Act, which they are channelling into positive initiatives to prevent crime and protect the vulnerable.\nThe programme offers free training and education to small and medium-sized businesses across the region to help tackle the growing threats posed by cyber attacks, such as phishing or malware attacks.\nThe initiative was officially launched at ACC Liverpool by the Police Commissioner, the Chief Constable and the North West Cyber Resilience Centre (NWCRC), and is supported by Mayor of the Liverpool City Region Steve Rotheram.\nMerseyside’s Police Commissioner Emily Spurrell said: “Merseyside Police work relentlessly to ensure crime does not pay, stripping criminals of the cash and assets they make from their illegal activities.\n“We are determined to use that money for good – reinvesting it to prevent crime and build a safer, stronger Merseyside. Small and medium-sized businesses are the backbone of our communities. We want to protect them, their employees, and their customers, so I’m delighted to be launching the Merseyside Cyber Security Programme today, focused on keeping them safe from the growing threat of cybercrime.”\nMayor of the Liverpool City Region Steve Rotheram, said: “Thriving businesses are the engine of our economy and, for our area to flourish, we need to put them in the best position to succeed. In an increasingly digital world, we want to help protect our local SMEs from any potential threats that may come their way – so that they can continue to help our area on its journey to becoming the best place in the country to live, work and run a business in.”\nThe Government’s recent Cyber Security Breaches Survey 2023 found that a third (32%) of businesses and a quarter of charities (24%) suffered a cyberattack in the last year. For medium size businesses, this figure rises to 59% and for large businesses it’s even higher at 69%. However, only 30% of businesses said they used tools for security monitoring, and only 29% said they did a risk assessment covering cybersecurity risks.\nThe NWCRC was set up in 2019 as a pilot scheme for Greater Manchester to support businesses in the region with the growing threat of cybercrime and cyber fraud. It was so successful that it was expanded for the whole North West region and then also rolled out to other regions across England and Wales and included in the HM Government National Cyber Strategy 2022. The NWCRC now has just under 800 members and continues to grow year on year.\nTo find out more and sign your business up for the training, visit https://www.nwcrc.co.uk/merseyside\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_latest_page_3/content_11.html": "Tackling shoplifters is a priority as Safer Business Action Week springs into action\nMerseyside PCC Emily Spurrell is urging retail and business workers to help tackle shoplifters by reporting any criminal incidents or abuse they experience. It comes as Merseyside Police kick-started Safer Businesses Action Week with a conference that brought together Liverpool BID, Northwest Regional Organised Crime Unit’s SaferCash, Northwest Cyber Resilience Centre, Whitechapel Centre, Counter Terrorism…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_dying-to-work-pledge/content_26.html": "Earlier this year I was proud to officially gain recognition from the Living Wage Foundation demonstrating our commitment to ensuring staff are paid a fair wage for the work they do. This month, in partnership with the Chief Constable, our Police unions and TUC, I have signed up to the TUC Dying to Work pledge, confirming our support for officers and staff who are facing a terminal diagnosis.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_she-inspires-football-tournament/content_39.html": "Last weekend I was delighted to host the She Inspires football tournament, a joint initiative with the Chief Constable, which saw 120 young women provided with the opportunity to develop their football skills and gain qualifications to help them reach their full potential.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_bus-stations-safe-spaces-for-those-facing-distress-or-intimidation/content_69.html": "Merseyside Police and Crime Commissioner Emily Spurrell and Liverpool City Region Mayor Steve Rotheram have launched a brand new initiative aimed at helping people who feel vulnerable, distressed or are being targeted with abuse or intimidation.\nBus stations across the Liverpool City Region will become ‘safe spaces’ for those who need them. The idea is to provide a temporary refuge where people can go if they need help and support while they call and wait for a family member or friend to collect them, or for the police to arrive.\nThe initiative is part of LCR Pride Foundation’s ‘You’re Safe Here’ scheme, funded by the Police and Crime Commissioner (PCC) which aims to reassure people that they are in a safe place that staff will know what to do if they are a victim of a crime, need help, or are faced with intimidation or other unacceptable behaviour.\nStaff have also been trained to provide help and reassurance to those who need assistance, as well as information on available support services, with designated safe place champions at each major bus station in the city region; Birkenhead, Bootle, Huyton, Liverpool ONE, Queen Square and St Helens.\n‘You’re Safe Here’ posters and digital signs will be displayed around travel hubs and bus stations, to let people know they can go to a member of staff and ask for help if they need to.\nMerseyside’s Police Commissioner Emily Spurrell said: “Merseyside is such a friendly, inclusive region and we are determined to ensure everyone who lives, works and visits here feels safe.\n“You’re Safe Here and Safer Streets Merseyside are both initiatives I’m proud to be delivering focused on protecting people in our communities and increasing feelings of safety. It’s fantastic that staff at our major bus stations have engaged with both these schemes so enthusiastically and have pledged to making these locations safe spaces for anyone who needs support.\n“It’s yet another example of how determined local people are to go out of their way to help others and make sure our region is safe and welcoming for all.”\nSteve Rotheram, Mayor of the Liverpool City Region said: “Hundreds of thousands of people rely on our public transport network to get about every day. Every single one of them deserves to feel safe and comfortable when travelling around our region but, sadly, we know this isn’t always the case.\n“In the Liverpool City Region, we’re investing in better CCTV at bus stops and have secured the role of a second safety critical person on all our new £500m publicly owned trains, which are fitted with real time CCTV. We’re making great progress – but there’s still more work to be done.\n“While I wish people were never faced with situations where they feel vulnerable on our streets or public transport, we want to reassure them that, should they need it, our safe spaces mean that there’s now always a place for them to go and someone to talk to.”\nAndi Herring, CEO of LCR Pride Foundation: “When it comes to feeling safe, we shouldn’t just be confined to the spaces or businesses that we are familiar with.\n“Hundreds of thousands of people use our city’s bus networks to get to work and for leisure and this commitment from the Combined Authority that all of the region’s bus stations will be ‘You’re Safe Here’ accredited means that people can be reassured teams know what to do if they need support or feel unsafe.”\nSafe Spaces are the newest initiative from the Safer Streets campaign, a £750m PCC-led scheme which aims to increase safety around the transport network, particularly for women, across the Liverpool City Region.\nOther measures rolled out as part of the Safer Streets campaign include enhanced CCTV coverage at key transport hubs, new ‘help points’ linked to emergency services and a text message service which can be used to report concerns on the bus network and identify offenders.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_victim-care-merseyside-hub/content_30.html": "I am absolutely thrilled to announce the launch of the new Victim Care Merseyside hub – a team of real people on hand to make a real difference if you’ve been affected by crime.\nThis dedicated, specially trained team has been created to act as a single point of contact for all victims of crime on Merseyside, providing free, confidential, non-judgemental advice and emotional and practical support. No matter when the incident happened, or whether it was reported to the police or not.\nVictims of crime are some of the most vulnerable members of our community and I am committed to ensuring they get the right support, in the right way, at the right time.\nYou can find more about the new hub here – Victim Care Merseyside hub launched by region’s Police Commissioner: Merseyside Police and Crime Commissioner (merseysidepcc.info)",
  "https_emily4merseyside_com_/https_emily4merseyside_com_merseyside-womens-services-alliance-relaunched/content_46.html": "Merseyside’s Police Commissioner, Emily Spurrell, has today relaunched the region’s Women’s Services Alliance with the aim of cutting crime and preventing women’s lives being derailed by short prison sentences.\nThe majority of women sent to prison in England and Wales last year were handed sentences of six months or less, according to the Prison Reform Trust. Non-violent crimes like shoplifting were the most frequent offence.\nYet these short sentences are known to have huge consequences, leading to women losing their jobs, custody of their children and their homes, leaving families devastated.\nThe Commissioner has relaunched Merseyside’s Women’s Services Alliance to focus on how partners can work together to try and prevent women offending, while also identifying where community sentences may be an appropriate alternative, avoiding the harm a prison sentence causes to them and their families.\nThe Alliance, which met for the first time today, brings together strategic partners from across criminal justice agencies, statutory and third-sector organisations. Chaired by Deputy Police Commissioner, Cllr Jeanie Bell, it will focus its efforts on further improving the way all agencies across Merseyside respond and support women already in the criminal justice system and those on the edge of offending, to improve outcomes for women and families across the region.\nBy seeking to identify and put effective interventions in place to prevent and reduce the causes and triggers of women offending and reoffending, the Alliance will be focused on trying to break the cycle of crime.\nThe work of the Alliance will support the PCC’s policing and crime priority to Drive Change and Prevent Offending within her Police and Crime Plan. As national Joint Lead for Criminal Justice and Custody on behalf of all Police and Crime Commissioners, Emily is also focused on bringing learning and best practice to Merseyside, while driving improvements nationally.\nMerseyside Police and Crime Commissioner, Emily Spurrell said: “When women with experiences of violence, poor mental health and addiction are left unsupported, families can be torn apart and communities can face more crime, crime that could have been avoided if the right interventions were in place.\n“Many women who are caught up in the criminal justice system are among the most vulnerable in society. Many have also been the victim of far greater crimes than the ones they’ve committed, and this can be a driver for their offending.\n“We need to meet the needs of women when they come into services, and not just at the point of entering the criminal justice system.\n“By responding to their needs and taking a preventative approach, we can cut crime, improve lives and help families stay together, helping to protect the lives of children and young people as well.\n“I am really grateful to all the partners for their commitment to reforming this improved partnership focused on driving forward real change and creating better outcomes for the lives of women and our communities.”\nThe Alliance will deliver against a series of key strategic objectives, which are set in the national Female Offender Strategy Delivery Plan, coordinating a cross-sector response to women in the criminal justice system, and those on the periphery of offending.\nDeputy Police and Crime Commissioner, Cllr Jeanie Bell said: “Women are far more likely to receive a short prison sentence for ‘lower level’ offences than men. These short sentences, sometimes just days or weeks, can have a devastating effect, leading to women losing their homes and custody of their children.\n“This in turn has a far greater impact on the lives of entire families, young people and the communities in which they live in. Evidence shows that community interventions can be a far more effective way to rehabilitate women, helping to address underlying issues, and prevent them from reoffending.”\nThe Probation – North West Division’s strategic lead for women, Carla Jones, added: “Women in contact with the criminal justice system are amongst the most vulnerable in society. Many experience trauma, domestic abuse, mental health problems or have a history of alcohol and drug misuse. Factors that can lead men and women to commit crime, and to reoffend, can vary significantly.\n“We know an approach that takes account of the different needs and backgrounds of women is most effective in addressing their offending behaviour.\n“The re-launch of the Merseyside Women’s Service Alliance provides a real opportunity for Merseyside partners to come together to develop a whole systems approach in addressing the often complex needs of women in, or at risk of entering, the Criminal Justice System.\n“The Alliance will maximise opportunities to break down the barriers often faced by female offenders and in some cases prevent offending through early intervention and diversion from the criminal justice system into much needed support.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_author_gas4541_ss7226sf/content_81.html": "Latest News\nEmily Spurrell re-elected as Merseyside Police and Crime Commissioner\nLabour’s Emily Spurrell thanked voters on Merseyside for re-electing her to be the region’s Police and Crime Commissioner for a second term. Emily took 61.7% of the vote, beating challenges ...\nLabour’s Police & Crime Commissioner pledges a safer, stronger Merseyside\nLabour’s Police Commissioner Emily Spurrell has today launched her manifesto setting out her commitments if re-elected for a second term on Thursday May 2nd. Emily was first elected in 2021 ...\nCrime across Merseyside drops by 13% in year\nCrime across Merseyside has fallen by 13% in the past year, with significant decreases in gun discharges, knife crime and burglary. The reductions were confirmed yesterday at the Police and ...\nA record of delivery\nSome of my key achievements since taking office in 2021\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-welcomes-long-overdue-pay-rise-for-hardworking-police-officers/content_14.html": "Merseyside’s Police Commissioner has responded to today’s news that police officers will receive a pay rise of 7%.\nIt comes after the Government accepted the recommendations put forward by the Police Renumeration Review Body (PRRB).\nMerseyside’s hard-working police officers are long overdue a proper pay rise, so I welcome the announcement that their dedication and service will finally be recognised with a 7% pay increase.\nAfter many years of pay freezes and the cost of living crisis, this increase will make a difference easing the day-to-day financial pressures our officers and staff are facing. However the real terms pay of officers has decreased by 17% since 2010, so this will not put an end to their financial struggles.\nI met with the Policing Minister earlier today and he has assured me that this pay increase will be fully funded and will therefore not create a further blackhole in the police budget or create an additional cost to taxpayers.\nI will study the details of the settlement closely to ensure this is the case. While today’s announcement explicitly references officers, it is important that police staff are equally recognised.\nAs many of us look forward to attending tonight’s Police Bravery Awards, I am pleased the tireless work, professionalism and courage our officers show day in, day out serving our communities, has been recognised through this pay award.\nMerseyside’s Police Commissioner Emily Spurrell",
  "https_emily4merseyside_com_/https_emily4merseyside_com_no-excuse-for-sexual-violence-this-freshers-week/content_38.html": "A campaign making it clear there is No Excuse for sexual violence will go live across the region again as thousands of students arrive and return for the start of the academic year.\nSafer Streets Merseyside is an awareness-raising campaign focused on preventing sexual violence particularly in the night-time economy and the public transport – two areas women highlighted as of being particular concern.\nIt focuses on identifying and calling out unacceptable and harmful behaviours and making it clear there is a zero-tolerance approach to sexual violence in Merseyside, while also encouraging anyone who has been affected by sexual violence to reach out for support.\nOver the next month, campaign messaging will be featured prominently in areas of student accommodation, around the universities, in the city centre, across the transport network and in popular student bars. Artwork will also be going up in areas surrounding other educational centres across the region, such as Wirral Met, St Helens College and Hugh Baird College.\nA giant ad-van will also carry the message targeted at potential perpetrators and highlighting there is no excuse for behaviours such as catcalling and unwanted sexual comments, groping and uninvited touching.\nThe powerful visual marketing campaign is supported by a range of proactive initiatives all designed to tackle sexual violence, including students from Liverpool John Moores University being trained as ‘guardians’ to provide support to those who need it in Liverpool’s night-time economy, such as helping people get home or providing emotional support.\nSafer Streets Merseyside has already seen 33 extra high visibility CCTV cameras installed in the city centre, at transport hubs and along key bus routes used by students and other young people to head into and out of the city centre at night. There has also been an increased uniformed police presence in transport hubs and along Liverpool’s dedicated student bus routes and into the night-time economy at peak times on Friday and Saturday nights, as well as dedicated student event nights.\nLed by Merseyside’s Police Commissioner, Emily Spurrell, and Liverpool City Council, Safer Streets Merseyside is funded by the Home Office and was developed following a survey by the Police Commissioner which showed 54% of women felt unsafe using public transport in Merseyside at night and nearly 42% had concerns about using it in the day.\nThe campaign was developed following extensive consultation with stakeholders, those using public transport, student groups and young people.\nIt has been supported by a wide range of partners including Merseyside Police, RASA Merseyside, the Merseyside Violence Reduction Partnership, Liverpool City Region Combined Authority, Liverpool John Moores University and Culture Liverpool, as well as the region’s four other local authorities.\nThis campaign is an integral part of the Police Commissioner’s region-wide VAWG Delivery Plan which sets out a clear ambition to protect women and girls who live, work and visit Merseyside, prevent violence and pursue offenders.\nMerseyside’s Police Commissioner Emily Spurrell said: “There is No Excuse for sexual violence and it’s important we take a proactive approach to tackling this issue. As tens of thousands of students arrive and return to our region, I want to reassure them that we take their safety very seriously and we will not tolerate sexual violence of any kind.\n“Catcalling and unwanted sexual comments, taking explicit images without consent, groping and uninvited touching – these are all forms of sexual violence that no girls or woman should have to endure.\n“Our campaign is designed to challenge would-be perpetrators and make it clear that we take a zero-tolerance approach to these utterly unacceptable and harmful behaviours, while also supporting women to get support if they’ve been affected.\n“Critically, Safer Streets Merseyside is also working to change attitudes and mindsets. By engaging with the next generation, we’re starting conversations early that are focused on encouraging long-term behaviour change.”\nCouncillor Laura Robertson-Collins, Liverpool City Council’s Cabinet Member for Communities, said: “We have thousands of female students arriving in the city this month and this campaign is designed to be very clear that there should be zero tolerance of sexual violence towards women and girls.\n“It is vital we give those affected the ability to report it quickly and easily, and also for others to have the confidence to know that it must be challenged.\n“This is all part of our commitment to work with partners to tackle these issues and change the behaviour of those who don’t show respect and safety for women.”\nAbout Safer Streets Merseyside\nFirst launched in March 2022, the campaign is delivering:\n- A ‘guardian project’, with LJMU student volunteers trained to provide support to those who need it in Liverpool’s night-time economy, such as helping people get home or providing emotional support.\n- Enhanced high visibility CCTV coverage along key bus routes used by students and other young people to head into and out of the city centre at night.\n- The creation of ‘safe space’ at each of the bus stations for anyone who feels vulnerable within travel centres at each of the bus stations.\n- An increased uniformed police presence in transport hubs and along Liverpool’s dedicated student bus routes and into the night-time economy at peak times on Friday and Saturday nights, as well as dedicated student event nights.\n- Educational training extended to reach more than 130 primary schools across the region raising awareness of staying safe online, sexual harassment and misogyny.\n- A new adult education programme looking to challenge misogynistic language and attitudes using a creative resource and digital activity which is anticipated to reach up to 53,000 employees across the region.\n- ‘Bystander training’ for bus drivers and frontline bus station staff to help them better understand and know how to prevent sexual violence. The training will equip them to act as ‘guardians’, to make passengers feel safer.\nTo find out more, please visit: www.saferstreetsmerseyside.com\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_a-real-living-wage/content_22.html": "I was really proud this month to be officially recognised by the Living Wage Foundation as a Living Wage employer. It’s more important than ever that staff get paid a fair wage for the work they do. It was a commitment I made to deliver in my first year of office and so I’m pleased to have been able to work with the unions at Merseyside Police to make this happen.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_latest_page_5/content_51.html": "Government policing settlement\nJust before Christmas the Government announced the policing settlement and, not unsurprisingly, it was severely lacking . They continue to push the burden onto local tax payers who are already struggling under the cost of living crisis, created by this Government, and I will continue to raise my concerns with the Policing Minister and call for a…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_fair-and-effective-criminal-justice-system/content_32.html": "Skip to content\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nFair and Effective Criminal Justice System Video\nEmily Spurrell\nSocial Media\nSunday 21 March 2021\n|\n0\nShare this:\nFacebook\nTwitter\nPost navigation\nPrevious:\nPrevious post:\nSupporting Victims and Communities Video\nNext:\nNext post:\nEmily Responds to Liverpool Council Investigation",
  "https_emily4merseyside_com_/https_emily4merseyside_com_thousands-of-young-people-to-benefit-from-safe-engaging-activities-this-halloween-and-bonfire-night/content_71.html": "More than 4,000 young people will be able to enjoy safe, engaging activities this Halloween and Bonfire Night, thanks to the Merseyside Police Commissioner’s Youth Diversion Fund.\nLocal charities, organisations and community groups were invited to apply for a share of £50,000 to go towards projects to help keep young people active and engaged around the autumn half-term, a time when emergency services typically report a spike in incidents of anti-social behaviour and criminal activity.\nIn total, 24 grassroots initiatives will each receive grants towards diverting young people away from crime and ASB, helping to ease the pressure on our emergency services and helping to maintain safety and security in the community.\nAmong the successful recipients are The Opening Doors Project in Walton who are holding a Halloween craft and food and fancy-dress event including a zombie walk for 600 young people.\nPowered by Hip Hop CIC will be helping to keep more than 100 young people off the streets in St Helens with graffiti sessions and break-dancing workshops as well as a Halloween BMXing, scooting, skateboarding and parkour event while Shy Lowen in Netherton will be providing an animal experience with horses designed to look like skeletons using chalk as well as scary scarecrow activities for 250 young people.\nIn Knowsley, Evolving Mindset CIC will be delivering a DJing course designed to empower and engage young people who are identified as being at risk of getting involved in ASB or crime in Prescot across Halloween, and Bonfire Night.\nAll the funded projects will complement Merseyside Police and Merseyside Fire and Rescue Service’s annual operation focused on preventing and reducing ASB during the school break.\nIt is the fifth round of grants since the Commissioner launched her Youth Diversion Fund in August 2021, meaning 125 projects have now shared more than £350,000 to deliver projects benefiting a total of nearly 21,500 young people across Merseyside.\nMerseyside’s Police Commissioner Emily Spurrell said: “Halloween and Bonfire Night are times when families and communities across Merseyside come together, with the vast majority enjoying fun and exciting times together. Sadly, though there will always be a minority who take things too far and see this period as an opportunity to engage in types of behaviour that can have a negative impact on our communities.\n“Tackling anti-social behaviour is a priority for me and I’m very proud that through my Youth Diversion Fund, these fantastic organisations and initiatives can provide a variety of supervised activities and opportunities to a diverse range of young people with the aim of preventing ASB and crime.\n“Historically, it is also a particularly busy time for the police and the fire service. Through these grants, I want to help alleviate some of this extra pressure that our blue light services experience at this time of year, as well as supporting the excellent diversionary work already being carried out by Merseyside Police and Merseyside Fire and Rescue Service.\n“Our voluntary and third sector organisations are embedded in our communities, and they already know how to make the most of such grants to benefit their local areas. I’m excited to see the positive impact the vast array of imaginative and creative projects they have proposed benefits our young people and keeps our communities safe and secure. “\nThe Youth Diversion Fund takes money raised through the Police Property Act which sees money from the sale of unclaimed stolen goods or property recovered by the police which cannot be returned and diverts it towards worthwhile causes that benefit our communities and the people who live in them.\nA total of 61 applications were considered by the panel, with a combined value of more than £157,438.\nTo avoid any duplication, bids were shared with partners before being reviewed by a panel from the Commissioner’s team and the Community Foundation for Merseyside (CFM), who manage the fund on the PCC’s behalf. CFM holds funds from individuals and organisations as donors who wish to support deserving causes in Merseyside.\nAs a result, 8 organisations in Liverpool were awarded funding, with 5 projects running on the Wirral, 5 in Sefton, 2 in St Helens and 4 in Knowsley.\nJames Proctor from Community Foundation for Merseyside said: “The Merseyside Police and Crime Commissioner’s Youth Diversion Fund is a fantastic funding programme that supports our local grassroots community organisations and their engagement work.\n“Halloween and Bonfire evenings are fun events for children and young people though they are also traditionally times when anti-social behaviour can increase.\nCommunity organisations offer the chance for children and young people to get involved in organised events such as Halloween parties, sports and cultural activities delivered in a supporting environment which keeps them safe.”\nFind out more about successful bids here.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_government-policing-settlement/content_77.html": "Just before Christmas the Government announced the policing settlement and, not unsurprisingly, it was severely lacking . They continue to push the burden onto local tax payers who are already struggling under the cost of living crisis, created by this Government, and I will continue to raise my concerns with the Policing Minister and call for a more progressive way for funding public services.\n“This announcement causes real concern.\n“While it is a relief that funding will continue to be provided to recruit officers to replace some of those lost during nearly a decade of austerity, it is deeply disappointing that, yet again, no extra money has been provided by the government to cover any pay rise or inflationary pressures, which are now at record levels.\n“Furthermore, ministers have completely failed to explain how the increase in National Insurance rates will be funded, despite previously indicating the bill would be picked up by central government.\n“If we are forced to fund this locally, it will set Merseyside Police back £2.2m – money we simply cannot spare.\n“The biggest disappointment though, is that this statement makes it overwhelmingly clear ministers are once again presuming the shortfall can come out of the pockets of local people, by expecting Police and Crime Commissioners to increase council tax.\n“This is grossly unfair – particularly for a region like Merseyside which has high levels of deprivation, when they should be taxing those who can afford it most.\n“The reality is that you can’t deliver effective policing and keep communities safe on the cheap.\n“If I chose to go against government expectation and not ask local people to pay more, Merseyside Police will be left with an even bigger blackhole. This will have long-term consequences for policing our region.\n“Policing was cut to the bone by this Government. Even with the current recruitment drive, Merseyside Police will still be 440 officers short of the numbers it had back in 2010.\n“This government makes big statements about funding our police service, but the reality is they are still cutting – they’re just using smoke and mirrors to do it.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_safer-streets-liverpool/content_48.html": "You said, we did! Women across our region told me the place they feel most unsafe is on public transport at night, and the biggest factor in increasing their feelings of safety would be more uniformed police. So, as part of our Safer Streets Liverpool campaign, we’re increasing high-visibility patrols at peak times at transport hubs and on key bus routes into and out of the city centre to prevent sexual violence and reassure women and girls.\nFind out more about Safer Streets – Night-time police patrols around public transport network boosted by Safer Streets Liverpool campaign: Merseyside Police and Crime Commissioner (merseysidepcc.info)",
  "https_emily4merseyside_com_/https_emily4merseyside_com_four-clubs-one-goal-campaign-launch/content_70.html": "Football is at the heart of so many communities in Merseyside , so I was delighted to support the launch of the Four Clubs, One Goal campaign launched by independent charity Crimestoppers working with Liverpool F.C, Everton F.C, Tranmere Rovers and Marine F.C to promote anonymous reporting and tackle knife crime and violence on our streets.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_summer-youth-diversion-fund/content_45.html": "Last month, I launched the latest round of my Youth Diversion Fund, aimed at providing safe activities for young people over the summer period to deter ASB and help to ease the burden for families struggling to make ends meet.\nProjects receiving funding for the summer months will be announced shortly.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_safer-streets/content_61.html": "In response to my survey last Summer, which said that women and girls don’t feel safe on public transport, in March I launched the Safer Streets Liverpool Campaign. Working in partnership with Liverpool City Council, Merseytravel and Merseyside Police, the campaign includes enhanced CCTV around bus stations, bystander training for staff, and education programmes in schools raising awareness of sexual harassment and misogyny.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_visible-and-accountable-policing/content_44.html": "Skip to content\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nVisible and Accountable Policing Video\nEmily Spurrell\nSocial Media\nFriday 19 March 2021\n|\n0\nShare this:\nFacebook\nTwitter\nPost navigation\nPrevious:\nPrevious post:\nEmily Responds to the use of Stop and Search\nNext:\nNext post:\nSupporting Victims and Communities Video",
  "https_emily4merseyside_com_/https_emily4merseyside_com_latest_page_4/content_18.html": "Government’s Budget Failure\nThe recent Autumn Budget has yet again demonstrated the Government’s dismal lack of support for our police service. As Labour PCCs, we urged the Chancellor to take bold action and fully fund our police service, but once again, they have failed to listen and have provided no new money for our cash-strapped police forces. Ministers…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_latest/content_7.html": "Emily Spurrell re-elected as Merseyside Police and Crime Commissioner\nLabour’s Emily Spurrell thanked voters on Merseyside for re-electing her to be the region’s Police and Crime Commissioner for a second term. Emily took 61.7% of the vote, beating challenges from three other candidates to secure a further four years in office on a promise to continue to fight crime and invest in hard-hit neighbourhoods.…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_latest_page_6/content_21.html": "Emily Spurrell Elected as Merseyside Police & Crime Commissioner\nEmily Spurrell has been elected as the Police & Crime Commissioner of Merseyside. Emily thanked voters across Merseyside after she collected 178,875 votes, taking more than half the first preference count and was elected the winner on Saturday 8th May. Throughout her campaign, Emily has promised to deliver visible and accountable policing, give victims and…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_tackling-shoplifters-is-a-priority-as-safer-business-action-week-springs-into-action/content_54.html": "Merseyside PCC Emily Spurrell is urging retail and business workers to help tackle shoplifters by reporting any criminal incidents or abuse they experience.\nIt comes as Merseyside Police kick-started Safer Businesses Action Week with a conference that brought together Liverpool BID, Northwest Regional Organised Crime Unit’s SaferCash, Northwest Cyber Resilience Centre, Whitechapel Centre, Counter Terrorism Police Northwest (CPTNW) and Causeway, to speak to business owners and managers from across the region.\nThe national ‘Safer Business Action Week’ sees police carrying out events and operations across the force area to support local and national businesses and the economy. This week of action is part of a national campaign supported by the National Business Crime Centre and National Police Chief Council and aims to support the business community through partnership working and tackling the issues business face. It is the second year in which a national week focusing on business crime has taken place.\nThe Merseyside response is being coordinated by Liverpool City Centre Inspector. The City Centre contains the largest proportion of businesses in the region. As such, the Neighbourhood Policing Team have been continuing with their close work with the business community, including Liverpool BID Company, Liverpool One and St. Johns Shopping Centre.\nThroughout the week, the team will be working closely with businesses and partners in tackling retail crime through joint uniformed patrols with security staff, plain clothed operations, and targeting named and prolific offenders.\nMerseyside Police Commissioner Emily Spurrell said : “This week is an excellent opportunity to support the business community by bringing together police and partners to discuss the key issues of business crime.\n“Officers will be targeting shoplifting offences and licensed premises that facilitate the sale of stolen goods. They will be carrying out joint patrols with Liverpool One and St john’s Shopping Centre, putting an emphasis on reassurance, making sure that all businesses where staff have reported being abused or assaulted receive follow up visits as part of the national ShopKind initiative.\n“Shoplifting is not the acceptable price of working in retail just as being subjected to threats and abuse should not be normalised as something that just happens in that line of work.\n“I want to reassure retail workers and business owners your concerns are taken very seriously. This is a priority for me within my Police and Crime Plan.”\nThe conference, hosted at The Hilton Hotel, lasted for three hours, and was a chance for those running and managing businesses to get a more in-depth understanding of what can be done to avoid the devastating consequences of being targeted by criminals.\nA Counter Terrorism Security Advisor from Counter Terrorism Policing Northwest gave delegates an overview of the importance of working together for security, and how businesses could successfully liaise with CTPNW for the best outcomes.\nBoth Cyber Resilience Northwest and SaferCash gave an overview of the threats and risks businesses are facing in 2023, as well as a range of strategies and tactics employers can use to protect themselves and their staff from organised crime and cyber attacks.\nAs businesses across Merseyside are facing a unique set of varied challenges, the hope of those speaking at the Safer Business conference is that by working together to give owners and managers all the expertise they need to keep themselves, staff, and customers safe, more will proactively take necessary action.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_category_news_page_4/content_59.html": "Government’s Budget Failure\nThe recent Autumn Budget has yet again demonstrated the Government’s dismal lack of support for our police service. As Labour PCCs, we urged the Chancellor to take bold action and fully fund our police service, but once again, they have failed to listen and have provided no new money for our cash-strapped police forces. Ministers…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_shadow-policing-minister-sarah-jones-mp-visits-two-organisations-providing-vital-support-to-victims-in-merseyside/content_62.html": "Labour’s Shadow Policing Minister, Sarah Jones MP, today will join Labour’s Police and Crime Commissioner candidate, Emily Spurrell, to visit two local organisations providing vital support to victims in Merseyside.\nThe first visit will be to a memorial bench installed in Newton-Le- Willows in memory of Daniel Fox, a local 29-year-old man sadly murdered after a knife attack in St Helens in 2016. In response to the dramatic increase in knife crime around the country, Daniel’s family were keen to turn their own personal tragedy into a more positive outcome, so they set up the Daniel Fox Foundation in 2017.\nJones and Spurrell will hear about Daniel’s story and the family’s personal experience of being victims of knife crime, and how the Foundation has been actively educating children and young people about the consequences and impacts of carrying weapons.\nFollowing this, Jones and Spurrell will visit The First Step Domestic Abuse Refuge in Knowsley.\nThe First Step was established to support survivors of domestic abuse in Knowsley and seeks to empower them through tailored training and support.\nSarah Jones MP, Shadow Minister for Policing and Fire, said:\n“After more than a decade of Conservative cuts to policing and preventative services, the work of community organisations to support victims could not be more vital.\nThis May’s election is a choice between a Tory party that has cut funding and allowed violence to rise, or a Labour candidate like Emily Spurrell who is serious about tackling crime, putting more local police on the streets and protecting victims.”\nA vote for a Labour Police and Crime Commissioner is a vote to keep, you, your family, and your community safe.”\nEmily Spurrell, Labour’s Police and Crime Commissioner Candidate for Merseyside, said:\n“It was great to welcome Sarah to Merseyside today and introduce her to some of the brilliant organisations supporting victims and communities affected by knife crime and domestic abuse.\nThe Daniel Fox Foundation is doing amazing work educating local children and young people on the dangers of knife crime and First Step are a vital support network for victims of domestic abuse.\nIf I’m elected PCC, recognising the contribution of these organisations and working in partnership with them to prevent crime and protect victims will be a priority.”\nNotes\nThe Tories have slashed funding to Merseyside over the last decade, with a £73m real-terms gap in direct government funding. Even after increases in precept funding, Tory cuts have left a £62.9m real-terms hole in Merseyside’s finances.\nThese cuts have led to the loss of 858 officers (19%) and 279 PCSOs (60%) since 2010. The Tories promised to hire 20,000 officers to replace those they cut, but the unfair way funding is allocated means that Merseyside will still have around 400 fewer officers than in 2010.\nDespite Conservative cuts, During Emily Spurrell’s time as deputy Police and Crime Commissioner from 2017-19, she oversaw £3 million investment in victims services, re-launched the modern slavery network, developed the Domestic Abuse Workplace Scheme and successfully lobbied for a living wage for all police staff.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_category_news/content_36.html": "Emily Spurrell re-elected as Merseyside Police and Crime Commissioner\nLabour’s Emily Spurrell thanked voters on Merseyside for re-electing her to be the region’s Police and Crime Commissioner for a second term. Emily took 61.7% of the vote, beating challenges from three other candidates to secure a further four years in office on a promise to continue to fight crime and invest in hard-hit neighbourhoods.…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_standing-up-against-lgbt-hate-crime-in-our-region/content_63.html": "The recent spate of LGBT+ attacks in our region is appalling and goes against everything we stand for in this region. It will not be tolerated. I am working closely with the police and community partners like Pride to ensure all forms of hate crime are taken seriously and victims get the right support.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/http_emily4merseyside_com_manifesto/content_8.html": "Safer Stronger Merseyside\nForeword\nIn 2021 I was humbled to be elected as your Police and Crime Commissioner and I’m incredibly proud of what I’ve achieved during my first term.\nI pledged to be a visible and proactive PCC, standing up for our communities and to be a strong voice for our region. Over the last three years, that’s led to an extra £14m of investment in our region; vital money that has been used to cut crime and support the vulnerable. I have continually demanded a better deal for our region from this Tory Government and I promise that will never stop.\nDuring my term, the number of police officers patrolling our streets has increased by 665 – that’s 65 more than we were promised because of our determination to secure extra funding and strengthen local policing.\nYears of cuts and insufficient funding from this Tory government, has left Merseyside still 450 officers short of the number we had in 2010. And with more £22 million worth of savings to find in the next five years, Merseyside remains far behind police forces in the south who are seeing record numbers of police officers. I have seen four Home Secretaries and four Policing Ministers come and go and I have challenged every single one of them, making it my mission to speak out for the people of Merseyside, demanding more for our communities.\nIn the last three years, I have launched our new Victim Care Merseyside hub – a specialist team of trained advisers on hand to offer support to anyone affected by crime, whether you have reported to the police or not. In its first year alone, this vital team has already offered support to more than 40,000 victims across Merseyside.\nI have made tackling Violence against Women and Girls an absolute priority. By listening to the voices of victim-survivors, we have developed a strategy that more than 50 partners have pledged to deliver: all focused on putting a stop to the scourge of violence against women. One year on, we are already seeing progress – more officers trained, education programmes running in schools, a region-wide marketing campaign and funding focused on making our streets safer.\nI have invested in our communities, creating vital opportunities for tens of thousands of young people; all focused on diverting them away from crime and anti-social behaviour and towards safer, brighter futures.\nAnd I have developed a scrutiny programme which holds the police to account for their performance and gives you far greater insight into the work they are doing.\nThere has been so much progress but there is much more to do.\nI am determined and passionate about driving this work forward and that is what I promise to do if re-elected to be your Police and Crime Commissioner.\nEMILY SPURRELL\nLabour’s Candidate for Merseyside\nPolice and Crime Commissioner\nVISIBLE AND ACCOUNTABLE POLICING\nNeighbourhood policing is the bedrock of good policing. I am committed to offering a visible and accessible police service. That’s why last year, Merseyside Police changed the way it operates to enhance its service to you – with a clearer focus on local and neighbourhood policing.\nThis reckless Conservative government cut Merseyside's police numbers by more than 1,100, and we are still 450 officers short of the numbers we had in 2010. I’ll continue to fight to get every single one of those back, to serve and protect our communities.\nBecause of these hugely damaging cuts, it's vital we invest the resources we have got into local communities, so they see a visible police presence.\nThat means a greater focus on dedicated resources and more investment in the teams that tackle the issues that matter most to local people, with extra officers to respond to emergencies, tackle gang and gun crime, and protect vulnerable people.\nI’ll make sure neighbourhood policing is a priority and the police build visible and strong connections with our communities.\nI’ll also deliver on my new Estates Strategy that provides visible and accessible police stations fit for officers, staff and the public.\nWhile progress has been made, it is essential Merseyside Police continue to work to improve their response you, the public, ensuring calls to 999 and 101 are responded to efficiently, investigations are followed up and victims get the right response from the police every time.\nCommunities must have confidence that, whatever crime they are reporting, they will get a swift and effective response from the police.\nThis also includes providing a proactive response to prevent and reduce retail crime and attacks on shop workers and retailers, making every possible effort to identify prolific offenders and protect our local community stores.\nI will continue to ensure Merseyside Police provide a robust response to all crimes reported and public are informed on progress to tackle crime in their communities.\nWe are at a time when, nationally, trust and confidence in policing is at an all-time low. The scandals which have rocked policing across the UK have rightly prompted a strong and robust response from police leaders. Here on Merseyside, our Chief Constable has taken significant steps to set clear standards of expectation and root out any officer or member of staff not behaving to the highest standards.\nAs part of my scrutiny programme, I have introduced public meetings which are live streamed so you can watch and find out how in detail how our region is policed. I’ve also encouraged you to submit questions on the issues that matter most to you so I can challenge the Chief Constable on how these are being met, and I’ve appointed three independent advisers who represent our communities and join me in holding the Chief Constable to account for the performance and actions of her officers and staff.\nI will continue to drive transparency and accountability in the way Merseyside Police uses its powers and serves our communities.\nTACKLING KNIFE & GUN CRIME\nReal progress has been made to tackle serious violence in Merseyside. Knife crime has reduced by 18% and numbers of homicides and firearms discharges have reduced to their lowest level in more than 20 years.\nBut the heartbreaking events of 2022, once again brought home the devastating consequences even one knife attack or firearms discharge can bring. Merseyside Police continues to be recognised nationally as being outstanding at tackling serious and organised crime and I will continue to drive and support them to relentlessly and robustly go after the gangs and heartless criminals who seek to cause such misery and distress on our streets.\nMajor investment and energy has been focused on those areas harmed by some of the most damaging incidents. By working with partners and our communities, we have worked to clear out criminals and make sure they face justice, increasing resilience and building areas back so they are places people love to live, work, and visit once again.\nWe’re also putting the money seized from those gangs to good use; putting it back into the hands of local people and working with them to decide how it can be reinvested into our communities to make the biggest difference.\nWe know criminal gangs don’t see geographical boundaries, so it’s vital we work across our region to disrupt and tackle the harm they bring. In my role as lead PCC for the North West Organised Crime Unit, I have and will continue to ensure police forces work together across the North West and use all the specialist resources and powers in their arsenal to tackle organised criminal gangs.\nIt’s also vital to recognise the police cannot tackle serious violence on their own. There is a duty on all agencies to ensure they do everything within their power to tackle serious violence. I will ensure our serious violence strategy is delivered and we use every opportunity to drive down violence even further.\nPROTECTING VICTIMS AND VULNERABLE PEOPLE\nToo often victims of crime are left bewildered and overwhelmed in a justice system that does not work for them. Victims are often left traumatised and without the right support to allow them to cope and recover.\nThat’s why, victims have been at the heart of everything I have done since coming into office. In 2022, I launched our Victim Care Merseyside hub which has transformed the way victims can access support, making sure they get the right practical and emotional support when they need it.\nI’ve also brought in £5 million additional funding to support our sexual violence and domestic abuse services.\nWe launched our partnership plan to tackle violence against women and girls over a year ago and positive steps are already being taken to deliver on this.\nBut there is still much more to be done, including work to be done to fully comprehend the scale of abuse on Merseyside and ensure funding is invested in the right way to provide the right support. I will review the approach to domestic abuse funding to ensure we are spending money where it will make the most difference.\nIn addition to supporting women, I have also been determined to support our minority communities to ensure they feel safe in our brilliant region. No one should live in fear of being targeted simply because of who they are. I was proud to work with LCR Pride to launch the You’re Safe Here training focused on equipping night time bars and clubs with the skills to make their venues a safe space for all and promote an inclusive night time economy. This scheme is going from strength to strength and I am keen to continue to expand it across more organisations and wider within our region.\nI will continue to fund services for victims of hate crime and invest in education and other initiatives to prevent racism, homophobia and all forms of hate.\nWe also see too many people with neurodiverse conditions or those who struggle with their mental health getting caught up in the criminal justice system, both as victims and offenders. Often their additional needs have not been recognised and this makes them more vulnerable to exploitation or getting drawn into criminality.\nWe have already seen improvements in support for individuals with neurodiverse conditions coming into police custody. I will focus on initiatives to divert people with neurodiverse conditions and those suffering with their mental health away from the criminal justice system.\nPREVENTING CRIME AND ANTI-SOCIAL BEHAVIOUR\nCrime and anti-social behaviour can have devastating impact on victims and communities and it’s vital that we do all we can to prevent it from occurring in the first place.\nSince taking office I have launched my Youth Diversion Fund and invested more than £350,000 in projects which have diverted young people away from anti-social behaviour, especially during the Halloween and summer months, when incidents can spike.\nOur Merseyside Violence Reduction Partnership is also leading on wide-ranging interventions that are focused on supporting young people to prevent them from getting drawn into violence. They’ve already reached 100,000 young people, with a focus on early intervention in schools and developing education packages to instill the right values in young people.\nI will continue to invest in education and diversionary opportunities for our young people, including those which challenge misogyny and gender stereotypes, with a focus on preventing crime and building brighter futures.\nOne area where prevention is key is road safety. Deaths and injuries on our roads are entirely preventable yet Merseyside continues to see some of the highest numbers in the country.\nAlong with Metro Mayor Steve Rotheram, we launched our Vision Zero road safety strategy which sets out how as a partnership we want to reduce the number of fatalities and casualties in the years ahead, with the ultimate aim that there are no avoidable collisions on our roads by 2040.\nIn the first year, we have seen changes to road infrastructure, education initiatives and an increase in police enforcement of drug and drink driving.\nEveryone deserves to be safe on our region’s roads and it’s vital that as a partnership we focus our efforts on achieving this.\nI will ensure Merseyside Police prioritises road safety enforcement and work with partners to use all powers to deliver Vision Zero strategy.\nPrevention also plays an important role when addressing substance misuse. We know for many vulnerable people drug abuse is a driver for their offending. Our Project ADDER is a fantastic example of the difference a preventative approach can make - thousands of individuals diverted away from the criminal justice system and into the right place to get the help and treatment they need.\nThis is not only helping to transform their lives, it is freeing up police resources and making our communities safer. This is backed up with robust enforcement targeting heartless individuals who seek to profit from other people’s misery.\nI will continue to support Project Adder and other initiatives that support vulnerable drug users into rehabilitative services while ensuring a robust response to the criminal gangs who bring drugs into our communities.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-spurrell-chosen-as-labour-candidate/content_35.html": "I am delighted to have won the nomination to be Labour’s candidate in next year’s Police and Crime Commissioner elections here in Merseyside.\nIt has been a privilege to speak to so many people over the last three years, and especially the last six weeks of this selection process, about policing and criminal justice.\nI am proud to have previously served as Deputy Police and Crime Commissioner and have a clear vision of what steps need to be taken in order to improve policing in Merseyside.\nOn that basis, I put myself forward to be Labour’s candidate in our county and am honoured to have received the support of the Labour Party.\nI would like to thank Olly Martins for a fair and comradely campaign.\nI look forward to campaigning with members across Merseyside and ensuring that we once again have a Labour PCC representing us next May.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_category_news_page_6/content_65.html": "Emily Spurrell Elected as Merseyside Police & Crime Commissioner\nEmily Spurrell has been elected as the Police & Crime Commissioner of Merseyside. Emily thanked voters across Merseyside after she collected 178,875 votes, taking more than half the first preference count and was elected the winner on Saturday 8th May. Throughout her campaign, Emily has promised to deliver visible and accountable policing, give victims and…\nRead more\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_4m-of-extra-investment-into-merseyside/content_74.html": "During my election I committed to fighting to get as much funding and investment into Merseyside as I could. Since I took office, I have successfully brought £4m of additional grants to fund essential victim support and crime prevention initiative.\nThis funding is providing a vital lifeline to services that have seen huge increases in demand. However, these services cannot rely on short term grants and I continue to call for sustainable, long term funding from central government.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-responds-to-the-use-of-stop-and-search/content_33.html": "The biggest power a PCC has is the oversight and scrutiny of police decision making and that’s where I think I can make the biggest impact on how the police operate. As PCC I want to introduce a programme of scrutiny that ensures transparency in police decision making, including recruiting independent community members to sit on a police scrutiny panels and ensure the police are using resources responsibly. It is vital that the black community is a core part of this work and, if I’m elected, I would like you to be involved.\nStop and Search, is like any other police power, only useful if used in a proportionate and intelligence led way and with the support of communities. I believe there are still lessons to be taken from the Equalities and Human Rights Commission 2010 report ‘Stop and think’ and I will bring these into my work with the police, as PCC.\nTackling crime takes a whole system approach.\nWe need training for all police staff, not just frontline officers, on unconscious bias and to ensure that black people and communities are not targeted, but are instead served. We need to start recognising that black people are more likely to be victims of crime than the perpetrators.\nIn addition to increasing the level of training and scrutiny on the use of Stop and Search and involving black communities in that process, I also think it’s vital that the police reflect the community they are there to serve. Merseyside’s population is 5.5% black but only 3.5% of our officers are black.\nAny new police officer recruitment is an opportunity to recruit more black officers and increase the diversity of the police service In the current round of recruitment, only 1.8% of the new recruits are black. This isn’t good enough. I’ll be pushing the police to improve on those numbers, to be proactive and to really engage with black communities to recruit officers. I will publish an annual audit to see how police diversity has improved.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_manifesto/content_2.html": "Safer Stronger Merseyside\nForeword\nIn 2021 I was humbled to be elected as your Police and Crime Commissioner and I’m incredibly proud of what I’ve achieved during my first term.\nI pledged to be a visible and proactive PCC, standing up for our communities and to be a strong voice for our region. Over the last three years, that’s led to an extra £14m of investment in our region; vital money that has been used to cut crime and support the vulnerable. I have continually demanded a better deal for our region from this Tory Government and I promise that will never stop.\nDuring my term, the number of police officers patrolling our streets has increased by 665 – that’s 65 more than we were promised because of our determination to secure extra funding and strengthen local policing.\nYears of cuts and insufficient funding from this Tory government, has left Merseyside still 450 officers short of the number we had in 2010. And with more £22 million worth of savings to find in the next five years, Merseyside remains far behind police forces in the south who are seeing record numbers of police officers. I have seen four Home Secretaries and four Policing Ministers come and go and I have challenged every single one of them, making it my mission to speak out for the people of Merseyside, demanding more for our communities.\nIn the last three years, I have launched our new Victim Care Merseyside hub – a specialist team of trained advisers on hand to offer support to anyone affected by crime, whether you have reported to the police or not. In its first year alone, this vital team has already offered support to more than 40,000 victims across Merseyside.\nI have made tackling Violence against Women and Girls an absolute priority. By listening to the voices of victim-survivors, we have developed a strategy that more than 50 partners have pledged to deliver: all focused on putting a stop to the scourge of violence against women. One year on, we are already seeing progress – more officers trained, education programmes running in schools, a region-wide marketing campaign and funding focused on making our streets safer.\nI have invested in our communities, creating vital opportunities for tens of thousands of young people; all focused on diverting them away from crime and anti-social behaviour and towards safer, brighter futures.\nAnd I have developed a scrutiny programme which holds the police to account for their performance and gives you far greater insight into the work they are doing.\nThere has been so much progress but there is much more to do.\nI am determined and passionate about driving this work forward and that is what I promise to do if re-elected to be your Police and Crime Commissioner.\nEMILY SPURRELL\nLabour’s Candidate for Merseyside\nPolice and Crime Commissioner\nVISIBLE AND ACCOUNTABLE POLICING\nNeighbourhood policing is the bedrock of good policing. I am committed to offering a visible and accessible police service. That’s why last year, Merseyside Police changed the way it operates to enhance its service to you – with a clearer focus on local and neighbourhood policing.\nThis reckless Conservative government cut Merseyside's police numbers by more than 1,100, and we are still 450 officers short of the numbers we had in 2010. I’ll continue to fight to get every single one of those back, to serve and protect our communities.\nBecause of these hugely damaging cuts, it's vital we invest the resources we have got into local communities, so they see a visible police presence.\nThat means a greater focus on dedicated resources and more investment in the teams that tackle the issues that matter most to local people, with extra officers to respond to emergencies, tackle gang and gun crime, and protect vulnerable people.\nI’ll make sure neighbourhood policing is a priority and the police build visible and strong connections with our communities.\nI’ll also deliver on my new Estates Strategy that provides visible and accessible police stations fit for officers, staff and the public.\nWhile progress has been made, it is essential Merseyside Police continue to work to improve their response you, the public, ensuring calls to 999 and 101 are responded to efficiently, investigations are followed up and victims get the right response from the police every time.\nCommunities must have confidence that, whatever crime they are reporting, they will get a swift and effective response from the police.\nThis also includes providing a proactive response to prevent and reduce retail crime and attacks on shop workers and retailers, making every possible effort to identify prolific offenders and protect our local community stores.\nI will continue to ensure Merseyside Police provide a robust response to all crimes reported and public are informed on progress to tackle crime in their communities.\nWe are at a time when, nationally, trust and confidence in policing is at an all-time low. The scandals which have rocked policing across the UK have rightly prompted a strong and robust response from police leaders. Here on Merseyside, our Chief Constable has taken significant steps to set clear standards of expectation and root out any officer or member of staff not behaving to the highest standards.\nAs part of my scrutiny programme, I have introduced public meetings which are live streamed so you can watch and find out how in detail how our region is policed. I’ve also encouraged you to submit questions on the issues that matter most to you so I can challenge the Chief Constable on how these are being met, and I’ve appointed three independent advisers who represent our communities and join me in holding the Chief Constable to account for the performance and actions of her officers and staff.\nI will continue to drive transparency and accountability in the way Merseyside Police uses its powers and serves our communities.\nTACKLING KNIFE & GUN CRIME\nReal progress has been made to tackle serious violence in Merseyside. Knife crime has reduced by 18% and numbers of homicides and firearms discharges have reduced to their lowest level in more than 20 years.\nBut the heartbreaking events of 2022, once again brought home the devastating consequences even one knife attack or firearms discharge can bring. Merseyside Police continues to be recognised nationally as being outstanding at tackling serious and organised crime and I will continue to drive and support them to relentlessly and robustly go after the gangs and heartless criminals who seek to cause such misery and distress on our streets.\nMajor investment and energy has been focused on those areas harmed by some of the most damaging incidents. By working with partners and our communities, we have worked to clear out criminals and make sure they face justice, increasing resilience and building areas back so they are places people love to live, work, and visit once again.\nWe’re also putting the money seized from those gangs to good use; putting it back into the hands of local people and working with them to decide how it can be reinvested into our communities to make the biggest difference.\nWe know criminal gangs don’t see geographical boundaries, so it’s vital we work across our region to disrupt and tackle the harm they bring. In my role as lead PCC for the North West Organised Crime Unit, I have and will continue to ensure police forces work together across the North West and use all the specialist resources and powers in their arsenal to tackle organised criminal gangs.\nIt’s also vital to recognise the police cannot tackle serious violence on their own. There is a duty on all agencies to ensure they do everything within their power to tackle serious violence. I will ensure our serious violence strategy is delivered and we use every opportunity to drive down violence even further.\nPROTECTING VICTIMS AND VULNERABLE PEOPLE\nToo often victims of crime are left bewildered and overwhelmed in a justice system that does not work for them. Victims are often left traumatised and without the right support to allow them to cope and recover.\nThat’s why, victims have been at the heart of everything I have done since coming into office. In 2022, I launched our Victim Care Merseyside hub which has transformed the way victims can access support, making sure they get the right practical and emotional support when they need it.\nI’ve also brought in £5 million additional funding to support our sexual violence and domestic abuse services.\nWe launched our partnership plan to tackle violence against women and girls over a year ago and positive steps are already being taken to deliver on this.\nBut there is still much more to be done, including work to be done to fully comprehend the scale of abuse on Merseyside and ensure funding is invested in the right way to provide the right support. I will review the approach to domestic abuse funding to ensure we are spending money where it will make the most difference.\nIn addition to supporting women, I have also been determined to support our minority communities to ensure they feel safe in our brilliant region. No one should live in fear of being targeted simply because of who they are. I was proud to work with LCR Pride to launch the You’re Safe Here training focused on equipping night time bars and clubs with the skills to make their venues a safe space for all and promote an inclusive night time economy. This scheme is going from strength to strength and I am keen to continue to expand it across more organisations and wider within our region.\nI will continue to fund services for victims of hate crime and invest in education and other initiatives to prevent racism, homophobia and all forms of hate.\nWe also see too many people with neurodiverse conditions or those who struggle with their mental health getting caught up in the criminal justice system, both as victims and offenders. Often their additional needs have not been recognised and this makes them more vulnerable to exploitation or getting drawn into criminality.\nWe have already seen improvements in support for individuals with neurodiverse conditions coming into police custody. I will focus on initiatives to divert people with neurodiverse conditions and those suffering with their mental health away from the criminal justice system.\nPREVENTING CRIME AND ANTI-SOCIAL BEHAVIOUR\nCrime and anti-social behaviour can have devastating impact on victims and communities and it’s vital that we do all we can to prevent it from occurring in the first place.\nSince taking office I have launched my Youth Diversion Fund and invested more than £350,000 in projects which have diverted young people away from anti-social behaviour, especially during the Halloween and summer months, when incidents can spike.\nOur Merseyside Violence Reduction Partnership is also leading on wide-ranging interventions that are focused on supporting young people to prevent them from getting drawn into violence. They’ve already reached 100,000 young people, with a focus on early intervention in schools and developing education packages to instill the right values in young people.\nI will continue to invest in education and diversionary opportunities for our young people, including those which challenge misogyny and gender stereotypes, with a focus on preventing crime and building brighter futures.\nOne area where prevention is key is road safety. Deaths and injuries on our roads are entirely preventable yet Merseyside continues to see some of the highest numbers in the country.\nAlong with Metro Mayor Steve Rotheram, we launched our Vision Zero road safety strategy which sets out how as a partnership we want to reduce the number of fatalities and casualties in the years ahead, with the ultimate aim that there are no avoidable collisions on our roads by 2040.\nIn the first year, we have seen changes to road infrastructure, education initiatives and an increase in police enforcement of drug and drink driving.\nEveryone deserves to be safe on our region’s roads and it’s vital that as a partnership we focus our efforts on achieving this.\nI will ensure Merseyside Police prioritises road safety enforcement and work with partners to use all powers to deliver Vision Zero strategy.\nPrevention also plays an important role when addressing substance misuse. We know for many vulnerable people drug abuse is a driver for their offending. Our Project ADDER is a fantastic example of the difference a preventative approach can make - thousands of individuals diverted away from the criminal justice system and into the right place to get the help and treatment they need.\nThis is not only helping to transform their lives, it is freeing up police resources and making our communities safer. This is backed up with robust enforcement targeting heartless individuals who seek to profit from other people’s misery.\nI will continue to support Project Adder and other initiatives that support vulnerable drug users into rehabilitative services while ensuring a robust response to the criminal gangs who bring drugs into our communities.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_pcc-secures-almost-1m-to-increase-safety-and-protect-women-in-liverpool-knowsley-and-st-helens/content_75.html": "More than £900,000 of funding has been secured by Merseyside’s Police Commissioner to improve safety and protect women and girls in three areas blighted by crime and anti-social behaviour.\nEmily Spurrell’s successful bid into the fifth round of the Government’s Safer Streets Fund will see a total of £912,766 awarded to three projects aimed at reducing crime in key areas in Liverpool, Knowsley, and St Helens.\nWorking with St Helens Council, the Police Commissioner will use more than £200,000 of funding to increase the safety of women and girls as they visit the night time economy and travel at night.\nThe funding will be used towards creating an environment where women and girls feel safer after a consultation found 14% of respondents reported feeling unsafe and 21% slightly unsafe.\nThe safe transport home project will see improved lighting installed at taxi ranks, with wardens operating at key times. As part of the initiative, St Helens Borough Council will also encourage taxis to install CCTV to increase feelings of safety among women and girls.\nIn Liverpool, a cash investment of £445,433 will be used to target areas in Kensington and Fairfield that are disproportionately and persistently impacted by criminal and anti-social behaviour, as well as being a hotspot for sex work and sexual violence.\nThe intervention work will be focused on protecting residents by tackling public disorder incidents, such as kerb-crawling, to reduce the impact that sex work and drug use is having on residents, while also seeking to reduce crimes against sex workers.\nThe funding will also enhance the work already planned by Liverpool City Council to improve street lighting in the area, as well as supporting partners to continue the work with charities to support the vulnerable, with a focus on cleaning up litter and drugs paraphernalia from alley ways.\nIn Knowsley, £264,000 of funding will be used to make people living in and around, and visiting, Prescot town centre feel safer. It will be used to enhance and expand a number of multi-agency interventions and operations focused on tackling an increase in burglaries and vehicle crime, as well as providing more CCTV to enhance the personal safety of women and girls, particularly those visiting and working at night.\nToday’s announcement brings the total funding secured by the Police Commissioner from the Safer Streets Fund to almost £4m.\nMerseyside’s Police Commissioner Emily Spurrell said: “I’m really pleased that this successful bid means we can invest in these projects focused on preventing crime and improving safety in three key locations.\n“I’ve seen for myself the challenges facing residents and the misery caused by crime and anti-social behaviour in these areas and this major cash boost has the power to make a real difference.\n“Through Safer Streets, we’ve already delivered a lot of work to improve the safety of women and girls, particularly at night, and I’m pleased we can continue this work with funding focused on ensuring the safety of women who visit St Helens town centre for a night out.\n“In Liverpool, the area around Shiel Road has long been plagued by issue. By targeting those who seek to exploit sex workers, our aim is to reduce incidents of violence against women and girls, while improving the feelings of safety and quality of life for all those who live, work and visit the area.\n“Prescot is another area of our region which has unfortunately been plagued by issues in recent years, particularly burglaries and anti-social behaviour. This cash boost will support local policing teams to proactively target perpetrators and help reduce the number of innocent people falling victim to crime.\n“Everybody has a right to feel safe where they live and work. We’ve seen the success previous Safer Streets projects have had in other parts of Merseyside, like Birkenhead and Primrose Court in Huyton so I’m really positive that this funding means we can change things for the better in Kensington, Fairfield, Prescot and St Helens too.”\nCouncillor Laura Robertson-Collins, Cabinet Member for Neighbourhoods and Communities at Liverpool City Council said: “This successful bid for funding is to be welcomed and will make a real difference to residents of Kensington and Fairfield who are affected by crime and anti-social behaviour.\n“Working with our partners, we are determined to improve life in our communities and tackle the issues that blight the lives of local people. This latest tranche of money builds upon previous work to improve safety on public transport and in the night time economy.”\nCouncillor Graham Morgan, Leader of Knowsley Council, said: “We work closely with our community safety partners to help ensure our residents are safe and do not have to suffer the effects of criminal and anti-social behaviour.\n“This funding will support that ongoing work in a variety of ways, including enhancing our already extensive CCTV network, supporting local businesses and providing more engagement opportunities for young people in the area.”\nCouncillor Mancyia Uddin, Cabinet Member for Safer Communities for St Helens Council said: “This funding will help to further enhance and support our night time economy in St Helens town centre, which has already been recognised for its exemplary offer through the success of maintaining our Purple Flag status again this year, which recognises the social and economic importance that this sector brings to the borough as a whole.\n“It is really welcome too in supporting women to stay safe by providing secure spaces and routes home, improving the night time experience for women hugely.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_victim-care-merseyside-hub-supports-more-than-650-people-each-month-in-its-first-year/content_64.html": "Two victims of crime have described the life-changing difference the Victim Care Merseyside hub has made to their lives, as the service marks its first year in operation.\nThe hub was launched by the Police Commissioner, Emily Spurrell, and the Chief Constable, last November to provide free, confidential, non-judgemental advice and support for all victims of crime across the region and in its first year more than 40,000 vulnerable people have been offered support.\nOn average, 660 people each month are now having their needs assessed by a Victim Care Adviser who helps to give them any advice and support they require. For those needing ongoing support, the team put a personal care plan put in place focused on providing them with the emotional and practical care they need to help them to cope and recover.\nAmong those who have accessed the hub’s help over the past year is Trish – a close family friend and neighbour of Olivia Pratt-Korbel, who was left devastated after the murder of the nine-year-old.\nTrish said: “The night Olivia was murdered, I just couldn’t get it out of my head. I was afraid to go out.\nShe added: “I am not one for saying how I feel, and I was keeping a lot to myself. Any little noise was scaring me. I wouldn’t go outside on my own, wouldn’t even go to the shop on my own. I was just too scared.”\nTrish was referred to the Victim Care Merseyside hub by her sister-in-law. She said “Two hours I was on the phone, crying most of the time, but she (the Victim Care Adviser) was so chatty, so understanding. The support was amazing.”\nShe added: “I would say definitely contact the hub, the support I’ve had was amazing and it’s so easy to talk to them. Just speak to the hub – it’s the best thing you can do.”\nJoanne also reached out to the hub after she discovered her mum Anne’s bungalow had been burgled.\nTo mark the first anniversary of the hub, she met her Victim Care Adviser, Alicia face-to-face for the first time.\nJoanne said: “Speaking to you (Alicia) every week, I was looking forward to your call because I knew things had built up and I needed to speak to you. There was always a form of contact. It’s made a massive difference to how I felt when it happened to how I feel now.\nAsked if she would recommend the Victim Care Merseyside hub to other people affected by crime, Joanne added: “I would say get the help you need – they are amazing. I couldn’t have done it without them.”\nDelivered by a team of 15 specialist Victim Care Advisers and Managers, the Victim Care Merseyside hub provides a single point of contact for all victims of crime, whether they have reported an incident to the police or not.\nVictims who do report a crime to Merseyside Police now automatically receive information about the Victim Care Merseyside hub explaining the help and support they can provide, with victims who are identified as being particularly vulnerable being proactively contacted by the team.\nVictims who don’t wish to speak to the police are able to access advice and support directly and in confidence by calling Freephone 0808 175 3080 or online at www.victimcaremerseyside.org.\nThe hub is an integral part of the Police Commissioner Emily Spurrell’s wider Victim Care Merseyside service, linking in closely with the 10 other independent services already commissioned to provide specialist support services to those affected by the most serious and harmful crimes, including rape and sexual assault, child exploitation and hate crime.\nMerseyside’s Police Commissioner Emily Spurrell said: “I’m extremely proud of the support the Victim Care Merseyside hub has provided since we launched it last November – thousands of victims of crime offered support each and every month and hundreds of vulnerable people undergoing an assessment of their needs and receiving the support they need.\n“Trish and Joanne’s testimony speaks volumes about the difference the team makes – by listening, by understanding and by providing practical and emotional support they are helping victims and survivors to cope and recover from the traumas they’ve experienced and move forward positively with their lives.\n“Ensuring every victim gets the right support, at the right time, in the right way is an absolute priority for me and that’s exactly what Victim Care Merseyside hub is delivering and I’m incredibly grateful to the whole team for their work over the past year.\n“To anyone who is out there suffering in the wake of a crime, I would absolutely echo Trish’s words ‘just speak to the hub – it’s the best thing you can do’.”\nIf you’ve been affected by crime, Victim Care Merseyside is here to provide support. Call Freephone 0808 175 3080 on weekdays between 8am and 6pm or request support online at www.victimcaremerseyside.org at any time.\nAbout Victim Care Merseyside\nAnyone affected by crime can request support by calling Freephone 0808 175 3080 on weekdays between 8am and 6pm.\nAlternatively, a contact form can be submitted at www.victimcaremerseyside.org at any time.\nVictims of crime can also access specialist support from the 10 other independent support services encompassed within the Victim Care Merseyside service. This includes:\nChild exploitation – support for any young person affected by sexual or criminal exploitation.\n- Catch 22 – 0797 924 1502\nHate crime – if you have been affected by hate you can access support tailored to the type of abuse you have suffered.\n- Racial or religious hate crime – Anthony Walker Foundation – 0151 237 3974\n- Disability hate crime – Daisy Inclusive UK – 0151 261 0309\n- LGBTQ+ hate crime – Citizens Advice Liverpool – 0151 522 1400 ext 5006\nIf you don’t feel comfortable speaking to the police, you can report a hate crime anonymously and in confidence 24/7 to independent charity Stop Hate UK – 0800 138 1625\nHarmful practices – support for victims of culturally specific abuse and harmful practices, including ‘honour’-based abuse, forced marriage and female genital mutilation.\n- Savera UK – 0800 107 0726\nMurder or manslaughter – emotional and practical support for any family affected by homicide, including culpable road deaths.\n- Families Fighting for Justice (FFfJ) – 0151 709 2994\nRape and sexual assault – dedicated aftercare support service for anyone affected by sexual violence at any time in their lives.\n- RASA Merseyside – 0151 558 1801\n- Rape and Sexual Abuse Support Centre (RASASC) – 0330 363 0063 / 01744 877987\nRestorative Justice – support for victims of crime to get answers from those who have offended against them.\n- Restorative Solutions – 0737 780 0254 or visit restorativesolutions.org.uk",
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-responds-to-liverpool-council-investigation/content_42.html": "LIke many of you, I have spent the last week digesting the recent investigation report and the implications for the Council. When I first read the report I was angry and incredibly disappointed. That a minority of individuals abused their position and sought to undermine Council processes is deeply upsetting.\nI know that the majority of our Council staff and colleagues are hard working individuals and totally committed to supporting residents in Liverpool.\nI believe there is still a lot to be proud of as to what we have delivered as a Council and I hope that these failings don’t undermine that work.\nIt’s right that public servants are held to a higher standard which is what makes this report so disappointing. So it is positive to see the proactive steps already taken by the Acting Mayor and Chief Executive towards developing the improvement plan and taking action to resolve issues as soon as they were identified. This work was also acknowledged by the inspectors leading to them taking a reduced oversight role and tasking us with putting things right.\nIt’s also important that these high standards are applied at every level of Government. It’s disappointing to see a number of Government Ministers are currently embroiled in a scandal around contract handling and planning decisions so it is incumbent on all of us to ensure we always act with the highest levels of integrity.\nAs an individual I was unaware of the issues raised in the report but, as a Councillor, we all have collective responsibility so it’s right we take ownership of repairing the damage.\nI don’t believe it is appropriate for me to comment any further due to the ongoing police investigations and the importance of a fair criminal justice process.\nI’m confident in my colleagues’ commitment to rebuild public trust in the Council and I will support that work in any way I can.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_one-year-on-progress-on-region-wide-vawg-delivery-plan/content_23.html": "Merseyside Police Commissioner Emily Spurrell has unveiled a progress report detailing the achievements from the last 12 months in the work to tackle Violence against Women and Girls.\nThe ‘Working in partnership to tackle Violence against Women and Girls (VAWG) Delivery Plan’ was launched by Emily Spurrell a year ago, after an extensive consultation.\nIt sets out a clear ambition to protect women and girls who live, work and visit Merseyside, prevent violence, pursue offenders and ensure tackling VAWG is prioritised and treated with urgency.\nThe strategy, which was agreed by all political leaders and contributed to by nearly 50 partners across the region, sets out 57 clear, straight-forward and achievable actions which all agencies can deliver to help eradicate VAWG.\nOne year on and ahead of International Day to End Violence against Women and Girls, the Commissioner has released a progress report detailing the successes and work that’s ongoing to tackle VAWG, as well as the next steps.\nKey achievements from the last 12 months include:\n- Vulnerability / Trauma-informed training delivered to more than 1,782 police officers and staff to improve their interactions with victims;\n- 131 schools trained to have age-appropriate conversations on misogyny, sexual harassment and peer-on-peer abuse and a further 131 schools taken part in the ‘Send Me A Selfie’ training delivered by the Ariel Trust;\n- 51,600+ employees now have access to a Domestic Abuse Workplace Champion;\n- 33 new 360degree cameras installed across Liverpool city centre;\n- £800,000 to tackle domestic abuse through early intervention programmes;\n- £3.2m committed to support survivors of sexual violence;\nTo support these outcomes, the Crime Commissioner has:\n- Relaunched the Modern Slavery Network bringing partners and agencies together to redouble efforts to tackle the issue of slavery and trafficking and improve the support provided to victims.\n- Secured an additional £100,000 funding for the Safer Streets Merseyside campaign making it clear there is No Excuse for sexual violence.\n- Launched a ‘guardian project’, with LJMU student volunteers trained to provide support to those who need it in Liverpool’s night-time economy, such as helping people get home or providing emotional support.\n- Secured £2.2m in uplift funding for domestic abuse and sexual violence services across Merseyside to provide a range of community-based support for victim-survivors.\n- Offered free training to employers through the Domestic Abuse Workplace Scheme to ensure workplaces are safe places and by equipping staff to become Workplace Champions to help colleagues who may be at risk.\n- Pledged a five-year funding package to ensure access to specialist harmful practices support.\n- Secured £200,000 to improve the safety of women and girls in St Helens traveling at night time, through enhanced CCTV and street lighting.\n- Launched ‘safe spaces’ at each of the bus stations for anyone who feels vulnerable within travel centres and needs support.\n- Explored opportunities to conduct a domestic abuse funding review to understand the demand for organisations supporting victim-survivors.\n- Ongoing development of her commissioned Victim Care Merseyside hub which works with specialist sexual violence and domestic abuse services.\nTake a look at the summary progress report\nEarlier today, the Commissioner presented an update on the delivery of the region-wide strategy to a forum of victim-survivors and support organisations held at Tomorrow’s Women Wirral, to deliver on her ongoing commitment to ensure that the voices of victim-survivors are at the heart of this work.\nThe event provided feedback on the work done so far to tackle VAWG and included table discussions on the priorities for the year ahead to make our region safer for all women and girls.\nMerseyside Police and Crime Commissioner, Emily Spurrell said: “I am incredibly proud of what we have achieved in one year as a partnership to tackle Violence against Women and girls across our region.\n“I am absolutely committed to making Merseyside a safer place for all women and girls, and while there is still a long way to go, I thought it was important to hold this event to reflect on all the positive work that’s been achieved to prevent violence, support victim-survivors and make a real difference to the lives of women and girls across our region.\n“One year on, and we have already further enhanced the police approach and equipped them with better resources to help them to support victims, introduced new and specialised teams, and increased the training for police officers and staff who are working with vulnerable people every single day.\n“Our work as a partnership has included putting new and improved protocols in place, provided vital financial investment for support services, as well as awareness campaigns that aim to change behaviour. These, plus many more achievements are all important steps in the efforts to create tangible change and ensure women and girls are safer.”\nToday’s forum was the first in a line-up of events and activities across the region that will take place during the United Nation’s 16 Days of Activism, which runs from the International Day for the Elimination of Violence against Women and Girls on 25th November until Human Rights Day on 10th December.\nTo mark the start of the 16-day campaign, the Commissioner is hosting a community expo-style End Violence against Women and Girls event on Saturday 25th November.\nThe stalled event, being in the atrium at Mann Island between 2pm and 4pm, brings VAWG charities and groups who are committed to ending gender-based violence together to raise awareness of the scale of VAWG in our communities and what needs to be done to tackle it, while promoting the support available to all those affected across Merseyside.\nAs well as wide range of stalls, it will feature a series of speeches and a candle-lit vigil to remember those women and girls who have tragically lost their lives to gender-based violence across Merseyside.\nEmily added: “The 16 days of campaigning that follow today, continue to be crucial dates in my calendar.\n“The event tomorrow is designed to demonstrate our shared and ongoing commitment to eradicating violence against women and girls and I would encourage anyone who has been affected or is committed to ending gender-based violence to join us. Support will also be available for anyone who needs it.”\nPrior to the stalled event, the Police Commissioner will be supporting the No Excuse for Abuse March hosted by her Victim Care Merseyside partner Savera UK focused on raising awareness of so-called ‘honour’-based abuse and harmful practices in our communities.\nThis event will start in Williamson Square at 1.45pm with survivor testimony, drumming, dance and other performances, before attendees will be invited to march to Mann Island to join the community expo.\nDuring the United Nation’s 16 Days of Activism, there will be a social media campaign running on the Police Commissioner’s social media channels to highlight 16 key achievements from the VAWG delivery plan in more detail, from videos to interviews and more.\nFor more details on Savera UK No Excuse for Abuse March visit here.\nTo find out more on the Commissioners End Violence against Women and Girls event visit here.\nTo read the full progress report click here.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_crime-across-merseyside-drops-by-13-in-year/content_5.html": "Crime across Merseyside has fallen by 13% in the past year, with significant decreases in gun discharges, knife crime and burglary.\nThe reductions were confirmed yesterday at the Police and Crime Commissioner’s final public Scrutiny Meeting of her term.\nThe meeting, which reviews Merseyside Police’s progress against the priorities set by Emily Spurrell, showed there were nearly 17,000 fewer crimes in 2023 compared to 2022.\nReviewing the ‘data dashboard’ which aims to give the public greater insight into the work of Merseyside Police, it was also confirmed that firearms discharges decreased by more than 50% in 2023, with knife crime dropping by 13%.\nIn the same timeframe, residential burglaries were down by more than 17% and theft from members of the public reduced by more than 20%.\nThe meeting also showed that response times to the public have improved, with emergency 999 calls now being answered on average in just six seconds, compared to 13 seconds a year ago.\nMerseyside’s Police Commissioner Emily Spurrell said: “We all want to see less crime in our communities and my final Scrutiny Meeting shows over the past year that’s exactly what we have delivered – fewer crimes committed, less victims and safer communities.\n“I’m pleased that the data shows these decreases are already continuing into 2024.\n“People also expect the police to pick up the phone quickly when they need them most, so it’s reassuring to see that the time to answer 999 calls has nearly halved over the past year.\n“All these results are testament to the hard work of our policing family, and our community safety partners who support this work.\n“They demonstrate the resilience, hard work and dedication of Merseyside Police who are achieving all of this, despite the fact we have fewer officers than we used to have, and we continue to battle with budget cuts imposed by the Government.\n“While these figures are hugely encouraging, neither the Chief Constable nor I are resting on our laurels, and we’re determined we continue to drive these improvements forward.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_category_news_page_2/content_50.html": "One year on: progress on region-wide VAWG Delivery Plan\nMerseyside Police Commissioner Emily Spurrell has unveiled a progress report detailing the achievements from the last 12 months in the work to tackle Violence against Women and Girls. The ‘Working in partnership to tackle Violence against Women and Girls (VAWG) Delivery Plan’ was launched by Emily Spurrell a year ago, after an extensive consultation. It sets out…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_getting-police-back-on-the-streets-at-heart-of-labours-manifesto-for-merseyside-police/content_29.html": "Emily Spurrell, Labour’s candidate for Merseyside Police and Crime Commissioner, has today released her manifesto – pledging to put communities and victims at the heart of policing across the Merseyside, while fighting for more funding from Central Government.\nSince 2010 police funding cuts have meant Merseyside Police have lost over 800 police officers, almost 300 PCSOs and 33 police staff. If elected, Ms Spurrell intends to lobby for increased funding to ensure a more visible police presence on the streets as well as dedicated officers for each neighbourhood.\nShe said: “People across Merseyside tell me they don’t see any police officers anymore. The cuts to police funding means there are fewer bobbies on our streets.\n“However, the number one priority for communities is to have a visible police presence; providing reassurance, gathering intelligence and stopping criminals in their tracks. So that’s why I am pledging to demand further funding from the Government, to fill the gap in police funding and to ensure that every neighbourhood has a dedicated officer or PCSO.’\nMs Spurrell also has extensive plans to change the way that victims of crime are supported across the region and plans to set up a Victims’ Panel to give opportunities for victims and survivors to feed into the way things work. She also pledges to work with other PCCs and the Victims’ Commissioner to highlight injustices against victims and support legislation reform to protect victims’ rights.\nMs Spurrell told us:\n“Victims are feeling ignored and dismissed in a system that just isn’t working for them. They feel their voices are not being heard. Women, in particular, are facing worrying levels of abuse and violence with recent events highlighting just how widespread this violence is and the urgent need for change.\n“If elected, I will deliver a region wide strategy to end violence against women and girls including training for frontline staff, healthy relationships education and investing in victims’ services, providing vital support for victims to recover after a crime.”\nMs Spurrell is also calling for a renewed focus on tackling serious violence that sees communities blighted by knife crime and gang violence, as well as a new approach to police scrutiny and oversight.\nShe added:\n“We know there are organised criminals preying on vulnerable young children, coercing them into a life of drug dealing and violence, allowing them to get caught by police while they reap the rewards. Meanwhile we are seeing gang disputes play out on our streets and communities getting caught in the crossfire.\n“If elected, I’ll make sure tackling serious violence remains a priority for Merseyside Police and see increased investment into the work of the violence reduction partnership to keep young people safe.\n“I also want to make sure all communities have confidence in the police to do their job responsibly to keep residents safe. So I will be launching a programme of scrutiny to ensure transparency in police decision making with a focus on increasing diversity in police recruitment.”\nFurther measures outlined in the manifesto include:\n- An enforcement campaign to tackle dangerous driving and improve road safety;\n- A female offender strategy to divert women out of the revolving door of prison and,\n- A region wide campaign to tackle hate crime.",
  "https_emily4merseyside_com_/https_emily4merseyside_com/content_1.html": "Latest News\nEmily Spurrell re-elected as Merseyside Police and Crime Commissioner\nLabour’s Emily Spurrell thanked voters on Merseyside for re-electing her to be the region’s Police and Crime Commissioner for a second term. Emily took 61.7% of the vote, beating challenges ...\nLabour’s Police & Crime Commissioner pledges a safer, stronger Merseyside\nLabour’s Police Commissioner Emily Spurrell has today launched her manifesto setting out her commitments if re-elected for a second term on Thursday May 2nd. Emily was first elected in 2021 ...\nCrime across Merseyside drops by 13% in year\nCrime across Merseyside has fallen by 13% in the past year, with significant decreases in gun discharges, knife crime and burglary. The reductions were confirmed yesterday at the Police and ...\nA record of delivery\nSome of my key achievements since taking office in 2021\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_50000-youth-diversion-fund-launched-for-youth-projects-running-over-autumn/content_41.html": "Grants of up to £3,000 are now available from my new Youth Diversion Fund for community organisations offering safe, engaging youth activities over the busy Halloween and Mischief Night.\nGrants of up to £3,000 are now available from my new Youth Diversion Fund for community organisations offering safe, engaging youth activities over the busy Halloween and Mischief Night.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_labours-police-crime-commissioner-pledges-a-safer-stronger-merseyside/content_3.html": "Labour’s Police Commissioner Emily Spurrell has today launched her manifesto setting out her commitments if re-elected for a second term on Thursday May 2nd.\nEmily was first elected in 2021 and has since delivered £14 million additional funding for victims and crime prevention, launched the brand new Victim Care hub, invested £350,000 in better opportunities for young people and developed a partnership strategy to tackle violence against women and girls.\nIf re-elected, Emily has outlined her key manifesto commitments with a focus on:\n- Visible and accountable policing\n- Tackling knife and gun crime\n- Protecting victims and vulnerable people\n- Preventing crime and anti-social behaviour\nEmily said,\nI was incredibly proud to be elected PCC and have worked tirelessly to be a strong voice for our region. Despite promises of extra police officer numbers from the Tory Government, Merseyside remains 450 officers short of the number we had in 2010. I’ll continue to demand better for our residents and for the government to deliver on their promises.\nBut even against these challenges, we have seen knife crime and serious violence reduce. We continue to make progress to rid our streets of organised criminal gangs and tackle the anti-social behaviour that causes misery in our communities. But, there’s still more to do.\nIf re-elected I’ll continue to invest in our communities, creating vital opportunities for thousands of young people, all focused on diverting them away from crime and anti-social behaviour. I’ll put victims at the heart of the work I do and support the incredible work of our community and voluntary sector across Merseyside, who provide vital support for victims of crime.\nI will make road safety a key priority to reduce the needless deaths and injuries that occur every year on our roads. I will focus on addressing the underlying causes of crime and work to prevent it from happening in the first place.\nAnd through my scrutiny programme, I will see that Merseyside Police deliver the best service to the people of Merseyside, ensure offenders face justice, and officers and staff uphold the highest standards.\nTogether, we can continue to build a safer, stronger Merseyside.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_community-projects-benefit-from-cash-seized-from-criminals/content_20.html": "Communities across Merseyside are set to benefit from funding from Merseyside Police and the Police and Crime Commissioner, using money seized from criminals under the Proceeds of Crime Act (POCA).\nIn June, Merseyside Police and the Police and Crime Commissioner launched the Community Cashback Fund, inviting grassroots organisations and community groups across Merseyside to apply for a share of £100,000 from the fund to further develop existing projects or start new ones that focus on preventing crime and anti-social behaviour, diversion away from criminal gangs, and promoting diversity, equality and inclusion.\nThe Community Cashback Fund is one of several initiatives that take place throughout the year to enable Merseyside Police to reinvest some of the money seized from criminals back into local communities to help provide vital resources and fund community projects across Merseyside. It is aimed at strengthening community resilience by supporting local clubs and groups, which in turn helps to reduce crime and anti-social behaviour, promote diversionary activities, and support vulnerable members of the community.\nSerious and organised crime poses a significant threat to our communities. Merseyside Police is committed to pursuing these criminals with the full force of the law and ensuring that the proceeds of their crimes are spent improving the communities they have brought misery to.\nMerseyside Police and Crime Commissioner, Emily Spurrell said: “I’m excited to announce the successful bids for our Community Cashback Fund, taking cash out of the pockets of criminals and putting it back where it belongs – into grassroots communities across Merseyside.\n“Our region benefits from brilliant community organisations which are working hard to make their areas safer and stronger. We want to give our young people better opportunities and what better way than taking money from the criminal gangs who try to exploit our communities and giving it back to local people.\n“From boxing to apprenticeships and youth work to crime awareness programmes, there are a fantastic range of projects benefiting from the funding and I can’t wait to see the impact this has in our communities for the months and years to come.”\nMore information on the successful initiatives can be found here.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_new-measures-to-tackle-business-crime-in-merseyside-roll-out-on-safer-business-action-day/content_19.html": "Today, the region’s Police and Crime Commissioner, Emily Spurrell, officers from Merseyside Police and businesses across the region are joining forces for Safer Business Action Day.\nLocal policing teams will be undertaking proactive patrols, plain clothed operations, talking to shop owners and engaging with local communities to show their commitment to tackling business-related crime.\nFrom today, a QR code reporting system is rolling out for Merseyside businesses, to make reporting crimes such as shoplifting easier for security and staff. Advertised on stickers in retail spaces, once scanned the QR code links directly to the police online reporting page.\nIt allows for easier and faster reporting as once submitted, a crime reference number is generated which starts the investigative process.\nWorking in collaboration with Liverpool BID, the QR code has been trialled in Liverpool City Centre since September 2023 and has received positive feedback, with a significant increase in reporting during this time.\nTo further protect businesses and shop premises from burglaries and robberies, 100 SelectaDNA Intruder Spray kits will be installed in shops across the city centre, funded by the PCC and the police.\nIt’s hoped that the offender marking sprays, only used by security guards and retail staff following specialist training, will deter offenders from committing crimes in shop premises, keep stock from becoming stolen goods and protect customers and shop workers, who work tirelessly to serve communities.\nOnce sprayed at an offender, a unique DNA code is left that is only visible under UV light. It remains on the offender for weeks and can be used to forensically link offenders back to a particular incident, enhancing the likelihood of a successful conviction in court.\nACC for Local Policing, Criminal Justice and Prevention, Jenn Wilson, will be joining Liverpool officers on patrol and handing out body-worn cameras to independent retailers at St Johns Shopping Centre and Bold Street. The overt cameras, worn on the uniform of staff, aim to deter antisocial behaviour from the outset and provide the police with additional evidence when investigating crime.\nThe day will also feature a Retail Forum, where more than 30 retailers and business groups will meet with local officers and the PCC to set out tangible actions to tackle shoplifting and violence towards shop workers.\nWhile this day of action is designed to raise awareness and clamp down on business crime, officers and partners work every day to tackle issues that stores and customers alike experience.\nThe Liverpool City Centre Joint Agency Group (CCJAG) is a multi-agency group that works collaboratively to tackle issues around business crime – it includes representatives from Merseyside Police, Liverpool City Council, Liverpool BID Company, Liverpool One, St Johns Shopping Centre, Metquarter, Royal Albert Dock and Clayton Square.\nIn September 2023, the CCJAG set out new measures to target offenders and keep retail workers and the wider public safe, including:\n- Joint patrols with Liverpool One and St Johns teams\n- Dedicated SelectaDNA spray kit training for security guards and retail staff\n- The roll-out of the QR code reporting system for businesses\n- Further promotion of the DISC intelligence sharing platform, which allows businesses to share information that will assist in identifying shoplifters\n- Providing city centre businesses with a dedicated police officer from the local policing team\n- Enhancements to the BID radio network, connecting more than 180 active businesses to provide reassurance and intelligence sharing.\nSince these new measures have been introduced, between September 2023 and January 2024, there has been an increase in crime reports being received by the force from retailers by 37.5% (when compared to the previous 12-month period).\nAlongside this increase in the number of reported offences, there has also been a parallel increase in the number of positive outcomes, where offenders have been identified and robust action taken against them when comparing the afore mentioned five months to the five months prior to the new initiatives having been introduced (April 2023 to August 2023).\nThe number of offenders who have been charged and put before the court for shop theft offences in the City Centre has increased by 47.8% and the number of people receiving a caution has increased by 85.7%.\nMerseyside’s Police Commissioner Emily Spurrell said: “Retailers and businesses are the backbone of our communities.\n“They provide a vital service to our communities, and I’m committed to supporting initiatives which protect them, their employees, and their customers. One way we can do this is by investing in vital funds into positive schemes which can prevent crime and improve the safety of businesses.\n“As we mark Safer Business Action Day, I’m pleased we can announce these new measures all focused on tackling business-related crime. I’m also looking forward to meeting with retailers and business groups to discuss how we can work even closer together to keep retail workers safe and prevent the harm business crime can cause.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_governments-budget-failure/content_31.html": "The recent Autumn Budget has yet again demonstrated the Government’s dismal lack of support for our police service. As Labour PCCs, we urged the Chancellor to take bold action and fully fund our police service, but once again, they have failed to listen and have provided no new money for our cash-strapped police forces. Ministers may talk about levelling up, but their actions show they have little care for our hardest-pressed communities.\nRead my letter to the Home Secretary here – Home Secretary warned she will be “failing our communities if she expects the police funding bill to be passed onto hard-hit households”: Merseyside Police and Crime Commissioner (merseysidepcc.info)",
  "https_emily4merseyside_com_/https_emily4merseyside_com_councillors-unite-with-emily-to-focus-on-building-a-safer-stronger-merseyside/content_58.html": "Councillors from across the region gathered today for the first Merseyside Councillors’ Conference hosted by the Police Commissioner.\nEmily Spurrell held the event to bring elected representatives from across the county together with her office and Merseyside Police to discuss how they can work even closer together to build safer, stronger communities.\nOpened by the Commissioner and the Chief Constable, the conference was designed to give Councillors an overview of Merseyside Police’s work while enabling crucial discussions on key issues including serious organised crime, anti-social behaviour and support for victims of crime.\nThe event, held at Merseyside Police’s Mather Avenue Training Facility, was also attended by members of the local policing teams from each of the region’s five boroughs to enable discussions about work going on a local level to increase safety and prevent crime.\nThe Conference also encompassed an expo-style stalled event, giving Councillors the opportunity to network with Merseyside’s Violence Reduction Partnership (MVRP), Merseyside Police’s Prevention team, the local charities who deliver the Police Commissioner’s Victim Care Merseyside services supporting victims and survivors of crime and the central Victim Care Merseyside hub team who act as a single point of contact for all victims.\nThe event follows on from the Tackling Organised Crime Summit held in May which brought senior figures from local authorities, health services, housing, education, charities, and community groups together to discuss how they could continue the work to prevent and tackle organised crime.\nMerseyside’s Police Commissioner Emily Spurrell said: “I am determined to do everything possible to work with our partners to tackle crime and build safer, stronger communities.\n“Local Councillors play a vital role serving people in their wards. They know and understand the issues and the challenges their residents face day in, day out. That’s why it’s so important we work closely with them to increase the flow of two-way communication and focus on finding solutions to local concerns.\n“Their knowledge and insight can be pivotal in providing intelligence, tackling crime and increasing safety, so I’m pleased that so many of them were able to attend this event and I hope it gave them a greater understanding of Merseyside Police and my office and how we can work closer together for the benefit of all the people we all serve.\n“My thanks go to the Chief Constable, her officers and staff and our Victim Care Merseyside services who all made the event such a success.”\nLiam Robinson, Leader of Liverpool City Council said: “It was fantastic to attend the Merseyside Councillor’s Conference. It really puts the focus, with Merseyside Police, on crime and community safety issues not just in Liverpool but right across the region.”\nCouncillor Paul Stuart, Leader of Wirral Council said: “Today is really important, it’s the first conference of this sort that Emily Spurrell has ran. I hope we can all learn a bit more about how we can help our communities whilst supporting Merseyside Police and the work of the PCC.”\nCouncillor Manciya Uddin, Cabinet Member for Safer Communities at St Helens Council said: “This is a fantastic initiative. It’s really good to get together with councillors from across the City region to talk about crime and anti-social behaviour because it affects all of us but sometimes in a slightly different way so sharing our experiences of how to tackle it is vital.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_police-race-action-plan/content_37.html": "Last month, the National Police Chiefs Council launched their Race Action Plan to outline their approach to tackling the disproportionality and disparity that currently exists within policing. This is a difficult conversation to have, but an incredibly important one, to ensure that we improve police’s relationship with black and minority communities.\nToday’s launch of the national Race Action Plan: Improving Policing for Black People is very welcome and an important step in the efforts to improve the police’s relationship with Black people and communities.\nReleased by the College of Policing and National Police Chiefs Council (NPCC), this document is an honest reflection of the challenges policing faces. It recognises that some communities still view policing as institutionally racist and “have grounds for this view”. Importantly it also highlights the action still needed to rectify the mistakes of the past.\nIt recognises, as I do, that as a starting point we need to acknowledge that societal racism exists and policing, like all our institutions, still faces a battle with inequality, discrimination, and bias.\nThis is clearly evidenced by the outcomes for people from Black and minority communities in education, in health, in job prospects, and in policing and in criminal justice.\nWhen my comments from a panel discussion with Policing TV aired two weeks ago, there was understandably a strong, and very divided, response.\nIt was clear this is an emotional and difficult subject for everyone.\nBut it also brought into sharp focus what a critical conversation it is and how vital it is that we bring it to the fore.\nThis is an issue that reaches far beyond any one police force and affects all our criminal justice agencies, and indeed all our public institutions.\nMerseyside Police have already taken positive steps forward in this work, including reducing disparity in stop search, taking action to root out officers who demonstrate racist behaviour and improving representation within its ranks.\nI am very proud of Merseyside Police and the work they do.\nI’ve seen first-hand the excellent work that officers and staff in Merseyside do to keep the public safe under incredibly difficult circumstances. Putting themselves in harm’s way daily and sadly, all too often, being abused, threatened, and even injured as a result.\nMy comments were not intended, in any way, to undermine that work. Instead, they were intended to talk about the issues more widely within policing.\nI want all of our communities to have trust and confidence in the police.\nThis can only be achieved when we are honest about where we still have work to do.\nAs the Race Action Plan sets out, much has already been done to tackle these issues, but simply put, we are still not there yet. Our focus must be on ensuring all police forces are actively and wholly anti-racist.\nI know a huge amount of work has already been undertaken here to ensure Merseyside Police is in the best position to drive this work forward. I am hopeful this Plan will further empower policing to take real action to ensure policing is diverse and proactively tackles racism and unconscious bias.\nWe know there are areas that need a closer focus and the key pillars and accompanying actions outlined in this plan will be crucial in driving these improvements.\nMy role as PCC is to support and challenge the Chief Constable to make sure we do not take our foot off the gas to build a truly anti racist police force and reduce disproportionality across our whole criminal justice system. That means continuing to challenge and root out racism, unconscious bias, or prejudice wherever it exists.\nAcknowledging structural racism is not a sign of weakness.\nFar from it.\nWe have seen that in the way Liverpool has recognised the legacy of slavery in this city and its on-going impact on Black Communities today. I am proud to live in a city that admits where communities have been let down but, importantly, commits to putting it right.\nAs a city we have been able to move forward – investing in the world class International Slavery Museum to ensure we always remember and reflect, learning from the lessons of the past and recognising where the legacy of slavery has still left its mark.\nI have had numerous conversations over the last two weeks about the term ‘institutional racism’ and whether this language is still relevant. Should it be ‘structural racism’? Or maybe it would be better referred to as prejudice or unconscious bias?\nI do not have any lived experience of racism, but I am elected to be the public’s voice in policing, and I listen to those that do. It is my job to reflect the views of all our communities. Communities who tell me they still experience racism in their lives on a regular basis.\nWhat they want is action, not words. In all walks of life.\nI hope the Race Action Plan will be the driver for that tangible action across policing; driving inclusivity, increasing representation, reducing racial disparity in misconduct and complaints processes, ensuring Black people are properly supported as victims of crime and improving the engagement of Black communities in policing activity and governance.\nThere’s no time to waste. I will join the Chief Constable today to meet with key community stakeholders to discuss how the actions in this plan can be best delivered and I will be recruiting a representative from Merseyside’s Black community to sit on my public Scrutiny Meeting to join me in holding the Chief Constable to account on the force’s progress on this plan.\nI know the Chief Constable is committed and determined to create a truly anti-racist police force here in Merseyside and I will support her wherever I can to make this a reality.\nAs Chair of the Merseyside Criminal Justice Board, I will also ensure we continue to focus on and take action against disproportionality in the criminal justice system. It is our shared responsibility to drive change.\nThe release of this Plan is just the start. The conversation will be on-going, and I want to listen to all members of the community to make sure we get it right. In the first instance, I would encourage people to share their views through the national survey here: https://www.smartsurvey.co.uk/s/PlanFeedback/\nIt is only by working together – police, partners, and community – that we will truly eradicate racism for good.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-welcomes-outstanding-rating-for-merseyside-police-approach-to-tackling-serious-organised-crime/content_67.html": "Merseyside’s Police and Crime Commissioner is welcoming a report by His Majesty’s Inspectorate of Constabulary and Fire Service (HMICFRS), rating Merseyside Police as outstanding for its approach to tackling serious organised crime (SOC).\nThe force has been graded for its approach to SOC six times by HMICFRS since the first inspection back in 2016 and each time has been graded as Outstanding.\nFor the first time this year the HMICFRS report focuses on the North West Region as a whole, with individual gradings for the North West Regional Organised Crime Unit, Merseyside Police, Greater Manchester Police, Cheshire Constabulary, Lancashire Police, North Wales Police and Cumbria Police.\nMerseyside Police and Crime Commissioner Emily Spurrell said: “I welcome this very positive report by HMICFRS, recognising the outstanding approach Merseyside Police is taking to tackling serious organised crime.\n“Serious and organised crime groups spread fear and intimidation within the communities they operate, bringing misery to the lives of innocent people and often using vulnerable young people to do their dirty work. Through initiatives like Op Evolve, Project Medusa and Operation Stonehaven, Merseyside Police is relentless in identifying, disrupting, and bringing offenders to justice, whilst supporting and safeguarding those most at risk of harm and exploitation. This is supported on a regional level by the NWROCU and I’m pleased they too have been graded as outstanding in this work.\n“This report, coupled with a recent reduction in firearms discharges, is testament to the commitment, determination, and hard work of Merseyside Police officers, PCSO’s and staff to keep our communities safe and my thanks go to them for everything they do, day in day out.\n“Prevention is critical to this work, and I am pleased inspectors recognised the strength of Merseyside’s Police partnerships and its determined efforts, supported by our Violence Reduction Partnership, to get upstream and stop vulnerable young people getting drawn into a life of crime. This is vital if we are to continue to see serious violence reduce.\n“I am determined to do everything I can to support the Chief Constable and her workforce as they continue to pursue those organised crime groups, prevent vulnerable young people from getting drawn into crime and make all our communities safer and stronger.”\nToday the Chief Constable has acknowledged the hard work of officers and staff in the force’s fight against serious organised crime and has pledged to ensure that the force’s relentless approach will continue in earnest.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_violence-reduction-partnership-invests-more-than-200000-in-young-people/content_60.html": "Thousands of young people will have the chance to gain valuable skills, helping to unlock their potential and build brighter futures as Merseyside’s Violence Reduction Partnership reveals the successful applicants for its Arts | Culture | Sport Fund.\nMusic making, drama workshops, boxing, yoga, and knife crime interventions are just some of the activities set to be delivered by the 18 charities, organisations and community groups who will benefit from a share of more than £200,000 from the Fund.\nAfter inviting bids for the fund earlier this year, the Merseyside Violence Reduction Partnership (MVRP) have today confirmed the brilliant grassroots projects which have been awarded the funding to deliver initiatives focused on engaging and supporting young people, with funding focused on the areas of Merseyside which have seen the highest levels of violence and the biggest cuts to youth services.\nAs well as offering access to new opportunities, the Arts | Culture | Sport Fund is focused on helping young people to build their confidence, develop leadership skills and make positive decisions for the future, all helping to unlock the potential of young people across the region.\nA wide-ranging and diverse selection of activities are being offered by the successful applicants including Future Yard CIC in Wirral which will engage with hundreds of young people through live music, offering some work experience places in sound checking.\nAutism in Motion in Fazakerley is providing Special Educational Needs activities to 11–25-year-olds, including abseiling, kayaking, yoga, and drama sessions whilst educating on exploitation, how to avoid it and what to do if it happens to them.\nCommunity By Nature in Bootle is using a forest school-themed experience as early intervention to educate children on the consequences of knife crime and teaching them how to safely use tools in a controlled environment.\nAs well as helping to steer young people away from trouble, parents are also being offered support with Beautiful New Beginnings in West Derby providing anger management support to mums and dads as well as 1-2-1 counselling sessions for children.\nIn Knowsley, Shakespeare North Trust will receive £12,705 to work with young people to redesign the Theatre’s piazza through engaging discussion and workshops, whilst in St Helens Hip Hop CIC will deliver crime awareness workshops to year six and secondary school pupils.\nLast year, more than 8,500 young people benefitted from activities and projects run by 20 grassroots organisations funded by the MVRP, resulting in some gaining qualifications in mental health awareness and first aid, as well as learning digital skills and taking part in street art sessions and sports camps.\nMerseyside’s Police Commissioner Emily Spurrell said: “I’m delighted to announce the next round of successful bids for our Arts | Culture | Sport Fund. We know how important it is to give our young people the chance to try new experiences and gain skills and qualifications that can set them on a positive path and help to build brighter futures.\n“Engaging young people with great, fun activities is vital if we want to help them reach their full potential and prevent them getting involved in activities which could lead to trouble, or harm to themselves or others.\n“Sadly, we have seen the devastating impact that austerity and the cost-of-living increase has had on families in our region. Those pressures, coupled with the desperate underfunding of local councils and youth services have seen opportunities for our young people decrease significantly in recent years.\n“By investing in young people, our Arts | Culture | Sport Fund is entirely focused on reversing that trend by giving them the chance to access brilliant activities, projects and training opportunities that benefit them mentally, physically, and culturally and helping them make better choices for the future.\n“From work experience placements to sporting sessions, drama classes, one to one mentoring and vital education work to tackle key issues including knife crime, exploitation and domestic abuse, these 18 projects have all been chosen because they will support and inspire our young people to achieve more, and I’m really excited to see how each of them progress over the coming months.”\nSuperintendent Georgina Garvey, Temporary Director for the Merseyside Violence Reduction Partnership said: “By providing funding to these fantastic grassroots organisations, our goal is to enable them to provide unique opportunities that support our young people, building their skillsets, increasing their confidence as well as their physical and mental health and creating a positive legacy.\n“We had some wonderful applications that made the process of choosing these successful bidders all the more difficult, but we are delighted and really proud of the diverse range of initiatives that will be available to our young people through this funding. From hip hop workshops to yoga to football tournaments to residential retreats, we have a plethora of inspiring activities for young people to enjoy.”\nJames Proctor, Programmes Manager at the Community Foundation for Merseyside said : “We are proud to continue our work with the Merseyside Violence Reduction Partnership to deliver this funding to support a range of local community projects making a positive difference to young people’s lives.\n“The Funding awarded will help charitable groups in many different parts of Merseyside to deliver targeted projects using the positive impact of arts, culture and sporting activities to help both prevent and protect young people from experiencing violence”.\nSuccessful projects\nFind out more about successful projects here.\nWhat is the Merseyside Violence Reduction Partnership?\nIn total, 20 Violence Reduction Units (VRUs) have been established across England and Wales to help deliver the Government’s Serious Violence Strategy to tackle knife and gun crime and homicide.\nPolice and Crime Commissioners lead on commissioning these multi-agency units in their areas, bringing together strategic partners to deliver system-wide interventions to prevent and reduce crime.\nIn Merseyside, we renamed our unit to the Merseyside Violence Reduction Partnership (VRP) because we believe the word ‘partnership’ reflects the way we work and approach this challenge.\nThe VRP brings together Merseyside Police, Merseyside Fire and Rescue, local government, National Probation Service and the county’s Youth Offending Service, health and education professionals, community leaders and other key partners.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_merseyside-unites-behind-new-plan-to-prevent-serious-violence/content_13.html": "Organisations across Merseyside will unite today (Friday 9th February) to launch a new plan to drive forward the work to prevent and reduce serious violence across our region.\nStatistics released last week show serious violence on Merseyside has decreased by 8% in the past year, knife crime is down by 18.6% and gun crime is at the lowest level since records began 22 years ago.\nThe new Merseyside Serious Violence Duty Strategy focuses on how agencies across Merseyside can work even closer together to continue to drive this downward trend, preventing more people being drawn into serious violence, creating a safer, stronger region.\nOverseen by the region’s Police and Crime Commissioner (PCC), Emily Spurrell, the Strategy details how Merseyside Police, Merseyside Fire and Rescue Service, the region’s five local authorities, NHS Merseyside and Cheshire, and the prisons and probation service will take a public health approach to preventing serious violence.\nThis means understanding what leads to serious violence, the causes and the triggers and acting to prevent it occurring in the first place.\nToday’s launch at the Cotton Exchange in Liverpool, will be opened by the PCC and Merseyside Police’s Deputy Chief Constable, before Liverpool spoken word artist and poet Joseph Roberts will help to bring the new strategy to life.\nThere will then be sessions focusing on best practice featuring Liverpool City Council’s Serious Violence Community Forum and Wirral Council on the work of EVOLVE in their areas, which sees the PCC and police working with partner and residents to disrupt and deter organised crime and protect communities, as well as a panel discussion, before representatives will pledge their commitment to delivering the new Strategy.\nThe Strategy set out how partners will work across three crucial pillars driven by clear short, medium and long-term objectives, all focused on making the biggest difference in our communities:\n- People – building resilience and creating meaningful, valuable opportunities.\n- Places – creating safer places and spaces.\n- Partnerships – strengthening the bonds between organisations to continue to improve the combined response.\nThe 68-page strategy is the product of extensive consultation carried out in 2023 and demonstrates the commitment from organisations, known as ‘specified authorities’ to meet their requirements under the Serious Violence Duty which came into effect in January.\nThe Duty requires organisations to work together to share information, collaborate and plan to prevent and reduce serious violence within their local communities.\nTo achieve this, the Strategy sets out eight core principles which will be at the heart of this work, with a real focus on community cohesion – empowering communities to make sure they have a voice and are actively involved in addressing and solving the issues that matter to them. This includes equipping people to develop new skills and deliver interventions which are long-term sustainable; delivered by communities for communities.\nProgress against the objectives will be overseen by the Merseyside Strategic Policing and Partnerships Board (MSPPB) chaired by the Police and Crime Commissioner and the plan will be refreshed annually to ensure it is responsive to local need.\nMerseyside Police and Crime Commissioner Emily Spurrell said: “Our region has come a long way in reducing and preventing serious violence in recent years. Gun crime, knife crime and all serious violence offences have decreased significantly.\n“This is hugely welcome, but there is still more we can all do.\n“The launch of this Serious Violence Duty Strategy is important because it sets out our ongoing commitment to working together to prevent and tackle serious violence and the harm it causes, preventing families from suffering the devastation and harm it brings.\n“Anyone can be affected by serious violence and sadly, our region is no stranger to the life-changing consequences – for victims, relatives, loved ones, friends and witnesses – when tragedies occur. That’s what drives us to work even harder and why prevention is essential.\n“To deliver lasting change, we must get upstream, intervene early, and stop violence from happening in the first place. By working together, I firmly believe we can continue to build a safer, stronger Merseyside, free from violence and the fear of violence.”\nCllr Shelley Powell, Knowsley Cabinet Member for Communities and Neighbourhoods, said: “Knowsley fully supports the launch of the new Serious Violence Duty Strategy and we are committed to working with our partners to continue to reduce serious violence in our region.”\nCouncillor Laura Robertson-Collins, Liverpool City Council’s Cabinet Member for Communities, Neighbourhoods and Streetscene, said: “There is a relentless determination from all partners to tackle the root causes of serious violence, so that residents can go about their lives without fear of crime.\n“The joint working that takes place across Liverpool, such as through the EVOLVE-Liverpool project, is making a real difference to communities.\n“We know from statistics that the number of violent incidents is decreasing, but even just one is too many, and we are not complacent as we know there is much more to do.\n“The launch of the strategy is part of our commitment to redouble our efforts to tackle the issue.”\nCouncillor Mancyia Uddin, St Helens Borough Council’s Cabinet Member for Safer Communities and Chair of the Safer St Helens Executive, said: “Serious violence inflicts deep and lasting trauma on the people and communities affected by it, so we welcome this unified approach towards its prevention.\n“In upholding the Duty, the Safer St Helens Executive will continue to address underlying risk factors which are shared between serious violence across the region and local priorities such as domestic abuse, to ensure a whole-systems approach to reducing risk and harm.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_make-misogyny-a-hate-crime/content_25.html": "Emily has today written to the Chief Constable of Merseyside Police calling on the police to start recording misogyny as a hate crime.\nThe letter, signed by Councillors and MPs from across Merseyside, said;\n‘Dear Chief Constable Andy Cooke,\nWe are writing to you today on behalf of women across the region who have been sharing their experiences of street harassment and abuse in response to the tragic murder of Sarah Everard.\nWomen need to feel safe on the streets of Merseyside and they need to have trust in police and criminal justice organisations that they will be taken seriously and treated fairly.\nViolence against women and girls does not occur in a vacuum; hostility towards women and girls generates a culture in which violence and abuse is tolerated, excused and repeated. Changing that means challenging not only individual acts of abuse but the very roots of the culture which enables it.\nGathering the evidence about the extent, nature and prevalence of hostility towards women and girls and how these interplay with the experience of crimes like domestic abuse and sexual violence is crucial to recognising these connections.\nWe therefore urge you to consider how Merseyside Police can start recording misogyny hate crime incidents.\nNumerous police forces around the country are now recording incidents of misogyny and street harassment and this allows us to get the root of the issue and understand how to best tackle violence against women and girls.\nMaking misogyny a hate crime simply means police forces would log and monitor such incidents and then enable them to create a full picture of the problem, support victims, and make them aware of where incidents are reoccurring.\nWomen and girls need to feel their concerns are being taken seriously by the police and that misogyny is not normalised.\nAccording to UN Women 80% of women in the UK have experienced sexual attention or sexual or physical contact in a public place. It has never been more vital to tackle misogyny at its root.\nWe look forward to hearing from you.\nUpdated 17th March: After pressure from MPs and campaigns like ours across the UK the Government have now committed to asking police forces to start recording misogyny as a hate crime from September.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_fire-engines-drive-the-message-there-is-no-excuse-for-sexual-violence/content_53.html": "Fire engines are driving the message across Merseyside that there is No Excuse for sexual violence of any kind.\nMerseyside Fire and Rescue Service have given their support to the Safer Streets Merseyside campaign by featuring the artwork on two of their fire appliances.\nSafer Streets Merseyside is an awareness-raising campaign focused on preventing sexual violence particularly in the night-time economy and on public transport – two areas women highlighted as being of particular concern.\nIt focuses on identifying and calling out unacceptable and harmful behaviours and making it clear there is a zero-tolerance approach to sexual violence in Merseyside, while also encouraging anyone who has been affected by sexual violence to reach out for support.\nFollowing the latest phase which went live in September for the return of Freshers’ Week, campaign messaging featured in key areas such as student accommodation, around the universities, in the city centre, across the transport network and in popular student bars.\nAs part of the powerful visual marketing campaign, the fire engines are to carry the message targeted at potential perpetrators and make it clear there is no excuse for behaviours such as stalking either physically or online, groping or uninvited touching.\nMerseyside’s Police Commissioner Emily Spurrell said: “There is No Excuse for sexual violence and it’s important we take a proactive approach to tackling this issue. It’s imperative that these powerful messages are seen far across our region so that we can change attitudes and encourage long-term behavioural change.\n“Our campaign is designed to challenge would-be perpetrators and make it clear that we take a zero-tolerance approach to these utterly unacceptable and harmful behaviours, while also supporting women to get support if they’ve been affected.\n“It’s fantastic that Merseyside Fire and Rescue Service are supporting our very clear message so that we can reassure women that we take their safety very seriously and will not tolerate sexual violence of any kind.\n“Stalking either physically or online, exposing yourself in public, groping and uninvited touching – these are all forms of sexual violence that no girls or women should have to endure.”",
  "https_emily4merseyside_com_/https_emily4merseyside_com_securing-over-3-3m-for-merseyside/content_40.html": "I promised I’d stand up for Merseyside and take our call for more funding right to the heart of Government.\nThat’s exactly what I’ve done and secured more than £3.3 from central Government for some really valuable projects, which will provide extra support for vulnerable victims of sexual violence and domestic abuse and crackdown on crime, particularly in hotspot areas.\nBut I know this funding does not go far enough and so I’m continuing to work with partners to identify more funding sources to ensure all vulnerable victims, especially victims of domestic abuse and hate crime, get the support they need.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_successful-week-to-tackle-knife-crime-as-data-shows-22-reduction-in-offences-across-merseyside/content_15.html": "Merseyside Police and partners’ intensified efforts to tackle knife crime has resulted in almost 250 knives and dangerous weapons removed from the streets, as part of a national week of action.\nOperation Sceptre ran from Monday 13 November to Sunday 19 November, as part of a national effort to target those carrying weapons, prevent knife related offences, raise awareness of the dangers of knife crime, and provide young people with more positive alternatives to crime.\nThe week of action follows the release of the Office of National Statistics (ONS) annual report which shows Merseyside has seen a 22% decrease in knife crime in 2022-2023 compared to the previous year, the second highest reduction of any county nationally.\nThe force remains determined to further reduce knife crime and the devastating impact it has on individuals, families, and the wider community.\nDuring the week of action, a knife surrender took place at 10 police stations across Merseyside. In total, 170 weapons were handed in by the public, which included swords, flick knives and other bladed articles banned under the Offensive Weapons Act.\nA further 77 weapons were recovered during proactive stop searches, weapons sweeps and during the arrest of 35 people.\nMerseyside Police is one of four forces currently trialling the introduction of Serious Violence Reduction Orders (SVROs). Officers are proactively monitoring individuals with live orders and undertaking stop searches when they are in a public place. Working with the CPS, the force has secured 50 orders to date.\nThe week also saw officers take part in 64 community meetings and school events, which were described as “thought-provoking and informative”. The sessions discussed the dangers of carrying a knife, the consequences and how the police are tackling the issue.\nOne group of secondary school students even created knife crime prevention posters which included powerful messages including “no more violence” and “Less knifes, more lives”.\nThe twice-yearly operation involves all 43 police forces in England and Wales and British Transport Police and builds on the prevention and enforcement work police carry out all year round to combat knife crime.\nThroughout the week, many of the Merseyside Violence Reduction Partnership (MVRP)’s initiatives were also running focused on preventing knife crime and educating young people.\nThis includes the Mentors in Violence Prevention programme which sees young people equipped with the language, behaviours and skills to tackle the issues that often underpin violence and enable them to safely intervene.\nSeveral Knifesavers training events were also held at Aintree University Hospital focused on educating local community members on how to deal with a knife injury and stem blood loss, using special bleeding control kits. This included one ‘train the trainer’ session, giving people the skills to deliver the sessions to others across Merseyside equipping young people and the public with the skills if confronted by a life-threatening bleed. A further Knifesavers session focused on warning young people about the dangers of carrying or using knives and giving them the training to deal with an incident should it occur, is due to be held at Anfield today (Friday).\nMerseyside’s Police Commissioner Emily Spurrell said: “In the past year, we’ve seen a significant and hugely welcome decrease in knife crime and serious violence offences.\n“This is down to the hard work and commitment of Merseyside Police, our Violence Reduction Partnership and a wide range of partners, who are determined to prevent and reduce the use of knives and their potentially devastating consequences.\n“Even one knife incident is too many and that’s why tackling the use of knives is a priority all year round. Weeks of action, like Operation Sceptre, are pivotal to this work as they provide a platform for us to educate and work with the public, getting potentially dangerous weapons off the streets and engaging with young people about the consequences of picking up a weapon.\n“We know that enforcement alone will not tackle the root causes of why people find themselves involved in violent crime and that’s why we’re focused on acting early and working with young people to steer them away from crime and towards a brighter future.”\nIf you have information about someone carrying a knife, or know someone involved in crime, you can report any concerns on 999 if a crime is in progress, via 101, or our social media desk via Twitter @MerPolCC.\nYou can also pass information via Crimestoppers anonymously, on 0800 555 111 or via their online form at: https://crimestoppers-uk.org",
  "https_emily4merseyside_com_/https_emily4merseyside_com_latest_page_2/content_43.html": "One year on: progress on region-wide VAWG Delivery Plan\nMerseyside Police Commissioner Emily Spurrell has unveiled a progress report detailing the achievements from the last 12 months in the work to tackle Violence against Women and Girls. The ‘Working in partnership to tackle Violence against Women and Girls (VAWG) Delivery Plan’ was launched by Emily Spurrell a year ago, after an extensive consultation. It sets out…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-spurrell-re-elected-as-merseyside-police-and-crime-commissioner/content_4.html": "Labour’s Emily Spurrell thanked voters on Merseyside for re-electing her to be the region’s Police and Crime Commissioner for a second term.\nEmily took 61.7% of the vote, beating challenges from three other candidates to secure a further four years in office on a promise to continue to fight crime and invest in hard-hit neighbourhoods.\nUpdates on Emily’s work as PCC can be found on the Office of the Merseyside Police and Crime Commissioner website.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_a-challenging-month/content_78.html": "November has been an extremely challenging month for Merseyside – first with the horrific terrorist incident outside Liverpool Women’s Hospital and then the tragic deaths of two women in Liverpool on one day – Malak Adabzadeh, 47, and 12-year-old Ava White.\nThese incidents have shocked and devastated us all, and my heart goes out to everyone affected. There is clearly a lot more work to be done to tackle serious violence and keep our communities safe.\nAs ever in times of adversity and tragedy, Merseyside pulled together.\nWe support each other at times of difficulty.\nWe stand together as one.\nIf you need support following recent events, please visit the PCC Victim Care Merseyside website.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_operational-review-will-enhance-policing-services-for-merseyside-communities/content_55.html": "Following an extensive review of its operating model, Merseyside Police is implementing the final phase of a change programme designed to enhance the service provided across the county and ensure that the force maintains its determination to put communities first.\nThe review, known as the Community First Operational Review (CFOR), initiated a series of changes to underpin the force’s commitment to maximising available resources to reduce crime and anti-social behaviour, prevent offending and re-offending and improve victim experiences.\nMerseyside’s Police Commissioner Emily Spurrell said: “Neighbourhood policing is the bedrock of good policing, and today’s announcement is part of our ongoing commitment to making sure Merseyside Police is in the best possible position to serve our communities now and into the future.\n“That means a greater focus on place with more dedicated resources into each of our boroughs and more investment in the teams that tackle the issues that matter most to local people with extra officers to respond to emergencies, tackle gang and gun crime, and protect vulnerable people. We are also boosting the teams that work to disrupt serious and organised crime and make our roads safer. All steps which will help Merseyside Police to forge even stronger connections with communities across Merseyside.\n“These changes are the result of detailed analysis and review of how the organisation operates and have been developed to enable Merseyside Police to be as effective and efficient as possible, maximising our resources and ensuring officers and staff are based where they are most needed to build a safer region for all.”\nChief officers commissioned the review in January 2022 and following a comprehensive programme of research, and consultation with policing colleagues and community partners, a raft of recommended changes was approved for phased implementation, beginning in April this year.\nThe final phase is underway and due to conclude in October 2023, and whilst some changes may be less noticeable to the public, others are quite visible. Notably, the implementation of a City and Boroughs structure for Local Policing and the introduction of Command Team Corridors for the city and each borough, stand out as changes that will benefit all communities.\nThe City and Boroughs structure reflects the complex demands within the five policing areas across Merseyside. It underscores the force’s commitment to providing visible and accessible neighbourhood policing, and supports the introduction of Command Team Corridors to optimise partnership working and foster cohesive decision-making. This is all aimed at addressing local issues effectively.\nIn summary, the most noticeable changes are:\n- The introduction of a City and Boroughs structure for Local Policing with each of these five areas led by a Superintendent\n- A focus on place with neighbourhood, response, proactive and investigative resources dedicated to each local authority area\n- Additional patrol stations opened at Upton, Southport, Lower Lane, Admiral Street and Speke, plus the relocation of patrols based at Kirkby to Huyton – all of which optimise response times\n- The introduction of Command Team Corridors that co-locate each area’s command team from Response and Resolution, Investigation and Local Policing to enable more cohesive management and problem solving\n- Investigation split into two partner strands – Investigation and Investigation Protecting Vulnerable People (PVP) – each led by a Chief Superintendent\n- The introduction of a Child Criminal & Sexual Exploitation Team (CCSET), which will be a centralised team\n- An uplift in officer numbers across Response and Resolution, Investigation, Investigation (PVP), Matrix and Local Policing\n- Increase in Roads Policing officers – to make Merseyside’s roads safer\n- Increase in Disruption officers – to further enhance the ability to tackle serious and organised crime\nCollectively, the CFOR changes allow Merseyside Police to deliver a highly localised service that is best placed to meet the needs of communities across the force area. Although the location of where some officers and staff are based has changed, the police stations with public enquiry counters and other contact methods for Merseyside Police all remain the same.\nTo report a crime, anti-social behaviour or a road traffic incident to Merseyside Police, use the following options:\n- Force website: https://www.merseyside.police.uk/ro/report/\n- Force Contact Centre social media channels: Twitter or Facebook\n- Enquiry counter at your local police station\n- Call 101\nYou can also contact Crimestoppers anonymously on 0800 555 111 or pass information via their secure online form at: https://crimestoppers-uk.org/give-information/forms/give-information-anonymously\nIn an emergency, always call 999.\nIf you have a hearing or speech impairment, use the textphone service 18000 or text on 999 if you’ve pre-registered with Relay UK, the emergency SMS service.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_hillsborough-law-now/content_49.html": "Following on from the calls made by Steve Rotheram, Andy Burnham, Maria Eagle and many others, I was pleased to join with my fellow Labour PCCs to call for a Hillsborough Law Now. The Hillsborough families fought for decades to try and get answers about what happened that awful day. No-one should have to fight as hard as they have, and so many others, in order to see justice done.\n“We join together to support the calls from the Metro Mayors for Greater Manchester and Merseyside, as well as many other high-profile figures from all walks of all life and all parties, for a ‘Hillsborough Law’.\n“What happened at Hillsborough in April 1989 was utterly devastating. The cover up that followed was a national disgrace.\n“It is only because of the unwavering determination, perseverance and strength of the families and campaigners over a staggering 33 years that the truth was finally uncovered.\n“Sadly, there are far too many examples of decent people who have suffered unimaginable heartache having to fight far too long, and far too hard, against the might of the state to get the justice they deserve.\n“People who have already suffered deeply, being re-traumatised as they struggle against the very system which should be there to protect them.\n“Change is long overdue. Action to improve the system of support for families bereaved as a result of a public disaster is needed now.\n“A Hillsborough Law would introduce a package of measures which we believe will help to rebalance the scales of justice. It would ensure bereaved families are treated in a fairer, more just way, and help to prevent them from experiencing the same suffering and torment as those affected by Hillsborough and so many other disasters.\n“It would give bereaved families a greater role to have their say at inquests, through publicly-funded legal representation, while bringing to an end limitless legal spending by public bodies seeking to cover up or defend wrong-doing.\n“As Police and Crime Commissioners, Mayor and Deputy Mayors for policing, we have a critical role in scrutinising the police. We are already working proactively to increase accountability and transparency within our justice system, and the introduction of a statutory duty of candour on all public servants would be a further welcome step in this process.\n“Families who how have been affected by such pain and suffering, deserve the best possible support. We particularly support the recommendation for a Public Advocate to be appointed to act on their behalf.\n“Such a move would ensure those families have someone on their side; to help them to get information they need, to navigate the complexities of the legal system, and ensure they are assisted every step of the way to get the justice they deserve.\n“No-one should ever have to suffer the same pain and torment as that experienced by the Hillsborough families. No-one should be denied the truth, year after year. No-one should ever again be let down so badly by the system.\n“We must ensure it is never repeated.\n“When disasters occur, we must do everything possible to support the families and ensure those affected get the truth and get justice.\n“We join Andy, Steve, and so many others, in urging the Government to commit to bringing forward a #HillsboroughLawNow.\n“There is no time to wait.”\nEmily Spurrell Merseyside PCC\nTracey Brabin Mayor for West Yorkshire\nAlison Lowe Deputy Mayor for West Yorkshire\nSophie Linden Deputy Mayor for London\nBaroness Bev Hughes Deputy Mayor for Greater Manchester\nJoy Allen Durham PCC\nAlan Billings South Yorkshire PCC\nJeff Cuthbert Gwent PCC\nAndy Dunbobbin North Wales PCC\nSimon Foster West Midlands PCC\nRt. Hon Alun Michael South Wales PCC\nKim McGuiness Northumbria PCC\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_supporting-victims-and-communities-video/content_57.html": "Skip to content\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nHomepage\nManifesto\nLatest News\nAbout Me\nJoin Labour\nSupporting Victims and Communities Video\nEmily Spurrell\nSocial Media\nSaturday 20 March 2021\n|\n0\nShare this:\nFacebook\nTwitter\nPost navigation\nPrevious:\nPrevious post:\nVisible and Accountable Policing Video\nNext:\nNext post:\nFair and Effective Criminal Justice System Video",
  "https_emily4merseyside_com_/https_emily4merseyside_com_author_emily_s/content_9.html": "Latest News\nEmily Spurrell re-elected as Merseyside Police and Crime Commissioner\nLabour’s Emily Spurrell thanked voters on Merseyside for re-electing her to be the region’s Police and Crime Commissioner for a second term. Emily took 61.7% of the vote, beating challenges ...\nLabour’s Police & Crime Commissioner pledges a safer, stronger Merseyside\nLabour’s Police Commissioner Emily Spurrell has today launched her manifesto setting out her commitments if re-elected for a second term on Thursday May 2nd. Emily was first elected in 2021 ...\nCrime across Merseyside drops by 13% in year\nCrime across Merseyside has fallen by 13% in the past year, with significant decreases in gun discharges, knife crime and burglary. The reductions were confirmed yesterday at the Police and ...\nA record of delivery\nSome of my key achievements since taking office in 2021\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_400000-to-help-victims-over-the-next-five-years/content_10.html": "Merseyside’s Police Commissioner has pledged £400,000 over the next five years to give victims of crime the opportunity to get answers from those who have harmed them.\nEmily Spurrell has announced she is expanding the region’s restorative justice service to run for the next five years.\nFollowing a competitive tendering process, not-for-profit community interest company Restorative Solutions, has been commissioned to continue delivering a victim-led restorative justice services across the region from 1st April 2024 until 2027.\nThe service is set to be further uplifted in the first year with additional funding provided by the North West Probation Service.\nRestorative Solutions has been offering victims in Merseyside the chance to come face-to-face with offenders since being awarded the original contract in 2018.\nRestorative Justice brings victims and offenders together so they can tell one another their account of an incident with the aim of putting victims back in control and ensuring offenders understanding the consequences of their actions, with the aim of finding a positive way forward.\nRestorative justice is always voluntary and only happens if both the victim and offender agree to take part. Any meeting follows a detailed and careful assessment by a trained facilitator who reviews whether a case is suitable and the potential benefits of a victim and offender meeting, while assuring the process remains safe throughout.\nVictims, and offenders, can withdraw from the process at any point.\nMerseyside’s Police Commissioner Emily Spurrell said: “Restorative Solutions has a proven track record providing vital support for victims on Merseyside, so I’m delighted to award them a renewed contract so that they can continue this crucial service to help victims cope and recover.\n“Becoming a victim of crime can be hugely traumatic. It can often be life-changing; and what once felt normal and familiar no longer feels safe. Those negative repercussions can affect an individual for a very long time and while the criminal justice process deals with the offence, it can sometimes leave those harmed feeling out of control and in need of answers.\n“Restorative Justice readdresses the balance, gives them a chance to explain the true impacts of crime to the offender, providing them with answers and restoring control.\n“By also holding offenders to account, Restorative Justice can play a crucial role in their rehabilitation by helping them to take responsibility for their actions, reducing the likelihood of reoffending.\n“Improving outcomes for victims is a key priority for me, so I am pleased to extend this partnership with Restorative Solutions. I look forward to seeing how they continue to increase the use of restorative justice across Merseyside over the next five years, empowering more victims and helping to resolve the harm that has been caused, while reducing reoffending.”\nEvidence shows that most people who take part in a Restorative Justice process come away feeling satisfied because it has allowed them to have their say.\nIt also helps people to move on and to feel less fearful of crime in the future.\nStudies on restorative justice have highlighted:\n- 85% of victims who participated in face-to-face restorative justice were satisfied.\n- Restorative justice reduces the frequency of reoffending and led to £8 savings for every £1 spent.\n- 78% of victims that participated would recommend restorative justice to other victims.\n- Restorative justice reduced Post Traumatic Stress Disorder symptoms for victims.\n- Restorative justice has been found to significantly reduce levels of fear and anger in victims.\nThe service, which will start from 1st April 2024, will receive £80,000 a year from the PCC’s office. It will be enhanced by an additional £19,000 from the North West Probation Service during 2024/25.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_about/content_6.html": "ABOUT EMILY\nEmily Spurrell is standing to be re-elected as Labour and Co-operative Police and Crime Commissioner for Merseyside on 2nd May 2024.\nEmily was first elected as a Councillor for Mossley Hill ward in Liverpool City Council in May 2012.\nShe was appointed as Mayoral Lead for Community Safety in 2014 and became Cabinet Member for Communities and Safer Neighbourhoods in 2017.\nHere she oversaw the development of a Domestic Abuse strategy, instigated a new approach to community cohesion and chaired the Citysafe Board which provided funding to local groups to improve community safety.\nEmily served as Deputy Police and Crime Commissioner for Merseyside from September 2017 to March 2019.\nDuring this time she championed victims and led on work to tackle violence against women and girls.\nShe developed a scheme to engage employers in tackling domestic abuse and initiated a project to investigate experiences of sexual violence across Merseyside.\nSince taking office as PCC in 2021, Emily has launched brand new victims hub, launched new strategies to tackle violence against women, road safety and serious violence and has invested in schemes to divert young people away from crime and anti-social behaviour.\nEmily lives in Sefton with her husband and dog.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_vision-zero-annual-report-released-to-mark-road-safety-week/content_66.html": "An Annual Report detailing the progress made against the Vision Zero Road Safety Strategy has been released to mark Road Safety Week.\nThe report maintains partners accountability to work within the guidance set out by the strategy. It highlights the partnerships work towards Vision Zero, demonstrating how we have worked to improve road safety since the launch of the strategy in October 2022.\nPartners will also mark Road Safety Week by remembering those who have lost their lives on our roads in a memorial service at St Georges Hall and as night falls St Helens Council will be lighting up the Steve Prescot Bridge in yellow in memory of all who have been killed on Merseyside’s Roads.\nThe week will see activity across the partnership including school visits, kids speed checks and local business engagement.\nMerseyside’s Police Commissioner Emily Spurrell said: “Everyone deserves to feel safe on Merseyside’s roads. Deaths and injuries are neither acceptable nor inevitable – they are preventable.”\n“Through Vision Zero we set out our ambition to reduce the number of people killed or seriously injured in avoidable road collisions to zero. It’s a bold aspiration, but it’s what we must be focussed on delivering if we want to ensure fewer families suffer the devastation and heartache caused by road collisions.”\n“As we mark Road Safety Week, the release of our first annual report provides a snapshot of the progress that’s been made over the last year. From engagement and education to enforcement and infrastructure, there’s been lots of progress, but we know there is much more still to do.”\nSteve Rotheram, Mayor of the Liverpool City Region, said: “In Vision Zero strategy, we’ve set a bold target to reduce the number and severity of road traffic collisions. It’s our ambition that, by 2040, no one will be killed or seriously injured on our roads.\n“While a big part of that relies on people’s road safety awareness, there are lots of practical steps we’re taking to encourage long-term behaviour change in how people choose to travel.\n“At present nearly two thirds of all journeys in the region are less than 5km, but half of them are taken by car. It’s clear that the only way we can change this is by providing people with a genuine alternative.\n“That’s why since I was elected Mayor, I’ve been working to build an integrated London-style public transport system that’s faster, cheaper, cleaner and better connected – and we’ve already taken huge steps towards that goal.\n“We’ve invested massively in our public transport network, from the historic decision to take back control of our buses to our brand-new publicly owned £500m trains to the more than £70m we’re spending on new walking and cycling infrastructure.\n“By giving people a reason to ditch the car, we can drastically reduce traffic and congestion on our roads, improve the quality of air we all breathe and make our roads safer for everyone.”\nThe report demonstrates the shift in working practices to a Safe Systems approach and highlights events such as road safety week encompassing delivery details.\nHistorically, the partnership has worked through areas of responsibility dedicated to specific authorities or agencies. The Safe Systems approach, however, empowers all partners to work freely across the 5 pillars, adapting their work to their priorities to improve road safety and ensuring a proportionate approach.\n“There are no quick fixes or instant answers to reducing fatalities and casualties on our region’s roads, but that’s why it’s essential we work as a collective and remain committed to delivering long-term behaviour change. For it only by working in partnership, that we can create a region that is cleaner, greener and most importantly, safer, for all.”\nThis Road Safety Week partners will be working to improve road safety, putting particular emphasis on ‘Safe Speeds’.\nThroughout Road Safety Week, Safer Roads Watch teams will be deployed on local roads, Merseyside Police will be dedicating resources to speed enforcement and schools will be asked to support campaigns and share the message.\nPaul Fletcher from Merseyside Road Safety Partnership said: “This Road Safety Week let’s talk about speed. As one of the Fatal Four offences speed is a regular contributing factor in road traffic collisions resulting in a death. In 2021, a quarter of all fatal collisions on Merseyside included speed as a contributing factor.\n“This partnership is dedicated to Vision Zero but we can only get there by working together, we must all accept responsibility for our behaviour and make choices based on Road Safety.”\nWant to support future Road Safety campaigns? Sign up as a Safer Roads Watch Volunteer on the Merseyside Road Safety Partnership website.\nYou can tell us about local road safety issues on the Merseyside Road Safety Partnership website, we will collate information you share with us and ensure it reaches the appropriate policing team, as well as sharing with local authorities and other partners where necessary.\nFind out more and read the annual report here.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_scrutinising-police-response-to-victims-and-communities/content_76.html": "During my election I committed to ensure police scrutiny and transparency was central to the work I do.\nSince taking office, I have updated my quarterly scrutiny meetings so that they are now live streamed and include questions submitted directly from the public.\nThis month there was focus on the Police response to supporting victims and communities including a particular emphasis on what is being done to tackle violence against women and girls.\nDuring the meeting I challenged the Chief Constable on the the work being done to tackle domestic abuse, improve rape conviction rates and root out misogyny and sexual misconduct from police ranks.\nYou must be logged in to post a comment.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_category_news_page_5/content_80.html": "Government policing settlement\nJust before Christmas the Government announced the policing settlement and, not unsurprisingly, it was severely lacking . They continue to push the burden onto local tax payers who are already struggling under the cost of living crisis, created by this Government, and I will continue to raise my concerns with the Policing Minister and call for a…\nRead more",
  "https_emily4merseyside_com_/https_emily4merseyside_com_diversionary-activities-for-young-people/content_47.html": "We know how important it is to provide better opportunities for our young people – to keep them and our communities safe. This is particularly true over Halloween and Bonfire Night when traditionally ASB can increase. So, it was fantastic to see more than 6,000 young people take part in brilliant diversionary activities provided by 27 great grassroots organisations over the autumn half term, thanks to funding from my Youth Diversion Fund.",
  "https_emily4merseyside_com_/https_emily4merseyside_com_emily-responds-to-the-police-crime-sentencing-and-courts-bill/content_34.html": "The Police, Crime, Sentencing and Courts Bill should have been an opportunity to take steps to repair the damage done to the criminal justice system.\nInstead the Government chose to focus their efforts on protecting statues, instead of women, and clamping down on legitimate forms of protest.\nWhilst the positive, long overdue, steps taken to increase sentences for crimes such as dangerous driving and attacks on blue light workers are welcome, without taking urgent action to address the huge backlog in the courts, victims will continue to be let down by the justice system.\nThe right to protest is a fundamental right in a democratic society. The proposals to place heavy restrictions on this right are deeply concerning.\nI strongly oppose the suggestion that police services should have more powers to restrict protest activity. It is not for the police to make a determination as to what counts as legitimate or appropriate protest.\nUnder these proposals even pensioners, worried and protesting about their TV licence, could be criminalised.\nI support the work of my Labour colleagues in Parliament to challenge the Government on these dangerous proposals and hope to see it defeated or significantly amended."
}