{
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_news_surrey-conservatives/content_5.html": "Surrey Conservatives News\nNews from the Surrey Area. The links below will take you to the Surrey Conservatives website if selected so that you can read the full article.\n-\nNew funding to boost Surrey’s businesses and economy\nFunding worth millions is now available from Surrey County Council for innovative ideas to drive growth across Surrey.Businesses, employer representative groups and partner organisations (including SCC teams) are all invited to apply for investment from the new Economic Growth Fund.Up to £7 million… -\nPlaying To Win - The Role of Social & Digital Media in Modern Political Campaigning\nStuart Carroll is an officer in Spelthorne and Surrey. He also a former cllr having served for 8 years and as cabinet member for adult social care, health and children’s services. It is axiomatic that politics has changed. The emphatic election of President Trump, sweeping changes across… -\nSurrey County Council Refutes Claims of SEND Service ‘Failure’ with Data-Driven Response\nSurrey County Council Conservatives Refutes Claims of SEND Service ‘Failure’ with Data-Driven ResponseSurrey County Council has responded robustly to recent claims by politically motivated individuals that its Special Educational Needs and Disability (SEND) services are in crisis, presenting a… -\nRe-four-mation\nBoats are an over used analogy in political thinking - and certainly a brave one to use in landlocked Surrey, where the visualization of a canal boat or a laser dinghy doesn't quite have the same impact as a seafaring ship. But their overuse will not stop me here... as, in recent, months our… -\nSurrey Taskforce calls on Government to help reduce disruptive utility works\nSurrey County Council, along with National Highways and six major utility providers, has called on the Department for Transport (DfT) to make changes to systems and processes to reduce the negative impact of emergency utility works across the county.Last year, Surrey County Council established a… -\nSurrey County Council addresses critical challenges facing Surrey’s natural environment\nSurrey County Council has launched a new Land Management Framework, setting out best practice guidelines for managing its own land as well as striving to aspire other landowners and stakeholders to adopt and deliver similar approaches. The new framework aims to ensure Surrey’s countryside is… -\nSafer school journeys for children across Surrey\nChildren at twenty-two schools across the county are now benefiting from safer journeys to and from school, following a £3m investment to improve road safety and encourage more walking, cycling and wheeling.Improvements include a range of measures designed to create safer and more accessible routes… -\nPaul Follows Must Resign Immediately: Integrity of Local Government at Stake\nThe Conservative Councillors of Surrey are calling for the immediate resignation of Paul Follows, the Liberal Democrat Leader of Waverley Borough Council, following shocking video footage that has cast a dark shadow over the integrity of local government.In a damning revelation, a video recording… -\nBetrayal of Trust: The Shameful Actions of Paul Follows and the Surrey Lib Dems\nThe residents of Surrey have been dealt a shocking betrayal by those who claim to represent them. A video, captured and passed to us by a council insider, has exposed the deeply unethical and disgraceful behaviour of Cllr Paul Follows, Leader of Waverley Borough Council, Lib Dem County Councillor,… -\nSinkhole in Godstone (Updated)\nUpdate 24.02.25Matt Furniss, Cabinet Member for Highways, Transport and Economic Growth, said: “Surrey County Council’s highways teams are continuing to work around the clock to manage the sinkhole incident in Godstone High Street.”“Specialist ground penetrating radar equipment to carry out further…",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_contact/content_4.html": "Honest, Hardworking & Caring. Working to maintain and enhance the quality of life so many of us enjoy in Weybridge and improve life for those less fortunate.\nContact Form\nPromoted by Steve Bax on behalf of Colin McFarlane and Weybridge & St Georges Hill Conservatives, Curzon House, Church Road, Windlesham, Surrey GU20 6BH\nSorry, this website uses features that your browser doesn’t support. Upgrade to a newer version of Firefox, Chrome, Safari, or Edge and you’ll be all set.",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_news_runnymede-weybridge-conservatives/content_6.html": "Runnymede Weybridge Conservatives\nThe following articles are the 10 most recent news articles from the Runnymede Weybridge Conservatives. The links below will take you to the Runnymede Weybridge Conservatives website if clicked on for the full article.\n-\nDr Ben Spencer MP tables bill to reduce traffic delay and disruption\nRunnymede & Weybridge MP Dr Ben Spencer has introduced a Bill in Parliament to highlight the continued disruption on our transport networks and require utility companies and other relevant parties to cooperate more effectively.His Transport (Duty to Cooperate) Bill includes provisions for the… -\nLabour housing target and Lib Dem failure has disastrous implications for Stoke D'Abernon\nStoke d'Abernon residents have had their worst fears confirmed regarding the development of land which is accessed from Blundel Lane and surrounds the Polyapes Scout campsite. Developers have stated that they are planning to build 250 homes on the site, in a new, sustainable neighbourhood, to… -\nLabour’s Jobs Tax will leave working families £3,536 worse off\nRachel Reeves has dangerously mismanaged our economy. And it’s working people who will pay the price.Labour’s Jobs Tax will leave working families £3,536 worse off over the course of this Parliament. Working families will notice and won’t forget. As well as long-term pain we’re now at the start of… -\nPaul Follows must resign Immediately: integrity of local government at stake\nThe Conservative Councillors of Surrey are calling for the immediate resignation of Paul Follows, the Liberal Democrat Leader of Waverley Borough Council, following shocking video footage that has cast a dark shadow over the integrity of local government.In a damning revelation, a video recording… -\n'Curry and conversation’ with Lincoln Jopp MC MP\nMake a note in your diary - Friday 21st March at 7pm for the RWCA Curry Night, taking place at the locally acclaimed Gaylord restaurant in Queens Road, Weybridge.For a very reasonable ticket price of £30 per head you'll enjoy an unforgettable Indian meal and great conversation as well as being… -\nEgham councillor Sam Jenkins joins the Conservatives\nWe are delighted to confirm that Cllr Sam Jenkins has joined the Conservative group at Runnymede Borough Council, becoming our first councillor in Egham Town ward in four decades.Sam was elected under the Runnymede Independent Residents’ Group banner in 2022 but was recently removed from that group… -\nConservatives deliver a 'win for Weybridge' with HGV ban\nConservative councillors Tim Oliver and Colin McFarlane and our Runnymede & Weybridge MP Dr Ben Spencer are continuing to reduce the impact of heavy goods vehicles (HGVs) in Weybridge.Tim initiated a ban on HGVs over 18 tonnes following a petition and local consultation. There is an… -\nRWCA welcomes Shadow Sec of State for Business at Egham event\nIt was a packed venue at the Foresters Arms in Egham where local Conservative members and supporters were joined by the Shadow Secretary of State for Business and Trade Andrew Griffith MP, on Friday 24th January.Andrew has a strong business CV, having been chief operating officer for Sky plc, at… -\nDr Ben Spencer MP hails progress on new Weybridge Health Centre\nIt is great news that a planning application has at last been submitted for the rebuild of Weybridge Health Centre. It will be decided by Elmbridge Borough Council in March.Runnymede & Weybridge MP Dr Ben Spencer says the re-provision of the hospital, which was destroyed by fire in 2017, is the… -\nTaxes UP! Jobs, growth and business confidence DOWN under Labour!\nKeir Starmer and Rachel Reeves' Budget is resulting in fewer jobs, lower growth, and higher borrowing costs.Don't just take our word for it. That's the verdict of business owners up and down the country who have lost faith in this Labour Government after just six months.In just six months under…",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_news/content_2.html": "News\n-\nDr Ben Spencer MP tables bill to reduce traffic delay and disruption\n01 May 2025Runnymede & Weybridge MP Dr Ben Spencer has introduced a Bill in Parliament to highlight the continued disruption on our transport networks and require utility companies and other relevant parties to cooperate more effectively.His Transport (Duty to Cooperate) Bill includes provisions for the…\n-\nLabour housing target and Lib Dem failure has disastrous implications for Stoke D'Abernon\n25 April 2025Stoke d'Abernon residents have had their worst fears confirmed regarding the development of land which is accessed from Blundel Lane and surrounds the Polyapes Scout campsite. Developers have stated that they are planning to build 250 homes on the site, in a new, sustainable neighbourhood, to…\n-\nLabour’s Jobs Tax will leave working families £3,536 worse off\n02 April 2025Rachel Reeves has dangerously mismanaged our economy. And it’s working people who will pay the price.Labour’s Jobs Tax will leave working families £3,536 worse off over the course of this Parliament. Working families will notice and won’t forget. As well as long-term pain we’re now at the start of…\n-\nPaul Follows must resign Immediately: integrity of local government at stake\n19 March 2025The Conservative Councillors of Surrey are calling for the immediate resignation of Paul Follows, the Liberal Democrat Leader of Waverley Borough Council, following shocking video footage that has cast a dark shadow over the integrity of local government.In a damning revelation, a video recording…\n-\n'Curry and conversation’ with Lincoln Jopp MC MP\n12 March 2025Make a note in your diary - Friday 21st March at 7pm for the RWCA Curry Night, taking place at the locally acclaimed Gaylord restaurant in Queens Road, Weybridge.For a very reasonable ticket price of £30 per head you'll enjoy an unforgettable Indian meal and great conversation as well as being…\n-\nEgham councillor Sam Jenkins joins the Conservatives\n26 February 2025We are delighted to confirm that Cllr Sam Jenkins has joined the Conservative group at Runnymede Borough Council, becoming our first councillor in Egham Town ward in four decades.Sam was elected under the Runnymede Independent Residents’ Group banner in 2022 but was recently removed from that group…",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_useful-links/content_3.html": "M25/J10 Junction Improvement Plan - Latest Update\nWeekly Highways Bulletin for Elmbridge\nWeekly Highways Bulletin for Surrey Area\nElmbridge Borough Council - Website\nElmbridge Borough Council - Benefits & Support\nElmbridge Borough Council - Planning Portal\nElmbridge Borough Council - Meetings Calendar",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk/content_1.html": "Latest News from Runnymede & Weybridge Conservatives\nNews\n- Dr Ben Spencer MP tables bill to reduce traffic delay and disruption\n- Labour housing target and Lib Dem failure has disastrous implications for Stoke D'Abernon\n- Labour’s Jobs Tax will leave working families £3,536 worse off\n- Paul Follows must resign Immediately: integrity of local government at stake\n- 'Curry and conversation’ with Lincoln Jopp MC MP\nMy Priorities for Weybridge\n1\nWeybridge Hospital Rebuild\n2\nDefend our area from harmful development\n3\nRenew our town centre\n4\nRepair our roads\n5\nProtection from Flooding\n6",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_about-colin/content_9.html": "Family - Community\nCllr. Colin McFarlane is a highly successful IT Manager, Project Manager and Business Development Manager who has been decorated for his voluntary service for over 10 years as a Community First Responder with the Ambulance Service. Colin has two grown up sons and three grandchildren. Colin has a proven track record of public service and is honoured to have been elected as an Elmbridge Borough Councillor for Weybridge St. Georges Hill at the October 2024 by-election.\nColin knows the importance of community\nAs a family man and strong team player, Colin believes in the importance of a community working together. A proven leader and someone who never asked of others what he would not do himself, Colin will roll his sleeves up and energetically drive projects and initiatives to make Weybridge an even better place to live and work.\nGet Involved with a winning team\nColin and his growing team want to help make Weybridge an even better place to live, work, raise a family, and build a business. If you would like to help Colin then join our team today !\nColin G McFarlane\n07742 971977",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_privacy-policy/content_8.html": "Last Updated: 21/09/2024\nThis document outlines how Colin McFarlane processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Colin McFarlane.\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Colin McFarlane.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Colin McFarlane, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. If you do not wish for us to contact you by telephone please do not provide this information. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and are in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of Schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area and/or the United Kingdom\nSome service providers are located outside of the European Economic Area (EEA) and/or the United Kingdom and therefore it may be necessary to transfer your personal data outside of the EEA/UK. Where the transfer of your data outside of the EEA/UK takes place we will make sure that it is protected in the same way as if the data was inside the EEA/UK, and it only occurs with your express consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA/UK, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. A review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use.\n9. Subject Access Requests\nSubject Access Requests are dealt with in line with the guidance given by the Information Commissioner’s Office (ICO):\n• We will request verification of the identity of any individual making a request, and ask for further clarification and details if needed.\n• We will respond within 28 calendar days once we have confirmed it is a legitimate request.\n• Data subjects have the right to the following:\no To be told whether any personal data is being processed\no To be given a description of the personal data, the reasons it is being processed and whether it will be given to other organisations or people.\no To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need for politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point, you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances, you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nMost subject access requests will be made free of charge. However, if your request is deemed manifestly unfounded or excessive, we reserve the right to charge a reasonable fee associated with the administration costs of such requests.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Colin McFarlane via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nWe retain the right to update this policy at any time. If changes significantly impact your rights, we will contact you in advance.",
  "https_www_colinmcfarlane_co_uk/https_www_colinmcfarlane_co_uk_sign-up/content_7.html": "Honest, Hardworking & Caring. Working to maintain and enhance the quality of life so many of us enjoy in Weybridge and improve life for those less fortunate.\nJoin our mailing list\nPromoted by Steve Bax on behalf of Colin McFarlane and Weybridge & St Georges Hill Conservatives, Curzon House, Church Road, Windlesham, Surrey GU20 6BH\nSorry, this website uses features that your browser doesn’t support. Upgrade to a newer version of Firefox, Chrome, Safari, or Edge and you’ll be all set."
}