{
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_news_category_Speeches/content_5.html": "WW1 Debate: We HAVE Remembered Them, Oxford Union 3rd June 2019 Andrew speaking in the WW1 Debate: We HAVE Remembered Them, Oxford Union https://www.youtube.com/watch?v=t0zFTiMqbjY Speeches",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_parliament/content_6.html": "Tweet You can see Andrew's latest speeches and appearances in Parliament below (provided by theyworkforyou):",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_news/content_4.html": "ANDREW GIVES CAUTIOUS WELCOME TO DORSET COAST TO M4 STUDY 12th March 2025 Andrew has cautiously welcomed the long-delayed report on the Transport Department's north-south strategic road study in which an A36/A350 solution is preferred... Local News\nAndrew on track 16th January 2025 Yesterday morning, Andrew attended a meeting in the House of Commons with South West Railway (SWR) and Great Western Railway (GWR) to discuss services to his... Westminster News\nClueless response to Andrew’s incinerator question in Commons 21st November 2024 Andrew asked Deputy PM Angela Rayner, who was standing in at Prime Minister’s Questions for Sir Keir Starmer, a question on waste incinerators yesterday... Westminster News\nAndrew stands up for farmers in Commons 12th November 2024 Andrew has expressed his concern in the House of Commons at the Labour government’s death tax on farms and land-based businesses. Andrew contended during the... Westminster News\nAndrew plants Remembrance tribute 30th October 2024 Andrew plants Remembrance tribute in South West Wiltshire slot at House of Commons garden of remembrance yesterday. Westminster News\nAndrew concerned in Commons at Chagos giveaway 22nd October 2024 Andrew has expressed his concern in the House of Commons at the Labour government’s giveaway of the British Indian Ocean Territory. Andrew contended to the... Westminster News\nAndrew commends TechTrowbridge to new Culture Secretary and invites her to county town 15th October 2024 Andrew has highlighted the TechTrowbridge initiative to improve digital skills and attract investment from tech firms to the local area to Culture Secretary... Local News\nAndrew visits site of new full fibre broadband for countryside 15th October 2024 Andrew has visited a site in the Wylye Valley in his constituency where new full fibre broadband is being installed by a local company. Wessex Internet, which... Local News\nAndrew busy in Palace of Varieties 9th October 2024 Andrew has hit the new parliamentary term running. He has been on his feet challenging ministers on a range of issues in debates ranging from the withdrawal of... Westminster News",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_news_andrew-delivers-speech-nhs-winter-crisis/content_10.html": "This afternoon, Andrew delivered a speech in the House of Commons on the issue of the NHS winter crisis.\nAndrew said:\n'It is a great pleasure to follow the hon. Member for Stockton South (Dr Williams), who qualified in 1996. I have about 10 years on him, and since 1984 I cannot recall a winter when there was not talk of pressure. We have to understand that this is not a new phenomenon. I particularly recall the bad winter of 2009, and the very positive way in which the then Opposition approached it and helped the then Government, in the interests of not politicising and not weaponising this issue. It is pity we have not seen the same thing repeated.\n'We need to give due credit to managers in the NHS. They come in for a lot of flak all the time, but we have seen a managed process this year and it has taken a great deal of input to make sure we do the best we can to disadvantage patients the least; I pay tribute to that much-maligned group. The only way in which I can see we can make this better is by running a lower bed occupancy rate, which is okay but it has opportunity costs attendant upon it. The reality of doing such a thing, which would avoid the sort of cancellations we have seen this winter, as in any winter, is severe, and I do not think many right hon. or hon. Members would wish to see those things.\n'That brings me on to the Commonwealth Fund, which was rightly cited by the Prime Minister earlier in response to my question in Prime Minister’s questions. She was right to say that on access, equity, the care process and administrative efficiency—four of the five points the Commonwealth Fund looks at—the NHS does very well. The problem is with the last one, which is clinical outcomes, where we run 10th out of 11, with the 11th being the United States of America, which nobody here wishes to emulate. We do not do well on clinical outcomes—we do not do well on cancer, on stroke or on heart attack—and we need to do something about it. It is no good citing OECD averages. We need to be comparing ourselves with Denmark, Germany, France and the Netherlands, not with the basket of countries included in the OECD.\n'Where does all that lead us? It leads us to a debate about resources. Having talked about management, which is vital, we need to address long-term resources. I entirely support those who wish planning to be done on a 10-year rather than five-year basis. That is vital, and we must also ensure that we have the necessary funding for the improvements we need to achieve to get outcomes up to the level enjoyed by our peer-group nations in western Europe, not the basket of nations with which we are often erroneously compared. How do we do that? We have to take the public with us and work across party boundaries. None of the decisions that will ultimately be made about the future of our national health service in this, its 70th anniversary year, are necessarily going to be easy. It is important that we at least try to get some level of cross-party consensus. We can do that by establishing a body that is above politics. The route to which I am drawn is the establishment of a royal commission, with all its problems.\n'The Merrison commission 40 years ago was the last big royal commission that considered matters to do with the health service. It came in for a lot of criticism, but most of its recommendations, made 40 years ago, were ultimately rolled out into Government policy. With the right terms of reference, such a body would be effective. That seems to me to be the right and proper way to deal with the future, particularly the sustainable funding future of our most treasured of national institutions. I very much hope that my Front-Bench colleagues will listen to those of us from all parties—particularly the recommendation from the Centre for Policy Studies this week—who think we should set up a royal commission in this 70th anniversary year to consider the future of our national health service.'",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_news_category_Speeches-in-Parliament/content_7.html": "Andrew's Contribution to committee stage of Internal Market Bill 21st September 2020 Dr Andrew Murrison (South West Wiltshire) (Con) Well, Sir Graham, it is difficult to follow that. I remember your enjoinder, Sir, that we should stick to five... Speeches in Parliament\nAndrew asks the Government for action on Stormont 20th February 2018 This evening Andrew asked the Northern Ireland Secretary for the Government's forward plan for the budget in Stormont in the midst of ongoing political... Speeches in Parliament\nAndrew asks Prime Minister to protect Royal Marines funding 7th February 2018 During today's Prime Minister's Questions, Andrew asked the Prime Minister to protect funding for the Royal Marines following speculation about proposed... Speeches in Parliament\nAndrew asks Government for assurances that Northern Ireland will feed into Brexit 7th February 2018 This morning Andrew asked the Secretary of State for Northern Ireland to ensure that, regardless of whether power sharing is resumed in Stormont, Northern... Speeches in Parliament\nAndrew delivers on speech on NHS 'winter crisis' 10th January 2018 This afternoon, Andrew delivered a speech in the House of Commons on the issue of the NHS winter crisis. Andrew said: 'It is a great pleasure to follow the hon... Speeches in Parliament\nAndrew delivers speech on Passchendaele 13th July 2017 As the Prime Minister's Special Representative for the Centenary of the Great War, it was a privilege to speak in today's debate on the Third Battle of Ypres, a... Speeches in Parliament\nAndrew calls for efficiency in NHS drugs 16th March 2017 Yesterday, Andrew spoke in the debate on the Health Service Medical Supplies (Costs) Bill, urging caution over a Lords amendment to make the Government control... Speeches in Parliament\nAndrew questions NHS litigation costs 2nd February 2017 In a debate on the Public Administration and Constitutional Affairs Committee's new report 'Will the NHS never learn?' held by the Committee's Chair, Bernard... Speeches in Parliament\nAndrew raises concerns over Armed Forces retention figures 2nd February 2017 This evening, Andrew spoke in the backbench debate on the Armed Forces Covenant 2016 and raised concerns over recent figures which show that the strength of... Speeches in Parliament",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_advice-surgeries/content_9.html": "Andrew holds regular advice surgeries in South West Wiltshire, including sessions at his constituency office and within the constituency. These are for residents to raise issues and express concerns.\nTo book an appointment please call Andrew's office on 01225 358584.\nAlternatively, you can write to Andrew at: House of Commons, London, SW1A 0AA or email: [email protected]",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_warminsterba12-survey/content_2.html": "Tweet Tell me what your priorities are for the area and we can make things happen together. Warminster/BA12 survey Current Warminster issues Your details Leave this field blank 1. How often do you use Warminster town centre? More than once a week Once a week A few times a month Not every month 2. What should replace 3 High St (the derelict building next to St Lawrence Chapel)? 3. To spend more time in Warminster town centre, what changes would you like to see? More restaurants, cafes, bars and pubs Funding to upgrade the frontage of shops and businesses Repurposing of disused buildings for more business or residential space Funding for facilities such as benches, flower beds, bins 3.1 Other suggestion (please state) 4. Do you have any other ideas you would like to share to help improve life locally? 5. What are your views about house building locally? 6. What is your experience of healthcare locally? 7. What is your experience of traffic in your neighbourhood? 8. Please share with me any other issues you have. 9. Please tick the box if you would you like to receive my email newsletter",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_news_andrew-plants-remembrance-tribute/content_8.html": "Andrew plants Remembrance tribute in South West Wiltshire slot at House of Commons garden of remembrance yesterday.\nAndrew plants Remembrance tribute in South West Wiltshire slot at House of Commons garden of remembrance yesterday.\n| Attachment | Size |\n|---|---|\n| The Rt Hon Dr Andrew Murrison MP (1.96 MB) | 1.96 MB |",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk_news_andrews-blog/content_3.html": "Andrew has cautiously welcomed the long-delayed report on the Transport Department's north-south strategic road study in which an A36/A350 solution is preferred (below). He said;\"This takes the long overdue western route bypass for Westbury and Yarnbrook a step further but I await details on mi",
  "https_www_andrewmurrison_co_uk_/https_www_andrewmurrison_co_uk/content_1.html": "Welcome to my website. I'm Andrew Murrison, the MP for South West Wiltshire. It's an honour to have been the MP for the area since 2001. Here you can find my news, campaigns and more about me, including how to contact my office. I'm here to help, so please don't hesitate to get in touch."
}