{
  "https_markweaden_com_/https_markweaden_com_the-yarns/content_11.html": "The Start\nThe Election Flyer\nThe 3 Improvements & More.\nDear Generations\nDear Baby Boomers\nDear Younger Generations\nThe Me\nThe Journey\nThe Guide\nThe Yarns\nContact\nShow More\nThe Start\nThe Election Flyer\nThe 3 Improvements & More.\nDear Generations\nDear Baby Boomers\nDear Younger Generations\nThe Me\nThe Journey\nThe Guide\nThe Yarns\nContact\nHome\nA trickle of delight.\nA trickle of delight.\nYarns\nSearch\nSearch\nRecent Posts\nRecent Comments\nNo comments to show.\nArchives\nNo archives to show.\nCategories\nNo categories\nComing soon\nTo Top",
  "https_markweaden_com_/https_markweaden_com_the-how-to-guide-and-what-it-all-means/content_7.html": "The Start\nThe Election Flyer\nThe 3 Improvements & More.\nDear Generations\nDear Baby Boomers\nDear Younger Generations\nThe Me\nThe Journey\nThe Guide\nThe Yarns\nContact\nShow More\nThe Start\nThe Election Flyer\nThe 3 Improvements & More.\nDear Generations\nDear Baby Boomers\nDear Younger Generations\nThe Me\nThe Journey\nThe Guide\nThe Yarns\nContact\nHome\nThe How to guide & What it all means.\nThe How to guide & What it all means.\nComing Soon…….when I know myself!!\nUnraveling the confusion - let's go small and up.\nThe Local Parish\nThe Ward (District)\nTo Top",
  "https_markweaden_com_/https_markweaden_com_the-3-more/content_10.html": "So simple, it’s a wonder that they aren’t already done?\nYouth on the council:\nThe positive enthusiasm and momentum of youth would ripple through all the community projects and issues.\nThe Parish Council needs a healthy balance of youth and wisdom. 20-40yrs old people are missing and are greatly needed to enhance thought processes and community decisions.\nWe must all be part of it, this is why it’s so important.\nCommunity social media:\nHow are you going to know to help if no-one is asking you for help?\nLet’s modernise that so you know whats going on. Simple? Yes! I will get Holmer & Shelwick digitally connected, involved and a proud community following.\nConnecting the community will lead to the other improvements and will give us a stronger Herefordshire voice.\nBetter Bus Service:\nThis ticks the boxes of traffic calming, cheaper mobility and of course, more eco-friendly.\nI will work with local service providers and businesses to try and improve the bus service into the city centre, and passing all the main local schools, with a better timetable.\nAnd what about making the village bus stops more attractive?\nWe can do that as a community.\nThe bigger improvements and issues\nPolitical Potholes, Foreseen Pollution and ByPass Pontificating.\nLocal pollution first:\nThere is nothing surprising about pollution being bad. I don’t think anyone disagrees.\nWe must all be part of the process and I have concerns that some methods, used by councils around the UK, are not enagaing with local communities well enough.\nWe must start at our own doorstep and be enviromentally healthier. But we must not lose the crowd when trying to change polluting habits.\nThere is economic cost to changing social habits and this can cause uncomfortable side effects. People can feel attacked or helpless, when all they are doing is trying to live.\nMany ideas implemented are quick fixes and do not always have enough foresight.\nI will ensure you are informed and part of this.\nLocal Infrastructure:\nI will get movement on this subject because it is the start point of most of our community issues.\nMore people = More infrastructure.\nSimple maths? So why do we have……\nLots of new families, no new school?\nLots more travelling, no increased bus service?\nLots of new people, local pub is quiet?\nThe NDP:\nThe Neighbourhood Development Plan is in place until 2031. Running since 2019, but I’m not seeing community infrastructure being implemented around the growth of housing.\nNo doubt there is detail, wisdom and rhetoric that, once elected, I will be shown.\nHowever, this needs a boost of enthusiasm to drive local infrastuture and it’s linked to traffic calming.\nThe Bypass debate:\nFreedom of movement is important and safe travel is paramount.\nLifestyle choices are changing and much will change in the next 20 years, and lifestyle of young people should shape decisions.\nYounger people are in-tune about how their personal choices effect nature and their environment. Ultimately, They will be the the ones paying for it.\nThe Bypass is used as a polictical ‘pop up’ and past taglines come out. The truth is this is linked to social pollution and we really need to look at the pro’s and con’s and if it’s nessasary for our great grand childern.\nAll of this is linked to Local Infrastucture.\nI prefer not to have another road and look at the capacity of what we have already.\nThe point is, youth need a voice in this.\nWhy isn't a 20mph community safe travel a 'thing' already?\nCommunity Safe Travel:\nWho in Holmer & Shelwick doesn’t want safer roads?\nCycle safe, walk safe, horse safe, dog safe. Family Friendly 20mph zones in villages, housing areas and country lanes.\nWhy isn’t this a ‘thing’ already?\nThe answer to that lays with the past generation of councillors. Who else can it be?\nYou can have trust that I will drive this to the those that hold the answers.\nPot holes:\nI have issue with the erosion of our roads and how this subject is being used.\nDon’t let them cast political wizardry on you.\nThey have allowed the roads to get this way so they can look like hero’s when they get your vote to fix them.\nIronically, it makes people drive slower, maybe thats their plan for Traffic Calming!\nI won’t let people bamboozle us with inaction.\nRiver pollution:\nA lack of care and foresight.\nThere is nothing surprising about this situation and they should not be allowed to use ‘Hindsight’ as an excuse.\nThis is one of the most important issues that Herefordshire needs to deal with.\nThe river is an economy on its own, and letting it die is unforgiveable.",
  "https_markweaden_com_/https_markweaden_com_contact/content_4.html": "Please fill out the form with the information you need help with.\nI will get back to you as soon as I can.\nThank you for getting in touch.\nYour name\nYour email\nSubject\nYour message (optional)",
  "https_markweaden_com_/https_markweaden_com/content_1.html": "I am starting this journey because I am unhappy about the manner in which our politicians and people in authority have acted, and feel they have been found wanting.\nBy no means do I think these roles are easy, but they have crossed lines of integrity and I don't see them standing strong for us, and I don't think that's good enough.\nOur children deserve better and ultimately they will end up clearing up our mess if we do not take responsibility.\nThere are times when you need to do something, so I'm going to start with something local.......",
  "https_markweaden_com_/https_markweaden_com_dear-babyboomers/content_3.html": "Dear Baby Boomers,\nPlease think about your grandchildren when you vote…….\nPlease respect the younger generation that are forced to repair the social damage of the last 20yrs of tom foolery.\nWhy do you believe the same old parties, or people, will honour any pledges?\nWhy vote for them to repeat their pattern of poor political management?\nTheir record and reputation are clear to see and prove they don’t care enough. They pledge to fix the things they have let happen, so they can look like hero’s when they say they will fix them. It’s fair to say they have either caused things to be broken or allowed them to become broken. And, if they say ‘we didn’t know’……then what do they know? What foresight do these people use when making decisions, that effect you and leave someone else to fix?\nThe outcome of all this is we are all left feeling we have been taken shamelessly for fools. To vote for them again and again, with an expectation that this will change would be the definition of crazy. I know you aren’t, so don’t let them treat you so disrespectfully.\nYou can stop their crazy political cycle and vote for me instead.\nPlease start new on the 4th May.",
  "https_markweaden_com_/https_markweaden_com_journey/content_6.html": "This will document my experiences as I meet people and learn politics.\nFrom the raw beginnings and the ground up, lets see where this leads.\nI hope you join me and see me as a person you might vote for.\nWho’s not?\nThis is why I feel the need to do something.\nIf I don’t then I only have myself to blame for not trying.\nIt maybe that, the way they are doing it is the only way?\nThere’s only one way to find out and that’s to try myself!\nSo this is my ‘something about it’ and that is what I am going to do.\nI am going to try and become a Councillor and MP……………. How hard can it be?\nEmailed and asked for help and advice. Some helpful, some not.\nThe start point is still the same, putting my name in the hat.\nIt feels that the only way to find out the facts is by stepping in with two feet. So I have, and will start with the local elections May 4th 2023.\nAnd those feet got stuck in to the local spectator sport of pond cleaning.\nThe papework for this is an interesting process. I went in with nicely presented and written forms, and ended up handing over a mistake written mess. Filling these in is a test in it’s self, but they are in and my names down!\nYou would think that information would be easy to find out? Simply as popping on to the local parish council website? or ask some simple questions and getting some well-developed handbook?……NOPE!!……nothing that is easy to find.\nAnd I think this is the first issue I have with people that hold authority, it’s like it’s held has a secret and only a privilege to have this knowledge, like some school playground clique and used to make you look stupid for not understanding.\nThis information should be simple for any person, at any age to find out and get educated on.\nI will try my best to share the knowledge and links I find, and explain it in normal tongue!\nMy search on the internet doesn’t find seem to be much out the other local candidates.\nThis is definitly going to be a good thing to have so people to know who I am.\n……….and who is that??……..great question Weaden!…….haha……..who are you?\nSelf promoting is actually interestingly uncomfortable for me.\nFilled with ‘what are people going to think’ and at the same time ‘this is me, this is who I am’.\nThis isn’t the worry of ‘what people think’, it is the weirdness of editing myself.\nI have had a few local councillor candidate flyers come through my letter box in the last week. I see how and what they are messaging.\nInterestingly they don’t really say anything about what they will do fully, lots of open statements, suppose that’s all they can do?\nThey have all been ‘party’ candidates so far. I’m doing this on my own, so my messaging needs to be clear and strong to compete.\nIt took some practice to get a smooth letterbox action.\nI can now spot how a letter box will open from 30 feet away and know how to put a flyer in so it hangs just right on the other side, or flips onto the side I want showing.\nPosting these is a CONTACT SPORT. Another 600+ houses and I have the wear & tear to show it.\nNice to have people talk to me about their views on Herefordshire and the other candidates. VERY interesting.\nIt is underestimated how hard walking around the roads, cul-de-sacs and winding estates is.\nYou need fancy footwork. Moving past security gnomes, being careful not to step on the grass and having to U-turn at every door. Bending down to those low letter boxes is actually a challenge after 4 hours of plodding the pavement.\nIt’s been hot and sunny and have a burnt head. Getting heat stroke and dehydrated would’ve of been slightly embarrassing….ha….\nthere is no infrastructure, no shops anywhere within these areas or close by to get a drink!\nStrangely, I’m observing, lots of empty houses in the ward. I’m not talking about the ‘New Builds’ which haven’t sold yet, these empty houses are in the older established areas of the Holmer Ward.\nThis is another area that I will investigate because it goes against the narrative of needing more houses built. It feels that the solution to the issue of no available homes has possibly snowballed beyond the reality. Maybe it’s just the economic and social impact of the last 3 years, stuck in systemic stagnation and policy purgatory, until momentum picks up again.\nHarassing people isn’t my thing. But wearing a slogan T-Shirt and standing at the entrance is something I am happy to try.\nFellow local Candidate John Phipps joins me, from what I know of him so far, he’s a connected fella and made his name in the builder community. He saw me earlier and it’s good that he’s copying me, more the merrier. John’s also running as TRUE independent. I’m not sure of the difference yet.\nOverheard gossip says that some independents are running to spoil and split the independent votes for the benefit of a bigger party? That’s quite a tactic and not nice for people to say if it’s untrue. I have no idea about this but starts me on an education of potential political tactics. I’ll cover more about this later.\nPoor John didn’t know where to look. They didn’t like my leaflet and did not want to talk, and got even angrier when I asked if they had gone onto my website. The reaction was, “I’m not bloody looking at websites” and stormed off. Neither had looked at my website. I don’t expect that they are the last who feel this way. Respect to them for at least telling me how they felt. Oh well, I really hope they will look at this website, see my earnest motives and see that…….\n8.30 the doors to the counting hall open. You need to line up and get your entrance band using your ticket from the council. I’m on my own today but others have teams with them to support and do some unofficial statistics counting at the verification stage.\nVerification is where the boxes are opened and the papers are intially filtered to check they are correctly marked.\nNo pictures are allowed to be taken, so this next bit will be hard to explain.\nAt this stage swarms of party counters stand and monitor the bits of paper being checked and make an unofficial tally of what they can see has a cross against a name. The people checking the papers put them into piles of 20. This is just to get the total number of votes.\nThis hive of busy party tallyers help work out the footprints of success/failure. It helps them work out what areas need more work or have been good for them. This is because the official overall totals do not breakdown votes to this level of detail. Mainly, it also gives a fair assesssment to who is going to win.\nThe verification statement is then made official (if this picture is not allowed then please tell me!!!… I believe it is ok because this was an official notice and the count is now over so nothing can be affected + loads of other were doing this, one getting told off all getting told off). I will do an artical on this and the voting numbers. It will be interesting to compare the previous election and investigate why only 33% of people vote.\nLooking over there shoulders and at there tally boards…………\nI am starting to see some concerned candidates. Some have a lot riding on this. The lead up to this day is very important for them, a lot of personal effort has been put in, regardless of their political allegiance, they are good people, that care and are trying to give people options, that’s not easy and have my respect.\nThe initail flourish of excitement has melted, the count begins and now the wait for results.\nEach district is called and the candidates go to see Paul Walker (Retuning Officer) to get told the result before it is announced.\nTea, Coffee and team photos. Main Party MP’s and organisers seem to be the centre of attention.\nLib Dems go out en mass for a team photo.\nMP’s Jesse Norman and Bill Wiggins are here to support their candidates. Fair play, they speak to everyone and at the end of the day it’s supporting the democratic process, not just their own party.\nAlso a well deserved chuck up to The Green Party. Happiest party by a mile. Keep smiling!\nExciting, I’m in a recount!! Not for me I’m afraid.\nLib Dems have called for it. The race between them and the Conservatives is very close, and there’s murmurring about result getting out on social media earlier than the official announcement.\nPaul Walker smiles politely and accepts the order for a bundle recount. Why not a full recount?\nThis feels like another political tactic. Either way, being barged out the way by the sweaty fella, from the Lib Dem’s, was unpleasant.\nMP Jesse Norman has a cracking grasp of this. I have met him before, I asked him for advice about how to become an MP and he was really forthcoming with advice and personally phoned me after my enquiry email. This name skill was on full display when he saw me and, without blinking, said “Mark, how are you? what are you doing here”.\nHats off, this is impressive for someone who has only meet me a few times and who meets 100’s of new people every month. Either that or my fat head has a certain memory marker.\nThe first amusing bit is that it was Jesse himself that advised me to get involved with the local Parish and County Council. The surprise that I was running was great, the new awareness that I was running against his own party’s candidate was priceless. At the time I was stood with 75yr old fellow candidate, Frank Cornthwaite, the well known local biscuit maker. I felt that Frank was little a surprised of the situation and that I, the wild card entry, knew Jesse in such a mutual friendly way. I say ‘mutual’ but this is another social skill Jesse has, he made it feel that way. Jesse seemed to ignore that Frank was there, or remember Frank’s name, and he’s the Conservative candidate….ha…ha…..\nAll from 3 days of doorstepping and standing outside the polling station. 7% of votes*, I have used the Polling Station total because I was unable to canvass before the postal vote, and affect it. I think that’s a fair use of math, albeit self-promoting a higher number……no one else is promoting me so I think can be a little indulgent….ha",
  "https_markweaden_com_/https_markweaden_com_me/content_8.html": "Hello again,\nThank you for clicking futher into this website.\nLike I say, I'm passionate, dedicated and unimpressed!\nI am doing this because I am unhappy about the manner in which our politicians and people in authority have acted, and feel they have been found wanting.\nThat's a big statement!!\nI don't think anything is too big to take on. We just need to try and that positive effect will grow, and others will join in.\nOur children deserve better so I'm going to start doing my bit and make my local better.\nAnd where better to start then the Local Elections on May 4th 2023.....?\nI live in Holmer & Shelwick with my fantastic partner and our annoying 18 year olds!……oh yes……….and 2 dogs!\nWe have lived in the village for 7 years and try our best to lead a balanced lifestyle.\nI enjoy an active life, our countryside, our waterways and a glass of wine!\nZoe and I are founders of The Real Birth Company and Studio on Goal St.\nWe are very invested in people, community and a bright healthy future for Herefordshire.\nI run a Real Birth Fathers and Men’s Birthing Conversation which are there to support new and expecting fathers through a special time of life.\nI have been fortunate to be involved with other Men’s Perinatal Mental Health speakers and produce live vesrions of Men’s Birthing Conversation at Carfest. We look forward to continuing this at Carfest 2023.\nHerefordshire has been a stable family home and we enjoy living here.\nWe look forward to seeing you. Come and say hello if you see us when we are at walking the dogs or at the local pub.",
  "https_markweaden_com_/https_markweaden_com_the-election-flyer/content_5.html": "Dear Generations,\nWe must all be part of this and join together in our local community.\nWe do have a say and we can influence big issues. You have the power, it’s yours to give.\nAll ages and generations need to be involved in decisions that affect our future. It is our responsibility, not anyone else’s. If we don’t then it will be our own fault when others, far away, control our local decisions.\nWe can all make a difference. Even the little ripples reach the edge of the pond.\nThe world is evermore connected. A small community can have a global effect.\nThe manner in which we live together is our message to the rest of the UK and the world.",
  "https_markweaden_com_/https_markweaden_com_dear-younger-generations/content_2.html": "Dear Younger Generation,\nPlease use the power you possess to guide society to where you want it.\nMy message is simple. I will bring the younger generation into the council.\nYou should not rely on the older generation to shape your future, they do not to see the world like you do.\nThey have a habit of leaving it to you to repair their decisions.\nWe cannot rely on the traditional people and parties. We must all be part of it.\nPlease do not wait 10 years to have your say. Start now, start on the 4th May.",
  "https_markweaden_com_/https_markweaden_com_the-election-flyer-2/content_9.html": "The Start\nThe Election Flyer\nThe 3 Improvements & More.\nDear Generations\nDear Baby Boomers\nDear Younger Generations\nThe Me\nThe Journey\nThe Guide\nThe Yarns\nContact\nShow More\nThe Start\nThe Election Flyer\nThe 3 Improvements & More.\nDear Generations\nDear Baby Boomers\nDear Younger Generations\nThe Me\nThe Journey\nThe Guide\nThe Yarns\nContact\nHome\nThe Election Flyer\nThe Election Flyer\nHolmer & Shelwick - 4th May 2023 - Local Elections\nThe promoter is….\nsurprise surprise\n….ME….Mark Weaden.\nThe printer is SOLOPRESS, 9 Stock Rd, Southend-on-Sea SS2 5QF\nTo Top"
}