{
  "https_www_staffordlabour_org_uk_local-elections_/https_www_staffordlabour_org_uk_about-us_our-clp-team/content_6.html": "Executive Officers Julie Read - CLP Chair & Dep Reg Treasurer Nathan Evans - Co-Vice Chair Nicholas Shaw - Co-Vice Chair Mike Winkle - Treasurer Jeff Love & Deborah Collis - Secretaries Anne Hobbs & Jane Capron - Women's Officers Julian Thorley - Trade Union Officer Dee McNaughton - Trade Union Officer Other Officers BAME –Youth –Disability –Policy –Communications & Social media –Information Technology –Fundraising – Gillian Pardesi & Kulwant Kang Nathan Evans Ian Noble Diana Smith Nathan Evans & Nick Shaw Ant Reid & Nick Shaw David Townsend To contact any of the officers above, please email info@staffordlabour.org.uk",
  "https_www_staffordlabour_org_uk_local-elections_/https_www_staffordlabour_org_uk_contact/content_4.html": "Home\nYour Councillors\nCLP Team\nContact\nJoin\nLocal Elections\nFacebook\nTwitter\nInstagram",
  "https_www_staffordlabour_org_uk_local-elections_/https_www_staffordlabour_org_uk_about-us_your-councillors/content_3.html": "Aidan Godfrey\nCommon Ward & Leader of the SBC Labour group.\nAidan has lived in Stafford for 35 years and has been a member of the Labour Party for over 40 years. He has been an elected member of Stafford Borough Council since 1995 and is proud to represent the Common Ward. Aidan served as both Mayor and Deputy Mayor of the Borough of Stafford, and over the years has been both a governor and Chair of governors at two local schools. He is now the Leader of the Labour Group.\nIn his spare time Aidan enjoys dog walking, watching Manchester City, and spending time with his family.\nAngela Loughran\nBorough Councillor for the Manor Ward\nSince 1971 Angela has lived in the Rising Brook Area where she taught in the local high school for twenty years. She was elected to Stafford Borough Council in 1997 to represent Manor Ward and is actively involved in local community activities.\nAlong with fellow-councillor Anne Hobbs, Angela holds a Surgery in the Brook Cafe at Rising Brook Baptist Centre on the first Tuesday of each month (except August) from 10.15am.\nShe also represents Stafford Borough Council on Stafford United Charities, Roger Hinton’s Charity and on the Sow and Penk Drainage Board.\nAngela may be contacted either by telephone on 01785 254109, or by email at aloughran@staffordbc.gov.uk.\nAnne Hobbs\nBorough Councillor for the Manor Ward\nAnne came to Stafford in 1981 to train as a Registered General Nurse at the old infirmary and is currently Borough Councillor for Manor Ward. She is also a qualified Specialist Community Health Nurse and practiced as a Health Visitor in Staffordshire for 22 years. She is also a Women’s Officer for Stafford Labour Party.\nAnne became interested in politics when she completed a degree in Health Studies at Staffordshire University, where she learnt that the poorer you are the more likely you are to suffer ill health and have a shorter life expectancy. This inequality spurred her on to join the Labour Party and campaign for a more equal and fair society. Since the Conservatives have been in Government, she has witnessed the destruction of the Welfare State and increases in illnesses and life expectancy once again. She will continue to fight and campaign for Labour who will work hard to reverse the damage they have done.\nDee McNaughton\nBorough Councillor for Highfields and Western Downs\nDee trained as a nurse in the RAF and represents the People of Highfields & Western Downs on Stafford Borough Council. She is also a Unite member and Trade Union Officer representing and championing the cause of the nursing family.\nShe became socially aware from a young age after watching the Ken Loach film ‘Cathy Come Home’ and became increasingly aware of how generations of her own family, and countless others, have had their ambitions limited or stifled by a sense of ‘knowing their place’ in the world. Working in the North East just after the miner’s strike solidifies these views and drives her on even today.\nDee has recently got married having been a single mum for over 15yrs. She is active in both the Co-operative and Labour parties, and when she has time loves camping and walking her German Sheppard rescue, Poppy.\nGililan Pardesi\nBorough Councillor for Littleworth Ward and County Councillor for Stafford Central\nGillian is the Labour and Co-operative Party borough councillor for the Littleworth Ward – together with Tony Nixon – and also serves as County Councillor for Stafford Central.\nGillian has lived in Littleworth for 18 years and brought up 3 children there. She is a primary school teacher by profession but currently works to organise and provide care in the community and has always worked for the public sector or voluntary/not for profit organisations. She has been an activist all her adult life campaigning for equality and social justice and having lived in New York for 11 years she is also a proud member of the American Civil Liberties Union (ACLU).\nGillian is a Customer Board member of the Stafford and Rural Homes housing association (now the Housing Plus Group) and a member of the union Unite.\nAnt Reid\nBorough Councillor for Coton Ward\nAnt has lived and worked in the borough for 17 years, and took over from Jack Kemp as another local Labour councillor in Coton Ward. Many thanks go to Jack for his many years of service to Stafford.\nAnt has a keen interest in getting things done and is always open to listening to your needs, ideas, and opinions for our diverse town. As a Borough Councillor he works to help the Labour-led council improve housing, public transport plus keeping our streets and parks clean; doing all of this in the most green and efficient ways possible.\nRalph Cooke\nBorough Councillor for Penkside Ward\nRalph has lived in Stafford since 1972 and has represented the people of Penkside Ward since 1979. He was Mayor in 2002-2003 and is the Deputy Leader of the Labour Group.\nA retired Headteacher, he has worked for the general improvement of Penkside Ward, including leisure facilities such as Meadow Road Park. He has also supported local activities and events in the ward, such as Residents’ Associations and Penkside Community Champions, all with the aim of improving the quality of life for residents.\nDuring Ralph’s period as a Councillor he has served on a wide range of committees and is currently the Chair of the Resources Scrutiny Committee. He also represents the Borough on Stafford & District Arts Council and Sow & Penk Internal Drainage Board.\nVoluntary work includes The Rowley Trust, Friends of St Mary’s and membership of Stafford Rotary Club.\nTony Nixon\nBorough Councillor for Littleworth Ward\nTony is a former councillor for the Tillington Ward from 1999 to 2003, and was a Governor at Sir Graham Balfour High School for 10 years. He served as a member of the Independent Custody Visitors Panel appointed by the Staffordshire Police Authority for 6 years and is a member of the Co-operative Party. Tony is the current President of the S60 Branch of the GMB Trade Union, having been a Shop Steward and Safety Rep for many years at the former Universal Grinding Wheel Co Ltd. He gained the TUC Certificate in Trade Union Studies having completed a years study of Industrial Relations, Economic Issues and Labour History at Stoke on Trent College in 1991.\nJulie Read\nBorough Councillor for Weeping Cross & Wildwood Ward\nJulie lives in Baswich and is also Chair of Stafford Labour Party. She is married with two adult children, and has worked in residential care and education. She is proud to represent Weeping Cross and Wildwood.\nJulian Thorley\nBorough Councillor for Forebridge\nFrank James\nBorough Councillor for Forebridge\nFrank has lived in the Holmcroft ward for over 50 years, and is a ormer governor of Graham Balfour School of which his 4 children attended. He was a previous Stafford Borough Councillor for over 20 years for Seighford and Holmcroft wards.\nHe has always been active in the world of sport; football, motorcycling, cricket and bowls, presently National Vice President of British Crown Green Bowls. He’s Chairman of Stafford Bowls Club, Evans Park and the Post Office Club.\nFrank is always willing to assist with people’s problems having been a Union rep for the postal workers, and is fully aware of the problems in the area; including the roads and the demise of Stafford town centre and the exodus of the industrial jobs in the town. He is also keen to tackle the housing problems facing our youngsters today through lack of affordable housing.\nAndy McNaughton\nBorough Councillor for Highfields and Western Downs",
  "https_www_staffordlabour_org_uk_local-elections_/https_www_staffordlabour_org_uk/content_2.html": "Welcome to Stafford Labour Party\nFor too long, local residents haven’t felt represented or listened to by our elected officials. With the new Labour-led Stafford Borough Council already making positive changes to our town centre, our Parliamentary Candidate – Leigh Ingham – is ready to be the visible, hard-working Constituency MP we need.\nListening is at the heart of Labour’s approach to campaigning. Across Staffordshire, Labour use positive methods to bring real change to local communities.\nThe areas where our communities have told us they need us include:-\n- Safeguarding our wonderful green spaces\n- Repairing and maintaining infrastructure\n- A committed effort to allow our high streets to thrive\n- A safe environment and sustainable future for all of us in the constituency\nWhy not join our movement?\nStafford Deserves Better.",
  "https_www_staffordlabour_org_uk_local-elections_/https_www_staffordlabour_org_uk_about-us/content_5.html": "Stafford Labour Constituency\nHello from all of us at Stafford Labour! We are an open and welcoming group of residents and elected officials all working to improve the lives of those in Stafford, Eccleshall, and and the villages. After a successful set of Borough Council elections in 2023, Aidan Godfrey now leads a cabinet of passionate Councillors who are getting on with improving our town. Head to our 'Your Councillors' and 'CLP Team' pages to find out more about us.",
  "https_www_staffordlabour_org_uk_local-elections_/https_www_staffordlabour_org_uk_local-elections/content_1.html": "Stafford Borough Council elections 2023\nLabour makes gains and now leads the Council\nThank you to everyone who voted in the Stafford Borough Council elections, and those who have put their trust in us. Thanks too to all the hard-working SBC employees and volunteers who delivered such a well-organised set of elections. Labour gained three seats, alongside the re-election of eight current Councillors and two Labour seats filled by new Councillors following retirements. We extend our heartfelt thanks to Jack Kemp, who served for 50 years. There were many positive conversations on the doorstep, and we increased our vote share in many Wards.\nOur new Councillors are excited to start work, alongside the dedicated representatives who have been re-elected. It is a clear sign that residents would like a change, and we will do our very best to deliver for you.\nThe new leader of Stafford Borough Council.\nFollowing the Annual Council meeting on Saturday (13 May), Councillor Aidan Godfrey was voted in as the Leader of Stafford Borough Council.\nHe represents the Common Ward and is the Labour Group leader. The Cabinet has now been selected, and is as follows:\nLeader – Aidan Godfrey (Labour and Co-Operative)\nDeputy – Rob Kenny (Borough Independents)\nResources – Ralph Cooke (Labour)\nCommunity – Jill Hood (Borough Independents)\nLeisure – Gillian Pardesi (Labour & Co-Operative)\nEconomic Development – Ant Reid (Labour and Co-Operative)\nEnvironment – Ian Fordham (Borough Independents)\nClimate Change – Tony Pearce (Green)"
}