{
  "https_alexpuffette_com/https_alexpuffette_com_about-me/content_3.html": "I am currently in my final year of studying Philosophy, Politics and Economics at the University of York. While at university, I am working as Political Researcher to Iain Dale, first working on British General Election Campaigns 1830-2019, and on other projects since.\nMy first professionally published piece of writing was my chapter on Napoleon Bonaparte in The Dictators. I have now been commissioned to contribute to four upcoming books, the next being on Winston Churchill’s first election, Oldham 1899, in British By-elections. Iain and I have also appeared together at literature events, most recently the 2025 Lewes Speakers Festival.\nI published my first book, The Modern Prime Ministers, in 2020, aged sixteen, which was followed by I Was The Future Once: A David Cameron Biography in 2021. The books were well reviewed and covered by local media, with my first book acting as a fundraiser for my school’s Sixth Form Centre Project.\nOutside of writing, I am passionate about making a difference in my community. I stood in my first election in 2023, aged nineteen, and stood again in 2024, gaining 717 votes. In both elections I was proud to run positive campaigns that focused on the issues that mattered to residents.\nWithin politics, I have also worked on Local Election Campaigns, General Election Campaigns, and a Conservative Leadership Campaign, starting on work experience and most recently serving as Head of Correspondence. I undertook research work for Katie Lam, now Member of Parliament for the Weald of Kent, and since 2023, have been the Young Conservative Coordinator for my home county of Kent.\nIn my final year at university, I have also undertaken an internship in finance, and am always happy to speak, and give advice, to other young people regarding careers, whether in politics, the private sector, or even writing, so please do get in touch if that applies!",
  "https_alexpuffette_com/https_alexpuffette_com_category_st-johns-2023/content_14.html": "Category: St John’s 2023\n-\nSt John’s 2023 Campaign Launch\nToday, I am delighted to be formally launching my campaign to be the next Borough Councillor for St John’s by setting out my Plan for St John’s. At its heart, local politics is about people, and the people of St John’s deserve a councillor who understands the challenges they face in 2023",
  "https_alexpuffette_com/https_alexpuffette_com_contact/content_6.html": "Alex Puffette\nAuthor\nAbout Me\nContact\nContact\nEmail me at:\nalexpuffette.tw@gmail.com\nOr get in touch via social media:\nInstagram\nX\nLinkedIn\nSubscribe\nSubscribed\nAlex Puffette\nSign me up\nAlready have a WordPress.com account?\nLog in now.\nPrivacy\nAlex Puffette\nSubscribe\nSubscribed\nSign up\nLog in\nCopy shortlink\nReport this content\nView post in Reader\nManage subscriptions\nCollapse this bar",
  "https_alexpuffette_com/https_alexpuffette_com_privacy-policy/content_4.html": "Privacy Policy\nOur contact details\nName: Alex Puffette\nE-mail: alexpuffette.tw@gmail.com\nThe type of personal information we collect\nWe currently collect and process the following information:\n- Personal identifiers, contacts and characteristics (for example, name and contact details)\n- An online identifier\nHow we get the personal information and why we have it\nMost of the personal information we process is provided to us directly by you for the following reason:\n- To receive and act upon feedback and contact requests\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful bases we rely on for processing this information are:\n(a) Your consent. You are able to remove your consent at any time. You can do this by contacting alexpuffette.tw@gmail.com\nHow we store your personal information\nYour information is securely stored.\nWe keep Personal identifiers, contacts and characteristics (for example, name and contact details) for 1 year. We will then dispose of your information by permanently and irreversibly deleting it.\nWe keep an online identifier for 1 year. We will then dispose of your information by permanently and irreversibly deleting it.\nYour data protection rights\nUnder data protection law, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal information.\nYour right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us at alexpuffette.tw@gmail.com if you wish to make a request.\nHow to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at alexpuffette.tw@gmail.com\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\nCookies Policy\nLast updated: 26 March 2023\nIn the first instance, see the website host’s (WordPress/Jetpack) Cookie Policy https://automattic.com/cookies/\nThis Cookies Policy explains what Cookies are and how We use them. You should read this policy so You can understand what type of cookies We use, or the information We collect using Cookies and how that information is used. This Cookies Policy has been created with the help of the Cookies Policy Generator.\nCookies do not typically contain any information that personally identifies a user, but personal information that we store about You may be linked to the information stored in and obtained from Cookies. For further information on how We use, store and keep your personal data secure, see our Privacy Policy.\nWe do not store sensitive personal information, such as mailing addresses, account passwords, etc. in the Cookies We use.\nInterpretation and Definitions\nInterpretation\nThe words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.\nDefinitions\nFor the purposes of this Cookies Policy:\n- Company (referred to as either “the Company”, “We”, “Us” or “Our” in this Cookies Policy) refers to Alex Puffette.\n- Cookies means small files that are placed on Your computer, mobile device or any other device by a website, containing details of your browsing history on that website among its many uses.\n- Website refers to Alex Puffette, accessible from http://www.alexpuffette.com\n- You means the individual accessing or using the Website, or a company, or any legal entity on behalf of which such individual is accessing or using the Website, as applicable.\nThe use of the Cookies\nType of Cookies We Use\nCookies can be “Persistent” or “Session” Cookies. Persistent Cookies remain on your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close your web browser.\nNecessary / Essential Cookies\nType: Session Cookies\nAdministered by: Us\nPurpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.\nWordPress/Jetpack Cookies\nFor a comprehensive account of the use of WordPress/Jetpack cookies, and how to opt out see their Cookie Policy.\nhttps://automattic.com/cookies/\nYour Choices Regarding Cookies\nIf You prefer to avoid the use of Cookies on the Website, first You must disable the use of Cookies in your browser and then delete the Cookies saved in your browser associated with this website. You may use this option for preventing the use of Cookies at any time.\nIf You do not accept Our Cookies, You may experience some inconvenience in your use of the Website and some features may not function properly.\nIf You’d like to delete Cookies or instruct your web browser to delete or refuse Cookies, please visit the help pages of your web browser.\nFor the Chrome web browser, please visit this page from Google: https://support.google.com/accounts/answer/32050\nFor the Internet Explorer web browser, please visit this page from Microsoft: http://support.microsoft.com/kb/278835\nFor the Firefox web browser, please visit this page from Mozilla: https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored\nFor the Safari web browser, please visit this page from Apple: https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac\nFor any other web browser, please visit your web browser’s official web pages.\nMore Information about Cookies\nYou can learn more about cookies: What Are Cookies?.\nContact Us\nIf you have any questions about this Cookies Policy, You can contact us:\n- By email: alexpuffette.tw@gmail.com",
  "https_alexpuffette_com/https_alexpuffette_com_2023_08_30_local-politics-needs-to-attract-more-young-people/content_5.html": "My column in the 30 August edition of the Times of Tunbridge Wells on why we need more young people involved in our local politics, and how we can make it happen.\nPlease get in touch if you or someone you know is interested in getting involved in politics as a young person. I am always delighted to help wherever I can.",
  "https_alexpuffette_com/https_alexpuffette_com_category_young-people-in-politics/content_7.html": "Category: Young People in Politics\n-\nLocal Politics Needs To Attract More Young People\nMy column in the 30 August edition of the Times of Tunbridge Wells on why we need more young people involved in our local politics, and how we can make it happen.",
  "https_alexpuffette_com/https_alexpuffette_com_st-johns-2023/content_15.html": "Today, I am delighted to be formally launching my campaign to be the next Borough Councillor for St John’s by setting out my Plan for St John’s.\nAt its heart, local politics is about people, and the people of St John’s deserve a councillor who understands the challenges they face in 2023 and knows how to address them.\nWhile some may see my youth as a drawback, I know that we need at least one young person representing the people of St John’s, a ward with numerous primary and secondary schools. As someone who less than a year ago was still at one of those schools, I am well placed to understand the issues of the day.\nI’m determined to run a positive campaign, built on a message of change for the people of St John’s. The first step of this campaign is engaging with local residents on my plan for a stronger, safer and more successful St John’s. Please consider reading my plan and feel free to get in touch regarding it. I am full of optimism for the future of our ward, and I believe by working with local residents, we can build a ward that we can proudly hand to the next generation.\nPromoted by Robert Findon on behalf of Alex Puffette of Tunbridge Wells Conservative Association, Suite 2 Paddock Wood Business Centre, Commercial Road, Paddock Wood, TN12 6EN",
  "https_alexpuffette_com/https_alexpuffette_com/content_1.html": "Alex Puffette\nAuthor\nAbout Me\nContact\nAbout Me\nMy Recent Work\nNapoleon Bonaparte in ‘The Dictators’\n5th Sep 2024\n24th Nov 2024\nBritish General Election Campaigns by Iain Dale\n26th Mar 2024\n26th Mar 2024\nSubscribe\nSubscribed\nAlex Puffette\nSign me up\nAlready have a WordPress.com account?\nLog in now.\nPrivacy\nAlex Puffette\nSubscribe\nSubscribed\nSign up\nLog in\nReport this content\nView site in Reader\nManage subscriptions\nCollapse this bar",
  "https_alexpuffette_com/https_alexpuffette_com_2024_09_05_napoleon-bonaparte-in-the-dictators/content_10.html": "Excited to have written the chapter on Napoleon Bonaparte in ‘The Dictators’ by Iain Dale.\nTo be alongside so many incredible fellow authors in this book, from historians I studied at school to politicians, is a great honour, and a huge thank you to Iain for the opportunity.\nThe tale of the life of Napoleon is a fascinating one. His rise, fall, then rise again and ultimate final downfall is a story for the ages, while his personal life, as a man who was married twice but had over twenty affairs, means that the chapter is far more salacious than you might expect from a history book! If you are interested in reading about Napoleon, and the sixty-three other dictators covered, ranging from Julius Caesar to Vladimir Putin, the book is available in print in all good bookshops and online along with as an e-book along with as an audiobook.",
  "https_alexpuffette_com/https_alexpuffette_com_category_books/content_12.html": "Category: Books\n-\nNapoleon Bonaparte in ‘The Dictators’\nExcited to have written the chapter on Napoleon Bonaparte in ‘The Dictators’ by Iain Dale. To be alongside so many incredible fellow authors in this book, from historians I studied at school to politicians, is a great honour, and a huge thank you to Iain for the opportunity. The tale of the life of Napoleon…\n-\nBritish General Election Campaigns by Iain Dale\nIt has been a huge pleasure to work as the Researcher for Iain Dale’s latest book British General Election Campaigns 1830–2019, published by Biteback.\n-\nI Was The Future Once – Revised and Updated\nIncredibly, it is now two years since I published my second book ‘I Was The Future Once: A David Cameron Biography’ and in those two years David Cameron has made enough headlines to mean that I felt like the book was in need of an update.",
  "https_alexpuffette_com/https_alexpuffette_com_2024_03_26_british-general-election-campaigns-by-iain-dale/content_2.html": "It has been a huge pleasure to work as the Researcher for Iain Dale’s latest book British General Election Campaigns 1830–2019, published by Biteback.\nIncluding essays from Sir John Curtice, Sir Robert Buckland MP, Julia Langdon, Tim Bale and Sir Vernon Bogdanor, among many other fantastic authors, the book serves as a great guide to British elections for the last two hundred years.\nThe book is available signed by Iain Dale, from Amazon and from Waterstones.\nIt is also available in many other good bookshops, and as an e-book.\nYou can read more about my experience helping write this book in this article by the University of York Politics Department.\nA huge thank you to Iain for this fantastic opportunity, and I look forward to continuing my work with him on his upcoming books.",
  "https_alexpuffette_com/https_alexpuffette_com_category_media/content_8.html": "Category: Media\n-\nLocal Politics Needs To Attract More Young People\nMy column in the 30 August edition of the Times of Tunbridge Wells on why we need more young people involved in our local politics, and how we can make it happen.\nAuthor\nMy column in the 30 August edition of the Times of Tunbridge Wells on why we need more young people involved in our local politics, and how we can make it happen.",
  "https_alexpuffette_com/https_alexpuffette_com_author_apuffette/content_11.html": "Author: Alex Puffette\n-\nNapoleon Bonaparte in ‘The Dictators’\nExcited to have written the chapter on Napoleon Bonaparte in ‘The Dictators’ by Iain Dale. To be alongside so many incredible fellow authors in this book, from historians I studied at school to politicians, is a great honour, and a huge thank you to Iain for the opportunity. The tale of the life of Napoleon…\n-\nBritish General Election Campaigns by Iain Dale\nIt has been a huge pleasure to work as the Researcher for Iain Dale’s latest book British General Election Campaigns 1830–2019, published by Biteback.\n-\nLocal Politics Needs To Attract More Young People\nMy column in the 30 August edition of the Times of Tunbridge Wells on why we need more young people involved in our local politics, and how we can make it happen.\n-\nI Was The Future Once – Revised and Updated\nIncredibly, it is now two years since I published my second book ‘I Was The Future Once: A David Cameron Biography’ and in those two years David Cameron has made enough headlines to mean that I felt like the book was in need of an update.\n-\nSt John’s 2023 Campaign Launch\nToday, I am delighted to be formally launching my campaign to be the next Borough Councillor for St John’s by setting out my Plan for St John’s. At its heart, local politics is about people, and the people of St John’s deserve a councillor who understands the challenges they face in 2023",
  "https_alexpuffette_com/https_alexpuffette_com_2023_03_28_st-johns-2023-campaign-launch-2/content_13.html": "Today, I am delighted to be formally launching my campaign to be the next Borough Councillor for St John’s by setting out my Plan for St John’s.\nAt its heart, local politics is about people, and the people of St John’s deserve a councillor who understands the challenges they face in 2023 and knows how to address them.\nWhile some may see my youth as a drawback, I know that we need at least one young person representing the people of St John’s, a ward with numerous primary and secondary schools. As someone who less than a year ago was still at one of those schools, I am well placed to understand the issues of the day.\nI’m determined to run a positive campaign, built on a message of change for the people of St John’s. The first step of this campaign is engaging with local residents on my plan for a stronger, safer and more successful St John’s. Please consider reading my plan and feel free to get in touch regarding it. I am full of optimism for the future of our ward, and I believe by working with local residents, we can build a ward that we can proudly hand to the next generation.\nPromoted by Robert Findon on behalf of Alex Puffette of Tunbridge Wells Conservative Association, Suite 2 Paddock Wood Business Centre, Commercial Road, Paddock Wood, TN12 6EN",
  "https_alexpuffette_com/https_alexpuffette_com_2023_03_31_i-was-the-future-once-revised-and-updated/content_9.html": "Incredibly, it is now two years since I published my second book ‘I Was The Future Once: A David Cameron Biography’ and in those two years David Cameron has made enough headlines to mean that I felt like the book was in need of an update. So, in a manner in keeping with a Taylor Swift fan like myself, today I’m rereleasing the e-book with a new chapter!\nThe new chapter titled ‘From Statesman to Salesman’ covers Cameron’s post premiership years, most notably the Greensill Lobbying Scandal. It is available right now for free on Apple Books, either via the link to my website in my bio, or by just searching my name or the book title on Apple Books.\nPlease let me know what you think of the new chapter by rating and reviewing it on Apple Books, along with sharing it with anyone you think would find it interesting. Equally, if you haven’t yet read the rest of the book, there has never been a better time! A particular thank you to the people that I mentioned in the updated acknowledgments section, along with to those I thanked the first time around.\nLeave a comment"
}