{
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-teams-up-with-citizens-advice-to-increase-pension-credit-uptake-ahead-of-deadline/content_4.html": "Leigh Ingham has teamed up with Citizens Advice Staffordshire South West (Stafford) to help pensioners sign up to Pension Credit. Pensioners can attend sessions on Thursday 5th December, Tuesday 10th December, Monday 16th December, or Tuesday 17th December in Stafford town centre for help applying for Pension Credit ahead of the 21st December 2024 deadline to receive this year’s Winter Fuel Payment.\nPension Credit is a vital benefit that is worth £3,900 a year on average, but also acts as a gateway to other benefits. This means even one pound of Pension Credit could open up extra help including help with Council tax, Housing Benefit, and the Winter Fuel Payment. A full list of the help Pension Credit can open up can be found on the Citizens Advice website.\nPensioners whose weekly income is below £218.15 for a single person or £332.95 for a couple can check to see if they could be eligible via the Pension Credit calculator. Pensioners who own their own home or have savings or a private pension income could still be eligible.\nTo attend the session, pensioners will need the following information about them and their partner, if they have one: National Insurance Number, information about any income, savings or investments held, and bank account details. Information is required from the last three months.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages, said: “I know that many people across Stafford, Eccleshall, and the villages are worried about vulnerable pensioners being able to access Pension Credit ahead of the deadline. If you, or someone you know, needs support with an application this winter, please come to a session so that we can help.”\nClaire Davis, Chief Executive Officer of Citizens Advice Staffordshire South West, “Although Pension Credit has been available for some time, a number of those eligible are not claiming it. We’re here to help pensioners navigate the application process to ensure they are receiving all the benefits they are entitled to.”\nFor more information, please email [email protected] or call 01785 594 949. Pensioners can also apply online for Pension Credit on the Gov.uk website.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_latest-news/content_3.html": "Stafford North End Community Centre awarded £78,886 for renovation works from National Lottery Community Fund April 15, 2025 Read More »\nLeigh Ingham MP celebrates £2.6 million from Labour Government to renovate historic Stafford College building April 11, 2025 Read More »\nLeigh Ingham MP welcomes over 1,500 extra GPs recruited to help end ‘8am scramble’ and bring back family doctor April 9, 2025 Read More »\nLeigh Ingham MP holds House of Commons debate on Access to Sport and Physical Education inspired by student at Sir Graham Balfour School in Stafford April 4, 2025 Read More »\nLeigh Ingham MP convenes Flooding Taskforce to push for solution for residents April 2, 2025 Read More »\nCare Minister visits Katharine House Hospice to find out how they are benefitting from major government investment March 17, 2025 Read More »\nWomen and Enterprise Group launch report tackling barriers to women in business February 26, 2025 Read More »\nLabour Government’s extra 16,190 local NHS dental appointment welcomed by Leigh Ingham MP February 25, 2025 Read More »\nLeigh Ingham MP hosts Sandon Road flooding public meeting for more than 65 residents and businesses February 17, 2025 Read More »\nLeigh Ingham MP launches series of coffee mornings with Marston Grange event February 10, 2025 Read More »\nLeigh Ingham MP celebrates confirmation of funding for Stafford Station Gateway Project January 6, 2025 Read More »\nTwo Staffordshire MPs elected to the Northern Ireland Affairs Select Committee December 10, 2024 Read More »\nLeigh Ingham MP teams up with Citizens Advice to increase Pension Credit uptake ahead of deadline December 6, 2024 Read More »\nLeigh Ingham MP to Co-Chair Women and Enterprise All-Party Parliamentary Group November 21, 2024 Read More »",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-women-and-enterprise/content_21.html": "To help boost female entrepreneurship and tackle the barriers to women in business, Leigh Ingham, MP for Stafford, Eccleshall, and the villages, has been elected as Co-Chair of the All-Party Parliamentary Group (APPG) for Women and Enterprise.\nThe Women and Enterprise APPG will see MPs, Peers, and its Business Board collaborating to ensure the challenges and opportunities for women entrepreneurs are considered and promoted cross-party and in both houses.\nIn 2025, the group will release its third report highlighting areas where the Government and private sector can develop their support and understanding of issues specific to women seeking to start or scale their business.\nThe APPG’s Officers include Labour MPs Leigh Ingham and Catherine Fookes, Conservative MP Aphra Brandreth, and Liberal Democrat MP Victoria Collins. The Officers were elected for their experience in entrepreneurship and/or experience working with women and girls.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “The growth of women owned businesses is a huge area of economic opportunity to the UK. I look forward to working with women founders locally and nationally.”\nDeclan Riddell, Policy Advisor at Staffordshire Chambers of Commerce, said: “Staffordshire Chambers’ of Commerce is delighted with the news of Leigh Ingham’s election as co-chair of the All-Party Parliamentary group for Women and Enterprise.\n“As a Chamber, we continue to deliver our Women In Business programme, which offers a bespoke programme of support to inspire, boost confidence and raise the self-esteem of women across the county. It’s great to see a local MP at the heart of the All-Party Parliamentary Group for Women and Enterprise and we look forward to playing our part in empowering more female entrepreneurs in the future.”\nAPPGs are informal, cross-party groups formed by Members of the House of Commons and Lords with a common interest in a particular policy area, region, or country.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_privacy-policy/content_17.html": "We respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\n1. WHO WE ARE AND HOW TO CONTACT US\nLeigh Ingham MP is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at [email protected].\n2. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\nBy collecting such data, we will be able to inform you about relevant Leigh Ingham MP’s work in Parliament and the constituency, as well as inform Leigh Ingham of the issues important to constituents to advance her parliamentary work.\nWe take children’s privacy seriously. If you are under the age of 16, we will ask permission from a parent or legal guardian before processing your data. We do not knowingly collect personal information from children without proper consent. Parents/carers can contact us at [email protected] to review or delete their child’s data at any time.\n2.1 For data submitted through this website, we may share your data with other campaigns and movements that share the values, principles and aims of Leigh Ingham MP (including, but not limited, to other Labour Party elections) and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place.\n2.2 Data submitted via a Google Form as part of a Parliamentary survey, and responses to House of Commons branded letters or Parliamentary email addresses will only be used for Parliamentary purposes and not shared with other movements or groups.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n3. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\nWe also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n4. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\n4.1 Provided by you directly to this website or in response to Labour Party branded materials\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\nThis can includes personal data you provide when you register as a supporter of Leigh Ingham MP, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\n4.2 Provided by you by filling in a Parliamentary survey via Google Forms or in response to Parliamentary letters and emails\nYou may give us your name and contact details by filling in a Parliamentary survey, alongside sharing your views and ideas about the local area\n5. HOW WE USE YOUR PERSONAL DATA\nThe uses\nWe will only use your personal data when the law allows us to.\n5.1 For data submitted via this website and Labour Party branded materials, such as leaflets, flyers, or letters.\nWe will use your personal data in the following circumstances:\n5.2 For data submitted via a Parliamentary Google Form or printed survey, or in response to a House of Commons branded letter or Parliamentary email address\nData submitted as part of a Parliamentary survey or via materials containing House of Commons branding, will only be used for Parliamentary purposes\nParliamentary purposes include:\nThe legal bases\n6. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition).\n6.1 For data submitted via this website or Labour Party branded materials, we may share your data:\n6.2 For data submitted via a Parliamentary materials, such as a survey with House of Commons branding, or communications with Parliamentary email addresses, we will not share your data, other than for Parliamentary purposes, such as writing to a Minister or related third party to your case.\n7. WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nYou will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\nRight to object/Opting-out\nYou can ask us to stop sending you marketing messages at any time by contacting us a [email protected].\nYou have a right to opt-out of your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nWhere you opt-out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagement or transactions with us (so, for example, if you opt-out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\n8. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\n9. CHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n10. CHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n11. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n12. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n13. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n14. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n15. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them.\nRight of access\nYou may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\nWe follow the ICO’s “Subject Access Code of Practice” when dealing with requests for access to personal data. You can read this code by visiting https://ico.org.uk/media/for-organisations/documents/2014223/subject-access-code-of-practice.pdf.\nPlease note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\nYou can exercise this right at any time by contacting us at [email protected] and telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request.\nYour right to rectification and erasure\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (you may have heard of this right described as the “right to be forgotten“).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\nYou can exercise this right at any time by contacting us at [email protected] and telling us that you are making a request to have your personal data rectified or erased and on what basis you are making that request. If you want us to replace inaccurate data with new data, you should tell us what that new data is. You do not have to fill in a specific form to make this kind of request.\nYour right to restrict processing\nWhere we process your personal data on the basis of a legitimate interest (see the sections of this privacy policy which explain how and why we use your information), you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data: (a) if you dispute the accuracy of that personal data and want us to verify that data’s accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; or (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nPlease note that if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it. You can exercise this right at any time by contacting us at [email protected] and telling us that you are making a request to have us stop processing the relevant aspect of your personal data and describing which of the above conditions you believe is relevant to that request. You do not have to fill in a specific form to make this kind of request.\nYour right to portability\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nBecause of the kind of the nature of our work do and the systems that we use, we do not envisage this right being particularly relevant to the majority of individuals with whom we interact. However, if you wish to transfer your data from us to a third party, we are happy to consider such requests in good faith.\nYour right to stop receiving communications\nAs noted above, where we send you email marketing communications (or other regulated electronic messages) you have the right to opt-out at any time. You can do this by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications).\nAlternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at [email protected] and telling us which communications you would like us to stop sending you.\nYour right to object to automated decision making and profiling\nYou have the right to be informed about the existence of any automated decision making and profiling of your personal data, and where appropriate, be provided with meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing that affects you.\nExercising your rights\nWhen you write to us making a request to exercise your rights, we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help us to verify your identity. This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be, the faster and more efficiently we can deal with your request. If you do not provide us with sufficient information, then we may delay actioning your request until you have provided us with additional information (and where this is the case, we will tell you).\nYou will not usually have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.\nWe try to respond to all legitimate requests within one (1) month. However, it could take us longer than a month if your request is particularly complex or if you have made a number of requests. In this case, we will notify you of this and keep you updated.\n16. RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nThe contact details for the ICO are:\nLast updated: 14/03/2025",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-welcomes-extra-nhs-dentistry-appointments/content_9.html": "Staffordshire and Stoke-on-Trent ICB will deliver 16,190 extra urgent care NHS dental appointments as part of the Government plans to roll out 700,000 extra urgent dentistry appointments. This delivers on Labour’s manifesto commitment and will help local people access NHS dental care when they need it.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages, welcomed the Labour Government’s announcement, describing the new appointments as ‘vital’ and ‘desperately needed’.\nThe announcement marks the start of the Government and NHS delivering on the manifesto pledge to provide 700,000 extra urgent and emergency dental appointments to address the crisis in NHS dentistry.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “Everyone knows the scale of the challenge facing NHS dentistry after years of failure and underinvestment under the previous Conservative government. It is scandalous that the number one reason that five- to nine-year-olds are admitted to hospital is because of tooth decay.\n“In recent years, it has become near impossible to get an NHS dental appointment. In the last six months, I have only found one dentist in the constituency taking on adult NHS patients, and by the time I called next, they were already full!\n“Residents in Stafford, Eccleshall, and the villages deserve far more than the deterioration of services that they have witnessed over the past decade. I campaigned hard on this issue before the general election, and I will continue to do so as your local MP.”\nStephen Kinnock, Minister of State for Care said: “We promised we would end the misery faced by hundreds of thousands of people unable to get urgent dental care, and we’re starting to deliver on that commitment. NHS dentistry has been left broken after years of neglect with patients left in pain without appointments or queueing around the block just to be seen.\n“This government will rebuild dentistry – focusing on prevention, retention of NHS dentists and reforming the NHS contract to make NHS work more appealing to dentists and increase capacity for more patients. This will take time but today marks an important step towards getting NHS dentistry back on its feet.”",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-launches-solar-panels-petition/content_31.html": "The MP for Stafford Eccleshall, and the villages, Leigh Ingham, is calling on the Government to ensure all future homes being built have solar panels installed as a minimum. She is inviting local residents to join her in this by signing her petition.\nAs the Government finalises the Future Homes Standard, Leigh Ingham has also written to the Minister for Housing and Planning, Matthew Pennycook, to push for all future new homes being built to have solar panels installed. The petition will support her efforts by demonstrating keen local interest in a roofs-first approach to solar.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “I feel very strongly that the next generation of homes we build should not only be homes, but energy generators as well, and I have spoken to many residents across Stafford, Eccleshall, and the villages, who share this belief.”\n“In Stafford, we already have zero energy bill homes being built at Victoria Gate, which I visited last year with the Secretary of State for Energy Security and Net Zero. These homes come equipped with state of-the-art green energy technology, including an air source heat pump, roofmounted solar panels and a home battery. I would like to see more properties built in this manner, but as a minimum we should have solar panels on all new homes.\n“Solar power has a massive part to play in our Net Zero ambitions, and a roofs-first approach should be prioritised whenever possible. Although it may not completely eliminate the need for renewable energy sources to be placed in rural areas, it can help preserve some of our natural landscape and avoid disrupting our precious natural ecosystems.”\n“Too many new builds come without solar panels. I am calling on the government to ensure solar panel coverage on all new properties, to help lower energy bills and strengthen our energy security.”\nIf you agree with Leigh Ingham MP that all new builds should have solar panels installed, you can support by signing her petition.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_women-and-enterprise-group-launch-report/content_28.html": "At an event in the House of Commons attended by Parliamentarians and some of the UK’s leading female entrepreneurs, the Women and Enterprise All-Party Parliamentary Group launched its report, Strategies for Scaling Up. The report highlights areas where the Government and private sector can develop their support and understanding of issues specific to women seeking to start or scale their business.\nStrategies for Scaling-Up focuses specifically on the barriers preventing female-led enterprises from expanding. It sets out clear recommendations for government and industry to help businesses access the finance, support, skills, and talent needed to grow. By addressing these challenges, the UK can create a more inclusive and dynamic entrepreneurial environment.\nThis report takes a three-pronged approach. First, it examines the role of coaching and mentoring in helping female entrepreneurs scale their businesses. Second, it explores the importance of flexible, accessible, and timely education and skills provision. Finally, it addresses sustainability in business, looking at how female-led enterprises can integrate Environmental, Social, and Governance (ESG) principles into their growth strategies.\nLeigh Ingham, Labour MP for Stafford, Eccleshall, and the villages and Co-Chair of the Women and Enterprise APPG said: “Female-led companies are an integral part of the UK’s economic fabric. However, they continue to face barriers that place them at a disadvantage compared to their male counterparts—despite evidence that they often outperform male-led companies in several key sub-sectors.\n“If implemented, the recommendations in this report will have a lasting impact, creating a more equitable business environment and unlocking the full economic potential of female entrepreneurs in the UK for years to come.”\nCatherine Fookes, Labour MP for Monmouthshire and Co-Chair of the Women and Enterprise APPG, said, “Female entrepreneurs are the unsung heroes of our economy and to get the growth we need, we must support them.\n“I know from my own experience that mentoring can be transformative and I look forward to working with the APPG and the Government to take forward some of the ideas in the report.”\nThe Women and Enterprise APPG involves MPs, Peers, and its Business Board collaborating to ensure the challenges and opportunities for women entrepreneurs are considered and promoted cross-party and in both houses.\nThe APPG’s Officers include Labour MPs Leigh Ingham and Catherine Fookes, Conservative MP Aphra Brandreth, and Liberal Democrat MP Victoria Collins. The Officers were elected for their experience in entrepreneurship and/or experience working with women and girls.\nTo read the report, click here.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_reflections-on-2024/content_12.html": "As 2024 draws to a close, I thought I’d collate some of my highlights from being your MP these last six months. It is an honour and a privilege to be your MP, and I have been working hard to represent you to the best of my ability. The last six months have been a whirlwind – and it will be hard to sum them up in 600 words – but I’ll give it my best shot!\nWhat have I been up to locally?\nI now have a full team of five full time staff available to you, with four based in Stafford. My office is open all week for appointments with my team, please call to book an appointment.\nSince being elected, my team and I have opened around 2,700 cases to support local people with issues like child maintenance, domestic abuse, housing, SEND, and much more. I’ve been running regular surgeries, meeting local people and families to discuss policy concerns or personal issues for me to help them with.\nI’ve had some brilliant feedback from constituents, many of whom have had positive resolutions, and it’s great to know that people are feeling supported. We’ve been able to close over 1,700 of the cases already, and we’re working hard on the rest.\nI’ve been lucky enough to attend some fantastic events around the constituency, and visited schools, businesses, charities, and farms. I’m keen to meet as many local organisations as possible, so I’m able to represent you all to the best of my ability.\nThe festive period has been particularly fun, and I’ve really enjoyed getting involved in the festivities. I’ve run a Christmas card competition with Burton Manor Primary School, worked with Walton Hall Academy on decorations for my tree for the St Mary’s Christmas Tree Festival, and read a lesson at St Mary’s Carols by Candlelight service.\nWhat I’ve been up to in Parliament\nSince the Election, we’ve had some really big pieces of Government legislation, to name just a few:\n- The Renters Reform Bill, which makes sure landlords are keeping homes safe\n- The Water Measures Bill, which penalises companies that pollute our waters\n- The Rail Franchising Bill, which starts the process of returning our rail to public ownership\n- The Employment Rights Bill, providing the biggest uplift to worker’s rights in a generation\n- The Crime and Policing Bill to improve the safety of our streets\n- The Border Bill and the launch of a new Border Security Strategy\nRecent Government announcements will go a long way in solving local issues and helping local people. For example, the Water Measures bill will help to address the 207 sewage dumps in Stafford, Eccleshall, and the villages in 2023, while the £100 million funding allocation for hospices will help Katherine House Hospice continue to deliver excellent end of life care.\nThe Government’s announcements of prioritising veteran’s housing, and the purchasing of 190 military homes back from private landlords, will help our local armed forces family access high quality housing.\nI also voted in favour of Kim Leadbeater’s Private Member’s Bill on assisted dying, which was a huge and very important decision.\nI have been elected to the Northern Ireland Select Committee and joined several All-Party Parliamentary Groups (APPGs) including those focussed on Women and Enterprise, the West Midlands, Flooding, Farming, and Theatre. These will complement my work in the constituency and help us to achieve our local priorities.\nI delivered my first speech in Parliament (with my parents watching from the gallery) which was incredibly nerve wracking, but also such an honour to represent the people of Stafford, Eccleshall, and the villages.\nSince then, I have spoken in numerous debates on issues including online safety for young people, fly tipping, and higher education in Staffordshire. I’m working hard to raise the issues that matter to constituents, and really appreciate all the individuals and organisations who have reached out to me.\nMany of you have asked me to go events in Parliament, which I always do my best to attend. For example, I recently attended the Alzheimer’s Society Parliamentary reception and was able to feed back to the residents who had asked me to go along.\nIt’s been an incredible six months and me and the team are just getting started. If you need my help or would like to arrange a visit, you can get in touch by email or phone: [email protected] or 01785 594 949. Wishing you all a wonderful festive season!",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-hosts-sandon-road-meeting/content_10.html": "To give residents and businesses a platform to raise their concerns about the Sandon Road flooding, Leigh Ingham MP hosted a Public Meeting at Sheridan Hall on February 13, 2025. Attended by more than 65 residents, the event covered issues including transport and infrastructure, business impact, and the emotional toll the flooding has taken on those living and working nearby.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said, “The flooding on Sandon Road is a pervasive problem, and one that has been going on too long. Not only that, it’s clear that the issue is worsening, as we’re seeing flooding happen more frequently. This week, I wanted to have an open forum for residents and local businesses to speak freely about their experiences so far and help me build a fuller picture of the true impact of this terrible flooding.\n“It was upsetting to hear many of the residents’ stories of how their lives have been affected by living in constant fear of flooding, alongside the impact of the floods themselves. It is clear this issue is affecting the community mentally, physically, and financially – I will do everything I can to work on a solution.\n“The information gathered from residents at the event will be extremely useful in my conversations with local and national agencies, and with relevant Ministers to work on a solution collaboratively.”\nAhead of the public meeting, Leigh Ingham MP met with Severn Trent and The Environment Agency in Stafford, and the Floods Minister Emma Hardy in Parliament to gather information.\nTo make sure this issue had been heard at the highest level, Leigh Ingham MP asked Prime Minister Keir Starmer about his plans for investing into flooding infrastructure during her first Prime Minister’s Question in January.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-to-host-three-nhs-consultation-events/content_23.html": "To help ensure the voices of people in Stafford, Eccleshall, and the villages are heard during healthcare reforms, Leigh Ingham MP is hosting three events to help to inform the Government’s new 10 Year Health Plan for England.\nResidents can sign up to an in-person event in Stafford on Friday 31st January at 3.30-5pm, or an online event on Tuesday February 11th or Wednesday February 12th at 6-7.30pm.\nPlaces are limited, so please sign up here: https://bit.ly/LeighInghamNHS.\nThese events form part of the Government’s national consultation on the future of the NHS and will provide local staff and patients the opportunity to provide specific feedback on their experiences of local health services.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “I am running these events to make sure the voices of people in Stafford, Eccleshall, and the villages are heard as part of the plan for the future of the NHS.\n“The plans for NHS reform should not be top-down or led from behind a desk in Westminster. They must be built in partnership with the people who use our NHS, the staff who work in it, NHS leaders, health experts, industry, and the wider public.\n“Whether it’s struggling to get a GP appointment, being stuck on an NHS waiting list, or the inability to register for an NHS dentist, local people have personal insights into the challenges and opportunities for the NHS. I’d encourage all constituents to sign up for one of my events in February to share their experiences and ideas.”\nLaunching the Change NHS public engagement, Prime Minister Keir Starmer said: “We have a clear plan to fix the health service, but it’s only right that we hear from the people who rely on the NHS every day to have their say and shape our plan as we deliver it. Together we can build a healthcare system that puts patients first and delivers the care that everyone deserves.\nThe insights from the events will inform the Government’s 10 Year Health Plan, due to be published in the Spring, which will deliver the unprecedented long-term reform needed to turn the NHS around.\nTo sign up for one of the events, please RSVP here: https://bit.ly/LeighInghamNHS. The specific location will be sent via email prior to the event once a booking has been confirmed.\nResidents in Stafford, Eccleshall and the villages who are unable to attend the local events can share their experiences with Leigh Ingham MP by email on [email protected].",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_north-end-community-centre/content_27.html": "Trustees at the Stafford North End Community Centre are celebrating a successful application to The National Lottery Community Fund. They have been awarded the sum of £78,886 for the renovation of both the pitched and the flat roof. Leigh Ingham, MP for Stafford, Eccleshall, and the villages, welcomes this “brilliant news” for the community venue, where she has both hosted and attended events.\nThe roof renovation project will ensure that the building is safe and fit for use by a variety of local community groups, who provide a range of services and activities for local residents, such as Aspire Group for adults with learning disabilities.\nThe renovations will benefit a footfall of 20,000 people a year who use Stafford North End Community Centre for a range of activities with around 550 people per week benefiting from the facility as members of 23 different groups.\nMike Winkle, Trustee of Stafford North End Community Centre, said, “The roof renovation, with the support of The National Lottery Community Fund, will allow the us to continue to benefit those living in the north end of Stafford and surrounding neighbourhood by providing a warm, weatherproof and welcoming space for recreation and leisure activities.\n“New tiles and a newly insulated flat roof will protect the building way into the future leaving a legacy for the community.”\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “Stafford North End Community Centre is a brilliant community venue, where I’ve both hosted and attended events, and this funding means it will continue for years to come. Well done to the whole team on the successful bid, it’s no small feat!”\nThe continued use of the centre for a variety of events and activities will contribute to positive changes in health, social well-being and cohesion within the local community.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-celebrates-confirmation-of-funding-for-stafford-station-gateway-project/content_25.html": "Following engagement with Leigh Ingham MP, the Ministry of Housing, Communities and Local Government (MHCLG) has confirmed £20 million of funding for the Stafford Station Gateway Project. This overcomes previous delays to the funding and brings plans for new homes, businesses, and a multi-storey car park on disused land in Stafford one step closer.\nThe proposals for Stafford Station Gateway scheme include a hotel, up to 900 new homes, 30,000 square feet of commercial space, and a 350-space multi-storey car park, alongside and leisure facilities. The project will achieve a biodiversity net gain on underutilised brownfield land around the Stafford railway station.\nJust shy of £20 million of Levelling Up Funding was announced in November 2023 for this site, but it was delayed ahead of the General Election. To help expediate the process and advocate for prioritisation by the new government, Leigh Ingham MP secured a meeting with Alex Norris, Minister for Democracy and Local Growth in late 2024.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages, said “The Station Gateway project will bring great value to Stafford, creating housing, leisure, and commercial space, while being an important part of our town centre regeneration.\n“I’m delighted to confirm the Minister’s support, which will help ensure that funding can be drawn down and the project can progress efficiently.”\nCouncillor Godfrey, Leader of Stafford Borough Council, said: “It is great to now have confirmation that we will be receiving this money, which demonstrates the confidence the Government has in us and our partners to deliver growth for the area. We have consistently demonstrated our ambition for Stafford town and attracted significant investment, and interest, in the borough.\n“We are perfectly placed by road, rail, and air for new businesses to flourish and the Stafford Gateway will be a thriving, vibrant new community within the town where people want to live, work, and visit – all sustainably connected to the railway station.”",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-signs-holocaust-educational-trust-book-of-commitment/content_16.html": "To mark Holocaust Memorial Day on January 27th, Leigh Ingham MP signed the Holocaust Educational Trust’s Book of Commitment, and in doing so pledged her commitment to marking Holocaust Memorial Day – honouring those who were murdered during the Holocaust as well as paying tribute to the extraordinary Holocaust survivors who work tirelessly to educate young people today.\nHolocaust Memorial Day falls on 27th January, the liberation of the infamous former Nazi concentration and death camp, Auschwitz-Birkenau. This year marks the 80th anniversary of the liberation in 1945. Across the UK – and internationally – people will come together to remember the Holocaust.\n2025 is a significant anniversary year marking 80 years since the liberation of the Nazi concentration camps of Europe. With survivors becoming older and frailer, this is likely to be the last significant anniversary at which Holocaust survivors will be present, and able to share their eye-witness testimony. As the Holocaust moves from living memory to history, this Holocaust Memorial Day presents a key opportunity to bring the Holocaust to the fore of our national consciousness.\nIn the lead up to and on Holocaust Memorial Day, thousands of commemorative events have been arranged by schools, faith groups, and community organisations across the country, remembering all the victims of the Holocaust and subsequent genocides. The theme for this year’s commemorations is ‘For a Better Future’.\nOn Holocaust Memorial Day we also remember and pay tribute to all of those persecuted by the Nazis, including Roma and Sinti people, disabled people, gay men, political opponents to the Nazis and others. We also remember all of those affected by genocide since, including in Cambodia, Rwanda, Bosnia and Darfur.\nAfter signing the Book of Commitment, Leigh Ingham MP commented: “Holocaust Memorial Day this year marks 80 years since the liberation of the infamous former Nazi concentration and death camp, Auschwitz-Birkenau, in 1945. Today presents an important opportunity for people from Stafford, Eccleshall, and the villages to reflect on the darkest times of European history. I pledge to remember the six million Jewish men, women and children who were murdered in the Holocaust and speak out against all forms of antisemitism, which in recent months has risen exponentially and which needs to be tackled head on.”\nKaren Pollock CBE, Chief Executive of the Holocaust Educational Trust, said: “This year, on Holocaust Memorial Day, we come together to mark 80 years since the liberation of the extermination and concentration camps of Europe. We remember the six million Jewish men, women, and children who were murdered by the Nazis and their collaborators and we honour those who survived and rebuilt their lives after enduring unimaginable horrors.\nThe images and accounts that emerged at liberation revealed the full scale of the Nazis’ attempt to annihilate the Jewish people and this gave rise to the enduring call ‘Never Again.’ This phrase embodies the hope that the Holocaust would serve as a stark warning to future generations of the consequences of unchecked hatred and antisemitism.\nAs we mark this significant anniversary, the lessons of the Holocaust remain as urgent as ever. With survivors becoming fewer and frailer, and with antisemitism continuing to surge across the world – we must all commit to remembering the six million Jewish victims and must take action to ensure anti-Jewish racism is never again allowed to thrive.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_100-days/content_18.html": "This week marks 100 days since I was elected as MP for Stafford, Eccleshall, and the Villages, and it has been the honour of my life to represent this wonderful area in Parliament.\nWhile I’ve tried to keep you all as up to date as possible on my social media channels, I know many constituents will be interested in a more comprehensive update on what I have been up to since becoming MP back in July.\nEstablishing my constituency office\nWhile I became MP straight after polling day, hiring staff (with notice periods to serve!) wasn’t quite as instantaneous.\nI’ve now hired four brilliant full time team members to work in my office on Mill Street: an Office Manager, a Senior Caseworker and a Caseworker, and a Communications and Engagement Manager.\nI appreciate everyone’s patience during my first few weeks, and if you’re waiting for a response from the early days, please do get back in touch again.\nIt is hugely important to me that I maintain a town centre presence (ideally without such a giant picture of my face on the window!), to be as accessible as possible for you all. The office is now open for appointments should you need the help of me or my team, so please do get in touch.\nThe team are working extremely hard to support local people’s requests, such as helping me to campaign for better local services, arranging meetings, and making representations on behalf of constituents. As of my 100 days in office, I’ve opened hundreds of cases covering things like child maintenance, family visas, domestic abuse, housing issues, and much more.\nAs well as this, I’ve run several surgeries, both in Stafford and rural areas like Loggerheads, so I can help people directly. My next surgery will be in Eccleshall, and appointments will be available soon.\nWorking hard for the community\nI’ve attended some amazing local events like Stafford Pride, Doxey Family Fun Day, and the Eccleshall Show. I’ve also visited schools, businesses, charities, and farms to listen and learn from them and to ensure I am able work on their behalf in Westminster.\nI was thrilled to do my first ever ribbon cutting in October to officially open Doxey Academy… with a little help from the school’s head boy.\nSo that I can improve SEND provision in Staffordshire, I’ve spoken to many parents and teachers of SEND children and visited Walton Hall Academy. Alongside this, I’ve joined a community campaign with the parents of SEND children to campaign for more inclusivity in our parks.\nImportantly, I’ve been working hard to improve local NHS services. One key project is at Holmcroft Surgery, where I’ve been working with the ICB and practice team, as well as a public meeting involving more than 200 patients. There is now an action plan in place, and patients have already noted some improvements There will be a six-month review in February to monitor progress.\nFinding my way in Westminster\nWhile admittedly, I did get lost a few times in my first few weeks in Westminster, I’ve started to find my way! I will be chairing the All-Party Parliamentary Group (APPG) for Women and Enterprise, helping to support women owned businesses across the country, and closer to home.\nI’ll be joining the APPG for Flooding, an important issue to residents, as well as the APPG for Theatre. I’m keen to the champion arts, culture, and heritage in the constituency, and celebrate and support our amazing Stafford Gatehouse Theatre.\nNationally, there have been a whole host of great initiatives. The new Labour government has launched publicly owned green energy company GB Energy, as well as providing the biggest shake up of working people’s rights in a generation through the Employment Rights Bill. To support our young people, we’ve created a Child Poverty Taskforce, announced free breakfast clubs for kids, scrapped single word Ofsted reviews, and more.\nIt’s been a whirlwind of a 100 days, but I have loved every minute. I want to be an accessible MP who listens, responds, and helps my constituents. So, if you need me, please get in touch. I’m here to help.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_doxey-academy-opening/content_15.html": "On October 11th, 2024, Doxey Primary School officially relaunched as Doxey Academy. The new name clearly communicates the substantive and transformative changes the Stafford-based school has made in the last year and announces the official joining of the Creative Learning Partnership Trust. To mark the occasion, Doxey Academy hosted a celebratory event attended by staff, governors, parents, and children, with Leigh Ingham MP cutting the ribbon to officially open the new school.\nFormerly, as Doxey Primary School, the school received three consecutive Requires Improvement ratings from Ofsted. With a high level of pupil premium and SEND requirements, changes were needed to ensure every child could reach their full potential.\nLaura Lazenby joined the school as headteacher in 2023 and the school has since made rapid improvements. Doxey Academy has a new behaviour policy, a new curriculum written by the school’s teachers, and a new pedagogy. As well as achieving its highest ever year 6 SATs results in 2024, the learning environment has greatly improved.\nJoining the Creative Learning Partnership Trust will help continue the improvements, adding an additional layer of support and providing access to a community where staff can share ideas and collaborate.\nLaura Lazenby, Headteacher of Doxey Academy, said: “A year on from when I first arrived here at Doxey as headteacher and wow, how things have changed.\n“The school is a calm and purposeful learning environment, behaviour is greatly improved, and children’s academic and emotional needs are being met well. Today marks a new era, where our children, staff, and families get to celebrate our achievements and look to a bright future.”\nSam Compton, CEO of Creative Learning Partnership Trust said: “The Trust believes in transformational educative opportunities. We are delighted to be working with Doxey Academy, seeing the significant and positive impact that the school has on its local community.”\nLeigh Ingham, MP for Stafford, Eccleshall, and the Villages said: “A supportive school community has the power to change children’s lives forever for the better, and seeing what the school has achieved in such a short time is inspiring.\n“Every child deserves a great education, and it was an honour to cut the ribbon and officially announce the opening of Doxey Academy.”",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_two-staffordshire-mps-elected-to-the-northern-ireland-affairs-select-committee/content_20.html": "Two Staffordshire MPs have been elected to the Northern Ireland Affairs Select Committee. Leigh Ingham, MP for Stafford, Eccleshall, and the villages and Adam Jogee, MP for Newcastle-under-Lyme, will both join the Committee to examine and scrutinise the Government’s work in Northern Ireland.\nAs members of this Select Committee, Leigh Ingham and Adam Jogee will examine the expenditure, administration, and policy of the Northern Ireland Office and its associated public bodies. Following their appointment, both MPs were in Belfast last week to meet with stakeholders including major employers, Stormont Assembly Members (AMs), and key legacy organisations such as the Independent Commission for Reconciliation and Information Recovery (ICRIR).\nThe Committee’s role is to undertake inquiries on various issues, seeking evidence from a wide range of groups and individuals with relevant interests and experience. The Committee produces reports setting out its findings and making recommendations to the Government, which must respond within two months. Previous inquiries include defence spending, renewable energy and Net Zero, and integrated education.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages, said: “Now is an important time in Northern Ireland, as we work to implement Brexit arrangements in the best interests of people and businesses in Northern Ireland and Great Britain.\n“I look forward to working with Parliamentary colleagues from across the political spectrum to scrutinise governmental activity in the best interest of Northern Irish people and businesses.”\nAdam Jogee, MP for Newcastle-under-Lyme, said: “Our United Kingdom is made up of four unique nations, and Northern Ireland is at its heart. I am deeply connected to and invested in Northern Ireland, and I am determined to bring an experienced and unique voice to the committee.\n“The Good Friday Agreement delivered a historic but fragile peace, and our government is its custodian. I look forward to working across Northern Ireland’s communities to protect and strengthen that peace, advancing progress, prosperity, and unity for all.\n“Representation matters, and I am committed to ensuring Northern Ireland’s voice is heard and its communities supported.”\nSelect Committees of the House of Commons report on government departments and economic affairs. The full Committee is made up of 13 MPs from a variety of parties, including three Northern Irish MPs.\nMembers include: Tonia Antoniazzi MP (Chair), Dan Aldridge MP, Chris Bloore MP, Sorcha Eastwood MP, Claire Hanna MP, Leigh Ingham MP, Adam Jogee MP, Alicia Kearns MP, Jerome Mayhew MP, Katrina Murray MP, Al Pinkerton MP, Gavin Robinson MP, and David Smith MP.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-urges-for-a-fairer-deal-for-farmers/content_5.html": "Leigh Ingham is one of 46 Labour MPs who co-signed a letter to the “big six” UK supermarkets urging them to adopt a fairer deal for farmers. The 46 Labour MPs from across England, Scotland, and Wales also called on supermarkets to ensure fairer prices for farmers and to improve transparency in product labelling.\n46 Labour MPs have written to the ‘big six’ UK supermarkets, to express concern about their unfair practices, which are severely affecting farmers and growers in the UK.\nThe MPs, drawn from across England, Wales, and Scotland used the letter to raise concerns that farmers often receive as little as 1p profit from the food items they produce, whilst supermarkets are enjoying “excessive profits”. They note that this is “creating a farming industry that is struggling, and forcing too many farmers and growers to rely on subsidies from government.”\nIn their letter, they highlight that over the last year alone, the ‘big six’ supermarkets made a combined made a total pre-tax profit of more than £5 billion. In a world where farmers and producers are struggling to make a living, and relying on Government grants and subsidies so that they can survive from one year to the next, this can’t be seen as fair or right.” This fact is made even more concerning when not all supermarkets pay corporation tax in the UK.\nThe letter also takes aim at the practice of “farmwashing” where misleading labelling gives consumers the false impression that products are locally sourced, when they are in fact imported or produced on large industrial farms masquerading as family-run operations. The letter argues that this practice is not only misleading, but also directly undermines the credibility of British agriculture.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said, “Supermarkets are claiming to support UK farmers, but their actions suggest otherwise.\n“Farmers and growers play a vital role in delivering the UK’s food sustainability, but yet they aren’t receiving a fair deal from the supermarkets. This has been going on for years and has been left unchallenged for too long.\n“It can’t be seen as right or fair that farmers often receive 1p profit from the food items they produce, whilst at the same time supermarkets are making excessive profits.\n“Farmers deserve a fair deal, and consumers deserve honesty and transparency – like all workers, farmers don’t deserve to be pressurised into unfair contracts with exploitative terms and conditions.”\nThe letter follows a recent meeting between Leigh Ingham MP and members of local branches of the National Farmers Union.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_bird-in-hand-pub-is-national-award-finalist/content_13.html": "The Bird in Hand in Stafford has been named as a finalist in the national Pub Aid Awards in the Community Support Hero category. The pub was nominated by Leigh Ingham MP after residents submitted ideas for local pubs that go above and beyond for the community. The winners will be announced at a ceremony in the House of Commons in March.\nRun by Dee and Terry Cope since 2017, the team at the Bird in Hand have invested hugely in supporting charities and our community. The pub offers its function room for free to several charities and community groups including the Royal British Legion, Royal Engineers, and Rotaries of Stafford.\nThe pub’s busiest community event is on Remembrance Sunday, where it hosts a free buffet and refreshments. As part of Remembrance 2024, the pub raised almost £1,000 for the Poppy Appeal.\nThe pub also runs regular fundraisers for charity including Katharine House Hospice, Alzheimer’s Trust, and Dog’s Trust. The Bird in Hand is a registered Safe Place, where people in vulnerable positions can go to receive help. To further its work in keeping the community safe, the pub works closely with local street pastors,\nTerry Cope, manager of the Bird in Hand pub said “We are extremely proud to be a finalist in the Community Pub Hero Awards. People from all over Stafford, and further afield, have told us how much this pub means to them, and we are delighted that this has been recognised not only by our local MP, but with a national award nomination.”\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “From stepping up for the Royal British Legion, providing free food to hundreds across Stafford, for raising thousands every year for charity, for providing a safe place for vulnerable people, and much more, this pub is a deserving winner of a Pub Aid award.”\nThe Pub Aid Awards are arranged by the All-Party Parliamentary Group for Beer. Hundreds of pubs across the country entered the awards, which celebrate incredible pubs and individuals who have gone above and beyond to support their communities, raising vital funds, fostering grassroots sports, championing sustainability, and making a real difference in people’s lives.\nFor more information, visit: https://www.pubaid.co.uk/news/announcing-the-finalists-for-the-community-pub-hero-awards-2025/.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_care-minister-visits-katharine-house-hospice/content_32.html": "Katharine House Hospice in Stafford will receive £97,658 as part of the Labour Government’s biggest investment into hospices and end of life care in a generation. To see how the hospice is benefitting, the Minister for Care Stephen Kinnock visited the Hospice to meet with patients, staff, and local MP Leigh Ingham.\nFamilies in Stafford will start to see improved end-of-life care as the government brings in major upgrades to hospice services nationwide. The funding will help modernise the IT systems at Katharine House, making it easier to see patient information quickly in one place. This will save nurses time on admin, allowing them to spend longer on patient care and support.\nThe improvements will help ensure that during life’s most challenging moments, patients and their loved ones receive the highest quality care in the most appropriate and comfortable settings.\nKatharine House Hospice in Stafford is receiving £97,658. Stafford MP Leigh Ingham said the funding ‘will make a real difference for to Katharine House who do such a wonderful job supporting local families’.\nThe cash has been distributed immediately for the 2024/25 financial year, with a further £75 million to follow from April.\nThe immediate cash injection, allocated through Hospice UK from the Department of Health and Social Care, will enable hospices to purchase essential new medical equipment, undertake building refurbishments, improve technology, upgrade facilities for patients and families and implement energy efficiency measures.\nThe larger £75 million investment will support more substantial capital projects – including major building works and facility modernisation – throughout the next financial year.\nThe cash forms a key part of the government’s Plan for Change, improving care in the community where people need it most.\nMinister for Care Stephen Kinnock said: “Hospices like Katharine House provide invaluable care and support when people need it most and this funding boost will ensure they can spend less time on admin and more time delivering exceptional patient care.”\n“This is the largest investment in a generation to help transform hospice facilities across England. From investing in IT systems, upgrading patient rooms to improving gardens and outdoor spaces, this funding will make a real difference to people at the end of their lives.”\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “I’m delighted that the Labour government has allocated this important funding to Katharine House Hospice.\n“Katharine House do a wonderful job at providing support for people with life-limiting conditions and their loved ones. It was great to hear from nurses at the hospice how this government funding will make a real difference – less time filling in forms and more time spent caring for their patients.\nDr Richard Soulsby, Chief Executive of Katharine House Hospice said: “The additional Government funding will be welcomed by all hospices and will help to alleviate stretched finances across the sector. It is extremely positive for hospices that the government has recognised the enormous contribution hospices play in the delivery of end of life care and I very much hope this is the first step towards creating sustainable funding arrangements for hospices in the longer term.\n“We all realise that the need for palliative and end of life care will rise rapidly in the coming decade, and it is important that Government and the NHS see hospices as central to helping to meet this additional demand.”\nOn 26 February the government confirmed the release of £25 million for upgrades and refurbishments. An additional £75 million will be available from April as part of the largest investment in hospices in a generation. The funding will modernise facilities, improve IT systems and ensure patients receive the highest quality care.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-budget-2024/content_8.html": "On October 30, Rachel Reeves, Chancellor of the Exchequer, delivered an Autumn Budget focussed on long term investment and fixing public services, while ensuring working people don’t face higher taxes in their payslips.\nDuring the General Election Campaign, Rachel Reeves got a set of keys cut at Timpson on Stafford High Street, which are now proudly framed in Number 11 at the time of the Autumn Budget (pictured).\nLeigh Ingham, MP for Stafford said: “The keys on display in Number 11, which were cut in Timpson on Stafford High Street, symbolise Rachel Reeves’ plan to unlock long-term economic growth. Many of the measures announced in the Autumn Budget will impact people locally, be it by putting more money in their pockets or improving local NHS services or schools.”\nCommenting on the budget, Leigh Ingham, MP for Stafford, Eccleshall, and the villages, said:\n“The rise in the National Living Wage to £12.21 per hour will put more money in the pockets of working people across Stafford, Eccleshall, and the villages. The rise in the National Minimum Wage for 18-21-year-olds – the largest increase in the rate on record – will help our young people be more independent and financially stable.\n“More than 12 million pensioners will be pleased to see up to a £475 rise from the preservation of the State Pension Triple Lock. Meanwhile, we’ve extended the Household Support Fund to help those most in need.\n“The budget announced an extra £25.6 billion over two years for the NHS, to cut waiting lists with an extra 40,000 elective appointments a week. This is fantastic news – it’s no secret that health services in Stafford are struggling. Alongside the budget announcements, I’m working hard to improve our local NHS services, including campaigning for an Urgent Treatment Centre at County Hospital to take the pressure off our A&E.\n“I was particularly pleased to see the changes to Carer’s Allowance, an issue that many people have raised with me, raising the earnings cap by the largest amount since it was introduced.\n“Meanwhile, the core schools’ budget will increase by £2.3 billion, with investment in breakfast clubs tripling and, vitally, there will be £1 billion for SEND provision. I have heard from families across the constituency about SEND failures over the last 14 years, many who have deeply upsetting stories, and I will be working hard to ensure our system helps protect and nurture local children’s development.”\nCommenting on the budget, Rachel Reeves, Chancellor of the Exchequer, said\n“This is not the first time it has fallen to the Labour Party to restore economic stability and rebuild our public services. I have had to make tough decisions, but I will never shy away from taking the action necessary to get our economy growing again whilst protecting working people.\n“There are no shortcuts to economic growth. We must invest in every part of this country, in every region and nation, to create wealth, boost opportunity, and improve living standards for working people across the country.”\nFor more information on the budget, visit: Chancellor chooses a Budget to rebuild Britain – GOV.UK",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_celebrating-staffords-volunteers/content_6.html": "When I first moved here, one of the things that struck me most about Stafford, Eccleshall, and the villages was its community spirit. I’m continually impressed by how much people stand up for and support each other.\nIn particular, community libraries, charities, and faith groups have stepped up during difficult times. Brilliantly, this is being recognised on a national scale with the Signposts Services very recently being awarded a King’s Award for Voluntary Service, and Rising Brook Community Managed Library winning a national award for its community engagement. I wish them both a huge congratulations.\nWorking together for the best of the community\nRecognising their importance locally, I’ve met with a number of community organisations and charities to find out more about the work they do and offer my support.\nI’ve been on so many meaningful visits to charities, including Katharine House Hospice, Stafford and Cannock Hospital League of Friends, and Staffordshire Women’s Aid – to name just a few – all who are doing great work.\nThese visits help me build a more detailed understanding of the support available, so that when constituents approach my office, my team can signpost them to local services to access as much help as possible.\nAn example of where collaboration is working well is my close working relationship with House of Bread, a charity that offers meals, advice, and support, to anyone who needs it. One constituent we recently referred to House of Bread said that meeting with them had changed their life.\nI’m also working closely with Citizen’s Advice Bureau (CAB), to help sure that local people are receiving all the benefits they are entitled to. I’ve run a dedicated pensions advice surgery, alongside CAB, to support pensioners with their benefits applications. I plan to run several future sessions alongside CAB and will share the dates soon.\nThe huge contribution of the faith community\nAcross the constituency, many faith groups have acted as community hubs, offering food banks, activity groups, and more. I recently met with a large group of church leaders and representatives, alongside leaders and directors of local Christian organisations.\nOrganised by the LOVE Stafford group, this meeting gave me a platform to meet, thank, and get to know more about the work they are doing in the community, while sharing my views and ideas on how I could support their work.\nAbout the meeting, Rev Ron Davis, Chair of LOVE Stafford, said: “We certainly offer Leigh the ongoing support and help of the Christian faith community in Stafford.”\nI have also visited Stafford Muslim Prayer Hall to offer my support and collaboration both in the fight against Islamophobia and to gain an understanding of its community activity.\nBy working together with local charities and organisations, we can offer wrap around support to vulnerable people across the constituency. Our community spirit is strong, and together we can do so much.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_sandon-road-flooding-taskforce/content_29.html": "In March 2025, Leigh Ingham MP convened the inaugural meeting of the Sandon Road Flooding Taskforce, created to push for a long-term solution, and better interim solutions, to the flooding on Sandon Road in Stafford.\nAttended by representatives from the Environment Agency, Severn Trent, and Staffordshire County Council, alongside local business owners, the meeting discussed how a cross-agency approach could best deliver a much-needed long term solution, while better addressing the flooding in the interim.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “Following my open forum with 65 residents, the Taskforce meeting was a constructive opportunity to raise the findings with the relevant agencies and discuss how we can best support residents by working as a cross-agency group.”\nThis week, the Government also announced funding for 1,000 projects being built or maintained in England as part of the record £2.65bn investment in England’s flood defences. Two projects in Stafford have received a combined £279,000 funding for property level flood resilience, including Sandyford Brook.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said: “While it’s brilliant to have been awarded funding for property level flood resilience in Stafford as part of the Government’s £2.65bn investment in flood defences, it’s not a total solution.\n“To fully address this pervasive flooding, I am advocating for shift in the way flooding funding is allocated. I will continue to make strong representations to government Ministers for a change to the current funding model and will keep residents updated on my work.”\nIn January 2025, Leigh Ingham MP asked Prime Minister Keir Starmer about his plans for investing into flooding infrastructure during her first Prime Minister’s Question. The MP has ongoing meetings with Floods Minister Emma Hardy, who is aware of the issue and the feedback from residents.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_articles/content_24.html": "Skip to content\nHome\nMy Work\nLatest News\nContact\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_my-work/content_2.html": "As the daughter of a bricklayer and factory worker, I was born and grew up in Burnley. I was proud to be the first in my family to go to university, studying politics at the University of Lincoln.\nSince then, I’ve worked in roles across the country in the Local Authority, private, and charity sectors, and spent many years working with young people to help get their voices heard.\nI was first elected as a Councillor between 2023, where I was elected Deputy Leader for the Labour group and cabinet member for Communities.\nIt was here I realised that some of the things I wanted to change needed to happen at a national level, which led me to stand for, and become elected as, Labour MP for Stafford in the 2024 General Election.\nI’m campaigning for an urgent treatment centre (UTC) at County Hospital. This would take pressure off our A&E and make emergency care more easily understandable and accessible.\nTo reduce time-consuming paperwork and make appointment booking more efficient, I’m advocating for a new, functioning, electronic patient record system for County Hospital. This would free up staff time, which is currently spent on administration, and move it instead to delivery and patient services.\nI have also been working closely with patients and staff at Holmcroft Surgery to improve patient care at the practice.\nFlooding is a pervasive issue across the constituency that is only getting worse. Following my public meeting attended by 65 residents, I formed the Sandon Road Flooding Taskforce, a cross-agency group pushing for a solution, and supporting residents and businesses affected by the Sandon Road flooding.\nI’m advocating for a change to the way flooding funding is allocated, so more complex cases like Sandon Road can access much needed funding. I’ve raised the issues at Sandon Road directly with Prime Minister Keir Starmer, as well as Floods Minister Emma Hardy.\nStafford is a proud county town with many wonderful businesses and visitor attractions, including the Gatehouse Theatre and Staffordshire History Centre, and it’s important our high street reflects that.\nI’m working with Stafford Borough Council, businesses, and residents to regenerate our high street, so we can create a vibrant, accessible high street that attracts both residents and visitors.\nI’m advocating to reform our broken SEND system, and I’ve run events with SEND parents and carers to listen to their feedback and raised the issues in parliament and with relevant bodies.\nI believe every child deserves the right to play. I’ve been working with local campaign group Inclusive Parks in Stafford to improve the accessibility of parks in the constituency.\nWhile home ownership is a dream for many, for those in leasehold arrangements, home ownership can fall well short of what they imagined. For example, essential maintenance, deteriorating grounds, or safety issues left unaddressed.\nI’m working with residents across the constituency to campaign for better services and to ensure these issues are addressed.\nNationally, I’m advocating for changes to the leasehold system to give people more control of their homes.\nIf there’s anything else you think I should be working on, please contact me.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_stafford-college-funding/content_7.html": "Leigh Ingham MP is celebrating that the Labour Government has awarded Newcastle and Stafford Colleges Group (NSCG) £2.6 million in funding to support renovations at the Stafford College campus.\nThe investment forms part of a wider £302 million allocation through the Further Education College Condition Allocation (FECCA), which is being distributed across 179 college groups in England. Colleges have the discretion to determine how best to use their funding, enabling them to drive economic growth and meet the specific needs of their local communities.\nNSCG’s funding will be used to renovate the Grade II listed Tenterbanks building, a key feature of the Stafford campus. Built in 1937, the three storey, red brick structure holds historical and cultural significance in the local area and the planned refurbishment will be completed sensitively to ensure original features are retained, whilst updating and modernising teaching spaces for learners and staff.\nCraig Hodgson, Principal and Chief Executive of NSCG, said: “We are thrilled to have been awarded grant funding from the Department of Education to further enhance our college estate for the benefit of our learners. The funding will be used for improvements to our beautiful Grade II listed building, Tenterbanks, allowing us to enhance and modernise the building sympathetically, creating a dynamic learning environment that is fit for the future.”\nThe funding was first announced by Chancellor Rachel Reeves as part of the Autumn budget in October 2024, making it the first funding package for further education (FE) colleges in two years. Funding allocations were based on a range of criteria, including learning hours from the previous academic year, space requirements for each subject, residential space and local construction costs.\nLeigh Ingham, MP for Stafford, Eccleshall and the villages, said: “This outstanding College is so crucial to the talent pipeline locally, and I’m proud that the Government is consistently putting skills at the front of its agenda.”\nSkills Minister, Jacqui Smith, said: “FE colleges are vital to our mission to grow the economy under our Plan for Change. They are at the heart of training the next generation of skilled workers. But the FE college estate we inherited is in need of repairs to extend the life of college buildings. This funding addresses these issues, allowing colleges to focus on what they do best: breaking down barriers to opportunity by teaching the next generation in buildings fit for purpose.”\nPlans are currently being developed and works on the Tenterbanks building are expected to be phased over the next two years to minimise disruption to teaching and learning.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-elected-as-chair-of-parliamentary-group-for-theatre/content_26.html": "Skip to content\nHome\nMy Work\nLatest News\nContact\nLeigh Ingham MP to Chair parliamentary group for theatre\nPrev\nPrevious\nLeigh Ingham MP to host three NHS consultation events\nNext\nLeigh Ingham MP signs Holocaust Educational Trust Book of Commitment\nNext\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_terminally-ill-adults-end-of-life-bill/content_14.html": "On November 29th, 2024, MPs — including myself — voted on an important piece of legislation, The Terminally Ill Adults (End of Life Bill). If passed, the Bill would give terminally ill adults, with less than six months to live, in England and Wales the option to request assistance to end their own life.\nWhat happened at the debate?\nThe debate and vote on Friday was for the Second Reading of the bill. The Bill passed by 330 votes to 275 votes, which means it will progress to a Third Reading (a final vote) and go through a Committee Stage and Report Stage for further amendments, scrutiny, and discussion.\nIt’s important to note that today’s vote does not mean the Bill becomes law, but it is a strong indication of its likelihood.\nHow was the bill introduced?\nKim Leadbeater, the Labour MP for Spen Valley, introduced The Terminally Ill Adults (End of Life Bill) as a Private Members’ Bill. Private Members’ Bills are not part of government legislation, but public bills introduced by MPs and Lords who are not government ministers. For this Bill, MPs were able to vote entirely with their conscience.\nHow did I come to my decision?\nVoting on this bill was an important decision, and with strong views on both sides, it was not a responsibility I took lightly.\nInitially, I had concerns about the safeguards in place, and whether these mechanisms would be robust enough to protect vulnerable people from coercion or pressure. Having reviewed the full text of the Bill and listened closely to the points raised by my Parliamentary colleagues, constituents, and campaign groups, I believe the safeguards in the Bill provide strong protections and provisions to protect vulnerable people.\nI want to thank everyone who shared their personal stories with me. Many of these were deeply moving, and I know it wasn’t easy to discuss some of your most emotional and difficult experiences with me. I also want to thank all the organisations — healthcare providers, charities, and faith groups — who have given me their perspectives.\nIt was the discussions I had with many of you that confirmed for me that voting for this this Bill is right decision.\nWhat safeguards are in place?\nThe legislation states that only terminally ill adults with less than six months left to live would be eligible. They must be a resident of England or Wales and be registered with a GP for at least 12 months (a separate bill is under discussion in Scotland).\nThe terminally ill individual must have the mental capacity to make the choice and be deemed to have expressed a clear, settled, and informed wish, free from coercion or pressure. Other requirements include two separate declarations, witnessed and signed, about their intention, and agreement from two separate doctors and a High Court Judge.\nThe individual would administer the medication themselves, with no doctor or anyone else able to administer the substance to the terminally ill person. Doctors would not be obliged to take part in the process.\nThe bill would also make coercion an offence with a possible punishment of 14 years in prison.\nWhat happens next?\nBefore the Bill goes to a Third Reading (a final vote) it will go through a Committee Stage and Report Stage for further amendments, scrutiny, and discussion. I plan to listen to these debates and further scrutinise the Bill before offering my continued support.\nIn the meantime, I will continue to champion improved palliative and hospice care to ensure those facing the end of their lives receive compassionate and comprehensive care.\nOnce again, I want to thank everyone who shared their stories — I know it wasn’t easy. If anyone wants to speak to me further, please email [email protected].",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_contact-me/content_19.html": "Contact my constituency office via one of the methods below and we will get back in touch.\nMy team in the Stafford office can often help without you having to attend an advice surgery.\nIn most cases an appointment is not required, and it is usually quicker to get in touch by email so we can start work right away.\n[email protected]\n01785 59 49 49\nLeigh Ingham MP, House of Commons, London, SW1A 0AA",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-launches-coffee-mornings/content_11.html": "Leigh Ingham MP launched a series of monthly meet the MP coffee mornings in February, with the first event taking place at Holmcroft Youth and Community Centre in Stafford. Residents of the Marston Grange Estate were invited to discuss issues specific to their community, with more than 35 people attending to voice their concerns.\nLeigh Ingham MP will host regular coffee mornings in a different area of the constituency, with events planned in Eccleshall, Loggerheads, and Gnosall, as well as various areas of Stafford. Each event will have an agenda that covers the issues most frequently raised by residents, such as public transport, health services, antisocial behaviour, and SEND.\nAt the recent Marston Grange event, residents were able to raise multiple concerns directly with the MP, who can now support them both in parliament and locally.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages said, “Up to now, I’ve been running regular surgeries to help constituents with 1-to-1 issues. However, many of the correspondence I receive is about issues at community level, so hosting these events will be an opportunity to bring communities together to work collaboratively on solutions.\n“The events will rotate around the constituency to give those living Stafford, and more rural areas, the opportunity to sign up.”\nThe next event will take place on February 28th in the Wildwood area and invitations will be sent to residents in the post soon.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk/content_1.html": "LEIGH INGHAM MP\nMP FOR STAFFORD, ECCLESHALL & THE VILLAGES\nThere is so much potential in our local communities. I am working hard to unlock this and make sure our interests are represented in Westminster.\nLearn more about me and my work here.\nStay updated on social media:\nHow can I help you as your MP?\nAs your MP, I want to ensure I represent you in any way I can.\nIf you need my help, please get in touch with me and I will do my best to support you.\n… and much more\nWant to hear from me? Sign up to my mailing list to receive updates.\nThe constituency covers the towns of Stafford and Eccleshall and many wonderful villages.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_debate-on-access-to-sport/content_30.html": "Following a visit to Sir Graham Balfour School in Stafford, Leigh Ingham MP hosted a parliamentary debate in the House of Commons on access to sport and physical education (PE), a subject raised by one of the school’s students, Tane, during her visit.\nAttended by MPs from across the House, the Backbench Business debate covered the physical and mental health benefits of PE for young people and explored sustainable funding options and embedding access to sport as part of the National Curriculum Review.\nAfter meeting Leigh Ingham MP at school, Tane, a student at Sir Graham Balfour School, wrote to the MP to highlight his thoughts on the benefits of sport for young people: “Exercise doesn’t just chemically make you feel good, it’s great for socialising, raising self-esteem and coping with losing. All life skills that seem a bit ‘missing’ in kids my age since lockdown.”\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages, said, “We must listen to young people like Tane, who have articulated so clearly the need for action, and we must respond with real, lasting change.\n“I called for the debate to highlight how the curriculum review presents a significant opportunity to enhance access to sport and physical education (PE). Access to sport and PE is about more than just keeping children physically fit – it is about giving them the skills, resilience, and confidence to navigate life’s challenges. It is about their mental health, their ability to form friendships, and their capacity to overcome obstacles.\n“If we truly want to build a healthier, more resilient, and more confident generation, then we must take steps to ensure that access to sport and PE is not a privilege, but a right for every child. This means embedding physical activity into the heart of our education system, prioritising it as essential rather than optional. It means ensuring that schools have the support and funding necessary to provide high-quality PE lessons, extracurricular opportunities, and community partnerships that allow young people to engage in sport regardless of their circumstances.\n“I urge the government to take this issue seriously, to commit to sustainable funding, and to ensure that every child, regardless of background, has the opportunity to thrive through sport.”\nThe latest findings from Sport England’s Active Lives Children and Young People Survey provide invaluable insight into the state of physical activity among young people in England. These findings confirm that the long-term effects of the Covid-19 pandemic continue to cast a shadow over children’s engagement with sport, their mental well-being, and their future relationship with physical activity.",
  "https_www_leighingham_co_uk_/https_www_leighingham_co_uk_leigh-ingham-mp-welcomes-over-1500-extra-gps-recruited-to-help-end-8am-scramble-and-bring-back-family-doctor/content_22.html": "Landmark new figures published this week show that, thanks to the Labour Government’s action, over 1,500 extra GPs have been recruited since 1st October, with 28 joining practices in the Staffordshire and Stoke-on-Trent ICB.\nLeigh Ingham MP has today welcomed the increased GP capacity that will help increase appointments for residents across Stafford, Eccleshall, and the Villages.\nBringing back the family doctor and ending the 8am scramble for appointments were key manifesto commitments in the General Election. The news of 1,500 extra GPs recruited comes after the Labour Government removed red tape, which prevented surgeries from hiring doctors, soon after coming into office.\nThe recruitment boost, part of the government’s Plan for Change, will help end the scandal of patients in Stafford, Eccleshall, and the villages struggling to see a doctor. People will be more readily able to receive the timely care they deserve, helping to shift healthcare from hospitals to the community, easing pressure on local GPs and cutting waiting lists.\nThe Labour Government has also provided the biggest boost to GP funding in years – an extra £889 million on top of the existing budget for general practice along with new reforms to free up GPs from red tape and box-ticking targets so they can spend more time caring for patients.\nSince Labour came into power, the Government has delivered over two million extra appointments, meeting its target seven months early, and the waiting list has fallen five months running, down by 193,000.\nLeigh Ingham, MP for Stafford, Eccleshall, and the villages, said: “When I knock on doors in our community, residents regularly vent their frustration about the 8am scramble and the difficulty that they have in getting a GP appointment.\n“I promised local people that we would improve their access to GP appointments, and I’m delighted to see that this is already taking shape, less than a year after the General Election.\n“People often say politicians are all the same – but this shows we aren’t. This is the difference a Labour Government makes to people’s lives.”\nHealth and Social Care Secretary, Wes Streeting, said: “We inherited a ludicrous situation where patients couldn’t get a GP appointment, while GPs couldn’t get a job. By cutting red tape and investing more in our NHS, we have put an extra 1,503 GPs into general practice to deliver more appointments.\n“The extra investment and reforms we have made will allow patients to book appointments more easily, to help bring back the family doctor and end the 8am scramble.\n“It is only because of the necessary decisions we took to increase employer National Insurance that we are able to recruit more GPs and deliver better services for patients. The extra investment and reform this government is making, as part of its Plan for Change, will get the NHS back on its feet and make it fit for the future.”"
}