{
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_CONTACT/content_10.html": "Contact Rachel\nYou can contact me as follows:\nBY E-MAIL:\nMy email address is: rachel [at] rachelelnaugh.com\nAs you can imagine, I receive many hundreds of emails. Your email has very little chance of reaching my attention unless you put NEW ENQUIRY in the subject title of your email (which puts it into a special folder in my Source business operating CRM system which I regularly look at).\nVIA SOCIAL MEDIA\nIf you want to engage with me on a regular basis then you are best connecting to me via Telegram https://t.me/rachelspeaksout\nAlthough you will find profiles for me on LinkedIn Facebook and Twitter I am no longer active on these platforms.\nHi Rachel\nI was wondering how to get involved with your Inner Sanctum project.\nThanks\njohn\nHi Rachel,\nI’m listening to you on Richie Allen, great interview. You might like my work up at http://www.lesser-reset.com (counter-Great Reset). Everything from art to political science.\nBest wishes,\nRyan Murtha\nDear Rachel Enlough,\nI too have given up on trying to explain to people, friends etcetera about the evil of how this world is run by around 8 thousand psychopaths. Those ‘people’ are based on 13 elite inbred families who change names frequently. Through the last 10 thousand years, they have remodelled the world of humanity, and pretty much most animal (even by shooting them for fun) and vegetation life! And, by default created rights for us and then sold some of them back to us, but we never returned home through usuary and feudalism (on-going). What you spoke about on your Youtube channel and in particular your recent contribution to the Richie Allen Show resonated with me strongly. Fundamentally, living our lives in accordance with not our natural evolution and talents and instead of living our lives as slaves to a debt-based economy chasing-a -life? We lost love and gained straight lines and symmetry. If you look around the stately homes which we peasants were coerced into building for them and then cutting the trees into lollypop shapes is ridiculous. Who or what are they? Further discussion?\nI would like to friend you on Facebook and Twitter to discuss an alternative way of life and bring together families and communities on lands without protection racketeers and not be beholden to their agents’ Governments!\nI am retired and bored witless and would like to present to you my innovation of a commercial Hi-Fi system which I will build at home as a cottage industry around four sets a month hand-built. These are speakers and amplifier that are a blend of vintage and new tech that will retail for £2,000 (build cost £500) and sound much better than systems costing £20,000 plus! I sold a few pairs to recording studios and a BBC sound recording engineer. I had backing from a group of Surrey stockbrokers in 1995 and they went bust! I’m not looking for finance but a little mentoring like “they sound good” and “come along Ian-get on with it” The best Marketing advice I ever had was from Patrick Barring who told me to ask potential customers what they want to buy and now I’ve designed such based on my early prototypes.\nGreetings from Muswell Hill Ian Hilpus\nHi Rachel\nThanks for all you do I would like to follow you on telegram if that is possible maybe you can send me an invite link\nMany thanks\nSean\nGood morning Rachel,\nI am truly enlightened by you just from listening to the podcast with James Delingpole and I am now more determined than ever to get a community group up and running here in Pevensey Bay, Sussex, to challenge the propaganda being pummelled on us. I need some guidance though as I’m more of a practical man than an IT man. I have signed up to your email and zoom contacts and will get instruction on zoom later.\nNow I need to listen to the rest of the podcast before enjoying the fresh air and life for the rest of the day.\nThank you.\nTony Rose\n60 yr young retired fireman, father of only 4 sons and Grandad to 7 wonderful Grandchildren.\nPs protonmail couldn’t recognise the email address I typed in for you?\nDear Rachel, I’ve recently joined your telegram page because a friend mentioned and recommended I join – specifically for support around setting up eco-villages. I’ve just commissioned a website to be built so when this happens please can I pitch my ideas to you? You will not be disappointed- my aim is to bring togetjer the elite in free / critical thinkers to build an alliance and put my special organising methods to work. I’ve waited my whole life to do this. I really need your support. Much love and blessings SoL sssohpal1@yahoo.co.uk\nHello Rachel,\nRE DELINGPOD INTERVIEW\nI just wanted to thank you for your interview with James the other day.\nYour description of the psychic/psychological/energetic dimensions of our current catastrophe was masterful. Really clear and accessible. A joy to listen to.\nMany thanks and warm wishes,\nCatherine\nWell done for speaking out today against the experimental vaccination of children. Stay strong!!\nProject sovereign\nReally interested in putting money together with like minded people to build a community a friend told me about thus project would love some info on your project\nMuch blessings Lorraine\nThink you are quite right .\nBut I think hanging is too good for ( misnomer if ever there was one) Whitty. An obvious single childless soulless heartless liar.\nThank you for putting your head up when you didn’t need the stick. I heard you on the richie allen show god bless you and us all who can see what is happening and what they want to do to our kids and grandkids. Kind regards.\nA worried grandad.\nSigning up for your newsletter and info re Zoom calls, thank you for everything you do xx\nNew Enquiry\nHi Rachel….. Blessings on your work\nA while back was a long video about Free Masons which I only watched half. Is there any way I ca0n get that back.\nRegards Nin\nThank you for standing up for people and encouraging others to do so.\nWe have to come together.\nI feel very lonely in our little (ver conservative) town.\nMy wife and I (as well as our 18 year old son) are very ‘awake’ but there’s no support / community group here (Louth, Lincolnshire).\nBy the way, we LOVE your part of the UK but the last time we visited the peak district the weather was miserable and we hope to get back there again one day.\nLook after yourself and your family and I look forward to watching more of your videos.\nMartin\nHi Rachel,\nWell done on what you’re attempting to achieve at Cressbrook Dale. I’m sure you’ll be successful. So many are still blind or wilfully ignorant about the great reset and what’s to come if we don’t put a stop to it and build our own communities and to fight for humanity. I used to live in Wardlow and I would take my dog to Cressbrook Dale every day for a walk and know from speaking with the locals in Wardlow that they just don’t want to know the truth and I was labelled as ‘odd’ and as a ‘conspiracy theorist’. In January 2022, my landlady moved back into her property in Wardlow and my little dog and I have been struggling since to find alternative accommodation (pet friendly) and council are a waste of time and told me to re-home my dog (never!!) and go to a hostel, so for the past nearly 9 months we’ve been camping and it’s been awful and exhausting. With autumn/winter approaching, I was wondering if you knew of anyone who either has a spare room (pet friendly) in their home or a rental? I would love to become part of this adventure with you all and it would be so good to be amongst those who are stepping out of the current system and becoming self-sufficient. To be with my tribe, so to speak. Or if anyone reading my comment can help us out with a room or rental, that would be great. I’m a hard worker but as the months have gone by living in a small tent, I’m exhausted and so is my little dog, and we’d love to find a place together to rest and then help create a better world and help stop the great reset.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_ultimate-business-beta-test/content_9.html": "!!!!! STOP PRESS !!!!!\nThe ‘Ultimate Business’ video programme is to be called ‘A Dragon’s Guide to Business’\nYou are invited to become one of the Beta Testers for my new online video programme which goes live on 28 April 2025, in which I will share with you all the key business, marketing and metaphysical teachings I have learned from a lifetime in business – as well as through mentoring many thousands of small business owners via my books and programmes over the past two decades.\nYou’ll be taken on a 28 day journey of transformation, designed to show you how to create effortless financial flow doing what you love\nYou’ll discover:\n- The Number 1 reason why small businesses fail\n- Simple tools to assist you in manifesting magical results ~ effortlessly\n- Why you don’t need any funding to get started/expand to the next level\n- The powerful principles of Magnetic Marketing\n- How to exponentially accelerate your business\n- Inspirational insights around pricing\n- Ways to transcend procrastination and indecision\n- How to keep the three legs of the business stool strong and stable\n- The biggest marketing mistake small businesses make\n- How to recognise the ‘Yeah buts’ and other self-sabotaging unhelpful beliefs\n- Inspiration via a multitude of practical examples/case studies/business stories\n…plus much, much more.\nThese are teachings which will save you hours and hours of wasted time, as well as thousands in wasted money\nAs a Beta Tester you will receive the first cut versions of the 28 days of video content via email (one a day for 28 days, from early on Monday 28 April 2025) to watch at your leisure – as well as invitations to Zoom discussion meetings [every Wednesday at 12noon UK time from 7 May for 4 weeks] + a Telegram discussion group where I will invite everyone involved to share their feedback.\nI will also be on hand to offer advice and guidance via these group sessions and Telegram Group.\nYou’ll also receive the final ‘Alpha’ version of the video programme when it goes live later this year.\nYour conscious contribution of £99 is gratefully appreciated and will be applied towards the design and production of the programme.\nPlease use the Paypal button below:\nAlternatively please send payment via Bank Transfer to:\n04-00-03\n23622922\nRachel Elnaugh-LOVE\n… being sure the send an email to confirm your payment to Rachel [at] rachelelnaugh.com with Ultimate Business in the subject title.\nThe future is all about co-creative collaboration and your support is much appreciated.\nI look forward to sharing this amazing content with you!\nLOVE\nRachel x",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_intuitive-mentoring/content_8.html": "One to One Intuitive Mentoring\nIf you would like clarity around what may be blocking the ‘flow’ around your business, or money generally, then please read on…\nOver the past 15 years I have assisted many thousands of people on their life journey – especially around business, prosperity and life purpose – via my books, workshops, seminars, online programmes, events and one-to-one mentoring sessions.\nI have developed the ability to ‘see’ beyond what is manifesting in the 3D world into the energetic dynamics which are creating your blocks to effortless ‘flow’. (If everything seems like a struggle it really is time to stop swimming and ask for help.)\nIn my experience it is essential to clear and transmute these inner blocks – which end up creating greater and greater chaos in our external circumstances if they are ignored.\nEvery one-to-one session is different, but I use a blend of skills acquired over the years to help bring you by the end of our session sparkling clarity on the way ahead.\n“Thanks so much Rachel for your courage, support, guidance, poking, teaching. I can honestly say that you are one of the most profound teachers I have ever learnt from and I feel blessed to be so deep into this journey so early in my life. ” – Julia Pennington, Pioneer in the Justice Sector\nOpt for either an online session, a face to face session (typically weekdays between 11am and 4pm) or a site visit (Thursdays/Fridays only) – where I will also look at the feng shui of what is going on in your home or office/business premises.\n“I highly recommend… it wasn’t like any other type of feng shui I’d ever encountered… the things that are shifting within me since are incredible and various happenings since… that I am still trying to formulate words for. It was profound.” – Jo Simpson, Executive Leadership Coach, Speaker & Author www.josimpson.com\nUse the dropdown box on the PayPal button to select your choice from the following options:\nONE TO ONE INTUITIVE MENTORING SESSION (ONLINE) £175\nA sixty to ninety minute one-to-one session with Rachel via Zoom video conferencing (very easy to use) – after which you’ll receive a recording of the session\nONE TO ONE INTUITIVE MENTORING SESSION (FACE TO FACE) £295\nA ninety minute to two hour one-to-one session with Rachel either at her office in Bakewell, Derbyshire (or in London on certain days of the month)\nONE TO ONE INTUITIVE MENTORING SESSION (SITE VISIT) £750 + travel expenses\nA three hour one-to-one session in your home or offices/business premises followed up with a simple report of key findings/recommendations (Travel expenses are calculated at 50p per mile from and back to DE45) Pay a deposit of £250 to book a session and the balance will be invoiced, payable in advance of the visit.\nI look forward to being of service to you.\nRachel x\nPS If your financial tide is out and cashflow is an issue I am happy to offer flexible payment terms. Please email me: rachel [at] rachelelnaugh.com with MENTORING in the title.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_contact/content_4.html": "Contact Rachel\nYou can contact me as follows:\nBY E-MAIL:\nMy email address is: rachel [at] rachelelnaugh.com\nAs you can imagine, I receive many hundreds of emails. Your email has very little chance of reaching my attention unless you put NEW ENQUIRY in the subject title of your email (which puts it into a special folder in my Source business operating CRM system which I regularly look at).\nVIA SOCIAL MEDIA\nIf you want to engage with me on a regular basis then you are best connecting to me via Telegram https://t.me/rachelspeaksout\nAlthough you will find profiles for me on LinkedIn Facebook and Twitter I am no longer active on these platforms.\nHi Rachel\nI was wondering how to get involved with your Inner Sanctum project.\nThanks\njohn\nHi Rachel,\nI’m listening to you on Richie Allen, great interview. You might like my work up at http://www.lesser-reset.com (counter-Great Reset). Everything from art to political science.\nBest wishes,\nRyan Murtha\nDear Rachel Enlough,\nI too have given up on trying to explain to people, friends etcetera about the evil of how this world is run by around 8 thousand psychopaths. Those ‘people’ are based on 13 elite inbred families who change names frequently. Through the last 10 thousand years, they have remodelled the world of humanity, and pretty much most animal (even by shooting them for fun) and vegetation life! And, by default created rights for us and then sold some of them back to us, but we never returned home through usuary and feudalism (on-going). What you spoke about on your Youtube channel and in particular your recent contribution to the Richie Allen Show resonated with me strongly. Fundamentally, living our lives in accordance with not our natural evolution and talents and instead of living our lives as slaves to a debt-based economy chasing-a -life? We lost love and gained straight lines and symmetry. If you look around the stately homes which we peasants were coerced into building for them and then cutting the trees into lollypop shapes is ridiculous. Who or what are they? Further discussion?\nI would like to friend you on Facebook and Twitter to discuss an alternative way of life and bring together families and communities on lands without protection racketeers and not be beholden to their agents’ Governments!\nI am retired and bored witless and would like to present to you my innovation of a commercial Hi-Fi system which I will build at home as a cottage industry around four sets a month hand-built. These are speakers and amplifier that are a blend of vintage and new tech that will retail for £2,000 (build cost £500) and sound much better than systems costing £20,000 plus! I sold a few pairs to recording studios and a BBC sound recording engineer. I had backing from a group of Surrey stockbrokers in 1995 and they went bust! I’m not looking for finance but a little mentoring like “they sound good” and “come along Ian-get on with it” The best Marketing advice I ever had was from Patrick Barring who told me to ask potential customers what they want to buy and now I’ve designed such based on my early prototypes.\nGreetings from Muswell Hill Ian Hilpus\nHi Rachel\nThanks for all you do I would like to follow you on telegram if that is possible maybe you can send me an invite link\nMany thanks\nSean\nGood morning Rachel,\nI am truly enlightened by you just from listening to the podcast with James Delingpole and I am now more determined than ever to get a community group up and running here in Pevensey Bay, Sussex, to challenge the propaganda being pummelled on us. I need some guidance though as I’m more of a practical man than an IT man. I have signed up to your email and zoom contacts and will get instruction on zoom later.\nNow I need to listen to the rest of the podcast before enjoying the fresh air and life for the rest of the day.\nThank you.\nTony Rose\n60 yr young retired fireman, father of only 4 sons and Grandad to 7 wonderful Grandchildren.\nPs protonmail couldn’t recognise the email address I typed in for you?\nDear Rachel, I’ve recently joined your telegram page because a friend mentioned and recommended I join – specifically for support around setting up eco-villages. I’ve just commissioned a website to be built so when this happens please can I pitch my ideas to you? You will not be disappointed- my aim is to bring togetjer the elite in free / critical thinkers to build an alliance and put my special organising methods to work. I’ve waited my whole life to do this. I really need your support. Much love and blessings SoL sssohpal1@yahoo.co.uk\nHello Rachel,\nRE DELINGPOD INTERVIEW\nI just wanted to thank you for your interview with James the other day.\nYour description of the psychic/psychological/energetic dimensions of our current catastrophe was masterful. Really clear and accessible. A joy to listen to.\nMany thanks and warm wishes,\nCatherine\nWell done for speaking out today against the experimental vaccination of children. Stay strong!!\nProject sovereign\nReally interested in putting money together with like minded people to build a community a friend told me about thus project would love some info on your project\nMuch blessings Lorraine\nThink you are quite right .\nBut I think hanging is too good for ( misnomer if ever there was one) Whitty. An obvious single childless soulless heartless liar.\nThank you for putting your head up when you didn’t need the stick. I heard you on the richie allen show god bless you and us all who can see what is happening and what they want to do to our kids and grandkids. Kind regards.\nA worried grandad.\nSigning up for your newsletter and info re Zoom calls, thank you for everything you do xx\nNew Enquiry\nHi Rachel….. Blessings on your work\nA while back was a long video about Free Masons which I only watched half. Is there any way I ca0n get that back.\nRegards Nin\nThank you for standing up for people and encouraging others to do so.\nWe have to come together.\nI feel very lonely in our little (ver conservative) town.\nMy wife and I (as well as our 18 year old son) are very ‘awake’ but there’s no support / community group here (Louth, Lincolnshire).\nBy the way, we LOVE your part of the UK but the last time we visited the peak district the weather was miserable and we hope to get back there again one day.\nLook after yourself and your family and I look forward to watching more of your videos.\nMartin\nHi Rachel,\nWell done on what you’re attempting to achieve at Cressbrook Dale. I’m sure you’ll be successful. So many are still blind or wilfully ignorant about the great reset and what’s to come if we don’t put a stop to it and build our own communities and to fight for humanity. I used to live in Wardlow and I would take my dog to Cressbrook Dale every day for a walk and know from speaking with the locals in Wardlow that they just don’t want to know the truth and I was labelled as ‘odd’ and as a ‘conspiracy theorist’. In January 2022, my landlady moved back into her property in Wardlow and my little dog and I have been struggling since to find alternative accommodation (pet friendly) and council are a waste of time and told me to re-home my dog (never!!) and go to a hostel, so for the past nearly 9 months we’ve been camping and it’s been awful and exhausting. With autumn/winter approaching, I was wondering if you knew of anyone who either has a spare room (pet friendly) in their home or a rental? I would love to become part of this adventure with you all and it would be so good to be amongst those who are stepping out of the current system and becoming self-sufficient. To be with my tribe, so to speak. Or if anyone reading my comment can help us out with a room or rental, that would be great. I’m a hard worker but as the months have gone by living in a small tent, I’m exhausted and so is my little dog, and we’d love to find a place together to rest and then help create a better world and help stop the great reset.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_home_biography/content_3.html": "Biography\nSHORT BIO\nFormer BBCTV Dragons’ Den ‘Dragon’, Rachel Elnaugh-LOVE is the British entrepreneur who created the £multi-million market leading ‘Red Letter Days’ experience brand. She is now a business speaker, business mentor, co-creator of the digital publishing and marketing platform for evolutionaries www.source.tv and author of ‘Business Nightmares‘, ‘Prosperity‘ and ‘LIBERATION‘. In June 2022 Rachel co-created a conscious community which crowdfunded the acquisition of 53 acres of beautiful, magical land at Cressbrook Dale in the Peak District.\nRachel is based in Bakewell, Derbyshire\no\nLONG BIOGRAPHY\nRachel Elnaugh-LOVE is the award winning entrepreneur whose first business was the market leading ‘experiences’ brand Red Letter Days, which she created at the age of 24 and grew from nothing, on a shoestring budget, into a £multi-million turnover household name, which at its height was making £1million profit a year. In 2000 Red Letter Days was acknowledged by Mintel to be the creator of the new UK experiences industry – by then worth £250million per annum.\nThis won Rachel an Ernst & Young Entrepreneur of the Year Award in 2002 and she was shortlisted for the 2001 Veuve Clicquot Businesswoman of the Year Award along with Barbara Cassani, Jo Malone, Sly Bailey and Chey Garland.\nAs a result of being on the Awards circuit, in 2002 she was invited by the BBC to be part of a new business show they were formulating called ‘Dragons’ Den‘.\nThe pilot for Dragons’ Den was filmed in 2003 and the first series was commissioned and filmed in Autumn 2004, airing for the first time in January 2005. Dragons’ Den was a huge success, shortlisted for a BAFTA and very quickly syndicated worldwide. The second series was filmed in May/June/July 2005 and aired in November/December 2005.\nHowever, behind the scenes, Rachel had been struggling to bring Red Letter Days back on track after a disastrous over-expansion in 2002, and despite the business being back in profit and having £3.3million cash at bank it was forced into administration by Barclays Bank on 1 August 2005.\nThanks to her high profile appearance on Dragons’ Den, the crash of Red Letter Days attracted huge media exposure, the story appearing on all the key news channels and in every mainstream newspaper. (The Red Letter Days business was bought out of administration by Rachel’s fellow Dragons Peter Jones and Theo Paphitis and continues to trade.)\nHowever, to paraphrase Napoleon Hill, in every adversity lies the seeds of opportunity and Rachel was invited to speak at many enterprise events about her experiences. She was also commissioned to write a book about the fine line between success and failure in her book ‘Business Nightmares‘ – not just her own story but the story of 20 other successful entrepreneurs who hit problems on their own journey.\nThe timing of the book launch in May 2008 could not have been more fortuitous as in September 2008 the global banking system crashed triggering the current recession and many other business meltdowns. ’Business Nightmares‘ has since become THE handbook for business survival for many struggling entrepreneurs.\nRachel was invited to speak at many enterprise events about her experiences and is now an accomplished professional speaker with experience of speaking at over three hundred events including Harvard University, TEDx, The Scottish Parliament, The Oxford Union Debating Society, The British Library, The National Library Singapore, the Opening of Global Entrepreneurship week in Holland (with Nick Clegg) and the Conservative Party Conference.\nRachel was quickly invited by many entrepreneurs to help them with their own business and she became a mentor to many, creating along the way a series of low cost training programmes and workshops designed to help entrepreneurs struggling to make their business work.\nHer work in helping others lead to a fascination with empowerment and the power of the mind, including fourth dimensional energy principles including quantum physics, metaphysics and the Law of Attraction. In 2010 she travelled to Kuala Lumpur to train in feng shui with leading international feng shui author Grand Master Lillian Too.\nRachel combined her business and marketing knowledge, her experience of going through a financial wipeout together with her knowledge of metaphysics into her acclaimed 2012 low cost video mentoring programme Business Alchemy.\nIn 2011 Rachel co-created the pilot for a new transformational TV brand through which she met Stephen Russell aka Barefoot Doctor. As a result she became Barefoot Doctor’s business manager, publishing his book The Message which was launched at Sadlers Wells in February 2012. Their joint Glastonbury radio show Barefoot and the Dragon topped the ratings during the months it was aired.\nRachel also helped breathe life into The Big Om sound healing concept which took place in Brighton on 12.12.12, triggering a sister London event 12.12.12 One World co-produced by Rachel and Hay House ‘Money Magnet’ author Marie Claire Carlyle.\nThe event (which was also Rachel’s birthday) was a huge success, attracting an audience of over 1,500 people and live-streamed globally.\nThis 12.12.12 event inspired Rachel’s current business venture SourceTV which she co-created in 2013 with Hollywood based TV marketing expert Kevin Stein.\nRachel’s book PROSPERITY was published on 23 April 2016, written during her time living at the £1.75m Grade II listed mansion in Bakewell where she also hosted retreats and workshops .\nOver the past few years Rachel has continued to go deeper on her journey of personal healing and transformation, professional training in Trauma Healing Skills (both Basic and Advanced programmes) with Juliet Yelverton of Healing Waters Glastonbury, and with Dr Gabor Mate in Ireland; training in Natural Wisdom Leadership with Ayni Foundation (Davina MacKail and Nizami Ele), training in Ba Zi and Feng Shui with Richard Ashworth, as well as several spiritual pilgrimages to Peru (to work with Shamans and the great plant medicine teachers Ayahuasca and San Pedro – both in the mountains of the Andes and the jungle at Sipapu) and to Egypt, experiencing the heartbeat of Gaia herself resonating in the King’s Chamber of the Great Pyramid.\nThese teachings have allowed Rachel to take her Professional Speaking, One to One Mentoring and Group Mentoring programmes to new levels of insight and transformation for her clients/audiences.\nIn June 2022 Rachel co-created a conscious community who crowdfunded the acquisition of 53 acres of beautiful, magical land at Cressbrook Dale in the Peak District. Visit www.lovecressbrookdale.com for more information.\nRachel’s third book LIBERATION was published in November 2023. You can get one of the signed, limited edition hardback copies at www.source.tv/liberation\nRachel is mother to five amazing sons MJ (aka shamanic singer/musician OM Jai), Paul (aka melodic rapper XAKIBOI), Eddie, Michael and Jack.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_rachel-elnaugh-business-mentor-2/content_7.html": "Business Mentor\n“Yesterday I had a wonderful mentoring session with Rachel Elnaugh. I missed her time on Dragons’ Den (no tv) but I was lucky enough to watch Rachel speak while I was at the European Sustainability Academy in Crete in October and was so impressed by the way she effortlessly switched between clearcut business advice for ‘now’ to the finalists and a big picture vision for the future. Something that is a hugely valuable skill in today’s fast-moving, complex world where it is so easy to get lost in doing. No commitment to a year long mastermind, no quid pro quo, no mutual backscratching required. Just 90 (120 actually as I nattered on) minutes of insight and brilliant advice. Thank you Rachel for making your experience available at a very accessible sum. Truly the Universe does conspire to give you what you need.” – Jenny Andersson Business and Brand Strategist www.jenandersson.com\nOver the past decade I’ve been invited to help many entrepreneurs on their business journey, and as a result I’ve learned a huge amount about the dynamics of what distinguishes a successful entrepreneur from one who will struggle and ultimately fail. In particular, the mindset needed to attract prosperity and create success. My mentoring is of particular value to entrepreneurs opening up to higher levels of consciousness and enlightenment around how their business can be a vehicle for transformation in the lives of others.\nHere’s what Internet Marketing Expert David Poole www.davidpooleandassociates.com had to say about his one to one mentoring session with me in July 2019:\n“I needed to work out some stuff in my head, mainly about my relationship with money. I spent an hour on the phone with Rachel Elnaugh who helped me understand where I’m at and helped me unblock some stuff which had been troubling me for years… I had a huge lightbulb moment as a result of something she said! Rachel listened more than she talked, plus looked at my website, content and social media activity before giving me some really sensible advice about why some of my stuff doesn’t move quite as fast as I want it to. Watch for some big changes! Time and money very well spent. – Stefan Thomas, author ‘Business Networking for Dummies’ www.noredbraces.co.uk\nMy One to One Mentoring Sessions are designed to really help you step-change your thinking around your life purpose, your prosperity and understand what is causing any problems in your money flow. (Just by listening to you talk about your problems/issues it’s often immediately clear to me where the block is.) Sometimes when you are putting huge amounts of effort into trying to push open the door, all that is really needed is for you to turn the key and, once unlocked, the door opens effortlessly. It’s all about finding where your foot is on the brake.\nThese sessions last between 60 and 90 minutes (but to be honest we tend to go on for as long as is needed to get you to a breakthrough). They are usually conducted via Zoom video webinar – so that we can look at your website and any other collateral we need to together on screen – as well as record the session for you to keep.\n“Thank you for an amazingly helpful private mentoring session. Within days of scoping a webinar marketing strategy with you I miraculously received an invitation to be a guest on the webinars run by the leading EFT thought leader in my industry.” – Susan Kennard, Energy Healer www.susankennard.co.uk\nIt’s a mix of my 30+ years marketing and business experience combined with understanding of the energetics around money and flow designed to give you clarity, alignment and clear action steps to implement.\nOne to One Mentoring Session\nA sixty to ninety minute one to one mentoring session with Rachel, usually via Zoom video conferencing, to allow Rachel to get to understand you and your business, what you wish to manifest and any blocks which may be standing in your way. The session is designed to give you clarity and strategic direction, plus practical advice and guidance on how to achieve your goals. You’ll receive a recording of the session so you can refer to it again and again if you wish.\nYour investment is £250\n“When Rachel suggested that I put my personal brand at the heart of my business I was hesitant. Up to that point I had thought I needed to present a professional ‘big corporate image’ to my clients, plus I didn’t want to come across as an egotist. But the transformation was incredible! New clients started to flood in, and as a result of the personal programmes I started delivering I was able to buy my dream car last year. Rachel also encouraged me to face my fear of public speaking; as a result of getting ‘on the circuit’ I’ve been asked to speak at numerous conferences. From nowhere, I’ve just been voted the 22nd most influential person in Dentistry in the UK. I can honestly say that Rachel’s input has transformed my life.” – Kevin Rose – Dental Leadership and Business Development Mentor www.roseand.co\n0\nIf your financial tide is completely out and cashflow does not permit you to pay £250 I am happy to accept a payment of whatever is affordable for you right now – and the balance when your finances are back ‘in flow’.\nSimply send your nominated payment to: www.paypal.me/rachelelnaugh\n(I make this offer in trust that you will honour my value as best you can right now and reserve the right to decline the booking and refund your payment.)\nOne to One Mentoring Site-Visit\nA two to three hour one to one mentoring session with Rachel, on site at your home or office/business, to allow Rachel to get to understand you and what is going on for you energetically (including a feng shui assessment of your space), what you wish to manifest and any blocks which may be standing in your way. The session is designed to give you clarity and strategic direction, plus practical advice and guidance on how to achieve your goals.You’ll receive a follow up recommendations summary and you may record the session if you wish. This special offer includes travel to mainland UK addresses within 200 miles of Rachel’s base in Bakewell, Derbyshire. If you live more than 200 miles away please email for a quote to rachel [at] rachelelnaugh.com with MENTORING in the subject title.\nSpecial Introductory Offer £888 – pay a deposit of £333 now to book and the balance before your session\nTo pay the deposit please use the PayPal button below:\nThree Month Intensive One to One Mentoring Programme\n- An initial two hour one to one mentoring session with Rachel, usually via Zoom video conferencing, to allow Rachel to get to understand you and your business, what you wish to manifest and any blocks which may be standing in your way. The session is designed to give you clarity and strategic direction, plus practical advice and guidance on how to achieve your goals.\n- A thirty minute follow up one week later to see what has come up since the first session, and to agree on an action plan for the three month programme.\n- Three further scheduled one hour one to one follow up sessions with Rachel, one each month for three months, to assess your progress and any blocks which may be appearing along your path.\n- Unlimited email and telephone support during the three month period, as any issues arise which you need Rachel’s input on.\n- Practical support, for example, introductions to contacts from Rachel’s address book or marketing of your product/service to her tribe of friends and followers and across social media where appropriate.\n- You’ll receive recordings of all the sessions.\nYour investment is £2,500 – pay a deposit of £500 and the balance is payable by invoice.\nSTRATEGIC BUSINESS REVIEWS\nI also offer more in-depth Business Review and One to One sessions – designed for more established businesses, either if you are on the trajectory of growth and would like the input of someone who took their business from nothing to a £18million turnover market leading brand, or conversely if you are experiencing major issues and would like the experience of someone who has been through the meltdown of a £multi-million company.\nI am happy to review your website and/or business plan or whatever other collateral you need me to review in advance of our session, listen to your current position and the issues you are facing and then give you my wisdom – based on my own entrepreneurial journey as well as helping many hundreds of others on their path to success. A great mentor of my own once said to me ‘they’re paying for your wisdom, not your time Rachel’ so our session will take as long as it takes, but in my experience will typically last around 90 minutes.\nI’ll then follow up the session a week or so later with a further 30 minute session to give additional clarity once ideas have had the chance to settle.\nI normally conduct these one to one sessions by webinar but if you are happy to visit me in Bakewell or meet in London I am happy to do the meeting face to face. The outcome for you will be absolute clarity around your strategy and direction going forwards.\nYour investment in a Business Strategy Review and One to One Mentoring Session is £900\nTo book please use the special automated PayPal button below:\nI do hope that I can help you on your business journey.\nRachel x\nRachel Elnaugh, award winning entrepreneur, co-creator of global empowerment brand SourceTV, creator of market leading experiences brand Red Letter Days, co-producer of the acclaimed 12.12.12 One World London event, star of the first two series of BBCTV’s Dragons’ Den, business speaker, author of ‘Business Nightmares’ and award winning business mentor.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_home_speaking/content_2.html": "Business Speaker\nPLEASE NOTE THAT I NO LONGER ACCEPT SPEAKING BOOKINGS VIA AGENCIES.\nTHIS IS TO ENSURE A) FULL INVOLVEMENT IN THE EVENT BRIEFING PROCESS AND B) TRANSPARENCY FOR CLIENTS RE: PRICING\n“I can honestly say after hearing Rachel perform once again, I have no hesitation to recommend her for any event where you need an inspirational speaker from a business background…” Cindy-Michelle Waterfield, Managing Director of ‘The Speakers Company’\n“Not only did you storm it at the Black Pearl Dinner, you won the hearts and minds of every single person in that room” Tanya Rennick, The Oyster Club, London\nRachel Elnaugh is an accomplished business speaker, having been on the professional speaking circuit since her rise to fame as a ‘Dragon’ in the first two series of BBCTV’s acclaimed business show Dragons’ Den in 2005 – successfully delivering over four hundred speeches, events, seminars, workshops and presentations to thousands of business owners and entrepreneurs both in the UK and the US, Europe and Asia.\nIn this early video, at the very start of her speaking career, Rachel talks about her book ‘Business Nightmares’ at a conference of the same name aimed at small business owners at the British Library in London back in 2006:\nHere’s what Cindy-Michelle Waterfield, Managing Director of ‘The Speakers Company’ said about Rachel’s ‘Entrepreneurial Journey’ talk at the EVENT show:\n“Just to give you some feedback on Rachel… The organizers were over the moon with her performance. They had to turn people away from the auditorium as it was full to capacity and there was a good number outside trying to listen in too. I personally had to leave the auditorium so that someone else could get in, so joined with others outside who, like myself, were all glued to her words. This also allowed me an excellent opportunity to listen to the comments made by her audience as they came out. They were all positive and included phrases like: ‘she is so genuine and sincere…’ ‘absolutely inspiring…’ ‘amazing story…’ ‘you can see she is absolutely passionate and authentic…’. One of the organizers of the event commented on how they could feel Rachel’s emotion and how they could see her almost having tears in her eyes at one stage when she was retelling her journey. One of our team, (who is usually cynical as he has heard so many speakers over the years) commentated on how gifted Rachel is at telling her story and that he felt she actually lit up on the podium and positively glowed! Rachel’s audience were a mixture of business owners linked to the events industry and event organizers for event companies and commercial companies. Rachel thought she had a bit of a tough audience and after investigating further it actually turned out that many in the audience dropped by our stand just to tell us how riveted they were to her story and was simply awestruck throughout her presentation. I can honestly say after hearing her perform once again, I have no hesitation to recommend her for any event where you need an inspirational speaker from a business background. She was an absolute pleasure to work with and have no hesitation to do it again and look forward to doing so. As one bureau to another, Rachel is definitely one of those rare gems of the platform that won’t let you down.”\nRachel was trained in presentation skills by Nicholas Janni at Olivier Mythodrama, in performance and stage presence by Geoff Owen, in projection skills by voice coach Alice Tierney and has been coached by award winning inspirational speaker Rob Snow and the inimitable prolific speaker, ‘Beermat Entrepreneur’ Mike Southon.\nShe has undertaken events for a diverse variety of clients including the CBI, the Conservative Party Conference, Scottish Parliament, TEDx, the Institute of Directors, Harvard University, HSBC, John Lewis, Marketing Week, Cass Business School, Oxford Debating Society and the Mind Body Spirit Festival – as well as speaking at many schools and universities. She is a regular speaker at The Great British Business Show.\nRachel also made her debut as a stand-up comedienne at The Comedy Store on 22 November 2010 in a charity event for London Business Forum which raised £12,000.\nAs well as her acclaimed ‘Entrepreneurial Rollercoaster’ keynote, Rachel speaks on a variety of business related topics and always tailors her presentation to the client and the brief for the event. Past subjects have included:\n- Business Alchemy\n- Magnetic Marketing\n- Business Nightmares\n- “The Future is Feminine”\n- Surviving Adversity\n- PROSPERITY\n- The Game of Business and How To Play It\nOver the past decade Rachel has increasingly become involved in the metaphysical sector and her new themes include:\n- From Dragons’ Den to Business Zen\n- Higher Conscious Business Creation\n- Corporate Healing\nRachel is also an accomplished Awards Host including presenting the 2008 Strategic Risk Awards for 1000 people at the Porter Tun Rooms in London, the 2012 KEiBA Awards in Kent to an audience of 450 and both judging and presenting the Free2Network Awards to an audience of 200 in November 2013.\nAs part of her involvement in any event Rachel always helps event organisers, where requested, to promote their event both via her database of fans and followers and her 10k+ Twitter following, as well as via any Press or PR interviews required of her either on the day or in advance of the event.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_biography-2/content_12.html": "Biography\nSHORT BIO\nFormer BBCTV Dragons’ Den ‘Dragon’, Rachel Elnaugh-LOVE is the British entrepreneur who created the £multi-million market leading ‘Red Letter Days’ experience brand. She is now a business speaker, business mentor, co-creator of the digital publishing and marketing platform for evolutionaries www.source.tv and author of ‘Business Nightmares’, ‘Prosperity’ and ‘LIBERATION’. In June 2022 Rachel co-created a conscious community who crowdfunded the acquisition of 53 acres of beautiful, magical land at Cressbrook Dale in the Peak District.\nRachel is based in Bakewell, Derbyshire\no\nLONG BIOGRAPHY\nRachel Elnaugh-LOVE is the award winning entrepreneur whose first business was the market leading ‘experiences’ brand Red Letter Days, which she created at the age of 24 and grew from nothing, on a shoestring budget, into a £multi-million turnover household name, which at its height was making £1million profit a year. In 2000 Red Letter Days was acknowledged by Mintel to be the creator of the new UK experiences industry – by then worth £250million per annum.\nThis won Rachel an Ernst & Young Entrepreneur of the Year Award in 2002 and she was shortlisted for the 2001 Veuve Clicquot Businesswoman of the Year Award along with Barbara Cassani, Jo Malone, Sly Bailey and Chey Garland.\nAs a result of being on the Awards circuit, in 2002 she was invited by the BBC to be part of a new business show they were formulating called ‘Dragons’ Den‘.\nThe pilot for Dragons’ Den was filmed in 2003 and the first series was commissioned and filmed in Autumn 2004, airing for the first time in January 2005. Dragons’ Den was a huge success, shortlisted for a BAFTA and very quickly syndicated worldwide. The second series was filmed in May/June/July 2005 and aired in November/December 2005.\nHowever, behind the scenes, Rachel had been struggling to bring Red Letter Days back on track after a disastrous over-expansion in 2002, and despite the business being back in profit and having £3.3million cash at bank it was forced into administration by Barclays Bank on 1 August 2005.\nThanks to her high profile appearance on Dragons’ Den, the crash of Red Letter Days attracted huge media exposure, the story appearing on all the key news channels and in every mainstream newspaper. (The Red Letter Days business was bought out of administration by Rachel’s fellow Dragons Peter Jones and Theo Paphitis and continues to trade.)\nHowever, to paraphrase Napoleon Hill, in every adversity lies the seeds of opportunity and Rachel was invited to speak at many enterprise events about her experiences. She was also commissioned to write a book about the fine line between success and failure in her book ‘Business Nightmares‘ – not just her own story but the story of 20 other successful entrepreneurs who hit problems on their own journey.\nThe timing of the book launch in May 2008 could not have been more fortuitous as in September 2008 the global banking system crashed triggering the current recession and many other business meltdowns. ’Business Nightmares‘ has since become THE handbook for business survival for many struggling entrepreneurs.\nRachel was invited to speak at many enterprise events about her experiences and is now an accomplished professional speaker with experience of speaking at over three hundred events including Harvard University, TEDx, The Scottish Parliament, The Oxford Union Debating Society, The British Library, The National Library Singapore, the Opening of Global Entrepreneurship week in Holland (with Nick Clegg) and the Conservative Party Conference.\nRachel was quickly invited by many entrepreneurs to help them with their own business and she became a mentor to many, creating along the way a series of low cost training programmes and workshops designed to help entrepreneurs struggling to make their business work.\nHer work in helping others lead to a fascination with empowerment and the power of the mind, including fourth dimensional energy principles including quantum physics, metaphysics and the Law of Attraction. In 2010 she travelled to Kuala Lumpur to train in feng shui with leading international feng shui author Grand Master Lillian Too.\nRachel combined her business and marketing knowledge, her experience of going through a financial wipeout together with her knowledge of metaphysics into her acclaimed 2012 low cost video mentoring programme Business Alchemy.\nIn 2011 Rachel co-created the pilot for a new transformational TV brand through which she met Stephen Russell aka Barefoot Doctor. As a result she became Barefoot Doctor’s business manager, publishing his book The Message which was launched at Sadlers Wells in February 2012. Their joint Glastonbury radio show Barefoot and the Dragon topped the ratings during the months it was aired.\nRachel also helped breathe life into The Big Om sound healing concept which took place in Brighton on 12.12.12, triggering a sister London event 12.12.12 One World co-produced by Rachel and Hay House ‘Money Magnet’ author Marie Claire Carlyle.\nThe event (which was also Rachel’s birthday) was a huge success, attracting an audience of over 1,500 people and live-streamed globally.\nThis 12.12.12 event inspired Rachel’s current business venture SourceTV which she co-created in 2013 with Hollywood based TV marketing expert Kevin Stein.\nRachel’s book PROSPERITY was published on 23 April 2016, written during her time living at the £1.75m Grade II listed mansion in Bakewell where she also hosted retreats and workshops .\nOver the past few years Rachel has continued to go deeper on her journey of personal healing and transformation, professional training in Trauma Healing Skills (both Basic and Advanced programmes) with Juliet Yelverton of Healing Waters Glastonbury, and with Dr Gabor Mate in Ireland; training in Natural Wisdom Leadership with Ayni Foundation (Davina MacKail and Nizami Ele), training in Ba Zi and Feng Shui with Richard Ashworth, as well as several spiritual pilgrimages to Peru (to work with Shamans and the great plant medicine teachers Ayahuasca and San Pedro – both in the mountains of the Andes and the jungle at Sipapu) and to Egypt, experiencing the heartbeat of Gaia herself resonating in the King’s Chamber of the Great Pyramid.\nThese teachings have allowed Rachel to take her Professional Speaking, One to One Mentoring and Group Mentoring programmes to new levels of insight and transformation for her clients/audiences.\nIn June 2022 Rachel co-created a conscious community who crowdfunded the acquisition of 53 acres of beautiful, magical land at Cressbrook Dale in the Peak District. Visit www.lovecressbrookdale.com for more information.\nRachel’s third book LIBERATION was published in November 2023. You can get one of the signed, limited edition hardback copies at www.source.tv/liberation\nRachel is mother to five amazing sons MJ (aka shamanic singer/musician OM Jai), Paul (aka melodic rapper XAKIBOI), Eddie, Michael and Jack.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_flow/content_6.html": "FLOW 2019\nBOOKINGS FOR FLOW 2019 ARE NOW CLOSED BUT YOU CAN STILL BOOK A ONE-TO-ONE INTUITIVE MENTORING SESSION WITH ME AT: www.rachelelnaugh.com/intuitive-mentoring\n“What a magical meeting of beautiful souls. Flow 2018 has taught me so much and Rachel Elnaugh I thank you for the gift of you and your vision. This year has been one of growth, going deeper into healing than ever before and feeling held and supported by a beautiful mandala of Flow-er souls. Gratitude from my heart chakra straight to each of yours. Love you all and here’s to the magic that we have set the foundation for, to unfold in 2019 x” – Mani Hirani co-creator The Veda Soul Company\nJoin award winning entrepreneur and intuitive business mentor Rachel Elnaugh and a small group of other evolving souls on a journey of personal and collective ‘flow’ during 2019…\nThis is the second year I am running the FLOW programme and I am incorporating all the learnings of the first year – which has been extraordinarily powerful for all those members who engaged wholeheartedly with the group.\nMy intention in calling together this circle for 2019 – more of a OneHeart than a MasterMind – is to create a safe container for a small mandala of heart-centred business owners (and solopreneurs) to support one another in getting into ‘flow’ in every area of our lives in 2019 – and especially around money and business.\n“2018 has been a fantastic year for me and this FLOW group played a big part in that. It supported me when things were difficult in my business, it also helped me activate my intention of allowing a new relationship in my life. Thank you to all of you but an especially big thanks to Rachel Elnaugh for holding the space. As the Mayan say: In Lak ech Ala K in. You honour me I honour you. I wish the very highest and best to you all.” – Marc Peridis, Sacred Space Shaman www.marcperidis.com\nThe programme will be perfect for you if you are:\n-\nA heart-centred professional or enlightened business owner dedicated to raising conscious awareness via your contribution in this lifetime\n-\nOpen to metaphysical principles and the power and magic of the Universe\n-\nAbsolutely committed to being part of the programme for the entire year, no matter what comes up\n-\nAble to hold a space of non-judgement and compassion for yourself and others\n-\nPrepared to keep confidential every aspect of what unfolds during our year together\nMy intention is to gather together a nourishing, supportive, creative, expansive mandala of evolving souls.\nThis video testimonial is from 2018 FLOW member Dr Gill Barham, Lifestyle Leader and broadcaster/author:\nThe prime purpose of the programme will be to help you to not only evolve your business, your personal brand, your creativity, your ability to manifest and flow during 2019 but also for us to come together, be inspired and collaboratively co-create.\n“Despite many years of self development, positive thinking and following my own heart, I had begun to question myself as debts were mounting and money was not flowing fast enough to keep up. My energy and enthusiasm were beginning to wane, causing me to question if I had somehow totally got my life’s purpose wrong.\nSince joining FLOW 2018 things have really begun to transform. The mutual encouragement, support and friendships within this group and Rachel’s honest and open sharing of her own personal journey to heal and transmute her own trauma have really helped the group to bond and support each other.\nThank you Rachel for holding the space for us through the group meetings, events and regular live webinars that have really help cement the groups intentions and energy. Amazing!” – Sandra Owen Creative Healer and Grief Recovery Specialist www.sandraowencreative.com\nYou may already be immersed in the world of spirituality and metaphysics; it is my intention for us to go deeper into all aspects of ‘flow’ – how to deepen our connection to Source as well as understand what may be blocking it. To not just understand the concepts intellectually, but to integrate them, embody them, live them and become them.\nHere is what I propose to include within the FLOW 2019 programme:\n-\nA mix of both experiential and online meetings throughout 2019 – designed to help us deepen our ability to flow…\n-\nAn initial One Day Experience on the Full Moon day of Monday 21 January 2019 for us to meet one another and get clarity on and energise our individual and collective Vision for 2019. This experience will be held at Healing Waters Sanctuary in Glastonbury – a tremendously powerful place for healing and transformation. NB Rooms are available at minimal cost both the night before and after if you wish to arrive the day before or stay until Tuesday – bookable direct with Healing Waters\n-\nNineteen 60 to 90 minute online group sessions (via Zoom) – usually at 12noon UK time on Mondays fortnightly (and every 3 weeks after September) – see the full schedule of dates below. To keep the energy of the group flowing please commit to attending at least 10 sessions over the year. All sessions will be recorded and made available to the group.\n-\nA Summer Celebration close to the Summer Solstice at my home in Bakewell, Derbyshire.\n-\nA final Christmas Celebration evening (location to be agreed in central London)\n-\nAn ongoing secret Facebook group for us to share our journey and support one another throughout 2019 – where I am constantly present and available to offer insight and support. Participation in the Facebook group is key to get the most benefit from the group.\n-\nIt is my intention that there will be further experiential and deep healing events during the year – to be arranged at dates and locations to be agreed within the group. These are optional, and at extra cost, but proved to be exceptionally powerful for those members who attended during 2018.\nIn addition, every member will receive:\n-\nA 60 minute one-to-one mentoring session with me (via Zoom) in early January 2019 – so that I may get to understand you, your business and your desires for 2019, as well as anything that may currently be blocking or frustrating you.\n-\nBefore this one-to-one session – and to gain further understanding of you – I will also look at your personal astrology chart, Ba Zi (Four Pillars of Destiny) and Nine Star Ki for 2019\n-\nA further 60 ’emergency minutes’ of one-to-one mentoring with me (which you may take in minimum 20 minute sessions via Zoom or phone) as you feel you need it, at any time during 2019.\nLove,\nRachel xx\n“Thanks so much Rachel for your courage, support, guidance, poking, teaching. I can honestly say that you are one of the most profound teachers I have ever learnt from and I feel blessed to be so deep into this journey so early in my life. ” – Julia Pennington\nA few provisos…\nRachel reserves the right to return your deposit if she feels that you are not suitable for the programme. Please do not commit to this programme unless you are absolutely certain that you will be able to participate wholeheartedly throughout 2019. The programme is definitely running as we now have the required minimum number of members.\nTHE FULL CALENDAR OF DATES FOR 2019…\n7 to 26 January 2019 – One to One sessions with Rachel with each participant\nMonday 21 January 2019 (Full Moon) ONE DAY INTRODUCTORY EXPERIENCE 10am to 4pm – Healing Waters Sanctuary, Glastonbury. Note: Rooms are available at nominal cost for both the night before and the night afterwards should you wish to stay longer in Glastonbury. You may book direct with Healing Waters.\nMonday 28 January 2019 Online 12noon UK time\nMonday 4 February 2019 Online 12noon UK time\nMonday 18 February 2019 Online 12noon UK time\nMonday 4 March 2019 Online 12noon UK time\nMonday 18 March 2019 Online 12noon UK time\nMonday 1 April 2019 Online 12noon UK time\nMonday 15 April 2019 Online 12noon UK time\nMonday 29 April 2019 Online 12noon UK time\nMonday 13 May 2019 Online 12noon UK time\n** Bank Holiday**\nMonday 3 June 2019 Online 12noon UK time\nMonday 17 June 2019 Online 12noon UK time\nSunday 23 June 2019 2pm to 8pm SUMMER PARTY (at my home in Bakewell, Derbyshire)\nMonday 1 July 2019 Online 12noon UK time\nMonday 15 July 2019 Online 12noon UK time\nMonday 29 July 2019 Online 12noon UK time\n***There will be no sessions during August 2018***\nMonday 2 September 2019 Online 12noon UK time\nMonday 23 September 2019 Online 12noon UK time\nMonday 14 October 2019 Online 12noon UK time\nMonday 4 November 2019 Online 12noon UK time\nMonday 25 November 2019 Online 12noon UK time\nMonday 16 December 12noon to 3pm CHRISTMAS LUNCH (location to be agreed)\nNB I reserve the right to move these dates/times if necessary and will endeavour to give as much notice as possible\nOn the magic of Circles…\nAll over the planet people are gathering in circle to experience and experiment with the concept of Oneness. (Unless we can achieve unity in a small group how can we achieve it on a global level?)\nAs these groups gather, we see reflected in the mandala of those assembled every facet of ourselves… The parts we love and the parts we feel called to judge and make wrong. Circle work is a beautiful opportunity to transform and transmute the deep unresolved issues which are keeping us from being fully ‘in flow’. (All triggers are great gifts pointing to our unresolved trauma longing to be transmuted. Transcending judgement is the last great challenge in our spiritual journey to Atonement – ‘at-one-ment’.)\nOm Namah Shivaya…\nThanks to Lucida & Rafael for creating the FLOW ‘jingle’ !\nI chose this mantra for FLOW as it is the sanskrit seeds sounds for all of the elements of creation (echoed in the FLOW logo): Na = Earth, Ma = Water, Shi = Fire, Va = Air, Ya = Ether\nWhich when combined mean “I bow to Lord Shiva” or “I bow to my inner self”\nAbout Rachel Elnaugh\nMany still know me best through my appearance as a ‘Dragon’ on the first two series of BBCTV’s Dragons’ Den – which came about as a result of the success I had as the award-winning entrepreneur who created the £multi-million turnover market leading experiences company Red Letter Days which I founded at the age of 24.\nHowever the past 12 years has taken me on a journey of personal transformation and evolution, working with many great teachers, mentors, coaches – not to mention shamans and plant medicine!\nNot only did I co-create the 12.12.12 One World London event and the digital publishing and promotion platform for evolutionaries SourceTV, in 2012 I acted as business manager for Stephen Russell aka Barefoot Doctor and published his 16th book ‘The Message: Vision for a new golden era’ – which we launched at Sadler’s Wells.\nI have also trained in Feng Shui with Lillian Too, Shamanism with Taz Thornton, Leadership Presence with Richard Olivier and Nicholas Janni, Kundalini Yoga and Mastering the Addictive Personality with Carolyn Cowan, Natural Wisdom Leadership with Davina MacKail, Trauma Healing with Juliet Yelverton, Ba Zi and Feng Shui* with Richard Ashworth (* ongoing training, complete by January 2019).\nAs well as attending numerous workshops in everything from Sound Healing with Adrian Freedman to Unleash the Power Within with Tony Robbins to Landmark Forum to Astrology with Tom ‘Kaypacha’ Lescher. My sacred pilgrimage to Egypt in November 2018 culminating in a private meditation inside the Great Pyramid further deepened my experience of the magical metaphysical realms.\nI am the author of two books – ‘Business Nightmares’ and ‘Prosperity’; a professional speaker who has been PAID to speak at over 200 events, and the creator of numerous online programmes – including ‘Prosperity’, ‘Business Alchemy’, ‘108 Days to Evolution’ and ‘Feng Shui for Prosperity’.\nI am passionate about all things metaphysical and esoteric, especially astrology, shamanism, all forms of divination and feng shui. Plus I have a lifelong passion for understanding all aspects of money and prosperity – which began with a thorough material realm grounding including growing up above my father’s business, training in accountancy and creating my own £multi-million business – followed by a journey into the metaphysic aspects of ‘flow’ and prosperity, including experiencing the ‘shadow side’ of money, via losing my company and then being forced into bankruptcy in early 2012.\nMy definition of true Prosperity is being in the same energy around money whether you have £millions or nothing; a relationship as effortless as breathing. The journey to this involves clearing all programming, trauma, limiting beliefs and fear we may be holding around money.\nI am also mother to 5 sons, all ancient souls, who continue to be the greatest teachers in my life.\nFOOTNOTE\nIf you have arrived at this page for the ‘Flow’ Money Meditation promised in my 2016 book PROSPERITY here it is:\nhttp://www.spreaker.com/user/sourcetv/money-meditation",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_home_rachel-elnaugh-business-mentor-2/content_11.html": "Business Mentor\n“Yesterday I had a wonderful mentoring session with Rachel Elnaugh. I missed her time on Dragons’ Den (no tv) but I was lucky enough to watch Rachel speak while I was at the European Sustainability Academy in Crete in October and was so impressed by the way she effortlessly switched between clearcut business advice for ‘now’ to the finalists and a big picture vision for the future. Something that is a hugely valuable skill in today’s fast-moving, complex world where it is so easy to get lost in doing. No commitment to a year long mastermind, no quid pro quo, no mutual backscratching required. Just 90 (120 actually as I nattered on) minutes of insight and brilliant advice. Thank you Rachel for making your experience available at a very accessible sum. Truly the Universe does conspire to give you what you need.” – Jenny Andersson Business and Brand Strategist www.jenandersson.com\nOver the past decade I’ve been invited to help many entrepreneurs on their business journey, and as a result I’ve learned a huge amount about the dynamics of what distinguishes a successful entrepreneur from one who will struggle and ultimately fail. In particular, the mindset needed to attract prosperity and create success. My mentoring is of particular value to entrepreneurs opening up to higher levels of consciousness and enlightenment around how their business can be a vehicle for transformation in the lives of others.\nHere’s what Internet Marketing Expert David Poole www.davidpooleandassociates.com had to say about his one to one mentoring session with me in July 2019:\n“I needed to work out some stuff in my head, mainly about my relationship with money. I spent an hour on the phone with Rachel Elnaugh who helped me understand where I’m at and helped me unblock some stuff which had been troubling me for years… I had a huge lightbulb moment as a result of something she said! Rachel listened more than she talked, plus looked at my website, content and social media activity before giving me some really sensible advice about why some of my stuff doesn’t move quite as fast as I want it to. Watch for some big changes! Time and money very well spent. – Stefan Thomas, author ‘Business Networking for Dummies’ www.noredbraces.co.uk\nMy One to One Mentoring Sessions are designed to really help you step-change your thinking around your life purpose, your prosperity and understand what is causing any problems in your money flow. (Just by listening to you talk about your problems/issues it’s often immediately clear to me where the block is.) Sometimes when you are putting huge amounts of effort into trying to push open the door, all that is really needed is for you to turn the key and, once unlocked, the door opens effortlessly. It’s all about finding where your foot is on the brake.\nThese sessions last between 60 and 90 minutes (but to be honest we tend to go on for as long as is needed to get you to a breakthrough). They are usually conducted via Zoom video webinar – so that we can look at your website and any other collateral we need to together on screen – as well as record the session for you to keep.\n“Thank you for an amazingly helpful private mentoring session. Within days of scoping a webinar marketing strategy with you I miraculously received an invitation to be a guest on the webinars run by the leading EFT thought leader in my industry.” – Susan Kennard, Energy Healer www.susankennard.co.uk\nIt’s a mix of my 30+ years marketing and business experience combined with understanding of the energetics around money and flow designed to give you clarity, alignment and clear action steps to implement.\nOne to One Mentoring Session\nA sixty to ninety minute one to one mentoring session with Rachel, usually via Zoom video conferencing, to allow Rachel to get to understand you and your business, what you wish to manifest and any blocks which may be standing in your way. The session is designed to give you clarity and strategic direction, plus practical advice and guidance on how to achieve your goals. You’ll receive a recording of the session so you can refer to it again and again if you wish.\nYour investment is £250\n“When Rachel suggested that I put my personal brand at the heart of my business I was hesitant. Up to that point I had thought I needed to present a professional ‘big corporate image’ to my clients, plus I didn’t want to come across as an egotist. But the transformation was incredible! New clients started to flood in, and as a result of the personal programmes I started delivering I was able to buy my dream car last year. Rachel also encouraged me to face my fear of public speaking; as a result of getting ‘on the circuit’ I’ve been asked to speak at numerous conferences. From nowhere, I’ve just been voted the 22nd most influential person in Dentistry in the UK. I can honestly say that Rachel’s input has transformed my life.” – Kevin Rose – Dental Leadership and Business Development Mentor www.roseand.co\n0\nIf your financial tide is completely out and cashflow does not permit you to pay £250 I am happy to accept a payment of whatever is affordable for you right now – and the balance when your finances are back ‘in flow’.\nSimply send your nominated payment to: www.paypal.me/rachelelnaugh\n(I make this offer in trust that you will honour my value as best you can right now and reserve the right to decline the booking and refund your payment.)\nOne to One Mentoring Site-Visit\nA two to three hour one to one mentoring session with Rachel, on site at your home or office/business, to allow Rachel to get to understand you and what is going on for you energetically (including a feng shui assessment of your space), what you wish to manifest and any blocks which may be standing in your way. The session is designed to give you clarity and strategic direction, plus practical advice and guidance on how to achieve your goals.You’ll receive a follow up recommendations summary and you may record the session if you wish. This special offer includes travel to mainland UK addresses within 200 miles of Rachel’s base in Bakewell, Derbyshire. If you live more than 200 miles away please email for a quote to rachel [at] rachelelnaugh.com with MENTORING in the subject title.\nSpecial Introductory Offer £888 – pay a deposit of £333 now to book and the balance before your session\nTo pay the deposit please use the PayPal button below:\nThree Month Intensive One to One Mentoring Programme\n- An initial two hour one to one mentoring session with Rachel, usually via Zoom video conferencing, to allow Rachel to get to understand you and your business, what you wish to manifest and any blocks which may be standing in your way. The session is designed to give you clarity and strategic direction, plus practical advice and guidance on how to achieve your goals.\n- A thirty minute follow up one week later to see what has come up since the first session, and to agree on an action plan for the three month programme.\n- Three further scheduled one hour one to one follow up sessions with Rachel, one each month for three months, to assess your progress and any blocks which may be appearing along your path.\n- Unlimited email and telephone support during the three month period, as any issues arise which you need Rachel’s input on.\n- Practical support, for example, introductions to contacts from Rachel’s address book or marketing of your product/service to her tribe of friends and followers and across social media where appropriate.\n- You’ll receive recordings of all the sessions.\nYour investment is £2,500 – pay a deposit of £500 and the balance is payable by invoice.\nSTRATEGIC BUSINESS REVIEWS\nI also offer more in-depth Business Review and One to One sessions – designed for more established businesses, either if you are on the trajectory of growth and would like the input of someone who took their business from nothing to a £18million turnover market leading brand, or conversely if you are experiencing major issues and would like the experience of someone who has been through the meltdown of a £multi-million company.\nI am happy to review your website and/or business plan or whatever other collateral you need me to review in advance of our session, listen to your current position and the issues you are facing and then give you my wisdom – based on my own entrepreneurial journey as well as helping many hundreds of others on their path to success. A great mentor of my own once said to me ‘they’re paying for your wisdom, not your time Rachel’ so our session will take as long as it takes, but in my experience will typically last around 90 minutes.\nI’ll then follow up the session a week or so later with a further 30 minute session to give additional clarity once ideas have had the chance to settle.\nI normally conduct these one to one sessions by webinar but if you are happy to visit me in Bakewell or meet in London I am happy to do the meeting face to face. The outcome for you will be absolute clarity around your strategy and direction going forwards.\nYour investment in a Business Strategy Review and One to One Mentoring Session is £900\nTo book please use the special automated PayPal button below:\nI do hope that I can help you on your business journey.\nRachel x\nRachel Elnaugh, award winning entrepreneur, co-creator of global empowerment brand SourceTV, creator of market leading experiences brand Red Letter Days, co-producer of the acclaimed 12.12.12 One World London event, star of the first two series of BBCTV’s Dragons’ Den, business speaker, author of ‘Business Nightmares’ and award winning business mentor.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com_speaking/content_5.html": "Business Speaker\nPLEASE NOTE THAT I NO LONGER ACCEPT SPEAKING BOOKINGS VIA AGENCIES.\nTHIS IS TO ENSURE A) FULL INVOLVEMENT IN THE EVENT BRIEFING PROCESS AND B) TRANSPARENCY FOR CLIENTS RE: PRICING\n“I can honestly say after hearing Rachel perform once again, I have no hesitation to recommend her for any event where you need an inspirational speaker from a business background…” Cindy-Michelle Waterfield, Managing Director of ‘The Speakers Company’\n“Not only did you storm it at the Black Pearl Dinner, you won the hearts and minds of every single person in that room” Tanya Rennick, The Oyster Club, London\nRachel Elnaugh is an accomplished business speaker, having been on the professional speaking circuit since her rise to fame as a ‘Dragon’ in the first two series of BBCTV’s acclaimed business show Dragons’ Den in 2005 – successfully delivering over four hundred speeches, events, seminars, workshops and presentations to thousands of business owners and entrepreneurs both in the UK and the US, Europe and Asia.\nIn this early video, at the very start of her speaking career, Rachel talks about her book ‘Business Nightmares’ at a conference of the same name aimed at small business owners at the British Library in London back in 2006:\nHere’s what Cindy-Michelle Waterfield, Managing Director of ‘The Speakers Company’ said about Rachel’s ‘Entrepreneurial Journey’ talk at the EVENT show:\n“Just to give you some feedback on Rachel… The organizers were over the moon with her performance. They had to turn people away from the auditorium as it was full to capacity and there was a good number outside trying to listen in too. I personally had to leave the auditorium so that someone else could get in, so joined with others outside who, like myself, were all glued to her words. This also allowed me an excellent opportunity to listen to the comments made by her audience as they came out. They were all positive and included phrases like: ‘she is so genuine and sincere…’ ‘absolutely inspiring…’ ‘amazing story…’ ‘you can see she is absolutely passionate and authentic…’. One of the organizers of the event commented on how they could feel Rachel’s emotion and how they could see her almost having tears in her eyes at one stage when she was retelling her journey. One of our team, (who is usually cynical as he has heard so many speakers over the years) commentated on how gifted Rachel is at telling her story and that he felt she actually lit up on the podium and positively glowed! Rachel’s audience were a mixture of business owners linked to the events industry and event organizers for event companies and commercial companies. Rachel thought she had a bit of a tough audience and after investigating further it actually turned out that many in the audience dropped by our stand just to tell us how riveted they were to her story and was simply awestruck throughout her presentation. I can honestly say after hearing her perform once again, I have no hesitation to recommend her for any event where you need an inspirational speaker from a business background. She was an absolute pleasure to work with and have no hesitation to do it again and look forward to doing so. As one bureau to another, Rachel is definitely one of those rare gems of the platform that won’t let you down.”\nRachel was trained in presentation skills by Nicholas Janni at Olivier Mythodrama, in performance and stage presence by Geoff Owen, in projection skills by voice coach Alice Tierney and has been coached by award winning inspirational speaker Rob Snow and the inimitable prolific speaker, ‘Beermat Entrepreneur’ Mike Southon.\nShe has undertaken events for a diverse variety of clients including the CBI, the Conservative Party Conference, Scottish Parliament, TEDx, the Institute of Directors, Harvard University, HSBC, John Lewis, Marketing Week, Cass Business School, Oxford Debating Society and the Mind Body Spirit Festival – as well as speaking at many schools and universities. She is a regular speaker at The Great British Business Show.\nRachel also made her debut as a stand-up comedienne at The Comedy Store on 22 November 2010 in a charity event for London Business Forum which raised £12,000.\nAs well as her acclaimed ‘Entrepreneurial Rollercoaster’ keynote, Rachel speaks on a variety of business related topics and always tailors her presentation to the client and the brief for the event. Past subjects have included:\n- Business Alchemy\n- Magnetic Marketing\n- Business Nightmares\n- “The Future is Feminine”\n- Surviving Adversity\n- PROSPERITY\n- The Game of Business and How To Play It\nOver the past decade Rachel has increasingly become involved in the metaphysical sector and her new themes include:\n- From Dragons’ Den to Business Zen\n- Higher Conscious Business Creation\n- Corporate Healing\nRachel is also an accomplished Awards Host including presenting the 2008 Strategic Risk Awards for 1000 people at the Porter Tun Rooms in London, the 2012 KEiBA Awards in Kent to an audience of 450 and both judging and presenting the Free2Network Awards to an audience of 200 in November 2013.\nAs part of her involvement in any event Rachel always helps event organisers, where requested, to promote their event both via her database of fans and followers and her 10k+ Twitter following, as well as via any Press or PR interviews required of her either on the day or in advance of the event.",
  "https_rachelelnaugh_com_/https_rachelelnaugh_com/content_1.html": "HOME\nWelcome to my website.\nFormer BBCTV Dragons’ Den ‘Dragon’, Rachel Elnaugh-LOVE is the British entrepreneur who created the £multi-million market leading ‘Red Letter Days’ experience brand and co-created SourceTV .\nShe is a business speaker, published author and award winning business mentor who has helped many thousands of people on their entrepreneurial journey via her seminars, books, workshops, online programmes, mentoring networks and one-to-one advice sessions.\nRachel is an Evolutionary Entrepreneur and an advocate of Conscious Business.\nTo order your signed and numbered, limited edition copy of Rachel’s new book LIBERATION visit www.source.tv/liberation\nTo get updates from Rachel via email please sign up below. You can either opt just to receive emails OR you can get emails + FREE invitations to ‘The People Speak Out’ open forum Zoom sessions which happen at 12noon GMT every Monday fortnightly (hosted by either Rachel, Helen Millar or Sas Bullock).\nSigning up indicates your full acceptance to receive emails under the GDPR rules. Your details will remain confidential and you can unsubscribe at any time. You’ll receive a confirmation email on the hour with the link + password to the Zoom session (same link + password for every call).\no\nFor Rachel’s full Biography please click here\nIf you’d like Rachel to become your Business Mentor please click here\nIf you’d like Rachel to appear as a Business Speaker at your event please click here\nTo read Rachel’s 2016 book PROSPERITY click the Amazon link:\n100% 5 star rating as at 4 January 2021!!!\nAlthough I starred as a ‘Dragon’ in the first two series of BBCTV’s ‘Dragons’ Den’ please note that I no longer invest in businesses.\nIf you’d like to contact me for any reason please email me at rachel [at] rachelelnaugh.com putting SPEAKING MENTORING or NEW ENQUIRY in your email title.\nBest wishes\nRachel x\nRachel Elnaugh-LOVE\nEntrepreneur, former BBCTV Dragons’ Den ‘Dragon, creator of the experiences brand ‘Red Letter Days’ and co-creator of SourceTV, published author, professional speaker and mentor."
}