{
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_kent-county-council/content_73.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_about/content_58.html": "top of page\nABOUT ME\nWHERE I COME FROM\nI have always lived in Margate and really passionate about supporting local individuals.\nI am chair of Governors at the local Northdown Primary School, as well as a school Governor at Drapers Mills school. In 2021 I managed to set up the Dane Valley Residents Association bringing together the local residents to tackle local issues. In my youth, I was a member of the Royal Air Force's Air Cadets, where most of my principles and disciplines were formed, which led me to become Chair of the Margate Carnival, and most recently the Margate Christmas Lights, both events benefiting the local communities, whilst growing the local economy.\nMy biggest passions, are community development, bringing together marginalised communities, and tackling the current housing situations, this mirrors my career as I currently work in the housing sector, with a background working in the voluntary community and social enterprise sector.\nThe reason I stood for election is because:\n\"As a member of the public, we can only do so much, if we want to really help, or make the change, then we have to put ourselves out there, and go the extra mile, for the local community\".\nI have always lived in Dane Valley and work in the local area.\nJACK PACKMAN\nLocal Councillor, Community Leader and Lobbying For Change\nLocal politics is not easy, you cannot always please everyone, and can sometimes be daunting, but, I am determined to do my very best, for my local community, friends, and family, that all call this area home, I am up for the challenge, and will breath fresh blood into the local community within politics, at all levels.\nFor more photos of Jack, around his hometown, community, and of canvasing and family, visit the gallery pages of this website.\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_thankful-for-the-support/content_64.html": "THANKFUL FOR THE SUPPORT\n- Jack Packman\n- Mar 17, 2023\n- 1 min read\nMake sure to like & share this page online!\n\"An absolute honour to referee my last senior fixture with Will Sanderson & Ryan Chantrill-Smith at Margate Football Club.\"\n\"I’m sure there are a few players celebrating but, I have been lucky to referee live on TV, in major football stadiums and meet some real professionals both in the men’s and women’s games!\"\n\"Time to focus on a new chapter! Thanks to everyone for the support over the last 15 years, it is very much appreciated!\"\n\"I posted on Facebook, so, please make sure to like, comment and share online\"\n\"I hope, you will continue to support me, and I will gain your vote at the polling station on Thursday 4th May.\"\n\"Don’t forget if you’re not registered to vote, you need to register to vote, before Monday 17th April, and have a Photographic ID, or you can vote by postal vote, or vote by proxy, but you need to be registered as a voter.\"\nMany thanks\nStanding along with Martin Boyd, and Ruth Duckworth\nFor Dane Valley, Margate, Kent\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_sign-the-petition/content_120.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/http_www_jackpackman_co_uk/content_29.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nFOLLOW ON SOCIAL MEDIA\nFOLLOW JACK ON SOCIAL MEDIA",
  "https_www_jackpackman_co_uk_/http_www_jackpackman_co_uk_facebook/content_18.html": "top of page\nCllr Jack Packman\nCouncillor\nAbout\nMayor\nCouncillor\nDane Valley\nKCC Pledges\nAdult Social Care & The NHS\nYouth & Community Services\nEducation & SEND\nCommunity Safety\nThe Environment\nTransport, Road Safety & Highways\nGallery\nContact\nSocial media\nExternal Links\nGet Involved\nVote\nMore\nUse tab to navigate through the menu items.\nSUBSCRIBE\nFACEBOOK\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_launch/content_43.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_website-news/content_84.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_congratulations/content_106.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_help-and-support/content_103.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_councillor/content_14.html": "ABOUT COUNCILLORS\nCouncillors are elected to the local council to represent the residents in the ward and their local community. They’re expected to be active in their local community and act as the voice of their constituents, raising any local concerns within the Council on a range of matters related to the work of the Council. It’s time-consuming but rewarding and you can make a real difference in the lives of the people in your community.\nThe role of a councillor is a broad and varied one. We hope to give you a clear overview of the sorts of things you are likely to have to do as a councillor, the impact you can have, and the key duties you’ll be expected to undertake in your role.\nStanding up for local residents\nOne of the most important aspects of any councillor’s job is standing up for local residents. Councillors will be expected to host weekly surgeries to ensure that you are hearing concerns from your constitutents and taking action on problems in the area. Another key aspect of standing up for local residents will be dealing with casework and acting as an advocate for residents. These issues will range from those concerning housing benefits to anti-social behaviour in the area.\nDeveloping better services\nIn the council chamber, your work will focus on a number of different aspects, including ensuring quality public services are provided by the council, participating in community planning and seeking improvements for residents around a number of important areas. These objectives can be achieved through your work on scrutiny panels, helping create council policy and providing leadership and engaging with the community.\nDelivering local change\nCouncillors will work with community groups and local residents to ensure that the Council delivers improvement and change in the local area. Community groups are part of the fabric of the area and it is important that councillors maintain a good working relationship with them.\nKEY COUNCILLOR DUTIES\nOn the local council\n-\nTo attend full council, the council executive and/or overview and scrutiny committee(s) and other committee meetings as necessary\n-\nTo monitor performance against targets in all areas of the council activity\n-\nTo engage with local residents to consult them, feedback on council activity, take up their concerns as appropriate and be their voice in the council\n-\nTo contribute effectively to the work of the Council, in line with Labour group policy as appropriate\n-\nTo help to decide service priorities and participate in agreeing and setting a budget, in line with Labour group policy\nKey duties within the community\n-\nTo develop links with all parts of the community e.g. visiting schools, meeting local businesses, attending tenants’ meetings, visiting local projects and community groups\n-\nTo conduct regular walkabouts in the ward to identify issues of concern and tackle nuisance e.g. fly-tipping, graffiti, abandoned cars\n-\nTo promote and represent the Council in the local community and on community bodies (e.g. school governing bodies, residents associations)\n-\nTo conduct regular surgeries to allow constituents to raise issues of importance or personal concern with their elected representatives\n-\nTo take action on issues raised by constituents and lobby for resources for the ward within the constraints of the group’s overall priorities and financial strategy\nfor the Council -\nTo attend local community events on a regular basis\nKEY PARTY DUTIES\nWithin Labour Group\n-\nTo participate actively in Labour group meetings and contribute to effective decision-making\n-\nTo assist in the formulation of the Labour group’s strategies and policies, within a framework of national Labour Party policy\n-\nTo be a part of the Labour team working to deliver Labour’s policies locally\n-\nTo support regular campaign and communications in the local community, raising the profile of Labour and its work for local residents\n-\nTo be an ambassador for the Labour Party\nWith the Local Labour Branch\n-\nTo attend branch meetings and report and consult on all council activity undertaken\n-\nTo campaign with branch members on local issues\n-\nTo support policy discussion e.g. as part of the Party’s policy making process\n-\nTo recruit new members and mobilise existing ones into action\n-\nTo build a healthy party locally",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_canvassing/content_69.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_privacy/content_23.html": "PRIVACY\nWe respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\n1. WHO WE ARE AND HOW TO CONTACT US\nJack Packman is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy)\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at info@jackpackman.co.uk\n2. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\nBy collecting such data, we will be able to inform you about relevant developments that relate to the Campaign and what you can do to help the Campaign as it progresses.\nIn order to advance the Campaign, we may share your data with other campaigns and movements that share the values, principles and aims of Polly Billington for Thanet(including, but not limited, to other Labour Party elections) and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n3. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\n- contact data, including address, email address and/or telephone number(s);\n- financial data, including bank account and payment card details;\n- transaction data, including details about payments to and from you and other details of products and services you have purchased from us;\n- technical data, including internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website and platforms hosting our content;\n- profile data, including your username, your interests, preferences, feedback and/or survey responses;\n- usage data, including information about how you use our website; and/or\n- marketing and communications data, including your preferences in receiving content and/or marketing from us and your communication preferences.\nWe also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n4. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\nProvided by you – directly\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\nThis also includes personal data you provide when you register as a supporter of the Campaign, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\n5. HOW WE USE YOUR PERSONAL DATA\nThe uses\nWe will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\n- Inform and engage you about the Campaign;\n- Inform and engage you with any other campaigns and movements that share the values, principles and aims of Jack Packman (including, but not limited, to other Labour Party elections);\n- Manage donations, payments, fees and/or charges;\n- Comply with our legal obligations; and/or\n- Answer your queries and respond to your questions and/or complaints.\nThe legal bases\n- Where you have entered into a legal agreement with us that necessitates that particular use of your data (such as where you make a payment or donation to us);\n- Where it is a necessary lawful basis for our legitimate interests and your interests and fundamental rights do not override those interests; or\n- Where we are obliged to process your data in a particular way by law (for example, if we are required to notify any authority or regulator of the nature or value of your donations).\n6. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\n- To enable transfers to take place (where appropriate);\n- Where we need to comply with a legal obligation; and/or\n- With suppliers who act as our ‘data processors’ and who provide the means of processing financial transactions including, but not limited to, Jack Packman, The Labour Party, Stripe, PayPal and others.\n7. WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nYou will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\nRight to object/Opting-out\nYou can ask us to stop sending you marketing messages at any time by contacting us at info@jackpackman.co.uk.\nYou have a right to opt-out of your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nWhere you opt out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagements or transactions with us (so, for example, if you opt out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\n8. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\n9. CHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n10. CHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n11. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n12. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n13. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n14. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation with respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n15. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them.\nRight of access\nYou may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\nPlease note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\nYou can exercise this right at any time by contacting us at hello@pollybillington.org.uk and telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request.\nYour right to rectification and erasure\nYou may, at any time, request that we correct personal data that we hold about you that you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (you may have heard of this right described as the “right to be forgotten“).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\nYou can exercise this right at any time by contacting us at hello@pollybillington.org.uk and telling us that you are making a request to have your personal data rectified or erased and on what basis you are making that request. If you want us to replace inaccurate data with new data, you should tell us what that new data is. You do not have to fill in a specific form to make this kind of request.\nYour right to restrict processing\nWhere we process your personal data on the basis of a legitimate interest (see the sections of this privacy policy which explain how and why we use your information), you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data: (a) if you dispute the accuracy of that personal data and want us to verify that data’s accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; or (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nPlease note that if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it. You can exercise this right at any time by contacting us at info@jackpackman.co.uk and telling us that you are making a request to have us stop processing the relevant aspect of your personal data and describing which of the above conditions you believe is relevant to that request. You do not have to fill in a specific form to make this kind of request.\nYour right to portability\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nBecause of the nature of the work we do and the systems that we use, we do not envisage this right being particularly relevant to the majority of individuals with whom we interact. However, if you wish to transfer your data from us to a third party, we are happy to consider such requests in good faith.\nYour right to stop receiving communications\nAs noted above, where we send you email marketing communications (or other regulated electronic messages) you have the right to opt out at any time. You can do this by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications).\nAlternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at info@jackpackman.co.uk and telling us which communications you would like us to stop sending you.\nYour right to object to automated decision-making and profiling\nYou have the right to be informed about the existence of any automated decision-making and profiling of your personal data, and where appropriate, be provided with meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing that affects you.\nExercising your rights\nWhen you write to us making a request to exercise your rights, we are entitled to ask you to prove that you are whom you say you are. We may ask you to provide copies of relevant ID documents to help us to verify your identity. This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be, the faster and more efficiently we can deal with your request. If you do not provide us with sufficient information, then we may delay actioning your request until you have provided us with additional information (and where this is the case, we will tell you).\nYou will not usually have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.\nWe try to respond to all legitimate requests within one (1) month. However, it could take us longer than a month if your request is particularly complex or if you have made a number of requests. In this case, we will notify you of this and keep you updated.\n16. RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nLast updated: 18/01/23",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_events_christmas-margate-2/content_109.html": "R.S.V.P. - REGISTER\nTo R.S.V.P. this event, please register your interest for the event, by completing registering, to say whether you will be attending, or not attending!\nCHRISTMAS - MARGATE\nSat 30 Nov\n|Margate\nChristmas Lights Switch on, Live Stage and Stalls, will be back in November 2023\nTime & Location\n30 Nov 2024, 12:00 – 20:00\nMargate, Cecil Square, Margate CT9, UK\nAbout The Event\nJack Packman along with the team will be bringing Cecil Square to life, for what is hoped to continue to be an Annual Event for Christmas, right in the heart of Margate, a FREE event for everyone to enjoy, to help celebrate Christmas. The Event will feature Live Music, and Entertainment, a Christmas Market, plus the Official Lighting of the Christmas tree! A Christmas event, for the whole family, to enjoy! If you are thinking of attending simply REGISTER so, we can know in advance the expected numbers!\nMake sure to also LIKE/Follow the Official Facebook page: https://www.facebook.com/ChristmasMargate and share with friends.\nSchedule\n10 minutesChristmas Tree Lights Switch On\nChristmas Tree",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk/content_1.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nFOLLOW ON SOCIAL MEDIA\nFOLLOW JACK ON SOCIAL MEDIA",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_kwib/content_57.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_community-safety-and-crime-preventi/content_40.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_computers/content_96.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_dane-valley/content_2.html": "top of page\nDANE VALLEY\nA WINNING TEAM\nYOUR COUNCILLORS - WORKING TOGETHER FOR YOU!\nMartin Boyd\nRuth Duckworth\nJack Packman\nAlong with Martin and Ruth, we are your Dane Valley Councillors recently elected on the 4th May elections. We want to thank every person who voted for us and have trusted us to serve and deliver over the next 4 years. We will continue to listen to the views, opinions, and concerns local residents have, we are fully determined and are ready, to do our very best as a solid team for Dane Valley.\nBuilding Communities, Tackling Marginalisation & Investment In Grassroot Infrastructure, being your vote, your voice in Local Matters!\nIf you would like to talk to us, we are ready to listen and help, please get in touch! Simply contact us via the\nContact Page.\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_online-news-social-media/content_25.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_talking-to-residents-canvasing/content_59.html": "TALKING TO RESIDENTS - CANVASING\n- Mr Paul Holton\n- Feb 5, 2023\n- 1 min read\nToday, Jack along with fellow councillors and candidates, were out and about, in Dane Valley, talking to local residents.\nJack took to Facebook, to keep everyone supporting updated, as to what he is doing: \"We were out in Dane Valley again this afternoon talking to residents about local issues and the up and coming elections! Excellent responses and great to be able to support residents with their issues! Remember 4th May - local elections! YOU NEED ID TO VOTE!\"\nIF VIEWING THIS PAGE ON A COMPUTER, SIMPLY SCAN THE QR CODE BELOW TO VIEW ON MOBILE:\nFor more information about how to vote, see our Vote Page\nTo VOTE for Jack please make sure, you are Registered to Vote and have obtained a Voting Form online, or via post, and are ready to vote on Thursday 4th May 2023. Webteam For Jack Packman For updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_paul-holton/content_47.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_jack-packman/content_81.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_martin-boyd/content_111.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_dane-valley-residents-association/content_119.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_webteam/content_48.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_congratulations-to-the-wife/content_15.html": "CONGRATULATIONS TO CHARLOTTE\n- Mr Paul Holton\n- Mar 10, 2023\n- 1 min read\nIn a KWIB ceremony in Ashford this evening, at the Kent Woman in Business awards, the Finalists all gathered, to receive the winning awards, and it's with great pleasure to announce, that Jack's lovely wife Charlotte, won the Award, Determination, and hard work, from Charlotte and her amazing team.\nJack took to Facebook to announce \"She only went and won! I couldn’t be prouder if my beautiful wife Charlotte Silver who has overcome so many barriers to become one of the most inspirational and successful business women in Thanet. She is truly a role model for young women!\"\nCongratulations: Charlotte Silver\nKent Women in Business Award 2023\nCharlotte is not only an inspirational young woman and role model, but also very much determined to succeed, and through business, help within the community, but also, a great supporter of her husband, and his commitment to helping in the community.\nFor more information on the KWIB awards please feel free to visit their official website: https://kwibawards.co.uk\nTo VOTE for Jack please make sure, you are Registered to Vote and have obtained a Voting Form online, or via post, and are ready to vote on Thursday 4th May 2023.\nWebteam\nFor Jack Packman\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_charlotte-silver/content_100.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_street-cleansing-by-residents/content_95.html": "STREET CLEANSING - BY RESIDENTS\n- Mr Paul Holton\n- Feb 11, 2023\n- 2 min read\nIf the Council cannot provide staff, its literally left down to the residents to clean our streets, as a Labour candidate Jack attended the Council meeting on Thursday, and its a good job both him and local residents planned a street clean over the weekend, as it seems efforts are in vain, for more cleansing officers.\nOn Thursday evening during Thanet District Council meeting, our Labour party members put forward an amendement for street cleansing officers, meaning we could have dedicated street cleaning staff, unfortunately this was rejected by the Conservative Party, residents are fed up. Residents pay taxes, but should they have to clean our streets.\nLatest News: Jack revealed on Facebook\n\"Great being out this morning with other Dane Valley Residents! Huge thank you to Doug Knight for leading and organising the litter pick!\nWe managed to pick up some serious amount of litter and residents made it clear they are fed up with living in an area full of rubbish! This is why Labour put forward an amendment for street cleansing officers which was rejected by the Conservatives on Thursday evening!\nHuge thank you to all the residents who have come out and taken pride in our #community\"\nIn a separate Facebook post, Jack went on to personally thank, local residents, for all their help. Jack said: \"Fabulous turnout and efforts from local residents - huge thank you to everyone\"\nNEED HELP, WE'VE ADDED SOME LINKS\nMAKE SURE TO SUBSCRIBE\nTo recieve News Updates\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier place to live and work.\nWebteam For Jack Packman For updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_ward-dane-valley/content_55.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_endorsed-by-co-operative/content_33.html": "ENDORSED BY CO-OPERATIVE\n- Mr Paul Holton\n- Mar 4, 2023\n- 1 min read\nJack took to Facebook to announce, his endorsement by the Co-Operative Party, for his standing, as Labour Candidate for Dane Valley Ward, this adds to the growing support for the up-and-coming Local Elections on Thursday 4th May.\nJack added on his Facebook Page: \"Privileged and honoured to be endorsed by the Co-operative party to stand in the local elections on 4th May!. !\"\nVOTING IN PERSON\nMake sure to get registered to vote!\nGet Photographic Identification!\nKnow where the Polling Stations are!\nPOSTAL VOTING\nPhotographic ID - NOT Required for Postal Vote!\nMake sure to get registered to vote!\nComplete the Postal Vote forms!\nSend in the Postal Vote Forms!\nFor more information see: Voting Information Page\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nWebteam\nFor Jack Packman\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support! To receive News Updates Subscribe.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_register-check-photo-id-vote/content_63.html": "REGISTER - CHECK PHOTO ID - VOTE\n- Mr Paul Holton\n- Jan 31, 2023\n- 2 min read\nUpdated: Feb 12, 2023\nMAKE SURE YOU ARE FULLY REGISTERED TO VOTE\nMake sure to Register to Vote, as local elections are taking place in Thanet on Thursday 4 May and, for the first time, you will need to bring an accepted form of photo ID to the polling station when you go to vote. If you cannot attend the polling station, you can do your vote by proxy, but postal votes must be done.\nPHOTO ID:\nAccepted forms of photo ID:\nA passport issued by the UK, Channel Islands, the Isle of Man, a British Overseas Territory, an EEA state or a Commonwealth country.\nA photographic driver’s license issued by the UK, Channel Islands, the Isle of Man, or an EEA state (including provisional).\nA European Economic Area (EEA) photographic ID Card.\nA UK Biometric Residence Permit.\nAn identity card bearing the Proof of Age Standards Scheme hologram (PASS card).\nA Blue Badge.\nAn Oyster 60+ Card.\nA concessionary travel pass funded by HM Government or local authority (e.g. a Kent County Council Bus Pass or a Disabled Person’s Bus Pass).\nOnly original documents will be accepted (NOT scanned images or copies); expired documents will be accepted if the photo is still a current likeness.\nIF YOU - DO NOT HAVE - ID\nGET A FREE - VOTER AUTHORITY CERTIFICATE\nIf you do not have any of the accepted photo ID, and you want to vote at the polling station, you will need to apply for a free Voter Authority Certificate (a free, photographic identification document specifically for the purposes of voting) - you can do that at https://www.gov.uk/apply-for-photo-id-voter-authority-certificate\nPOSTAL VOTING - PROXY VOTING\nVOTING FROM HOME - OR SEND SOMEONE\nIf you would rather not worry about obtaining a suitable photo ID, you can always request a postal vote or vote by proxy, as a photo ID is currently not required for these two voting methods.\nMore info at https://www.thanet.gov.uk/info-pages/voter-id\nTo VOTE for Jack please make sure, you are Registered to Vote and have obtained a Voting Form online, or via post, and are ready to vote on Thursday 4th May 2023. Webteam For Jack Packman For updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_general-8/content_12.html": "Education & SEND\nEvery child deserves the chance to reach their full potential, regardless of their background or needs. We are dedicated to building an inclusive, fully-funded education system that supports every child and tackles the inequalities holding them back.\n-\nFully Funded Schools: Years of underfunding have left our schools struggling to provide the quality education every child deserves. We will campaign for fair funding for all schools, ensuring they have the resources to invest in teachers, facilities, and extracurricular activities that enrich young people's lives.\n-\nTackling Inequality in Education: No child’s future should be determined by their postcode or family income. We will work to close the attainment gap by supporting targeted interventions, free school meals and free breakfast clubs for those in need, and access to digital devices and learning resources for every student.\n-\nPromoting Mental Health Support: Schools are on the frontline of the youth mental health crisis. We will advocate for dedicated mental health support in every school, with fully trained counsellors and early intervention programmes to support young people’s wellbeing.\n-\nImproving SEND Services: Children with Special Educational Needs and Disabilities (SEND) deserve timely, personalised support to help them thrive. We'll push for increased investment in SEND services, reducing waiting times for assessments and ensuring Education, Health and Care Plans (EHCPs) are delivered quickly and effectively.\n-\nSupporting Families and Inclusion: Families with SEND children often feel unheard and unsupported. We will fight for greater transparency, better communication, and more specialist provision in mainstream schools to ensure every child can access the right education in their local community.\nNo child should be left behind. By investing in education and SEND services, we will create a system where every child – no matter their background or abilities, can succeed and thrive.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_residents-views/content_38.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_highways/content_122.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_team-4/content_8.html": "I’ve lived and worked in Kent my most of my working life and am deeply connected to this community. I understand the unique challenges that local people face, and with my background in housing, community services, and public safety, I’m now seeking to represent the residents of Kent in the upcoming County Council elections.\nCurrently, I work as a Regional Place Manager in Housing, where I address key issues residents face daily, from rent arrears to mental health struggles and overall community wellbeing. I understand social housing inside and out and have a strong sense of empathy for the difficulties people face. At 24, I began my management career with Social Enterprise Kent as a Contract Manager, responsible for delivering East Kent’s community navigation services, tackling social isolation, loneliness, and addressing healthcare, social care, and community health needs.\nI left university with a degree in Policing and have since gained valuable experience in Community Safety, which has equipped me with deep knowledge of how essential safety and well-being are in our neighborhoods.\nIn 2023, I was elected as a Thanet District Councillor for Dane Valley, and for the past 15 years, I’ve been heavily involved in the community. I currently serve as Chair of Governors at Northdown Primary School and previously as a Governor at Drapers Mills. I’ve worked on major local events, such as the Margate Carnival and Margate Christmas events, and founded the Dane Valley Residents Association. Additionally, I’ve volunteered as an adult in the RAF Air Cadets and was recently honored to become the Mayor of Margate.\nAs a candidate for Kent County Council, I’m dedicated to improving the lives of our residents and working towards a safer, fairer, and more prosperous future for Kent. I believe in the power of collaboration, working closely with local organisations, public services, and residents to bring about positive change. I am passionate about making Kent a place where everyone can thrive, and I’ll work tirelessly to ensure our communities are safe, vibrant, and supported.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_contact/content_9.html": "top of page\nCONTACT ME\nFor press and general inquiries, contact via the following details today:\nAsk me a question, offer your support, and keep up to date with my campaign to be your Local Labour Councillor Candidate for Dane Valley.\nYou can email me directly by completing the form above or by emailing:\nSOCIAL MEDIA\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_canvassing/content_37.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_local-elections/content_110.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_road-safety-unit/content_117.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_gallery/content_22.html": "top of page\nCllr Jack Packman\nCouncillor\nAbout\nMayor\nCouncillor\nDane Valley\nKCC Pledges\nAdult Social Care & The NHS\nYouth & Community Services\nEducation & SEND\nCommunity Safety\nThe Environment\nTransport, Road Safety & Highways\nGallery\nContact\nSocial media\nExternal Links\nGet Involved\nVote\nMore\nUse tab to navigate through the menu items.\nSUBSCRIBE\nGALLERY\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_making-communities-safer/content_54.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_vote-at-polling-station/content_39.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_canvassing-really-strong-response-from-residents/content_31.html": "CANVASSING - REALLY STRONG RESPONSE FROM RESIDENTS\n- Jack Packman\n- Feb 13, 2023\n- 1 min read\nUpdated: Feb 19, 2023\n\"Today, I was back out on the streets, along with fellow councillors and candidates, including Polly Billington, Martin Boyd, Ruth Duckworth, Helen Whitehead, and supporters including Paul Holton, who brought his cameras, (Paul also manages my website) \"\n\"We were all once again out and about, in the Dane Valley area, canvasing and talking to local residents\"\nDANE VALLEY CANDIDATES\nMartin Boyd, and Ruth Duckworth (Pictured with me)\n\"It' is always good to listen to residents about their genuine issues and concerns, relating to themselves and the local community as a whole\".\n\"This is so important as it gives us and our fellow candidates a real sense of what is important, to residents and how their voice can be carried by their local councillors, and candidates within the local council, us giving them a local voice as voters, and potential voters.\"\nTHANKS FOR THE SUPPORT\nPolly Billington, and Helen Whitehead (Pictured with me)\n\"Many thanks to the local residents for taking time to talk with us, and give their honest views and opinions, as well as offering their support, and special thanks also to Polly and Helen, for taking the time to canvass with Martin Boyd, Ruth Duckworth, and myself\".\nMany thanks\nStanding along with Martin Boyd, and Ruth Duckworth\nFor Dane Valley, Margate, Kent\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_website-available-on-all-tech/content_13.html": "WEBSITE - AVAILABLE ON ALL TECH\n- Mr Paul Holton\n- Feb 19, 2023\n- 1 min read\nThis website has been extensively tested and has been built to be made available on all tech including Mobile Smartphones, Tablets, Laptops, and Computers. By also using Smart QR Codes, which means anyone can show the code to others for them to scan, making sharing in person easier.\nTo scan the QR Codes, simply open either the camera of your smartphone, and hold over the code, or open up your QR Code app and do the same. Then simply click on the link, to visit the site.\nThe website has been designed to be made user-friendly to everyone, including those who may not necessarily be tech-savvy, the site is easy to navigate, and it's easy, for everyone to be kept up to date with what Jack is up to, news updates, and latest events.\nNEED HELP, WE'VE ADDED SOME LINKS\nMAKE SURE TO SUBSCRIBE\nTo receive News Updates\nVOTE - THURSDAY 4TH MAY 2023\nVoting stations have been added to the Vote information page\nPlease make sure to share the website with friends, and support Jack, any help and support is appreciated.\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nWebteam\nFor Jack Packman\nFor updates from Jack, make sure to subscribe to this website, and follow him on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_events-1/content_49.html": "top of page\nEVENTS\nFeatured Event\nNo events at the moment\nNEWS UPDATES\nMake sure to check out the main news page, for news and updates.\nTo never miss an update, please make sure to subscribe to this website, you only need to subscribe once!.\nUpdates from Jack, and News about the Dane Valley Area.\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_thanet-south/content_51.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_margate-task-force/content_116.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_general-4-1/content_11.html": "Youth & Community Services\nInvesting in young people is investing in the future of our community. We are committed to protecting and enhancing vital youth and community services that provide essential support, guidance, and opportunities for young people to thrive.\n-\nDefending Youth Clubs & Community Centres: We will stand against the closure of key services like Millmead Children's Centre and Pie Factory Music, which are currently under threat due to Tory mismanagement of budgets and chronic underinvestment in youth services. These spaces provide a lifeline for young people, offering safe environments where they can learn, socialise, and receive crucial support.\n-\nExpanding Opportunities for Young People: Every young person deserves access to positive activities and opportunities. We will push for more funding for youth clubs, sports programmes, and creative arts projects that give young people the chance to develop skills, build confidence, and realise their potential.\n-\nEarly Intervention & Mental Health Support: Youth services play a critical role in preventing mental health crises and supporting young people before they reach breaking point. We will advocate for better access to mental health services and counselling within community hubs and youh workers in schools.\n-\nTackling Inequality in Access: No young person should miss out on services due to where they live or their family’s financial situation. We will fight to ensure youth services are accessible, inclusive, and fairly funded across all communities.\nWe believe every young person deserves the best start in life – not broken promises and cuts to the services they rely on. It's time to put investment in youth services at the heart of our community's future.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_community-policing-team/content_77.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post______website/content_41.html": "OFFICIAL LAUNCH OF THE WEBSITE\n- Jack Packman\n- Mar 14, 2023\n- 2 min read\nMake sure to like & share this page online!\n\"Really pleased to be launching my website! A huge thanks to Paul Holton for working with me to create and maintain the site. The website is designed to allow local residents to get to know me, and my campaigns and to be able to find out about local information, to keep updated please feel free to subscribe to the website!\"\n\"I posted on Facebook, so, please make sure to like, comment and share online\"\n\"As you all know, I am standing for the Dane Valley ward as your local councillor.\nMany thanks, to Paul Holton, who has worked hard on the website, we are finally launching my official website, make sure to check it out and please, share it with friends www.jackpackman.co.uk\nThe website will be an extension of my online presence, and will enable me, to show how determined, and serious I value the local community, helping to keep everyone updated, together I want to make a difference, for the better.\nAlong with Martin Boyd, and Ruth Duckworth, we believe together, we can make a real change, especially in Dane Valley.\nEvery week, we will be out and about, canvassing residents.\nWe don’t just want your votes, we want to listen to your views and opinions, to help us, tackle local issues.\nYou can SUBSCRIBE to the website, sign up as a valued helper, or just simply receive updates but don’t worry, I will be still very much active on Facebook and Twitter, but your continued support to me, along with fellow candidates, and with the help of supporters including Paul, and fellow labour members.\nI hope, together we will gain your vote at the polling station on Thursday 4th May.\nDon’t forget if you’re not registered to vote, you need to register to vote, before Monday 17th April, and have Photographic ID, or you can vote by postal vote, or vote by proxy, but you need to be registered as a voter.\"\nMany thanks\nStanding along with Martin Boyd, and Ruth Duckworth\nFor Dane Valley, Margate, Kent\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_local-councillor/content_60.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_profile_info_profile/content_101.html": null,
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_my-community-voice/content_102.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_mayor/content_52.html": "MAYOR OF MARGATE\nCllr. Jack Packman to whom is Dane Valley Ward District Councillor was given the honor of being nominated and elected Mayor of Margate for 2024.\nThe Mayoralty\nAt the time of the Norman Conquest, the Sovereign appointed the chief magistrates of cities. That of London was called the Port Reeve, but Henry II changed the word to the Norman \"Maire\" - our term Mayor. King John made the office annual.\nThe rights and privileges of the Mayor in the middle ages were almost unbelievable by today's standards. As chief magistrate he held awesome power over his fellow citizens and his privileges and income from various offices, were second only to the Sovereign.\nWhat are the duties of a Mayor?\nMuch can be written of the history of the Mayoralty, and as such one would be writing the history of England. The Mayoralty provides a vital link with our heritage, the office having presided over the unfolding fabric of English Local Government. The duties and privileges of the Mayor have reflected the changes in our Society. The Mayor no longer has absolute powers; they chair the meetings of Margate Charter Trustees and act in a ceremonial role at local, state and many other functions.\nThey are the Town's Ambassador at large, and have many engagements during their year of office, ranging from Coffee Mornings and Theatre Visits, meeting members of the Royal Family when in Margate, to patronising local Charities and fund raising events.\nLike most English institutions, the Mayoralty has evolved to reflect the times in which they serve in office. However, unlike some outmoded and dated titles that have suffered the fate of not moving with the times, the office and status of Mayor is alive and well, and will undoubtedly pass on into the 21st Century.\nHow does the Mayor achieve office?\nSince the last re-organisation of Local Government in 1974, the Mayor is elected by the Charter Trustees and takes up the Badge of Office in May at the annual Mayor Making Ceremony. The Mayor appoints a Mayoress, and by ancient custom if the Mayor is a woman, still appoints a Mayoress, being known herself as Mr Mayor, or Madam Mayor.\nA list of Mayors since 1857 can be seen in the Margate Museum of Local History.\nThe Badge of Office and the Mayoral Chain\nThe badge of office is a tradition dating back to the age of chivalry when Officers of State and Local Government were more readily identifiable by their and \"badges of rank and office\". Today the badge is symbolic, is supported by a chain. The chain is often referred to as the chain of office, another myth that has been handed down through time to the present day.\nThe Mayoral Chain was presented.\nCllr Jack Packman received the chains and badge of office. His Mayoress is Mrs Karen Brinkman",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_councillor/content_62.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_dane-valley/content_107.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_labour-councillor/content_74.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_official-website/content_86.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_call-for-20-is-plenty-speed-limit/content_65.html": "CALL FOR 20 IS PLENTY - SPEED LIMIT\n- Mr Paul Holton\n- Feb 8, 2023\n- 3 min read\nCalls by Jack Packman, for 20mph zone and chicanes in Dane Valley Road following serious crashes, over the years a number of crashes and near misses have given Jack good cause to get involved, and do something about this.\n20 IS PLENTY - SIGN THE PETITION - FOR 20 MPH SPEED LIMIT\nJack Packman, with Margate county councillor Barry Lewis to whom is backing the petition and taking the request for the 20mph zone and chicanes to Kent County Council.\nLatest News: Jack revealed on Facebook \"Really positive site meeting with KCC highways today regarding Dane Valley Road and the recent speeding issues!\nThank you to KCC Councillor Barry Lewis, for arranging the meeting and a huge well done to the residents coming together to get action! Next few weeks we will see road surveys to measure the speed of cars and they were exploring how they could improve the road (as seen in the picture) A public meeting will be called in the next few weeks - update to follow\"\nPreviously in an article with The Isle of Thanet News, Jack explained the situation, and concerns by the local community, and with both residents and with the support of County Councillor Barry Lewis, they are making progress.\nJack speaking with The Isle of Thanet News said:\n“Residents who live on the Dane Valley Road and surrounding areas are now seriously worried about their safety, their families safety and that of the community.\n“Over the last few years four serious incidents have happened in Dane Valley Road with two in the last three weeks, resulting in near fatalities and serious injuries.\n“It is traumatic for those who live on this road to keep experiencing these incidents as well as having their own cars written off. The current traffic calming measures do not work. The speed bumps are not fit for purpose.\n“The Dane Valley Residents Association is campaigning for a 20mph speed limit which the petition is for and we will be campaigning for Chicanes to be installed.\n“We will be launching a speed watch project in March with recruitment of volunteers starting in February.\n“ I have a meeting with the Police and Crime Commissioner, Area Commander and Chief Inspector of Kent Police on January 14 to address these types of issues in Dane Valley.”\nMargate county councillor Barry Lewis is backing the petition and taking the request for the 20mph zone and chicanes to Kent County Council.\nHe said: “I have reiterated my demand for traffic calming measures on Dane Valley Road, one of the most dangerous roads in Kent.\n“I’ve asked for a 20mph speed limit and chicanes, both of which we have in other areas of Thanet. The present traffic calming measures in that road are inadequate.”\nPreviously on Facebook Jack said: \"Over the weekend we was out talking to residents in Dane Valley about the speeding issues in the area! A lot of residents passionate and wanting to see change to keep themselves and their families safe! One resident has had many cars written off due to the poor driving behaviour! Another resident has nearly been hit twice due to a speeding car! We don’t want to see change when it’s too late and someone innocent is killed! You can support the first step of change by signing the petition\nOne of those who have signed is Hannah Barrs, who says: “I run a children’s group in Dane Valley and fear that another serious accident will happen. People use Dane Valley road as a race track.”\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier place to live and work.\nWebteam For Jack Packman For updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_user-friendly/content_72.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_katie-pope/content_121.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_canvassing-with-katie-and-leo/content_76.html": "CANVASSING - WITH KATIE AND LEO\n- Mr Paul Holton\n- Feb 25, 2023\n- 1 min read\nToday Jack has been back, out and about supporting his fellow candidates Katie Pope, and Leo Britcher in Margate, it's always good to meet residents and to hear their valuable insight and opinions, which helps candidates tremendously.\nJack added some more photos and comment, on his Facebook Page: \"Out and about in Connaught road with the Labour candidates Katie Pope and Leo Britcher listening to residents, tackling local issues and trying to make Thanet better.\n4th May - vote Labour, remember your photo ID!\"\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nWebteam\nFor Jack Packman\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support! To receive News Updates Subscribe.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_get-alerts/content_91.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_helen-whitehead/content_82.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_residents-association/content_35.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_driver-safety/content_104.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_ruth-duckworth/content_61.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_twitter/content_113.html": "top of page\nCllr Jack Packman\nCouncillor\nAbout\nMayor\nCouncillor\nDane Valley\nKCC Pledges\nAdult Social Care & The NHS\nYouth & Community Services\nEducation & SEND\nCommunity Safety\nThe Environment\nTransport, Road Safety & Highways\nGallery\nContact\nSocial media\nExternal Links\nGet Involved\nVote\nMore\nUse tab to navigate through the menu items.\nSUBSCRIBE\nTWITTER\nTWITTER\nWEBSITE UPDATES\nFor Website News, and Updates, visit my\nNews Page\n, and for up-and-coming events, check out the\nEvents Page\n.\nNEWS\nEVENTS\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_general-8-1/content_56.html": "The Environment\nOur environment is one of Kent’s greatest assets, and we are committed to protecting and enhancing our natural beauty for future generations. We will take bold action to address the climate crisis, promote sustainability, and support local biodiversity.\n-\nPromoting Green Energy: We will champion investment in renewable energy projects such as solar, wind, and community energy schemes, helping Kent transition to a low-carbon future. We'll support local initiatives that empower communities to generate their own clean energy and reduce reliance on fossil fuels.\n-\nReducing Waste & Increasing Recycling: Tackling waste is vital to protecting our environment. We'll push for better recycling facilities, expanded food waste collections, and education campaigns to help residents reduce, reuse, and recycle. We will work to eliminate single-use plastics from public services and promote local refill schemes.\n-\nRestoring & Protecting Green Spaces: Kent’s parks, woodlands, and coastlines are precious natural habitats. We'll support tree planting programmes, community gardens, and the protection of existing green spaces from unnecessary development. We'll work with local groups to ensure accessible, well-maintained outdoor spaces for everyone to enjoy.\n-\nImproving Air Quality: Poor air quality poses a serious risk to health and the environment. We will advocate for clean air zones, greater investment in public transport, and safe cycling and walking routes to reduce pollution across our communities.\n-\nSupporting Local Biodiversity: Biodiversity is essential to a healthy environment. We'll promote wildlife-friendly planting, protect local nature reserves, and support farmers in adopting sustainable practices to boost local biodiversity.\n-\nCommunity-Led Environmental Action: We believe that local people should have a say in shaping their environment. We'll support community-led environmental projects, climate action groups, and educational programmes to empower residents to take action on climate change.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_winter-warmth/content_28.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_thanks-to-kent-police/content_70.html": "THANKS TO KENT POLICE\n- Jack Packman\n- Feb 24, 2023\n- 1 min read\n\"A huge thank you to Kent Police for their action on Saturday whereby, officers from the Road Safety Unit, along with the Community Policing Team and Margate Task Force worked together to tackle the issue of anti-social driving in the area. \"\n\"It’s great to see them listening to local residents and this follows an outcome of the meeting had with Matthew Scott police and crime commissioner and Inspector Swallows\"\nMatthew Scott Kent Police and Crime Commissioner (Pictured)\n\"There are more action days to come and great to see Dane Valley being policed. A long way to go but a start!\nPolice teams carry out road safety operations in Dane Valley\nMore updates and information can be found on the Isle of Thanet News, and Kent Police Websites:\nMany thanks\nStanding along with Martin Boyd, and Ruth Duckworth\nFor Dane Valley, Margate, Kent\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_community/content_99.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_20-is-plenty/content_115.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_crime-and-crime-prevention/content_90.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_photo-id/content_118.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news/content_10.html": "top of page\nSearch\nTHANKFUL FOR THE SUPPORT\nTime to focus on a new chapter! Thanks to everyone for the support over the last 15 years!\nMar 17, 2023\n95\nEVENT NEWS - DANE VALLEY RESIDENTS ASSOCIATION MEETINGS\nCheck out all the very latest event news, including Dane Valley Residents Association dates!\nMar 15, 2023\n48\nOFFICIAL LAUNCH OF THE WEBSITE\nLaunching my official website www.jackpackman.co.uk, make sure to check it out, and please subscribe!\nMar 14, 2023\n10\nCONGRATULATIONS TO CHARLOTTE\nCongratulations to Kent Women in Business Award winner Charlotte Silver! Well done!\nMar 10, 2023\n67\nHOME INSULATION AND ACCESS TO FUNDS\nInsulation and access to funds you are eligible for! Thanet District Council has a great Home Energies team who are on hand\nMar 9, 2023\n13\nENDORSED BY CO-OPERATIVE\nPrivileged and honoured to be endorsed by the Co-operative party to stand in the local elections on 4th May!\nMar 4, 2023\n5\nCONGRATULATIONS - POLLY BILLINGTON\nI just wanted to congratulate Polly Billington, for being selected as The Labour Party MP candidate for South Thanet\nMar 1, 2023\n19\nCANVASSING - WITH KATIE AND LEO\nOut and about Canvassing with Katie Pope, and Leo Britcher in Margate!\nFeb 25, 2023\n23\nTHANKS TO KENT POLICE\nOfficers from the Road Safety Unit, along with the Community Policing Team and Margate Task Force worked together in Dane Valley, Margate\nFeb 24, 2023\n17\nVOTING BY POST - EASY\nPostal Votes, is easier, quicker, and safer for you. It also does not require Proof of Identification (ID).\nFeb 23, 2023\n4\nWEBSITE - AVAILABLE ON ALL TECH\nWebsite made easy to navigate, user\nfriendly available on smartphones, tablets, laptops, and computers.\nFeb 19, 2023\n12\nCANVASSING - REALLY STRONG RESPONSE FROM RESIDENTS\nToday, I was back out on the streets, along with fellow councillors and candidates, including Polly Billington, Martin Boyd, Ruth Duckworth\nFeb 13, 2023\n21\nSTREET CLEANSING - BY RESIDENTS\nResidents take to the streets to clean/litter pick, as council rejects an amendment for cleansing officers!\nFeb 11, 2023\n8\nCALL FOR 20 IS PLENTY - SPEED LIMIT\nSign the Petition, as calls by Jack Packman and Kent County Councillor Barry Lewis for 20 is Plenty!\nFeb 8, 2023\n7\nMY COMMUNITY VOICE - KENT POLICE\nSign up to My Community Voice - a great online tool where you receive updates from Kent Police as well as you being able to comment\nFeb 8, 2023\n8\nTALKING TO RESIDENTS - CANVASING\nJack was out in Dane Valley again this afternoon talking to residents about local issues and the up and coming elections!\nFeb 5, 2023\n17\nREGISTER - CHECK PHOTO ID - VOTE\nRegister to Vote, Check your Photo ID, and Vote at the polling station, or Vote by Post via Proxy vote!\nJan 31, 2023\n10\nJACK PACKMAN - ANNOUNCEMENT\nJack announced online, he is standing for local elections to become a TDC Councillor on Thursday 4th May 2023\nJan 30, 2023\n77\nLATEST NEWS\nEVENT NEWS\nMake sure to check out the events page, for up and coming events.\nTo never miss an update, please make sure to subscribe to this website, you only need to subscribe once!.\nUpdates from Jack, and News about the Dane Valley Area.\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_profile_mrpaulholton_profile/content_78.html": null,
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_candidate/content_88.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_general-8-3/content_3.html": "Transport, Road Safety & Highways\nA safe, reliable, and accessible transport system is essential for connecting communities, supporting local businesses, and protecting our environment. We are committed to transforming Kent’s transport network with sustainable, affordable, and efficient solutions that work for everyone.\n-\nTransport for Kent Pilot Scheme: We will launch a pilot 'Transport for Kent' model, a publicly accountable transport network designed to coordinate bus, train, and community transport services under one system. This model will prioritise affordable, reliable, and accessible services across the county, particularly in rural and underserved areas.\n-\nImproving Bus Services & Green Transport Solutions: We will pilot a 'Transport for Kent' model to bring greater coordination, accountability, and affordability to local bus services. Our focus will be on making services more reliable, frequent, and accessible – especially in rural areas where public transport options are currently limited. We'll champion low-emission and electric buses to help cut carbon emissions and improve air quality.\n-\nBetter Road Safety Measures: Every resident should feel safe on Kent’s roads. We will push for new pedestrian crossings, cycle-friendly routes, and improved lighting in high-risk areas. We'll also campaign for stricter speed limit enforcement and the introduction of traffic calming measures in accident hotspots to protect both pedestrians and drivers.\n-\nTackling Unnecessary Roadworks & Disruption: Endless roadworks and poor coordination cause frustration and disruption across Kent. We will call for a planned schedule of maintenance that prioritises essential repairs, reduces unnecessary roadworks, and ensures better communication with residents. This will include tighter regulation of utility companies to minimise disruption and speed up works.\n-\nFixing Potholes and Highways Maintenance: Potholes and poorly maintained roads are a danger to all road users. We will demand greater investment in road maintenance, focusing on a comprehensive pothole repair programme that prioritises the worst-affected areas. We'll work to ensure repairs are carried out quickly, effectively, and to a high standard, preventing repeat issues and making roads safer.\n-\nHighways Maintenance & Pothole Repairs: Years of underinvestment have left our roads in a poor state. We will fight for greater investment in road maintenance, with a focus on repairing potholes, resurfacing damaged roads, and improving drainage systems. Our approach will ensure repairs are completed quickly, to a high standard, and without unnecessary disruption.\n-\nPromoting Active Travel: We want to make walking and cycling safer and more attractive for everyone. We'll work to create joined-up cycling networks, pedestrian-friendly streets, and secure bike storage facilities across Kent.\n-\nAccessible Transport for All: Every resident should be able to access reliable, affordable transport. We'll push for improved accessibility on buses, trains, and stations, with more community transport options for older residents and those with disabilities.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_standing/content_108.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_news-update/content_85.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_vote-labour/content_93.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_community-safety/content_114.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_home-insulation-and-access-to-funds/content_21.html": "HOME INSULATION AND ACCESS TO FUNDS\n- Mr Paul Holton\n- Mar 9, 2023\n- 1 min read\nIt has become extremely cold again and many residents across Thanet are sitting in the freezing cold because they cannot afford to heat their homes!\nInsulation and access to funds you are eligible for is the answer! Thanet District Council has a great Home Energies team who are on hand to support residents across Thanet!\nWithout home insulation, we can lose up to 85% of heat, out of our homes, by insulating, we can stay warm, and save on Electric, gas, and water bills.\nThere is support out there, you just have to reach out for it! Complete the form, and they will be in touch with you to see if they can help!\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nWebteam\nFor Jack Packman\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support! To receive News Updates Subscribe.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_road-safety/content_68.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_event-news-dane-valley-residents-association-meetings/content_30.html": "EVENT NEWS - DANE VALLEY RESIDENTS ASSOCIATION MEETINGS\n- Mr Paul Holton\n- Mar 15, 2023\n- 1 min read\nMake sure to like & share this page online!\nMake sure to check out our events pages, for information on up-and-coming residents, and local community events happening within the Dane Valley and Margate area, including Residents association meetings, Margate Carnival, Margate Christmas Lights event, and of course Local Election date, you, can register, on the FREE guestlists on all events, this helps Jack understand how many people are due to attend, and also, enables updates about events to be shared.\nRESIDENT ASSOCIATION MEETINGS UPDATE\nThe next set of Dates for Dane Valley Residents Association meetings, whereby residents can meet, discuss topics, and bring up matters arising from their concerns regarding the local area. Meetings are beneficial to the local community and also help to keep all residents informed and updated.\nVisit and share our Events page: https://www.jackpackman.co.uk/events-1\nJack took to Facebook to announce \"The next lot of Dane Valley Residents Association meeting dates just released! \"\nTo VOTE for Jack please make sure, you are Registered to Vote and have obtained a Voting Form online, or via post, and are ready to vote on Thursday 4th May 2023.\nWebteam\nFor Jack Packman\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_postal-votes/content_94.html": "VOTING BY POST - EASY\n- Mr Paul Holton\n- Feb 23, 2023\n- 1 min read\nPOSTAL VOTING\nVOTING FROM HOME\nIf you cannot attend the polling station, you can do your vote by postal vote. Postal Votes, is easier, quicker, and safer for you. It also does not require Proof of Identification (ID).\nIf you would rather not worry about obtaining a suitable photo ID, voting by postal vote would be best for you.\nMORE ON VOTING - VOTE PAGE\nTo VOTE for Jack please make sure, you are Registered to Vote and have obtained a Voting Form online, or via post, and are ready to vote on Thursday 4th May 2023. Webteam For Jack Packman For updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_community-matters/content_112.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_winner/content_50.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_general-4/content_16.html": "Adult Social Care and The NHS\nOur priority is to create a more responsive, accessible, and compassionate healthcare system that meets the needs of all residents.\n-\nReducing Waiting Times & Increasing GP Appointments: We will work to cut down waiting times and expand the availability of GP appointments, ensuring everyone can access timely care. This includes advocating for additional funding to recruit more GPs and support staff, especially in underserved areas. Working with the Intergrated Care Boards, Health and Wellbeing Partners and Public Health.\n-\nImproved Mental Health Support: Mental health is just as important as physical health. We'll push for better mental health services, with faster access to treatment, more community-based support, and increased investment in early intervention programs.\n-\nAccessible Healthcare in Rural Areas: Rural communities often face barriers to healthcare access. We will champion initiatives to improve transport links to healthcare facilities and explore digital solutions like virtual consultations to ensure everyone can access care, no matter where they live.\n-\nInvesting in Adult Social Care: We will support greater investment in adult social care services to ensure that residents receive the care they need to live independently and with dignity. This means fair pay, better training, and stronger career development opportunities for care workers, the backbone of our care system.\nBy prioritising healthcare and social care, we will build a healthier, more resilient community where no one is left behind.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_facebook/content_7.html": "top of page\nCllr Jack Packman\nCouncillor\nAbout\nMayor\nCouncillor\nDane Valley\nKCC Pledges\nAdult Social Care & The NHS\nYouth & Community Services\nEducation & SEND\nCommunity Safety\nThe Environment\nTransport, Road Safety & Highways\nGallery\nContact\nSocial media\nExternal Links\nGet Involved\nVote\nMore\nUse tab to navigate through the menu items.\nSUBSCRIBE\nFACEBOOK\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_mp/content_66.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_press-tv/content_34.html": "top of page\nSearch\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nLATEST NEWS\nEVENT NEWS\nMake sure to check out the events page, for up and coming events.\nTo never miss an update, please make sure to subscribe to this website, you only need to subscribe once!.\nUpdates from Jack, and News about the Dane Valley Area.\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_referee/content_75.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_thanet-district-council/content_42.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_vote/content_53.html": "VOTE\nARE YOU REGISTERED TO VOTE?\n\"To be able to vote, you must first make sure you are registered to vote, this applies to both Ballot Box Voting, Postal Voting, and Vote by Proxy.\"\nREGISTERED - VOTING IN PERSON OR BY POST!\n\"Once you are fully registered to vote, you can vote in person or by post-postal vote!\"\nVOTING AT THE POLLING STATION\nThursday 4th May 2023\nIf you wish to vote for Jack Packman, in the up-and-coming local elections, You must register to vote\nbefore Monday 17 April - and you will need to bring an accepted form of photo ID to the polling station when you go to vote.\nREGISTER TO VOTE\nFor all the information about Registering to vote, you can visit the Thanet District Council's website:\nIf you are not already on the electoral register, you can register to vote in locally, You must register to vote before Monday 17 April - and you will need to bring an accepted form of photo ID to the polling station when you go to vote.. National an\nPHOTOGRAPHIC ID\n\"You have to have Valid Photographic Identification when voting in person\"\nYou can use any of the following acceptable forms of photo ID when voting at a polling station.\nInternational travel\n-\nPassport issued by the UK, any of the Channel Islands, the Isle of Man, a British Overseas Territory, an EEA state or a Commonwealth country\nDriving and Parking\n-\nDriving licence issued by the UK, any of the Channel Islands, the Isle of Man, or an EEA state (this includes a provisional driving licence)\n-\nA Blue Badge\nLocal travel\n-\nOlder Person’s Bus Pass\n-\nDisabled Person’s Bus Pass\n-\nOyster 60+ Card\n-\nFreedom Pass\n-\nScottish National Entitlement Card\n-\n60 and Over Welsh Concessionary Travel Card\n-\nDisabled Person’s Welsh Concessionary Travel Card\n-\nSenior SmartPass issued in Northern Ireland\n-\nRegistered Blind SmartPass or Blind Person’s SmartPass issued in Northern Ireland\n-\nWar Disablement SmartPass issued in Northern Ireland\n-\n60+ SmartPass issued in Northern Ireland\n-\nHalf Fare SmartPass issued in Northern Ireland\nProof of age\n-\nIdentity card bearing the Proof of Age Standards Scheme hologram (a PASS card)\nOther government-issued documents\n-\nBiometric immigration document\n-\nMinistry of Defence Form 90 (Defence Identity Card)\n-\nNational identity card issued by an EEA state\n-\nElectoral Identity Card issued in Northern Ireland\nYou will only need to show one form of photo ID. It needs to be the original version and not a photocopy.\nPOLLING STATIONS - DANE VALLEY\nSure Start, Dane Valley Rd, Dane Valley, Margate CT9 3RU\nTrinity Community Resource Centre, St. Marys Avenue, St Mary's Ave, Dane Valley, Margate CT9 3TN\n1st Margate (St John's) Scout Group, Durban Rd, Margate CT9 2TE\nPOSTAL VOTE\nFor all the information about Postal Vote, you can visit the Thanet District Council's website:\nYou can apply for a postal vote by completing the online request and they will send you an application form for you to complete, sign and return. (See Below)\nAlternatively, you can download, print, and complete a postal vote application form. (See Below)\nAll forms must be returned to:\nElectoral Services\nThanet District Council\nCecil Street\nMargate CT9 1XZ\nTelephone: 01843 577500\nVOTE BY PROXY\nAll Vote by proxy forms must be returned by 5 pm Tuesday 27th April 2021 to register for proxy vote:\nYour application must provide the reason why you are unable to vote in person.\nThe appointed person must be 18 or over on the date of the election, and either a citizen from the UK, a qualifying commonwealth country, the Republic of Ireland or a member of the European Union. They must be willing to vote at your polling station. As a proxy, you can only vote on behalf of two people at any election, unless they are close family members.\nYou can apply for a proxy vote by completing our online request and we will send you out an application form for you to complete, sign and return.\nAlternatively, you can download, print and complete a proxy vote application form.\nAll forms must be returned by 5 pm Tuesday 27th April 2021 to:\nElectoral Services\nThanet District Council\nCecil Street\nMargate CT9 1XZ",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_access-to-funds/content_87.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_dane-valley-community/content_89.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_meetings/content_105.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_jack-packman-announcement/content_45.html": "JACK PACKMAN - ANNOUNCEMENT\n- Mr Paul Holton\n- Jan 30, 2023\n- 1 min read\nAfter working in and around the local community for a good few years, finally after months, of working behind the scenes, Jack was finally ready to announce, on his Social Media.\nJack took to Facebook, to make the announcement.\nAs you can read, Jack writes: \"I will be standing for election to become a TDC councillor on Thursday 4th May elections. Really excited and honoured to be selected as a candidate for Dane Valley Ward alongside Cllr Ruth Duckworth and Martin Boyd! I would love to hear from you and your views and can contact me at info@jackpackman.co.uk #LocalElections2023 #positivity #communitymatters\"\nTo VOTE for Jack please make sure, you are Registered to Vote and have obtained a Voting Form online, or via post, and are ready to vote on Thursday 4th May 2023.\nWebteam\nFor Jack Packman\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_thanet-district-council/content_71.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_register-to-vote/content_98.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_online-press-blogs/content_32.html": "top of page\nSearch\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nLATEST NEWS\nEVENT NEWS\nMake sure to check out the events page, for up and coming events.\nTo never miss an update, please make sure to subscribe to this website, you only need to subscribe once!.\nUpdates from Jack, and News about the Dane Valley Area.\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_smartphones/content_79.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_leo-britcher/content_123.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_local-events/content_36.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_jackpackman/content_46.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_community-cleansing/content_124.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_kent-women-in-business/content_19.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_my-community-voice-kent-police/content_20.html": "MY COMMUNITY VOICE - KENT POLICE\n- Mr Paul Holton\n- Feb 8, 2023\n- 2 min read\nSign up to My Community Voice - a great online tool where you receive updates from Kent Police as well as you being able to comment and upload your views!\nAs part of Kent Police's commitment to keeping Kent a safe place to live, work and visit, they have invested in supporting our communities. Their neighborhood policing teams fully appreciate the impact local problems can cause. They want to work with local residents and businesses to make sure they are working together in addressing the issues that matter the most to the public, to improve things, and to make a difference in the communities they serve.\nTo encourage this conversation, Kent Police have launched My Community Voice (MCV) which gives local people a say in how we approach our neighbourhood policing priorities and work with local partners. MCV is a two-way engagement tool that allows you to tell the Police about issues in our/your area and will allow them to create a personalised policing response.\nMany of the issues in our communities can only be tackled by us all working together and MCV is part of our efforts to achieve this. Not everything can be solved by the police, but if the issues that are raised are relevant for other agencies such as local authorities, fire service, health, and social care, they will work with those agencies to make them aware of the concerns.\nFor more information check out the video, which explains verbally with graphics.\nMy Community Voice is a messaging service that helps Kent and Medway residents, businesses, and community groups to keep in touch with their local policing teams. The service sends updates about your local area directly from the police officers themselves.\nMy Community Voice is more than just a messaging service; it allows you to reply to the alerts we send you, share information and tell us about the issues affecting you.\nWe are committed to engaging with communities to increase trust and confidence and to help protect people from harm. Police, partners and the public working together can build resilient and safe communities, and both reduce and prevent crime.\nYou will be able to play an active part in police appeals as well as keeping updated in what is happening in your local area.\nThe updates you can choose to receive include:\ncrime prevention\nsafety advice and information\nthe action we have taken on feedback we have received (you said, we did)\nnews\nalerts\nappeals\nengagement events/community meetings\ngeneral policing activities\nrecruitment\nRegistration is quick and free. You are in control as to what you receive and can unsubscribe at any time. Become part of how we shape policing, let’s talk.\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier place to live and work.\nKENT POLICE\nNeed to report a crime, Telephone 101, or for Urgent help Telephone 999 https://www.kent.police.uk\nWebteam For Jack Packman For updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_2023/content_97.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_tablets/content_26.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_dane-valley-community/content_17.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_categories_press-radio/content_80.html": "top of page\nSearch\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nLATEST NEWS\nEVENT NEWS\nMake sure to check out the events page, for up and coming events.\nTo never miss an update, please make sure to subscribe to this website, you only need to subscribe once!.\nUpdates from Jack, and News about the Dane Valley Area.\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_laptops/content_92.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_neighbourhood-watch/content_27.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_get-involved/content_4.html": "top of page\nGET INVOLVED\nJoin Jack Packman, Sign Up Now\nMARTIN, RUTH & JACK - FOR DANE VALLEY\nSupporting Myself along with Martin and Ruth, can be easy as sharing a social media post, liking his posts online, or encouraging others to, or it could be more helpful, whilst he is out and about canvasing, or whilst at events, and meetings.\n\"YOUR SUPPORT IS VALUED\"\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_external-links/content_6.html": "top of page\nEXTERNAL LINKS\nWe have put together some useful external links for the local community, and local area, please let the web team know, if you feel other links may be useful to add.\nMORE LINKS TO BE ADDED\nFEATURED NUMBERS\nEMERGENCY TELEPHONE NUMBERS\nNon-Emergency Telephone - 101\nEmergencies\nTelephone - 999\nCOUNCILLORS LINKS\nHOUSING LINKS\nDISTRICT, BOROUGH\nAshford Borough Council\nCanterbury City Council\nDartford Borough Council\nDover District Council\nFolkestone and Hythe District Council\nGravesham Borough Council\nMaidstone Borough Council\nSevenoaks District Council\nSwale Borough Council\nThanet District Council\nTonbridge & Malling Borough Council\nTunbridge Wells Borough Council\nTOWN & PARISH COUNCILS\nAcol Parish Council\nAcrise Parish Meeting\nAddington Parish Council\nAdisham Parish Council\nAldington & Bonnington Parish Council\nAlkham Parish Council\nAllhallows Parish Council\nAppledore Parish Council\nAsh Parish Council\nAsh-cum-Ridley Parish Council\nAylesford Parish Council\nAylesham Parish Council\nBadgers Mount Parish Council\nBapchild Parish Council\nBarham Parish Council\nBarming Parish Council\nBean Parish Council\nBearsted Parish Council\nBekesbourne with Patrixbourne Parish Council\nBenenden Parish Council\nBethersden Parish Council\nBidborough Parish Council\nBiddenden Parish Council\nBilsington Parish Council\nBirchington Parish Council\nBirling Parish Council\nBishopsbourne Parish Council\nBlean Parish Council\nBobbing Parish Council\nBorden Parish Council\nBorough Green Parish Council\nBoughton Aluph & Eastwell Parish Council\nBoughton Malherbe Parish Council\nBoughton Monchelsea Parish Council\nBoughton under Blean Parish Council\nBoxley Parish Council\nBrabourne Parish Council\nBrasted Parish Council\nBredgar Parish Council\nBredhurst Parish Council\nBrenchley & Matfield Parish Council\nBrenzett Parish Council\nBridge Parish Council\nBroadstairs & St Peters Town Council\nBrook Parish Council\nBrookland Parish Council\nBroomfield & Kingswood Parish Council\nBurham Parish Council\nBurmarsh Parish Council\nCapel Parish Council\nCapel-Le-Ferne Parish Council\nChallock Parish Council\nCharing Parish Council\nChart Sutton Parish Council\nChartham Parish Council\nChestfield Parish Council\nChiddingstone Parish Council\nChilham Parish Council\nChislet Parish Council\nCliffe and Cliffe Woods Parish Council\nCobham Parish Council\nCollier Street Parish Council\nCooling Parish Council\nCowden Parish Council\nCoxheath Parish Coucil\nCranbrook & Sissinghurst Parish Council\nCrockenhill Parish Council\nCuxton Parish Council\nDarenth Parish Council\nDeal Town Council\nDenton with Wootton Parish Council\nDetling Parish Council\nDitton Parish Council\nDoddington Parish Council\nDover Town Council\nDownswood Parish Council\nDunkirk Parish Council\nDunton Green Parish Council\nDymchurch Parish Council\nEast Farleigh Parish Council\nEast Malling & Larkfield Parish Council\nEast Peckham Parish Council\nEast Sutton Parish Council\nEastchurch Parish Council\nEastling Parish Council\nEastry Parish Council\nEdenbridge Town Council\nEgerton Parish Council\nElham Parish Council\nElmsted Parish Council\nEynsford Parish Council\nEythorne Parish Council\nFarningham Parish Council\nFaversham Town Council\nFawkham Parish Council\nFolkestone Town Council\nFordwich Town Council\nFrindsbury Extra Parish Council\nFrittenden Parish Council\nPaddock Wood Town Council\nPembury Parish Council\nPenshurst Parish Council\nPetham Parish Council\nPlatt Parish Council\nPlaxtol Parish Council\nPluckley Parish Council\nPostling Parish Council\nPreston Parish Council\nGodmersham Parish Council\nGoodnestone Parish Council\nGoudhurst Parish Council\nGraveney with Goodnestone Parish Council\nGreat Chart with Singleton Parish Council\nGreat Mongeham Parish Council\nGuston Parish Council\nHackington Parish Council\nHadlow Parish Council\nHalling Parish Council\nHalstead Parish Council\nHarbledown and Rough Common Parish Council\nHarrietsham Parish Council\nHartley Parish Council\nHartlip Parish Council\nHastingleigh Parish Council\nHawkhurst Parish Council\nHawkinge Town Council\nHeadcorn Parish Council\nHerne and Broomfield Parish Council\nHernhill Parish Council\nHever Parish Council\nHextable Parish Council\nHigh Halstow Parish Council\nHigham Parish Council\nHildenborough Parish Council\nHoath Parish Council\nHollingbourne Parish Council\nHoo St Werburgh Parish Council\nHorsmonden Parish Council\nHorton Kirby & South Darenth Parish Council\nHothfield Parish Council\nHougham Without Parish Council\nHunton Parish Council\nHythe Town Council\nIckham & Well Parish Council\nIghtham Parish Council\nIvychurch Parish Council\nIwade Parish Council\nKemsing Parish Council\nKenardington Parish Council\nKennington Community Council\nKings Hill Parish Council\nKingsnorth Parish Council\nKingston Parish Council\nKnockholt Parish Council\nLamberhurst Parish Council\nLangdon Parish Council\nLangley Parish Council\nLeeds Parish Council\nLeigh Parish Council\nLenham Parish Council\nLeybourne Parish Council\nLeysdown Parish Council\nLinton Parish Council\nLittle Chart Parish Council\nLittlebourne Parish Council\nLongfield Parish Council\nLoose Parish Council\nLower Halstow Parish Council\nLower Hardres & Nackington Parish Council\nLuddesdown Parish Council\nLydd Town Council\nLydden Parish Council\nLyminge Parish Council\nLympne Parish Council\nLynsted with Kingsdown Parish Council\nManston Parish Council\nMarden Parish Council\nMeopham Parish Council\nMereworth Parish Council\nMersham Parish Council\nMilstead Parish Council\nMinster Parish Council\nMinster-on-Sea Parish Council\nMolash Parish Council\nMonkton Parish Council\nNettlestead Parish Council\nNew Romney Town Council\nNewchurch Parish Council\nNewenden Parish Council\nNewington (Shepway) Parish Council\nNewington (Swale) Parish Council\nNewnham Parish Council\nNonington Parish Council\nNorthbourne Parish Council\nNorton, Buckland & Stone Parish Council\nOffham Parish Council\nOtford Parish Council\nOtham Parish Council\nQueenborough Town Council\nRamsgate Town Council\nRingwould with Kingsdown Parish Council\nRipple Parish Council\nRiver Parish Council\nRiverhead Parish Council\nRolvenden Parish Council\nRuckinge Parish Council\nRusthall Parish Council\nRyarsh Parish Council\nSaltwood Parish Council\nSandgate Parish Council\nSandhurst Parish Council\nSandwich Town Council\nSeal Parish Council\nSellindge Parish Council\nSelling Parish Council\nSevenoaks Town Council\nSevington with Finberry Parish Council\nShadoxhurst Parish Council\nSheldwich, Badlesmere and Leaveland Parish Council\nShepherdswell with Coldred Parish Council\nSheerness Town Council\nShipbourne Parish Council\nSholden Parish Council\nShoreham Parish Council\nShorne Parish Council\nSmarden Parish Council\nSmeeth Parish Council\nSnodland Town Council\nSouthborough Town Council\nSouth Willesborough and Newtown Community Council\nSpeldhurst Parish Council\nSt James Isle of Grain Parish Council\nSt Margarets at Cliffe Parish Council\nSt Mary Hoo Parish Council\nSt Mary in the Marsh Parish Council\nSt Nicholas at Wade & Sarre Parish Council\nStalisfield Parish Council\nStanford Parish Council\nStansted Parish Council\nStaple Parish Council\nStaplehurst Parish Council\nStelling Minnis Parish Council\nStockbury Parish Council\nStoke Parish Council\nStone Parish Council\nStone-cum-Ebony Parish Council\nStourmouth Parish Council\nStowting Parish Meeting\nSturry Parish Council\nSundridge with Ide Hill Parish Council\nSutton at Hone & Hawley Parish Council\nSutton by Dover Parish Council\nSutton Valence Parish Council\nSwanley Town Council\nSwanscombe & Greenhithe Town Council\nSwingfield Parish Council\nTemple Ewell Parish Council\nTenterden Town Council\nTeston Parish Council\nTeynham Parish Council\nThrowley Parish Council\nThurnham Parish Council\nTilmanstone Parish Council\nTonge Parish Council\nTovil Parish Council\nTrottiscliffe Parish Council\nTunstall Parish Council\nUlcombe Parish Council\nUpchurch Parish Council\nUpper Hardres Parish Council\nVigo Parish Council\nWalmer Parish Council\nWaltham Parish Council\nWarehorne Parish Council\nWateringbury Parish Council\nWeald Parish Council\nWest Farleigh Parish Council\nWest Kingsdown Parish Council\nWest Malling Parish Council\nWest Peckham Parish Council\nWestbere Parish Council\nWesterham Town Council\nWestgate-on-Sea Town Council\nWestwell Parish Council\nWhitfield Parish Council\nWickhambreaux Parish Council\nWingham Parish Council\nWittersham Parish Council\nWomenswold Parish Council\nWoodchurch Parish Council\nWoodnesborough Parish Council\nWormshill Parish Meeting\nWorth Parish Council\nWouldham\nWrotham\nWye with Hinxhill Parish Council\nYalding Parish Council\nbottom of page",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_polly-billington/content_67.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_news_tags_kent-police/content_83.html": "Cllr Jack Packman\nCouncillor\nKCC Pledges\nGallery\nContact\nMore\nMake sure to check out the events page, for up and coming events.",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_post_congratulations-polly-billington/content_24.html": "CONGRATULATIONS - POLLY BILLINGTON\n- Jack Packman\n- Mar 1, 2023\n- 1 min read\n\"Just wanted to personally congratulate Polly Billington, for winning the Vote from Labour members, to be selected as The Labour Party candidate for South Thanet\"\n\"I'm sure everyone will support Polly in her bid to become Labour MP for South Thanet, I would also like to send Commiserations to Charlotte Cornell and Rob Yates! \"\n\"Charlotte and I supported each other, and Charlotte was kind enough to take to social media, recently, after we discussed the up and coming selections, I am very proud of her achievements to date, and I know Charlotte will keep going, fighting for local constituents, she supports\".\nCharlotte took to Facebook and said: \"Jack Packman and his wife, Charlotte, are incredible community-minded people who work hard to widen inclusivity, opportunities and community events across Margate, including in Cliftonville. Jack is the Chair of Margate Central branch and it is really kind of him to give me his backing in this parliamentary selection. Thank you Jack Packman\"\nMany thanks\nStanding along with Martin Boyd, and Ruth Duckworth\nFor Dane Valley, Margate, Kent\nNEED HELP, WE'VE ADDED SOME LINKS\nDETAILS ON HOW TO VOTE\nHOW YOU CAN HELP SUPPORT OUR CAMPAIGN\nNEED HELP OR ADVICE\nMany thanks for taking the time to read this article, we hope you found it helpful and please, sign up. Together we can make our communities safer, and happier places to live and work.\nFor updates from Jack, make sure to subscribe to this website, and follow on all social media, thanks for your continued support!",
  "https_www_jackpackman_co_uk_/https_www_jackpackman_co_uk_general-8-2/content_5.html": "Community Safety\nEveryone deserves to feel safe in their community. We are committed to creating safer neighborhoods by tackling crime, supporting victims, and working in partnership with local services to protect residents from harm.\n-\nViolence Against Women and Girls: We will take strong action to prevent violence against women and girls by investing in education, prevention programmes, and better support services. This includes working with local organisations to deliver safe spaces, counselling, and advocacy services for survivors. We will push for greater police accountability and tougher enforcement of laws to protect women and girls from harm.\n-\nTackling Anti-Social Behaviour (ASB): Anti-social behaviour affects the quality of life for too many residents. We will work with the police, councils, and community groups to create a joined-up approach to tackling ASB, including more visible community policing, targeted youth outreach programmes, and swift action against persistent offenders. Commitment to deploying Community Wardens in our communities.\n-\nSupporting Victims of Crime: Victims deserve compassionate, timely support. We will advocate for greater investment in victim support services, including counselling, practical advice, and legal support for those affected by crime.\n-\nMulti-Agency Working: Effective community safety requires partnership. We will promote greater collaboration between the police, councils, housing providers, health services, and community groups to ensure a coordinated response to crime and disorder. This will include setting up local safety forums to give residents a stronger voice in shaping community safety priorities.\n-\nPreventing Crime at Its Roots: We believe in tackling the causes of crime, not just its symptoms. We'll push for early intervention programmes, youth services, and support for families at risk to break the cycle of offending and create safer communities for the long term.\nBy putting community safety, prevention, and victim support at the heart of our policies, we will ensure every resident feels safe, supported, and protected.",
  "https_www_jackpackman_co_uk_/http_www_jackpackman_co_uk_vote/content_44.html": "VOTE\nARE YOU REGISTERED TO VOTE?\n\"To be able to vote, you must first make sure you are registered to vote, this applies to both Ballot Box Voting, Postal Voting, and Vote by Proxy.\"\nREGISTERED - VOTING IN PERSON OR BY POST!\n\"Once you are fully registered to vote, you can vote in person or by post-postal vote!\"\nVOTING AT THE POLLING STATION\nThursday 4th May 2023\nIf you wish to vote for Jack Packman, in the up-and-coming local elections, You must register to vote\nbefore Monday 17 April - and you will need to bring an accepted form of photo ID to the polling station when you go to vote.\nREGISTER TO VOTE\nFor all the information about Registering to vote, you can visit the Thanet District Council's website:\nIf you are not already on the electoral register, you can register to vote in locally, You must register to vote before Monday 17 April - and you will need to bring an accepted form of photo ID to the polling station when you go to vote.. National an\nPHOTOGRAPHIC ID\n\"You have to have Valid Photographic Identification when voting in person\"\nYou can use any of the following acceptable forms of photo ID when voting at a polling station.\nInternational travel\n-\nPassport issued by the UK, any of the Channel Islands, the Isle of Man, a British Overseas Territory, an EEA state or a Commonwealth country\nDriving and Parking\n-\nDriving licence issued by the UK, any of the Channel Islands, the Isle of Man, or an EEA state (this includes a provisional driving licence)\n-\nA Blue Badge\nLocal travel\n-\nOlder Person’s Bus Pass\n-\nDisabled Person’s Bus Pass\n-\nOyster 60+ Card\n-\nFreedom Pass\n-\nScottish National Entitlement Card\n-\n60 and Over Welsh Concessionary Travel Card\n-\nDisabled Person’s Welsh Concessionary Travel Card\n-\nSenior SmartPass issued in Northern Ireland\n-\nRegistered Blind SmartPass or Blind Person’s SmartPass issued in Northern Ireland\n-\nWar Disablement SmartPass issued in Northern Ireland\n-\n60+ SmartPass issued in Northern Ireland\n-\nHalf Fare SmartPass issued in Northern Ireland\nProof of age\n-\nIdentity card bearing the Proof of Age Standards Scheme hologram (a PASS card)\nOther government-issued documents\n-\nBiometric immigration document\n-\nMinistry of Defence Form 90 (Defence Identity Card)\n-\nNational identity card issued by an EEA state\n-\nElectoral Identity Card issued in Northern Ireland\nYou will only need to show one form of photo ID. It needs to be the original version and not a photocopy.\nPOLLING STATIONS - DANE VALLEY\nSure Start, Dane Valley Rd, Dane Valley, Margate CT9 3RU\nTrinity Community Resource Centre, St. Marys Avenue, St Mary's Ave, Dane Valley, Margate CT9 3TN\n1st Margate (St John's) Scout Group, Durban Rd, Margate CT9 2TE\nPOSTAL VOTE\nFor all the information about Postal Vote, you can visit the Thanet District Council's website:\nYou can apply for a postal vote by completing the online request and they will send you an application form for you to complete, sign and return. (See Below)\nAlternatively, you can download, print, and complete a postal vote application form. (See Below)\nAll forms must be returned to:\nElectoral Services\nThanet District Council\nCecil Street\nMargate CT9 1XZ\nTelephone: 01843 577500\nVOTE BY PROXY\nAll Vote by proxy forms must be returned by 5 pm Tuesday 27th April 2021 to register for proxy vote:\nYour application must provide the reason why you are unable to vote in person.\nThe appointed person must be 18 or over on the date of the election, and either a citizen from the UK, a qualifying commonwealth country, the Republic of Ireland or a member of the European Union. They must be willing to vote at your polling station. As a proxy, you can only vote on behalf of two people at any election, unless they are close family members.\nYou can apply for a proxy vote by completing our online request and we will send you out an application form for you to complete, sign and return.\nAlternatively, you can download, print and complete a proxy vote application form.\nAll forms must be returned by 5 pm Tuesday 27th April 2021 to:\nElectoral Services\nThanet District Council\nCecil Street\nMargate CT9 1XZ"
}