{
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_24_mc-mullan-welcomes-defibrillator-training/content_28.html": "Sinn Féin MLA Oliver McMullan has welcomed plans for training in the use of life-saving defibrillators.\nThe East Antrim MLA said;\n“We all know the value of having life-saving defibrillators in as many locations as possible, including schools, community facilities and sporting clubs.\n“Just last week in the Assembly I brought forward a motion calling for an online register of defibrillators and was pleased that it received unanimous support.\n“As well as having these machines in place, it is crucial that people know how they are used in emergency situations.\n“I would like to see training in the use of defibrillators delivered to as many people as possible, particularly young people.\n“In the Assembly earlier this year I asked my party colleague, Eduction Minister John O’Dowd, what training is available in schools to deal with training in cardiopulmonary resuscitation, as well as peripheral artery disease awareness.\n“The minister said he is working with the Department of Health to take forward the roll out of the Community Resuscitation Strategy and this will include the use of CPR training resources.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_page_2/content_15.html": "Strong welcome for O’Neill’s ‘positive’ trade visit to China – McMullan\nSinn Féin’s agriculture spokesperson Oliver McMullan has welcomed Minister Michelle O’Neill’s recent visit to China where she held a number of significant meetings with Chinese authorities to further new market opportunities for local produce.\nMr McMullan said,\n“I’m delighted to hear that Minister O’Neill has acknowledged that her recent visit to Beijing was positive. During the week-long visit Minister O’Neill met with representatives from the inspection team who recently visited the North to inspect our pork processing plants.\n“With a growing population of over 1.3 billion, China is regarded as a key market for our local industry to do business. The recent visit to the North by a Chinese inspection team is positive news for local producers and our industry.\n“This follow up visit by our Minister further indicates our commitment to developing new trade relationships and is a strong example of how our Sinn Féin Minister has prioritised seeking new market opportunities.\n“Minister O’Neill also held a positive meeting with a leading Chinese based food marketing and importing company COFCO, to highlight the high quality standard and traceability of all our local produce including pork, beef, dairy and poultry produce.\n“At a time when farmers and primary producers are currently feeling the pressure of difficult market conditions, I look forward to hearing positive reports in the coming weeks as a consequence of Minister O’Neill having further opened the door for greater exports for our local produce.”\nGlens mobile phone coverage meeting welcomed – McMullan\nSinn Féin MLA Oliver McMullan has welcomed the meeting between mobile provider EE and the Forestry Service to discuss conditions that would allow mobile phone coverage to continue in the Glens area.\nMr McMullan said,\n“I spoke to mobile phone company EE this morning to be appraised of a meeting between EE and the Forestry Services to maintain a transmitter in the Glens area.\n“Following the decision by previous provider Arqiva to terminate its contract for the mobile phone site in Glenariff I welcome the news that EE and the Forestry Service have agreed to continue to explore ways to maintain a transmitter on site.\n“Not only does the population of the Glens area deserve a a strong mobile signal but the emergency services also depend on mobile technology to communicate in the Glens area.\n“After a constructive meeting both parties agreed in principle to work towards a new agreement that will allow EE to remain on the site for the foreseeable future I believe that a deal can be done to ensure mobile phone coverage for the Glens is maintained.\n“I will be keeping in contract with both EE and the Forestry Services to see that this progress is translated into concrete proposals.”\nConcern for future of cancer services – McMullan\nSinn Féin MLA Oliver McMullan has said that the report leaked to the Irish News from the Health and Social Care Group makes frightening reading especially those suffering from cancer.\nMr McMullan said,\n“As someone who suffer from cancer I realise the need for early diagnosis and treatment for a favourable out yet this report outlines the complete opposite.\n“The report states that there will be less access to specialists, surgery will be curtailed and waiting times increased to up to two years.\n“If these cuts are implemented in the way the report outlines then some people with cancer will not live long enough to begin treatment.\n“The new health Minister Simon Hamilton has a responsibility to tell the public whether this report is accurate or not.\n“He must also outline how he intends to manage his budget to ensure that all patients get the proper treatment within a reasonable period of time.\n“The minister needs to join with Sinn Féin in opposing the Tory cuts that are preventing his department from delivering the service that people deserve and are entitled to.”\nDisposal of used tyres discussed – McMullan\nSinn Féin MLA Oliver McMullan has welcomed a meeting between Environment Minister Mark H Durkan and council officials to discuss the issue of disposing of tyres.\nMr McMullan said,\n“The safe disposal of tyres is a major concern with many unscrupulous dealers allowing tyres to be burnt rather than safely dispose of them. This is causing untold damage to the environment and the meeting was designed to address this.\n“I welcome the fact that amongst the items discussed was a ‘prosperity agreement’ with Lafarge Cement, Cookstown who have agreed to take up to 500K tyres per year to act as fuel when their plant has been adapted.\n“I also welcome that the Environment Agency is considering the introduction of a producer responsibility scheme and working with Councils to help identify and create a baseline database on sites of bonfires, presence of tyres and estimated numbers of tyres.\n“At present the Environment Agency have no powers to remove tyres from bonfires but can serve notice on the landowner who has the ultimate responsibility and I would like to see this changed and more powers to deal with illegal disposal of tyres.\n“I will be meeting again with the Minister in the coming weeks in order to advance the strategy of dealing with used tyres.”\nLack Of Service Provision In East Antrim For Those With Learning Disabilities A Concern\nSinn Féin MLA Oliver McMullan has said it is unacceptable that people with learning disabilities are not able to access certain services in the East Antrim area.\nMr McMullan said;\n“I met with Jenny Ruddy, campaigns’ officer with Mencap, at Stormont today to discuss concerns over the provision of services for children and adults with learning disabilities in the East Antrim area.\n“We discussed the lack of services for those with learning difficulties, particularly in the Carnlough, Glenarm and wider Glens areas.\n“Children in particular are still being bussed out of the East Antrim area to access services elsewhere.\n“As a result of the meeting, Mencap have agreed to come into the East Antrim area, at my invitation, to look at what services are currently in place and to identify gaps in provision.\n“They will speak to parents, carers and service users to listen to their views about the current levels of provision and what they would like to see offered in their local area.\n“It is also vitally important the new Causeway Coast and Glens council incorporates provision for children and adults with learning difficulties in all of their plans.”\nCrown Estate assets should be returned to Assembly control – McMullan\nSinn Féin MLA Oliver McMullan has called for all monies raised from the Crown Estate to be handed over to the Assembly so that they can be managed for the benefit of all the people in the North.\nMr. McMullan said,\n“All monies raised from the Crown estate in Scotland are returned to the Scottish Assembly to be used in Scotland. These additional monies have no impact on the block grant received by the Scottish Executive.\n“This follows leader of the SNP Nicola Sturgeon call yesterday for Crown Estate monies to be used for projects on the Scottish isles.\n“It is about time that similar action was taken by British Government in respect to the Crown Estate monies raised in the North.\n“The entire Crown Estate is worth £9.9 billion which generates a annual profit of £280m and while the figures for the North are not available I am sure that it is well in access of the £1.5m returned to projects in the North.\n“All monies raised through the Crown Estate in the North are removed to the British Exchequer and the Assembly has no control on how much is returned to the North.\n“At present projects in the North are awarded around £1.5m from the Coastal Community Fund. This is far less than the sum that the Crown Estate lifts from claiming ownership of the Irish seabed.\n“The Crown Estate own substantial properties, land and other rights including lifting rent from sea and river beds and all profits raised in the North should be made available to the Executive for use here.”\nSport NI Funding Workshop Attendance Vital For Glens Sports Clubs.\nMc Mullan Secures Transport NI Repair Commitment On Red Bay Sea Wall Damage\nEast Antrim Sinn Féin MLA Oliver Mc Mullan has held discussions with staff from Transport NI (previously Road Service) about damage to the sea wall at Red Bay between Cushendall and Glenariffe.\nMr Mc Mullan said:\n“I have been contacted by a number of constituents about the damage to the sea wall. The damage is located directly beside the footpath which is well used by walkers, runners, tourists and young families. The damage to the wall has left a dangerous situation with a steep drop along the side of the footpath with no protection for the public.\n“The damaged wall is located on the Coast Road which is the main coastal arterial route and part of The Causeway Coastal Route which is a regular route for tourists and tour buses travelling from the ports of Larne, Belfast and further afield.\n“I contacted Transport NI immediately to highlight my concerns and thankfully following my call a contractor has been tasked to carry out the necessary repair work. They should be on site in the near future.”\nMinister’s China trip will pay dividends for farming sector – McMullan\nSinn Féin agricultural spokesperson Oliver McMullan has welcomed the trip to China by DARD Minister Michelle O’Neill to open up new markets for farmers and the agri-food sector here.\nMr McMullan said,\n“If we are to increase our own farming and agri food sectors it is important we search out new markets and ensure countries around the globe see the high standard of our industry here.\n“China is one of the fastest growing markets in the world and I believe the promotion of our pork industry will be one of the main items on the agenda.\n“The trip by the Minister is a follow-up trip to continue the growing relationship between Northern farmers, food producers and China.\n“There are also opportunities to expand our agri food industry including dairy products, which are one of the fastest growing sectors in China.\n“I am sure this visit like the previous ones will deliver for our farmers and agri food sector with an increased number of contracts which will be reflected in greater growth here in the North.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_about/content_5.html": "This is an example of a page. Unlike posts, which are displayed on your blog’s front page in the order they’re published, pages are better suited for more timeless content that you want to be easily accessible, like your About or Contact information. Click the Edit link to make changes to this page or add another page.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_29_gaa-needs-showcase-stadium-mcmullan/content_19.html": "Sinn Féin MLA Oliver McMullan has welcomed the commitment by the Culture Minister Carál Ní Chuilín to develop a first-class stadium for Ulster GAA.\nMr McMullan said,\n“The GAA is the biggest sporting organisation across the island of Ireland and the GAA in Ulster deserve a modern stadium in which it can showcase its various sports.\n“I welcome the fact the GAA have at last had the opportunity to set the record straight on its plans to redevelop Casement Park. It presented the DCAL committee with clear and robust evidence that safety was always paramount throughout the course of this project.\n“I am confident the GAA will submit a new planning application for the redevelopment of Casement Park and the GAA will be ready to go out for consultation on their new plans shortly.\n“There is the potential for £80 million to be invested in this project. The GAA has not seen the investment it has needed for decades.\n“I welcome the commitment by the Minister Carál Ní Chuilín to the development of modern sports stadia for the three main sporting codes.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com/content_1.html": "Sinn Féin MLA Oliver McMullan has led a delegation of local dairy farmers to Stormont to meet with Agriculture Minister Michelle O’Neill.\nMr McMullan said,\n“All farmers, particularly our dairy farmers are under extreme pressure at present and many are facing losing their farms due to the low price they are receiving for their produce.\n“I accompanied a delegation of local dairy farmers to meet with Minister O’Neill in order to discuss ways of intervening to help the dairy industry. It was particularly poignant to hear about the actual impact that the current crisis was having on the farmers, their families and their businesses, reinforcing the critical need for European intervention.\n“The minister outlined her recent meetings with the British Secretary of State for Environment, Food and Rural Affairs, Liz Truss and how she pushed her to intervene on the a review of the European intervention price.\n“She also spoke about her meetings with the banks and initiatives she has taken to assist the farmers. It’s important to note that all sectors, including our beef, lamb, pork, arable and vegetable farmers are all feeling the adverse challenges of market volatility. I was particularly interested to learn about the Minister’s plans to establish a forum in the coming weeks which will bring together all elements of the supply chain in an effort to integrate greater communication.\n“I am confident that the Minister will do all in her power to help the farmers through this crisis and to develop a sustainable and profitable future for our farmers.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_category_uncategorized_page_2/content_35.html": "Uncategorized\nStrong welcome for O’Neill’s ‘positive’ trade visit to China – McMullan\nSinn Féin’s agriculture spokesperson Oliver McMullan has welcomed Minister Michelle O’Neill’s recent visit to China where she held a number of significant meetings with Chinese authorities to further new market opportunities for local produce.\nMr McMullan said,\n“I’m delighted to hear that Minister O’Neill has acknowledged that her recent visit to Beijing was positive. During the week-long visit Minister O’Neill met with representatives from the inspection team who recently visited the North to inspect our pork processing plants.\n“With a growing population of over 1.3 billion, China is regarded as a key market for our local industry to do business. The recent visit to the North by a Chinese inspection team is positive news for local producers and our industry.\n“This follow up visit by our Minister further indicates our commitment to developing new trade relationships and is a strong example of how our Sinn Féin Minister has prioritised seeking new market opportunities.\n“Minister O’Neill also held a positive meeting with a leading Chinese based food marketing and importing company COFCO, to highlight the high quality standard and traceability of all our local produce including pork, beef, dairy and poultry produce.\n“At a time when farmers and primary producers are currently feeling the pressure of difficult market conditions, I look forward to hearing positive reports in the coming weeks as a consequence of Minister O’Neill having further opened the door for greater exports for our local produce.”\nGlens mobile phone coverage meeting welcomed – McMullan\nSinn Féin MLA Oliver McMullan has welcomed the meeting between mobile provider EE and the Forestry Service to discuss conditions that would allow mobile phone coverage to continue in the Glens area.\nMr McMullan said,\n“I spoke to mobile phone company EE this morning to be appraised of a meeting between EE and the Forestry Services to maintain a transmitter in the Glens area.\n“Following the decision by previous provider Arqiva to terminate its contract for the mobile phone site in Glenariff I welcome the news that EE and the Forestry Service have agreed to continue to explore ways to maintain a transmitter on site.\n“Not only does the population of the Glens area deserve a a strong mobile signal but the emergency services also depend on mobile technology to communicate in the Glens area.\n“After a constructive meeting both parties agreed in principle to work towards a new agreement that will allow EE to remain on the site for the foreseeable future I believe that a deal can be done to ensure mobile phone coverage for the Glens is maintained.\n“I will be keeping in contract with both EE and the Forestry Services to see that this progress is translated into concrete proposals.”\nConcern for future of cancer services – McMullan\nSinn Féin MLA Oliver McMullan has said that the report leaked to the Irish News from the Health and Social Care Group makes frightening reading especially those suffering from cancer.\nMr McMullan said,\n“As someone who suffer from cancer I realise the need for early diagnosis and treatment for a favourable out yet this report outlines the complete opposite.\n“The report states that there will be less access to specialists, surgery will be curtailed and waiting times increased to up to two years.\n“If these cuts are implemented in the way the report outlines then some people with cancer will not live long enough to begin treatment.\n“The new health Minister Simon Hamilton has a responsibility to tell the public whether this report is accurate or not.\n“He must also outline how he intends to manage his budget to ensure that all patients get the proper treatment within a reasonable period of time.\n“The minister needs to join with Sinn Féin in opposing the Tory cuts that are preventing his department from delivering the service that people deserve and are entitled to.”\nDisposal of used tyres discussed – McMullan\nSinn Féin MLA Oliver McMullan has welcomed a meeting between Environment Minister Mark H Durkan and council officials to discuss the issue of disposing of tyres.\nMr McMullan said,\n“The safe disposal of tyres is a major concern with many unscrupulous dealers allowing tyres to be burnt rather than safely dispose of them. This is causing untold damage to the environment and the meeting was designed to address this.\n“I welcome the fact that amongst the items discussed was a ‘prosperity agreement’ with Lafarge Cement, Cookstown who have agreed to take up to 500K tyres per year to act as fuel when their plant has been adapted.\n“I also welcome that the Environment Agency is considering the introduction of a producer responsibility scheme and working with Councils to help identify and create a baseline database on sites of bonfires, presence of tyres and estimated numbers of tyres.\n“At present the Environment Agency have no powers to remove tyres from bonfires but can serve notice on the landowner who has the ultimate responsibility and I would like to see this changed and more powers to deal with illegal disposal of tyres.\n“I will be meeting again with the Minister in the coming weeks in order to advance the strategy of dealing with used tyres.”\nLack Of Service Provision In East Antrim For Those With Learning Disabilities A Concern\nSinn Féin MLA Oliver McMullan has said it is unacceptable that people with learning disabilities are not able to access certain services in the East Antrim area.\nMr McMullan said;\n“I met with Jenny Ruddy, campaigns’ officer with Mencap, at Stormont today to discuss concerns over the provision of services for children and adults with learning disabilities in the East Antrim area.\n“We discussed the lack of services for those with learning difficulties, particularly in the Carnlough, Glenarm and wider Glens areas.\n“Children in particular are still being bussed out of the East Antrim area to access services elsewhere.\n“As a result of the meeting, Mencap have agreed to come into the East Antrim area, at my invitation, to look at what services are currently in place and to identify gaps in provision.\n“They will speak to parents, carers and service users to listen to their views about the current levels of provision and what they would like to see offered in their local area.\n“It is also vitally important the new Causeway Coast and Glens council incorporates provision for children and adults with learning difficulties in all of their plans.”\nCrown Estate assets should be returned to Assembly control – McMullan\nSinn Féin MLA Oliver McMullan has called for all monies raised from the Crown Estate to be handed over to the Assembly so that they can be managed for the benefit of all the people in the North.\nMr. McMullan said,\n“All monies raised from the Crown estate in Scotland are returned to the Scottish Assembly to be used in Scotland. These additional monies have no impact on the block grant received by the Scottish Executive.\n“This follows leader of the SNP Nicola Sturgeon call yesterday for Crown Estate monies to be used for projects on the Scottish isles.\n“It is about time that similar action was taken by British Government in respect to the Crown Estate monies raised in the North.\n“The entire Crown Estate is worth £9.9 billion which generates a annual profit of £280m and while the figures for the North are not available I am sure that it is well in access of the £1.5m returned to projects in the North.\n“All monies raised through the Crown Estate in the North are removed to the British Exchequer and the Assembly has no control on how much is returned to the North.\n“At present projects in the North are awarded around £1.5m from the Coastal Community Fund. This is far less than the sum that the Crown Estate lifts from claiming ownership of the Irish seabed.\n“The Crown Estate own substantial properties, land and other rights including lifting rent from sea and river beds and all profits raised in the North should be made available to the Executive for use here.”\nSport NI Funding Workshop Attendance Vital For Glens Sports Clubs.\nMc Mullan Secures Transport NI Repair Commitment On Red Bay Sea Wall Damage\nEast Antrim Sinn Féin MLA Oliver Mc Mullan has held discussions with staff from Transport NI (previously Road Service) about damage to the sea wall at Red Bay between Cushendall and Glenariffe.\nMr Mc Mullan said:\n“I have been contacted by a number of constituents about the damage to the sea wall. The damage is located directly beside the footpath which is well used by walkers, runners, tourists and young families. The damage to the wall has left a dangerous situation with a steep drop along the side of the footpath with no protection for the public.\n“The damaged wall is located on the Coast Road which is the main coastal arterial route and part of The Causeway Coastal Route which is a regular route for tourists and tour buses travelling from the ports of Larne, Belfast and further afield.\n“I contacted Transport NI immediately to highlight my concerns and thankfully following my call a contractor has been tasked to carry out the necessary repair work. They should be on site in the near future.”\nMinister’s China trip will pay dividends for farming sector – McMullan\nSinn Féin agricultural spokesperson Oliver McMullan has welcomed the trip to China by DARD Minister Michelle O’Neill to open up new markets for farmers and the agri-food sector here.\nMr McMullan said,\n“If we are to increase our own farming and agri food sectors it is important we search out new markets and ensure countries around the globe see the high standard of our industry here.\n“China is one of the fastest growing markets in the world and I believe the promotion of our pork industry will be one of the main items on the agenda.\n“The trip by the Minister is a follow-up trip to continue the growing relationship between Northern farmers, food producers and China.\n“There are also opportunities to expand our agri food industry including dairy products, which are one of the fastest growing sectors in China.\n“I am sure this visit like the previous ones will deliver for our farmers and agri food sector with an increased number of contracts which will be reflected in greater growth here in the North.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06/content_11.html": "Month: June 2015\nTourism Ireland Amend Causeway Coastal Route Itinerary To Include Both Cushendall And Carnlough.\nOn Wednesday the 24th of June East Antrim Sinn Féin MLA Oliver Mc Mullan held a successful meeting with representatives of Tourism Ireland. The purpose of the meeting was to address a number of inaccuracies in the information given by the Tourism Ireland website in relation to The Causeway Coastal Route, in particular the omission of the villages of Carnlough and Cushendall.\nSpeaking after the meeting Mr. Mc Mullan said:\n“I am pleased that Tourism Ireland has agreed with my recommendation to include both Carnlough and Cushendall in the daily itinerary for The Causeway Coastal Route. This information has already been updated on their website and will be included in any future publications.\n“Indeed Tourism Ireland has stated that if local communities feel that other pieces of information should be included then that information can be brought to my attention and forwarded to them.\n“I am also delighted that Tourism Ireland have agreed to my request to link The Causeway Coastal Route to The Wild Atlantic Way. This brings a joined up all Ireland approach to the promotion of tourism and creates one continuous coastal route right around the west and north coasts of Ireland, from Cork to Belfast.\n“This will no doubt bring an increased number of tourists to The Glens area and with it benefits for our local hotels, B&B’s, accommodation providers and local businesses as well as local community events such as The Heart Of The Glens Festival and Carnlough Carnival.”\nCancer treatment times need improving – McMullan\nSinn Féin MLA Oliver McMullan has said that cancer services waiting times need a major improvement if we are to progress to a point where people are seen within a reasonable timescale.\nMr McMullan said,\n“In a written question submitted to the Health Minister Simon Hamilton I asked would he revisit and reset the current performance targets for cancer services.\n“The Minister has stated that current indicators are broadly consistent with those in Britain but I believe that the current timescale is still too slow.\n“The word broadly does not instill confidence that targets are being met and I will be requesting a more detailed answer from the Minister.\n“As a cancer suffer myself I have experienced the wait before having embarked on treatment and I know the anxiety this can cause.\n“Cancer sufferers need to have the confidence that treatment will start as soon as possible after diagnosis and at present this is not the case.”\nBrucellosis testing downgrade welcomed – McMullan\nSinn Féin Agricultural spokesperson Oliver McMullan has welcomed the relaxation of Brucellosis testing for beef cattle announced today by Minister Michelle O’Neill which will save farmers several millions pounds yet still protect the industry.\nMr. McMullan said,\n“Due to the fact that it has been three years since the last reported case of brucellosis in beef cattle we can now be downgraded to two yearly herd testing instead of annual testing. The Minister also indicated her intention to abolish pre-movement testing which will mean that cattle will no longer be subject to brucellosis testing when being moved here.\n“These changes will in no way undermine the stringent measures which are in place to protect our beef and dairy herds from disease and maintain the very high quality and reputation of our produce both at home and abroad.\n“The changes will save the Department of Agriculture up to £8m per year and farmers over £7m in associated costs, monies that now can be spent elsewhere.\n“I congratulate the Minister Michelle O’Neill on working to attain Officially Brucellosis Free status (OBF) and her announcement today which will reduce control measures for farmers.”\nChild Safety on Farm Week welcomed – McMullan\nSinn Féin MLA and Agriculture spokesperson Oliver McMullan has said that Child Safety on Farm Week is an opportunity for farmers to do a risk assessment on their farm as we prepare for the summer holidays.\nMr McMullan said,\n“Child Safety on Farm Week is an initiative run by the Health and Safety Executive designed to protect children from serious harm or death while on an working farm.\n“For a child a farm can be one big adventure playground however it can also be a very dangerous place as we are unfortunately all too aware off.\n“Since 2000 there has been 11 deaths so it is crucial that we review our procedures as we enter the summer months when children are off school and more likely to be about the farm.\n“I would congratulate the HSE for this initiative and the fact they have visited over 420 schools to get the farm safety message out.\n“Farmers can access a basic audit questionnaire and other safety advice on\nhttp://farmsafe.hseni.gov.uk/farm-safety-resources/kids.htm so I would urge farmers to carry out a safety audit of their farm.\n“I would also recommend that they spend some time with any children who will be around the farm during the next few months to instill basic safety procedures.”\nLocal Businesses Should Make Use Of The Connection Voucher Initiative – Mc Mullan\nFerris and McMullan meet to discuss lamb labelling crisis\nStrong welcome for O’Neill’s ‘positive’ trade visit to China – McMullan\nSinn Féin’s agriculture spokesperson Oliver McMullan has welcomed Minister Michelle O’Neill’s recent visit to China where she held a number of significant meetings with Chinese authorities to further new market opportunities for local produce.\nMr McMullan said,\n“I’m delighted to hear that Minister O’Neill has acknowledged that her recent visit to Beijing was positive. During the week-long visit Minister O’Neill met with representatives from the inspection team who recently visited the North to inspect our pork processing plants.\n“With a growing population of over 1.3 billion, China is regarded as a key market for our local industry to do business. The recent visit to the North by a Chinese inspection team is positive news for local producers and our industry.\n“This follow up visit by our Minister further indicates our commitment to developing new trade relationships and is a strong example of how our Sinn Féin Minister has prioritised seeking new market opportunities.\n“Minister O’Neill also held a positive meeting with a leading Chinese based food marketing and importing company COFCO, to highlight the high quality standard and traceability of all our local produce including pork, beef, dairy and poultry produce.\n“At a time when farmers and primary producers are currently feeling the pressure of difficult market conditions, I look forward to hearing positive reports in the coming weeks as a consequence of Minister O’Neill having further opened the door for greater exports for our local produce.”\nGlens mobile phone coverage meeting welcomed – McMullan\nSinn Féin MLA Oliver McMullan has welcomed the meeting between mobile provider EE and the Forestry Service to discuss conditions that would allow mobile phone coverage to continue in the Glens area.\nMr McMullan said,\n“I spoke to mobile phone company EE this morning to be appraised of a meeting between EE and the Forestry Services to maintain a transmitter in the Glens area.\n“Following the decision by previous provider Arqiva to terminate its contract for the mobile phone site in Glenariff I welcome the news that EE and the Forestry Service have agreed to continue to explore ways to maintain a transmitter on site.\n“Not only does the population of the Glens area deserve a a strong mobile signal but the emergency services also depend on mobile technology to communicate in the Glens area.\n“After a constructive meeting both parties agreed in principle to work towards a new agreement that will allow EE to remain on the site for the foreseeable future I believe that a deal can be done to ensure mobile phone coverage for the Glens is maintained.\n“I will be keeping in contract with both EE and the Forestry Services to see that this progress is translated into concrete proposals.”\nConcern for future of cancer services – McMullan\nSinn Féin MLA Oliver McMullan has said that the report leaked to the Irish News from the Health and Social Care Group makes frightening reading especially those suffering from cancer.\nMr McMullan said,\n“As someone who suffer from cancer I realise the need for early diagnosis and treatment for a favourable out yet this report outlines the complete opposite.\n“The report states that there will be less access to specialists, surgery will be curtailed and waiting times increased to up to two years.\n“If these cuts are implemented in the way the report outlines then some people with cancer will not live long enough to begin treatment.\n“The new health Minister Simon Hamilton has a responsibility to tell the public whether this report is accurate or not.\n“He must also outline how he intends to manage his budget to ensure that all patients get the proper treatment within a reasonable period of time.\n“The minister needs to join with Sinn Féin in opposing the Tory cuts that are preventing his department from delivering the service that people deserve and are entitled to.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_author_eastantrimsinnfein/content_4.html": "Sinn Féin MLA Oliver McMullan has led a delegation of local dairy farmers to Stormont to meet with Agriculture Minister Michelle O’Neill.\nMr McMullan said,\n“All farmers, particularly our dairy farmers are under extreme pressure at present and many are facing losing their farms due to the low price they are receiving for their produce.\n“I accompanied a delegation of local dairy farmers to meet with Minister O’Neill in order to discuss ways of intervening to help the dairy industry. It was particularly poignant to hear about the actual impact that the current crisis was having on the farmers, their families and their businesses, reinforcing the critical need for European intervention.\n“The minister outlined her recent meetings with the British Secretary of State for Environment, Food and Rural Affairs, Liz Truss and how she pushed her to intervene on the a review of the European intervention price.\n“She also spoke about her meetings with the banks and initiatives she has taken to assist the farmers. It’s important to note that all sectors, including our beef, lamb, pork, arable and vegetable farmers are all feeling the adverse challenges of market volatility. I was particularly interested to learn about the Minister’s plans to establish a forum in the coming weeks which will bring together all elements of the supply chain in an effort to integrate greater communication.\n“I am confident that the Minister will do all in her power to help the farmers through this crisis and to develop a sustainable and profitable future for our farmers.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_26_mcmullan-calls-for-all-ireland-action-to-help-sheep-farmers/content_32.html": "Sinn Féin MLA Oliver McMullan has said urgent action is needed to help sheep farmers struggling with falling lamb prices.\nThe East Antrim MLA said;\n“Sheep farmers have been voicing concerns about the falling price of lamb as a result of EU labelling regulations.\n“This week I met with representatives of the National Sheep Association who made a presentation to the agriculture committee expressing their concern about the price of lamb, which has fallen by as much as £20 per head.\n“I proposed an immediate meeting with our counterparts in the Dáil to discuss voluntary labelling to help the sheep farmers.\n“Unionist members of the committee voted against the proposal and SDLP members abstained claiming that a meeting between the two committees has been scheduled for September.\n“I believe this issue is too important to wait until September and that view is shared by the representatives of the National Sheep Association.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_author_eastantrimsinnfein_page_2/content_22.html": "Author: eastantrimsinnfein\nStrong welcome for O’Neill’s ‘positive’ trade visit to China – McMullan\nSinn Féin’s agriculture spokesperson Oliver McMullan has welcomed Minister Michelle O’Neill’s recent visit to China where she held a number of significant meetings with Chinese authorities to further new market opportunities for local produce.\nMr McMullan said,\n“I’m delighted to hear that Minister O’Neill has acknowledged that her recent visit to Beijing was positive. During the week-long visit Minister O’Neill met with representatives from the inspection team who recently visited the North to inspect our pork processing plants.\n“With a growing population of over 1.3 billion, China is regarded as a key market for our local industry to do business. The recent visit to the North by a Chinese inspection team is positive news for local producers and our industry.\n“This follow up visit by our Minister further indicates our commitment to developing new trade relationships and is a strong example of how our Sinn Féin Minister has prioritised seeking new market opportunities.\n“Minister O’Neill also held a positive meeting with a leading Chinese based food marketing and importing company COFCO, to highlight the high quality standard and traceability of all our local produce including pork, beef, dairy and poultry produce.\n“At a time when farmers and primary producers are currently feeling the pressure of difficult market conditions, I look forward to hearing positive reports in the coming weeks as a consequence of Minister O’Neill having further opened the door for greater exports for our local produce.”\nGlens mobile phone coverage meeting welcomed – McMullan\nSinn Féin MLA Oliver McMullan has welcomed the meeting between mobile provider EE and the Forestry Service to discuss conditions that would allow mobile phone coverage to continue in the Glens area.\nMr McMullan said,\n“I spoke to mobile phone company EE this morning to be appraised of a meeting between EE and the Forestry Services to maintain a transmitter in the Glens area.\n“Following the decision by previous provider Arqiva to terminate its contract for the mobile phone site in Glenariff I welcome the news that EE and the Forestry Service have agreed to continue to explore ways to maintain a transmitter on site.\n“Not only does the population of the Glens area deserve a a strong mobile signal but the emergency services also depend on mobile technology to communicate in the Glens area.\n“After a constructive meeting both parties agreed in principle to work towards a new agreement that will allow EE to remain on the site for the foreseeable future I believe that a deal can be done to ensure mobile phone coverage for the Glens is maintained.\n“I will be keeping in contract with both EE and the Forestry Services to see that this progress is translated into concrete proposals.”\nConcern for future of cancer services – McMullan\nSinn Féin MLA Oliver McMullan has said that the report leaked to the Irish News from the Health and Social Care Group makes frightening reading especially those suffering from cancer.\nMr McMullan said,\n“As someone who suffer from cancer I realise the need for early diagnosis and treatment for a favourable out yet this report outlines the complete opposite.\n“The report states that there will be less access to specialists, surgery will be curtailed and waiting times increased to up to two years.\n“If these cuts are implemented in the way the report outlines then some people with cancer will not live long enough to begin treatment.\n“The new health Minister Simon Hamilton has a responsibility to tell the public whether this report is accurate or not.\n“He must also outline how he intends to manage his budget to ensure that all patients get the proper treatment within a reasonable period of time.\n“The minister needs to join with Sinn Féin in opposing the Tory cuts that are preventing his department from delivering the service that people deserve and are entitled to.”\nDisposal of used tyres discussed – McMullan\nSinn Féin MLA Oliver McMullan has welcomed a meeting between Environment Minister Mark H Durkan and council officials to discuss the issue of disposing of tyres.\nMr McMullan said,\n“The safe disposal of tyres is a major concern with many unscrupulous dealers allowing tyres to be burnt rather than safely dispose of them. This is causing untold damage to the environment and the meeting was designed to address this.\n“I welcome the fact that amongst the items discussed was a ‘prosperity agreement’ with Lafarge Cement, Cookstown who have agreed to take up to 500K tyres per year to act as fuel when their plant has been adapted.\n“I also welcome that the Environment Agency is considering the introduction of a producer responsibility scheme and working with Councils to help identify and create a baseline database on sites of bonfires, presence of tyres and estimated numbers of tyres.\n“At present the Environment Agency have no powers to remove tyres from bonfires but can serve notice on the landowner who has the ultimate responsibility and I would like to see this changed and more powers to deal with illegal disposal of tyres.\n“I will be meeting again with the Minister in the coming weeks in order to advance the strategy of dealing with used tyres.”\nLack Of Service Provision In East Antrim For Those With Learning Disabilities A Concern\nSinn Féin MLA Oliver McMullan has said it is unacceptable that people with learning disabilities are not able to access certain services in the East Antrim area.\nMr McMullan said;\n“I met with Jenny Ruddy, campaigns’ officer with Mencap, at Stormont today to discuss concerns over the provision of services for children and adults with learning disabilities in the East Antrim area.\n“We discussed the lack of services for those with learning difficulties, particularly in the Carnlough, Glenarm and wider Glens areas.\n“Children in particular are still being bussed out of the East Antrim area to access services elsewhere.\n“As a result of the meeting, Mencap have agreed to come into the East Antrim area, at my invitation, to look at what services are currently in place and to identify gaps in provision.\n“They will speak to parents, carers and service users to listen to their views about the current levels of provision and what they would like to see offered in their local area.\n“It is also vitally important the new Causeway Coast and Glens council incorporates provision for children and adults with learning difficulties in all of their plans.”\nCrown Estate assets should be returned to Assembly control – McMullan\nSinn Féin MLA Oliver McMullan has called for all monies raised from the Crown Estate to be handed over to the Assembly so that they can be managed for the benefit of all the people in the North.\nMr. McMullan said,\n“All monies raised from the Crown estate in Scotland are returned to the Scottish Assembly to be used in Scotland. These additional monies have no impact on the block grant received by the Scottish Executive.\n“This follows leader of the SNP Nicola Sturgeon call yesterday for Crown Estate monies to be used for projects on the Scottish isles.\n“It is about time that similar action was taken by British Government in respect to the Crown Estate monies raised in the North.\n“The entire Crown Estate is worth £9.9 billion which generates a annual profit of £280m and while the figures for the North are not available I am sure that it is well in access of the £1.5m returned to projects in the North.\n“All monies raised through the Crown Estate in the North are removed to the British Exchequer and the Assembly has no control on how much is returned to the North.\n“At present projects in the North are awarded around £1.5m from the Coastal Community Fund. This is far less than the sum that the Crown Estate lifts from claiming ownership of the Irish seabed.\n“The Crown Estate own substantial properties, land and other rights including lifting rent from sea and river beds and all profits raised in the North should be made available to the Executive for use here.”\nSport NI Funding Workshop Attendance Vital For Glens Sports Clubs.\nMc Mullan Secures Transport NI Repair Commitment On Red Bay Sea Wall Damage\nEast Antrim Sinn Féin MLA Oliver Mc Mullan has held discussions with staff from Transport NI (previously Road Service) about damage to the sea wall at Red Bay between Cushendall and Glenariffe.\nMr Mc Mullan said:\n“I have been contacted by a number of constituents about the damage to the sea wall. The damage is located directly beside the footpath which is well used by walkers, runners, tourists and young families. The damage to the wall has left a dangerous situation with a steep drop along the side of the footpath with no protection for the public.\n“The damaged wall is located on the Coast Road which is the main coastal arterial route and part of The Causeway Coastal Route which is a regular route for tourists and tour buses travelling from the ports of Larne, Belfast and further afield.\n“I contacted Transport NI immediately to highlight my concerns and thankfully following my call a contractor has been tasked to carry out the necessary repair work. They should be on site in the near future.”\nMinister’s China trip will pay dividends for farming sector – McMullan\nSinn Féin agricultural spokesperson Oliver McMullan has welcomed the trip to China by DARD Minister Michelle O’Neill to open up new markets for farmers and the agri-food sector here.\nMr McMullan said,\n“If we are to increase our own farming and agri food sectors it is important we search out new markets and ensure countries around the globe see the high standard of our industry here.\n“China is one of the fastest growing markets in the world and I believe the promotion of our pork industry will be one of the main items on the agenda.\n“The trip by the Minister is a follow-up trip to continue the growing relationship between Northern farmers, food producers and China.\n“There are also opportunities to expand our agri food industry including dairy products, which are one of the fastest growing sectors in China.\n“I am sure this visit like the previous ones will deliver for our farmers and agri food sector with an increased number of contracts which will be reflected in greater growth here in the North.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_25_dup-pushing-tory-agenda-on-welfare-cuts/content_27.html": "Tomorrows debate on Welfare Reform in the assembly has been brought forward by the DUP on the back of pressure from their Tory masters in Westminister. They are intent to try and push through the Tory cuts which would affect the most vulnerable in our society such as children with disabilities,adults with severe disabilities, families with children and the long term sick. In the recent Westminister elections the Tories could only get around 9,000 votes that is only 1% of the …total\nelectorate compared to the vote for Sinn Fein which was 176,000 25% of the electorate. The only way to fight these austerity cuts in welfare is for all parties to stand together already they have cut £1.5 billion of our block grant with a further cut\nof £25 billion £12 billion to be cut from welfare and £13 billion from public services\nsuch as Health and Education. Sinn Fein will not abandon those in need.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_10_strong-welcome-for-oneills-positive-trade-visit-to-china-mcmullan/content_12.html": "Sinn Féin’s agriculture spokesperson Oliver McMullan has welcomed Minister Michelle O’Neill’s recent visit to China where she held a number of significant meetings with Chinese authorities to further new market opportunities for local produce.\nMr McMullan said,\n“I’m delighted to hear that Minister O’Neill has acknowledged that her recent visit to Beijing was positive. During the week-long visit Minister O’Neill met with representatives from the inspection team who recently visited the North to inspect our pork processing plants.\n“With a growing population of over 1.3 billion, China is regarded as a key market for our local industry to do business. The recent visit to the North by a Chinese inspection team is positive news for local producers and our industry.\n“This follow up visit by our Minister further indicates our commitment to developing new trade relationships and is a strong example of how our Sinn Féin Minister has prioritised seeking new market opportunities.\n“Minister O’Neill also held a positive meeting with a leading Chinese based food marketing and importing company COFCO, to highlight the high quality standard and traceability of all our local produce including pork, beef, dairy and poultry produce.\n“At a time when farmers and primary producers are currently feeling the pressure of difficult market conditions, I look forward to hearing positive reports in the coming weeks as a consequence of Minister O’Neill having further opened the door for greater exports for our local produce.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_22_child-safety-on-farm-week-welcomed-mcmullan/content_17.html": "Sinn Féin MLA and Agriculture spokesperson Oliver McMullan has said that Child Safety on Farm Week is an opportunity for farmers to do a risk assessment on their farm as we prepare for the summer holidays.\nMr McMullan said,\n“Child Safety on Farm Week is an initiative run by the Health and Safety Executive designed to protect children from serious harm or death while on an working farm.\n“For a child a farm can be one big adventure playground however it can also be a very dangerous place as we are unfortunately all too aware off.\n“Since 2000 there has been 11 deaths so it is crucial that we review our procedures as we enter the summer months when children are off school and more likely to be about the farm.\n“I would congratulate the HSE for this initiative and the fact they have visited over 420 schools to get the farm safety message out.\n“Farmers can access a basic audit questionnaire and other safety advice on\nhttp://farmsafe.hseni.gov.uk/farm-safety-resources/kids.htm so I would urge farmers to carry out a safety audit of their farm.\n“I would also recommend that they spend some time with any children who will be around the farm during the next few months to instill basic safety procedures.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_page_2/content_30.html": "Sinn Féin MLA Oliver McMullan has welcomed a meeting between Environment Minister Mark H Durkan and council officials to discuss the issue of disposing of tyres.\nMr McMullan said,\n“The safe disposal of tyres is a major concern with many unscrupulous dealers allowing tyres to be burnt rather than safely dispose of them. This is causing untold damage to the environment and the meeting was designed to address this.\n“I welcome the fact that amongst the items discussed was a ‘prosperity agreement’ with Lafarge Cement, Cookstown who have agreed to take up to 500K tyres per year to act as fuel when their plant has been adapted.\n“I also welcome that the Environment Agency is considering the introduction of a producer responsibility scheme and working with Councils to help identify and create a baseline database on sites of bonfires, presence of tyres and estimated numbers of tyres.\n“At present the Environment Agency have no powers to remove tyres from bonfires but can serve notice on the landowner who has the ultimate responsibility and I would like to see this changed and more powers to deal with illegal disposal of tyres.\n“I will be meeting again with the Minister in the coming weeks in order to advance the strategy of dealing with used tyres.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_page_3/content_29.html": "East Antrim Sinn Féin MLA Oliver Mc Mullan has called on The Minister For The Environment to take immediate action after hundreds of tyres were dumped for used in the construction of a bonfire in the Craigyhill Estate in Larne.\nMr. Mullan who was contacted about the issue by a number of concerned residents said:\n“I have this morning contacted The Minister’s office calling on his department to investigate several hundred tyres being used in the construction of a bonfire in Larne.\n“Recently enforcement officers from The Environment Agency pursued and interviewed farmers under caution because they moved tyres on their farms. These tyres were being used for covering silage pits, will The Minister now ensure the same scrutiny is applied to those who dumped tyres for use in a bonfire?\n“Not only is burning tyres illegal but it is also damaging to the environment and is a potential health hazard to both people and animals.\n“Tyres release more than 100 different chemicals into the air when they are burnt.\n“Many of these chemicals can cause cancer and respiratory diseases.\n“Burning tyres is a breach of the Clean Air Order and dumping them is a breach of the Pollution Control Order.\n“It is also worrying that the vast majority of these tyres appear to be lorry or bus tyres which are not easily available to members of the public. I am concerned that a business may be using bonfires as an illegal means of disposing of old tyres.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_29_ministers-china-trip-will-pay-dividends-farming-sector-mcmullan/content_41.html": "Sinn Féin agricultural spokesperson Oliver McMullan has welcomed the trip to China by DARD Minister Michelle O’Neill to open up new markets for farmers and the agri-food sector here.\nMr McMullan said,\n“If we are to increase our own farming and agri food sectors it is important we search out new markets and ensure countries around the globe see the high standard of our industry here.\n“China is one of the fastest growing markets in the world and I believe the promotion of our pork industry will be one of the main items on the agenda.\n“The trip by the Minister is a follow-up trip to continue the growing relationship between Northern farmers, food producers and China.\n“There are also opportunities to expand our agri food industry including dairy products, which are one of the fastest growing sectors in China.\n“I am sure this visit like the previous ones will deliver for our farmers and agri food sector with an increased number of contracts which will be reflected in greater growth here in the North.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_author_eastantrimsinnfein_page_3/content_39.html": "East Antrim Sinn Féin MLA Oliver Mc Mullan has called on The Minister For The Environment to take immediate action after hundreds of tyres were dumped for used in the construction of a bonfire in the Craigyhill Estate in Larne.\nMr. Mullan who was contacted about the issue by a number of concerned residents said:\n“I have this morning contacted The Minister’s office calling on his department to investigate several hundred tyres being used in the construction of a bonfire in Larne.\n“Recently enforcement officers from The Environment Agency pursued and interviewed farmers under caution because they moved tyres on their farms. These tyres were being used for covering silage pits, will The Minister now ensure the same scrutiny is applied to those who dumped tyres for use in a bonfire?\n“Not only is burning tyres illegal but it is also damaging to the environment and is a potential health hazard to both people and animals.\n“Tyres release more than 100 different chemicals into the air when they are burnt.\n“Many of these chemicals can cause cancer and respiratory diseases.\n“Burning tyres is a breach of the Clean Air Order and dumping them is a breach of the Pollution Control Order.\n“It is also worrying that the vast majority of these tyres appear to be lorry or bus tyres which are not easily available to members of the public. I am concerned that a business may be using bonfires as an illegal means of disposing of old tyres.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_08_glens-mobile-phone-coverage-meeting-welcomed-mcmullan/content_36.html": "Sinn Féin MLA Oliver McMullan has welcomed the meeting between mobile provider EE and the Forestry Service to discuss conditions that would allow mobile phone coverage to continue in the Glens area.\nMr McMullan said,\n“I spoke to mobile phone company EE this morning to be appraised of a meeting between EE and the Forestry Services to maintain a transmitter in the Glens area.\n“Following the decision by previous provider Arqiva to terminate its contract for the mobile phone site in Glenariff I welcome the news that EE and the Forestry Service have agreed to continue to explore ways to maintain a transmitter on site.\n“Not only does the population of the Glens area deserve a a strong mobile signal but the emergency services also depend on mobile technology to communicate in the Glens area.\n“After a constructive meeting both parties agreed in principle to work towards a new agreement that will allow EE to remain on the site for the foreseeable future I believe that a deal can be done to ensure mobile phone coverage for the Glens is maintained.\n“I will be keeping in contract with both EE and the Forestry Services to see that this progress is translated into concrete proposals.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_02_lack-of-service-provision-in-east-antrim-for-those-with-learning-disabilities-a-concern/content_43.html": "Sinn Féin MLA Oliver McMullan has said it is unacceptable that people with learning disabilities are not able to access certain services in the East Antrim area.\nMr McMullan said;\n“I met with Jenny Ruddy, campaigns’ officer with Mencap, at Stormont today to discuss concerns over the provision of services for children and adults with learning disabilities in the East Antrim area.\n“We discussed the lack of services for those with learning difficulties, particularly in the Carnlough, Glenarm and wider Glens areas.\n“Children in particular are still being bussed out of the East Antrim area to access services elsewhere.\n“As a result of the meeting, Mencap have agreed to come into the East Antrim area, at my invitation, to look at what services are currently in place and to identify gaps in provision.\n“They will speak to parents, carers and service users to listen to their views about the current levels of provision and what they would like to see offered in their local area.\n“It is also vitally important the new Causeway Coast and Glens council incorporates provision for children and adults with learning difficulties in all of their plans.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_08/content_26.html": "Sinn Féin MLA Oliver McMullan has led a delegation of local dairy farmers to Stormont to meet with Agriculture Minister Michelle O’Neill.\nMr McMullan said,\n“All farmers, particularly our dairy farmers are under extreme pressure at present and many are facing losing their farms due to the low price they are receiving for their produce.\n“I accompanied a delegation of local dairy farmers to meet with Minister O’Neill in order to discuss ways of intervening to help the dairy industry. It was particularly poignant to hear about the actual impact that the current crisis was having on the farmers, their families and their businesses, reinforcing the critical need for European intervention.\n“The minister outlined her recent meetings with the British Secretary of State for Environment, Food and Rural Affairs, Liz Truss and how she pushed her to intervene on the a review of the European intervention price.\n“She also spoke about her meetings with the banks and initiatives she has taken to assist the farmers. It’s important to note that all sectors, including our beef, lamb, pork, arable and vegetable farmers are all feeling the adverse challenges of market volatility. I was particularly interested to learn about the Minister’s plans to establish a forum in the coming weeks which will bring together all elements of the supply chain in an effort to integrate greater communication.\n“I am confident that the Minister will do all in her power to help the farmers through this crisis and to develop a sustainable and profitable future for our farmers.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_02_crown-estate-assets-should-be-returned-to-assembly-control-mcmullan/content_38.html": "Sinn Féin MLA Oliver McMullan has called for all monies raised from the Crown Estate to be handed over to the Assembly so that they can be managed for the benefit of all the people in the North.\nMr. McMullan said,\n“All monies raised from the Crown estate in Scotland are returned to the Scottish Assembly to be used in Scotland. These additional monies have no impact on the block grant received by the Scottish Executive.\n“This follows leader of the SNP Nicola Sturgeon call yesterday for Crown Estate monies to be used for projects on the Scottish isles.\n“It is about time that similar action was taken by British Government in respect to the Crown Estate monies raised in the North.\n“The entire Crown Estate is worth £9.9 billion which generates a annual profit of £280m and while the figures for the North are not available I am sure that it is well in access of the £1.5m returned to projects in the North.\n“All monies raised through the Crown Estate in the North are removed to the British Exchequer and the Assembly has no control on how much is returned to the North.\n“At present projects in the North are awarded around £1.5m from the Coastal Community Fund. This is far less than the sum that the Crown Estate lifts from claiming ownership of the Irish seabed.\n“The Crown Estate own substantial properties, land and other rights including lifting rent from sea and river beds and all profits raised in the North should be made available to the Executive for use here.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_26_mc-mullan-calls-for-immediate-action-on-larne-bonfire-tyres/content_40.html": "East Antrim Sinn Féin MLA Oliver Mc Mullan has called on The Minister For The Environment to take immediate action after hundreds of tyres were dumped for used in the construction of a bonfire in the Craigyhill Estate in Larne.\nMr. Mullan who was contacted about the issue by a number of concerned residents said:\n“I have this morning contacted The Minister’s office calling on his department to investigate several hundred tyres being used in the construction of a bonfire in Larne.\n“Recently enforcement officers from The Environment Agency pursued and interviewed farmers under caution because they moved tyres on their farms. These tyres were being used for covering silage pits, will The Minister now ensure the same scrutiny is applied to those who dumped tyres for use in a bonfire?\n“Not only is burning tyres illegal but it is also damaging to the environment and is a potential health hazard to both people and animals.\n“Tyres release more than 100 different chemicals into the air when they are burnt.\n“Many of these chemicals can cause cancer and respiratory diseases.\n“Burning tyres is a breach of the Clean Air Order and dumping them is a breach of the Pollution Control Order.\n“It is also worrying that the vast majority of these tyres appear to be lorry or bus tyres which are not easily available to members of the public. I am concerned that a business may be using bonfires as an illegal means of disposing of old tyres.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_26_tourism-ireland-amend-causeway-coastal-route-itinerary-to-include-both-cushendall-and-carnlough/content_16.html": "On Wednesday the 24th of June East Antrim Sinn Féin MLA Oliver Mc Mullan held a successful meeting with representatives of Tourism Ireland. The purpose of the meeting was to address a number of inaccuracies in the information given by the Tourism Ireland website in relation to The Causeway Coastal Route, in particular the omission of the villages of Carnlough and Cushendall.\nSpeaking after the meeting Mr. Mc Mullan said:\n“I am pleased that Tourism Ireland has agreed with my recommendation to include both Carnlough and Cushendall in the daily itinerary for The Causeway Coastal Route. This information has already been updated on their website and will be included in any future publications.\n“Indeed Tourism Ireland has stated that if local communities feel that other pieces of information should be included then that information can be brought to my attention and forwarded to them.\n“I am also delighted that Tourism Ireland have agreed to my request to link The Causeway Coastal Route to The Wild Atlantic Way. This brings a joined up all Ireland approach to the promotion of tourism and creates one continuous coastal route right around the west and north coasts of Ireland, from Cork to Belfast.\n“This will no doubt bring an increased number of tourists to The Glens area and with it benefits for our local hotels, B&B’s, accommodation providers and local businesses as well as local community events such as The Heart Of The Glens Festival and Carnlough Carnival.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_10_ferris-and-mcmullan-meet-to-discuss-lamb-labelling-crisis/content_24.html": "Sinn Féin agriculture spokespersons in the Assembly and the Dáil, Oliver McMullan MLA and Martin Ferris TD met today to discuss the ongoing lamb labelling crisis, as a result of recently introduced European labelling regulations.\nSpeaking after the meeting, Mr Ferris said, “Sinn Féin is deeply concerned about the impact which these new regulations are having on our primary producers, particularly our sheep and beef farmers. Since their introduction at the beginning of April, sheep prices in the North have plummeted and cross border trade has virtually become non-existent as processors are effectively rejecting lamb from the North.\n“It is our firm view that these new regulations, which are designed to improve food safety are actually having a detrimental impact on pricing structures and cross border trade. Sinn Féin believe that an all-island label is the only viable solution to this difficulty and I welcome the efforts of Minister Michelle O’Neill at alerting Minister Coveney to the barriers and contradictions which are being created here.\nMr McMullan said, “Last year we saw the devastating impact which similar regulations had on the beef sector, and the penalties which are currently being enforced by the processors are continuing to negatively impact on all-island cattle trade. Sinn Féin are planning a series of events to further highlight the need for a single island brand and to prevent market manipulation and penalties which only serve the cartels at the expense of our farmers.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_25_mc-mullan-searches-for-ee-glenariffe-solution/content_34.html": "Good meeting recently with the Delivery Manager from mobile phone company EE who are the company that serves Glenariffe, i have got an assurance that they will stay in the area if they can get an agreement with the Forestry service.I am at present setting up a meeting with Forestry Service and Mr McGimpsey so both sides can try and agree to a viable solution can be found that will allow EE to remain.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_09_04_mc-mullan-expresses-disappointment-as-minister-pulls-out-of-local-tourism-engagements/content_14.html": "East Antrim Sinn Féin MLA Oliver Mc Mullan has expressed his disappointment that Tourism Minister Johnathan Bell has pulled out of planned tourist engagement meeting in The Glens and Carnlough.\nThe meetings were due to take place on Friday the 4th of September but unfortunately Minister Bell became unavailable at the last minute. The engagements had been arranged by Sinn Féin after a lobbying campaign by Mr. McMullan on behalf of East Antrim tourism businesses.\nSpeaking about the news Mr. Mc Mullan said:\n“Unfortunately the Minister informed me at the last minute that he was unable to attend the meetings. This is obviously very frustrating for local businesses and tourism groups who were looking forward to this opportunity to engage with the Minister. Tourism really is the lifeblood of our local businesses and is absolutely vital in sustaining our local economy and creating jobs. The promotion of tourism in The Glens and along The Antrim Coast Road remains a top priority for Sinn Féin.”\n“We plan to arrange another tourism engagement with representatives of the industry in the near future.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_24_hello-world/content_25.html": "This is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nHappy blogging!\nThis is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nHappy blogging!",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_25_mc-mullan-condemns-arson-attack/content_42.html": "Sinn Féin MLA Oliver McMullan has condemned an arson attack on a shop selling so-called ‘legal highs’ in Larne.\nThe East Antrim MLA said;\n“This attack was wrong and endangered the lives of those resident living in flats above the shop who had to leave their home in the early hours of the morning because of the blaze.\n“It is the second time the premises has been attacked and it is only by luck that they were not injured.\n“There is no doubt that the misery caused by these toxic substances evoke strong feelings in the community but attacks like this must be condemned.\n“It is likely that this attack was carried out by loyalist paramilitaries and we cannot have a situation where they are allowed to dictate the law.\n“There is now a legal mechanism available to remove these dangerous substances from our streets and stop them being sold.\n“Belfast City Council have already done this and I would encourage the Causeway Coast and Glens Council to engage with Belfast City Council in order to do the same here so that we can be rid of these dangerous so-called ‘legal highs’ once and for all.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_07_concern-for-future-of-cancer-services-mcmullan/content_23.html": "Sinn Féin MLA Oliver McMullan has said that the report leaked to the Irish News from the Health and Social Care Group makes frightening reading especially those suffering from cancer.\nMr McMullan said,\n“As someone who suffer from cancer I realise the need for early diagnosis and treatment for a favourable out yet this report outlines the complete opposite.\n“The report states that there will be less access to specialists, surgery will be curtailed and waiting times increased to up to two years.\n“If these cuts are implemented in the way the report outlines then some people with cancer will not live long enough to begin treatment.\n“The new health Minister Simon Hamilton has a responsibility to tell the public whether this report is accurate or not.\n“He must also outline how he intends to manage his budget to ensure that all patients get the proper treatment within a reasonable period of time.\n“The minister needs to join with Sinn Féin in opposing the Tory cuts that are preventing his department from delivering the service that people deserve and are entitled to.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05/content_18.html": "Month: May 2015\nMc Mullan Secures Transport NI Repair Commitment On Red Bay Sea Wall Damage\nEast Antrim Sinn Féin MLA Oliver Mc Mullan has held discussions with staff from Transport NI (previously Road Service) about damage to the sea wall at Red Bay between Cushendall and Glenariffe.\nMr Mc Mullan said:\n“I have been contacted by a number of constituents about the damage to the sea wall. The damage is located directly beside the footpath which is well used by walkers, runners, tourists and young families. The damage to the wall has left a dangerous situation with a steep drop along the side of the footpath with no protection for the public.\n“The damaged wall is located on the Coast Road which is the main coastal arterial route and part of The Causeway Coastal Route which is a regular route for tourists and tour buses travelling from the ports of Larne, Belfast and further afield.\n“I contacted Transport NI immediately to highlight my concerns and thankfully following my call a contractor has been tasked to carry out the necessary repair work. They should be on site in the near future.”\nMinister’s China trip will pay dividends for farming sector – McMullan\nSinn Féin agricultural spokesperson Oliver McMullan has welcomed the trip to China by DARD Minister Michelle O’Neill to open up new markets for farmers and the agri-food sector here.\nMr McMullan said,\n“If we are to increase our own farming and agri food sectors it is important we search out new markets and ensure countries around the globe see the high standard of our industry here.\n“China is one of the fastest growing markets in the world and I believe the promotion of our pork industry will be one of the main items on the agenda.\n“The trip by the Minister is a follow-up trip to continue the growing relationship between Northern farmers, food producers and China.\n“There are also opportunities to expand our agri food industry including dairy products, which are one of the fastest growing sectors in China.\n“I am sure this visit like the previous ones will deliver for our farmers and agri food sector with an increased number of contracts which will be reflected in greater growth here in the North.”\nMc Mullan Calls For Immediate Action On Larne Bonfire Tyres\nEast Antrim Sinn Féin MLA Oliver Mc Mullan has called on The Minister For The Environment to take immediate action after hundreds of tyres were dumped for used in the construction of a bonfire in the Craigyhill Estate in Larne.\nMr. Mullan who was contacted about the issue by a number of concerned residents said:\n“I have this morning contacted The Minister’s office calling on his department to investigate several hundred tyres being used in the construction of a bonfire in Larne.\n“Recently enforcement officers from The Environment Agency pursued and interviewed farmers under caution because they moved tyres on their farms. These tyres were being used for covering silage pits, will The Minister now ensure the same scrutiny is applied to those who dumped tyres for use in a bonfire?\n“Not only is burning tyres illegal but it is also damaging to the environment and is a potential health hazard to both people and animals.\n“Tyres release more than 100 different chemicals into the air when they are burnt.\n“Many of these chemicals can cause cancer and respiratory diseases.\n“Burning tyres is a breach of the Clean Air Order and dumping them is a breach of the Pollution Control Order.\n“It is also worrying that the vast majority of these tyres appear to be lorry or bus tyres which are not easily available to members of the public. I am concerned that a business may be using bonfires as an illegal means of disposing of old tyres.”\nMcMullan Calls For All-Ireland Action To Help Sheep Farmers\nMc Mullan Searches For EE Glenariffe Solution.\nGood meeting recently with the Delivery Manager from mobile phone company EE who are the company that serves Glenariffe, i have got an assurance that they will stay in the area if they can get an agreement with the Forestry service.I am at present setting up a meeting with Forestry Service and Mr McGimpsey so both sides can try and agree to a viable solution can be found that will allow EE to remain.\nMc Mullan Condemns Arson Attack\nDUP Pushing Tory Agenda On Welfare Cuts\nTomorrows debate on Welfare Reform in the assembly has been brought forward by the DUP on the back of pressure from their Tory masters in Westminister. They are intent to try and push through the Tory cuts which would affect the most vulnerable in our society such as children with disabilities,adults with severe disabilities, families with children and the long term sick. In the recent Westminister elections the Tories could only get around 9,000 votes that is only 1% of the …total\nelectorate compared to the vote for Sinn Fein which was 176,000 25% of the electorate. The only way to fight these austerity cuts in welfare is for all parties to stand together already they have cut £1.5 billion of our block grant with a further cut\nof £25 billion £12 billion to be cut from welfare and £13 billion from public services\nsuch as Health and Education. Sinn Fein will not abandon those in need.\nMc Mullan Welcomes Defibrillator Training.\nHello world!\nThis is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nHappy blogging!",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_09_17_patients-need-a-minister-for-health-not-minister-for-half-an-hour-mcmullan/content_6.html": "Sinn Féin MLA Oliver McMullan called on former health minister Simon Hamilton to get back to work and put the needs of users of the health service before his party’s electoral squabble with the UUP.\nMr McMullan said:\n“Simon Hamilton went to work briefly yesterday before resigning once again and fleeing his responsibilities.\n“Patients and health service users need a minister for health, not a minister for half an hour.\n“The former health minister is clearly more engaged in stunt politics than working to meet the needs of all users of the health services.\n“Mr Hamilton also continues to peddle the shameful nonsense that we should take money out of the pockets of children with disabilities and adults with severe disabilities to fund the health service.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_08_19_mc-mullan-leads-delegation-of-dairy-farmers-to-meet-agriculture-minister-michelle-o-neill/content_7.html": "Sinn Féin MLA Oliver McMullan has led a delegation of local dairy farmers to Stormont to meet with Agriculture Minister Michelle O’Neill.\nMr McMullan said,\n“All farmers, particularly our dairy farmers are under extreme pressure at present and many are facing losing their farms due to the low price they are receiving for their produce.\n“I accompanied a delegation of local dairy farmers to meet with Minister O’Neill in order to discuss ways of intervening to help the dairy industry. It was particularly poignant to hear about the actual impact that the current crisis was having on the farmers, their families and their businesses, reinforcing the critical need for European intervention.\n“The minister outlined her recent meetings with the British Secretary of State for Environment, Food and Rural Affairs, Liz Truss and how she pushed her to intervene on the a review of the European intervention price.\n“She also spoke about her meetings with the banks and initiatives she has taken to assist the farmers. It’s important to note that all sectors, including our beef, lamb, pork, arable and vegetable farmers are all feeling the adverse challenges of market volatility. I was particularly interested to learn about the Minister’s plans to establish a forum in the coming weeks which will bring together all elements of the supply chain in an effort to integrate greater communication.\n“I am confident that the Minister will do all in her power to help the farmers through this crisis and to develop a sustainable and profitable future for our farmers.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_31_sport-ni-funding-workshop-attendance-vital-for-glens-sports-clubs/content_33.html": "East Antrim Sinn Féin MLA Oliver Mc Mullan has called on representatives of local sports clubs in The Glens to attend a workshop which will give details of how to apply for grants from a new Sport NI funding pot totalling £14 millon. The workshop takes place on Thursday the 4th of June at 7pm in The Ballymena Showgrounds.\nSpeaking about the opportunity this funding pot presents for local clubs to secure grants Mr. Mc Mullan said:\n“Glenariffe, Cushendall and Cushendun have a large number of very successful sports clubs and individuals who have excelled in a number of different sporting disciplines.\nThe area is a hotbed for hurling success and the local soccer team Cushendall FC, with players from all three villages, have just secured promotion and the club’s first silverware. We have also seen Glens people achieve much success in sailing, archery, cycling, golf and a host of other sports.\nHowever on a number of occasions The Glens has been identified as an area with a chronic lack of sports facilities. The situation is so bad that Cushendall FC, who compete in The Ballymena Saturday Morning League, are currently forced to play home fixtures in Larne, a round trip of some fifty miles. In fact their home games are farther away than the majority of their away matches.\nSports clubs are crying out for improved facilities with a 3g pitch and an indoor sports complex absolute priorities. I am calling on representatives of local sports clubs to attend the information workshop and to work with each other and myself as the local MLA and a member of The DCAL Committee to deliver the facilities which local sports clubs desperately need.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_09/content_10.html": "Sinn Féin MLA Oliver McMullan called on former health minister Simon Hamilton to get back to work and put the needs of users of the health service before his party’s electoral squabble with the UUP.\nMr McMullan said:\n“Simon Hamilton went to work briefly yesterday before resigning once again and fleeing his responsibilities.\n“Patients and health service users need a minister for health, not a minister for half an hour.\n“The former health minister is clearly more engaged in stunt politics than working to meet the needs of all users of the health services.\n“Mr Hamilton also continues to peddle the shameful nonsense that we should take money out of the pockets of children with disabilities and adults with severe disabilities to fund the health service.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_category_uncategorized/content_20.html": "Sinn Féin MLA Oliver McMullan has led a delegation of local dairy farmers to Stormont to meet with Agriculture Minister Michelle O’Neill.\nMr McMullan said,\n“All farmers, particularly our dairy farmers are under extreme pressure at present and many are facing losing their farms due to the low price they are receiving for their produce.\n“I accompanied a delegation of local dairy farmers to meet with Minister O’Neill in order to discuss ways of intervening to help the dairy industry. It was particularly poignant to hear about the actual impact that the current crisis was having on the farmers, their families and their businesses, reinforcing the critical need for European intervention.\n“The minister outlined her recent meetings with the British Secretary of State for Environment, Food and Rural Affairs, Liz Truss and how she pushed her to intervene on the a review of the European intervention price.\n“She also spoke about her meetings with the banks and initiatives she has taken to assist the farmers. It’s important to note that all sectors, including our beef, lamb, pork, arable and vegetable farmers are all feeling the adverse challenges of market volatility. I was particularly interested to learn about the Minister’s plans to establish a forum in the coming weeks which will bring together all elements of the supply chain in an effort to integrate greater communication.\n“I am confident that the Minister will do all in her power to help the farmers through this crisis and to develop a sustainable and profitable future for our farmers.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_comments_feed/content_21.html": null,
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_11_local-businesses-should-make-use-of-the-connection-voucher-initiative-mc-mullan/content_13.html": "Sinn Féin MLA Oliver McMullan has called on local businesses to take advantage of the ‘Connection Voucher’ initiative to upgrade to faster broadband.\nMr McMullan said,\n“In the ever developing business world having a top speed broadband is essential in competing in both the local and global market.\n“This initiative allows businesses to apply for up to £3,000 that covers installation costs and equipment costs, in upgrading your broadband connection.\n“Superfast broadband is available across the North from a variety of providers and already over a thousand businesses in the North have received a ‘Connection Voucher’.",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_05_29_mc-mullan-secures-transport-ni-repair-commitment-on-red-bay-sea-wall-damage/content_31.html": "East Antrim Sinn Féin MLA Oliver Mc Mullan has held discussions with staff from Transport NI (previously Road Service) about damage to the sea wall at Red Bay between Cushendall and Glenariffe.\nMr Mc Mullan said:\n“I have been contacted by a number of constituents about the damage to the sea wall. The damage is located directly beside the footpath which is well used by walkers, runners, tourists and young families. The damage to the wall has left a dangerous situation with a steep drop along the side of the footpath with no protection for the public.\n“The damaged wall is located on the Coast Road which is the main coastal arterial route and part of The Causeway Coastal Route which is a regular route for tourists and tour buses travelling from the ports of Larne, Belfast and further afield.\n“I contacted Transport NI immediately to highlight my concerns and thankfully following my call a contractor has been tasked to carry out the necessary repair work. They should be on site in the near future.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_category_uncategorized_page_3/content_44.html": "East Antrim Sinn Féin MLA Oliver Mc Mullan has called on The Minister For The Environment to take immediate action after hundreds of tyres were dumped for used in the construction of a bonfire in the Craigyhill Estate in Larne.\nMr. Mullan who was contacted about the issue by a number of concerned residents said:\n“I have this morning contacted The Minister’s office calling on his department to investigate several hundred tyres being used in the construction of a bonfire in Larne.\n“Recently enforcement officers from The Environment Agency pursued and interviewed farmers under caution because they moved tyres on their farms. These tyres were being used for covering silage pits, will The Minister now ensure the same scrutiny is applied to those who dumped tyres for use in a bonfire?\n“Not only is burning tyres illegal but it is also damaging to the environment and is a potential health hazard to both people and animals.\n“Tyres release more than 100 different chemicals into the air when they are burnt.\n“Many of these chemicals can cause cancer and respiratory diseases.\n“Burning tyres is a breach of the Clean Air Order and dumping them is a breach of the Pollution Control Order.\n“It is also worrying that the vast majority of these tyres appear to be lorry or bus tyres which are not easily available to members of the public. I am concerned that a business may be using bonfires as an illegal means of disposing of old tyres.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_feed/content_3.html": null,
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_24_brucellosis-testing-downgrade-welcomed-mcmullan/content_9.html": "Sinn Féin Agricultural spokesperson Oliver McMullan has welcomed the relaxation of Brucellosis testing for beef cattle announced today by Minister Michelle O’Neill which will save farmers several millions pounds yet still protect the industry.\nMr. McMullan said,\n“Due to the fact that it has been three years since the last reported case of brucellosis in beef cattle we can now be downgraded to two yearly herd testing instead of annual testing. The Minister also indicated her intention to abolish pre-movement testing which will mean that cattle will no longer be subject to brucellosis testing when being moved here.\n“These changes will in no way undermine the stringent measures which are in place to protect our beef and dairy herds from disease and maintain the very high quality and reputation of our produce both at home and abroad.\n“The changes will save the Department of Agriculture up to £8m per year and farmers over £7m in associated costs, monies that now can be spent elsewhere.\n“I congratulate the Minister Michelle O’Neill on working to attain Officially Brucellosis Free status (OBF) and her announcement today which will reduce control measures for farmers.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_03_disposal-of-used-tyres-discussed-mcmullan/content_37.html": "Sinn Féin MLA Oliver McMullan has welcomed a meeting between Environment Minister Mark H Durkan and council officials to discuss the issue of disposing of tyres.\nMr McMullan said,\n“The safe disposal of tyres is a major concern with many unscrupulous dealers allowing tyres to be burnt rather than safely dispose of them. This is causing untold damage to the environment and the meeting was designed to address this.\n“I welcome the fact that amongst the items discussed was a ‘prosperity agreement’ with Lafarge Cement, Cookstown who have agreed to take up to 500K tyres per year to act as fuel when their plant has been adapted.\n“I also welcome that the Environment Agency is considering the introduction of a producer responsibility scheme and working with Councils to help identify and create a baseline database on sites of bonfires, presence of tyres and estimated numbers of tyres.\n“At present the Environment Agency have no powers to remove tyres from bonfires but can serve notice on the landowner who has the ultimate responsibility and I would like to see this changed and more powers to deal with illegal disposal of tyres.\n“I will be meeting again with the Minister in the coming weeks in order to advance the strategy of dealing with used tyres.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_06_24_cancer-treatment-times-need-improving-mcmullan/content_8.html": "Sinn Féin MLA Oliver McMullan has said that cancer services waiting times need a major improvement if we are to progress to a point where people are seen within a reasonable timescale.\nMr McMullan said,\n“In a written question submitted to the Health Minister Simon Hamilton I asked would he revisit and reset the current performance targets for cancer services.\n“The Minister has stated that current indicators are broadly consistent with those in Britain but I believe that the current timescale is still too slow.\n“The word broadly does not instill confidence that targets are being met and I will be requesting a more detailed answer from the Minister.\n“As a cancer suffer myself I have experienced the wait before having embarked on treatment and I know the anxiety this can cause.\n“Cancer sufferers need to have the confidence that treatment will start as soon as possible after diagnosis and at present this is not the case.”",
  "https_olivermcmullan_wordpress_com_/https_olivermcmullan_wordpress_com_2015_08_06_proposals-to-fly-union-flag-in-ballycastle-triumphalist-mcmullan/content_2.html": "Sinn Féin MLA Oliver McMullan has said all civic and council buildings should be neutral spaces for everyone.\nThe East Antrim MLA said;\n“All civic and council buildings should be neutral and welcoming spaces for everyone, both staff and members of the public using the facilities.\n“As one of the longest serving councillors on the old Moyle Council and a former chair we always worked together to keep council buildings a neutral space and the flying of the flag was never a contentious issue.\n“The proposals to fly the union flag over council buildings in Ballycastle goes completely against that.\n“The creation of the new council structures provided an opportunity to establish new protocols on flags and symbols in an effort to create welcoming spaces for everyone in the community.\n“Unfortunately some on the Causeway Coast and Glens Council have chosen instead to engage in triumphalism by pursuing an aggressive flags policy.\n“Instead of this approach we want to see civic and council buildings being neutral spaces for all.”"
}