{
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_campaign-kick-off-and-the-party-conference/content_29.html": "Dear Supporters,\nWhat a week it has been.\nLast Monday at the Penny Black pub in Northwich, along with other local Reform Spokespeople, we launched our local campaigns. Thank you to all our supporters who came. To those who have left their name and numbers with us I will be in touch soon.\nOn Saturday, I travelled down to London for the Reform UK Party Conference. I took many photos and met most of the leadership team, and I have to say, the speeches were inspirational. If you ever get the chance to attend the conference, you should definitely take it. I was inspired by every one of the speeches and if you missed them, you can watch them on the Reform YouTube channel or on X.\nIt was wonderful to feel the energy in the room of 1,200 a strong audience, and I ended up sitting on the front row. If you look carefully, you may have already spotted me in the promotional video.\nI was asked recently on Facebook, if I could explain what I stood for. I said I believe that we need common ground in politics, not the division we have currently.\nWe will be running more local events soon, however, in the meantime, keep spreading the word that I will be standing to be your MP for Mid-Cheshire in the upcoming General Elections, with the aim of ‘Uniting the Salt Towns of Middlewich, Winsford and Northwich’.\nReturning to the conference finally, here are a few photos of the what was a great event. Thank you for all your continued support. Kindest regards\nEmma Guy\nreformuk.nationbuilder.com",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_spokesperson-for-mid-cheshire/content_21.html": "Dear supporter,\nI am writing to introduce myself as your local Prospective Parliamentary Candidate (PPC) for ReformUK.\nSome of you may have already seen or met me, but for those of you who do not know me, let me briefly introduce myself. My name is Emma Guy, I’m passionate about politics and believe that the current mess the country is in cannot be solved by either of the two main parties, both of whom have presided over the decline of the last 25 years. I believe that none of the existing parties are capable of making the necessary changes, and the time for Reform is now.\nI’ve lived and worked in Northwich for almost 30 years, during which time I have served on Lostock Gralam Parish Council; started, and grown my own wellbeing clinic, Acupuncture That Works, and represented local interests since 2001 by campaigning with CHAIN against the building of the Incinerator on Griffiths Lane, Rudheath, and the defeated proposal for a similar one in Middlewich.\nAs well as running Acupuncture That Works, I am also Chief Commercial Officer for Runcorn based business Aqueous Digital, and in November 2022 I won Outstanding Entrepreneur of the Year at the Crème de la Crème Cheshire Business Awards for my ongoing work with this business.\nOn top of these roles, I am also Vice Chair of the board of Trustees at Halton Haven Hospice and am an ambassador for Prevent Breast Cancer. I am happily married to Jonathan and we have three children.\nWe know that the current Government must call a General Election by January 2025, so now is the time for us to be putting in the groundwork in advance of that announcement. When the election is called, all candidates in this area will be contesting a brand new seat, encompassing Northwich, Winsford and Middlewich, and as our incumbent MP, Mike Amesbury, has already declared his intention to stand in Runcorn, it means that we will definitely have a new MP. I would hope that could be me.\nYou can help in this matter. Between now and whenever the election is called, I will need supporters like you to help promote the party on social media, to volunteer for leaflet drops, and help arrange public events.\nClearly, I cannot do this alone, but together we can make a difference, and make a positive change for the salt-towns of Cheshire.\nIf you would like to help in any way, whether that’s from behind a desk or frontline activism, I’d love to hear from you. Please feel free visit my website https://www.emmaguyreform.co.uk and contact me through there.\nTogether, we can make a difference for everyone in our area, as we look to unite the salt-towns across Cheshire.\nKind Regards,",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_in-a-campaign-full-of-lies-this-one-is-possibly-the-most-ridiculous/content_14.html": "The problem with lies is that they can sometimes get so big that they take on a life of their own. As Winston Churchill once remarked, “A lie gets halfway around the world before the truth has a chance to get its pants on.”\nThe big problem is that if people are ill informed and gullible enough, then they can easily be convinced that what they are hearing is not a lie, it’s the truth, and that they should spread the word to let everyone else know.\nIt doesn’t matter to them that the truth is something different. They are so consumed in their own little bubble that even if they are shown their belief to be false, cognitive dissonance kicks in. And at that stage, they will literally swear black is white rather than accept they have made an error.\nThis current election campaign has thrown up several examples of this, but none so stupid at the lie that if we leave the European Convention to Human Rights (ECHR) we won’t have any human rights in this country, which is apparently gaining traction on social media.\nThat I should even need to write this is disturbing, as it highlights just how unhinged people can become when social media algorithms feed them a constant reinforcing narrative.\nTo clarify, we already have a Human Rights Act in this country which was enacted in 1998 and which guarantees our rights in a huge number of areas. These include:\nThe right to life\nThe prohibition of torture and inhuman treatment\nThe right to liberty and freedom\nProtection against slavery and forced labour\nThe right to a fair trial and no punishment without law\nRespect for privacy and family life and the right to marry\nFreedom of thought, religion and belief\nFree speech and peaceful protest\nNo discrimination\nProtection of property\nThe right to an education\nThe right to free elections\nWhat people seem to miss is that before this piece of legislation was introduced we already had human rights; in fact we’d had them since the 1689 Bill of Rights, so we did not need another Act to confirm our rights. We weren’t suddenly gifted human rights in 1998 and when the Act is repealed, we won’t suddenly lose them either.\nThe problem that Reform U.K. has with the current U.K. Human Rights Act is not to do with the rights enshrined in this Act, these are, after all, basic rights that we enjoy and frankly, sometimes, take for granted. The problem is to do with how they are currently being ruled on and applied by the ECHR.\nThe current Act makes it clear that any judgement made using this Act must incorporate any “…judgment, decision, declaration or advisory opinion of the European Court of Human Rights”. In other words, our Act is subjugated to the European Court of Human Rights. In short, the ECHR is enshrined into U.K. law and it doesn’t need to be. Even the Lords were debating this in 2022 as there was already a clear understanding that this needed to be changed.\nWhen the Act was first introduced, there were very few instances where the ECHR and British law clashed, but over the past 25 years there has been a clear divergence and now, we find ourselves at odds with them in several areas.\nAnd it’s not only Britain. As neatly summed up by the House of Commons Library “In April 2024, the European Court of Human Rights (ECtHR) ruled that the Swiss Government’s climate policies violated human rights. The judgment said that the right to a private and family life meant that states are obliged to protect their citizens from the “serious adverse effects” of climate change”.\nThat the ECHR felt able to dictate to an elected government sent a shockwave through the political system. The Swiss response; they’ve decided to ignore the ruling. Their view is that as a democratic country they don’t need to be told what to do by an outside court.\nDid the world come to an end when they did this? Did the skies fall? No. Nothing changed. Apart from the fact that the Swiss people were supported by their democratically elected government against a handful of environmental protesters who felt that ‘lawfare’ was their best option.\nIn the U.K. we have an existing courts system of magistrates, crown, appeal, and supreme courts to decide on our law. They should be sufficient to ensure that the law is applied fairly in this country. However, when claimants have exhausted our legal system and are still being told no, they currently have the right to take their case to the ECHR.\nUnfortunately, as we have seen, the ECHR through their recent decisions, have led some to question whether they are making the right decisions. Their rulings have become more and more detached from the original aim of the legislation they are ruling on.\nInstead of simply ruling on the application of the law as set down by Parliament, they have shifted to a position where they are interpreting law; in other words, changing the law to what they think it should say rather than what it does say, without any reference back to the Parliament who made the law in the first place.\nThe end result is a handful of unelected individuals, sitting in a court that is not based in this country have assumed the right to make new laws for us, without oversight, nor the chance to debate and decide whether these laws are correct.\nThe current U.K. system of government was deliberately designed to prevent this from happening. Parliament debate and agree laws, the justice system applies those laws. They should not be open to interpretation, and certainly not to create precedents that prevent the country from carrying on its lawful business.\nThe Rwanda flights brought into sharp relief exactly how far this system has moved away from its original intent. Despite the fact that no one other than the government thinks these are a good idea, the courts prevented them from fulfilling an essential part of any government responsibility, that of keeping its borders secure.\nWhich brings us back to the original lie.\nAs a sovereign nation, we have a long tradition of giving our citizens rights and protections that are so well regarded internationally, that much of the world now has the same or similar rights.\nWe set the benchmark for human rights and have fought wars to protect them, not only in this county, but across the world. We helped create the ECHR based on the rights that we already enjoyed back in 1950. To suggest that suddenly we are going to remove them all because we leave the ECHR is not only a lie but betrays an ignorance beyond comprehension.\nTo be clear, the Reform U.K. Contract with You states clearly that once we leave the ECHR we will introduce a British Bill of Rights. A bill that will codify the rights we all correctly enjoy and ensure we can continue to enjoy them without interference from unelected foreign courts.\nSo, if anyone tells you that Reform U.K. policies are dangerous because we will lose our human rights, feel free to enlighten them. It’s not the case, has never been the case, and will never be the case. A vote for Reform U.K. is a vote to restore the sovereignty of the country and to reaffirm the rights of every citizen in the land.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_page_2/content_13.html": "Latest news\nLet’s explore the headlines together, unpack the complexities, and share in the diverse perspectives that shape our understanding of the UK. We are a community where your voice matters.\nPoliticians are human too\nRecently, I was invited to a fundraising event at St Helens’ church, Witton in Northwich, to...\nVote Reform, get Reform\nNow that the local elections are over and the dust has settled, it’s time to reflect on what...\nThe importance of policies to a Political party\nRecently, when I attended the Spring Party conference, I was introduced to Simon Marcus, our Head...\nPhilately & Politics\nNo one, it seems, who watched the recent ITV drama ‘Mr Bates v The Post Office’ could fail to be...\nEmily Pankhurst & Christmas\nDear Supporter, Recently I was selected to be your Prospective Parliamentary Candidate (PPC) at...\nImmigration & Representation\nDear Supporter, This week has been a pivotal week in politics, both for me personally, and...\nRemembrance Day\nDear Supporters, Firstly, Thank you to everyone who came to the Mid-Cheshire Meeting on...\nWe march onwards\nDear Supporters, I hope you are enjoying the autumn sunshine today in Cheshire. It was...\nCampaign kick off and the Party Conference\nDear Supporters, What a week it has been. Last Monday at the Penny Black pub in...\nSpokesperson for Mid-Cheshire\nDear supporter, I am writing to introduce myself as your local Prospective Parliamentary Candidate...\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_philately-politics/content_33.html": "No one, it seems, who watched the recent ITV drama ‘Mr Bates v The Post Office’ could fail to be moved by the plight of the sub postmasters featured. The outpouring of public rage against the perpetrators was quite unexpected. This quickly turned itself into focused anger as a petition was started demanding that Paula Vennells be stripped of her C.B.E.\nIn the end over 1.2 million people added their signature to the petition, and faced with that public pressure she handed back her C.B.E.\nThe angry public, however, are still looking for justice and have now started asking the question, who else was involved? Various political names have been embroiled in this scandal including Ed Davey, Tony Blair, David Cameron and Sir Kier Starmer, who was Director of Public Prosecutions during a large part of this scandal. His defence is that he had no ideas the office of the DPP were prosecuting sub postmasters as it was a tiny number in a sea of prosecutions. Subsequently, this has also turned out to be incorrect.\nThe key point here is that over the past 25 years we have been governed successively by Labour and Conservatives governments and none of them should escape this scandal unscathed.\nSo, anyone thinking of voting Labour or Conservative should remember this outrage. It happened on their watch and despite their best protestations, the public are now demanding answers. After all, they were supposed to be working for us, not against us.\nWhat this sorry episode demonstrates is that there are inherent dangers in entrusting your life to technology. We need good governance for when tech fails, as it inevitably will. For this reason we should be wary of how we choose to embed technology in our everyday lives, including CBDC’s, AI and Digital ID’s. This is not to say that we should rail against them, simply that if we are to adopt new technology, we need to understand what we should watch for to identify when it’s going wrong, as history tells us that inevitably it will.\nAnother point that struck me whilst watching the drama and the subsequent public outrage is that we are a nation of proud people with a keen sense of injustice. We may be four nations with slight differences, but we are one people.\nThe drama struck home quite hard in our household as I am married to a man who’s hobby is stamp collecting. As a philatelist, he has been aware of this scandal for many years and together, we saw Nick Wallis in 2022 as he toured the U.K. raising awareness of this issue through his book ‘The Great Post Office Scandal”. So, when I asked my stamp collector to find me an image for this blog he chose stamps from each of the nations that make up the United Kingdom. As you can see, they all have their differences, but in essence, they are one. One United Kingdom.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk/content_1.html": "About\nLearn about Emma\nEmma is Reform UK’s candidate for Mid Cheshire and stood for them in the 2024 General Election. She is a well-known local businesswoman, entrepreneur, and charity fundraiser. She served for many years on Lostock Gralam Parish Council, rising to Chairman. Emma is the Chief Commercial Officer at Runcorn Based Aqueos Digital, an Ambassador for Prevent Breast Cancer and was elected Greenbank Councillor in March 2025 for Northwich Town Council.\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_the-kings-speech-does-little-for-mid-cheshire/content_31.html": "I read with interest the article in the Northwich Guardian this week by our new M.P. Andrew Cooper, on why the King’s Speech would be good for Mid Cheshire. I must say that I was a little surprised by some of these supposed benefits for the people and businesses of Northwich, Middlewich and Winsford and indeed, by some of the omissions in his statement.\nOn the economy, he omits the fact that Labour’s main change so far is to strengthen the role of the OBR which, far from helping control the economy, will place it in a stranglehold. Politicians, no matter which party they represent, will no longer be able to control the economy as it will now be completely outsourced to an unelected quango.\nThe proposed legislation to ban zero hours contracts will seriously disadvantage workers in Mid Cheshire who need flexibility. We already have strong legal protection to stop employers behaving irresponsibly, so this new legislation will simply restrict jobs and remove employment opportunities.\nOn the campaign trail all candidates advocated for better bus services, particularly for Winsford and Middlewich, so the idea of an integrated local system is good news. Taking them into public ownership, however, is unlikely to deliver the service we need at a price which is acceptable. It will be fascinating to see how this legislation works in our area.\nWhilst I am delighted that breakfast clubs will be provided for all children, I am more concerned that this Government seems determined to review the national curriculum, again. Their plans seem to involve scrapping the current system which, for all its faults, delivers outcomes measurably better than those in Wales and Scotland, and instead simply level education down. Aspiring children will be left with high and dry under these circumstances.\nTheir plans for the NHS so far seem to amount to simply pouring even more money into a failing system. Despite the Secretary of State for Health stating publicly that the NHS is broken, I see no coherent plan yet for change. Promising to slash waiting lists is fine, but remember, they can only do this by utilising the currently unused capacity in the private sector. When Reform U.K. proposed this, we were accused of trying to privatise the NHS. Now Labour is doing it I’m waiting for a similar outcry, though I suspect I might be waiting some time.\nFinally, their proposed legislation in the housing market will be the final nail in the coffin for many landlords, who will simply sell up. Seemingly carrying on a disastrous policy that the Conservatives were thinking of implementing, far from improving the market for renting, this will further squeeze the availability of rental property and drive up rents. Whilst we wait for the promised 1.5 million new homes, more and more families will struggle to find affordable housing anywhere in Mid Cheshire.\nOf course, delivering all of their legislative agenda will require billions of pounds of our money. So far, despite having complete visibility of the state of public finances before entering office, they appear to be trotting out the ‘we didn’t realise how bad it was’ line before then floating the suggestion that the rich can pay for all of this.\nIf this is the case, I have bad news for all of you; the rich are every one of us, and not a single person will be better off if they implement their ‘ambitious plan that will improve our economy’.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_reform-party/content_6.html": "About the Reform party\nLet’s Make Britain Great.\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again.\nTogether let’s Make Britain Great!\nTo do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense would be a good start!\nThe nation faces many challenges, but we can overcome them. To succeed, we need to do Brexit properly. We must grow our way out of the crisis, we cannot tax our way out of it. We must stand up for our core democratic values, our civil liberties, our right to free speech. Let’s celebrate our pride in being British: our amazing culture, our unbreakable communities, our incredible heritage. Let’s stop all the woke nonsense that is holding us back. Let’s have a proper immigration policy that works for our country and protects our borders. Together, let’s make great things happen!\nReform is essential in these key areas:\n1. Reform our Economy:\n2. Reform our Public Sector:\n3. Reform our Energy Strategy:\n4. Reform our Institutions:\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_home/content_5.html": "About\nLearn about Emma\nEmma is Reform UK’s candidate for Mid Cheshire and stood for them in the 2024 General Election. She is a well-known local businesswoman, entrepreneur, and charity fundraiser. She served for many years on Lostock Gralam Parish Council, rising to Chairman. Emma is the Chief Commercial Officer at Runcorn Based Aqueos Digital, an Ambassador for Prevent Breast Cancer and was elected Greenbank Councillor in March 2025 for Northwich Town Council.\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_page_3/content_34.html": "Latest news\nLet’s explore the headlines together, unpack the complexities, and share in the diverse perspectives that shape our understanding of the UK. We are a community where your voice matters.\nWelcome to Emma Guy Reform\nWelcome to my new website, designed specifically to provide you with updates on local and national...\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nEmma believes that change is needed and that now is the time for Reform.\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_author_emma-guy/content_16.html": "by Emma Guy | Dec 30, 2024 | News\nI should probably start this by saying it must be a horrible feeling. Having been in opposition for fourteen years, to finally win victory with a crushing majority, only to find that the country has been left in an appalling state. From the state of the public...\nby Emma Guy | Nov 4, 2024 | News\nLast week, Rachel Reeves delivered her, and Labour’s first budget for fourteen years. The first budget ever by a woman (did she mention that?). You might think that having had so much time to think about how to make this country prosperous again that it would...\nby Emma Guy | Oct 7, 2024 | News\nI was fortunate enough this weekend, to meet the former Mayor of Llandudno. I was in a restaurant where she was sat on an adjacent table. After finishing her starter she got up and wandered over to our table. “Are you visiting our town?” she said....\nby Emma Guy | Aug 12, 2024 | News\nBeing a policeman or woman has never been an easy job. For a start, you need to be able to pass the physical, and then attend college where you learn the law of the land and how to administer it. That, in itself, is no mean feat of memory. Once you graduate, you join...\nby Emma Guy | Aug 2, 2024 | News\nThe recent story of Cheshire West and Chester Council’s planning committee refusing the application for a huge solar farm at Winnington made headline news in the Northwich & Winsford Guardian. The councillors who fought against it celebrated, whilst, below...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_author_emma-guy_page_5/content_42.html": "by Emma Guy | Dec 31, 2022 | News\nWelcome to my new website, designed specifically to provide you with updates on local and national issues, the progress of Reform UK, and news on how I can make a difference locally. Of course, I can’t do this without your help and support and I would encourage you to...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_rising-inflation-will-kill-labours-budget/content_28.html": "Last week, Rachel Reeves delivered her, and Labour’s first budget for fourteen years. The first budget ever by a woman (did she mention that?).\nYou might think that having had so much time to think about how to make this country prosperous again that it would have been better received than it has been. But no, it went down like a lead balloon. It was a disaster.\nFrom the pre budget scrapping of the winter fuel allowance to the inheritance tax on farmers which could destroy food security here in the U.K., the entire budget was ill conceived and muddle headed.\nOn top of that, it was tin eared.\nShe claimed to have found a £22bn black hole in the accounts on day one in the job but the Office of Budget Responsibility (OBR) have said that any black hole, such as it was, had been created by their day one largesse in handing huge pay rises to train drivers and doctors, astonishingly without insisting on any improvement in productivity. Even the Institute for Fiscal Studies have said that the deficit was there in plain sight for anyone who wanted to look for it before the election, and it was definitely not as big as she makes out.\nDespite instructions from Labour’s communications team for everyone to parrot the same tired lines of a £22bn black hole, 14 years of Tory chaos and this being a one off budget to fix the problems of the country, few of my constituents are believing this rhetoric. My inbox has been filled with people who are going to struggle with these new taxes, including lifelong Labour supporters who now regret their vote at the last election.\nThe headline tax rise was a swingeing increase in employers national insurance which we are told is not a tax on working people (however a working person is defined). Unfortunately, the reality is that it is exactly that. Employers were meant to make up for this tax by increasing prices and reducing future pay rises; so it is a tax on working people as well as business owners, (who are also working people, Chancellor).\nUnderpinning the budget is a hope, more like a gamble, that inflation remains low, at or around the Bank of England target of 2%. But it won’t, it will rise. It has to rise, in part due to this budget.\nFeed in costs from the budget such as increases in employers national insurance will lead to increased prices for goods and services. Raising the minimum wage wage might sound good in theory, but when it happens it forces upward pressure on all wages in a firm as the wage gaps shrink between staff. Eroding differentials mean businesses either lose existing staff who feel undervalued by seeing new starters coming in on not much less than them, or pay them more, leading to wage inflation.\nAdd to this the truly ruinous green energy policies being pushed by Ed Milliband, and far from everyone’s energy bills coming down by £300 as promised in their manifesto, they will be rising now, and again in the future. In fact I predict that if they continue down this path that energy costs to homes and businesses could become unaffordable for many people.\nThe entire budget is built on the hope that inflation remains low and that interest payments on the £140bn she’s looking to borrow will remain stable. But they won’t. Interest rates will rise and inflation will rise and no matter how hard she scolds the Bank of England for their inability to control it, they will be powerless to prevent it.\nLike a car crash in slow motion, her budget is doomed from the off, and for all the ‘taking the tough decisions’ and it being a ‘one off budget’ meaning she won’t have to come back and ask us for more money, she’ll have to ask us for more money. Probably sooner rather than later.\nThe Labour government has fallen from grace with such spectacular and unprecedented speed that despite blaming everything on the nasty Tories, 14 years of chaos and a 22bn black hole, even their own supporters are publicly saying they’ve got it wrong.\nThey had a chance to do the right thing. Despite only getting 20% of the public vote, their mandate gave them a chance to finally wipe the slate clean, and set the country back on a prosperous track once again.\nBut they’ve failed.\nThey’ve failed to ‘smash the gangs’ delivering migrants into the uk, they’ve failed to stop using U.K. hotels to house them, they’ve failed to reduce energy bills (they’ve just gone up £300, not down) and they failed to boost the economy.\nThis budget will be seen as one of the most dangerous ever delivered by a chancellor as it does nothing to address the problems the British economy faces, and simply borrows even more money to hose at an ever expanding public sector that cannot drive efficiency and in many cases, cannot deliver.\nWhat Britain needed was something different. What we got was an acceleration of the very things that drove us to where we are today. Far from solving our problems, it’s going to turbo charge them.\nBefore this election, people were talking about a two or three term Labour government being elected. If the budget and their performance to date is anything to go by then they’ll be lucky to complete one term. Rising inflation will undermine every ambition this budget has and simply propel us towards the arms of the IMF. It’s like the 1970s all over again.\nDespite their attempts to portray themselves as economically prudent, this budget has simply proven that Labour are, as always, a high tax and spend party, despite the fact that it never has, and never will work.\nCome the next election, I have a feeling that the public won’t be quite so generous.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_author_emma-guy_page_2/content_35.html": "by Emma Guy | Jul 30, 2024 | News\nWho knew it would be that easy? Who could have imagined that the Junior doctor’s strikes, which have been ongoing for sixteen months, could be settled in a matter of days. I bet the last government are kicking themselves that they didn’t think of this earlier. Imagine...\nby Emma Guy | Jul 29, 2024 | News\nI read with interest the article in the Northwich Guardian this week by our new M.P. Andrew Cooper, on why the King’s Speech would be good for Mid Cheshire. I must say that I was a little surprised by some of these supposed benefits for the people and businesses of...\nby Emma Guy | Jul 3, 2024 | Policies\nOne of the easiest ‘dog whistle’ slurs that has been levelled against Reform U.K. during this election campaign is that the party is institutionally racist. Those making the claims don’t appear to need any proof. Apparently, it is enough these days to say someone is...\nby Emma Guy | Jul 1, 2024 | News\nThe problem with lies is that they can sometimes get so big that they take on a life of their own. As Winston Churchill once remarked, “A lie gets halfway around the world before the truth has a chance to get its pants on.” The big problem is that if people are...\nby Emma Guy | Jun 24, 2024 | News\nWith just ten days to go before the next General Election, all I seem to see from candidates of all parties is a consistent mantra. ‘We want change’ they shout. ‘Time to get the Tories out’ they cry. Whilst there may be general agreement that the Tories have...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_politicians-are-human-too/content_20.html": "Recently, I was invited to a fundraising event at St Helens’ church, Witton in Northwich, to support Christian Aid. That evening, I was fortunate enough to meet almost all the other candidates for the newly created Mid Cheshire parliamentary seat, all of us looking to gain that seat in Parliament to represent you.\nIt was a wonderful event. We sat and chatted amicably, shared ideas, and had a great time whilst also raising money for Christian aid.\nI was fortunate enough to meet the conservative candidate, Charles Fifield, Green Party candidate, Mark Green, and Independent candidate Helen Clawson. We all stood around and chatted for twenty minutes whilst others ate their curry, and truth be told, we found lots of common ground.\nWhat struck me was that there was more that united us than divided us. Every one of us desperately wanted to make a difference in the local community and to effect real change that would help people. What also struck me was that we were all human. Gathered as we were in St Helen’s church it seemed fitting that we had all attended with the single aim of helping people, not knowing that the other candidates would be there.\nIt was a great evening, and we all enjoyed not only the food but also each other’s company.\nBut now the starting pistol has been fired on a general election we need to retreat to party lines and appear to be partisan to our own cause, despite the fact that this masks the real people we all are.\nSo, as we enter this crazy six weeks of campaigning before the general election, I thought it worth saying, publicly, that all of us, irrespective of our party affiliations are human beings. We might disagree with each other on matters of policy but I know that whoever is elected as MP, we will represent everyone’s views, not just our own.\nAnd whilst we are expected to debate with each other publicly on matters of policy and promises, none of us would wish the other ill. The parties and policies we stand for are our own, and none of us want to see each other being attacked, besmirched, or harangued on social media.\nWhoever you support, whichever party you have an affiliation with, remember that candidates are human beings and are simply standing up for what they believe. So before you write or comment on any social media posts, remember to be kind online. We are all just human beings.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog/content_4.html": "Latest news\nLet’s explore the headlines together, unpack the complexities, and share in the diverse perspectives that shape our understanding of the UK. We are a community where your voice matters.\nWhy 2025 will be an ‘annus horribilis’ for Labour\nI should probably start this by saying it must be a horrible feeling. Having been in opposition...\nRising inflation will kill Labour’s budget\nLast week, Rachel Reeves delivered her, and Labour's first budget for fourteen years. The first...\nA life dedicated to service\nI was fortunate enough this weekend, to meet the former Mayor of Llandudno. I was in a restaurant...\nPolicing has changed, except that it hasn’t\nBeing a policeman or woman has never been an easy job. For a start, you need to be able to pass...\nWant it or not, you’re having it.\nThe recent story of Cheshire West and Chester Council’s planning committee refusing the...\nLabour fail their first real test\nWho knew it would be that easy? Who could have imagined that the Junior doctor’s strikes, which...\nThe King’s speech does little for Mid Cheshire\nI read with interest the article in the Northwich Guardian this week by our new M.P. Andrew...\nIs it racist to want to enforce the law of the land?\nOne of the easiest ‘dog whistle’ slurs that has been levelled against Reform U.K. during this...\nIn a campaign full of lies, this one is possibly the most ridiculous\nThe problem with lies is that they can sometimes get so big that they take on a life of their...\nChange they all cry; but to what?\nWith just ten days to go before the next General Election, all I seem to see from candidates of...\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_category_news_page_2/content_24.html": "by Emma Guy | Jul 29, 2024 | News\nI read with interest the article in the Northwich Guardian this week by our new M.P. Andrew Cooper, on why the King’s Speech would be good for Mid Cheshire. I must say that I was a little surprised by some of these supposed benefits for the people and businesses of...\nby Emma Guy | Jul 1, 2024 | News\nThe problem with lies is that they can sometimes get so big that they take on a life of their own. As Winston Churchill once remarked, “A lie gets halfway around the world before the truth has a chance to get its pants on.” The big problem is that if people are...\nby Emma Guy | Jun 24, 2024 | News\nWith just ten days to go before the next General Election, all I seem to see from candidates of all parties is a consistent mantra. ‘We want change’ they shout. ‘Time to get the Tories out’ they cry. Whilst there may be general agreement that the Tories have...\nby Emma Guy | May 24, 2024 | News\nRecently, I was invited to a fundraising event at St Helens’ church, Witton in Northwich, to support Christian Aid. That evening, I was fortunate enough to meet almost all the other candidates for the newly created Mid Cheshire parliamentary seat, all of us looking to...\nby Emma Guy | May 13, 2024 | News\nNow that the local elections are over and the dust has settled, it’s time to reflect on what happened during campaigning and ask a really important question. Is anyone else fed up with the narrative ‘vote Reform, get Labour’? We heard it so often in the run-up...\nby Emma Guy | Jan 24, 2024 | News\nNo one, it seems, who watched the recent ITV drama ‘Mr Bates v The Post Office’ could fail to be moved by the plight of the sub postmasters featured. The outpouring of public rage against the perpetrators was quite unexpected. This quickly turned itself into focused...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_privacy-policy/content_26.html": "General Information\nThis privacy notice sets out the ways in which Emma Guy Reform collects, processes and shares your personal data through this website.\nThis website may include links to third-party websites, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites and are not responsible for their privacy statements. When you leave our website, we encourage you to read the privacy notice of every website you visit.\nWhat information does this website collect?\nWe may collect, process and use the following information about you when you use our website:\nyour name, email address, company name, job title and telephone number if you submit a query to our contact form;\nyour IP address;\nyour browser type and location;\npages visited;\nlinks clicked on; and\nvisitor numbers.\nThis website also uses Google Analytics to monitor user session data and heat mapping.\nWhat is your data used for?\nWe process your personal data in the following ways, and on the following legal bases:\nyour name, telephone and email address for the purposes of responding to the query you raised using our contact form, it does this on the basis that it is in its legitimate interests to do so;\nto carry out Emma Guy’s obligations arising from any contracts entered into between Emma Guy and you;\nto optimise and enhance your and other users’ experience of the this website, it does this as it is in its legitimate interest to ensure that you and other users receive the best experience possible; and\nany other purposes where we have obtained your consent to do so.\nWe do not rely on consent as a legal basis for processing your personal data other than in relation to sending electronic direct marketing communications.\nWe may use your information in an anonymised and/or aggregated manner in order to analyse the data so that it can enhance its IT systems, website or newsletter, and to carry out research (including on individuals’ preferences around events). It may share this anonymised and/or aggregated data with third parties, but you will not be identifiable from any such data.\nWe may review your personal data if we have reason to believe that the information has been provided inappropriately, unlawfully or illegally. We do this on the basis that it is necessary in its legitimate interest to ensure that the website is being used appropriately, lawfully and legally.\nWe may process data sourced from a 3rd party supplier (“prospect data”), relating to an individual that has an interest in Reform Party. The data may be processed for the purposes of communicating Reform Party information. The legal basis for this processing is our legitimate interest.\nDisclosing information to third parties\nThis website does not sell, trade, or otherwise transfer your personal identifiable information to outside parties other than as set out in this privacy notice.\nWe do not send the personal data we collect through the website to any third parties.\nWe don’t allow third-parties to use your personal data for their own purposes and only permit them to process your personal data for specified purposes and in accordance with our instructions.\nWe will only transfer your personal data outside of the EEA to organisations who have adequate safeguards in place to ensure the security of your personal data.\nWe will disclose your personal data to third parties:\nWe may pass your personal data to third parties in a statistical and/or aggregated manner in order to analyse the data. We will always ensure that you are not identifiable from any such data.\nWe may otherwise share your information as directed by you or subject to your consent.\nHow do we collect your data?\nYou directly provide this website with most of the data we collect. We collect data and process data when you:\nRegister online, or make an enquiry on our website\nVoluntarily complete a customer survey or provide feedback via telephone, email or other online communication channels and platforms managed by us.\nUse or view our website via your browser’s cookies.\nWe may also receive your data indirectly from the following sources:\nGDPR compliant third party databases\nHow will we use your data?\nWe collect your data so that we can:\nProcess any enquiry you may make.\nEmail you about Reform Party news we think you may be interested in.\nProvide you valuable guidance on political matters and news about Emma Guy that we believe you would be interested in.\nMarketing and news updates\nEmma Guy would like to send you information that we think you might like.\nIf you have agreed to receive marketing, you may always opt out at a later date.\nIf you have requested to receive email news updates from Emma Guy, you may always opt out at a later date. You can click ‘unsubscribe’ on our emails or directly email weavervale@reformuk.com requesting that you are removed from our mailing list.\nYou have the right at any time to stop Emma Guy from contacting you for marketing purposes.\nIf you no longer wish to be contacted for marketing purposes, please email us or call us to let us know or click unsubscribe on any email marketing you receive from us.\nProtecting your personal data\nEmma Guy has put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, it limits access to your personal data to those employees, agents, contractors and other third parties who have a business need to know and in accordance with this privacy notice. They will only process your personal data in accordance with Emma Guy’s instructions.\nWe have put in place procedures to deal with any suspected personal data breach and will notify you and any applicable regulator of a breach where it is legally required to do so.\nYou play an important role in keeping your information secure. If you have any reason to believe that your interactions are no longer secure, then please contact weavervale@reformuk.com\nHolding your personal data\nWe will retain your data in accordance with our data retention policy.\nWe may also retain your data for further periods where we need to do so in order comply with any legal or regulatory requirements (including keeping certain records for accounting purposes), to carry out audits, to detect and prevent fraud, to enforce contracts or to resolve any disputes.\nTo determine the appropriate retention period for personal data, we consider the amount, nature, and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we processes your personal data and whether those purposes can be achieved through other means, and the applicable legal requirements.\nYour rights\nWhere we rely on consent as the condition for processing your personal data, you have the right to withdraw that consent at any time.\nYou have various statutory rights in relation to your personal data. In particular, you have the right to:\nobject to direct marketing communications at any time;\nrequest and obtain access to your personal data;\nrectification or erasure of your personal data, in certain circumstances;\nobject to or restrict the processing of your personal data in certain circumstances;\nhave your personal data stored in a manner in which it is portable from the environment in which it is stored by us to another environment; and\nfile a complaint with the Information Commissioner’s Office.\nIf you make a request, we have one month to respond to you. If you would like to exercise any of these rights, please contact us at our email: weavervale@reformuk.com\nOr by phone +44 7538 322201\nCookies\nYou can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\nA cookie is a small information file that is sent to your computer, mobile or other device when you visit a website and it will recognise your device on future visits. These types of files do a number of different jobs, such as remembering your preferences and chosen items, improving your site experience and ensuring that the adverts or offers you see online are more relevant to you. These “cookies” can be divided into 4 types each of which is outlined below.\nCategory 1: Strictly Necessary Cookies\nThese cookies are essential for the operation of this website in order to enable it to function properly, such as remembering personal details and allowing you to access secure or exclusive areas of the website.\nCategory 2: Performance Cookies\nThis type collects anonymous information on how people use the site and the data is merged with other users to enable us to improve how the website operates. They allow us to recognise and count the number of visitors and to see how visitors move around our website when they are using it.\nFor example, the website utilises Google Analytics cookies to help us understand how visitors arrive at the website, how they browse or use the website and highlight areas for improvement such as navigation, user experience and marketing campaigns. The data stored by these cookies never shows personal details from which your individual identity can be established.\nThese cookies help us to improve the way its website works, for example, by ensuring that users are finding what they are looking for easily.\nCategory 3: Functionality Cookies\nThese are used to recognise you when you return to the website and to personalise content and remember your preferences. These can then be used to provide you with an experience more appropriate with your selections and make the visits more tailored and pleasant.\nThe information is also merged with other users on an anonymous basis to improve how the website operates.\nCategory 4: Targeting Cookies or Advertising Cookies These cookies collect information about your browsing habits in order to make advertising relevant to you and your interests. They remember the pages you have visited and the links you have clicked on. This is used to make the website and adverts more relevant to your interests.\nChanges to Privacy Notice\nIf we decide to change this privacy notice, any changes will be posted on this page.\nThis privacy notice was last modified on 30th December 2022\nContact\nIf you wish to contact us in relation to this privacy notice, including in relation to any of the rights set out above, please contact weavervale@reformuk.com",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_author_emma-guy_page_3/content_39.html": "by Emma Guy | May 24, 2024 | News\nRecently, I was invited to a fundraising event at St Helens’ church, Witton in Northwich, to support Christian Aid. That evening, I was fortunate enough to meet almost all the other candidates for the newly created Mid Cheshire parliamentary seat, all of us looking to...\nby Emma Guy | May 13, 2024 | News\nNow that the local elections are over and the dust has settled, it’s time to reflect on what happened during campaigning and ask a really important question. Is anyone else fed up with the narrative ‘vote Reform, get Labour’? We heard it so often in the run-up...\nby Emma Guy | Mar 15, 2024 | Policies\nRecently, when I attended the Spring Party conference, I was introduced to Simon Marcus, our Head of Policy. We had just seen for the first time, the draft copy of our ‘Contract with YOU’ and I was hugely encouraged by the scope and scale of the document. After all,...\nby Emma Guy | Jan 24, 2024 | News\nNo one, it seems, who watched the recent ITV drama ‘Mr Bates v The Post Office’ could fail to be moved by the plight of the sub postmasters featured. The outpouring of public rage against the perpetrators was quite unexpected. This quickly turned itself into focused...\nby Emma Guy | Dec 23, 2023 | News\nDear Supporter, Recently I was selected to be your Prospective Parliamentary Candidate (PPC) at the next election for the seat of Mid Cheshire. On the day this was announced, I asked a fellow member to take a photo of me next to the Christmas Tree so I could send a...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_welcome-to-emma-guy-reform/content_37.html": "Welcome to my new website, designed specifically to provide you with updates on local and national issues, the progress of Reform UK, and news on how I can make a difference locally.\nOf course, I can’t do this without your help and support and I would encourage you to use the contact page to get in touch and let me know if you can support this cause. Everyone is welcome and I will be grateful for support in areas as diverse as social media management to leaflet deliveries.\nRecently, we’ve all heard friends and relatives complain about the state of the country. No one appears to be happy with the existing state of affairs and frequently we are told that ‘someone should do something about it’. The problem is, very few people are willing to even try for fear of a toxic cancel culture on social media and the very real project of threats from opponents.\nTo make a change, someone has to be willing to stand up and do something, not just complain about it from the sidelines. I can no longer, with a clear conscience, sit back and do nothing. Far too many people feel that change has to happen, whether it is with the country’s finances, cost of fuel, utility prices, immigration or even simply accessing the services of the NHS. For these reasons and many more, I have decided to stand for both the Cheshire West and Cheshire elections in 2023 and the General Election in 2024.\nTogether with your help, we can make a difference. Join me and find out how.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_labour-fail-their-first-real-test/content_11.html": "Who knew it would be that easy? Who could have imagined that the Junior doctor’s strikes, which have been ongoing for sixteen months, could be settled in a matter of days.\nI bet the last government are kicking themselves that they didn’t think of this earlier.\nImagine the heartache they could have avoided. Imagine the immense delays and crippling pain of all those patients forced to endure a longer than expected wait for essential surgery. The government might even have escaped the months of aggravation they received for being unable to resolve this dispute.\nIf only they’d thought of capitulating.\nWhen Labour came into office, Wes Streeting said that he’d make this a priority; that he would settle this long running dispute. Whilst many of us guessed he would offer them more money, no one expected he would spray our money around on this scale. The junior doctors had been intransigently demanding a 35% rise for so long, that no one took their claims seriously. After all, if you cave in to such ridiculous demands, what next? Nurses wanting 40%? Train drivers 50%? Public Sector workers 70% and Monday’s and Friday’s off?\nThis wonderful pay settlement, which will no doubt be sold to the British public as a success, will cost all of us a minimum of £1 billion. And whilst few of us would begrudge junior doctor’s a reasonable pay rise, who thought 35% was reasonable? Who now thinks 20% is fair?\nWhat really makes this such an awful settlement, unless you are a junior doctor of course, is that this news arrives on the day that Rachel Reeves tells us they have found an unexpected ‘black hole’ in the public finances of £22 billion.\nBetter make that £23 billion Rachel, and make room for a bit more to come yet.\nWith the unions already rubbing their hands with glee, expect public sector workers to get above inflation pay rises of 5.5% as well, all of which will fuel inflation. The unions can smell blood in the water now the government have made it clear that they are willing to throw pots of cash at public sector workers to keep them happy.\nIt’s officially open season on public finances.\nWith this decision, they have effectively destroyed the Bank of England’s 2% inflation target. If we didn’t have any money yesterday, we most definitely don’t have any now.\nAnd the bit they haven’t told us; we’re expected to pay for this. Every one of us. Pensioners included.\nI know they promised not to put up taxes but frankly, they have no option left but to squeeze the productive part of the economy (that’s all of us taxpayers) to fund this. The magic money tree is bare; it’s only us poor individuals who are still working that can fund this largesse.\nSo, congratulations Labour on sorting out one of the longest running industrial disputes in the U.K. by using money we don’t have to pay for an outrageous settlement that will leave us all poorer.\nIf this is what happens after three weeks in office, heaven help us after three years.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_is-it-racist-to-want-to-enforce-the-law-of-the-land/content_22.html": "One of the easiest ‘dog whistle’ slurs that has been levelled against Reform U.K. during this election campaign is that the party is institutionally racist.\nThose making the claims don’t appear to need any proof. Apparently, it is enough these days to say someone is racist for it to be true. Despite there being laws against this, because people want to believe it then it seems that it’s perfectly reasonable to call all Reform U.K. candidates and supporters racist.\nThis is fascinating.\nLeaving aside the small issue of proof, none of which exists, there is another more pressing issue.\nSince when did it become racist to want to uphold the law of the land?\nWe have had an Immigration Act on the statute books in this country since 1905. This 1905 Aliens Act was specifically designed to restrict immigration into Britain. Oddly, no one called it racist back then.\nSince then we have had many iterations of the law, with it being regularly updated throughout the 40’s, 50’s and 60’s. Finally, the Immigration Act 1971 gave clarity to who was allowed residency in the U.K., confirming the position for anyone born in parts of the Commonwealth.\nThe Act meant that net migration to the U.K. was controlled and typically 40-50,000 people a year were allowed to settle here.\nMembership of the EU and the expansion to include Eastern European countries meant an explosion of legal migration from 2004 onwards and the incumbent Labour Government struggled to control this, looking instead for electronic help through things such as iris recognition, heartbeat sensors, backscatter X-ray and gamma-ray scanners to spot hidden illegal entrants.\nRemember, this was a Labour government at the time and no one called them racist for trying to stop illegal migration.\nWe have since 2000, had an agreement with France to try and prevent illegal migration, and the U.K. even set up offshore processing centres in Sangatte, meaning we could offer British passport checks and border and customs controls in France.\nOnce again, no one thought this racist.\nIn fact, the 2002 government white paper on immigration said “Migration is an inevitable reality of the modern world and it brings significant benefits. But to ensure that we sustain the positive contribution of migration to our social well-being and economic prosperity, we need to manage it properly and build firmer foundations on which integration with diversity can be achieved”, and;\n“The Government will initiate an open and constructive debate about citizenship, civic identity and shared values”.\nNo one said it was racist in 2002 for the Labour government to suggest these things. To suggest that we might have an open debate about citizenship, civic identity and shared values.\nIt wasn’t racist then and it isn’t racist now.\nFast forward to 2024 and we are seeing record immigration into the U.K. In 2023 we allowed an additional 685,000 people net, to settle in this country. That was on top of the 765,00 we allowed in 2022. That’s over 1.4 million people settling in the U.K. legally. Add to that a further 75,000 illegal migrants who came across the Channel in small boats and we have an increase in population the size of Manchester in just two years.\nBut today, just pointing this out is, apparently, racist. When Labour were in power it was considered perfectly acceptable to discuss these things, but not now.\nThe Illegal Migration Act 2023 changed the law so that those who arrive in the UK illegally are not able to stay here and will instead be detained and then promptly removed, either to their home country or a safe third country. This is the law of the land. It was pushed through Parliament by the Conservative Party, against the voting wishes of the majority of Labour and Liberal Democrat MPs. Those passing the law weren’t called racist.\nReform U.K.’s position on immigration is clear. The party have stated that we need smart migration, not mass migration. We need to freeze non-essential immigration, stop the small boats, provide secure detention for all illegal migrants and immediately deport any foreign criminals.\nMost of this is already covered within existing legislation. It was agreed by Parliament and is U.K. law. When it was passed, no one said it was racist. No one said that we were not allowed to talk about it. No one thought it acceptable to denounce the politicians who voted this in.\nTo now try and pin a racism label on Reform U.K. for simply wishing to uphold the existing law of the land is deeply irresponsible. Moreover, it is pernicious and dangerous. It imperils the wellbeing of every candidate who is campaigning for a better, safer Britain. It breeds divisive resentment and seeks to split the country apart for no good reason.\nRemember, this is the law of the land. Whether you agree with it or not, this was passed into law and has over decades been amended many times by Conservative, Labour and Liberal Democrat politicians.\nIf they weren’t racist then, they’re not racist now. Neither is Reform U.K. for simply trying to do what others have failed to do; enforce the law.\nSo, either all politicians are racist or none of us are. You decide.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_category_news/content_18.html": "by Emma Guy | Dec 30, 2024 | News\nI should probably start this by saying it must be a horrible feeling. Having been in opposition for fourteen years, to finally win victory with a crushing majority, only to find that the country has been left in an appalling state. From the state of the public...\nby Emma Guy | Nov 4, 2024 | News\nLast week, Rachel Reeves delivered her, and Labour’s first budget for fourteen years. The first budget ever by a woman (did she mention that?). You might think that having had so much time to think about how to make this country prosperous again that it would...\nby Emma Guy | Oct 7, 2024 | News\nI was fortunate enough this weekend, to meet the former Mayor of Llandudno. I was in a restaurant where she was sat on an adjacent table. After finishing her starter she got up and wandered over to our table. “Are you visiting our town?” she said....\nby Emma Guy | Aug 12, 2024 | News\nBeing a policeman or woman has never been an easy job. For a start, you need to be able to pass the physical, and then attend college where you learn the law of the land and how to administer it. That, in itself, is no mean feat of memory. Once you graduate, you join...\nby Emma Guy | Aug 2, 2024 | News\nThe recent story of Cheshire West and Chester Council’s planning committee refusing the application for a huge solar farm at Winnington made headline news in the Northwich & Winsford Guardian. The councillors who fought against it celebrated, whilst, below...\nby Emma Guy | Jul 30, 2024 | News\nWho knew it would be that easy? Who could have imagined that the Junior doctor’s strikes, which have been ongoing for sixteen months, could be settled in a matter of days. I bet the last government are kicking themselves that they didn’t think of this earlier. Imagine...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_a-life-dedicated-to-service/content_12.html": "I was fortunate enough this weekend, to meet the former Mayor of Llandudno.\nI was in a restaurant where she was sat on an adjacent table. After finishing her starter she got up and wandered over to our table.\n“Are you visiting our town?” she said. “Thank you for coming to Llandudno”.\nWe started to chat to her and she was genuinely interested in where we were from, why we had chosen to come to Llandudno, and whether we were spending money locally, helping to support the local economy.\nShe was proud of the town and wanted to do her best to promote it to everyone she could.\nTalking later to her son, who she was dining with, we discovered that she is now in her early 80s and hadn’t been Mayor for some years, but she still felt she needed to use every opportunity to talk to people she met and promote the town.\nThat, is a life of service.\nShe didn’t expect anything from us; she certainly wasn’t expecting any freebies and definitely no recognition. If I wasn’t writing this blog then no one other than her family and me would know that this even happened. She just wanted to promote Llandudno. It was in her nature to do it, even though it was no longer her role or responsibility.\nSo, when you hear politicians talk about a life of service or a government of service, remember this lovely ex-Mayor. She exemplifies the difference between ‘people’ politicians who do it for their local community, and ‘career’ politicians who do it for altogether different reasons.\nWhen you next hear anyone in the political sphere talking about ‘service’ ask yourself whether you think the service is for the community or for themselves. If what they are saying and doing are the same thing, and their actions really are consistent with a life of service and a life well spent then support and congratulate them. If, however, you feel that you are hearing weasel words, then feel free to call them out.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_vote-reform-get-reform/content_38.html": "Now that the local elections are over and the dust has settled, it’s time to reflect on what happened during campaigning and ask a really important question.\nIs anyone else fed up with the narrative ‘vote Reform, get Labour’?\nWe heard it so often in the run-up to the polling that it even became a hashtag in its own right, and was used extensively, predominantly by conservatives, to try and stop their voters defecting to Reform.\nWhat never seemed to cut through on social media was the fact that this is nonsense. A vote for any party is a vote for that party and that party alone. It’s not a proxy vote for anyone else. We don’t currently have proportional representation and none of the votes were transferrable, so whether people thought this a ‘clever’ thing to say or not, it was factually incorrect.\nAs a statement, it also fails on a second point; namely that it is rooted in the belief that we are stuck with a two party system in this country which will never change and moreover, cannot change. This, of course, is also nonsense.\nThe Mayoral and local elections demonstrated quite clearly that almost 40% of all the available seats went to anyone other than conservatives or labour and that, apart from anything else, should give all of us hope that we can change the system.\nIn the Blackpool South by-election, where Mark Butcher stood for Reform and gained the highest percentage vote we have seen in any by-election to date (16.9%), the turnout was just 32%, meaning a full two thirds of everyone eligible to vote simply didn’t bother. Had more people turned out, would we have been able to win a greater vote share? That much is unclear, but it still leaves the question of why people stayed at home.\nWhy don’t people vote?\nIn researching this I came across a post on social media suggesting that more women than men failed to vote in the recent elections, and that struck me as strange. As many of you may already know, I often turn to Emily Pankhurst for inspiration and in this case, I went down a little rabbit hole on when women actually got the vote. I ended up on this Wikipedia page which contains some astonishing facts\nI’m willing to bet that some of these dates surprised you. Would you have known (or guessed) some of the countries that didn’t grant women the vote until relatively recently? I was shocked. Whilst some countries were not a surprise, I hadn’t realised that before women were granted the right to vote in the U.K. in 1918, they already had the right in what were former U.K. colonies such as Australia and New Zealand. Even the Pitcairn Islands seemed more advanced, granting suffrage to women in 1838!\nDigging a little deeper in my research it turned out that those who failed to vote split broadly equally between women and men. The low turnout was not determined by biological sex.\nLooking back at the last set of fully analysed data from the Electoral Commission, their report on the 2023 local elections confirmed that overall the turnout for these was just 32%, almost seven in ten people, women and men, eligible to vote, simply didn’t bother.\nThe reasons they gave varied, but fell broadly into four groups.\n- A lack of time or being too busy at work (15%)\n- A lack of interest or being fed up with politics (13%)\n- Medical reasons (8%)\n- Being away on polling day (8%)\nLower down the list, 6% simply forgot and 5% said they didn’t trust politicians. Alarmingly, another 4% said the parties didn’t represent their views and a further 4%, that there was no point in voting as it wouldn’t make a difference to the outcome. And if proof were ever needed that the current two party system is long past its sell by date, it’s there in black and white. On top of this, a further 3% didn’t vote because they don’t possess any I.D. and 1% because they objected to being forced to show I.D. to prove who they were. Given the current question marks over postal voting fraud, it begs the question of whether voter I.D. was a solution looking for a problem.\nBoth Labour and the so called Conservative Party have failed to properly govern this once beautiful country. They have wasted the last quarter of a century and have presided over a slow decline into mediocrity. They have created an environment where minority groups and minority views garner all the headlines and normal rational people are sidelined and left to wonder what has become of the society they grew up in and fondly remember.\nWe are slowly losing our way as a society. Our values seem to be eroding by the day, our laws are turned against us and violence stalks the streets of our capital.\nSomething needs to change and change urgently.\nBefore the next election, we need to carefully examine the policies, ideas and plans of each of the parties standing and encourage people to vote for the one that most relates to them and their families. The policies that will bring jobs, prosperity and a stable society in which to raise our children and grandchildren.\nAnd by the time the election is called (come on Rishi, get on with it…) we should be able to put to bed the myth of voting reform and getting Labour. In fact, come the next election we should be promoting:\nVote Labour, get Labour\nVote Conservative, get Conservative\nVote Reform, get Reform",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_author_emma-guy_page_4/content_41.html": "by Emma Guy | Nov 26, 2023 | News\nDear Supporter, This week has been a pivotal week in politics, both for me personally, and for this country. Nationally, we saw the official release of immigration numbers which, whilst not surprising to most of us, were an awful indictment of this current...\nby Emma Guy | Nov 11, 2023 | News\nDear Supporters, Firstly, Thank you to everyone who came to the Mid-Cheshire Meeting on Monday evening at the Penny Black in Northwich. It was great to be able to chat and gain knowledge from you all. There were some great ideas too, on how to get more...\nby Emma Guy | Oct 22, 2023 | News\nDear Supporters, I hope you are enjoying the autumn sunshine today in Cheshire. It was very interesting to read what the Sunday papers are saying about Reform UK. It seems that we have achieved some significant gains and excellent groundwork with the...\nby Emma Guy | Oct 9, 2023 | News\nDear Supporters, What a week it has been. Last Monday at the Penny Black pub in Northwich, along with other local Reform Spokespeople, we launched our local campaigns. Thank you to all our supporters who came. To those who have left their name and numbers...\nby Emma Guy | Sep 18, 2023 | News\nDear supporter, I am writing to introduce myself as your local Prospective Parliamentary Candidate (PPC) for ReformUK. Some of you may have already seen or met me, but for those of you who do not know me, let me briefly introduce myself. My name is Emma Guy, I’m...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_change-they-all-cry-but-to-what/content_8.html": "With just ten days to go before the next General Election, all I seem to see from candidates of all parties is a consistent mantra.\n‘We want change’ they shout. ‘Time to get the Tories out’ they cry.\nWhilst there may be general agreement that the Tories have done a spectacularly bad job over the past five years, and most people are eager for something to change, there has been little in the way of hard policy from any of the other political parties.\nThis is a real problem.\nAll the candidates are shouting for change, using it as a rallying cry and hoping to get people to march behind them, but there’s one big elephant in the room.\nChange to what?\nIt’s great that so many people want change, but what change do you want? And how can you be sure, even if you do know what changes you want, that those changes are what the country needs?\nWishing rid of the conservative government is a change that a lot of people desire, but what do they think any incoming government will do to improve their lives?\nWe’ve seen very little detail over the past couple of years, just a set of vague ideals and promises from Kier Starmer and the shadow cabinet. Even now there is a lack of willingness by him and his party to commit to doing anything if they are elected. There’s a vacuum of policy ideas from the Conservatives and the Liberal Democrats, still reeling from their leaders’ involvement in the Post Office scandal, seem bereft of original ideas.\nNone of them actually offer change. They all appear to be offering a tinkering around the edges with a guarantee of continuity, slightly left of centre socialism.\nReform UK are different. We’ve had fully costed proposals available for people to read for the past three months. Policies that get to the heart of the problems facing the U.K. today. Policies that are radical in some respects, but necessary to ensure that our society and way of life can continue.\nBecause one thing is crystal clear to anyone who stops to think about it for a moment. If we carry on along the path we currently occupy, things will only get worse.\nWe need to find a new path, a new trajectory for Britain.\nRemember, Einstein famously said that the definition of insanity was doing the same thing over and over again, yet expecting a different outcome. We’ve elected the main parties in and out of office for the past quarter of a century and they’ve brought us to this point. To do so again would simply be insanity.\nSomething needs to change, and that something is Reform UK.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_we-march-onwards/content_19.html": "Dear Supporters,\nI hope you are enjoying the autumn sunshine today in Cheshire.\nIt was very interesting to read what the Sunday papers are saying about Reform UK. It seems that we have achieved some significant gains and excellent groundwork with the recent by-elections, but we must now march on to consolidate these gains.\nTo that end, the next Mid-Cheshire meeting will be 6th November at Penny Black Pub in Northwich at 7:00 – 8:30pm.\nSeparately, I have been working through the list of names and contact details I received from the last meeting, and if I haven’t already spoken to you, I aim to be in touch soon.\nSee you on the 6th and thank you again for your continued support.\nKind Regards\nEmma Guy",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_contact/content_25.html": "Contact Emma\nTo find out more about Reform in your area or to support or volunteer, please fill in your details below and I will get back to you as soon as I can.\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nEmma believes that change is needed and that now is the time for Reform.\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_immigration-representation/content_32.html": "Dear Supporter,\nThis week has been a pivotal week in politics, both for me personally, and for this country.\nNationally, we saw the official release of immigration numbers which, whilst not surprising to most of us, were an awful indictment of this current Government. In the year to June 2023 we are told that 672,000 immigrants arrived in the U.K., most through legal means by obtaining visas, and at the same time they updated the number of people arriving in the U.K. last year from 606,000 to 745,000. If the ONS can underestimate the number of arrivals by 23%, we can be reasonably certain that this year’s figures are likely to be significantly worse than their current estimates.\nThe problems of this number of people arriving in the U.K. are, as we all know, many and various. The most obvious one is where to put them all. With both Labour and the Conservatives presiding over a quarter of a century of underinvestment in our housing stock, we simply don’t have enough homes to go round.\nRecently I was having a conversation with someone who sits on a Housing Association board. They told me that they have been asked by the Home Office to report how much space they have for housing Illegal immigrants. Their problem, much like most housing associations, is that they already have a waiting list; in their case over 60,000. If we can’t house the population of this country as it stands, how can we cope with the influx of immigrants amounting to more than the size of Manchester every single year?\nOn a personal note, this week was a milestone moment as on Thursday, alongside several hundred other Reform members, I was selected as your Prospective Parliamentary Candidate for Mid Cheshire.\nThis week, both nationally and locally, membership has increased on the back on the fall out from the immigration numbers. This means more supporters locally, more votes, and crucially, more people to help spread the word.\nIf you know anyone who is feeling politically homeless and disappointed with the lack of action from both Conservatives and Labour, talk to them about Reform and how with their help, we can win seats at the next General Election and make a difference.\nThank you as always for your support.\nEmma Guy",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_remembrance-day/content_15.html": "Dear Supporters,\nFirstly, Thank you to everyone who came to the Mid-Cheshire Meeting on Monday evening at the Penny Black in Northwich. It was great to be able to chat and gain knowledge from you all. There were some great ideas too, on how to get more ‘persuadables’ to vote for us as a party.\nToday, we mark Remembrance Day; a day where we respect and honour those who have made the ultimate sacrifice to defend this country and our ideals.\nSo, wear your poppy with pride today. We shall remember them.\nEmma Guy",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_emily-pankhurst-christmas/content_17.html": "Dear Supporter,\nRecently I was selected to be your Prospective Parliamentary Candidate (PPC) at the next election for the seat of Mid Cheshire. On the day this was announced, I asked a fellow member to take a photo of me next to the Christmas Tree so I could send a message to you all before the close of 2023.\nWhat struck me when looking more closely at the photo, is that behind me is a picture of Emily Pankhurst. Emily is someone who for many years I turned to for inspiration in politics. But, what I didn’t know until recently when conducting some additional research, was that one of her suffragettes was called Emma Guy Cromwell. Quite a coincidence. Perhaps it’s a sign, as she famously said ‘We are here, not because we are law-breakers; we are here in our efforts to become law-makers’ On that note, I would personally like to wish you all a very merry Christmas and a happy New Year.\nThank you for your support and here’s to making a difference in 2024.\nKind regards",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_category_news_page_4/content_40.html": "by Emma Guy | Dec 31, 2022 | News\nWelcome to my new website, designed specifically to provide you with updates on local and national issues, the progress of Reform UK, and news on how I can make a difference locally. Of course, I can’t do this without your help and support and I would encourage you to...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_the-importance-of-policies-to-a-political-party/content_27.html": "Recently, when I attended the Spring Party conference, I was introduced to Simon Marcus, our Head of Policy. We had just seen for the first time, the draft copy of our ‘Contract with YOU’ and I was hugely encouraged by the scope and scale of the document. After all, if a party has aspirations to govern, then the least they should be able to do is to produce policies that address the areas of most importance to the country.\nSimon was incredibly generous with his time, and spent it taking me through the thought process behind producing a document like this. Unsurprisingly, he told me that it had taken considerable time and debate to come up with a series of policies that not only would the members back, but that the rest of the electorate could back as well. Narrow, insular policies focusing on particular hot-button topics will never be enough to convince the majority of people that you’re the right party to govern.\nIn turn, this got me to thinking about how similar the process is to running a business. In business you have a mission and vision, followed by a series of strategies, tactics and targets: precisely what had been unveiled to us at the conference.\nPolicies are the backbone of every political party. Every manifesto is littered with them and every party hopes they will provide:\n- Guidance – to help and advise the principles for operations and decision making.\n- Accountability – if you set a target, you should be accountable for your performance to that target.\n- Consistency – Policies give clear guidelines of what is expected or acceptable to any organisation.\n- Risk management – by outlining the issues you are trying to solve and the solutions you propose, you are also demonstrating an understanding of the risks inherent in your course of action.\n- Supporter confidence in the party – policies that not only the core of your support, but others outside of your party can get behind, give you a solid platform to gain consensus amongst the majority of people.\n- Continual improvement – some of the goals may be aspirational and policies help to codify these and provide a framework for measuring continual improvement towards resolving the policy issue.\nAbove all, they foster a sense of trust and fairness and demonstrate your ethical approach to solving the problems that face the country. Moreover, they set standards by which you can expect to be measured and set a culture based on values and consensus.\nWithout policies, how can you convey all of these things to the whole of the country?\nAs in business, they provide a framework and give everyone an insight into the mission, vision, values and culture of any organisation. This is what we have done with the draft ‘Contract with YOU’.\nCurrently, it is in draft format as the party are actively seeking feedback on the policies and plans contained within it, and a lot of feedback has already been sent. But we want more. If you can spare some time, please read it for yourself (download a copy here) and let us know your thoughts?\nAfter all, without your support we can’t make the changes we know are needed to restore the fortunes of the United Kingdom.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_policing-has-changed-except-that-it-hasnt/content_7.html": "Being a policeman or woman has never been an easy job. For a start, you need to be able to pass the physical, and then attend college where you learn the law of the land and how to administer it. That, in itself, is no mean feat of memory.\nOnce you graduate, you join your local force where you work long, hard shifts, often at unsociable hours, for relatively low pay and a guarantee of discomfort. Every time you clock into work you can be sure that if you are policing on the frontline you will be dealing with harrowing situations, distressful situations and most probably, dangerous situations.\nYou go to work knowing the chances of being abused, spat on, injured or even killed are higher than in any other profession, other than the armed forces.\nYet still people volunteer to do this.\nThey know that the legal system demands precision, accuracy and reams of paperwork before any arrest becomes a conviction. They know that nothing in the job is easy and every day will be hard. And despite this, they still come forward.\nI know this because the picture you can see accompanying this blog is me at my passing out parade to become a Special Constable in the late 1980s. I’m the one on the right; the Mayor of Northwich is leaning in to speak to me.\nThe more observant of you might also spot that this picture was taken at the back of the Northwich Police Station, at the top of the Sheath Street car park.\nBack then I volunteered because I wanted to make a difference. I wanted to help my local community and keep them safe from the bad things that might happen to them if I could. I know that my contribution as a Special was only a small one, but to me, it was important to give something back.\nWhat drew me in were the basics of Peelian Principles, those principles laid down by Sir Robert Peel when he first established the modern professional police force back in 1829. Now, 200 years on, our brave policemen and women are once again at the forefront of public perception and as such, it’s important we remember the basic principles around which their role is based.\nSir Robert Peel knew that the police could only be effective if the population allowed them to exist; basically, policing by consent. People need to consent and to agree that the police are there, representing the public and ensuring law and order are maintained.\nThe principles he laid down are worth repeating as they are as relevant today as they were back then. They are:\n1. The basic mission for which the police exist is to prevent crime and disorder.\n2. The ability of the police to perform their duties is dependent upon public approval of police actions.\n3. Police must secure the willing co-operation of the public in voluntary observance of the law to be able to secure and maintain the respect of the public.\n4. The degree of cooperation of the public that can be secured diminishes proportionately to the necessity of the use of physical force.\n5. Police seek and preserve public favour not by catering to public opinion but by constantly demonstrating absolute impartial service to the law.\n6. Police use physical force to the extent necessary to secure observance of the law or to restore order only when the exercise of persuasion, advice and warning is found to be insufficient.\n7. Police, at all times, should maintain a relationship with the public that gives reality to the historic tradition that the police are the public and the public are the police; the police being only members of the public who are paid to give full-time attention to duties which are incumbent on every citizen in the interests of community welfare and existence.\n8. Police should always direct their action strictly towards their functions and never appear to usurp the powers of the judiciary.\n9. The test of police efficiency is the absence of crime and disorder, not the visible evidence of police action in dealing with it.\nOver the last two weeks, we have seen serious disorder on our streets to which the police have been called. They have held fast against this monstrous aggression, and have held fast to the Peelian principles as best they can.\nAs police on the ground, they have to deal with situations as they arise. They are not responsible for the punishment end of the legal spectrum, nor for decisions on whether to punish offenders or not. They can only do the job they are asked to do at the moment they have to do it.\nThe public, however, don’t see this. They see inconsistencies in policing. They see one type of march or demonstration being ‘kettled’ whilst the other side gets a free run and can wave banners bearing offensive slogans whilst the police stand by and do nothing.\nPolice don’t get a say in this. Orders come from higher up.\nPeople in the establishment are making these decisions, much as they have made the decision to arrest, prosecute and imprison rioters within days. This is a decision they have made. They could, if they wanted, make the same decision to deal with rape cases, where there are currently over 180 cases more than two years old in the system. The average wait time for a rape case to come to court is over one year.\nThe public are frustrated. They expect consistency from our legal system. They expect that if someone decides to attack a police officer carrying out their duty they are arrested, prosecuted and promptly jailed, as has happened to the rioters. What they also expect is that this process is carried out impartially (principle number 5) and that the law applies whatever your race, religion or ethnic background and wherever you committed the offence, be it in a town centre or at an airport.\nThe law is the law and must be upheld. Our police force do a fabulous job in this country and we should all support them and condemn anyone who thinks it is fine to attack them. We should never forget the seventh principle; “the police are the public and the public are the police; the police being only members of the public who are paid to give full-time attention to duties which are incumbent on every citizen in the interests of community welfare and existence.” In short, the policeman or woman on the front line is someone’s son or daughter and most likely, someone’s mother or father. They should not be subjected to abuse because it is incumbent on all of us to uphold the law of the land.\nI was proud to be a member of Cheshire Constabulary, giving something back to my community. And whilst I witnessed both awful and wonderful things during my years in the force, I also felt honoured to be alongside men and women who would put their lives on the line every day to protect and defend their local community,\nRemember, the police are not responsible for policy in the U.K., just for keeping law and order. If anyone has a grievance with the state of the U.K. then I would suggest that they raise it with their local M.P. and ultimately with the current government. Only they have the ability to affect reform and they should be in no doubt about the strength of feeling amongst the people in this county who are longing for a better, calmer, more cohesive and tolerant society.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_want-it-or-not-youre-having-it/content_10.html": "The recent story of Cheshire West and Chester Council’s planning committee refusing the application for a huge solar farm at Winnington made headline news in the Northwich & Winsford Guardian.\nThe councillors who fought against it celebrated, whilst, below the line, the comments split between people who thought that NIMBYs had prevented a useful development to those who couldn’t bear the thought of an average of 193 two-way lorry movements per day, or 20 two-way trips per hour.\nAmidst all of this noise, a point not lost to those commenting, was that we currently have a massive incinerator being built on the outskirts of town at Lostock Gralam. This too, was a development that had objections from parish, local, and town councillors and was eventually refused by Cheshire West and Chester Planning Department.\nBut it’s being built all the same.\nThe argument used back then was that it was the wrong solution to the problem of residual waste in Cheshire which was declining then and continues to decline to this day. It was unwanted by the residents, unneeded by the community, and would do nothing to help our local environment.\nThose with long memories will recall, however, that it was finally called in for Public Inquiry and despite over 20,000 signatures against it, the then Secretary of State Eric Pickles gave it the green light in 2012, declaring it to be ‘an infrastructure project of national importance’.\nIn short, we don’t care what you little people think, we are the government, we know best and you’re having it whether you like it or not.\nThat project, when it commences operation in 2026, will mean an additional 276 HGV journeys a day along King Street; 30% more than the solar plant was projecting.\nWhich brings me back to the solar plant. I’m sorry to say that I fear that despite all the objections, this too will go ahead.\nLabour has made clear their ambition to ‘double onshore, treble solar and quadruple offshore power’. Whilst they haven’t stated whether this will be by increasing the number, the capacity of each, or the output, Ed Miliband is approaching the task with an almost maniacal zeal at the moment.\nIt won’t be long before the reality of these plans starts to bite. There’s no way with current planning rules in place that they can achieve these targets, so they have decided to sweep away huge chunks of legislation that are ‘slowing down planning’. What this means, is that residents will have little or no say in where these infrastructure projects are built.\nWhen the government realises that they are behind with their plans (which won’t take long – they only get five years in office and the clock is ticking…), they will probably look to revisit recent planning applications to see which, with fewer rules in place, might have been given the go ahead. At which point the spotlight will be back on Northwich.\nSo, whilst campaigners may be celebrating this as a local victory right now, don’t be at all surprised if this decision gets overruled in the near future. And whilst our local M.P. has been very quiet on this project at the moment, once we are told we are having it, be prepared to be told that it’s part of an ambitious plan to lower our energy bills and generate clean green energy and a success for Labour.\nNever mind your objections, you’re having it whether you like it or not.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_sitemap_index_xml/content_2.html": "https://www.emmaguyreform.co.uk/post-sitemap.xml\n2024-12-31T11:11:06+00:00\nhttps://www.emmaguyreform.co.uk/page-sitemap.xml\n2025-03-26T10:05:14+00:00\nhttps://www.emmaguyreform.co.uk/category-sitemap.xml\n2024-12-31T11:11:06+00:00\nhttps://www.emmaguyreform.co.uk/post_tag-sitemap.xml\n2024-12-31T11:11:06+00:00\nhttps://www.emmaguyreform.co.uk/author-sitemap.xml\n2022-12-31T16:09:32+00:00",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_category_news_page_3/content_36.html": "by Emma Guy | Dec 23, 2023 | News\nDear Supporter, Recently I was selected to be your Prospective Parliamentary Candidate (PPC) at the next election for the seat of Mid Cheshire. On the day this was announced, I asked a fellow member to take a photo of me next to the Christmas Tree so I could send a...\nby Emma Guy | Nov 26, 2023 | News\nDear Supporter, This week has been a pivotal week in politics, both for me personally, and for this country. Nationally, we saw the official release of immigration numbers which, whilst not surprising to most of us, were an awful indictment of this current...\nby Emma Guy | Nov 11, 2023 | News\nDear Supporters, Firstly, Thank you to everyone who came to the Mid-Cheshire Meeting on Monday evening at the Penny Black in Northwich. It was great to be able to chat and gain knowledge from you all. There were some great ideas too, on how to get more...\nby Emma Guy | Oct 22, 2023 | News\nDear Supporters, I hope you are enjoying the autumn sunshine today in Cheshire. It was very interesting to read what the Sunday papers are saying about Reform UK. It seems that we have achieved some significant gains and excellent groundwork with the...\nby Emma Guy | Oct 9, 2023 | News\nDear Supporters, What a week it has been. Last Monday at the Penny Black pub in Northwich, along with other local Reform Spokespeople, we launched our local campaigns. Thank you to all our supporters who came. To those who have left their name and numbers...\nby Emma Guy | Sep 18, 2023 | News\nDear supporter, I am writing to introduce myself as your local Prospective Parliamentary Candidate (PPC) for ReformUK. Some of you may have already seen or met me, but for those of you who do not know me, let me briefly introduce myself. My name is Emma Guy, I’m...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_policies/content_23.html": "Reform party policies\nLeaving the undemocratic EU was just the beginning. People’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas:\n1. Reform our Economy:\nTo succeed faster growth is vital. Higher growth rates are the only way to better wages and more tax revenues that can be invested in better healthcare and other public services. Our bold economic vision frees up over 6 million people from paying Income Tax and frees up over 1.2 million small businesses and self-employed from paying Corporation Tax. We would also aim to remove a raft of other stifling taxes in a responsible, timely way. This will generate much faster growth than seen in recent decades. We must also stop wasting taxpayers money.\n2. Reform our Public Sector:\nWe must be ambitious, seeking faster, more efficient public services that work better for us all. For example, with health, we should demand zero waiting lists and we have a bold plan to achieve this vision. Our police need to focus on preventing crime and catching criminals. Our schools must educate our children properly to prepare them for a competitive, challenging world. Our Border Force must protect our borders.\n3. Reform our Energy Strategy:\nWe all care about the environment and want cleaner air, and we can do this in a strategic, affordable way. Yet the Westminster Net Zero plan is making us all net poorer whilst creating more emissions overall as it outsources them overseas. It is therefore net stupid. It is adding huge extra costs to us all as consumers and to our businesses. This will send hundreds of thousands of British jobs to China and elsewhere. Our energy plan will use our own energy treasure under our feet, and create thousands of British jobs, by making our industries competitive again. It will save consumers considerable amounts of money on their bills every year. We would also nationalise 50% of key utility companies to stop consumers being ripped off with the other 50% being owned by British pension funds for British pensioners.\n4. Reform our Institutions:\nMajor change is needed to the bodies that impact our lives — the unelected cronyism of the House of Lords, the unaccountable civil service and the bloated BBC. Reform is essential to our voting system so it is fairer and more representative; the two-party system embeds the status quo and prevents real change.\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nEmma believes that change is needed and that now is the time for Reform.\nContact Emma\nSay hello and ask Emma your questions here",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_why-2025-will-be-an-annus-horribilis-for-labour/content_30.html": "I should probably start this by saying it must be a horrible feeling. Having been in opposition for fourteen years, to finally win victory with a crushing majority, only to find that the country has been left in an appalling state. From the state of the public finances, to the NHS, to energy, to immigration to defence; so much of what constitutes a stable government is found wanting.\nYou have to make tough decisions to fix things, so people are going to hate you for it. It’s a no win scenario where the most likely outcome is not, as some were predicting before the election, a Labour government for at least the next decade, but that you are cast out by the electorate at the next available opportunity, to wander in the political wilderness for another fourteen years.\nAs I say, it’s easy to feel sympathy in these circumstances.\nBut to then take office and institute a raft of policies guaranteed to simply make the situation worse; there’s no excuse for that, and what little sympathy I and many other people had, has rapidly evaporated.\nWhich brings me to the title of this piece; why 2025 is going to be an awful year for Labour.\nFinance\nMuch has been written about the Chancellor, and the decisions she has made since taking office. We’ve been told that the budget was a one off, a necessity to ‘fix the public finances’, and having done it, would eliminate the requirement to return at a later date to take more from us in tax. Let’s see shall we?\nDespite annoying pensioners, farmers, ‘hard working people’, homeowners, landlords, retailers, hospitality, small business owners; in fact most of the population, with her extremely unpopular tax rises, the chancellor is still adamant that she’s done nothing wrong and has taken all the right decisions to fix the public finances.\nExcept she hasn’t. She’s simply poured fuel on the fire.\nThe oft repeated “£22 billion black hole” was, we discover from various sources, largely created by the immediate granting of high wage rises to public sector workers within days of taking office. What’s worse is that these rises were unconditional. No requirement to improve productivity, no requirement to increase output or hit targets and nothing to stop them returning to the table and asking for more in the immediate future.\nHaving signalled that the public purse is open, the first problem Labour will have to deal with is that 2025 will see a rise in union demands for more and bigger pay rises for their members.\nMeanwhile, the government is now spending more on national debt interest than the entire defence budget, have enormous liabilities in their public sector pension funds, which are getting worse by the day, and with their National Insurance rises, public sector pay awards and an increase in minimum wage, have triggered an inevitable rise in inflation (more of that in a bit).\nJust this week, the Prime Minister has issued an edict to several Quangos insisting that they prioritise growth. And if you ever needed a clear signal that the government are hopelessly out of their depth, it’s in this one act. Insisting that public service regulators prioritise growth is nothing short of madness.\nDespite history teaching us that command and control economies always fail, we seem to be heading towards ‘5 year tractor production plan’ territory. With six measurable milestones, five missions, three foundations and two plans for change, we have descended into a buzzword bingo card, where everything is measured in soundbites and management speak, with nothing actually being done to fix the original problem.\nNot a soul on the high street could tell you what any of these missions or milestones are and no one really cares. They simply won’t work. Centrally dictating how the economy grows is as likely to work as King Cnut was at stopping the tide.\nThe only way to get out of this mire is to let the private sector flourish, reduce the size of the public sector and create an environment that will encourage both inward and foreign investment in U.K. PLC. Then, allowing more people to retain more of their money will allow them to make market based decisions on how to spend it, driving consumer confidence and growth.\nIt’s not rocket science, but it’s the opposite of the path Labour have chosen, so expect 2025 to be a rocky road for finance, and expect the chancellor to find more ways to take more tax from each and every one of us.\nInflation\nIf there’s one certainty for 2025, it’s that inflation will rise; it’s inevitable. From the moment Labour entered power they immediately sparked a wave of inflation by granting pay awards to junior doctors and train drivers. On its own it wasn’t enough to drive inflation up significantly, but increasing the minimum wage and increases to employers’ National Insurance have all but guaranteed it will rise.\nWage inflation is one thing, but what it typically triggers is price inflation as well. Businesses exist only through making a profit, and to do that they need to sell their products and services for more than it costs them to make or supply them. Increasing the cost of labour shrinks the profit margins, so this can only be redressed by increasing prices.\nSome might argue that there is another way, that they could make greater efficiencies to retain more profit. It sounds great on paper, but try doing it in practice. Most healthy businesses are pretty lean as it stands; there’s very little to cut or improve to help with profit margins. Certainly nothing to get back the NI hike.\nAnd of course if you’re going to argue for greater efficiencies in the private sector, you can equally make the case that the public sector should be doing this. But no, we’re now at the point where there are more public sector workers than at any point in history, and that number seems unlikely to shrink anytime soon. Apparently, public sector efficiencies are not sufficiently important to become a mission, milestone or target.\nAlso fuelling inflation is the cost of energy, which is eye wateringly high in the U.K. We have the highest electricity prices in the world currently and they will also rise again in the future. There’s no way that our bills will be £300 lower as promised in the Labour manifesto. A simple look at the cost of the feed in tariffs and contracts for difference in the renewables market, which is currently being turbocharged by Ed Miliband, and you will see that we are locking in inevitable price rises.\nAn increase in energy prices will drive an increase in raw material costs, whilst tax rises and a general disincentive for the private sector to grow for fear of getting taxed means that inflation will be nowhere near the 2% Bank of England target for most of 2025. Which means interest rates will remain high and government receipts will be lower than expected. There will be little or no fiscal headroom due to the policies they are currently enacting.\nNo matter how much the Prime Minister commands it, this problem simply isn’t going away.\nEnergy\nOne of the policies guaranteed to upset most people, most of the time, is the current obsession with Net Zero.\nQuite apart from the fact that most people in the street can’t tell you what it is, or how you measure it, when you examine what is being proposed for our country in the name of Net Zero it becomes apparent that we are simply careering towards disaster.\nFar from freeing us from international gas markets, a claim reliably repeated by Ed Miliband whenever anyone questions his mission, it will ensure we are enslaved to it. Shutting off our own production of oil and gas from the North Sea, slowly closing our nuclear reactors and not replacing them, and covering the countryside with miles of solar panels and windmills will guarantee we have an unreliable and expensive energy supply.\nForget for a moment that we will need to build ‘spinning reserve’ for all the panels and windmills; quite simply gas turbines ready to jump into action when our renewables can’t produce enough energy. The fact that we already know we cannot produce enough energy means, if we’re not producing gas ourselves from the North Sea, we will be importing it to keep the lights on. Which means we will be paying whatever prices are dictated on the international markets. Far from freeing us from their variability, we are wedding ourselves to it.\nMeanwhile, in the name of driving ‘clean, green energy’ Ed and the rest of the crew are busy forcing planning decisions through to carpet agricultural land with solar panels and erect a forest of pylons across the country, particularly down the eastern part of Britain which is about to be blighted by these eyesores.\nWhilst renewables do have a part to play in supplying our energy needs, they are simply not reliable enough to form the backbone of Britain’s energy strategy. With no viable way of storing it (batteries can’t store more than a few hours of the country’s needs) we are at the whim of the elements.\nThe battles that have already begun will become more obvious and mainstream in 2025 and there will be an almighty clash between the government and the people over this. As more people wake up to the fact that what is being proposed is simply not feasible, no amount of reassurances and soundbites will convince them to destroy their local communities in the name of progress.\nForeign Policy\nThe world is a tricky place to navigate these days. What passed for foreign policy in the 1950’s simply won’t work today. With an ever connected world, news from across the globe can be in our hands within seconds. Events far from Britain end up causing enormous issues domestically.\nFrom the Black Lives Matter protests during lockdown, to the more recent troubles in Gaza, these events far from our shores lead directly to issues at home.\nThe Labour government haven’t had a terribly good start in this area either, despite the Prime Minster globe trotting in the first six months, they have made errors which will cost us dear in 2025.\nFrom being particularly rude to a man who will shortly be the 47th President of the United States of America, to trying to give away the Chagos Islands without a thought for the people who should rightfully live there, the Chagossians, our foreign policy looks amateur.\nInsisting that we should put “climate and nature at the heart of our foreign policy” displays a deep naivety and a lack of understanding of what is required in the real world. Climate and nature mean nothing to the Ukrainians defending their borders, nor to the Indians driving their economy forward, nor the Chinese, for whom coal fired power stations are a necessity.\nWith European growth stagnating, and Labour insisting we should build a closer ‘special’ relationship with the EU, our eye is firmly off the ball at the moment and I expect events overseas in 2025 will prove the mettle of the current government one way or the other.\nImmigration\nThis is the simmering problem that vexes more Britons than just about anything else. The visible part is characterised by waves of small boats illegally crossing the channel, only to be picked up by our lifeboats and navy, ferried to Britain, where they are housed at taxpayer expense for as long as it takes to process their applications for asylum.\nNever mind that we have a system already that requires people to go though the proper channels. Never mind that it is illegal to simply cross in a small boat and simply expect to walk onshore. And let’s not forget that Labour promised to ‘smash the gangs’. What we have seen so far is the removal of any deterrent to people trying to cross illegally and an increase in the number of boats and people crossing. So much for smashing this vile trade.\nWhat people miss, however, is the invisible immigration; the hundreds of thousands of people who arrive legally every year and are simply waved through to become part of our country. Figures are released, then quietly revised after the event showing that just short of a million people a year are arriving on our shores, with just 4% of that figure being in small boats.\nIt is true that Labour have continued the conservative policies that restricted legal migration, so we can expect the figures to come down a bit next year, plus they have also managed to send some refused asylum seekers home. But with so many arriving from areas considered unsafe to return them to such as Iran, Afghanistan and Syria, the problem isn’t going away.\nThe reality is that immigration is an issue. It’s an issue of resources, cost and integration. 2025 will probably see a slight drop in numbers, but Labour’s problems may well come from the ongoing cost to the taxpayer from their inability to stem the tide of humanity washing onto our shores.\nHousebuilding\nOne of the great pledges of the Labour 2024 manifesto was that they would “…deliver the biggest increase in social and affordable housebuilding in a generation”. To this end they have announced that they will be delivering 1,500,000 new homes during the life of this parliament, which equates to 25,000 homes every month, or over 800 a day.\nHow many of these will be ‘affordable’ and how many social housing is still unspecified, but we’ve been told that they will definitely deliver these homes. Which is where the problems will start in 2025.\nIf you speak to anyone in the housebuilding sector, they will tell you quite simply that this number is totally unachievable.\nNot only are we having problems getting the raw materials needed to build a house, there simply aren’t enough skilled tradespeople to build them. It does’t matter how ambitious you are, nor how big your wild pronouncements are, without the resources and infrastructure, the entire project is dead in the water.\nAnd even if they did, by some miracle, achieve this number, as Trevor Philips pointed out to Angela Rayner in a recent interview, most of them will be filled with the migrants that arrive during the time they take to build them.\nIf these new homes are not social housing but instead for the public to purchase, how are they going to ensure they are affordable? Most young people can’t afford to buy these days, particularly in London and the South East, and affordability has gone from four times annual earnings in 2000 to almost nine times annual earnings in 2024.\nWe all understand the problems with underperformance in the housebuilding sector, but Labour’s plans simply won’t work. By the time 2025 draws to a close and the numbers delivered are shown to be so far behind as to be unachievable within the life of this parliament, expect a downward revision of this figure and a finger pointing blame game to ensue.\nConclusion\nThere’s so much more that I could write highlighting the areas in which Labour will come unstuck in 2025. I’ve not even touched on the NHS which is beyond reforming, nor on the cost of debt on the international markets. I’ve completely missed education and free speech, the introduction of a new regulator in football (which will end disastrously), the quangos Labour have created since coming to office, nor the sheer number of people employed in the public sector.\nI’ve also dodged past the fact that judges now appear to make law in this country, not parliament, and the inevitable protests from Farmers which will lead to food shortages on shelves.\nThere’s also the small matter of the upcoming local elections in 2025 where they will be trounced by opposition parties like Reform, and the inevitable by-election that will happen next year where they will lose their majority and lead people to question everything they are doing.\n2025 will lay bare the structural failures of the British Government, from national debt to unaffordable public sector pay schemes, along with the smaller things that are simply ridiculous like trying to mandate which cars people can buy and which boilers people can have.\nAnd if all of this was simply the result of the dreadful mistakes made by the conservatives whilst in office, as I said as the start, there might be an element of forgiveness from the public and a willingness to give them time to sort out the mess. But entering office and immediately making things worse means that 2025 will, without doubt, be an ‘annus horribilis’ for the Labour government.",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_blog_category_policies/content_9.html": "by Emma Guy | Jul 3, 2024 | Policies\nOne of the easiest ‘dog whistle’ slurs that has been levelled against Reform U.K. during this election campaign is that the party is institutionally racist. Those making the claims don’t appear to need any proof. Apparently, it is enough these days to say someone is...\nby Emma Guy | Mar 15, 2024 | Policies\nRecently, when I attended the Spring Party conference, I was introduced to Simon Marcus, our Head of Policy. We had just seen for the first time, the draft copy of our ‘Contract with YOU’ and I was hugely encouraged by the scope and scale of the document. After all,...",
  "https_www_emmaguyreform_co_uk_/https_www_emmaguyreform_co_uk_meet-emma/content_3.html": "Hello, I’m Emma\nEmma Guy is passionate about politics and believes that the current mess the country is in cannot be solved by either of the two main parties who have presided over the decline of the last 25 years. She believes that as none of the existing parties are capable of making the necessary changes, now is the time for Reform.\nAbout Emma Guy\nEmma has lived and worked in Northwich for almost 35 years, during which time she has served on Lostock Gralam Parish Council, started, and grew her own wellbeing clinic, Acupuncture That Works and represented local interests since 2001 by campaigning with CHAIN against the building of the Incinerator on Griffiths Lane.\nEmma is the Chief Commercial Officer for Runcorn based business Aqueous Digital and in November 2022 she won Outstanding Entrepreneur of the Year at the Crème de la Crème Cheshire Business Awards, for her ongoing work with the business, she has also won the Community ReAwards 2023 – Impact award for her charity work and Butterfly Breast Cancer Awards – Transformed life award 2023.\nOn top of these roles, she was elected Greenbank Councillor in March 2025 for Northwich Town Council and is an ambassador for Prevent Breast Cancer.\nIn 2016 she was diagnosed with breast cancer and underwent a mastectomy and reconstruction which triggered early onset menopause, an episode she covered in her bestselling 2021 book, Wisdoms of the Menopausal Godmother.\nEmma has been happily married to Jonathan for 18 years and they have three children.\nan outline of\nReform UK policies\nReform Party\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again!\nPolicies\nPeople’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key areas...\nMeet Emma\nContact Emma\nSay hello and ask Emma your questions here"
}