{
  "https_sophiastalbans_co_uk/https_sophiastalbans_co_uk/content_1.html": "I am not a career politician. I have built my skills and knowledge working across the public and private sectors. I am standing to be your MP as our country faces some of the biggest challenges in a generation. We need a government with a mission and a Parliament of competence and experience to rebuild Britain.\nI grew up in Stoke on Trent, an ex industrial city which once exported British made china all over the world. I saw up close the devastation left behind when entire industries leave, and when no coherent economic plan for recovery is put in place. It was in those early formative years that my values of equality, progress, and hard work were formed.\nAfter studying law and then a Masters in International Studies, I spent a short while working with the UN – solidyfing my view on the importance of international cooperation and custodianship for future generations.\nI have since held senior roles in immigration and asylum, consumer and competition affairs at the OFT and CMA, medical regulation at the GMC, financial services both in retail banking and as a regulator at the FCA, legal services and human rights both at the policy level as the Director of policy for the Law Society of England and Wales, and as the Global Head of Purpose and Impact at an international law firm.\nIn addition to my executive work I volunteer as a non executive director and advisor to a number of human rights charities, environmental movements and local organisations, including as a school governor.\nThis breadth of experience matters. The new Government on the 5th July 2024 is going to inherit the most challenging set of public policy issues since the war. Our country needs members of parliament who have experience and know how to get things done. I will use my 25 years of experience to solve the issues that matter most to the residents of St Albans, and which we need to tackle Britain’s priorities.\nAfter 14 years of Tory rule the country is in a worse state than when the Tories and Lib Dems came to office in 2010.\n“Nothing works” is what people tell me wherever I go. The state we find ourselves in is not an accident. It is a direct result of the incompetence and Tory party internal drama – the price for which the rest of us are paying.\nThe 2010 coalition marked a stark change in economic policy. In coalition with their Tory partners, the Lib Dems presided over sweeping cuts and broken promises. Those decisions are the causes of the pain felt by you today.\nIn local government the Lib Dems have not delivered either. Fly tipping, roads in disrepair, and plans to build on the green belt.\nBritain deserves a government, and St Albans deserves an MP, who will value the role our public services play in society and not make promises on the doorstep only to break those very promises once the keys to No 10 have been handed over.\nOnly Labour has the ability to unseat the Tories and to start the process of rebuilding Britain.\nBy voting Labour you have the opportunity of having a Labour MP at the heart of a Labour government representing your interests, whether that be on the environment, housing, health, or the UK’s role internationally.\nAs your Labour MP, working with a Labour government, I would be able to take your concerns directly to my fellow labour colleagues in government. A powerful combination for the needs of St Albans and the country.\nThe last time St Albans was represented by a Labour MP working in a Labour government, GDP grew by 20% per head, child poverty was reduced, NHS waiting lists were at an all time law, and schools were well funded. By voting Labour on 4th July you have the ability to put Britain, and St Albans, on the path to a brighter future where such outcomes will once again be possible. But this is only possible if we gain a strong and bold majority in Parliament, and you can play your part in making that a reality.\n“Britain needs a mission-driven government to end short term sticking-plaster politics. These five bold missions will form the backbone of Labour’s election manifesto and will drive forward a Labour government.”\nKeir Starmer MP\nLeader of the Labour Party\nIf you would like to support Labour’s campaign click on this link. We thank you in advance for being part of the fight back for Britain’s future.",
  "https_sophiastalbans_co_uk/https_sophiastalbans_co_uk_privacy-policy/content_2.html": "Our contact details\nName: Sophia Adams Bhatti\nAddress: 28 Alma Road, St Albans, Herts, AL1\nE-mail: hello@sophiastalbans.co.uk\nThe type of personal information we collect\nWe currently collect and process the following types of information from those who fill out our supporter form:\n- Name\n- Contact number\n- Postcode\nHow we get the personal information and why we have it\nThe personal information we process is provided to us directly by you for one of the following reasons:\n- Register you as a supporter of Sophia Adams Bhatti’s campaign;\n- Inform and engage you about the campaign;\n- Inform and engage you with any other campaigns and movements that share the values, principles and aims of Iain’s campaign (including, but not limited, to other Labour Party elections);\n- Answer your queries and respond to your questions and/or complaints.\nHow we store your personal information\nYour information is securely stored.\nWe keep the information you provide for as long as reasonably necessary to fulfil the purposes we collected it for. We will then dispose your information by securely deleting it.\nYour data protection rights\nUnder data protection law, you have rights including:\n- Your right of access – You have the right to ask us for copies of your personal information.\n- Your right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\n- Your right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\n- Your right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\n- Your right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\n- Your right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us at hello@sophiastalbans.co.uk if you wish to make a request.\nHow to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at hello@sophiastalbans.co.uk\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk"
}