{
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_02_10_newly-elected-co-chairs-for-south-east-greens/content_31.html": "Congratulations to Winchester Green Party Campaigner Malcolm Wallace and Anna Younger on being elected co-Chair of the South Eastern Green Party.\nBelow is their remit and we have every confidence that both will represent us in an efficient and poisitive way.\n1. The Chair of the Confederation shall chair SE Meetings or arrange for such chairing to be covered;\n2. The Chair shall work in cooperation with all other Officers to ensure actions required by Confederation Meetings are carried out;\n3. The Chair, in cooperation with other Officers as appropriate, shall ensure that adequate communication about Confederation matters is available to Green Party members in the South East Region;\n4. In the event of a dispute within the Confederation, the Chair shall initiate actions, or sub-Committees of SE Officers, to draw such a dispute to close as quickly as reasonably possible;\n5. The Chair should be the primary point of contact between Green Party members representing the South East Region at European or Regional levels and the Confederation, with delegation as appropriate to other SE Officers whenever issues impinge upon their area of responsibility.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_12_09_nature-action-now-the-battle-of-our-lives/content_42.html": "A message from Caroline Lucas..\nBack in May, in my last few months as MP, I secured a parliamentary debate on nature and biodiversity loss.\nIt was the dying days of Sunak’s government, and amidst the chaos and election fever, I wanted to focus attention on the upcoming nature summit in Colombia.\nBecause nature is in freefall. In the course of my lifetime, the abundance of species across the UK has fallen on average by almost one fifth, Without urgent action here and internationally, our land, skies and seas will be even emptier and even quieter.\nWe now have a new Labour Government which is better on nature and climate than the Tories, but that’s a stunningly low bar to clear, and nowhere near good enough. While internationally, both the nature and climate summits have failed to deliver the change we need, and Trump has been elected to the White House.\nSo, what can we do to make progress when nature is in crisis and our political leaders aren’t even doing enough to deliver on pledges they have already signed up to, to protect and restore nature?\nGetting behind the work of our four MPs to prioritise nature action in this parliament is crucial. I am hugely proud that Carla, Adrian, Ellie and Sian have made such a formidable start in Westminster. They are brilliant politicians and campaigners and will work tirelessly to push Labour to do better – much better.\nBut they need your help. Ultimately, it’s not winning elections that counts. It is the difference our Green MPs will make to bringing about a huge prize – real hope and real change on the nature crisis.\nWe are living out of kilter with the natural world, destroying nature, and putting our own very survival at risk – a situation which must be turned around.\nThis is the battle of our lives and it’s worth fighting for.\nPlease get behind our four MPs and donate what you can to our Nature Action Now campaign.\nError: Contact form not found.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2025_01_27_january-updates-from-our-greens-in-parliament/content_73.html": "Carla Denyer MP\nCarla‘s amendment to the Renters Rights Bill on requiring landlords to make reasonable changes to make homes accessible for disabled people, prompted the Minister to agree to a cross-party meeting to discuss how the Government makes sure the law is strong enough.\nShe spoke during a debate on the so called ‘Sunshine Bill’ to make solar panels compulsory on all suitable new homes (see here to read what she said).\nShe also spoke about family visa income requirements, saying: “We are talking about a tax on love: an ugly policy that fundamentally discriminates against migrants’ families and implies that love, and family reunification, is a privilege that people must earn enough to afford.”\nEllie Chowns MP\nEllie, as our lead MP on foreign affairs, responded to the ceasefire in Gaza, urging that the UK keeps pushing on legal recognition of the State of Palestine, ending the occupation and for accountability of all who have committed war crimes. You can read the Foreign Secretary’s response here.\nEllie also asked the Government about their failure to meet key environmental targets, and spoke in a debate about the importance of better palliative care.\nSian Berry MP\nSiân tabled a cross-party motion in Parliament calling on the Government to follow in the footsteps of over 100 local authorities and ban the use of pesticides in public places. This follows on from Sian’s Bill seeking to do the same thing and is part of a campaign with Pesticide Action Network.\nShe’s also been speaking out against the expansion of Heathrow, urging Ministers to follow the science and advice from their independent climate advisers: the Climate Change Committee.\nAdrian Ramsay MP\nAdrian has been standing up for his constituents on a wide range of topics this month, including setting out for the Minister the impact that the loss of dentists has on rural areas, highlighting how villages in Waveney Valley are struggling with poor broadband speeds, and speaking during a debate about flood preparedness. His contribution to the latter focused on nature based solutions in particular and can be read in full here.\nBaroness Jenny Jones\nJenny recently had hip replacement surgery, which has slowed her down this month, but she still found the energy to question the government’s failure to release IPP prisoners.\nWe have huge levels of prison over-crowding; delayed justice for victims whose cases have been put on hold and the early release of many convicted of serious offences. Despite this, the government is refusing to fast track the cases of IPP prisoners who have been locked up indefinitely for minor offences, such as stealing a plant pot, or a mobile phone. This scandal has led to many suicides and Jenny has met the Minister to try to help get it resolved.\nBaroness Natalie Bennet\nNatalie has spent a lot of the past month hosting events in parliament, which gives scientists, NGOs and campaigners the crucial access to MPs, Peers, officials, and journalists. In the past month Natalie has hosted:\n- The Green Economics Institute, celebrating 20 years of work to create a global network of intelligent and caring voices for social, environmental and economics justice and creating a multidisciplinary academic narrative of green economics! Speakers included Miriam Kennet, Anjikwi Mshelbwalla, Bianca Madison-Vuleta, and Gwendoline Delbos-Corfield.\n- A roundtable on Accelerating Human-Specific Technologies on behalf of Animal Free Research UK brought together leading experts in human-specific technologies and was attended by several MPs. The event included a call for Herbie’s Law to enable the phase out of animal testing in medical research.\n- A meeting of experts on Bovine TB Policy acknowledging that the science behind the badger cull is deeply and fatally flawed and has been a very costly distraction to the primary control effort needed – biosecurity to control this cattle disease.\nNatalie has also secured a debate in the Lords about Anaesthesia Associates and Physician Associates.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_11_13_winchester-greens-climate-justice/content_90.html": "We set up our ‘Climate Justice’ & ‘Seven Demands for the UK Government’ Stand at the Buttercross on a very busy Winchester shopping day and were pleased to receive so much attention plus response from passers by.\nBeside giving out a substantial number of leaflets and speaking to people, we also set up a board for sticky notes to be posted, these are the comments made..\n‘ I agree solar, wind, tall buildings, Government Buildings’.\n‘Time to sort it – for our Grandchildren’s sake’.\n‘Need more renewables now’.\n‘Every single person needs to do their bit !’\n‘Get it fixed fast. Our children depend on it !!!’\n‘My Mum can’t believe I’m living in a developed country.\nNO !’\n‘This is action which cannot be ignored – only greed is the answer for our inactivity.’\n‘Global Justice – Climate Reparation.’\n‘Not doing what they’re paid for.’\n‘No! – I’m worried about our Grandchildren’s future.’\n‘No! – Save the World for wildlife if nothing else.’\n‘No good just asking for money – Action needed now’.’",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_petitions/content_67.html": "The Restore Nature Now march, London 28 June 2024 / 7 February 2025 by richardcannon nature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […] Read more » Countryside Farming and Agriculture Petitions Videos\nMandate Water Companies to Cease Polluting Rivers and Seas with Sewage – Petition 7 February 2024 / 10 August 2024 by richardcannon why this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […] Read more » Petitions\nObjection to Bushfield Development Application 6 December 2023 / 10 August 2024 by richardcannon a copy of our full letter explaining the reasons for our objection Bushfield army camp, once an emergency measure in WW2 that returned to the Church Commissioners about 40 years later, has since been rewilding itself for nearly 45 years. There have been multiple attempts for developing this site until the newest proposal. The application […] Read more » Petitions\nPending Railway Ticket Office closures 4 August 2023 / 10 August 2024 by richardcannon The Railway Delivery Group have recently announced they are proposing a huge closure of ticket offices around the country. To see more, go to https://www.raildeliverygroup.com/uk-rail-industry/customer-focused-reform/customer-focused-stations Below is our response to this. By following the above link, you are able to ‘have your say’ as individuals. Public consultation has been extended to 1st.September 2023. our response.. […] Read more » Petitions\nThe M3 Jn9 debate – Having a say 12 March 2023 / 10 August 2024 by richardcannon Following a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we […] Read more » Petitions\nOur Climate Justice Stand in Winchester 12th. November a great success 13 November 2022 / 10 August 2024 by richardcannon We set up our ‘Climate Justice’ & ‘Seven Demands for the UK Government’ Stand at the Buttercross on a very busy Winchester shopping day and were pleased to receive so much attention plus response from passers by. Beside giving out a substantial number of leaflets and speaking to people, we also set up a board […] Read more » Petitions",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk/content_1.html": "working hard for the city and surrounding areas\nThe Green Party is the only major political Party in the UK that is committed fully to a life based on democracy and justice within the planet’s limits.\nThe Green Party has always dared to be different – and we’ve always known the power of good ideas.\nUnlike others, we know that our planet has environmental limits, we understand that not everyone wants to live to work, that inequality is not just unfair, but damaging to everyone in society. We have the bold solutions which allow us to offer inspiration in this age of uncertainty.\nWe are proud to boast four Green Party District Councillors representing the District (Cllr. Malcolm Wallace also represents for the Hampshire County Council). With our strong membership and support we are confident in gaining more Council seats taking our green message more into the heart of the city and surrounding areas. If you would like to support us, please go to our ‘Get Involved’ and / or our ‘Donate’ page. Your help is much appreciated.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_08_10_visiting-soberton-down-rewilding/content_30.html": "After an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down.\nThe beautiful hillside which features grasses and meadowland commands a wonderful view down to Soberton Village and the hills beyond. We were most thankful to Roy, Carol, Hugh and Nigel, all volunteers from the ‘Sobernewts’ (Soberton and Newtown) Team who gave us a guided tour, informing us of the plant species and the wildlife it encourages.\nAfterwards we wandered down to the White Lion in Soberton for some welcoming and well deserved hospitality.\nAll in all, the past two outside activities have shown us the wonderful work being done by volunteers to maintain and improve our countryside and towns.\nWhether a Green Party Member, supporter or otherwise please look out for any further outside pursuits and join us, you’d be most welcome.\nLINKS..Sobernewts on the Soberton Parish Council website\nSobernewts on facebook",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_events/content_56.html": "30 March 2025 / 31 March 2025 by richardcannon\nit’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […]\nRead more »\n1 March 2025 / 18 March 2025 by richardcannon\nOn the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […]\n2 February 2025 / 7 February 2025 by richardcannon\nDelivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […]\n2 December 2024 / 2 December 2024 by richardcannon\n26 November 2024 / 2 December 2024 by richardcannon\nLast week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections.\n3 October 2024 / 4 October 2024 by richardcannon\nInitiated by Kate Needham and organised by Rich Turner and Jo Harmer, we held a live music and dance folk evening featuring local artists at the Hyde Tavern in Winchester. Jo Harmer writes.. It was a great night, so much skill and talent in the Hyde Tavern’s quirky and wonderful Cellar Bar. Each of the […]\n28 June 2024 / 7 February 2025 by richardcannon\nnature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […]\n22 October 2023 / 10 August 2024 by richardcannon\nStan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […]\n4 August 2023 / 10 August 2024 by richardcannon\nRushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative […]\n7 July 2023 / 10 August 2024 by richardcannon\ngreen coffee morning On Saturday 1st.July., Richard and Kate Needham’s garden was opened up for Members and Supporters to come along and enjoy chit chat, coffee and cakes. Donations, which amounted to just over £60, will go towards forthcoming election campaigns. walk and talk at winnall Replacing our normal monthly meeting, on Wednesday 5th.July., we […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_soberton/content_10.html": "A walk around St.Clair’s Nature Reserve Soberton 18 July 2024 / 10 August 2024 by richardcannon Last week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton. The weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash […] Read more » Countryside Soberton\nClimate action for Newtown and Soberton joins the Winchester Climate Action Network 1 December 2023 / 10 August 2024 by richardcannon At a follow-up meeting to the recent Climate Café event, a group of Soberton and Newtown residents formed a new group. Climate Action for Newtown and Soberton (C.A.N.S), was born, with the main aim of reducing the carbon footprint of the parish. Looking at all the ideas suggested at the Climate Café, it was decided […] Read more » Newtown Soberton\nSoberton Newtown Climate Cafe a great success 22 October 2023 / 10 August 2024 by richardcannon Stan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […] Read more » Danny Lee Newtown Soberton Suzanne White\nVisiting the Soberton Down wilding Project 10 August 2022 / 10 August 2024 by richardcannon After an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […] Read more » Countryside Soberton",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_10_08_meon-valley-autumn-newsletter-2024/content_28.html": "Skip to content\nSkip to footer\nWinchester\nMenu\nNews\nAbout us\nAbout us\nHere to help\nGreen Thought Archives\nReducing waste and recycling\nOur Allotment Group\nPeople\nGet Involved\nNewsletters\nContact\nEvents\nJoin\nDonate\nJoin\nDonate\nMenu\nMeon Valley Autumn Newsletter 2024\nHome\nNews\nPollution\nRecycling\nRivers\nMeon Valley Autumn Newsletter 2024\n8 October 2024\n/\n8 October 2024\nby\nrichardcannon\nCLICK IMAGE TO READ IN FULL..\nTo top",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_7/content_84.html": "Green Party show huge gains in popularity all around Hampshire 9 May 2023 / 10 August 2024 by richardcannon 18 months ago Hampshire had no District Councillors elected. Fast forward to May 2023, we now have ten ! In addition, the Isle of Wight has 2. Here are the details..Basingstoke and Deane, 1 – Michael Howard-SorrellEast Hampshire, 2 – James Hogan & Ian JamesHavant, 1 – Grainne RasonNew Forest, 3 – Neil Millington, Adam […] Read more »\nLocal Election results 2023 7 May 2023 / 10 August 2024 by richardcannon Alresford and Itchen Valley Russell Gordon-Smith (Lib Dem) 2,034 Harry Johnson-Hill (Con) 1,187 Richard Needham (Green) 164 Tessa Valentine (Labour) 74 Majority: 847 Turnout: 40% Bishop’s Waltham Jonathan Williams (Lib Dem) 1,618 Donald Iro (Con) 1,022 Richard Cannon (Green) 232 Steve Haines (Labour) 113 Majority: 596 Turnout: 45% Denmead Paula Langford-Smith (Con) 1,035 Michael Bennett […] Read more »\nPhotos from the Count – Election ’23 6 May 2023 / 10 August 2024 by richardcannon Click photos to view full sizes Time out in the Cafe Richard, Danny, Malcolm, Giles & Max Giles Gooding Richard Needham Andrew Pogson Julia Priesemann Celebrating the Central Meon Valley win Richard Cannon Malcolm, Giles and Max Our two Winchester Councillors ! Friedrich & Julia Priesemann Read more »\nAround and about pre-election ’23 25 April 2023 / 10 August 2024 by richardcannon With more than double the volunteers compared to last year, we’ve been busy distributing leaflets, letters and meeting people listening to any issues they may have and outline our ambitions for the future Add to that we’ve nearly trebled the requests for ‘Vote Green’ boards’ throughout the Meon Valley and some in the city itself. […] Read more »\nOur 16 Candidates for the local elections on Thursday 4th.May 8 April 2023 / 10 August 2024 by richardcannon 16 wards – 16 candidates vote green Click candidate photos to view details Richard Needham Alresford and Itchen Valley >> Max Priesemann Alresford and Itchen Valley >> Richard Cannon Bishop’s Waltham Danny Lee Central Meon Valley >> Lucinda Graham Colden Common & Twyford Beata Parry Denmead Lorraine Abraham St. Barnabas Charlotte Harley St. Bartholomew Reece […] Read more » People\nBusiness support for small businesses 24 March 2023 / 4 June 2024 by richardcannon Danny Lee writes.. The Low Carbon Across the South and East programme provides a free business support programme in the South and East. LoCASE offers grants for businesses of up to £20,000 for installation of energy efficiency measures (up to 40% of the cost of your eligible project, with the remainder matched by your business), as well as training workshops and […] Read more »\nThe M3 Jn9 debate – Having a say 12 March 2023 / 10 August 2024 by richardcannon Following a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we […] Read more » Petitions\nThe eco-shopping revolution in the heart of Winchester 10 March 2023 / 10 August 2024 by richardcannon Stan Evans writes On a recent visit to Winchester I was lucky enough to stumble across Earthian – Zero Waste Shop, right in the centre of the city on Parchment Street. With a passion for all things eco I had go inside to check out what this attractive shop has to offer. I was lucky […] Read more » healthy living\nHolding Southern Water to account 6 March 2023 / 10 August 2024 by richardcannon Winchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […] Read more » Countryside Danny Lee Malcolm Wallace\nA Green in the room makes a difference ! 7 February 2023 / 10 August 2024 by richardcannon GREENS IN THE NEWS JANUARY ! Our Green Party Councillor Malcolm Wallace has certainly made his mark since being elected last May. Here’s some links to articles he’s mentioned and quoted in over the last few weeks ! Article: Plans for dog walking paddock divide opinion in Meon Valley Malcolm voiced his opinion on plans […] Read more » Malcolm Wallace",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_max-priesemann/content_59.html": "Hampshire County Council Budget Consultation 2024-2026 4 August 2023 / 10 August 2024 by richardcannon Please find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026. The full consultation documents can be found at the Hampshire County Council website HERE …….. 23rd July 2023 Dear Hampshire County Councillors, HAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION Winchester Green Party’s response to the consultation is […] Read more » Kate Needham Max Priesemann\nThe £2 Bus Fare Cap 10 January 2023 / 10 August 2024 by richardcannon max priesemann writes.. A single bus ticket price cap of £2 is very welcome! Unfortunately only until End of March. End of 2022 a Stagecoach Single ticket from Winchester to places like West Meon, Cheriton, Arlesford or Romsey cost £5.90. A Bluestar Single between Southampton and Winchester cost as much a £7. From 1st of […] Read more » Max Priesemann",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_4/content_71.html": "Cllr.Malcolm Wallace wins County Council By-election for Meon Valley 7 May 2024 / 20 January 2025 by richardcannon The County Council By-Election was only called at the last minute. This in turn meant a huge effort by our Volunteers to ensure the residents were well informed of our abilities by distributing leaflets and canvassing. With so many new homes being built in Whiteley, the task was a challenge, but we succeeded with time […] Read more »\nLast days of campaigning and the count. 5 May 2024 / 16 January 2025 by richardcannon Our hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself. Requests for ‘Vote […] Read more » Malcolm Wallace Meon Valley\nSuzanne White and Malcolm Wallace win elections and Greens make big progress in the City 4 May 2024 / 6 February 2025 by richardcannon Central meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […] Read more » Central Meon Valley Malcolm Wallace Meon Valley Suzanne White Videos\nHampshire County Council Meon Valley By-election 22 April 2024 / 10 August 2024 by richardcannon Our Candidate, Cllr. Malcolm Wallace Malcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time.. […] Read more » Malcolm Wallace Meon Valley\nCouncillor Danny Lee meets Veg Box 20 April 2024 / 10 August 2024 by richardcannon LOCAL ENTERPRISES IN CENTRAL MEON VALLEY Councillor Danny Lee campaigning in Hambledon for Suzanne White as the next Winchester City Green Party Councillor and Malcolm Wallace as the first Green Party County Councillor for Hampshire County. During campaigning he chatted to the fabulous Hampshire Veg Box Director Chris Huskins to hear first hand about the […] Read more » Danny Lee\nAction Day in Whiteley 20 April 2024 / 9 August 2024 by richardcannon A great morning spent in Whiteley distributing leaflets and speaking to residents about the forthcoming two elections on Thursday 2nd.May; Winchester City Council and a Hampshire County Council by-election for Meon Valley. Ably supported by friends from the East Hampshire Green Party and Test Valley Greens, we managed to cover a large area in and […] Read more »\nWinchester City Council Elections 2024 9 April 2024 / 10 August 2024 by richardcannon Your Green Party Candidates Please scroll down the page to see your Ward Dave Westley Alresford & Itchen Valley David joined the Green Party with a view to influencing a better ecological localised approachwhich in plain terms means a thriving environment that allows nature to take its course andbenefit all the community. At the moment […] Read more » People\nMandate Water Companies to Cease Polluting Rivers and Seas with Sewage – Petition 7 February 2024 / 10 August 2024 by richardcannon why this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […] Read more » Petitions\nA lack of Affordable housing – Cllr. Danny Lee speaks out 7 February 2024 / 10 August 2024 by richardcannon Councillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area. A lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban […] Read more » Danny Lee\nCllr. Malcolm Wallace speaks out at City Council Cabinet Meeting on ‘Greenwashing’ 29 January 2024 / 10 August 2024 by richardcannon On Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure In the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact. To watch Cllr.Wallace’s statement, scroll through video […] Read more » Malcolm Wallace",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_suzanne-white/content_46.html": "Winchester Greens on the Web 21 March 2025 / 25 March 2025 by richardcannon ‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […] Read more » Central Meon Valley Danny Lee Malcolm Wallace Meon Valley Suzanne White\nGreen motion commits Council to explore solar for council housing. 5 March 2025 / 5 March 2025 by richardcannon At a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing. Malcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and […] Read more » Malcolm Wallace Suzanne White\nwinchester action on the climate crisis – denmead community centre 1 March 2025 / 18 March 2025 by richardcannon On the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […] Read more » CLIMATE-JUSTICE Denmead Suzanne White\nA busy start to the year for winchester greens 2 February 2025 / 7 February 2025 by richardcannon Delivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […] Read more » Danny Lee Malcolm Wallace Meon Valley People Suzanne White\nGreen Party criticises the Government White Paper on English Devolution for Local Government reorganisation! 18 December 2024 / 16 January 2025 by richardcannon The National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […] Read more » Danny Lee Malcolm Wallace National Suzanne White\nOut and about photos from autumn ’24 2 December 2024 / 2 December 2024 by richardcannon Read more » Danny Lee Malcolm Wallace Meetings Meon Valley People Suzanne White\nMeon Valley, Whiteley & Shedfield Newsletters, Nov ’24 25 November 2024 / 26 November 2024 by richardcannon Click images to view full newsletters Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nMeon Valley Autumn Newsletter 2024 8 October 2024 / 8 October 2024 by richardcannon CLICK IMAGE TO READ IN FULL.. Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nGreen Party Councillors test the water in the River Meon 27 June 2024 / 10 August 2024 by richardcannon Sunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows.. Read more » Danny Lee Droxford Malcolm Wallace Suzanne White\nSuzanne White and Malcolm Wallace win elections and Greens make big progress in the City 4 May 2024 / 6 February 2025 by richardcannon Central meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […] Read more » Central Meon Valley Malcolm Wallace Meon Valley Suzanne White Videos",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_08_14_oil-drilling-at-cheesefoot-farm/content_41.html": "accelerating climate change !\nAvington Oil Field taken from article at https://drillordrop.com/2023/07/13/south-downs-oil-field-to-restart-production/\nJust recently the Prime Minister announced a raft of new oilfield drilling licences in the North Sea, which will fuel further climate destruction and do nothing to help tackle the cost-of-living crisis. The Intergovernmental Panel on Climate Change, the International Energy Agency and the United Nations have all made clear there can be no new fossil fuel projects if there is to be any chance of keeping global temperature rises under 1.5 degrees – a goal that the UK signed up to as part of the Paris Agreement on Climate Change.\nAn extraordinary decision as the world heats up to temperatures not seen in over 100,000 years and with many parts of the world on fire!\nCloser to home, and despite opposition from the South Downs National Park Authority, the Government’s Planning Inspectorate has just given permission for oil pumping to recommence at Avington, northeast of Winchester. The plans show that highly polluting gases associated with the oil pumping, including methane, are simply going to be released into our air.\nOil extraction activity at Avington is wholly inappropriate set against both Winchester City Council and Hampshire County Council’s carbon neutrality ambitions and is inconsistent with the City Council’s Jan 2023 motion to oppose initiatives to expand fossil fuel use and extraction.\nThe only way to effectively and sustainably reduce people’s bills, tackle the climate crisis and create millions of jobs for the future is to invest in insulating people’s homes, invest in a rapid rollout of electric heat pumps, invest in cheap and accessible public transport, and massively ramp up renewable energy.\nThe solutions are already there. The Government is choosing to ignore them and expand oil and gas instead. An expensive and morally reprehensible decision that will make life harder for everyone.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_winchester-city/content_5.html": "we asked local residents for views on the river park leisure centre’s future 30 March 2025 / 31 March 2025 by richardcannon it’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […] Read more » healthy living Leisure Lorraine Estelle Winchester City",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_people/content_57.html": "A busy start to the year for winchester greens 2 February 2025 / 7 February 2025 by richardcannon Delivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […] Read more » Danny Lee Malcolm Wallace Meon Valley People Suzanne White\nOut and about photos from autumn ’24 2 December 2024 / 2 December 2024 by richardcannon Read more » Danny Lee Malcolm Wallace Meetings Meon Valley People Suzanne White\nWinchester City Council Elections 2024 9 April 2024 / 10 August 2024 by richardcannon Your Green Party Candidates Please scroll down the page to see your Ward Dave Westley Alresford & Itchen Valley David joined the Green Party with a view to influencing a better ecological localised approachwhich in plain terms means a thriving environment that allows nature to take its course andbenefit all the community. At the moment […] Read more » People\nOur 16 Candidates for the local elections on Thursday 4th.May 8 April 2023 / 10 August 2024 by richardcannon 16 wards – 16 candidates vote green Click candidate photos to view details Richard Needham Alresford and Itchen Valley >> Max Priesemann Alresford and Itchen Valley >> Richard Cannon Bishop’s Waltham Danny Lee Central Meon Valley >> Lucinda Graham Colden Common & Twyford Beata Parry Denmead Lorraine Abraham St. Barnabas Charlotte Harley St. Bartholomew Reece […] Read more » People\nOut and about January 2023 31 January 2023 / 10 August 2024 by richardcannon A selection of photos ahowing some of our Team's activities during January, plus a video of Cllr. Malcolm Wallace delivering his successful motion to ban future fracking in Winchester Read more » People\nOut and about December ’22 23 December 2022 / 10 August 2024 by richardcannon Rain, wind, snow, warm, cold and whatever else, nothing stops our hard working members getting about to spread the Green message Beata Parry, Danny Lee and Kate Needham busy around the Meon Valley Danny Lee asking Swanmore residents to fill out our short 60 second survey ‘Green Drinks’ at the Black Boys Pub in Winchester […] Read more » People\nGreens in Action – November 2022 29 November 2022 / 10 August 2024 by richardcannon ‘have your say’ Surveys Kate Needham and Doug Stanton in Swanmore and Waltham Chase Kate Needham and Richard Cannon in Soberton Photos from our Stall in Winchester.. Chris Gilham Rob Parker Richard Needham Doug Stanton Max Priesemann (right) Richard and Kate Needham Rupert Pitt Enjoying a get together in the Open House Deli Read more » People",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_climate_page_2/content_66.html": "22 May 2023 / 10 August 2024 by richardcannon\nFollowing a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding. As many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many […]\nRead more »\n12 March 2023 / 10 August 2024 by richardcannon\nFollowing a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we […]\n26 January 2023 / 10 August 2024 by richardcannon\nAt the Winchester City Council meeting earlier this week, Councillors voted to:1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.2) To respond to the County Council’s consultation on the refreshed Minerals andWaste Plan stating our opposition the extraction of oil and gas, including by fracking. Cllr Wallace stated: […]\nFunding available to support local farming communities and our environment. Local Green Party Councillor supports Defra’s Farming in Protected Landscapes programme. Article by Stan Evans Local Meon Valley based Green Party Councillor, Malcolm Wallace stated : ”I’d like to remind our friends in the farming and land management community that Defra’s, Farming in Protected Landscapes […]\n13 November 2022 / 10 August 2024 by richardcannon\nWe set up our ‘Climate Justice’ & ‘Seven Demands for the UK Government’ Stand at the Buttercross on a very busy Winchester shopping day and were pleased to receive so much attention plus response from passers by. Beside giving out a substantial number of leaflets and speaking to people, we also set up a board […]\n11 August 2022 / 10 August 2024 by richardcannon\nA published letter to the Hampshire Chronicle A Firm grip on climate emergency Last week, on the same day that the temperature in the UK hit a record high, the High Court found the UK Governments climate strategy unlawful as it doesn’t show how the UK’s legally-binding carbon budgets (our net zero commitment) will be […]\n12 July 2022 / 10 August 2024 by richardcannon\nWinchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […]\n29 March 2022 / 10 August 2024 by richardcannon\nA letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_08_11_a-firm-grip-on-climate-emergency-cllr-malcolm-wallace-speaks-out/content_23.html": "A published letter to the Hampshire Chronicle\nA Firm grip on climate emergency\nLast week, on the same day that the temperature in the UK hit a record high, the High Court found the UK Governments climate strategy unlawful as it doesn’t show how the UK’s legally-binding carbon budgets (our net zero commitment) will be met.\nThis is a huge political embarrassment to the Government. It therefore came as no surprise when I saw Steve Brine’s column published to your newspaper two days later (July 21st) in which he stated that the Conservative Party leadership had “a firm grip on the detail” and that the UK “continue showing international leadership post COP26”.\nAddressing the climate emergency needs everyone to contribute. We don’t need a few people tackling this imperfectly together. To make this happen we need our ‘leaders’ to be honest about the situation, rather than provide yet more politically convenient soundbites. Is that too much to ask?\nMalcolm Wallace\nWinchester City Councillor for Central Meon Valley\nForest Road\nSwanmore.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2025_03_30_we-ask-local-residents-for-views-on-the-river-park-leisure-centres-future/content_12.html": "it’s your views which matter !\nUpon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news and for their views on alternative uses for the site.\nThe hours spent there were most beneficial. Here’s a list of Here’s a list of all comments made on our post-it note ‘Have your Say’ board…\n•Cafe with indoor seating with public toilets all dog friendly, also an indoor soft play area for youngsters\n•Build a good quality dance studio for all ages with classes, surrounded by grass\n•Lido – please, please,please\n•Grass over to help flood protection and give a place for children to play\n•Botanical Gardens\n•Keep the car park for people to come and enjoy free activities in green space around perhaps a cafe to enjoy. Dog friendly\n•An aquatic park\n•Lido, cafe (like Thames Lido), climbing wall. Definitely leisure\n•Knock down and replace with Grassland and children’s play area.\n•Turn it into a Indoor Market. Independent businesses, stalls for food.\n•Demolish the eyesore building ASAP. Grass over for community space\n•Things for community especially young people. eg. Youth Club\n•Massive soft play area for both children and adults\n•Youth Club (x 2)\n•Definitely demolition of existing building. How long before this happens? Certainly to be kept for community use and open space.\n•Affordable housing\n•Something that facilitates leisure activity\n•A water park, thank you.\n•So sad to see it empty for so long. Surely this must be turned into housing or business\n•Back to a Park for the people of Winchester to enjoy\n•Community Sports Centre\n•More lighting…CCTV\n•Youth Hostel\n•Indoor Skate Park\n•Lido for adults and children with outdoor gym\nour ‘yes – no – don’t know’ board\nAgain, this shows just how much our residents care about the future of our beautiful city, also a good panoramic view from all ages.\nWe’d like to thank all those who took participated and rest assured all these points will be raised with the relevant committees of our City Council.\nIT’S YOUR VIEWS THAT COUNT !",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_droxford/content_4.html": "Green Party Councillors test the water in the River Meon 27 June 2024 / 10 August 2024 by richardcannon Sunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows.. Read more » Danny Lee Droxford Malcolm Wallace Suzanne White",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_meetings_page_2/content_55.html": "4 August 2023 / 10 August 2024 by richardcannon\nRushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative […]\nRead more »\n6 March 2023 / 10 August 2024 by richardcannon\nWinchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […]\n14 October 2022 / 10 August 2024 by richardcannon\nThe meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […]\n10 August 2022 / 10 August 2024 by richardcannon\nAfter an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_suzanne-white_page_2/content_101.html": "Soberton Newtown Climate Cafe a great success 22 October 2023 / 10 August 2024 by richardcannon Stan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […] Read more » Danny Lee Newtown Soberton Suzanne White",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2025_02_02_a-busy-start-to-the-year-for-winchester-greens/content_38.html": "Delivering new year cards\nOur non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places.\nIn the Winchester District Wards a huge number were also distributed.\nDelivering so many by hand in the rain, wind and cold of January was no mean task, but as always,our Team was up to the challenge and a good time was had by all.\nAre you able to help with delivering newsletters and leaflets to people’s homes? Any help, no matter how much time you can give us, would be greatly appreciated. Go to our ‘Get Involved page for more details.\nCoiuncillor Surgery in Droxford\nOnce again St.Wilfred’s Cafe kindly gave us permission to use their premises and as always it was well attended by local residents keen to speak about their issues, concerns or just to ask more for more details of the goings on in Winchester District and County Councils.\nPlease keep your eyes on our facebook, bluesky, instagram and X-Twitter pages for times and places in other areas.\nour annual general meeting 8th.january\nJoint Co-ordinator Max Priesemann gave a presentation of our progress and achievements in 2024.\nThere are some changes to our Team. New appointments as follows….\nCommunications Officer; Virginia Ainscough\nMembership Secretary; Liam Bailey-Morgan\nDatabase and Protection Officer; Luke Ainscough\nYou can see the full team on our People page here.\nIt was also announced that our other Joint Co-ordinator Kate Needham has been selected as Elections Co-ordinator for our regional South East Green Party. This is as well as her role for Winchester Greens.\nour first ‘green chat’ of 2025\nOnce again we met at Projects Kitchen and Store in Winchester. With another three popping in and out to say hello, we were sixteen in total, a great sign of how these mornings are growing to be a very popular event amongst green minded people and of course, just having a chat in general.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_2/content_72.html": "18 December 2024 / 16 January 2025 by richardcannon\nThe National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […]\nRead more »\n9 December 2024 / 16 January 2025 by richardcannon\nA message from Caroline Lucas.. Back in May, in my last few months as MP, I secured a parliamentary debate on nature and biodiversity loss. It was the dying days of Sunak’s government, and amidst the chaos and election fever, I wanted to focus attention on the upcoming nature summit in Colombia. Because nature is […]\n2 December 2024 / 2 December 2024 by richardcannon\nCarla Denyer MP Carla proposed and spoke in favour of several amendments to the Renters’ Rights Bill, including in support of rent controls, as a member of the committee looking at the legislation in detail. She and Siân have also tabled an Early Day Motion in support of funding a 4 Day Working Week pilot trial […]\n26 November 2024 / 2 December 2024 by richardcannon\nLast week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections.\n25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\n8 October 2024 / 8 October 2024 by richardcannon\nCLICK IMAGE TO READ IN FULL..\n3 October 2024 / 4 October 2024 by richardcannon\nInitiated by Kate Needham and organised by Rich Turner and Jo Harmer, we held a live music and dance folk evening featuring local artists at the Hyde Tavern in Winchester. Jo Harmer writes.. It was a great night, so much skill and talent in the Hyde Tavern’s quirky and wonderful Cellar Bar. Each of the […]\nYour green party candidate, Alex Ellis The current County councillor for Bishops Waltham district has stepped down triggering a ‘snap’ by-election which will be held on Thursday 31st October. The division covers a wide area including Bramdean to the North, Colden Common to the West and Durley to the South. See map below for boundary. […]\n10 September 2024 / 10 September 2024 by richardcannon\nA talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_central-meon-valley/content_51.html": "Winchester Greens on the Web 21 March 2025 / 25 March 2025 by richardcannon ‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […] Read more » Central Meon Valley Danny Lee Malcolm Wallace Meon Valley Suzanne White\nSuzanne White and Malcolm Wallace win elections and Greens make big progress in the City 4 May 2024 / 6 February 2025 by richardcannon Central meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […] Read more » Central Meon Valley Malcolm Wallace Meon Valley Suzanne White Videos\nAn historic day for Winchester Green Party 10 May 2022 / 10 August 2024 by richardcannon Malcolm Wallace elected as Councillor for Central Meon Valley On the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor. The result was as follows.. Malcolm Wallace (Green) – 1,955 (55.49%) Linda Gemmell (Conservative) – 1,203 (34.14%) Gregory Joseph (LibDems) – 294 […] Read more » Central Meon Valley Malcolm Wallace",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_climate/content_15.html": "1 March 2025 / 18 March 2025 by richardcannon\nOn the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […]\nRead more »\n25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\n28 June 2024 / 7 February 2025 by richardcannon\nnature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […]\n7 February 2024 / 10 August 2024 by richardcannon\nwhy this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […]\n3 December 2023 / 10 August 2024 by richardcannon\nHampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by […]\n1 December 2023 / 10 August 2024 by richardcannon\nAt a follow-up meeting to the recent Climate Café event, a group of Soberton and Newtown residents formed a new group. Climate Action for Newtown and Soberton (C.A.N.S), was born, with the main aim of reducing the carbon footprint of the parish. Looking at all the ideas suggested at the Climate Café, it was decided […]\n21 November 2023 / 10 August 2024 by richardcannon\nGlobally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […]\n22 October 2023 / 10 August 2024 by richardcannon\nStan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […]\n15 August 2023 / 10 August 2024 by richardcannon\nWinchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […]\n14 August 2023 / 10 August 2024 by richardcannon\naccelerating climate change ! Avington Oil Field taken from article at https://drillordrop.com/2023/07/13/south-downs-oil-field-to-restart-production/ Just recently the Prime Minister announced a raft of new oilfield drilling licences in the North Sea, which will fuel further climate destruction and do nothing to help tackle the cost-of-living crisis. The Intergovernmental Panel on Climate Change, the International Energy Agency and […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_meetings/content_43.html": "5 March 2025 / 5 March 2025 by richardcannon\nAt a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing. Malcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and […]\nRead more »\n2 February 2025 / 7 February 2025 by richardcannon\nDelivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […]\n2 December 2024 / 2 December 2024 by richardcannon\n26 November 2024 / 2 December 2024 by richardcannon\nLast week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections.\n18 July 2024 / 10 August 2024 by richardcannon\nLast week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton. The weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash […]\n7 February 2024 / 10 August 2024 by richardcannon\nCouncillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area. A lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban […]\n29 January 2024 / 10 August 2024 by richardcannon\nOn Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure In the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact. To watch Cllr.Wallace’s statement, scroll through video […]\n8 January 2024 / 10 August 2024 by richardcannon\nReducing traffic for a better environment After the formalities and reports by Committee Role Players at our Annual General Meeting on the 3rd.January, we were delighted to welcome Emily Kerr, Oxford City Councillor for the St.Mary’s Ward who gave a very detailed and positive presentation on ‘Active Travel’. CLICK TO VIEW PRESENTATION You will see […]\n22 October 2023 / 10 August 2024 by richardcannon\nStan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […]\n23 September 2023 / 10 August 2024 by richardcannon\nOur Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023. Based on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_9/content_11.html": "Greens out & about October ’22 – Photo’s 1 November 2022 / 30 May 2024 by richardcannon Our Stand at the Hampshire Youth Parliament meeting in Winchester Whilst visiting family in Yorkshire, Kate and Richard Needham helped out with a Fracking demonstration. Above we see Kate speaking to BBC Local Television Richard Needham proudly displays his huge owl. A mission indeed. Max Priesemann leading the way at the mass ‘Cycle Winchester’ day. […] Read more »\nMember’s Meeting Oct 2022 – A presentation from ‘Flight Free’ 14 October 2022 / 10 August 2024 by richardcannon The meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […] Read more » CLIMATE-JUSTICE\n‘A firm grip on Climate Emergency’ Cllr. Malcolm Wallace speaks out. 11 August 2022 / 10 August 2024 by richardcannon A published letter to the Hampshire Chronicle A Firm grip on climate emergency Last week, on the same day that the temperature in the UK hit a record high, the High Court found the UK Governments climate strategy unlawful as it doesn’t show how the UK’s legally-binding carbon budgets (our net zero commitment) will be […] Read more » Malcolm Wallace\nVisiting the Soberton Down wilding Project 10 August 2022 / 10 August 2024 by richardcannon After an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […] Read more » Countryside Soberton\nPioneering Green Action to Protect our local Rivers and Waterways 12 July 2022 / 10 August 2024 by richardcannon Winchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […] Read more » Countryside Malcolm Wallace\nAn historic day for Winchester Green Party 10 May 2022 / 10 August 2024 by richardcannon Malcolm Wallace elected as Councillor for Central Meon Valley On the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor. The result was as follows.. Malcolm Wallace (Green) – 1,955 (55.49%) Linda Gemmell (Conservative) – 1,203 (34.14%) Gregory Joseph (LibDems) – 294 […] Read more » Central Meon Valley Malcolm Wallace\nOur response to Winchester Movement Strategy proposal 29 March 2022 / 10 August 2024 by richardcannon A letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […] Read more »\nNewly elected Co-Chairs for South East Greens 10 February 2022 / 10 August 2024 by richardcannon Congratulations to Winchester Green Party Campaigner Malcolm Wallace and Anna Younger on being elected co-Chair of the South Eastern Green Party. Below is their remit and we have every confidence that both will represent us in an efficient and poisitive way. 1. The Chair of the Confederation shall chair SE Meetings or arrange for such […] Read more » Malcolm Wallace\nWinchester Movement Strategy Proposal 22 January 2022 / 10 August 2024 by richardcannon First impressions Winchester Movement Strategy in it’s 5th year of consultations and studies Imagine the amount and effort that went into preparing studies after studies would have gone into real changes… But here we are once again – another consultation that does not deliver the urgent changes that are required to offer alternatives to car […] Read more »",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_7/content_77.html": "9 May 2023 / 10 August 2024 by richardcannon\n18 months ago Hampshire had no District Councillors elected. Fast forward to May 2023, we now have ten ! In addition, the Isle of Wight has 2. Here are the details..Basingstoke and Deane, 1 – Michael Howard-SorrellEast Hampshire, 2 – James Hogan & Ian JamesHavant, 1 – Grainne RasonNew Forest, 3 – Neil Millington, Adam […]\nRead more »\n7 May 2023 / 10 August 2024 by richardcannon\nAlresford and Itchen Valley Russell Gordon-Smith (Lib Dem) 2,034 Harry Johnson-Hill (Con) 1,187 Richard Needham (Green) 164 Tessa Valentine (Labour) 74 Majority: 847 Turnout: 40% Bishop’s Waltham Jonathan Williams (Lib Dem) 1,618 Donald Iro (Con) 1,022 Richard Cannon (Green) 232 Steve Haines (Labour) 113 Majority: 596 Turnout: 45% Denmead Paula Langford-Smith (Con) 1,035 Michael Bennett […]\n6 May 2023 / 10 August 2024 by richardcannon\nClick photos to view full sizes Time out in the Cafe Richard, Danny, Malcolm, Giles & Max Giles Gooding Richard Needham Andrew Pogson Julia Priesemann Celebrating the Central Meon Valley win Richard Cannon Malcolm, Giles and Max Our two Winchester Councillors ! Friedrich & Julia Priesemann\n25 April 2023 / 10 August 2024 by richardcannon\nWith more than double the volunteers compared to last year, we’ve been busy distributing leaflets, letters and meeting people listening to any issues they may have and outline our ambitions for the future Add to that we’ve nearly trebled the requests for ‘Vote Green’ boards’ throughout the Meon Valley and some in the city itself. […]\n8 April 2023 / 10 August 2024 by richardcannon\n16 wards – 16 candidates vote green Click candidate photos to view details Richard Needham Alresford and Itchen Valley >> Max Priesemann Alresford and Itchen Valley >> Richard Cannon Bishop’s Waltham Danny Lee Central Meon Valley >> Lucinda Graham Colden Common & Twyford Beata Parry Denmead Lorraine Abraham St. Barnabas Charlotte Harley St. Bartholomew Reece […]\n24 March 2023 / 4 June 2024 by richardcannon\nDanny Lee writes.. The Low Carbon Across the South and East programme provides a free business support programme in the South and East. LoCASE offers grants for businesses of up to £20,000 for installation of energy efficiency measures (up to 40% of the cost of your eligible project, with the remainder matched by your business), as well as training workshops and […]\n12 March 2023 / 10 August 2024 by richardcannon\nFollowing a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we […]\n10 March 2023 / 10 August 2024 by richardcannon\nStan Evans writes On a recent visit to Winchester I was lucky enough to stumble across Earthian – Zero Waste Shop, right in the centre of the city on Parchment Street. With a passion for all things eco I had go inside to check out what this attractive shop has to offer. I was lucky […]\n6 March 2023 / 10 August 2024 by richardcannon\nWinchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […]\n7 February 2023 / 10 August 2024 by richardcannon\nGREENS IN THE NEWS JANUARY ! Our Green Party Councillor Malcolm Wallace has certainly made his mark since being elected last May. Here’s some links to articles he’s mentioned and quoted in over the last few weeks ! Article: Plans for dog walking paddock divide opinion in Meon Valley Malcolm voiced his opinion on plans […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_city-council/content_52.html": "3 May 2025 / 3 May 2025 by richardcannon\nwinchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots !\nRead more »\n31 March 2025 / 4 April 2025 by richardcannon\nhampshire county council by-election for winchester eastgate – lorraine estelle Lorraine has been a Green Party member for a number of years. Living in the St. Bartholomew area makes her central to see all the issues which arise in Winchester. Just recently, upon reading the breaking news that Southampton University had pulled out of redeveloping […]\n30 March 2025 / 31 March 2025 by richardcannon\nit’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […]\n2 February 2025 / 7 February 2025 by richardcannon\nDelivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […]\n18 December 2024 / 16 January 2025 by richardcannon\nThe National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […]\n25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\n4 May 2024 / 6 February 2025 by richardcannon\nCentral meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […]\n9 April 2024 / 10 August 2024 by richardcannon\nYour Green Party Candidates Please scroll down the page to see your Ward Dave Westley Alresford & Itchen Valley David joined the Green Party with a view to influencing a better ecological localised approachwhich in plain terms means a thriving environment that allows nature to take its course andbenefit all the community. At the moment […]\n7 February 2024 / 10 August 2024 by richardcannon\nCouncillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area. A lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban […]\n29 January 2024 / 10 August 2024 by richardcannon\nOn Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure In the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact. To watch Cllr.Wallace’s statement, scroll through video […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_malcolm-wallace_page_2/content_96.html": "Suzanne White and Malcolm Wallace win elections and Greens make big progress in the City 4 May 2024 / 6 February 2025 by richardcannon Central meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […] Read more » Central Meon Valley Malcolm Wallace Meon Valley Suzanne White Videos\nHampshire County Council Meon Valley By-election 22 April 2024 / 10 August 2024 by richardcannon Our Candidate, Cllr. Malcolm Wallace Malcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time.. […] Read more » Malcolm Wallace Meon Valley\nCllr. Malcolm Wallace speaks out at City Council Cabinet Meeting on ‘Greenwashing’ 29 January 2024 / 10 August 2024 by richardcannon On Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure In the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact. To watch Cllr.Wallace’s statement, scroll through video […] Read more » Malcolm Wallace\nWinchester City Council pass motion to call for ban on disposable vapes 1 December 2023 / 10 August 2024 by richardcannon At yesterday’s Council meeting, Winchester City Council passed a motion calling for the government to ban the sale and manufacture of disposable vapes by 2024. The motion was based on a Local Government Association initiative. Cllr Malcolm Wallace, who supported the call for the ban, said, ‘Disposable vapes are an unsustainable product, so an outright ban is […] Read more » healthy living Malcolm Wallace\nSaving our Chalk Streams 21 November 2023 / 10 August 2024 by richardcannon Globally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […] Read more » Danny Lee Malcolm Wallace\nHambledon Greening Festival 2023 15 May 2023 / 10 August 2024 by richardcannon Once again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May. On a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by […] Read more » Danny Lee Hambledon Malcolm Wallace\nHolding Southern Water to account 6 March 2023 / 10 August 2024 by richardcannon Winchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […] Read more » Countryside Danny Lee Malcolm Wallace\nA Green in the room makes a difference ! 7 February 2023 / 10 August 2024 by richardcannon GREENS IN THE NEWS JANUARY ! Our Green Party Councillor Malcolm Wallace has certainly made his mark since being elected last May. Here’s some links to articles he’s mentioned and quoted in over the last few weeks ! Article: Plans for dog walking paddock divide opinion in Meon Valley Malcolm voiced his opinion on plans […] Read more » Malcolm Wallace\nElectric buses coming to Winchester 27 January 2023 / 10 August 2024 by richardcannon After some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […] Read more » healthy living Malcolm Wallace\nCllr. Malcolm Wallace acts to prevent fracking 26 January 2023 / 10 August 2024 by richardcannon At the Winchester City Council meeting earlier this week, Councillors voted to:1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.2) To respond to the County Council’s consultation on the refreshed Minerals andWaste Plan stating our opposition the extraction of oil and gas, including by fracking. Cllr Wallace stated: […] Read more » Countryside Malcolm Wallace",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_housing/content_47.html": "5 March 2025 / 5 March 2025 by richardcannon\nAt a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing. Malcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and […]\nRead more »\n25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\n7 February 2024 / 10 August 2024 by richardcannon\nCouncillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area. A lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban […]\n6 December 2023 / 10 August 2024 by richardcannon\na copy of our full letter explaining the reasons for our objection Bushfield army camp, once an emergency measure in WW2 that returned to the Church Commissioners about 40 years later, has since been rewilding itself for nearly 45 years. There have been multiple attempts for developing this site until the newest proposal. The application […]\n19 August 2023 / 10 August 2024 by richardcannon\nDelay, delay, delay seems to be the story of the Winchester City Council’s Local Plan and was highlighted in an article appearing in the Hampshire Chronicle last week. See https://www.hampshirechronicle.co.uk/news/23725912.green-party-concern-winchester-city-councils-local-plan-delay/ In response, Green Party Councillor Danny Lee made the following statement.. “The council’s decision will mean lower environmental standards will continue for longer for all […]\n15 August 2023 / 10 August 2024 by richardcannon\nWinchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […]\n29 March 2022 / 10 August 2024 by richardcannon\nA letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_03_29_our-response-to-winchester-movement-strategy-proposal/content_16.html": "A letter from Chris Gilham\nStrategic Transport\nEconomy, Transport and Environment Department\nHampshire County Council\nThe Castle\nWinchester\nSO23 8UD\nDear Sir\nI am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party.\nHampshire County Council and Winchester City Council have declared a Climate emergency and all sectors need to play their part by eliminating emissions. Transport as one of the largest emitters has\nmore to do than most and targeting a 10% reduction is underwhelming and wholly inadequate. It is disappointing that the Climate is not mentioned once in the WMS.\nWe agree with the three priorities outlined by the WMS but don’t feel the Next Steps will deliver the large emission reduction required to meet the net zero targets.\nProposals:\n1. Improve P&R facilities on Andover Road. We disagree with this proposal because P&R is expensive and encourages driving from other areas. It attracts people that would have probably parked in out of town car parks anyway. The money would be better spent on thebuses servicing surrounding villages so visitors wouldn’t need a car at all. Disagree\n2. Changes to car parking in Winchester city centre. The proposals suggest increased parking charges which we support but this will not stop anyone able to pay so will have little effect.\nTo deter people from driving into town looking for a parking space we support the removal of car parks (leaving some spaces for blue badge holders). Parking charges should also be\nincreased for residential permits and exponentially for 2 and subsequent cars registered at an address. Support\n3. Converting eastern parts of the one way system. We do not support this proposal because it should be unnecessary if traffic is reduced by other stronger methods. We feel it would be expensive to implement and easy access to car parks will actually encourage more cars.\nMaking the street two way will prevent bus priority and safe cycling/walking measures being introduced here. We are unsure why you think it will make cycling easier. Disagree\n4. Create better public spaces. We support this proposal but feel it can only happen on St Georges Street and Jewry Street once there is a large reduction in traffic. Support\n5. Creating a high-quality walking route. We support this proposal but why is it limited to just one of the 13 routes in the City of Winchester Cycling and Walking Infrastructure Plan (LCWIP). Walking routes need to be safe and away from busy highways to avoid pollution.\nOther proposed routes allowing access to all areas of Winchester need to be revived.\nPavements need to be safe and trip free for all people to use. Support\n6. Creating safe cycle routes. We support this in principal but to encourage large numbers of cyclists to deliver the reduced traffic it will require high quality safe cycle routes providing direct, convenient routes to destinations. This should be a mixture of dedicated cycle lanes and roads that are not car priority. Simply painting a cycle symbol on an existing road will not\nhelp. Support\n7. Providing bus priority on key routes. We support Investment in public transport and in particular getting buses into the city centre faster than cars. Bus lanes and retractable bollards that sink into the ground for buses preventing cars from using the road. Buses have to be better and quicker than cars. Support\n8. Improve local bus services. We support improvements to bus routes including additional and more frequent services. It is a priority for a cheap, regular service from all areas of the district into the city. This will increase the numbers of buses travelling through Winchester so it is essential other traffic is reduced. There is no mention of a bus station which we think is a\nmistake. Relying on street bus stops for all the new services will restrict space for safe\nwalking and cycling. Support\n9. Improving deliveries into the city centre. We support improvements to freight delivery that reduce emissions and hope by removing car traffic there will be less conflict with deliveries anyway. Loading bays will keep these vehicles from blocking roads and reduce illegal\npavement parking. Support\n10. Setting up a freight delivery hub. We support a delivery hub which will consolidate deliveries made by electric bike or van. This goes for bulk deliveries into town but is just as appropriate for larger, heavier purchases delivered home or to a car park further out of town. Deliveries by cargo bike will require better cycle infrastructure and we shouldn’t rule out deliveries arriving by rail. The location of any hub needs to consider all these options. Support\nOverall we support the WMS but don’t believe that in its current form it has any hope of reducing traffic by any significant amount which is required. Fundamentally if you want to reduce traffic you\nhave to implement deterrents while at the same time offer a quality alternative. Massive public transport expansion is essential and it won’t happen by building P&R car parks or waiting for bus companies to put on more services. It requires additional sources of money. The Bus Back Better funding was entirely insufficient for this and has now been cut by a third. Councils have a lot of\noptions available to them which should be considered:\n● Close city centre car parks (leaving some spaces for blue badge holders). This is the most\nimportant and is something the WCC has promised in the past. Money can be raised for their subsequent reuse.\n● Increase the cost of residential parking permits from the 2nd and subsequent permit per household.\n● Car Clubs with cars available in residential areas. Focus on the 2nd household car which\nspends most of its time stationary. If everyone lived within 5 minutes of a car club they might\nnot invest in a 2nd car.\n● Councils have the power to introduce a workplace parking levy.\n● Free public transport systems are being introduced in various cities around the world but at the very least we would call for free bus passes for young people under 26. If they had free transport, they would be less likely to invest in a car",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_malcolm-wallace/content_22.html": "Winchester Greens on the Web 21 March 2025 / 25 March 2025 by richardcannon ‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […] Read more » Central Meon Valley Danny Lee Malcolm Wallace Meon Valley Suzanne White\nGreen motion commits Council to explore solar for council housing. 5 March 2025 / 5 March 2025 by richardcannon At a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing. Malcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and […] Read more » Malcolm Wallace Suzanne White\nA busy start to the year for winchester greens 2 February 2025 / 7 February 2025 by richardcannon Delivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […] Read more » Danny Lee Malcolm Wallace Meon Valley People Suzanne White\nGreen Party criticises the Government White Paper on English Devolution for Local Government reorganisation! 18 December 2024 / 16 January 2025 by richardcannon The National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […] Read more » Danny Lee Malcolm Wallace National Suzanne White\nOut and about photos from autumn ’24 2 December 2024 / 2 December 2024 by richardcannon Read more » Danny Lee Malcolm Wallace Meetings Meon Valley People Suzanne White\nSouth East Green Party Councillor’s Conference 26 November 2024 / 2 December 2024 by richardcannon Last week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections. Read more » Danny Lee Malcolm Wallace Meon Valley\nMeon Valley, Whiteley & Shedfield Newsletters, Nov ’24 25 November 2024 / 26 November 2024 by richardcannon Click images to view full newsletters Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nMeon Valley Autumn Newsletter 2024 8 October 2024 / 8 October 2024 by richardcannon CLICK IMAGE TO READ IN FULL.. Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nGreen Party Councillors test the water in the River Meon 27 June 2024 / 10 August 2024 by richardcannon Sunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows.. Read more » Danny Lee Droxford Malcolm Wallace Suzanne White\nLast days of campaigning and the count. 5 May 2024 / 16 January 2025 by richardcannon Our hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself. Requests for ‘Vote […] Read more » Malcolm Wallace Meon Valley",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_11_19_what-happens-to-your-household-waste-and-rubbish/content_88.html": "Cllr Malcolm investigaTes Local recycling – says we can do better\nYou do your part to help recycling by sorting your rubbish in different bins separating garden waste and taking your rubbish down to recycling centres. Waste Disposal teams empty our bins and take it all away from our doorstep’\nBut what happens next? Councillor Malcolm Wallace gets literally hands on to investigate on our behalf\nMalcolm visited a local recovery centre in Portsmouth, to see the process. These facilities can handle 157,000 tonnes of recyclables each year. Our wheelie bin recyclables (mainly plastics, papers and tins) are sorted using a mix of technology and manual checks. The sorted materials are sent to specialist companies that create raw materials for new products. So what about the waste from black bins that can’t be recycled? This is mostly transferred to local energy recovery centres and burned to produce electricity. These facilities can output enough power for 53,000 homes. Collected garden waste is converted locally into soil conditioner and sold at every recycling centre. Malcolm says, “Did you know that less than 5% of Hampshire’s household waste goes to landfill – but we still need to do better to reduce waste incineration!” What’s your experience with local refuse and recycling collections? Please let us know.\nYou can read the full version of above in our November-December 2022 NEWSLETTER",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_09_23_declaration-of-nature-emergency-for-winchester/content_69.html": "Our Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023.\nBased on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by the Green Party.It was passed unanimously!\nhttps://democracy.winchester.gov.uk/mgAi.aspx?ID=13195\nWe all now look forward to translating the ‘Nature Emergency’ declaration into proactive action.\nYou can view the Motion being discussed here.\nScroll to 1hr 14mins.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_06_09_green-party-leaders-pay-tribute-to-caroline-lucas/content_53.html": "Following the announcement that Caroline Lucas will not be re-standing as a candidate for parliament in the next general election, I’m sure you will all join us in thanking Caroline for her truly inspiring work.\n“Caroline’s impact on politics in this country cannot be overstated: she truly is a force of nature and has been an extraordinary servant of the people of Brighton Pavilion as well as the Green Party. We are so proud of her achievements.\nWhether securing significant policy changes, shaping the conversation, or modeling a different way of doing politics – Caroline demonstrates how essential it is to have Green voices in UK politics. I’ve learnt so much from her, she is an inspiration to me and to many people inside and outside the Green Party who want to see positive change in politics .” – Carla Denyer\n“Caroline’s contribution to our national life has been something to behold for the more than two decades we’ve known one another. Very few politicians can claim to have changed the course of the national debate in the way Caroline has. She has brought so much to us as a party, shown real integrity in her work and added a crucial dimension to our democracy in this country.\nHaving MPs who are genuinely dedicated to standing up for the climate and nature could not be more important than it is right now and that’s why we are striving to get more Green MPs elected at the next General Election so that we can build on Caroline’s achievements.” – Adrian Ramsay\nIf you would like thank Caroline, you can do so here, we know that so many of you have also been inspired by her.\nYou can also sign up to hear more about how you can get involved in the key constituencies where we are primed to win our next MPs. Your support is vital and has a huge impact on our chances of winning.\nIn solidarity,\nCarla Denyer and Adrian Ramsay\nGreen Party Co-Leaders",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_12_03_pushing-hampshire-pension-fund-to-move-away-from-fossil-fuels/content_18.html": "Hampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by Hampshire Pension Fund Divest.\nTherefore, it was welcome news that at the Winchester Council meeting last week a motion was passed recognising that Hampshire Pension Fund’s approach to fossil fuel investment needs to change. The leader of the Council will now write to the board of the fund to ask them to commit to divesting their fossil fuel equities and instead seek to invest in companies that reduce greenhouse gas emissions, minimise climate risk and where possible provide local environmental benefits.\nCllr Danny Lee, who supported the motion, stated, ‘From insulating heat-leaking homes to facilitating mass public transport, councils are key to effect climate action, but this is undermined if local authority pension funds continue to fund fossil fuels. The climate crisis isn’t going away. It’s time to ditch financially risky holdings in gas, coal and oil, and invest in accelerating the transformation to a carbon-free future’.\nCllr Lee also proposed an amendment for the Council to consider the creation of a Green Fund for investment in Hampshire-wide ‘green’ projects. Although this amendment was not passed, it could be considered at a later date and is an opportunity to accelerate local investment.\nSee also\nWinchester Emissions and Carbon Neutrality Action >>\nOil drilling at Cheesefoot Farm – accererating climate change >>",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_11_26_south-east-green-party-councillors-conference/content_26.html": "Last week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections.\nLast week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_3/content_74.html": "18 July 2024 / 10 August 2024 by richardcannon\nLast week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton. The weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash […]\nRead more »\n9 July 2024 / 16 January 2025 by richardcannon\nFor the first time Winchester District Green Party fielded a candidate in a General Election.Our candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages.\n28 June 2024 / 7 February 2025 by richardcannon\nnature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […]\n27 June 2024 / 10 August 2024 by richardcannon\nSunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows..\nLast weekend our candidate Lorraine Estelle attended the general election Hustings at Christ Church Winchester.Those attending were Flick Drummond (Conservative), Lorraine Estelle (Green Party), Hannah Dawson (Labour), Danny Chambers (LibDems) and Shaun Whelan (Reform UK).\n13 June 2024 / 10 August 2024 by richardcannon\nour green party candidate – richard needham Owing to the resignation of the sitting LibDem Councillor for St. Michael, a by-election has been called for on the same day as the General Election on Thursday 4th. July Richard writes.. I have lived in the heart of St Michael ward for almost 40 years, having first […]\n12 June 2024 / 10 August 2024 by richardcannon\nCarla Denyer and Adrian Ramsay write.. ‘Millions of people in our country are feeling insecure and deeply worried about the future. We live in one of the richest countries on the planet, yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and hospital […]\n10 June 2024 / 10 August 2024 by richardcannon\nThe recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post). After the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing. Kate writes.. We are […]\n4 June 2024 / 10 August 2024 by richardcannon\nFollowing national constituency boundary changes, below are maps showing the new / revised Winchester and Hamble Valley areas. You will see that some of the old Winchester boundary now comes under Hamble Valley. Click photos for larger size. winchester… hamble valley… ( Maps are open source from Ordnance Survey.. https://www.ordnancesurvey.co.uk/election-maps/gb/ )\n29 May 2024 / 10 August 2024 by richardcannon\nLorraine Estelle campaigning for Real Hope and Real Change. The Green Party today announced their candidate for the Winchester constituency at the coming General Election. They have selected Lorraine Estelle. Lorraine said, “I am honoured to have been chosen as the Green Party’s candidate for Winchester. In recent years, more and more people have realised […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_meetings/content_60.html": "Out and about photos from autumn ’24 2 December 2024 / 2 December 2024 by richardcannon Read more » Danny Lee Malcolm Wallace Meetings Meon Valley People Suzanne White",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_01_24_winchester-city-council-health-and-environment-policy-committee-mtg/content_75.html": "Next Wednesday 31st. January at 6.30pm Winchester City Council will be holding a meeting in the Walton Suite,, Winchester Guildhall to discuss the Hampshire Hospital Consultation.\nOur Green Party Councillor Malcolm Wallace comments.. ‘This is an extremely important issue for residents of our district. Members of the public may speak or observe at this Committee, provided they have registered three working days in advance. Please contact Democratic Services by 5pm on Thursday, 25 January 2024 via democracy@winchester.gov.uk or (01962) 848 264 to register to speak or observe and for further details. This is a great opportunity for members of the public to contribute directly to the consultation’.\nShould you not be able to attend, it will be shown live on the Winchester City Council youtube channel",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_lorraine-estelle/content_20.html": "we asked local residents for views on the river park leisure centre’s future 30 March 2025 / 31 March 2025 by richardcannon it’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […] Read more » healthy living Leisure Lorraine Estelle Winchester City\nElections 2024 green party votes winchester 9 July 2024 / 16 January 2025 by richardcannon For the first time Winchester District Green Party fielded a candidate in a General Election.Our candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages. Read more » Lorraine Estelle National Richard Needham\nGreen Party Winchester candidate Lorraine Estelle at the Hustings 27 June 2024 / 10 August 2024 by richardcannon Last weekend our candidate Lorraine Estelle attended the general election Hustings at Christ Church Winchester.Those attending were Flick Drummond (Conservative), Lorraine Estelle (Green Party), Hannah Dawson (Labour), Danny Chambers (LibDems) and Shaun Whelan (Reform UK). Read more » Lorraine Estelle\nWinchester District Green Party announce General Election Candidate 29 May 2024 / 10 August 2024 by richardcannon Lorraine Estelle campaigning for Real Hope and Real Change. The Green Party today announced their candidate for the Winchester constituency at the coming General Election. They have selected Lorraine Estelle. Lorraine said, “I am honoured to have been chosen as the Green Party’s candidate for Winchester. In recent years, more and more people have realised […] Read more » Lorraine Estelle",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_elections/content_37.html": "3 May 2025 / 3 May 2025 by richardcannon\nwinchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots !\nRead more »\n31 March 2025 / 4 April 2025 by richardcannon\nhampshire county council by-election for winchester eastgate – lorraine estelle Lorraine has been a Green Party member for a number of years. Living in the St. Bartholomew area makes her central to see all the issues which arise in Winchester. Just recently, upon reading the breaking news that Southampton University had pulled out of redeveloping […]\n18 December 2024 / 16 January 2025 by richardcannon\nThe National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […]\n3 October 2024 / 4 October 2024 by richardcannon\nYour green party candidate, Alex Ellis The current County councillor for Bishops Waltham district has stepped down triggering a ‘snap’ by-election which will be held on Thursday 31st October. The division covers a wide area including Bramdean to the North, Colden Common to the West and Durley to the South. See map below for boundary. […]\n9 July 2024 / 16 January 2025 by richardcannon\nFor the first time Winchester District Green Party fielded a candidate in a General Election.Our candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages.\n27 June 2024 / 10 August 2024 by richardcannon\nLast weekend our candidate Lorraine Estelle attended the general election Hustings at Christ Church Winchester.Those attending were Flick Drummond (Conservative), Lorraine Estelle (Green Party), Hannah Dawson (Labour), Danny Chambers (LibDems) and Shaun Whelan (Reform UK).\n13 June 2024 / 10 August 2024 by richardcannon\nour green party candidate – richard needham Owing to the resignation of the sitting LibDem Councillor for St. Michael, a by-election has been called for on the same day as the General Election on Thursday 4th. July Richard writes.. I have lived in the heart of St Michael ward for almost 40 years, having first […]\n12 June 2024 / 10 August 2024 by richardcannon\nCarla Denyer and Adrian Ramsay write.. ‘Millions of people in our country are feeling insecure and deeply worried about the future. We live in one of the richest countries on the planet, yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and hospital […]\n10 June 2024 / 10 August 2024 by richardcannon\nThe recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post). After the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing. Kate writes.. We are […]\n4 June 2024 / 10 August 2024 by richardcannon\nFollowing national constituency boundary changes, below are maps showing the new / revised Winchester and Hamble Valley areas. You will see that some of the old Winchester boundary now comes under Hamble Valley. Click photos for larger size. winchester… hamble valley… ( Maps are open source from Ordnance Survey.. https://www.ordnancesurvey.co.uk/election-maps/gb/ )",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2025_04_11_last-chance-to-comment-on-governments-white-paper-on-devolution/content_61.html": "If you live in Hampshire, this weekend is your last chance to respond to the local consultation on the government’s Devolution White Paper for Hampshire and the Solent.\nPlease have your say now!\nThe Devolution White Paper has significant implications for formation of a new Mayor led Strategic Combined Authority for Hampshire and the Solent. This will lead to the biggest changes in 50 years as to how our District and County will be ‘governed’!\nWhen answering the Consultation questions please consider strong comments about the missing statutory Nature and Climate duties for the new Authority.\nSome thoughts on what you might wish to say about the missing climate and nature duties in the Devolution Bill – can be found here https://seclimatealliance.uk/making-devolution-work-for…/",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_elections_page_3/content_87.html": "10 May 2022 / 10 August 2024 by richardcannon\nMalcolm Wallace elected as Councillor for Central Meon Valley On the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor. The result was as follows.. Malcolm Wallace (Green) – 1,955 (55.49%) Linda Gemmell (Conservative) – 1,203 (34.14%) Gregory Joseph (LibDems) – 294 […]\nRead more »\n10 February 2022 / 10 August 2024 by richardcannon\nCongratulations to Winchester Green Party Campaigner Malcolm Wallace and Anna Younger on being elected co-Chair of the South Eastern Green Party. Below is their remit and we have every confidence that both will represent us in an efficient and poisitive way. 1. The Chair of the Confederation shall chair SE Meetings or arrange for such […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2025_03_31_our-candidates-for-two-by-elections-on-1st-may-2025/content_36.html": "hampshire county council by-election for winchester eastgate – lorraine estelle\nLorraine has been a Green Party member for a number of years. Living in the St. Bartholomew area makes her central to see all the issues which arise in Winchester.\nJust recently, upon reading the breaking news that Southampton University had pulled out of redeveloping the River Park Leisure Centre, within 24 hours she arranged for a stall to be displayed outside the Centre inviting local residents to voice their views on what the next steps should be. This proved most successful (read the results here).\nHer many involvements in the city include being a volunteer tour guide at the Cathedral and leads historical walks through the city and surrounding area.\nLorraine say’s..’I hear concerns about our throw away culture and that they are keen to see local initiatives to reduce waste and encourage reuse. They want to see greater action to enable\nwalking, cycling and viable public transport and the use of more affordable renewable energy. By listening to local people and working through our political system the Green Party can contribute\nto real change on these vital and urgent issues’.\nwinchester city council by-election for colden common & twyford – liam bailey-morgan\nLiam is a long-standing member of the Green Party and strong advocate for thinking global acting local.\nLiam has worked in the humanitarian and international development sectors for over 16 years, and it was seeing first-hand the disastrous consequences of UK foreign policy, climate change and an unfair international economic system that led him to join the Green Party.\nLiving in Twyford, Liam is passionate about local politics and the issues that members of his community are concerned about in Twyford and Colden Common, particularly those that overlap with the Green Party’s values such as improved public transport, reducing the speed limit, and improved cycling provision.\nm\nWould you like to help Lorraine and Liam by having a ‘Vote Green’ election board in your front garden, or a poster for your window? If so, please email: contact@winchester.greenparty.org.uk Thank you\nm\nm",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_hamble-valley/content_7.html": "Kate Needham to stand as candidate in Hamble Valley 10 June 2024 / 10 August 2024 by richardcannon The recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post). After the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing. Kate writes.. We are […] Read more » Hamble Valley Kate Needham",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_liam-bailey-morgan-2/content_39.html": "By-election results and count in photos 3 May 2025 / 3 May 2025 by richardcannon winchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots ! Read more » #Liam-Bailey-Morgan #Lorraine-Estelle",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_12_06_objection-to-bushfield-development-application/content_44.html": "a copy of our full letter explaining the reasons for our objection\nBushfield army camp, once an emergency measure in WW2 that returned to the Church Commissioners about 40 years later, has since been rewilding itself for nearly 45 years. There have been multiple attempts for developing this site until the newest proposal.\nThe application states: The proposed uses are as follows: office (Class E), research and development (Class E), academic uses and academic accommodation (Class F1/Sui Generis) a hotel (Class C1) and other complementary/ancillary uses including a nursery (Use Class E), retail uses including shops (Use Class E) restaurants/cafes/bars (Use Class E), visitor space/exhibition space (Class F1), leisure and sports uses (Use Class F2).\nWe are very worried about these plans as:\nLocals doubt there is a need for these proposals,\nConstruction and increased traffic from estimated 4000+ car daily car journeys (two multistorey carparks with 1055 parking spaces included) will increase carbon emissions,\nThe increase in car traffic will make it more difficult to cycle and to cross the road on Badger Farm Road near Sainsbury’s, further along the way including on Romsey Road and St Cross Road,\nThreaten this area’s biodiversity, an area that has been left to rewild for longer than it was used as an army camp and that is now a habitat for dormice and valued wildlife,\nThe visual impact from multistorey buildings may reach far into South Downs NP and impact the surrounding heritage,\nNoise and light pollution will impact on nature and locals.\nFurthermore, there is concern that an outline planning permission once granted will take control away from local councils when further changes to the plans are made in the future.\nIt appears that the plans do not conform with the 2013 Local Plan, nor the Carbon Neutrality Action Plan. It is contrary to the WCCs and the Church of England’s Carbon Net Zero 2030 target as well as the UK Government’s Net Zero Development Plan. It also contradicts Winchester’s recently announced Nature Emergency.\nYou can find the planning application on www.winchester.gov.uk/planning by searching for the reference 23/02507/OUT. This is where you can make any comments and object. Here are some tips on how to give your objection extra impact:\nGive clear reasons for your objection\nExplain from your own viewpoint why you want to preserve the Bushfield area\nRefer your objections to policies included below\nFind further details below and make use of links attached to get help\nWho is behind this?\nWe understand that this land belongs to the Church Commissioners for England. In partnership with Legal & General and Gisborne they have organised several consultations that led to this outline planning application.\nWho is this development for?\nLocals have been very critical at meetings in the neighbouring Badger Farm parish about this engagement and how the proposed buildings and their function changed over the last 2 years. A petition has gained much attention this year.\nThe site was allocated in the 2013 Winchester District Local plan (Policy WT3) as an ’employment site’ and has since been included in the Regulation 18 Local Plan – Winchester Town Development Allocations as ‘high quality flexible business and employment space, an innovation/education hub and creative industries’. Student accommodation, a hotel and retail do not fit with this description. This location, isolated from the city centre, is not suitable for student accommodation. Why do we need student accommodation at this site if the Uni of Winchester is not interested in such? Furthermore, there is fear that it would create extra pressures on the Badger Farm surgery and possibly other public services.\nLocals claim that there are empty spaces for business available closer to the city centre and in the Winnall business estate. It is highly unlikely that it will attract people from Winchester who commute to London to work in these premises that are planned here. The number of job vacancies in Winchester in comparison to the size of this development suggests that this site would have to attract people to commute from elsewhere which is not of any use for people living in Winchester.\nFinally, it appears unlikely to attract businesses outside the Solent Freeport and we can not see that this has been taken into account.\nSite Allocation and Emerging Planning Policy\nThe Bushfield Camp site is allocated in the current adopted Local Plan (LPP1) under Policy WT3 as an employment site. The Applicant has stated that “The Regulation 18 Local Plan includes new policy wording which seeks to recognise the changing nature of employment uses. The draft policy for Bushfield (draft WT5) now supports a high quality flexible business and employment space, an innovation/education hub and creative industries”. In our view the emerging Local Plan does not hold weight or provide ‘direction of travel’ as the Regulation 19 consultation is not due to be published until the second quarter of 2024.\nThe Applicant has stated that “…the adopted Policy WT3 does not list out specific use classes that the development must align with, nor does it preclude the provision of other uses (supporting hotel accommodation, leisure, or education facilities etc.) which are all employment generating uses”. In our view, the proposed use of the site diverges significantly with the adopted policy. We contend that Policy WT3 permits the construction of a 100 bedroom hotel and 525 bed student village.\nThe Applicant has referenced emerging Local Plan Policy H9 (Purpose Built Student Accommodation (PBSA)). We contend that this policy also does not hold weight regarding this application. The policy is not applicable as the proposed student village is not PBSA and the application has not demonstrated a shortfall in accommodation from an existing education provider.\nAs the proposed development does not comply with policy and site allocation requirements and represents a significant departure from the Local Plan. It is our view that the LPA must notify the Office of the Deputy Prime Minister of this departure if it intends to approve the application.Proposed Site Use\nThe Spatial Strategy within the Local Plan states that the allocation of land at Bushfield Camp is provided to realise the aspiration for Winchester to “diversify its economy through the promotion of its creative and cultural industries, linked to its Universities”. In our view the proposals, which are for a large-scale major development, do not align with this aspiration, or what could be classed creative and cultural industries and rather than evidencing links with local universities, the plans propose global affiliations with leading corporations.\nPolicy WT3 requires that “any development should deliver necessary social, economic or environmental development which could not otherwise be accommodated within or around Winchester…”. We contend that due to the contraction of the public sector, changes due to increasing numbers of people working from home, and sites needing redevelopment, that the proposed development would be better located within the city centre, and not a Site of Importance for Nature Conservation and within proximity of the Compton Street Local Settlement Gap.\nLocal Plan Policy WT3 requires that the development “does not compete or detract from the town centre, is compatible with the provision made elsewhere through this strategy, and reflects other policy statements prepared by the Council including the Vision for Winchester”. In our view, the development will detract from the city centre, especially the proposed hotel, which is likely to compete with hotels in the town centre. Our view is supported by the NPPF and Policy DM7 – “hotels should normally be directed towards the town centre in the first instance”. Neither Policy WT3 nor emerging draft Policy WT5 permits the development of a hotel.\nThe Applicant has stated that the “NPPF seeks to ensure a sufficient choice of education places are available ‘to meet the needs of existing and new communities'”. In our view, the NPPF is not applicable as the development is not aimed at meeting local education needs\nIncreased car traffic\nThe application fails to address the scale of transport Greenhouse Gas (GHG) emissions it will cause. The reference to CP10 is meaningless without more practical proposals that address more usefully the growing urgency of climate policies. Many key policies are overlooked and their implications ignored.\nWCC must reduce all emissions sharply to achieve net zero by 2030 and transport emissions are nearly half of these.\nCompared with 2022, the modelling suggests traffic volumes will increase by between 17% to 37% on roads around the development by 2039. The application does not attempt to show how the increase due to the development itself can be limited neither to help achieve the WCC net zero target by 2030, nor even to achieve the government’s Net Zero Development Plan target of reducing 2022 emissions by 76% to 85% by 2039.\nNo attempt has been made to quantify the extent transport emissions associated with this development will undermine Winchester’s Carbon Neutrality Action Plan (CNAP). Using government conversion factors we calculate that the modelled increase in traffic will produce 6.15 KtCO2e extra emissions annually. To achieve net zero emissions by 2030 there will have to be overall cumulative reductions of 67 KtCO2e in Winchester District transport emissions each year until 2030. As this proposal increases traffic related carbon emissions, further reduction would need to be found elsewhere.\nThe Sustainability Statement makes a number of vague proposals that are relatively unformed and weak about mitigating the damage caused by increased transport emissions but does not demonstrate satisfactorily the extent to which these proposals will contribute to emissions reduction.\nThe framework travel plan has no targets for increasing the share of EVs. The proposals include plans for a “…minimum of 3kW chargers for at least a quarter of total car parking spaces, with an aspiration to provide 100% EV charging capacity in the future.” Parking for 8 hours on site would only charge the average EV by less than half of its battery capacity. This is clearly not in line with government plans to increase EV use.\nThe traffic modelling suggests there will be about 4500 daily journeys to and from the site. There are plans for 1050 parking spaces. It is difficult to reconcile these two figures. The proposals do not appear to be coherent.\nImpact on active travel\nThe framework travel plan has no targets for achieving modal transfer to increase the share of walking, cycling and public transport access.\nIt appears that the applicant has not fulfilled the obligation under the Local Plan: “Promotion of non-vehicular access to and within the site, to ensure integration with the surrounding areas and to minimise and mitigate its impact on the strategic highway network.”\nGiven the very large scale of the development with projected 8399 trips per day (Transport Assessment, section 5.4), the applicant needs to invest more to increase the low number of 212 anticipated daily cycle trips. We agree with Active Travel England that the modal share targets (car/van 79.7%, walking 5.7%, cycling 3.2%, bus 3.6%, and train 2.0%) are unambitious. Instead, the plans should be in line with the government target for 50% of short journeys in towns and cities to be walked, wheeled or cycled by 2030.\nAny permission for development of the site must be conditional on meeting LTN 1/20 standards for the main cycle path.\nTo the North:\nThe proposed cycle route from the Bushfield roundabout via the site to the north is welcomed but an unsealed surface as suggested would make this less suitable for cycling given the gradient. An unsealed surface makes cycling more dangerous around sharp bends together with a significant gradient due to its terrain. There are concerns that the path will not be wide enough to minimise conflict with pedestrians. A high-quality route would have a sealed surface and environmentally-sensitive lighting (to allow year-round use) and be sufficiently wide to avoid conflict with pedestrians.\nThe main site cycle path terminates at the northern site boundary, near the railway footbridge to Whiteshute Lane. There are no plans included on how this path will link towards the centre of Winchester. For these plans to be in accordance with the Local Plan funds and agreements should be included to provide these onward links.\nTo the West (Badger Farm and Olivers Battery):\nPlans to link with neighbouring residential areas of Badger Farm and Olivers Battery, including a supermarket, GP and dentist, are not satisfying and at best useful for leisure purposes. These paths become muddy and overgrown and are not suitable for commuting to work by cycle or walking for shopping purposes.\nThe plans fail to provide for a cycle route as per LTN 1/20 nor a suitable route for pedestrians. A provision of these however would increase active travel.\nTo the South (Compton and Shawford):\nThe application fails to include adjustments for Bushfield roundabout to encourage safe cycling as per LTN 1/20 section 10.7 on roundabouts, 5.9 on horizontal curve radii, and Summary principle #18: “Cycle routes must flow, feeling direct and logical. Users should not feel as if they are having to double back on themselves, turn unnecessarily, or go the long way round. Often, cycling schemes – when crossing a main road, for instance – require cyclists to make a series of ninety-degree turns to carry out a movement that a motor vehicle at the same location could do without turning at all. Schemes should be based on a proper understanding of how people actually behave rather than how they might be expected to behave.”\nThis creates a deterrent to cycling. Instead, the applicants should develop a design that follows state of the art examples from the Netherlands or the Manchester model.\nThe proposed crossing of Badger Farm road is not safe for cyclists and pedestrians. It includes a refuge island built to “HCC Standard Detail HCC11/C/075 Type 8a” that is only suitable for pedestrians and only on roads with a 40mph speed limit or lower. It is not appropriate for a shared-use crossing that connects a bridleway to a shared-use path (used by cyclists, pedestrians, mobility scooters, wheelchairs, and equestrians), crossing a 60mph road. The crossing is equally unsafe for those who like to reach the bus stop on the other side of this busy road.\nWe are concerned about the lack of a footway and segregated cycle path along Badger Farm Road, given the high speeds and potential pedestrian traffic to the nearby Sainsbury’s supermarket.\nAlthough there are proposals for a private shuttle bus, it fails to provide details on how this is linked to other bus routes, what frequency there is planned throughout day and night and how it links to the P&R parking, supermarkets, train stations in Winchester and Shawford, schools etc. The design of the bus stops is poor with little or no shelter. Routes to current bus stops are difficult to reach via long and unpleasant routes, i.e. requiring crossing a busy roundabout to reach Otterbourne Road for the Blue Star bus.\nThe proposals should follow standards as stated in the National Planning Policy Framework (NPPF) 104, 110, 112, 113, as well as the National Design Guide (Paragraph 82, Planning practice guidance for beautiful, enduring and successful places, 2021): “Priority is given to pedestrian and cycle movements, subject to location and the potential to create connections. Prioritising pedestrians and cyclists means creating routes that are safe, direct, convenient and accessible for people of all abilities. These are designed as part of attractive spaces with good sightlines, and well-chosen junctions and crossings, so that people want to use them. Public rights of way are protected, enhanced and well-linked into the wider network of pedestrian and cycle routes.”\nIt is disappointing that this application concentrates primarily to accommodate access by car, instead of promoting most access by active travel, resulting in a major traffic increase estimated to at least 4500 extra car journeys a day. This is another reason for the planning application to be rejected.Brownfield or Greenfield\nThe whole site includes primarily greenfield and some brownfield with partially demolished buildings and some tarmacked roads and squares. We like to point out that the smaller brownfield area has rewilded during the last 40-50 years since the closure of the army camp. This is a longer period than the time it was used by the army.\nThe whole area has attracted locals for its value for walking in the countryside with great views towards St Catherine’s hill, St Cross Hospital and the Cathedral. Without doubt this supports their physical fitness and wellbeing.\nRisk to Biodiversity\nIt is well known that brownfield, if left alone over decades as here, starts rewilding and can host a greater variety of wildlife then farmland which is usually labelled as greenfield. Many invertebrates have complex life cycles, needing different things at different stages, so they often require two or more habitats close to each other – a ‘mosaic’ of habitats. Brownfield sites are one of these precious mosaics in the wider landscape, providing habitat variety that is rare in the agricultural countryside. www.buglife.org.uk/resources/habitat-hub/brownfield-hub\nHazel Dormice, Common Lizards, Invertebrates and many bird species have been spotted on Bushfield land. The construction of this development, with construction ongoing for 11 years, will disturb their habitat and therefore contribute to the decline of threatened species within an ecosystem that has grown over more than 4 decades.\nDormice are known as a ‘flagship’ species, meaning that they are found in a habitat that is usually suitable for a wide range of other species too. The protection of dormice will help to protect species such as the common lizard, slow worm, badger, warblers, fieldfare, tawny and little owl, and woodpecker.\nThe data to describe the ecological value of Hazel Dormice appears to be out of date as it is based on the 17 year old Conservation Handbook when Hazel Dormice was more common. The State of Dormice Report 2023 however concludes that “dormice are locally extinct in 14 English counties within their historical range; in a further six they are known only from reintroduced populations”. The State of Britain’s Dormice Report 2023 states that “between 2000 and 2022, the National Dormouse Monitoring Programme (NDMP) shows the population has fallen by 70 per cent”.\nThe development proposals state that there is 33.5ha of suitable dormouse habitat on site which is estimated to accommodate 13 individuals. The proposals include the removal of 7.43ha of confirmed and potential dormouse habitat, however only 2.28ha appears to be provided in compensation, which would cause a loss in habitat of 5.15ha. In addition, the activities linked to the development including noise and light pollution and an increase in human activity will further impact on the Hazel Dormice population as they are active at night.\nNatural England have stated in the paper ‘Definition of Favourable Conservation Status for Hazel or Common Dormouse’ that 12-13% increase in mixed deciduous woodland is required for the species to gain favourable conservation status. The developer should provide compensation for lost habitat due to the development (7.43ha), plus the recommended increase in suitable habitat (4.36ha), plus a quantified compensatory area of habitat due to the degradation of suitable existing dormouse habitat.\nThe habitat will need to replace like for like in terms of species and will need to connect to wider green infrastructure through linear hedgerows. In addition, proposals will need to compensate for the delay of the new habitat to become suitable due to the time it takes for planted shrubs and trees to bear fruits and flowers and for suitable links to grow between upper and lower canopies.\nThe plans state that vegetation removal will be carried out under ecological supervision and take place outside of the sensitive peak breeding season (June to August). However, it fails to protect the peak bird nesting season (March to July).\nIn our view the proposals do not comply with Section 15 of the NPPF (conserving and enhancing the natural environment), or Local Plan Policy CP16 or WT3, as the proposals fail to adequately protect or enhance or restore the Hazel Dormouse Habitat, or the onsite Sites of Importance for Nature Conservation. There is also likely to be significant recreational pressure on the River Itchen SAC and SSSI and St Catherines Hill SSSI from the proposed development. The proposed phasing also does not comply with Policy CP15 (Green Infrastructure) which requires that green infrastructure is provided at “the earliest feasible stage”, in our view the mitigated woodland and grassland habitat needs to be created years in advance of the habitat removal.\nPolicy WT3 requires development of the site to have a ‘conservation led approach’. In our view, the proposals, which include a 525 bed student village, 100 bed hotel, sports facilities, shops, cafés, and bars, which are to be built on land that is currently designated as a Site of importance for Nature Conservation, cannot be said to be a conservation led approach. The development is clearly too ambitious for the fragile ecology located on the site and is led purely by economic interests. The application admits that “Bushfield is an employment-led, mixed use development…” and that the applicant is seeking to get the “best possible return” on the site.\nFinally, WCC unanimously voted to support a motion to declare a Nature Emergency in September 2023 which underlines that this application should be rejected.Climate Change\nWinchester City council declared a climate emergency in 2019 with the aim for the wider district to be carbon neutral by 2030. The proposals in this application, however, are not in line with these plans. Construction and life cycle as well as all the impacts including traffic should be carbon neutral.\nVisual impact on South Downs NP\nThe planned development will be visible from the South Downs NP.\nNoise and light pollution\nThe plans will undoubtedly increase noise and light pollution during construction and afterwards. This would have a negative impact on locals. It will also change the habitat of sensitive wildlife. This is of particular concern to nocturnal animals like dormice.\nWater Supply and Wastewater\nWe worry that this development will put further strain on the overstretched water supply for Winchester. Water extraction from chalk aquifers is already at a limit that led Southern Waters to plan to recycle wastewater and revert it back from Waterlooville to Winchester. These plans fail to outline where the extra water for this development can be sourced from.\nDespite the possible inclusion of a water treatment works there remain concerns on where the water will be drained to. The extra volume of water, even if it was cleaner, would put extra strain on the mains sewer at Morestead WwTW which would increase the likelihood of so-called storm overspills.\nThere are details missing on the design of a Sustainable Drainage System (SuDS) including evidence and reassurance that the proposed SuDS does not lead to deterioration in water quality affecting the Itchen and groundwater.\nObjection to Bushfield Development Application 23/02507/OUT\nWe like to see reassurance according to the motion unanimously supported by WCC in July 2022 “To protect our local rivers & waterways by taking account of the cumulative impact of pollution including sewage discharge”.Outline planning application\nWe are concerned that an outline planning application limits opportunities for the council and local people to participate in more detailed plans. The application seeks to exclude Access from the Reserved Matters, meaning that, if the application were accepted, there would be very limited scope for correcting errors and inadequacies introduced at this early stage.\nFurthermore, we reject that this application gives too little time for people to study the application in detail to be able to respond fully.\nAlternatives\nWe appreciate that the Church Commissioners as the owners of this land have a duty to look after the land and to get a return for their pension funds. However, they also follow an ethical policy which includes safeguarding God’s creation. The Church of England has agreed an ambitious goal to become carbon neutral by 2030.\nTherefore, this land could offer a prime opportunity to use the land as a carbon sink. This could include further rewilding and tree planting. The small brownfield land could be used for an installation of a combined solar and wind farm with combined energy storage while encouraging biodiversity.\nThe land could be used for educational purposes to observe and measure the rewilding process. Pupils from surrounding schools could learn about biodiversity, renewable energy etc. in a study centre like in Minstead in the New Forest.\nThe land could also offer room for a ‘Wild Church’ in the open.\nThese alternatives would benefit locals, be in keeping with church and local policies and provide an annual financial return for the Church Commissioners.\nSummary\nThis planning application should be rejected by WCC as it is in the wrong place, lacks benefits for the local community, contradicts recent plans to reduce carbon emissions, destroys habitat for species that are threatened by decline, fails to promote active travel modes, increases traffic congestion and will change the South of Winchester with its heritage sites forever.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_05_07_local-election-results-2023/content_91.html": "Alresford and Itchen Valley\nRussell Gordon-Smith (Lib Dem) 2,034\nHarry Johnson-Hill (Con) 1,187\nRichard Needham (Green) 164\nTessa Valentine (Labour) 74\nMajority: 847\nTurnout: 40%\nBishop’s Waltham\nJonathan Williams (Lib Dem) 1,618\nDonald Iro (Con) 1,022\nRichard Cannon (Green) 232\nSteve Haines (Labour) 113\nMajority: 596\nTurnout: 45%\nDenmead\nPaula Langford-Smith (Con) 1,035\nMichael Bennett (Lib Dem) 954\nBeata Parry (Green) 167\nDavid Picton-Jones (Labour) 149\nMajority: 81\nTurnout: 33%\nSt. Barnabas\nJonny Morris (Lib Dem) 1,933\nDavid Crudgington (Con) 885\nLorraine Abraham (Green) 282\nLucy Sims (Labour) 191\nMajority: 1,048\nTurnout: 49%\nBadger Farm and Oliver’s Battery\nAdrian Brophy (Lib Dem) 1,769\nDavid Killeen (Con) 1,350\nMax Priesemann (Green) 193\nAdrian Field (Labour) 96\nLincoln Redding (Reform UK) 84\nMajority: 419\nTurnout: 55%\nColden Common and Twyford\nHannah Greenberg (Lib Dem) 1,247\nPaula Johnstone (Con) 555\nLucinda Graham (Green) 137\nCallum Hunter (Labour) 78\nMajority: 692\nTurnout: 44%\nCentral Meon Valley\nDanny Lee (Green) 2,168\nKris Ford (Cons) 889\nTom Gregory (Lib Dem) 313\nAntony Mcnally (Labour) 66\nMajority:1,279\nTurnout: 45.8%\nSouthwick and Wickham\nChris Chamberlain (Lib Dem) 936\nSandy Phillips-Lee (Con) 526\nNigel Prior (Green) 158\nPaul Sony (Labour) 71\nMajority: 410\nTurnout: 32%\nSt Michael\nGeorge Prest (Lib Dem) 1,601\nFiona Mather (Con) 832\nKate Needham (Green) 271\nPeter Marsh (Labour)181\nMajority: 769\nTurnout: 46%\nSt Paul\nMartin Tod (Lib Dem) 1,608\nLeo Keay (Con) 533\nGiles Gooding (Green) 376\nStephen Turner (Labour) 232\nMajority: 1,075\nTurnout: 44%\nThe Worthys\nJane Rutter (Lib Dem) 1,331\nSigne Biddle (Con) 702\nHannah Dawson (Labour) 139\nAndrew Pogson (Green) 99\nMajority: 629\nTurnout: 44%\nWhiteley and Shedfield\nSudhakar Achwal (Lib Dem) 1,286\nTom Garth (Con) 536\nNicholas John (Green) 96\nAlison Ridley (Labour) 88\nMajority: 750\nTurnout: 33%\nUpper Meon Valley\nJerry Pett (Lib Dem) 932\nAstrea Hurlock (Con) 922\nPolly Perry (Green) 352\nCameron Hodgkinson (Labour) 50\nMajority: 10\nTurnout: 49%\nWonston and Micheldever\nCaroline Horrill (Con) 1,491\nAndrew Adam (Lib Dem) 1,089\nJulia Stolle (Green) 184\nAntony De Peyer (Labour) 81\nMajority: 402\nTurnout: 48%\nSt. Bartholomew\nNathan Eve (Lib Dem) 1352\nSamuel Feltham (Con) 509\nCharlotte Harley (Green) 284\nPatrick Davies (Labour) 246\nMajority: 843\nTurnout: 38.25%\nTO SEE ALL OUR CANDIDATE DETAILS, GO TO THIS PAGE >>>",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_2/content_65.html": "Green Party criticises the Government White Paper on English Devolution for Local Government reorganisation! 18 December 2024 / 16 January 2025 by richardcannon The National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […] Read more » Danny Lee Malcolm Wallace National Suzanne White\nNature Action now – the battle of our lives 9 December 2024 / 16 January 2025 by richardcannon A message from Caroline Lucas.. Back in May, in my last few months as MP, I secured a parliamentary debate on nature and biodiversity loss. It was the dying days of Sunak’s government, and amidst the chaos and election fever, I wanted to focus attention on the upcoming nature summit in Colombia. Because nature is […] Read more »\nNovember Updates from our greens in parliament 2 December 2024 / 2 December 2024 by richardcannon Carla Denyer MP Carla proposed and spoke in favour of several amendments to the Renters’ Rights Bill, including in support of rent controls, as a member of the committee looking at the legislation in detail. She and Siân have also tabled an Early Day Motion in support of funding a 4 Day Working Week pilot trial […] Read more » National\nOut and about photos from autumn ’24 2 December 2024 / 2 December 2024 by richardcannon Read more » Danny Lee Malcolm Wallace Meetings Meon Valley People Suzanne White\nSouth East Green Party Councillor’s Conference 26 November 2024 / 2 December 2024 by richardcannon Last week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections. Read more » Danny Lee Malcolm Wallace Meon Valley\nMeon Valley, Whiteley & Shedfield Newsletters, Nov ’24 25 November 2024 / 26 November 2024 by richardcannon Click images to view full newsletters Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nMeon Valley Autumn Newsletter 2024 8 October 2024 / 8 October 2024 by richardcannon CLICK IMAGE TO READ IN FULL.. Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nfund raising live folk evening – 26th.September 2024 3 October 2024 / 4 October 2024 by richardcannon Initiated by Kate Needham and organised by Rich Turner and Jo Harmer, we held a live music and dance folk evening featuring local artists at the Hyde Tavern in Winchester. Jo Harmer writes.. It was a great night, so much skill and talent in the Hyde Tavern’s quirky and wonderful Cellar Bar. Each of the […] Read more »\nHampshire County Council-Bishop’s Waltham by-election 3 October 2024 / 4 October 2024 by richardcannon Your green party candidate, Alex Ellis The current County councillor for Bishops Waltham district has stepped down triggering a ‘snap’ by-election which will be held on Thursday 31st October. The division covers a wide area including Bramdean to the North, Colden Common to the West and Durley to the South. See map below for boundary. […] Read more » Alex Ellis Bishop's Waltham\nMembers & Supporters open meeting – The importance of Chalk Streams 10 September 2024 / 10 September 2024 by richardcannon A talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […] Read more » Kate Needham River Meon",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_about-us_here-to-help/content_17.html": "here to help\nuseful phone numbers and links\nWinchester City Council : housing, council tax, benefits, planning etc 01962 840 222\nAntisocial behaviour 01962 840 222\nBins & recycling, flytipping 0300 300 0013\nBulky waste collection (Biffa) 01962 670706\nCitizens advice adviceline 0808 278 7861 (free call)\nFlood line 0345 988 1188\nUrgent potholes 0300 555 1388\nPower Cut (SSE) 105 (free call)\nFood support www.winchester.gov.uk/get-help/how-to-get-help\nIf there’s an issue you need to raise, the quickest way to get the problem sorted out is to contact the council directly using the numbers above, or you can email customerservice@winchester.gov.uk >>\nIf you’re having a problem with council services, get in touch with Cllr Malcolm Wallacemwallace@winchester.gov.uk >> or DannyLee – djlrover89@gmail.com >>, both working hard for local residents.\nEnergy saving and Cost of Living support\nHEATING & LIGHTING: the huge increase in the cost of energy is worrying many. Local housing has very mixed energy efficiency. There are some obvious steps we can all take like reducing draughts.\nFor a more complete list of measures visit Energy Saving Trust tinyurl.com/warmhomehacks which also has advice for disabled people on how to get help with energy bills.\nNATIONAL – A new website has been launched that provides information on Government support that is available: Help for Households helpforhouseholds.campaign.gov.uk\nLOCAL – In addition Winchester Council has launched a website providing information on local resources: Cost of living support and information… https://www.winchester.gov.uk/cost-of-living",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_people/content_2.html": "councillors and Committee\ncllr. Malcolm Wallace\nWinchester District Councillor for Central Meon Valley / County Councillor for Meon Valley\ncllr. suzanne white\nWinchester District Councillor for Central Meon Valley\ncllr. danny lee\nWinchester District Councillor for Central Meon Valley\nCllr. Liam Bailey-morgan\nWinchester District Councillor for Colden Common & Twyford\nkate needham\nJoint Co-ordinator – Campaign Manager – Candidate for Whiteley & Shedfield\nMax Priesemann\nJoint Co-Ordinator – Candidate for Oliver’s Battery & Badgers Farm\nGiles Gooding\nTreasurer – Candidate for St.Paul, Winchester\nVirginia Ainscough\nPress & Communications Officer\nLorraine estelle\nCo-secretary – Candidate for St.Barts, Eastgate, General Election candidate 2024\nEvelyn Parker\nCo-Secretary Co-Founder Campaigner\nLuke ainscough\nDatabase and Data Protection Officer\nRichard Cannon\nWebmaster – Social Media\ncandidates (city council 2024) and campaigners\nPolly Perry\nCampaigner and Candidate Upper Meon Valley (2023)\nRichard Needham\nCampaigner and Candidate for St.Michael’s\nbeata parry\nCampaigner\nRob Parker\nCo-Founder and Campaigner\nJo Harmer\nCampaigner\nChris Gilham\nCampaigner\nElizabeth Riley\nCandidate Denmead\nCassie Westley\nCampaigner\ncarol pusey\nCampaigner\njulz hallmann\nCampaigner\nimogen hart\nCampaigner\nDave Westley\nCandidate for Alresford & Itchen Valley\nCharlotte Harley\nCampaigner and candidate for St. Barnabas\nJenny Stables\nCampaigner\nNigel Prior\nCampaigner\nlucinda graham\nCandidate Colden Common and Twyford\nhazel Agombar\nCampaigner\nmike perrott\nCampaigner – candidate for St. Luke\nJulia Stolle\nCampaigner\nDee Wright\nCampaigner\nDoug Stinton\nCampaigner\nandrew pogson\nCampaigner & candidate The Worthy’s\nFriedreich Priesemann\nCampaigner",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_12_01_winchester-city-council-pass-motion-to-call-for-ban-on-disposable-vapes/content_24.html": "At yesterday’s Council meeting, Winchester City Council passed a motion calling for the government to ban the sale and manufacture of disposable vapes by 2024. The motion was based on a Local Government Association initiative.\nCllr Malcolm Wallace, who supported the call for the ban, said, ‘Disposable vapes are an unsustainable product, so an outright ban is the best solution to the problem. They are very difficult to recycle without special treatment and so can end up littering our streets or going to landfill.’ A report by Material Focus in 2022 states that: 1.3 million single use vapes are thrown away every week or 5.4 million per month. While each vape contains just 0.15g of lithium, the scale of the waste means about 10 tonnes of the metal, equivalent to the batteries inside 1,200 electric vehicles, is ending up in landfills. As well as this, the vapes can be hazardous for waste collections as the lithium batteries can become flammable when crushed and cause bin lorry fires. Whilst the Council acknowledged the role vapes play in aiding adults to stop smoking, vapes are not risk free, especially to those who have never smoked. Cllr Danny Lee has been raising awareness about the effect vaping is having on children and young people. He states, ‘Several local parents have approached me with concerns about the health implications of vaping on their children. Many vapes are designed and marketed to appeal to children and we will continue to call for more regulation on the display and marketing of vaping products.’",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_alex-ellis/content_14.html": "Hampshire County Council-Bishop’s Waltham by-election 3 October 2024 / 4 October 2024 by richardcannon Your green party candidate, Alex Ellis The current County councillor for Bishops Waltham district has stepped down triggering a ‘snap’ by-election which will be held on Thursday 31st October. The division covers a wide area including Bramdean to the North, Colden Common to the West and Durley to the South. See map below for boundary. […] Read more » Alex Ellis Bishop's Waltham",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_5/content_48.html": "Winchester City Council Health and Environment Policy Committee mtg. 24 January 2024 / 23 January 2025 by richardcannon Next Wednesday 31st. January at 6.30pm Winchester City Council will be holding a meeting in the Walton Suite,, Winchester Guildhall to discuss the Hampshire Hospital Consultation. Full details of the meeting along with links to various documents can be found by going to the public website HERE Our Green Party Councillor Malcolm Wallace comments.. ‘This […] Read more » NHS\nPresentation ‘Active Travel’ 8 January 2024 / 10 August 2024 by richardcannon Reducing traffic for a better environment After the formalities and reports by Committee Role Players at our Annual General Meeting on the 3rd.January, we were delighted to welcome Emily Kerr, Oxford City Councillor for the St.Mary’s Ward who gave a very detailed and positive presentation on ‘Active Travel’. CLICK TO VIEW PRESENTATION You will see […] Read more »\nObjection to Bushfield Development Application 6 December 2023 / 10 August 2024 by richardcannon a copy of our full letter explaining the reasons for our objection Bushfield army camp, once an emergency measure in WW2 that returned to the Church Commissioners about 40 years later, has since been rewilding itself for nearly 45 years. There have been multiple attempts for developing this site until the newest proposal. The application […] Read more » Petitions\nWinchester pushes for Hampshire Pension Fund to move away from fossil fuels 3 December 2023 / 10 August 2024 by richardcannon Hampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by […] Read more » Danny Lee\nWinchester City Council pass motion to call for ban on disposable vapes 1 December 2023 / 10 August 2024 by richardcannon At yesterday’s Council meeting, Winchester City Council passed a motion calling for the government to ban the sale and manufacture of disposable vapes by 2024. The motion was based on a Local Government Association initiative. Cllr Malcolm Wallace, who supported the call for the ban, said, ‘Disposable vapes are an unsustainable product, so an outright ban is […] Read more » healthy living Malcolm Wallace\nClimate action for Newtown and Soberton joins the Winchester Climate Action Network 1 December 2023 / 10 August 2024 by richardcannon At a follow-up meeting to the recent Climate Café event, a group of Soberton and Newtown residents formed a new group. Climate Action for Newtown and Soberton (C.A.N.S), was born, with the main aim of reducing the carbon footprint of the parish. Looking at all the ideas suggested at the Climate Café, it was decided […] Read more » Newtown Soberton\nSaving our Chalk Streams 21 November 2023 / 10 August 2024 by richardcannon Globally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […] Read more » Danny Lee Malcolm Wallace\nSoberton Newtown Climate Cafe a great success 22 October 2023 / 10 August 2024 by richardcannon Stan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […] Read more » Danny Lee Newtown Soberton Suzanne White\nDeclaration of Nature Emergency for Winchester 23 September 2023 / 10 August 2024 by richardcannon Our Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023. Based on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by […] Read more » Danny Lee\nDelays to Winchester City Council’s local plan 19 August 2023 / 10 August 2024 by richardcannon Delay, delay, delay seems to be the story of the Winchester City Council’s Local Plan and was highlighted in an article appearing in the Hampshire Chronicle last week. See https://www.hampshirechronicle.co.uk/news/23725912.green-party-concern-winchester-city-councils-local-plan-delay/ In response, Green Party Councillor Danny Lee made the following statement.. “The council’s decision will mean lower environmental standards will continue for longer for all […] Read more » Danny Lee",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_3/content_19.html": "A walk around St.Clair’s Nature Reserve Soberton 18 July 2024 / 10 August 2024 by richardcannon Last week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton. The weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash […] Read more » Countryside Soberton\nElections 2024 green party votes winchester 9 July 2024 / 16 January 2025 by richardcannon For the first time Winchester District Green Party fielded a candidate in a General Election.Our candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages. Read more » Lorraine Estelle National Richard Needham\nThe Restore Nature Now march, London 28 June 2024 / 7 February 2025 by richardcannon nature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […] Read more » Countryside Farming and Agriculture Petitions Videos\nGreen Party Councillors test the water in the River Meon 27 June 2024 / 10 August 2024 by richardcannon Sunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows.. Read more » Danny Lee Droxford Malcolm Wallace Suzanne White\nGreen Party Winchester candidate Lorraine Estelle at the Hustings 27 June 2024 / 10 August 2024 by richardcannon Last weekend our candidate Lorraine Estelle attended the general election Hustings at Christ Church Winchester.Those attending were Flick Drummond (Conservative), Lorraine Estelle (Green Party), Hannah Dawson (Labour), Danny Chambers (LibDems) and Shaun Whelan (Reform UK). Read more » Lorraine Estelle\nCity Council by-election St. Michael’s 4th.july ’24 13 June 2024 / 10 August 2024 by richardcannon our green party candidate – richard needham Owing to the resignation of the sitting LibDem Councillor for St. Michael, a by-election has been called for on the same day as the General Election on Thursday 4th. July Richard writes.. I have lived in the heart of St Michael ward for almost 40 years, having first […] Read more » Richard Needham\nGreen Party announce 2024 manifesto 12 June 2024 / 10 August 2024 by richardcannon Carla Denyer and Adrian Ramsay write.. ‘Millions of people in our country are feeling insecure and deeply worried about the future. We live in one of the richest countries on the planet, yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and hospital […] Read more » National\nKate Needham to stand as candidate in Hamble Valley 10 June 2024 / 10 August 2024 by richardcannon The recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post). After the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing. Kate writes.. We are […] Read more » Hamble Valley Kate Needham\nWinchester & Hamble Valley general election constituency maps 4 June 2024 / 10 August 2024 by richardcannon Following national constituency boundary changes, below are maps showing the new / revised Winchester and Hamble Valley areas. You will see that some of the old Winchester boundary now comes under Hamble Valley. Click photos for larger size. winchester… hamble valley… ( Maps are open source from Ordnance Survey.. https://www.ordnancesurvey.co.uk/election-maps/gb/ ) Read more »\nWinchester District Green Party announce General Election Candidate 29 May 2024 / 10 August 2024 by richardcannon Lorraine Estelle campaigning for Real Hope and Real Change. The Green Party today announced their candidate for the Winchester constituency at the coming General Election. They have selected Lorraine Estelle. Lorraine said, “I am honoured to have been chosen as the Green Party’s candidate for Winchester. In recent years, more and more people have realised […] Read more » Lorraine Estelle",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_05_22_greening-campaign-receives-0-5m-boost-from-national-lottery-fund/content_34.html": "Following a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding.\nAs many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many people from afar and wide.\nThis will surely assist their good work further and benefit other local communities.\nPlease watch the video….\nThe full article can be found in the Hampshire Chronicle here >>\nRead more about the Greening Campaign on their website here >>\nHambledon Greening Camapign facebook page here >>>",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_08_04_visiting-rushmere-farm-hambledon/content_49.html": "Rushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative Green Party Walk and Talk meeting with our superb host, George Crossley, a young next generation farmer, taking over running his family farm alongside his parents.\nClick photo for full size The Rushmere Farm focus is organic farming and carbon neutrality. This is no mere experiment this is business and as such has to turn a profit, the family turned their back on chemical farming and after a few years have now, credit to them, succeeded. The hard facts are that in Britain only a few percent of farmers are organic farmers, George took risks, yields initially dropped, costs rose, but now those years of investment are paying off, with better more nutritious respected products, and a local landscape benefiting. The Crossley’s are leading the way, more will follow as we all better understand the threats to our environment, and the benefits of healthier better quality food. After years of hard work transforming from traditional farming, Rushmere Farm is now carbon negative and has been officially recognised for its organic produce.\nGeorge is a wonderful champion of green agro-ecology, as you’ll see in the photos he has visitors engaged with his informative in-the-field presentations and has pertinent facts and data mentally to hand. He happily answers all our questions. When asked what he would like to see or hear from our political representatives, George mentions better clear labelling of our food so customers understand what they are purchasing, and continued vital support to allow organic farmers to be competitive. Local Green Party Councillors Malcolm Wallace and Danny Lee were on hand to listen and learn. The farm though primarily agriculture, has diversified.\nWe met at the farms workshops where presentations, workshops, and all manner of related meetings are held. We then (we were warned to bring our wellies) are led out around and onto the fields. George stops regularly to tell us what we’re looking at. We saw crops growing alongside wild flower patches, the flower strips are home to insects that keep other crop attacking insects at bay. I was surprised to learn that these predator insects are quite territorial and don’t fly far, thus the reason for integrating wild flower homes alongside crops. We are shown areas that are rested, and had the yield reductions explained alongside the offset cost reduction of not having to use expensive chemicals. We’re led into woodland where a surprise meets us, a woodland workshop where people come together to build furniture and socialise, this also for refugees and asylum seekers in association with Friends Without Borders and the British Red Cross.\nGeorge was bombarded with questions, we all share his obvious passion for farming, food, and our environment. It was a rare pleasure to have our questions patiently answered whilst surrounded by wheat waving in the falling evening sun after a day of heavy downpours. School was never like this, but perhaps it should be? Then we’d all have a real appreciation for the quality of food on our plates, how it got there, and the champions and guardians of our countryside who deserve our respect and support. To learn more about Rushmere Farm, attend a tour, workshop, volunteer, or purchase their products please visit https://rushmerefarm.com/ Article by Stan Evans",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_9/content_62.html": "1 November 2022 / 30 May 2024 by richardcannon\nOur Stand at the Hampshire Youth Parliament meeting in Winchester Whilst visiting family in Yorkshire, Kate and Richard Needham helped out with a Fracking demonstration. Above we see Kate speaking to BBC Local Television Richard Needham proudly displays his huge owl. A mission indeed. Max Priesemann leading the way at the mass ‘Cycle Winchester’ day. […]\nRead more »\n14 October 2022 / 10 August 2024 by richardcannon\nThe meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […]\n11 August 2022 / 10 August 2024 by richardcannon\nA published letter to the Hampshire Chronicle A Firm grip on climate emergency Last week, on the same day that the temperature in the UK hit a record high, the High Court found the UK Governments climate strategy unlawful as it doesn’t show how the UK’s legally-binding carbon budgets (our net zero commitment) will be […]\n10 August 2022 / 10 August 2024 by richardcannon\nAfter an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […]\n12 July 2022 / 10 August 2024 by richardcannon\nWinchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […]\n10 May 2022 / 10 August 2024 by richardcannon\nMalcolm Wallace elected as Councillor for Central Meon Valley On the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor. The result was as follows.. Malcolm Wallace (Green) – 1,955 (55.49%) Linda Gemmell (Conservative) – 1,203 (34.14%) Gregory Joseph (LibDems) – 294 […]\n29 March 2022 / 10 August 2024 by richardcannon\nA letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […]\n10 February 2022 / 10 August 2024 by richardcannon\nCongratulations to Winchester Green Party Campaigner Malcolm Wallace and Anna Younger on being elected co-Chair of the South Eastern Green Party. Below is their remit and we have every confidence that both will represent us in an efficient and poisitive way. 1. The Chair of the Confederation shall chair SE Meetings or arrange for such […]\n22 January 2022 / 10 August 2024 by richardcannon\nFirst impressions Winchester Movement Strategy in it’s 5th year of consultations and studies Imagine the amount and effort that went into preparing studies after studies would have gone into real changes… But here we are once again – another consultation that does not deliver the urgent changes that are required to offer alternatives to car […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_6/content_83.html": "15 August 2023 / 10 August 2024 by richardcannon\nWinchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […]\nRead more »\n14 August 2023 / 10 August 2024 by richardcannon\naccelerating climate change ! Avington Oil Field taken from article at https://drillordrop.com/2023/07/13/south-downs-oil-field-to-restart-production/ Just recently the Prime Minister announced a raft of new oilfield drilling licences in the North Sea, which will fuel further climate destruction and do nothing to help tackle the cost-of-living crisis. The Intergovernmental Panel on Climate Change, the International Energy Agency and […]\n4 August 2023 / 10 August 2024 by richardcannon\nRushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative […]\nThe Railway Delivery Group have recently announced they are proposing a huge closure of ticket offices around the country. To see more, go to https://www.raildeliverygroup.com/uk-rail-industry/customer-focused-reform/customer-focused-stations Below is our response to this. By following the above link, you are able to ‘have your say’ as individuals. Public consultation has been extended to 1st.September 2023. our response.. […]\nPlease find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026. The full consultation documents can be found at the Hampshire County Council website HERE …….. 23rd July 2023 Dear Hampshire County Councillors, HAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION Winchester Green Party’s response to the consultation is […]\n7 July 2023 / 10 August 2024 by richardcannon\ngreen coffee morning On Saturday 1st.July., Richard and Kate Needham’s garden was opened up for Members and Supporters to come along and enjoy chit chat, coffee and cakes. Donations, which amounted to just over £60, will go towards forthcoming election campaigns. walk and talk at winnall Replacing our normal monthly meeting, on Wednesday 5th.July., we […]\n9 June 2023 / 10 August 2024 by richardcannon\nFollowing the announcement that Caroline Lucas will not be re-standing as a candidate for parliament in the next general election, I’m sure you will all join us in thanking Caroline for her truly inspiring work. “Caroline’s impact on politics in this country cannot be overstated: she truly is a force of nature and has been […]\n2 June 2023 / 10 August 2024 by richardcannon\nAs reported in the Hampshire Chronicle… Whilst walking through Winchester City Centre, Green Party Campaigner Richard Needham noticed that some council workers were using a well known weed killer which contains Glyphosates, banned by some councils across the country for harming human health and as a potential carcinogenic. Our co-chair Kate Needham instantly questioned the […]\n22 May 2023 / 10 August 2024 by richardcannon\nFollowing a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding. As many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many […]\n15 May 2023 / 10 August 2024 by richardcannon\nOnce again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May. On a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_05_15_hambledon-greening-festival-2023/content_64.html": "Once again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May.\nOn a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by Hambledon Art Group, the Repair Cafe, Electric car display and more, all whilst being entertained by a live band.\nOur Councillors Malcolm Wallace and newly elected Councillor Danny Lee were kindly invited to address the event. Video below plus photos.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_get-involved_recycle/content_50.html": "reducing waste and recycling\ncouncil collection\nGREEN BIN – clean paper, cardboard, food and drink cans, aerosols, plastic bottles without caps; NO OTHER PLASTIC\nBROWN BIN: garden waste only; currently a paid extra service. GLASS: monthly collection when crate supplied.\nGLASS: monthly collection when crate supplied.\nSMALLER ELECTRICAL GOODS/BATTERIES: bagged separately, placed on top of green or black bin. No light bulbs.\nBLACK BIN: household waste that is not recyclable – check for exceptions.\nat home\nFOOD WASTE: use a compost bin (eg ‘bokashi’ kitchen bin) or garden composter.\nother recycling\nTake to a recycling point: all recycling should be dry and clean. Some communities have cooperative schemes: consider starting or joining one.\nCOUNCIL RECYCLING CENTRES: keep up to date on what is recycled.\neg.. clean kitchen baking foil is accepted, light bulbs etc.\nSOFT PLASTIC/PACKAGING: many supermarkets are now recycling.\nHARD PLASTIC: Winchester is not yet recycling but Portsmouth Council operates collection points. Some garden centres recycle plant pots.\nFind (and book) your closest recycling centre in Hampshire…. CLICK HERE >>>\n___________________________________________________________________________________________",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_about-us_green-thought-archives/content_33.html": "Skip to content\nSkip to footer\nWinchester\nMenu\nNews\nAbout us\nAbout us\nHere to help\nGreen Thought Archives\nReducing waste and recycling\nOur Allotment Group\nPeople\nGet Involved\nNewsletters\nContact\nEvents\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nAbout us\nGreen Thought Archives\nGreen Thought Archives\ngreen thought newsletters 2009 – 2019\na look back at some of the events and actions we’ve been involved with over the years\nTo top",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_04_08_our-16-candidates-for-the-local-elections-on-thursday-4th-may/content_82.html": "16 wards – 16 candidates\nvote green\nClick candidate photos to view details\nRichard\nNeedham\nMax\nPriesemann\nRichard\nCannon\nDanny\nLee\nLucinda\nGraham\nBeata Parry\nLorraine\nAbraham\nCharlotte\nHarley\nReece\nChadwick\nKate\nNeedham\nGiles\nGooding\nNigel Prior\nPolly Perry\nNicholas John\nJulia Stolle\nAndrew\nPogson\nDue to the huge increase in our local Party’s popularity over the last few years, for 2023 we are able to field candidates in all 16 of the vacant wards.\n2022 saw our greatest success to date when the residents of Central Meon Valley ward elected Malcolm Wallace to become Winchester’s first ever Green Councillor.\nAll over the country, both in elections last May and by-elections since, the Green Party has grown from strength to strength with massive gains in various Councils. Unlike other Party’s our Leaders do not tell us how to vote, they tell us to vote for what is best for the community and it’s people.\nIn the last year Cllr. Malcolm Wallace has proved that a ‘Green in the Room’ does make a difference, No more are we the ‘also rans’, we are a Party proving ourselves to be the future voice for all.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon/content_6.html": "3 May 2025 / 3 May 2025 by richardcannon\nwinchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots !\nRead more »\n14 April 2025 / 14 April 2025 by richardcannon\nBoth candidates along with their strong teams out and about.. Lorraine has been busy calling in on residents and very active in arranging ‘vote green’ boards to go into peoples front gardens. Lorraine say’s “the response has been great and many people have expressed their enthusiasm to vote for change. Liam has also been very […]\n11 April 2025 by richardcannon\nIf you live in Hampshire, this weekend is your last chance to respond to the local consultation on the government’s Devolution White Paper for Hampshire and the Solent. Please have your say now! The Devolution White Paper has significant implications for formation of a new Mayor led Strategic Combined Authority for Hampshire and the Solent. […]\n31 March 2025 / 4 April 2025 by richardcannon\nhampshire county council by-election for winchester eastgate – lorraine estelle Lorraine has been a Green Party member for a number of years. Living in the St. Bartholomew area makes her central to see all the issues which arise in Winchester. Just recently, upon reading the breaking news that Southampton University had pulled out of redeveloping […]\n30 March 2025 / 31 March 2025 by richardcannon\nit’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […]\n21 March 2025 / 25 March 2025 by richardcannon\n‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […]\n5 March 2025 / 5 March 2025 by richardcannon\nAt a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing. Malcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and […]\n1 March 2025 / 18 March 2025 by richardcannon\nOn the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […]\n2 February 2025 / 7 February 2025 by richardcannon\nDelivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […]\n27 January 2025 / 29 January 2025 by richardcannon\nCarla Denyer MP Carla‘s amendment to the Renters Rights Bill on requiring landlords to make reasonable changes to make homes accessible for disabled people, prompted the Minister to agree to a cross-party meeting to discuss how the Government makes sure the law is strong enough. She spoke during a debate on the so called ‘Sunshine […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_contact/content_3.html": "General Enquiries / Feedback etc.\nCity and County Councillor Malcolm Wallace\nemail: mwallace@winchester.gov.uk\nFacebook page https://www.facebook.com/meonvalleygreenparty/\nCity Councillor Suzanne White\nemail: swhite3@winchester.gov.uk\nCity Councillor Danny Lee\nemail: dlee@winchester.gov.uk\nCity Councillor Liam Bailey-Morgan\nNewly elected (1st.May 2025) – official email to follow shortly\nMeon Valley Councillors facebook page https://www.facebook.com/meonvalleycouncillors/",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_11_09_winchester-local-plan/content_97.html": "Have your say: where and how houses will be built around winchester\nMalcolm Wallace with Danny Lee, local Green campaigner and contributor to the Local Plan Review\nWhilst development sites opposite the College in Swanmore and at Morgan’s Yard in Waltham Chase are included in the latest draft of the Winchester Local Plan (these sites were carried over from the 2013 Local Plan), following the intervention of local Parish Councils and Cllr Wallace, the requirement for additional development sites in Central Meon Valley has now been removed.\nAlong with specifying where new housing will be built across the district up to 2039, the Local Plan also sets out requirements for how the houses are built. Studies have shown that by 2050 England would use up 104% of the country’s entire carbon budget on just building houses if building follows a business-as-usual approach. Therefore, it is vitally important that how we build houses changes, both to minimise the carbon impact of the building itself plus the on-going impact from heating our homes.\nThe draft Winchester Local Plan is scheduled to come out for public consultation from 02-Nov to 14-Dec and everyone is encouraged to provide their feedback. A separate SDNP Local Plan is being updated that covers the South Downs National Park and important to remember 40% of Winchester District is in SDNP.\nThe updated SDNP Local Plan is expected to come out for public consultation next year.\nMalcolm says: “The draft Winchester Local Plan is now out for public consultation until 14-Dec . Please be sure to make your views count on this and on the separate South Downs National Park Local Plan due next year.”\nFind out more on the Winchester City Council website\ngood news For Swanmore & Waltham chase planning\nMalcolm’s efforts have helped remove planned developments that would harm the community. Following an intervention by Malcolm and the Parish Councils, the villages have been reclassified as “intermediate settlements” with lower housing allocations.\nWhilst the current development sites (opposite the College in Swanmore and at Morgan’s Yard in Waltham Chase) are carried over, NO new housing has been allocated in the Local Plan for Swanmore & Waltham Chase. This is a significant change from an earlier 100 houses to be added to both.\nHave your say: where and how houses will be built around winchester Green news MEON VALLEY\nMalcolm states: “Our villages have had a huge amount of development in the past decade.\nHowever, the changes we have managed to achieve mean less development pressure going forward and will bring enormous relief for local residents.”",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_get-involved/content_29.html": "volunteering to get more greens elected\nThe Winchester and District Green Party is 100% made up of volunteers – this is how we’ve been running for over 20 years. There is so much to do to win elections, we rely on volunteers and welcome your help.\nAny help you can give us, from delivering newsletters to making a donation, will make a real difference to getting more Greens elected in our District and County, so together we can fulfil our Green vision for a healthier, fairer, and affordable future for everyone.\nCould you help us with..\ndelivering newsletters & leaflets in your area\ncanvassing / speaking to voters\ndisplaying a poster in your window or garden\nmanning a stall in city centre\nattending action days\nany technical / digital skills\nTo find out more please email\ncontact@winchester.greenparty.org.uk\nmore reasons to join us\nTo find out more, please email contact@winchester.greenparty.org.uk",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_4/content_99.html": "7 May 2024 / 20 January 2025 by richardcannon\nThe County Council By-Election was only called at the last minute. This in turn meant a huge effort by our Volunteers to ensure the residents were well informed of our abilities by distributing leaflets and canvassing. With so many new homes being built in Whiteley, the task was a challenge, but we succeeded with time […]\nRead more »\n5 May 2024 / 16 January 2025 by richardcannon\nOur hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself. Requests for ‘Vote […]\n4 May 2024 / 6 February 2025 by richardcannon\nCentral meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […]\n22 April 2024 / 10 August 2024 by richardcannon\nOur Candidate, Cllr. Malcolm Wallace Malcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time.. […]\n20 April 2024 / 10 August 2024 by richardcannon\nLOCAL ENTERPRISES IN CENTRAL MEON VALLEY Councillor Danny Lee campaigning in Hambledon for Suzanne White as the next Winchester City Green Party Councillor and Malcolm Wallace as the first Green Party County Councillor for Hampshire County. During campaigning he chatted to the fabulous Hampshire Veg Box Director Chris Huskins to hear first hand about the […]\n20 April 2024 / 9 August 2024 by richardcannon\nA great morning spent in Whiteley distributing leaflets and speaking to residents about the forthcoming two elections on Thursday 2nd.May; Winchester City Council and a Hampshire County Council by-election for Meon Valley. Ably supported by friends from the East Hampshire Green Party and Test Valley Greens, we managed to cover a large area in and […]\n9 April 2024 / 10 August 2024 by richardcannon\nYour Green Party Candidates Please scroll down the page to see your Ward Dave Westley Alresford & Itchen Valley David joined the Green Party with a view to influencing a better ecological localised approachwhich in plain terms means a thriving environment that allows nature to take its course andbenefit all the community. At the moment […]\n7 February 2024 / 10 August 2024 by richardcannon\nwhy this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […]\nCouncillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area. A lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban […]\n29 January 2024 / 10 August 2024 by richardcannon\nOn Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure In the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact. To watch Cllr.Wallace’s statement, scroll through video […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_nature-wildlife/content_27.html": "9 December 2024 / 16 January 2025 by richardcannon\nA message from Caroline Lucas.. Back in May, in my last few months as MP, I secured a parliamentary debate on nature and biodiversity loss. It was the dying days of Sunak’s government, and amidst the chaos and election fever, I wanted to focus attention on the upcoming nature summit in Colombia. Because nature is […]\nRead more »\n10 September 2024 / 10 September 2024 by richardcannon\nA talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […]\n18 July 2024 / 10 August 2024 by richardcannon\nLast week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton. The weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash […]\n28 June 2024 / 7 February 2025 by richardcannon\nnature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […]\n27 June 2024 / 10 August 2024 by richardcannon\nSunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows..\n7 February 2024 / 10 August 2024 by richardcannon\nwhy this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […]\n6 December 2023 / 10 August 2024 by richardcannon\na copy of our full letter explaining the reasons for our objection Bushfield army camp, once an emergency measure in WW2 that returned to the Church Commissioners about 40 years later, has since been rewilding itself for nearly 45 years. There have been multiple attempts for developing this site until the newest proposal. The application […]\n23 September 2023 / 10 August 2024 by richardcannon\nOur Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023. Based on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by […]\n22 May 2023 / 10 August 2024 by richardcannon\nFollowing a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding. As many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many […]\n10 August 2022 / 10 August 2024 by richardcannon\nAfter an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_05_06_election23-photos-from-the-count/content_85.html": "Click photos to view full sizes\nRichard, Danny, Malcolm, Giles & Max\nGiles Gooding\nRichard Needham\nAndrew Pogson\nJulia Priesemann\nCelebrating the Central Meon Valley win\nRichard Cannon\nMalcolm, Giles and Max\nOur two Winchester Councillors !\nFriedrich & Julia Priesemann",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_06_12_green-party-announce-2024-manifesto/content_25.html": "Carla Denyer and Adrian Ramsay write..\n‘Millions of people in our country are feeling insecure and deeply worried about the future.\nWe live in one of the richest countries on the planet, yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and hospital and dentist appointments are like gold dust.\nMeanwhile, the climate emergency continues to accelerate. Scientists warn that we are currently on track for global temperatures to rise by at least 2.5°C, far beyond levels at which humanity can safely survive.\nOur promise to you is that all this can change. We can create a greener, fairer country together – one in which we are all safer, happier and more fulfilled.\nIt will take MPs prepared to make brave, principled choices on your behalf. And it will take the kinds of policies set out in this manifesto, for which elected Green MPs will fight hard every single day for you.\nVoting Green on 4th July is your way of showing you believe a fairer, greener world is possible – and is worth fighting for.’",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_malcolm-wallace_page_3/content_63.html": "What happens to your household waste and rubbish ? 19 November 2022 / 8 October 2024 by richardcannon Cllr Malcolm investigaTes Local recycling – says we can do better You do your part to help recycling by sorting your rubbish in different bins separating garden waste and taking your rubbish down to recycling centres. Waste Disposal teams empty our bins and take it all away from our doorstep’ But what happens next? Councillor […] Read more » Malcolm Wallace\n‘A firm grip on Climate Emergency’ Cllr. Malcolm Wallace speaks out. 11 August 2022 / 10 August 2024 by richardcannon A published letter to the Hampshire Chronicle A Firm grip on climate emergency Last week, on the same day that the temperature in the UK hit a record high, the High Court found the UK Governments climate strategy unlawful as it doesn’t show how the UK’s legally-binding carbon budgets (our net zero commitment) will be […] Read more » Malcolm Wallace\nPioneering Green Action to Protect our local Rivers and Waterways 12 July 2022 / 10 August 2024 by richardcannon Winchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […] Read more » Countryside Malcolm Wallace\nAn historic day for Winchester Green Party 10 May 2022 / 10 August 2024 by richardcannon Malcolm Wallace elected as Councillor for Central Meon Valley On the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor. The result was as follows.. Malcolm Wallace (Green) – 1,955 (55.49%) Linda Gemmell (Conservative) – 1,203 (34.14%) Gregory Joseph (LibDems) – 294 […] Read more » Central Meon Valley Malcolm Wallace\nNewly elected Co-Chairs for South East Greens 10 February 2022 / 10 August 2024 by richardcannon Congratulations to Winchester Green Party Campaigner Malcolm Wallace and Anna Younger on being elected co-Chair of the South Eastern Green Party. Below is their remit and we have every confidence that both will represent us in an efficient and poisitive way. 1. The Chair of the Confederation shall chair SE Meetings or arrange for such […] Read more » Malcolm Wallace",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_02_07_a-lack-of-affordable-housing-cllr-danny-lee-speaks-out/content_58.html": "Councillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area.\nA lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban areas.\nIf the Housing Strategy is to work closely with Parish Councils to locate sites across the district in line with housing demands then more action needs to be apparent.\nDefra’s ‘Unleashing Rural Opportunity’ approach by expanding the Rural Housing Enablers scheme can be a catalyst to unlock potential in rural areas and is therefore most welcome.\nThis support in tandem with opportunities to work with ACRE (Action with Communities in Rural England) is equally welcome. ACRE is a charity that supports initiatives to equip people with the knowledge, skills, and connections needed to improve local communities.\nThese helpful pathways reduce the barriers for Parish Councils and Winchester City Council to identify any rural housing demands under the Winchester Housing Strategy.\nLook forward to seeing the unleashing of any rural opportunities!\nSee the Hampshire Chronicle article here.. https://www.hampshirechronicle.co.uk/…/24098973…/…",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_5/content_98.html": "24 January 2024 / 23 January 2025 by richardcannon\nNext Wednesday 31st. January at 6.30pm Winchester City Council will be holding a meeting in the Walton Suite,, Winchester Guildhall to discuss the Hampshire Hospital Consultation. Full details of the meeting along with links to various documents can be found by going to the public website HERE Our Green Party Councillor Malcolm Wallace comments.. ‘This […]\nRead more »\n8 January 2024 / 10 August 2024 by richardcannon\nReducing traffic for a better environment After the formalities and reports by Committee Role Players at our Annual General Meeting on the 3rd.January, we were delighted to welcome Emily Kerr, Oxford City Councillor for the St.Mary’s Ward who gave a very detailed and positive presentation on ‘Active Travel’. CLICK TO VIEW PRESENTATION You will see […]\n6 December 2023 / 10 August 2024 by richardcannon\na copy of our full letter explaining the reasons for our objection Bushfield army camp, once an emergency measure in WW2 that returned to the Church Commissioners about 40 years later, has since been rewilding itself for nearly 45 years. There have been multiple attempts for developing this site until the newest proposal. The application […]\n3 December 2023 / 10 August 2024 by richardcannon\nHampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by […]\n1 December 2023 / 10 August 2024 by richardcannon\nAt yesterday’s Council meeting, Winchester City Council passed a motion calling for the government to ban the sale and manufacture of disposable vapes by 2024. The motion was based on a Local Government Association initiative. Cllr Malcolm Wallace, who supported the call for the ban, said, ‘Disposable vapes are an unsustainable product, so an outright ban is […]\nAt a follow-up meeting to the recent Climate Café event, a group of Soberton and Newtown residents formed a new group. Climate Action for Newtown and Soberton (C.A.N.S), was born, with the main aim of reducing the carbon footprint of the parish. Looking at all the ideas suggested at the Climate Café, it was decided […]\n21 November 2023 / 10 August 2024 by richardcannon\nGlobally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […]\n22 October 2023 / 10 August 2024 by richardcannon\nStan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […]\n23 September 2023 / 10 August 2024 by richardcannon\nOur Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023. Based on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by […]\n19 August 2023 / 10 August 2024 by richardcannon\nDelay, delay, delay seems to be the story of the Winchester City Council’s Local Plan and was highlighted in an article appearing in the Hampshire Chronicle last week. See https://www.hampshirechronicle.co.uk/news/23725912.green-party-concern-winchester-city-councils-local-plan-delay/ In response, Green Party Councillor Danny Lee made the following statement.. “The council’s decision will mean lower environmental standards will continue for longer for all […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_02_07_winchester-green-councillor-news-jan-23/content_89.html": "GREENS IN THE NEWS JANUARY !\nOur Green Party Councillor Malcolm Wallace has certainly made his mark since being elected last May. Here’s some links to articles he’s mentioned and quoted in over the last few weeks !\nArticle: Plans for dog walking paddock divide opinion in Meon Valley\nMalcolm voiced his opinion on plans for a dog walking paddock in Forest Road, Swanmore.\nHe said..”The potential noise impact has not been properly assessed and could have a significant impact on the quality of life/health and wellbeing of residents in neighbouring properties.” https://www.hampshirechronicle.co.uk/news/23220964.plans-dog-walking-paddock-divide-opinion-\nmeon-valley/\nArticle: New entrance allowed at Meon Valley business despite objections Malcolm said, “Lower Chase Road is narrow with no pavement. It is used by cyclists, horse riders and pedestrians including children going to the local secondary school .”https://www.hampshirechronicle.co.uk/news/23251287.new-entrance-allowed-meon-valley-\nbusiness-despite-objections/\nArticle: Winchester councillors agree new allowance for the coming year\nGreen party member Cllr Malcolm Wallace had concerns that the allowance dissuades younger people from becoming councillors, telling the meeting that the average age is 66.\nhttps://www.hampshirechronicle.co.uk/news/23266550.winchester-councillors-agree-new-\nallowance-coming-year/\nArticle: Winchester electric bus trial delayed due to worldwide shortage.\nOn discussion about the trial now taking place in Spring, Malcolm said “Traffic is the single largest source of greenhouse gas emissions in Winchester, with the latest data showing that transport makes up 57 per cent of all CO2 emissions in the district. The electric bus trial should be an exciting step towards decarbonising our public transport. Not only helping us to reduce our carbon footprint, but also improving local air quality. “However, a lot more is needed going forward. In their draft Local Transport Plan, Hampshire County Council stated that national policies on moving to zero emission vehicles won’t get us far enough quickly enough, and a 10 per cent reduction in car use is required between 2019 and 2030..\nAchieving this goal requires a coordinated response across all aspects of local transport (walking, cycling, trains and buses) to ensure that residents have improved options available for getting around. So, electric buses will be a step in the right direction, but there’s a long way to go.”\nhttps://www.hampshirechronicle.co.uk/news/23268293.winchester-electric-bus-trial-delayed-due-\nworldwide-shortage/\nArticle: Winchester City Council confirm carbon offsetting is last resort\nMalcolm said: “I have reservations over using the budget to offset carbon emissions. We need to cut our emissions as fast as we can. In order to do that, we need to invest in projects that make the biggest impact on our carbon emissions. Interventions range from more energy efficient homes and more electrical vehicle charging points. I urge the council to pause carbon offsetting and invest more\nin district-wide interventions.”\nhttps://www.hampshirechronicle.co.uk/news/23279487.winchester-city-council-confirm-carbon-\noffsetting-last-resort/\nArticle: Winchester car parks: More than £500,000 approved after vandalism\nhttps://www.hampshirechronicle.co.uk/news/23279439.winchester-car-parks-500-000-approved-vandalism/",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_local-election-candidates-2023/content_100.html": "winchester & district local council elections 2023\nyour green party candidates\nRichard Needham\nAlresford / Itchen Valley\nRichard joined the Green Party because of their policies to protect the environment and for social justice. He wants his children and grandchildren to grow up and enjoy a happy future and he believes that ‘The future is Green or not at all’.\nRichard grew up in a village and he understands the unique benefits and issues of village life. He is a keen environmental campaigner and would be a strong voice to speak up for local residents.\nMax Priesemann\nBadger Farm and\nOlivers Battery\nI enjoy living in Oliver’s Battery. It is a great place in Winchester close to the countryside.\nI care for our nature. We got given this planet to live and to protect it for future generations. Our wellbeing depends on it.\nYoung and old have suffered much from Covid pandemic, physically and mentally. As a doctor, I know that much more needs to be done for local people’s health.\nMy Oliver’s Battery junction was well supported but HCC have ignored it. We get effected by increasingly dangerous traffic. Streets are covered by a patchwork of potholes. We still only have 3 buses a week serving Olivers Battery. This needs to change.\nStop destroying nature with the wrong houses. We should build more council homes for those who can’t afford it, but only on real brownfield sites. Misuse of properties for investment purposes needs to be tackled.There is much to be done – Please vote for me!\nRichard Cannon\nBishop’s Waltham\nI moved to Bishop’s Waltham from Ashford in Kent five years ago.\nI am passionate about wildlife and nature and have seen the terrible demise in population of many creatures caused by poor agricultural policies, loss of habitat, woodland and climate change.\nBeing a keen walker and Wildlife Photographer has given me the pleasure of speaking to many people and to hear the many issues and concerns we have.\nRoad noise, pollution and safety are a priority issue along with ensuring local business’s are supported and our Countryside is maintained and improved where needed.\nOur Village, our County, our Country and Planet are in urgent need of environmental change and putting wrongs to rights. We must act now and the Green Party are the Party who will do just that, our many Councillors around the Country have been extremely successful in changing things for the good.\nDanny Lee\nCentral Meon Valley\nDanny has lived in Hampshire for more than 45 years and moved to Droxford in the Central Meon Valley two and\nhalf years ago. He welcomes challenging work and has the skills and experience needed to get things done. His expertise in leading large programmes and multi-national projects with diverse groups has successfully delivered challenging projects. This has been as a Royal Navy Officer, a sustainable design-and-build company Director, and with the Environment Agency.\nRecently he worked with the ‘Petersfield Action on Climate Change’ for the adoption of improved green building\nstandards which led to the creation of ‘Climate Change and Sustainable Construction’ supplementary guidance for the East Hampshire Local Plan.\nHe now works as a Citizens Advice advisor; a trustee for the ‘Winchester Action on the Climate Crisis’ and area co-ordinator for Energise South Downs – promoting community energy. These volunteering opportunities strengthen hisprevious experiences and ability to support the local community.\nDanny, if successful as a Winchester Green Party Councillor, looks forward to the opportunity to work for the\nresidents of Central Meon Valley and with Cllr Malcolm Wallace to strengthen an independent voice for the\ncommunity.\n________________________________________________________________________________________________________________\nLucinda Graham\nColden Common/Twyford\nLucinda was a teacher of art for many years. She now spends her free time working with clay, modelling figures for family members and friends. One such recent creation is a bust of Greta Thunberg, whom she admires for her astonishing bravery in speaking truth to power, a great source of hope to all like Lucinda who have long felt despair at the failure of governments to confront the looming Climate Crisis. Locally her concerns are for traffic-related air pollution, unsafe roads and the lack of safe provision for cyclists.\nLucinda is registered disabled and feels immensely grateful for the help she has had from the NHS, agencies such as the CAB and many friends. She sees this kind of fair and caring community as just an important part of the Green vision of the future as its commitment to the protection of Nature and the planet.\nBeata Parry\nDenmead\nI have been a resident of Swanmore since 2010. Before then I lived and raised my 5 children in the beautiful Blue Mountains, NSW Australia – an area declared as a World Heritage Site. Living in such a wonderful place inspired me to appreciate nature and wildlife and strive to protect it. I enjoy gardening – growing my own vegetables & fruit, using composting to help recycle waste and improve the soil, planting to provide friendly environments for wildlife. I am also a keen walker, observing the magic of seasonal changes & how it affects growth and habitats. Spending so much time outdoors made me realise how precious our planet is and how much it is changing. We all need to make more efforts to protect it. I feel strongly about reducing car pollution, eliminating chemicals from gardens & plastic in our homes. I am hoping to educate the next generations to reuse rather than buy new, recycle what we already have and reduce the amount of plastic, artificial fibres, etc. in everyday use. I believe the Green Party is the only party fully committed to make these changes.\nLorraine Abraham\nSt. Barnabas\nI have never stood as a candidate before, but I am inspired to do so now. As a grandmother I think about the future and the significant environment and climate challenges we all face, both local and\nglobal. The scale of these problems can seem daunting, but I seeGreen Councillors across the country working to improve the environment and the lives of people in their communities. Listening\nto people in Winchester, I hear concerns about our throw away culture and that they are keen to see local initiatives to reduce waste and encourage reuse. They want to see greater action to enable\nwalking, cycling and viable public transport and the use of more affordable renewable energy. By listening to local people andworking through our political system the Green Party can contribute\nto real change on these vital and urgent issues.\nCharlotte Harley\nSt. Bartholomew\nAs a member of the Green Party since 2019 and having grown up in Winchester, Charlotte is passionate about putting Green issues at the forefront of council policies.\nHer priority is to ensure that new buildings and developments are designed with the environment and local community front of mind. Charlotte is committed to ensuring that families and young people have access to safe green spaces and that these are protected and maintained.\nHer focus is implementing sustainable changes that will create a greener city and thriving community, with a commitment to the natural world and future generations\nReece Chadwick\nSt. Luke\n‘I have lived in Winchester almost half a decade now. The issues my neighbours have, I too share, and like them, I am also frustrated by how our council and councillors have neglected the people it serves.\nThe reason for why I have decided to run for councillor of St.Luke’s ward is because like my neighbours, I also want change and for the people we elect to be more community orientated and to do things for the benefit of every one of us.\nAll I care about is creating a happier, better, and safer community for each and every one of us’\nKate Needham\nSt.Michael\nWe are in a climate and biodiversity emergency. Local services have been cut and we have lost so much. I worry about what the future will be like for my grandchildren. I would like them to be able to paddle in the sea and local streams without fear of becoming sick. I’d like them to breathe cleaner air and be surrounded by more green spaces and nature. To be able to cycle more safely and to be able to afford to live here when they are older. We need to vote more greens into positions of power and influence in order to take action now for a greener, fairer world and a future we can all look forward to.\nGiles Gooding\nSt. Paul\nI have lived in Fulflood for more than 20 years and have been actively involved in the local community for most of this time.\nI volunteer with the Winchester Scouts and campaign on green issues with Friends of the Earth, WinACC and GreeningFulflood and also launched FreecycleWinchester in 2006.\nThe City of Winchester is choked by cars affecting the heath of its residents and visitors. Much has been promised to reduce traffic but little has been delivered.\nThe Council needs to increase its Green Voice to get the Movement Strategy back on track and prioritise pedestrians and bicycles over cars. I want to seea cleaner, healthier, fairer Winchester for all.\nNigel Prior\nSouthwick & Wickham\nI live in Wickham now and have been a part of this community for nearly two decades. I carry out several volunteer roles in the south Hampshire area and have done so for a decade or more.\nI care about our communities. Rural, village, town and city life in our area are all under threat as we continue to expand our presence, building more and more houses and roads on our vital green spaces. I am, I believe fairly well known across the Winchester district and until recent years have tried to stay ‘A’ political.\nHowever the damage we as human beings have done to this our one and only planet has drawn me towards environmental responsibility, equality, justice and solving the total disgrace that has become of our vital public services due to continued underfunding over the past 13 years.\nBuilding a safer environment for all is now my passion. Reducing our CO2 emissions and general impact on the planet is now critical to our survival as a human race.\nPolly Perry\nUpper Meon Valley\nI am trustworthy and reliable and love making a difference to people’s lives. I’m hardworking, a good communicator and ready to speak up for what’s right. My business is based in Bramdean, so I spend much time walking in the beautiful countryside around there.\nIt is really important to me that our countryside is protected from unnecessary overdevelopment and that our chalk streams (which are the envy of the world) are protected from issues with raw sewerage and pollution. As Council budgets are cut, I want to make sure that available funds are directed fairly towards providing and maintaining the services we need in often forgotten rural areas. We must think of the future!\nNicholas John\nWhiteley & Shedfield\nWhen we practice sustainability in our daily lives, it impacts positively on our own wellbeing as well as the workplace -meaning that personal wellbeing and environmental sustainability need not be mutually exclusive goals it should be shared.\nMy interest as a Green party member is to bring bold and innovative solutions to reduce waste and eco friendly solutions to the workplace and home. More than ever its about our wellbeing something politicians constantly over look, we need to reduce cars, plant more trees and join the Green Party the only party thatscares for our wellbeing.\nJulia Stolle\nWonston / Micheldever\nJulia Stolle has been living in Hampshire with her family for 2 decades. Like you, she loves her walks in the beautiful countryside but is concerned about the lack of public infrastructure, the increasing air pollution caused by the dependency on cars, increased risk of flooding due to overdevelopment and the underfunding of our schools, hospitals, and doctor surgeries.\nCurrent politicians still believe that more roads will be the answer when more roads only create more\ntraffic. A truly frequent and affordable public transport network is required so that people don’t have to travel by car anymore. Making cycling and walking safer will also help with mental health issues.\nJulia believes that insulating our homes, investing in green technology and subsidising solar panels on people’s homes will bring energy prices down and will create a fairer and more equal society.\nAndrew Pogson\nThe Worthys\nI have been interested in Green Polices and Politics since studying Meteorology at University.\nI moved to Kings Worthy three years ago and since then I’ve spent many hours exploring the wonderful surrounding countryside alongside my two Labradors.\nEven in this short time I have seen many changes that are concerning to me. The challenge of building for a sustainable future is particularly relevant here, where we must find ways to preserve our city’s heritage and natural environment.\nBy thinking more long term and planning with the bigger picture in mind. We can protect our local environment, boost our local economy and improve peoples quality of life. That is why I am proud to represent the Green Party this May.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_11_01_october-photos-22/content_40.html": "Our Stand at the Hampshire Youth Parliament meeting in Winchester\nWhilst visiting family in Yorkshire, Kate and Richard Needham helped out with a Fracking demonstration. Above we see Kate speaking to BBC Local Television\nRichard Needham proudly displays his huge owl. A mission indeed.\nMax Priesemann leading the way at the mass ‘Cycle Winchester’ day.\nGiles Gooding leading the way in tech for our first combined head to head and zoom Member’s Meeting\nOur fine leaflet and food display at the meeting !\nKate, Richard Needham and Jo Harmer out and about doing grand work with our 60 second Survey’s\nCllr. Malcolm Wallace at Waltham Chase St. John the Baptist’s School seeking new members for the road safety committee and distributing leaflets\nMax Priesemann out distributing Newsletters in deep Meon Valley\n[wpforms id=”998″]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_8/content_86.html": "Out and about January 2023 31 January 2023 / 10 August 2024 by richardcannon A selection of photos ahowing some of our Team's activities during January, plus a video of Cllr. Malcolm Wallace delivering his successful motion to ban future fracking in Winchester Read more » People\nElectric buses coming to Winchester 27 January 2023 / 10 August 2024 by richardcannon After some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […] Read more » healthy living Malcolm Wallace\nCllr. Malcolm Wallace acts to prevent fracking 26 January 2023 / 10 August 2024 by richardcannon At the Winchester City Council meeting earlier this week, Councillors voted to:1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.2) To respond to the County Council’s consultation on the refreshed Minerals andWaste Plan stating our opposition the extraction of oil and gas, including by fracking. Cllr Wallace stated: […] Read more » Countryside Malcolm Wallace\nThe Protected Landscapes Programme 26 January 2023 / 10 August 2024 by richardcannon Funding available to support local farming communities and our environment. Local Green Party Councillor supports Defra’s Farming in Protected Landscapes programme. Article by Stan Evans Local Meon Valley based Green Party Councillor, Malcolm Wallace stated : ”I’d like to remind our friends in the farming and land management community that Defra’s, Farming in Protected Landscapes […] Read more » Countryside Farming and Agriculture\nThe £2 Bus Fare Cap 10 January 2023 / 10 August 2024 by richardcannon max priesemann writes.. A single bus ticket price cap of £2 is very welcome! Unfortunately only until End of March. End of 2022 a Stagecoach Single ticket from Winchester to places like West Meon, Cheriton, Arlesford or Romsey cost £5.90. A Bluestar Single between Southampton and Winchester cost as much a £7. From 1st of […] Read more » Max Priesemann\nOut and about December ’22 23 December 2022 / 10 August 2024 by richardcannon Rain, wind, snow, warm, cold and whatever else, nothing stops our hard working members getting about to spread the Green message Beata Parry, Danny Lee and Kate Needham busy around the Meon Valley Danny Lee asking Swanmore residents to fill out our short 60 second survey ‘Green Drinks’ at the Black Boys Pub in Winchester […] Read more » People\nGreens in Action – November 2022 29 November 2022 / 10 August 2024 by richardcannon ‘have your say’ Surveys Kate Needham and Doug Stanton in Swanmore and Waltham Chase Kate Needham and Richard Cannon in Soberton Photos from our Stall in Winchester.. Chris Gilham Rob Parker Richard Needham Doug Stanton Max Priesemann (right) Richard and Kate Needham Rupert Pitt Enjoying a get together in the Open House Deli Read more » People\nWhat happens to your household waste and rubbish ? 19 November 2022 / 8 October 2024 by richardcannon Cllr Malcolm investigaTes Local recycling – says we can do better You do your part to help recycling by sorting your rubbish in different bins separating garden waste and taking your rubbish down to recycling centres. Waste Disposal teams empty our bins and take it all away from our doorstep’ But what happens next? Councillor […] Read more » Malcolm Wallace\nOur Climate Justice Stand in Winchester 12th. November a great success 13 November 2022 / 10 August 2024 by richardcannon We set up our ‘Climate Justice’ & ‘Seven Demands for the UK Government’ Stand at the Buttercross on a very busy Winchester shopping day and were pleased to receive so much attention plus response from passers by. Beside giving out a substantial number of leaflets and speaking to people, we also set up a board […] Read more » Petitions\nCllr. Malcolm Wallace urges all residents to review local plan update 9 November 2022 / 30 May 2024 by richardcannon Have your say: where and how houses will be built around winchester Malcolm Wallace with Danny Lee, local Green campaigner and contributor to the Local Plan Review Whilst development sites opposite the College in Swanmore and at Morgan’s Yard in Waltham Chase are included in the latest draft of the Winchester Local Plan (these sites […] Read more »",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_national/content_21.html": "January updates from our Greens in Parliament 27 January 2025 / 29 January 2025 by richardcannon Carla Denyer MP Carla‘s amendment to the Renters Rights Bill on requiring landlords to make reasonable changes to make homes accessible for disabled people, prompted the Minister to agree to a cross-party meeting to discuss how the Government makes sure the law is strong enough. She spoke during a debate on the so called ‘Sunshine […] Read more » National\nGreen Party criticises the Government White Paper on English Devolution for Local Government reorganisation! 18 December 2024 / 16 January 2025 by richardcannon The National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […] Read more » Danny Lee Malcolm Wallace National Suzanne White\nNovember Updates from our greens in parliament 2 December 2024 / 2 December 2024 by richardcannon Carla Denyer MP Carla proposed and spoke in favour of several amendments to the Renters’ Rights Bill, including in support of rent controls, as a member of the committee looking at the legislation in detail. She and Siân have also tabled an Early Day Motion in support of funding a 4 Day Working Week pilot trial […] Read more » National\nElections 2024 green party votes winchester 9 July 2024 / 16 January 2025 by richardcannon For the first time Winchester District Green Party fielded a candidate in a General Election.Our candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages. Read more » Lorraine Estelle National Richard Needham\nGreen Party announce 2024 manifesto 12 June 2024 / 10 August 2024 by richardcannon Carla Denyer and Adrian Ramsay write.. ‘Millions of people in our country are feeling insecure and deeply worried about the future. We live in one of the richest countries on the planet, yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and hospital […] Read more » National\nGreen Party Leaders pay tribute to Caroline Lucas 9 June 2023 / 10 August 2024 by richardcannon Following the announcement that Caroline Lucas will not be re-standing as a candidate for parliament in the next general election, I’m sure you will all join us in thanking Caroline for her truly inspiring work. “Caroline’s impact on politics in this country cannot be overstated: she truly is a force of nature and has been […] Read more » National",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_recycling/content_35.html": "8 October 2024 / 8 October 2024 by richardcannon\nCLICK IMAGE TO READ IN FULL..\nRead more »\n19 November 2022 / 8 October 2024 by richardcannon\nCllr Malcolm investigaTes Local recycling – says we can do better You do your part to help recycling by sorting your rubbish in different bins separating garden waste and taking your rubbish down to recycling centres. Waste Disposal teams empty our bins and take it all away from our doorstep’ But what happens next? Councillor […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_city-council_page_3/content_76.html": "6 March 2023 / 10 August 2024 by richardcannon\nWinchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […]\nRead more »\n7 February 2023 / 10 August 2024 by richardcannon\nGREENS IN THE NEWS JANUARY ! Our Green Party Councillor Malcolm Wallace has certainly made his mark since being elected last May. Here’s some links to articles he’s mentioned and quoted in over the last few weeks ! Article: Plans for dog walking paddock divide opinion in Meon Valley Malcolm voiced his opinion on plans […]\n27 January 2023 / 10 August 2024 by richardcannon\nAfter some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […]\n26 January 2023 / 10 August 2024 by richardcannon\nAt the Winchester City Council meeting earlier this week, Councillors voted to:1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.2) To respond to the County Council’s consultation on the refreshed Minerals andWaste Plan stating our opposition the extraction of oil and gas, including by fracking. Cllr Wallace stated: […]\n10 May 2022 / 10 August 2024 by richardcannon\nMalcolm Wallace elected as Councillor for Central Meon Valley On the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor. The result was as follows.. Malcolm Wallace (Green) – 1,955 (55.49%) Linda Gemmell (Conservative) – 1,203 (34.14%) Gregory Joseph (LibDems) – 294 […]\n29 March 2022 / 10 August 2024 by richardcannon\nA letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […]\n22 January 2022 / 10 August 2024 by richardcannon\nFirst impressions Winchester Movement Strategy in it’s 5th year of consultations and studies Imagine the amount and effort that went into preparing studies after studies would have gone into real changes… But here we are once again – another consultation that does not deliver the urgent changes that are required to offer alternatives to car […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_lorraine-estelle-2/content_68.html": "By-election results and count in photos 3 May 2025 / 3 May 2025 by richardcannon winchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots ! Read more » #Liam-Bailey-Morgan #Lorraine-Estelle",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_07_07_members-and-supporters-enjoying-the-summer-sun/content_70.html": "green coffee morning\nOn Saturday 1st.July., Richard and Kate Needham’s garden was opened up for Members and Supporters to come along and enjoy chit chat, coffee and cakes. Donations, which amounted to just over £60, will go towards forthcoming election campaigns.\nwalk and talk at winnall\nReplacing our normal monthly meeting, on Wednesday 5th.July., we met up for an evening’s light stroll around the beautiful Winnall Nature Reserve followed by drinks at the Willow Tree PH…\nNext year will see some local Council elections in the Winchester District, County Council elections and the strong possibility of a General Election (if not sooner!).\nTo ensure our district has the opportunity of seeing and hearing what your local Party stands for, we need to give strong messages through Newsletters.\nThe Green Party does not receive huge donations from companies, it relies on the generosity of Members and Supporters.\nIf you are able to help, either through donating or getting involved with newsletter distribution, please go to the following pages..\n‘Get Involved’ and ‘‘Donate’.\nYour help is very much appreciated, we have achieved having electing two Councillors in the last two elections and their contribution has shown that the green message is an important one to our environment and way of life.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_01_08_presentation-active-travel/content_45.html": "Reducing traffic for a better environment\nAfter the formalities and reports by Committee Role Players at our Annual General Meeting on the 3rd.January, we were delighted to welcome Emily Kerr, Oxford City Councillor for the St.Mary’s Ward who gave a very detailed and positive presentation on ‘Active Travel’.\nYou will see from the attached Presentation file what they have achieved so far and their ambitions for the future, mainly to reduce car traffic in the City by 25% with a target date of 2030.\nOxford has six Green Party Councillors and the Presentation showed precisely what Greens can do for a better environment, as they have done and will do in Winchester !\nWith our City Council elections just round the corner, if you would like to help us achieve more Councillors, please look at the ‘Get Involved’ page on this website.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_08_19_delays-to-winchester-city-councils-local-plan/content_80.html": "Delay, delay, delay seems to be the story of the Winchester City Council’s Local Plan and was highlighted in an article appearing in the Hampshire Chronicle last week. See https://www.hampshirechronicle.co.uk/news/23725912.green-party-concern-winchester-city-councils-local-plan-delay/\nIn response, Green Party Councillor Danny Lee made the following statement..\n“The council’s decision will mean lower environmental standards will continue for longer for all developments until the end of 2025. It was expected the new plan would originally be in place from August 2024. All developments, including large developments, will continue to be assessed against the current Local Plan.\n“The very high public response rate to last year’s consultation for the draft new Winchester Local Plan in combination with a raft of new Government legislation has led to this decision by the council.\n“This difficult position is beyond helpful in the face of the current climate, nature and economic crises with the urgent need for developments in the right places to better environmental standards.\n“A key question now is, can more rigorous environmental requirements be applied to developments before the delayed new Local Plan is approved by Central Government? After all, it is not impossible to find ourselves in a similar delaying situation in 2025 for reasons beyond the council’s control.”\nRest assured that both our Councillors, Danny and Malcolm Wallace, will be following this through, our City and surrounding area deserve to know what lies ahead.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_12_01_climate-action-for-newtown-and-soberton-joins-wecan/content_13.html": "At a follow-up meeting to the recent Climate Café event, a group of Soberton and Newtown residents formed a new group. Climate Action for Newtown and Soberton (C.A.N.S), was born, with the main aim of reducing the carbon footprint of the parish.\nLooking at all the ideas suggested at the Climate Café, it was decided to form several subgroups to get started on some community projects. An Energy subgroup will be looking into the possibility of getting a thermal imaging camera to hire to locals to help them identify ways to improve the energy efficiency of their homes. Some of the group will also attend some training to learn how to carry out feasibility studies for community energy projects in the village. A Waste Prevention group will start by helping local event organisers minimise and manage waste. Finally, a Biodiversity group will extend the work already started in the village of improving the diversity of wildflowers on the roadside verges. It will be interesting to see over the coming months how the projects develop.\nClick here to view the Climate action for Newtown and Soberton facebook page",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2023_11_21_saving-our-chalk-streams/content_32.html": "Globally there are just 210 classified as Chalk Streams and of those 160 are found in England.\nHere in Hampshire we can boast three; The Rivers Meon, Itchen and Test.\nOur Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford\nWith the Rivers Meon and Itchen flowing within the Winchester City Council borders it is imperative to our countryside, nature and wildlife that these are not only maintained but improved.\nEven though many things have been said about the pollution and the effect it’s having, we like many organizations are strongly opposed to the recent Government Statement that our rivers will not be healthy until 2063!\nOur Councillors Malcolm Wallace and Danny Lee along with all our members are passionate about our environment and that action should be a priority.\nTake Action !\nThis link.. https://action.wildlifetrusts.org/page/132534/action/1?locale=en-GB\nwill take you to the Wildlife Trusts website page where you can read more about Chalk Streams and the opportunity to write to your MP asking them to be a Champion for this cause.",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news/content_9.html": "By-election results and count in photos 3 May 2025 / 3 May 2025 by richardcannon winchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots ! Read more » #Liam-Bailey-Morgan #Lorraine-Estelle\ngaining momentum in Winchester Eastgate and colden common / twyford by-elections 14 April 2025 / 14 April 2025 by richardcannon Both candidates along with their strong teams out and about.. Lorraine has been busy calling in on residents and very active in arranging ‘vote green’ boards to go into peoples front gardens. Lorraine say’s “the response has been great and many people have expressed their enthusiasm to vote for change. Liam has also been very […] Read more »\nLast chance to comment on Government’s White Paper on devolution 11 April 2025 by richardcannon If you live in Hampshire, this weekend is your last chance to respond to the local consultation on the government’s Devolution White Paper for Hampshire and the Solent. Please have your say now! The Devolution White Paper has significant implications for formation of a new Mayor led Strategic Combined Authority for Hampshire and the Solent. […] Read more »\nOur candidates for two by-elections on 1st.May 2025 31 March 2025 / 4 April 2025 by richardcannon hampshire county council by-election for winchester eastgate – lorraine estelle Lorraine has been a Green Party member for a number of years. Living in the St. Bartholomew area makes her central to see all the issues which arise in Winchester. Just recently, upon reading the breaking news that Southampton University had pulled out of redeveloping […] Read more »\nwe asked local residents for views on the river park leisure centre’s future 30 March 2025 / 31 March 2025 by richardcannon it’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […] Read more » healthy living Leisure Lorraine Estelle Winchester City\nWinchester Greens on the Web 21 March 2025 / 25 March 2025 by richardcannon ‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […] Read more » Central Meon Valley Danny Lee Malcolm Wallace Meon Valley Suzanne White\nGreen motion commits Council to explore solar for council housing. 5 March 2025 / 5 March 2025 by richardcannon At a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing. Malcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and […] Read more » Malcolm Wallace Suzanne White\nwinchester action on the climate crisis – denmead community centre 1 March 2025 / 18 March 2025 by richardcannon On the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […] Read more » CLIMATE-JUSTICE Denmead Suzanne White\nA busy start to the year for winchester greens 2 February 2025 / 7 February 2025 by richardcannon Delivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […] Read more » Danny Lee Malcolm Wallace Meon Valley People Suzanne White\nJanuary updates from our Greens in Parliament 27 January 2025 / 29 January 2025 by richardcannon Carla Denyer MP Carla‘s amendment to the Renters Rights Bill on requiring landlords to make reasonable changes to make homes accessible for disabled people, prompted the Minister to agree to a cross-party meeting to discuss how the Government makes sure the law is strong enough. She spoke during a debate on the so called ‘Sunshine […] Read more » National",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_elections_page_2/content_81.html": "29 May 2024 / 10 August 2024 by richardcannon\nLorraine Estelle campaigning for Real Hope and Real Change. The Green Party today announced their candidate for the Winchester constituency at the coming General Election. They have selected Lorraine Estelle. Lorraine said, “I am honoured to have been chosen as the Green Party’s candidate for Winchester. In recent years, more and more people have realised […]\nRead more »\n5 May 2024 / 16 January 2025 by richardcannon\nOur hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself. Requests for ‘Vote […]\n4 May 2024 / 6 February 2025 by richardcannon\nCentral meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […]\n22 April 2024 / 10 August 2024 by richardcannon\nOur Candidate, Cllr. Malcolm Wallace Malcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time.. […]\n9 April 2024 / 10 August 2024 by richardcannon\nYour Green Party Candidates Please scroll down the page to see your Ward Dave Westley Alresford & Itchen Valley David joined the Green Party with a view to influencing a better ecological localised approachwhich in plain terms means a thriving environment that allows nature to take its course andbenefit all the community. At the moment […]\n9 May 2023 / 10 August 2024 by richardcannon\n18 months ago Hampshire had no District Councillors elected. Fast forward to May 2023, we now have ten ! In addition, the Isle of Wight has 2. Here are the details..Basingstoke and Deane, 1 – Michael Howard-SorrellEast Hampshire, 2 – James Hogan & Ian JamesHavant, 1 – Grainne RasonNew Forest, 3 – Neil Millington, Adam […]\n7 May 2023 / 10 August 2024 by richardcannon\nAlresford and Itchen Valley Russell Gordon-Smith (Lib Dem) 2,034 Harry Johnson-Hill (Con) 1,187 Richard Needham (Green) 164 Tessa Valentine (Labour) 74 Majority: 847 Turnout: 40% Bishop’s Waltham Jonathan Williams (Lib Dem) 1,618 Donald Iro (Con) 1,022 Richard Cannon (Green) 232 Steve Haines (Labour) 113 Majority: 596 Turnout: 45% Denmead Paula Langford-Smith (Con) 1,035 Michael Bennett […]\n6 May 2023 / 10 August 2024 by richardcannon\nClick photos to view full sizes Time out in the Cafe Richard, Danny, Malcolm, Giles & Max Giles Gooding Richard Needham Andrew Pogson Julia Priesemann Celebrating the Central Meon Valley win Richard Cannon Malcolm, Giles and Max Our two Winchester Councillors ! Friedrich & Julia Priesemann\n25 April 2023 / 10 August 2024 by richardcannon\nWith more than double the volunteers compared to last year, we’ve been busy distributing leaflets, letters and meeting people listening to any issues they may have and outline our ambitions for the future Add to that we’ve nearly trebled the requests for ‘Vote Green’ boards’ throughout the Meon Valley and some in the city itself. […]\n8 April 2023 / 10 August 2024 by richardcannon\n16 wards – 16 candidates vote green Click candidate photos to view details Richard Needham Alresford and Itchen Valley >> Max Priesemann Alresford and Itchen Valley >> Richard Cannon Bishop’s Waltham Danny Lee Central Meon Valley >> Lucinda Graham Colden Common & Twyford Beata Parry Denmead Lorraine Abraham St. Barnabas Charlotte Harley St. Bartholomew Reece […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_tag_farming-and-agriculture/content_8.html": "The Restore Nature Now march, London 28 June 2024 / 7 February 2025 by richardcannon nature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […] Read more » Countryside Farming and Agriculture Petitions Videos\nVisiting Rushmere Farm Hambledon 4 August 2023 / 10 August 2024 by richardcannon Rushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative […] Read more » Countryside Farming and Agriculture\nThe Protected Landscapes Programme 26 January 2023 / 10 August 2024 by richardcannon Funding available to support local farming communities and our environment. Local Green Party Councillor supports Defra’s Farming in Protected Landscapes programme. Article by Stan Evans Local Meon Valley based Green Party Councillor, Malcolm Wallace stated : ”I’d like to remind our friends in the farming and land management community that Defra’s, Farming in Protected Landscapes […] Read more » Countryside Farming and Agriculture",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_12_23_photo-december-22/content_95.html": "Rain, wind, snow, warm, cold and whatever else, nothing stops our hard working members getting about to spread the Green message\nBeata Parry, Danny Lee and Kate Needham busy around the Meon Valley\nDanny Lee asking Swanmore residents to fill out our short 60 second survey\n‘Green Drinks’ at the Black Boys Pub in Winchester\nDanny Lee finding potholes around and about.\nDanny Lee joined by Cllr.Malcolm Wallace for a stroll along the River Meon.\nMax Prieseman delivering in Warnford with a backdrop of iced apples !\n‘Green Chat’ morning at the Open House Deli, Winchester",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2024_09_10_members-supporters-open-meeting-the-importance-of-chalk-streams/content_54.html": "A talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond\nKate Needham writes..\nThere was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given a score. The net is used in 6 different areas of a section of river including both edges.\n15 seconds for each dip and also under rocks. You have to slightly disturb the riverbed and hold the net downstream then fish out any twigs, leaves and so on. Then put the creatures caught in a tray of water so they can be fished out with a spoon, looked at closely using a magnifying glass and placed in a circular sorting tray with handy identification diagrams for each section.\nThen the score for each type of creature collected are added up which is a good indicator of the health of the river. Like canaries in a coal mine. The data is collected and analysed. There are various other methods but that is what we had a go at. It’s quite addictive!",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_2022_11_29_photos-november-2022/content_92.html": "‘have your say’ Surveys\nKate Needham and Doug Stanton in Swanmore and Waltham Chase\nKate Needham and Richard Cannon in Soberton\nPhotos from our Stall in Winchester..\nChris Gilham\nRob Parker\nRichard Needham\nDoug Stanton\nMax Priesemann (right)\nRichard and Kate Needham\nRupert Pitt",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_events_page_2/content_93.html": "15 May 2023 / 10 August 2024 by richardcannon\nOnce again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May. On a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by […]\nRead more »\n12 March 2023 / 10 August 2024 by richardcannon\nFollowing a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we […]\n31 January 2023 / 10 August 2024 by richardcannon\nA selection of photos ahowing some of our Team's activities during January, plus a video of Cllr. Malcolm Wallace delivering his successful motion to ban future fracking in Winchester\n23 December 2022 / 10 August 2024 by richardcannon\nRain, wind, snow, warm, cold and whatever else, nothing stops our hard working members getting about to spread the Green message Beata Parry, Danny Lee and Kate Needham busy around the Meon Valley Danny Lee asking Swanmore residents to fill out our short 60 second survey ‘Green Drinks’ at the Black Boys Pub in Winchester […]\n29 November 2022 / 10 August 2024 by richardcannon\n‘have your say’ Surveys Kate Needham and Doug Stanton in Swanmore and Waltham Chase Kate Needham and Richard Cannon in Soberton Photos from our Stall in Winchester.. Chris Gilham Rob Parker Richard Needham Doug Stanton Max Priesemann (right) Richard and Kate Needham Rupert Pitt Enjoying a get together in the Open House Deli\n13 November 2022 / 10 August 2024 by richardcannon\nWe set up our ‘Climate Justice’ & ‘Seven Demands for the UK Government’ Stand at the Buttercross on a very busy Winchester shopping day and were pleased to receive so much attention plus response from passers by. Beside giving out a substantial number of leaflets and speaking to people, we also set up a board […]\n14 October 2022 / 10 August 2024 by richardcannon\nThe meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […]\n10 August 2022 / 10 August 2024 by richardcannon\nAfter an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_author_richardcannon_page_8/content_78.html": "31 January 2023 / 10 August 2024 by richardcannon\nA selection of photos ahowing some of our Team's activities during January, plus a video of Cllr. Malcolm Wallace delivering his successful motion to ban future fracking in Winchester\nRead more »\n27 January 2023 / 10 August 2024 by richardcannon\nAfter some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […]\n26 January 2023 / 10 August 2024 by richardcannon\nAt the Winchester City Council meeting earlier this week, Councillors voted to:1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.2) To respond to the County Council’s consultation on the refreshed Minerals andWaste Plan stating our opposition the extraction of oil and gas, including by fracking. Cllr Wallace stated: […]\nFunding available to support local farming communities and our environment. Local Green Party Councillor supports Defra’s Farming in Protected Landscapes programme. Article by Stan Evans Local Meon Valley based Green Party Councillor, Malcolm Wallace stated : ”I’d like to remind our friends in the farming and land management community that Defra’s, Farming in Protected Landscapes […]\n10 January 2023 / 10 August 2024 by richardcannon\nmax priesemann writes.. A single bus ticket price cap of £2 is very welcome! Unfortunately only until End of March. End of 2022 a Stagecoach Single ticket from Winchester to places like West Meon, Cheriton, Arlesford or Romsey cost £5.90. A Bluestar Single between Southampton and Winchester cost as much a £7. From 1st of […]\n23 December 2022 / 10 August 2024 by richardcannon\nRain, wind, snow, warm, cold and whatever else, nothing stops our hard working members getting about to spread the Green message Beata Parry, Danny Lee and Kate Needham busy around the Meon Valley Danny Lee asking Swanmore residents to fill out our short 60 second survey ‘Green Drinks’ at the Black Boys Pub in Winchester […]\n29 November 2022 / 10 August 2024 by richardcannon\n‘have your say’ Surveys Kate Needham and Doug Stanton in Swanmore and Waltham Chase Kate Needham and Richard Cannon in Soberton Photos from our Stall in Winchester.. Chris Gilham Rob Parker Richard Needham Doug Stanton Max Priesemann (right) Richard and Kate Needham Rupert Pitt Enjoying a get together in the Open House Deli\n19 November 2022 / 8 October 2024 by richardcannon\nCllr Malcolm investigaTes Local recycling – says we can do better You do your part to help recycling by sorting your rubbish in different bins separating garden waste and taking your rubbish down to recycling centres. Waste Disposal teams empty our bins and take it all away from our doorstep’ But what happens next? Councillor […]\n13 November 2022 / 10 August 2024 by richardcannon\nWe set up our ‘Climate Justice’ & ‘Seven Demands for the UK Government’ Stand at the Buttercross on a very busy Winchester shopping day and were pleased to receive so much attention plus response from passers by. Beside giving out a substantial number of leaflets and speaking to people, we also set up a board […]\n9 November 2022 / 30 May 2024 by richardcannon\nHave your say: where and how houses will be built around winchester Malcolm Wallace with Danny Lee, local Green campaigner and contributor to the Local Plan Review Whilst development sites opposite the College in Swanmore and at Morgan’s Yard in Waltham Chase are included in the latest draft of the Winchester Local Plan (these sites […]",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_news_page_6/content_79.html": "Winchester Emissions and Carbon Neutrality Action 15 August 2023 / 10 August 2024 by richardcannon Winchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […] Read more » Danny Lee\nOil Drilling at Cheesefoot Farm 14 August 2023 / 10 August 2024 by richardcannon accelerating climate change ! Avington Oil Field taken from article at https://drillordrop.com/2023/07/13/south-downs-oil-field-to-restart-production/ Just recently the Prime Minister announced a raft of new oilfield drilling licences in the North Sea, which will fuel further climate destruction and do nothing to help tackle the cost-of-living crisis. The Intergovernmental Panel on Climate Change, the International Energy Agency and […] Read more » Countryside\nVisiting Rushmere Farm Hambledon 4 August 2023 / 10 August 2024 by richardcannon Rushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative […] Read more » Countryside Farming and Agriculture\nPending Railway Ticket Office closures 4 August 2023 / 10 August 2024 by richardcannon The Railway Delivery Group have recently announced they are proposing a huge closure of ticket offices around the country. To see more, go to https://www.raildeliverygroup.com/uk-rail-industry/customer-focused-reform/customer-focused-stations Below is our response to this. By following the above link, you are able to ‘have your say’ as individuals. Public consultation has been extended to 1st.September 2023. our response.. […] Read more » Petitions\nHampshire County Council Budget Consultation 2024-2026 4 August 2023 / 10 August 2024 by richardcannon Please find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026. The full consultation documents can be found at the Hampshire County Council website HERE …….. 23rd July 2023 Dear Hampshire County Councillors, HAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION Winchester Green Party’s response to the consultation is […] Read more » Kate Needham Max Priesemann\nMembers and supporters enjoying the summer sun 7 July 2023 / 10 August 2024 by richardcannon green coffee morning On Saturday 1st.July., Richard and Kate Needham’s garden was opened up for Members and Supporters to come along and enjoy chit chat, coffee and cakes. Donations, which amounted to just over £60, will go towards forthcoming election campaigns. walk and talk at winnall Replacing our normal monthly meeting, on Wednesday 5th.July., we […] Read more »\nGreen Party Leaders pay tribute to Caroline Lucas 9 June 2023 / 10 August 2024 by richardcannon Following the announcement that Caroline Lucas will not be re-standing as a candidate for parliament in the next general election, I’m sure you will all join us in thanking Caroline for her truly inspiring work. “Caroline’s impact on politics in this country cannot be overstated: she truly is a force of nature and has been […] Read more » National\nWinchester Green Party questions council over harmful weed killers 2 June 2023 / 10 August 2024 by richardcannon As reported in the Hampshire Chronicle… Whilst walking through Winchester City Centre, Green Party Campaigner Richard Needham noticed that some council workers were using a well known weed killer which contains Glyphosates, banned by some councils across the country for harming human health and as a potential carcinogenic. Our co-chair Kate Needham instantly questioned the […] Read more » healthy living Richard Needham\nGreening Campaign receives £0.5m boost from National Lottery Fund 22 May 2023 / 10 August 2024 by richardcannon Following a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding. As many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many […] Read more » Countryside Hambledon\nHambledon Greening Festival 2023 15 May 2023 / 10 August 2024 by richardcannon Once again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May. On a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by […] Read more » Danny Lee Hambledon Malcolm Wallace",
  "https_winchester_greenparty_org_uk/https_winchester_greenparty_org_uk_category_city-council_page_2/content_94.html": "24 January 2024 / 23 January 2025 by richardcannon\nNext Wednesday 31st. January at 6.30pm Winchester City Council will be holding a meeting in the Walton Suite,, Winchester Guildhall to discuss the Hampshire Hospital Consultation. Full details of the meeting along with links to various documents can be found by going to the public website HERE Our Green Party Councillor Malcolm Wallace comments.. ‘This […]\nRead more »\n1 December 2023 / 10 August 2024 by richardcannon\nAt yesterday’s Council meeting, Winchester City Council passed a motion calling for the government to ban the sale and manufacture of disposable vapes by 2024. The motion was based on a Local Government Association initiative. Cllr Malcolm Wallace, who supported the call for the ban, said, ‘Disposable vapes are an unsustainable product, so an outright ban is […]\n23 September 2023 / 10 August 2024 by richardcannon\nOur Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023. Based on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by […]\n19 August 2023 / 10 August 2024 by richardcannon\nDelay, delay, delay seems to be the story of the Winchester City Council’s Local Plan and was highlighted in an article appearing in the Hampshire Chronicle last week. See https://www.hampshirechronicle.co.uk/news/23725912.green-party-concern-winchester-city-councils-local-plan-delay/ In response, Green Party Councillor Danny Lee made the following statement.. “The council’s decision will mean lower environmental standards will continue for longer for all […]\n4 August 2023 / 10 August 2024 by richardcannon\nPlease find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026. The full consultation documents can be found at the Hampshire County Council website HERE …….. 23rd July 2023 Dear Hampshire County Councillors, HAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION Winchester Green Party’s response to the consultation is […]\n2 June 2023 / 10 August 2024 by richardcannon\nAs reported in the Hampshire Chronicle… Whilst walking through Winchester City Centre, Green Party Campaigner Richard Needham noticed that some council workers were using a well known weed killer which contains Glyphosates, banned by some councils across the country for harming human health and as a potential carcinogenic. Our co-chair Kate Needham instantly questioned the […]\n7 May 2023 / 10 August 2024 by richardcannon\nAlresford and Itchen Valley Russell Gordon-Smith (Lib Dem) 2,034 Harry Johnson-Hill (Con) 1,187 Richard Needham (Green) 164 Tessa Valentine (Labour) 74 Majority: 847 Turnout: 40% Bishop’s Waltham Jonathan Williams (Lib Dem) 1,618 Donald Iro (Con) 1,022 Richard Cannon (Green) 232 Steve Haines (Labour) 113 Majority: 596 Turnout: 45% Denmead Paula Langford-Smith (Con) 1,035 Michael Bennett […]\n6 May 2023 / 10 August 2024 by richardcannon\nClick photos to view full sizes Time out in the Cafe Richard, Danny, Malcolm, Giles & Max Giles Gooding Richard Needham Andrew Pogson Julia Priesemann Celebrating the Central Meon Valley win Richard Cannon Malcolm, Giles and Max Our two Winchester Councillors ! Friedrich & Julia Priesemann\n25 April 2023 / 10 August 2024 by richardcannon\nWith more than double the volunteers compared to last year, we’ve been busy distributing leaflets, letters and meeting people listening to any issues they may have and outline our ambitions for the future Add to that we’ve nearly trebled the requests for ‘Vote Green’ boards’ throughout the Meon Valley and some in the city itself. […]\n8 April 2023 / 10 August 2024 by richardcannon\n16 wards – 16 candidates vote green Click candidate photos to view details Richard Needham Alresford and Itchen Valley >> Max Priesemann Alresford and Itchen Valley >> Richard Cannon Bishop’s Waltham Danny Lee Central Meon Valley >> Lucinda Graham Colden Common & Twyford Beata Parry Denmead Lorraine Abraham St. Barnabas Charlotte Harley St. Bartholomew Reece […]"
}