{
  "https_perranmoon_co_uk_/https_perranmoon_co_uk_faqs/content_6.html": "FAQs\nBefore contacting me, see if your question has been answered below\nFrequently Asked Questions\nWhat should I contact my MP about?\nThere are many reasons you may wish to contact me – from personal issues you may be facing, to questions about policy\nHow long does it take to hear back from you?\nDue to the large number of emails, letters and phone calls each day, I will try and respond to you as quickly as possible. Please note that all communications, including emails, are dealt with in the order in which they are received.\nWe currently have a significant volume of casework coming in, and whilst we generally aim to get back within two weeks, at present it will take significantly longer.\nHave you included your full home address? If not please re-send your email including this information in order to receive a response. This is requested even if you email frequently.\nWhen are your constituency surgeries?\nMy constituency surgeries usually take place on Saturdays.\nPlease check my Facebook and Instagram account for the latest updates on when and where my surgeries are taking place.\nIf you would like to book a slot then please email matthew.brown@parliament.uk\nIs it possible to visit you in Parliament?\nYes, please contact my team to discuss organising a meeting.\nPlease email george.pickthorn@parliament.uk\nCan I contact Perran even if he isn't my MP?\nParliamentary Protocol prevents an MP from dealing with enquiries form another MP’s constituency, so be sure that you are a constituent of Camborne and Redruth, as contacting the wrong representative can cause delays to your case.\nYou can check online here: FindYourMP\nIf your query relates to a Local Authority issue then please direct your correspondence directly to your locally elected Cornwall Councillor.\nTo find your local representative please visit: MyLocalCouncillor",
  "https_perranmoon_co_uk_/https_perranmoon_co_uk_about-me/content_4.html": "This section is still under maintenance. Please check Perran4CRH on Facebook for updates. And check back here soon!",
  "https_perranmoon_co_uk_/https_perranmoon_co_uk_policies/content_2.html": "Preventing folk from starving and freezing is the greatest immediate challenge we face from 13 years of Conservative failure. Having knocked on thousands of doors across Camborne, Redruth, Hayle, the issue of most concern to voters is how they are going to feed and heat themselves and their families. Over the last decade we have seen a steady erosion of household disposable income. The Conservative government had lost control of inflation, and too many working people are in insecure, low wage jobs. Our new Labour government will have to tackle this issue as a matter of priority, head on.\nAs the new MP for Camborne, Redruth and Hayle, I managed to persuade a Conservative-led Council to declare a Food Poverty Emergency, including a number of key commitments that will ensure that no one in the area should go hungry. In opposition, rather than pointless petitions, practical action to deal with the worst excesses of Conservative failure is what is required in areas such as Close Hill, Treleigh, Pengegon and East Pool Park. In Government, as your Labour MP, I am fighting to ensure that the principle of ‘no one goes hungry’ is at its core.",
  "https_perranmoon_co_uk_/https_perranmoon_co_uk_contact/content_5.html": "Perran welcomes contact from all his constituents. There are a number of ways to get in touch.\nContact me\nPlease use one of the methods listed below\nPerran is here to help everyone\nNotes for contacting Perran\nTimeframes for a reply\nDue to the large number of emails, letters and phone calls each day, I will try and respond to you as quickly as possible. Please note that all communications, including emails, are dealt with in the order in which they are received.\nWe currently have a significant volume of casework coming in, and whilst we generally aim to get back within two weeks, at present it will take significantly longer.\nHave you included your full home address? If not please re-send your email including this information in order to receive a response. This is requested even if you email frequently.\nWhat if Perran isn't your MP?\nParliamentary Protocol prevents an MP from dealing with enquiries form another MP’s constituency, so be sure that you are a constituent of Camborne and Redruth, as contacting the wrong representative can cause delays to your case.\nYou can check online here: FindYourMP\nIf your query relates to a Local Authority issue then please direct your correspondence directly to your locally elected Cornwall Councillor.\nTo find your local representative please visit: MyLocalCouncillor",
  "https_perranmoon_co_uk_/https_perranmoon_co_uk_gallery-2/content_3.html": "Gallery\nPerran in action as MP for Camborne, Redruth and Hayle\nPerran campaigning to support arthritis research\nPerran campaigning to support arthritis research\nFundraising with Wes Streeting in Nov 2023\nFundraising with Wes Streeting in Nov 2023\nPromoting Cornish critical minerals with Jonathan Reynolds in Nov 2023\nPromoting Cornish critical minerals with Jonathan Reynolds in Nov 2023\nRaising the profile of Cornish education with Bridget Phillipson in Oct 2023\nRaising the profile of Cornish education with Bridget Phillipson in Oct 2023\nDiscussing Cornish renewables and tech with Darren Jones in April 2023\nDiscussing Cornish renewables and tech with Darren Jones in April 2023\nDiscussing the Cornish economy with Rachel Reeves in August 2023\nDiscussing the Cornish economy with Rachel Reeves in August 2023\nPromoting West Country investment with Ben Bradshaw in April 2023\nPromoting West Country investment with Ben Bradshaw in April 2023\nTalking Cornwall with Keir Starmer in Sep 2022\nTalking Cornwall with Keir Starmer in Sep 2022\nChatting devolution with Mark Drakeford in Oct 2022\nChatting devolution with Mark Drakeford in Oct 2022\nCampaigning with Luke Pollard in Nov 2023\nCampaigning with Luke Pollard in Nov 2023\nTalking Cornish roads with Stephen Morgan in Oct 2023\nTalking Cornish roads with Stephen Morgan in Oct 2023\nDiscussing farming and rural affairs with Daniel Zeichner in May 2023\nDiscussing farming and rural affairs with Daniel Zeichner in May 2023\nMore Fundraising for Young Minds in 2021\nMore Fundraising for Young Minds in 2021\nPerran talking Cornish Critical Minerals\nPerran talking Cornish Critical Minerals\nPerran on BBC Politics South West\nPerran on BBC Politics South West\nPerran celebrating Cornwall's rich culture\nPerran celebrating Cornwall's rich culture\nDowning Street at Christmas\nDowning Street at Christmas\nCornish Units in Redruth\nCornish Units in Redruth\nPerran Beach Clean Up\nPerran Beach Clean Up\nPerran's Election Material\nPerran's Election Material\nPerran and Wes Streeting\nPerran and Wes Streeting\nPerran at the Council of Europe\nPerran at the Council of Europe\nPerran at South Crofty Tin Mine\nPerran at South Crofty Tin Mine\nPerran visiting Trewergie Infant's School\nPerran visiting Trewergie Infant's School\nChildren's Mental Health Week 2024\nChildren's Mental Health Week 2024\nPerran and Noah Law outside Downing Street\nPerran and Noah Law outside Downing Street\nPerran talking education in Cornwall\nPerran talking education in Cornwall\nSt Piran's Day Event in Parliament 2025",
  "https_perranmoon_co_uk_/https_perranmoon_co_uk/content_1.html": "Born and raised in Redruth, it is my privilege to serve the people of Camborne, Redruth and Hayle to the best of my ability.\nMy policy priorities and stances as MP for Camborne, Redruth & Hayle\nJobs in the green economy\nEconomic rejuvenation should be based on maximising sustainable energy resources to create secure, well-paid jobs. The opportunities in Cornwall are immense, and I am determined that Camborne, Redruth and Hayle will be at the centre of what I hope to be a Green Industrial Revolution"
}