{
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_blog/content_6.html": "Christina Coleman\nYour Green MP candidate for East Grinstead & Uckfield\nPublished and promoted by Keith Obbard on behalf of Christina Coleman and Wealden Green Party, all at Cherry Gardens Farm, Cherry Gardens Hill, Groombridge, Tunbridge Wells, Kent, TN3 9NY",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_an-evening-with-hugh-fearnley-whittingstall/content_8.html": "I thoroughly enjoyed the opportunity to speak to a wonderful audience of 400 guests in St Swithun’s Church, East Grinstead, alongside Hugh Fearnley-Whittingstall on topics such as the importance of food to our health, the simple pleasures of foraging for food, the increasingly urgent need to support local food suppliers and our Sussex based farmers, and the UK’s food security.\nTalking about his new book “How to Eat 30 Plants a Day”, Hugh’s infectious enthusiasm and reverence for food carried us along so brilliantly as he simply explained his compelling philosophy of “more plants, better health”.\nIt was also good to touch on my passion for diversity in food production, regenerative farming, and the climate impacts on our agricultural sector, plus how delighted I am to be part of the work of Wealden’s Food Partnership.\nA huge thank you too to Helen Scott of East Grinstead Book Shop who could not have introduced and organised the evening more perfectly, and to BBC presenter and local resident Katie Derham who compered the evening and the lively, broad ranging Q&A discussion with flair and ease.\nI shall be speaking at further events in support of our key local issues in the coming months.\nChristina Coleman\nYour Green MP candidate for East Grinstead & Uckfield\nPublished and promoted by Keith Obbard on behalf of Christina Coleman and Wealden Green Party, all at Cherry Gardens Farm, Cherry Gardens Hill, Groombridge, Tunbridge Wells, Kent, TN3 9NY",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_contact/content_2.html": "Get in touch\nIf you have a question for Christina, or would like to get involved in the campaign please get in touch using this form or the contact info below.\nWe are looking for people to help deliver literature, and to put up posterboards in the last month before the election.\nYou can join the Team Christina WhatsApp group using this link.\nChristina Coleman\nYour Green MP candidate for East Grinstead & Uckfield\nPublished and promoted by Keith Obbard on behalf of Christina Coleman and Wealden Green Party, all at Cherry Gardens Farm, Cherry Gardens Hill, Groombridge, Tunbridge Wells, Kent, TN3 9NY",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_about/content_5.html": "“I want to see more\nhonesty and integrity\nin our politics”\nChristina Coleman is the Green Party MP candidate for the new constituency of East Grinstead & Uckfield in the forthcoming General Election.\nChristina was elected Councillor for Danehill & Fletching ward on Wealden District Council in May 2023. She was appointed Chair of Council by the Green-LibDem Alliance for Wealden, which took over administration of the council following the election. Christina stood down as chair in January 2024 to begin campaigning in the forthcoming General Election as the Green MP candidate for the new constituency of East Grinstead and Uckfield.\nWith a background in advertising, fundraising and teaching, Christina is a passionate advocate for action on climate change and protection of nature. She has a Master’s Degree from the University of Sussex in Environment, Development and Policy – and has been an independent advisor to government on sustainable housing policy. She says she is “determined to do all I can to protect this irreplaceable part of the country for future generations – I want to build a greener, fairer, kinder future”.\n“I’m standing to be your new MP to change things for the better. I promise to use my skills and experience to stand up for you. I believe in honesty and integrity in politics.\nAs a local councillor, I am working hard for my residents. This new constituency of East Grinstead & Uckfield needs an effective, principled and caring MP.\nI’m here to listen and represent all of us with a strong voice for this area in Westminster.”\n– Christina Coleman\nProf. Pete Newell, University of Sussex\n“Christina has exactly the right combination of passion, dedication and understanding of the needs of people in this area to make an excellent MP.”\nSharon Martin, Charity Finance Professional, East Grinstead\n“I’m supporting Christina to become our MP as I believe she genuinely cares about the issues that matter to local people as well as the significant challenges we face at a national level.”\nSarah Butler, writer\n“Christina will be such a great MP for this area: she listens to people, searches for practical solutions, and works incredibly hard for everyone she represents. She’ll always stand up for what’s right.”\nSally de St Croix\n“Christina listens, Christina cares and she absolutely delivers, and that’s why I’m delighted to support Christina in becoming our local MP. “\nEast Grinstead & Uckfield\nThe election boundaries have been redrawn – and this new constituency is made up of parts of Mid Sussex, Wealden and Lewes. You can find out more about the consituency and about the Greens’ chances at the next general election here.\nLearn more\nDon’t miss out\n13th April\nKenton Cool in conversation with Christina Coleman\nChristina Coleman and Volume 1 Climbing in East Grinstead are proud to host mountaineering legend Kenton Cool for an unforgettable evening. Find our more here.\n15th May\nHigh Fearnley-Whittingstall in conversation with Christina\nChristina Coleman and award-winning chef and broadcaster Hugh Fearnley-Whittingstall in conversation at St Swithun’s Church in East Grinstead. Find out more here.\nRipple Project\n‘Citizen science’ to monitor the health of our local rivers\nJoin Christina and the Ripple Project in monitoring river water health and biodiversity – a collaboration between Friends of the River Medway, University of Sussex and Wealden District Council.\nChristina Coleman\nYour Green MP candidate for East Grinstead & Uckfield\nPublished and promoted by Keith Obbard on behalf of Christina Coleman and Wealden Green Party, all at Cherry Gardens Farm, Cherry Gardens Hill, Groombridge, Tunbridge Wells, Kent, TN3 9NY",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_egu-a-new-constituency/content_3.html": "East Grinstead & Uckfield:\na new constituency\nFollowing a review, the boundary of the new constituency of East Grinstead & Uckfield was confirmed in 2023 – and will be used in the UK General Election 2024 for the first time. It is made up of parts of three previous constituencies – Mid Sussex, Wealden and Lewes, and includes the following towns and villages: Ardingly, Ashurst Wood, Balcombe, Barcombe, Buxted, Copthorne, Chelwood Gate, Crawley Down, East Grinstead, Forest Row, Handcross, Horsted Keynes, Maresfield, Newick, Nutley, Pease Pottage, Scaynes Hill, Sharpthorne, Turners Hill, Uckfield.\nEast Grinstead & Uckfield can go Green\nMid Sussex, Wealden and Lewes. These are currently all represented by Tory MPs and have been almost exclusively so for many decades. We think this could change in the General Election 2024. Why?\nIn local elections across the whole of this new constituency in 2023, Greens came second in terms of number of seats won after the Tories. Greens stood in only 19 seats and won 9 of them. The Cons stood in 30 seats and won 11. Lib Dems on only 1 seat and Labour 2. Greens are attracting voters from all parts of the political spectrum because we work hard for the people we represent, we do politics differently, we change the conversation wherever we are elected. A Green vote is for a strong, independent voice that can speak up for local people.\nGreens are on the up across the country\nGreens are gaining momentum and now have 766 councillors across England and Wales. Greens are in power in 39 councils. We currently have only 1 MP in Westminster – thanks to our unfair first past the post electoral system. After the General Election 2024 we aim to have at least 4 MPs.\nChristina Coleman\nYour Green MP candidate for East Grinstead & Uckfield\nPublished and promoted by Keith Obbard on behalf of Christina Coleman and Wealden Green Party, all at Cherry Gardens Farm, Cherry Gardens Hill, Groombridge, Tunbridge Wells, Kent, TN3 9NY",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_events/content_4.html": "Events\nPast Events\nMonday 7th October 2024 at 6.30pm – Cumnor House Sussex\nExclusive film screening in aid of The Royal Countryside Fund\nExclusive screening of feature film ‘Six Inches of Soil’ followed by panel discussion, chaired by Christina Coleman, joined by three local regenerative farmers: Dan Burdett (Cockhaise Farm), Elizabeth Buchanan (Black Venn Farm) and Rosanna Catterall (Knepp Castle).\nVenue: Cumnor House School, Danehill, RH17 7HT\nMonday 1st July 2024 at 7.00pm – Java & Jazz\nPre General Election Meet & Greet\nJoin us, just three days before polls, for an informed and honest discussion at Climate Meet & Greet with local candidate Christina Coleman, in which she talks about supporting the Climate and Nature Bill and more. Full details here.\nVenue: Java & Jazz, The Square, Lewes Rd, Forest Row RH18\nSpaces limited, please RSVP ashdownclimate@gmail.com\nSunday 23rd June 2024 at 7.00pm – Uckfield Civic Centre\nHustings organised by Cornerstone Church, Uckfield\nFeaturing the Green Party’s Christina Coleman, alongside the candidates for the Conservative Party, Liberal Democrats, Labour and an Independent. Full details here.\nVenue: The Civic Centre, Bellfarm Lane, Uckfield, East Sussex, TN22 1AE\nPre registration is required: you can register here.\nWednesday 15th May 2024 at 7.00pm – St Swithun’s Church, East Grinstead\nIn conversation with Hugh Fearnley-Whittingstall & Christina Coleman\nJoin renowned chef, writer, and broadcaster Hugh Fearnley-Whittingstall and Green Party member Christina Coleman for a lively and thoughtful evening of discussion, hosted by BBC’s Katie Derham. The conversation will explore their shared passion for rural Britain and mutual concerns regarding the environment. The evening will also feature insights from Hugh’s latest book, “How to Eat 30 Plants a Week.”\nVenue: St Swithun’s Church, St Swithuns Close, East Grinstead, RH19 3BB\nFor Tickets Visit: www.eastgrinsteadbookshop.co.uk\nChristina Coleman\nYour Green MP candidate for East Grinstead & Uckfield\nPublished and promoted by Keith Obbard on behalf of Christina Coleman and Wealden Green Party, all at Cherry Gardens Farm, Cherry Gardens Hill, Groombridge, Tunbridge Wells, Kent, TN3 9NY",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_category_uncategorized/content_10.html": "Council votes to support Climate and Ecology Bill Led by Christina Coleman, in February Wealden District Council passed a motion in support of the Climate and Nature Bill, a private members’ bill originally proposed by the Green Party’s Caroline Lucas, which is currently on its second reading in Parliament. (The bill was orginally called theContinue reading “Council votes to support Climate and Ecology Bill”",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk/content_1.html": "Your Green MP\nEast Grinstead\ncandidate for\n& Uckfield\n“I will be a strong, independent voice able to speak up for this constituency”\n“We need more honesty and integrity in our politics”\nIt would be an honour to be your MP. If elected, I will work tirelessy to:\n- Boost spending on GPs and other essential services – we must invest more to mend our broken public services\n- Build only the right homes, in the right place, for the right price – we need community-led planning and no new building without required infrastructure\n- Get the roads fixed and ensure they are well maintained – through proper funding for our cash-strapped councils\n- Protect our countryside and the health of our rivers (I am a member of The Ripple Project measuring water quality)\nA little about me: I have lived in this constituency for more than 20 years; I am a mother, a teacher and a District Councillor. I am a local person who cares passionately about local issues.\nI will be a strong, independent champion on the things that matter most to you.\nLatest News\nThe Green Party manifesto is out! Read a summary of our main policies on housing, funding the NHS and public services, promoting green energy, nature restoration, support for the cost of living and more here. “We can create a greener, fairer country together – one in which we are all safer, happier and more fulfilled.”\nDo you live on a busy road in the new East Grinstead & Uckfield constituency? Why not host one of our smart Vote Green posterboards during the election period? We will install and remove – just get in contact to say you will have one. Lots of posterboards say: Green is THE tactical vote in this constituency.\nEast Grinstead & Uckfield is a new constituency for General Election 2024, comprising areas of Mid Sussex, Wealden and Lewes. Greens are on the up here and are best placed to beat the Conservatives. These areas have had a Tory MP for many decades, with very few exceptions. Time for a change! More.\nEast Grinstead & Uckfield – your vote could make the difference!\nThis is a new constituency, made up of parts of Mid Sussex, Wealden and Lewes. These areas have traditionally voted Conservative, but this is changing. Greens can win here – and your votes could swing it! Read more about the constituency here.\nGet involved with our campaign\nWould you like to support our campaign in some way – by delivering literature for example – or would you like to sign up for campaign updates? If you want to get involved please get in touch.\nIf you would like to join the Team Christina WhatsApp group you can sign up here.\nWith your help, we can do more!\nOur campaign runs on volunteer and supporter time. Donations from individuals helps us to pay for printing and other costs. Can you be one of them and make a donation to our General Election campaign fund?\nChristina Coleman\nYour Green MP candidate for East Grinstead & Uckfield\nPublished and promoted by Keith Obbard on behalf of Christina Coleman and Wealden Green Party, all at Cherry Gardens Farm, Cherry Gardens Hill, Groombridge, Tunbridge Wells, Kent, TN3 9NY",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_author_rupertwiddicombe/content_9.html": "Council votes to support Climate and Ecology Bill Led by Christina Coleman, in February Wealden District Council passed a motion in support of the Climate and Nature Bill, a private members’ bill originally proposed by the Green Party’s Caroline Lucas, which is currently on its second reading in Parliament. (The bill was orginally called theContinue reading “Council votes to support Climate and Ecology Bill”",
  "https_christinacoleman_org_uk_/https_christinacoleman_org_uk_2024_02_19_hello-world/content_7.html": "Council votes to support Climate and Ecology Bill\nLed by Christina Coleman, in February Wealden District Council passed a motion in support of the Climate and Nature Bill, a private members’ bill originally proposed by the Green Party’s Caroline Lucas, which is currently on its second reading in Parliament. (The bill was orginally called the Climate and Ecology Bill). Wealden join some other 250 councils to have passed a motion is support of the bill, which would require the UK to achieve its climate and nature targets – and give the Secretary of State a duty to implement a strategy to achieve those targets. The bill also proposes establishment of a Climate and Nature Assembly to advise the Secretary of State, and would give duties to the Committee on Climate Change and the Joint Nature Conservation Committee to monitor progress on the strategy and targets.\nI believe that, above all else, people are looking for honesty in politics.\nHonesty in a democracy is a difficult thing, because people like to vote for the fairy tale; they want to believe that we can carry on with business as usual and that our benevolent planet will continue to provide.\nThe problem is, if we do not tell the truth, if we are not told the truth, we cannot make the difficult decisions we need to make in order to build a better future.\nFull text of the speech given by Christina in putting the motion to the Council:\n“I believe that, above all else, people are looking for honesty in politics.\n“Honesty in a democracy is a difficult thing, because people like to vote for the fairy tale; they want to believe that we can carry on with business as usual and that our benevolent planet will continue to provide.\n“The problem is, if we do not tell the truth, if we are not told the truth, we cannot make the difficult decisions we need to make in order to build a better future.\n“In 2015, world leaders at COP 21 in Paris, agreed to limit global temperatures to 1.5 degrees of warming. Those pledges have evidently been broken, and for the first time, we have seen average daily temperatures exceed 1.5 degrees centigrade across an entire year.\n“With every 0.1 degrees of warming, brings increased risks in terms of floods, wildfires, droughts, storms and heatwaves. We see greater risk to food security and of course to our economy. According to the Office for Budget Responsibility, the cost of runaway climate change could see our national debt grow to 289% of GDP by the end of the century.\n“Global CO2 emissions are not just growing, they are accelerating. According to the EIA, in 2023, global energy-related carbon emissions grew to their highest level ever of 54 billion tonnes. Current government policies have us on track for at least 2.7°C warming above pre-industrial levels. Humans have never existed on such planet.\n“Inextricably linked to the climate crisis is the crisis in nature. We know that healthy ecosystems provide many of the solutions that we need to tackle the climate crisis. For example, 80% of terrestrial carbon, that is to say carbon that is stored on the land, is locked away in healthy soils. Soils are living, they are themselves complex ecosystems. By safeguarding the health of soils, we can ensure that carbon is locked away for centuries to come. However, we are degrading our soils at an alarming rate, replacing healthy ecosystems with roads, concrete and chemically degraded land.\n“A recent IPBES report warns that “Nature is declining globally at rates unprecedented in human history – and the rate of species extinctions is accelerating.” The UK is currently in the bottom 10% in the most nature depleted countries in the world. Much of this is down to habitat loss. Now, 1 in 6 native species in the UK are threatened with extinction.\n“That is why we need robust national laws to tackle the dual climate and nature crisis together, in line with the latest science and in a way that ensures the public are included in finding a fair way forward. That is why I am in favour of the Climate and Ecology Bill.\n“The CE Bill will prioritise habitat restoration, including: woodlands, peatlands, wetlands and seas, supporting nature-based solutions in order to remove carbon dioxide from the atmosphere – much more cheaply than the unproven and unaffordable engineered options. And allow nature to help us adapt to climate change.\n“The Bill seeks to bring back wildlife, and restore the services that resilient ecosystems provide for free, such as: pollination; water filtration; air purification; and pest and disease control.\n“The Bill proposes that the UK should be fully transparent and take responsibility for our overseas footprint, both emissions and ecological.\n“This means properly accounting for greenhouse gas emissions from international aviation and shipping, which account for 10% of the climate problem and are growing rapidly.\n“These emissions were left out of carbon budgets (and the 2050 target) when the Climate Change Act became law.\n“And it also requires fully accounting for the emissions and ecological harm caused by the goods and services we buy.\n“Not only will this be a more honest approach, that will allow us to take responsibility for our part in the climate crisis, but it will also support our domestic agriculture and production sector, by ensuring that prices are not undercut by artificially cheap imports. Therefore improving food security, while creating jobs and skills. It will give a much needed boost to local communities and to the economy.\n“The bill also seeks to give the British people a say in finding a fair way forward by temporary, independent and representative Climate & Nature Assemblies.\n“The Climate and Ecology Bill has received cross-party support. It was introduced by the Labour MP, Olivia Blake and seconded by Caroline Lucas. It has the backing of Sir Ed Davy and all of the Lib Dem MPs. As well as Conservatives such as Sir Peter Bottomley, Sir Roger Gale, Derek Thomas and Theresa May’s former environment adviser, Lord Randall of Uxbridge. In fact, it has received support from 11 different political parties as well as Independents.\n“So, Today I am asking that you back the motion to support the CE Bill so that Wealden District Council can add its name to a list of 237 other Local Authorities. In doing so, we commit Wealden District Council to:\n- Support the Climate and Ecology Bill\n- Inform the Press and residents of our decision\n- Write to our MP to inform her of our motion, and\n- Write to Zero Hour – the organisers of the cross party campaign who support the Bill – to inform them of our support.\n“As Sir David Attenborough has shown us, nature isn’t a nice to have; it’s all we have. Nature provides our best chance of mitigating climate change and its worst impacts, such as extreme flooding and drought. Put simply, we can’t solve the climate crisis without saving our key ecosystems, restoring habitats and protecting our much beloved species. That is precisely what this Bill aims to do.\n“And I therefore ask you to support this motion.”\nI watched the debate and am quite frankly astounded that you’ve sought to mislead the public on the status of the Bill. It was made quite clear by another person there that it was a lapsed Bill and it was therefore a pointless waste of time and public money to debate it.\nLikeLike\nThe Climate and Ecology Bill has been renamed the Climate and Nature Bill was re-presented to Commons in March 2024 and is scheduled for its second reading in the Commons on 17th May https://bills.parliament.uk/bills/3707\nLikeLike"
}