{
  "https_carmona4cambridge_uk_/https_carmona4cambridge_uk/content_1.html": "I was born in 1968 and grew up in a small French town near the Alps, across the border from Geneva. It had a church, a town hall, a cafe, a few shops, a school, an orphanage and a manor house. The manor house used to belong to the founder of the town, a notorious gold smuggler called Voltaire. We lived in an apartment on a small 1960s estate surrounded by fields. Here are two of my earliest memories: there was a sandpit nearby where children played and adults used to drop their cigarette butts. I remember that at the age of 3, I picked a fresh one up and inhaled deeply...and never smoked a cigarette again! In front of our block of flats there was a fenced off field which had a bull in it and a tree with low branches. One day, when I thought the bull was away, I climbed over the fence into the field and then, after finding out that the bull was in fact there, I ran for my life and thanked my lucky stars for that tree!\nWhen I was 8 years old, we moved to a new school in the south of France. One day, I asked my classmates to line up against a wall in the playground, and announced that we would be organising a revolution. “Who wants to join?” Everyone did! We weren’t really sure what we were revolting against, apart from a vague plan to take over running the school, but the idea was so grand, we were completely carried away by it, to the utter amazement of the teachers, who watched from the sidelines without interfering. The aftermath of the revolution was carefully organised, with members holding different coloured cardboard badges according to rank, but it fell apart a few weeks later after I proposed to charge a weekly tax so that we might “fund projects”. Only one boy, Cristian, one of the most high-ranking leaders, brought his pocket money to school, but I of course didn’t take it, and the revolution faded away.\nWhen I was 16, the family moved to England, where I did my A-levels and then studied Law at Cambridge University.\nAfter that, I lived mainly in London, and for a few years in Europe. I worked as a market research interviewer, a boat hand in a London park, a minicab driver, a computer programmer, a translator, a copywriter and a journalist. I now work as a river tour guide on the Cam and also as a walking tour guide in town.\nWhen I moved back to Cambridge 5 years ago, just before the pandemic, there was not much work, so I volunteered as a school governor in 2021, and campaigned against unpopular developments planned across town. I joined one of the national parties, but soon realised it was not for me. I then decided to stand as an independent candidate for the people of my adoptive city, to avoid my hands being tied by dodgy ideology or vested interests.\n“People are always complaining. We don’t bother listening to them.”\nWhat a City Counsellor said when I told her most of her constituents opposed the destruction of the Grafton Centre that she was proud to support.\nFor many years, we’ve been wasting our votes and squandering our democratic rights by voting for political parties that bicker among themselves, jockey for power, and do not properly represent us. That’s not how things are meant to be. The role of a local representative is to stand up for the residents, strengthen the community and lead by example.\nThat’s what I plan to do, if you trust me to be your next county councillor."
}