{
  "https_sarahedwards_org_uk_/https_sarahedwards_org_uk/content_1.html": "SARAH'S WORK IN TAMWORTH AND PARLIAMENT\nFLOODING\nFlooding has impacted both our town centre and villages for decades, causing major disruption to residents. I have held meetings and summits with key stakeholders which has fed into my recent Flooding Report. I recently presented this to the Minister for Water and Flooding, Emma Hardy. Read my report here.\nROADS AND POTHOLES\nResidents should be able to get around our town and villages without the constant fear of damaging their vehicle due to potholes. I am working to ensure the recent uplift in funding for road repairs benefits Tamworth.\nNHS\nTamworth residents need quicker access to their GPs and diagnostic appointments. I've been working with our local hospital on funding and design of services at the new Community Diagnostic Centre.\nPROTECTING OUR HERITAGE\nAs a former board member of a heritage trust, preserving our town's heritage is a priority of mine. I have been working alongside partners such as Historic England, Arts Council England, Heritage Lottery Fund and Tamworth Borough Council on restoring and protecting and funding our heritage sites such as our 11th century castle.\nSUPPORTING SMALL BUSINESS\nTamworth has a wide range of fantastic small businesses that are essential to our local and national economy. I am working with local businesses to make sure their voices are heard by this government through roundtable events and regular meetings.\nBUSINESS & TRADE COMMITTEE\nAs a member of the Business and Trade Select Committee I am ensuring that local businesses here in Tamworth feed into the detailed policy making work in Parliament and I am championing British businesses abroad. Take a look at the results of my Roundtable.\nABOUT SARAH\nI was proud to be reelected as the Member of Parliament for Tamworth and the villages.\nI’ve dedicated my life to delivering for working people. As a trade union organiser I fought for better jobs and better pay. I’m committed to securing well-paid jobs here in Tamworth and the villages.\nAs an NHS governor I successfully led a campaign to protect cancer services across Staffordshire.\nAs your MP, I am here to champion our community and support you."
}