{
  "https_www_tamaramicner_com": "Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer Scroll Telling stories that bring us together I am a playwright, performer and Yiddish teacher who lives in London and hails from Vancouver/Coast Salish land . My work aims to be joyful, participatory and connected, coming from the belief that it’s possible for us to transform society for the better. My newest play, the East End Jewish pantomime Yankl and the Beanstalk , is inspired by the Jack and the Beanstalk story and set in the radical Jewish East End of yore. It includes Yiddishised pop songs, a workers’ strike and Pickle Fairy. It recently premiered at The Pleasance Islington and we are working towards a tour for 2026 - stay tuned! I have co-founded London’s first Yiddish theatre company in decades, Di londoner shpilers (London Yiddish Players), with David Schneider, Vivi Lachs, Sonia Gollance & Steve Ogin. With funding and support from the AHRC, Shoresh Trust and JW3, we held a Season of Yiddish Theatre in 2024 and are working towards a work-in-progress performance in June 2025 at UCL. I also collaborate with other theatre-makers, including Katy Dye, on projects such as Climate Grief Karaoke and Fermentation Foyer (It’s Jarring) . As part of Hackney History Festival, I am about to run a workshop at Hoxton Hall looking at the East End Yiddish history and culture celebrated and brought to life in Yankl . As a Yiddish teacher, I run weekly classes with Babel’s Blessing , the Workers’ Circle , Hampstead Garden Suburb Synagogue, Jewish Care and privately. Feel free to read more about my work on this website. Zay gezint ! Current work Past work Subscribe Sign up to get ‘short but sweet’ updates every now and again. Email Address Sign Up We adhere to GDPR laws in England. Thanks for signing up! Landing Intro",
  "https_www_tamaramicner_com_about": "About — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer Credit: Lexi Clare Photography Oh hello! I am a playwright, performer and Yiddish teacher who lives in London and hails from Vancouver/Coast Salish land . My work aims to be joyful, participatory and connected, coming from the belief that it’s possible for us to transform society for the better. My newest play, the East End Jewish pantomime Yankl and the Beanstalk , is inspired by the Jack and the Beanstalk story and set in the radical Jewish East End of yore. It includes Yiddishised pop songs, a workers’ strike and Pickle Fairy. It recently premiered at The Pleasance Islington and we are working towards a tour for 2026 - stay tuned! I have co-founded London’s first Yiddish theatre company in decades, Di londoner shpilers (London Yiddish Players), with David Schneider, Vivi Lachs, Sonia Gollance & Steve Ogin. With funding and support from the AHRC, Shoresh Trust and JW3, we held a Season of Yiddish Theatre in 2024 and are working towards a work-in-progress performance in June at UCL. As part of Hackney History Festival, I am about to run a workshop at Hoxton Hall looking at the East End Yiddish history and culture celebrated and brought to life in Yankl . I also collaborate with other theatre-makers, including Katy Dye, on projects such as Climate Grief Karaoke (CGK) and Fermentation Foyer (It’s Jarring) . CGK invites audiences to express climate grief through song. To date we have performed at Cambridge Junction, Totally Thames and Bit of a Do Festival. As a Yiddish teacher, I run weekly classes with Babel’s Blessing , the Workers’ Circle , Hampstead Garden Suburb Synagogue, Jewish Care and privately. Credit: Lexi Clare Photography I recently co-facilitated the retreat Moving In , inviting Jewish climate activists to engage with climate justice through art, movement and ritual. Over a weekend in Somerset, we shared victories and challenges, built community and explored possibilities for healing and liberation. Thank you to Moishe House for supporting us! Previously, I created and performed the digital solo show Old Friends , a one-hour sleepover experience (on Zoom!). This was commissioned by Cambridge Junction, supported by Arts Council England and performed with the Junction and Cockpit Theatre in March 2022 from Hackney Showroom. The show reminisces about that one true friend who got away and explores who’s replaced them, or hasn’t. Can we enjoy the close friendships as adults that we revelled in as kids? When can we finally mourn our friend breakups with ice cream and bad TV? My first solo show, Holocaust Brunch , asks how we can honour the stories we inherit whilst breaking free from them. It toured England and Canada in 2020-21 with support from Arts Council England, Canada Council for the Arts, British Columbia Arts Council, Battersea Arts Centre, Camden People’s Theatre, JW3 and Chutzpah! Festival. My work has been nominated by the Jessie Richardson Awards, shortlisted by BBC Writersroom Scriptroom and awarded the Lucy Cavendish College Alumnae Prize for Contribution to the Arts. I trained in acting at the Central School of Speech & Drama and in longform improv with Monkey Toast, and completed the Royal Court Theatre Young Writers’ Programme. I have also completed advanced Yiddish studies at the Paris Yiddish Centre/Medem Bibliotek. Subscribe Sign up to get ‘short but sweet’ updates every now and again. Email Address Sign Up We adhere to GDPR laws in England. Thank you!",
  "https_www_tamaramicner_com_new_work": "New Work — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer Current Work Credit: Alex Jackson Yankl and the Beanstalk A Queer Jewish pantomime set in the East End of yore. Two pickle workers, a Giant and a sack of magic beans. This show will leave you gagging… for pickles, of course! Yankl and the Beanstalk premieres at The Pleasance Islington on 19-22 March 2025. This show has been developed with Emily Rose Simons with support from Arts Council England,  Manchester Jewish Museum, rice & beans theatre and Chutzpah! Festival for the Performing Arts. Book tickets! Credit: Christa Holka, Martha Hegarty Old Friends Grab a blanket and a pint of Ben & Jerry’s and join Tammy for a good old-fashioned (one-hour) sleepover. We’ll reminisce about that one true friend who got away and explore who’s replaced them, or hasn’t. Soundtrack provided by Simon & Garfunkel. Audience participation provided by you (if you like!). Commissioned by Cambridge Junction, supported by Arts Council England. Our world-premiere digital tour in March 2022 was broadcast live from Hackney Showroom, London and hosted by Cambridge Junction & The Cockpit Theatre. Read more Secrets from the London Yiddish Stage, JW3, Jan 2024 The London Yiddish Players I am working with fellow Yiddish speakers and Yiddish theatre-lovers to form London’s first Yiddish theatre company in decades. Building on our recent Season of Yiddish Theatre at JW3 , supported by University College London, we are bringing Yiddish theatre back to the London stage via workshops and performances. Stay tuned for more details! Find out more Credit: Sophie le Roux Holocaust Brunch We invite you to hear from a pair of Holocaust survivors and one of their descendants, over a delicious brunch. There will be the opportunity to reflect on their stories and on how, as the next generation, we can keep the memory alive. Or which memories. Or whose memories. Hang on, why are we doing this? And why so much food? This solo show, created & performed by Tamara, has toured the UK & Canada in 2020-21. Read more Subscribe Sign up to get ‘short but sweet’ updates every now and again. Email Address Sign Up We respect your privacy. Thank you!",
  "https_www_tamaramicner_com_past_work": "Past Work — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer PAST WORK A Secret Life Do you know what goes on in my head? Do I know what goes on in yours? Maybe it’s not what either of us expects … Follow our characters on an everyday journey through South London, hearing their inner thoughts via a custom-built app on your smartphone. A promenade theatre piece using digital media, inspired by intergenerational workshops with local people in South London. ‘The future of theatre’ (London City Nights). Performed at the 2016 Wandsworth Arts Fringe with Theatre503, London. Created with Baseless Fabric Theatre in residency at University of the Arts London. Wink the Other Eye For this night only: The Queen of Music Hall, Marie Lloyd, performs a series of her best-known songs together with ‘real events’ from her life. An evening promising: songs from a long-lost London, debauched merriment, fine beers and wines. The raucous atmosphere of the music hall. Exquisite silk dresses. A glimpse behind the elusive mask of fame … Created with and performed by Amanda Butterworth, Ronan Fitzgerald and James Welland. Developed & performed at Hackney Showroom, London, 2015. Supported by Arts Council England and Snapper Productions. What You’re Missing Isabel and Ed live in the shadows of two very different Jewish histories. It’s 1973 in Canada, and they really like each other – and each other’s parents. They want to embark on their own journey, but as their families meet, eat, misinterpret and overreact, will the older generation be a help -- or a hindrance? Performed at Chutzpah! Festival, Vancouver, 2015 / King’s Head Theatre, London, 2014 (sellout run). Developed on the Without Decor scheme, King’s Head Theatre. Nominee, 2015 Jessie Richardson Theatre Awards (Outstanding Actress in a Supporting Role, Outstanding Costume Design). ‘ A beautifully acted character play with hilarious dialogue … a laugh-out-loud snapshot of family dynamics. ’ –Vancouver Presents ‘ Appreciate[s] families in both their eccentricities and their depth. ’ –Georgia Straight Cabin Fever A woman is depressed. Nothing is helping. Not the cinema or travelling or clubbing. Her best friend realises what she needs, and it’s not in the city. This dialogue-free piece explores the narrative possibilities of tap dance and the interplays between tap and theatre. Created and performed with Thomas Kempf. Performed at Bush Theatre, London, 2013. Developed at Danceworks and Greenwich West, London with support from IdeasTap. Mentored by Sabrina Mahfouz (theatre), Avalon Rathgeb (tap dance). Fantasmagoriana Fleeing Britain in scandal, Lord Byron is pent up in Geneva with writer’s block and a male lover. Mary and Percy Shelley have come to visit, but why? And what will they do amid the nonstop rain? What starts as an innocent writing contest to quicken the heart and curdle the blood spawns surprise arrivals, rivalries and romance – and the most infamous creature the world has known … Frankenstein. Performed at the 2011 Edinburgh Festival Fringe with support from C Venues, Cambridge University ADC. ‘ A frolic through a traditional, quintessentially English passion for poetry and the art of writing. ’ –BroadwayBaby ‘ Strikingly witty and polished … intelligent, funny and certainly worth seeing. ’ –Varsity ‘ Twinkling with mischief … one wishes that it could go on all night .’ –Tychy@ the Fringe",
  "https_www_tamaramicner_com_yiddish": "Yiddish יידיש — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer Would you like to learn Yiddish ? װילסטו זיך לערנען ײדיש Yiddish Sof-Vokh, Sheffield, England, May 2023 I teach Yiddish with the University of Cambridge, Workers’ Circle , Hampstead Garden Suburb Synagogue and privately! This term, my group classes are… East End Jews - Mondays @ ​5-6.30pm ​BST (Zoom) | Workers’ Circle Beginners 1 - Tuesdays @ 10-11am ​BST | Hampstead Garden Suburb Synagogue Intermediate - Tuesdays @ 11am-12pm ​BST | Hampstead Garden Suburb Synagogue Intermediate - Tuesdays 6-7.30pm BST (Zoom) | Independent Beginners 1 - some Wednesdays @ 3-4.30pm ​BST | University of Cambridge Beginners 3 - Thursdays @ 5-6.30pm ​BST (Zoom) | Workers’ Circle Intermediate - some Sundays @ 5.30-7.30pm BST | Brighton (Independent) Credit: Lexi Clare Photography I also work with theatres and other organisations that need support with Yiddish translation, transliteration and pronunciation. This can include helping actors learn and pronounce Yiddish lines, reviewing and creating Yiddish-English and English-Yiddish translations, and teaching about Yiddish language and culture in the past and present. I have worked with Shakespeare’s Globe Theatre, Just Something Different Productions, Bear in the Air Productions and others. Get in touch if you’d like to speak about working together! Subscribe Sign up for ‘short but sweet’ updates every now and again. Email Address Sign Up We respect your privacy. Thank you!",
  "https_www_tamaramicner_com_ethics": "Ethics Statement — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer Ethics Statement Credit: Lexi Clare Photography A key intention of my practice is to build relationships with artists of many backgrounds, identities and communities. This is lifelong work. I intend for this process, as much as possible, to centre equity, safety, care, love, fairness, fun, and some amount of risk. I incorporate reflection and feedback into my practice, knowing that this work can be slow, messy and uncomfortable. I will make mistakes. I will keep taking risks. And I thank you, in advance, for your compassion and understanding. May this work be joyful, and may it help us along the path to justice and liberation for all life on earth. Thank you to Kim Senklip Harvey for inspiring this statement. Subscribe Sign up to get ‘short but sweet’ updates every now and again. Email Address Sign Up We adhere to GDPR laws in England. Thanks for signing up!",
  "https_www_tamaramicner_com_contact": "Contact Me — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer Get in touch! Credit: Lexi Clare Photography Please complete the form below",
  "https_www_tamaramicner_com_yankl": "Yankl & the Beanstalk — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer YANKL AND THE BEANSTALK A saucy Queer Jewish panto that will leave you gagging... for pickles, of course! Yankl is a hapless pickle worker on the Brick Lane, who's about to be bar mitsva. That is, if he can stop his fiery cousin Milly calling a strike at their workshop. With the help of some magic beans - and Bohemian Rhapsody in Yiddish - they'll climb up a beanstalk to find their Giant and seize the means of production. It's all bashert from above! Photo credit: Lucy Hayes What critics say about our world premiere @ Pleasance Theatre London (March 2025): “ Absolutely outstanding ” — Vashti Media “ Entertaining, saucy fun ” — Red Bus Londinium Life “ A queer coming-of-age story that delights and dazes ” — Everything Theatre Credit: Alex Jackson Creative Team Writer | Tamara Micner Composer & Sound Designer | Emily Rose Simons Producer | Jess Donn Director | Laura Wohlwend Musical Director | Ben Ward Stage Manager | Roshan Conn Set & Costume Designers | Lu Herbert & Johan Byron Berendsen Lighting Designer | Laurel Marks Aspiring Pickle Sponsor | Mrs. Ellswood Cast Romy Ben-Hur | Demii Lee Walker | Nay Oliver Murphy | Mai Weisz | Guy Woolf",
  "https_www_tamaramicner_com_old_friends": "Old Friends — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer OLD FRIENDS “ Warm-hearted ... inviting audiences to be candid about their experiences. ” — Justin Murray, My Theatre Mates “ A dazzling, fun show! ” — Audience feedback How long has it been since you spoke with your childhood best friend? How often do you miss them? Grab a blanket and a pint of Ben & Jerry’s and join Tammy for a good old-fashioned sleepover with a Zoom twist. Complete with PJ’s, midnight feast and Truth or Dare … We’ll reminisce about that one true friend who got away. Can we enjoy the close friendships as adults that we revelled in as kids? When can we finally mourn our friend breakups with ice cream and bad TV? Soundtrack by Simon & Garfunkel. Audience participation by you (if you like!). OLD FRIENDS is commissioned by Cambridge Junction and supported by Arts Council England. Our world-premiere digital tour in March 2022 was broadcast in partnership with Cambridge Junction, Cambridge Festival of Ideas & The Cockpit Theatre. Image: Martha Hegarty, Christa Holka Images: Christa Holka CREATIVE TEAM Tamara Micner | Writer & Performer Heather Ralph | Producer Tash Hyman | Dramaturg Becky Plotnek | Production Manager Matt Powell | Digital Designer Christina Fulcher | Movement Director Beril Yavuz | Lighting Designer Dinah Mullen | Sound Designer Isobel Nicolson | Set & Costume Designer Oonagh Murphy | Artist Wellbeing Supporter OLD FRIENDS: THE INSTALLATION The Old Friends Audio Installation is a series of letters to Simon & Garfunkel, written and recorded by Tamara and set to their 1968 album Bookends , released the day before Martin Luther King Jr.'s assassination. In the piece, Tamara reflects on growing up in the '80s and '90s, the myth of multiculturalism, and the legacy of migration and displacement in her family. Sound design: Dinah Mullen Image: Christa Holka, Danielle Painting",
  "https_www_tamaramicner_com_holocaust_brunch": "Holocaust Brunch — Tamara Micner Tamara Micner Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Home About New Work Past Work Yiddish יידיש Ethics Statement Contact Me Tamara Micner Theatre-maker  | Writer | Performer HOLOCAUST BRUNCH The war is over. Right? Using comedy and beigels, this funny and brave solo show asks how we can honour the histories we inherit whilst breaking free from them. Bringing to life the true stories of two Holocaust survivors connected to Tamara, the show pries open a communal wound, probing why we remember the Holocaust – and what it might look like to forget. Supported by Arts Council England, Canada Council for the Arts, British Columbia Arts Council, Battersea Arts Centre, JW3, Camden People’s Theatre and Chutzpah! Festival for the Performing Arts. Photo: Holly Revell Trailer: Rosie Powell Reviewers say ‘It makes us think anew about a topic that no one can afford to forget […] opening up a conversation about what the Holocaust means today.’ – Hackney Citizen ‘ A transfixing performance, stunning in its bravery, honesty and clarity, it is guaranteed to stay in the memory of all who watched it.’ – JLIFE ‘A piece of theatre [with] considerable force [...] Micner’s charm conquered all.’ ✡✡✡✡ – Northern Soul ‘Tamara subverts a narrative that depicts Jews as passive victims of the largest genocide in history. With vehemence and fierce humour, she honours her ancestors’ fight for their lives.’ – The Mancunion ‘She was the hostess; this was her brunch; she was warm and charming; and, as we were all friends now, there were a few things she wanted to get off her chest.’ – Number 9 Reviews Theatres say ‘ Holocaust Brunch carefully explored its subject matter in an original, sensitive and thought-provoking way. The show was very relevant to our local audiences and attracted a broad demographic.’ –artsdepot, London ‘Our audience were fully absorbed in Micner’s storytelling and many felt connected to her personal experiences, which were laid bare in exquisitely moving and painfully funny ways.’ –Manchester Jewish Museum ‘The show was thought-provoking, lively and entertaining, filled with life and an opportunity to hear a different part of the Jewish Holocaust story. We had a lively and deep post-show discussion afterwards, and great feedback from an engaged and interested audience.’ –The Place Bedford Creative Team Tamara Micner | Writer & Performer Becky Plotnek | Producer & Production Manager Yael Roberts | Projection artist Rachel Mars | Dramaturg Nick Cassenbaum, Victor Esses, Tom Ross-Williams | Outside eyes Dinah Mullen | Sound Designer Alex Fernandes | Lighting Designer Lauren Dix | Set & Costume Designer Mikaela Liakata | Video Projection Designer Upcoming performances Brighton Fringe, 6-10 May 2020 More to be announced! (Past performances include: The Place Bedford , Manchester Jewish Museum , artsdepot & Chutzpah! Festival )"
}