{
  "https_michli_co_uk_/https_michli_co_uk_media/content_4.html": "For all media enquiries, or to arrange a briefing or interview with Andreas, please contact the press office:\nEmail: [email protected]\nFor all media enquiries, or to arrange a briefing or interview with Andreas, please contact the press office:\nEmail: [email protected]",
  "https_michli_co_uk_/https_michli_co_uk_cdn-cgi_l_email-protection/content_5.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_michli_co_uk_/https_michli_co_uk_make-london-strong/content_2.html": "MAKE LONDON STRONG: Andreas Michli's Programme for London\nIn London, violent crime is the most pressing issue of our time. Every week, parents are burying their murdered children — and not a single other Mayoral candidate has a realistic and expert-backed plan to solve it. I do.\nWhen I am elected, I will deploy Operation BRENNAN — a comprehensive strategy to end knife crime in London.\nThis plan has been carefully considered and put together with the help of various experts in the field of policing and crime. A key stakeholder who we have consulted and received advice from is Norman Brennan, a veteran ex-police officer of 35 years whose credentials speak for themself.\nShort Term\n1. We will form a platoon of 200 of the Met’s finest, split into 4 squads and further sub teams, who will operate independently of normal police activities and have the ability to maneuver between boroughs depending on where the intelligence and reports lead them.\n2. We will hold yearly referendums in each borough on police stop and search powers. If people vote yes, then extra stop and search powers will be implemented within their borough immediately.\n3. We will introduce manned knife arches at hotspot TfL locations.\n4. When anyone over the age of 18 is convicted of a knife offense but not given a custodial sentence, their name and photo will be published on the Mayor of London website and in advertising space on TfL.\n5. We will hire new police staff to perform the administrative duties on arrests for minor offences such as shoplifting. This will allow the constable to get back out on the street and on the beat!\nMedium Term\n1. Form an expert-led Knife Crime Commission with the powers to trial new initiatives at postcode, borough, and city levels as appropriate. We have already consulted with these experts, and they are very eager to get started.\n2. Begin a police mentoring program for local children and teenagers, enabling officers to become more deeply integrated into the communities they serve.\n3. We will increase the frequency of police school visits, where officers give talks about how the police serve their community and stop crime.\n4. Install large sword sized amnesty bins in every London police station.\n5. Establish parent support groups in every borough to assist in parenting techniques on how to deal with children carrying knives.\nLong Term\n1. Re-Training of the current force & and reforming the academy’s recruitment/entry requirements, with new updated modules added on knife crime.\n2. Lobby the government to increase the maximum prison sentence for possession of a knife to FIVE years. Also lobby the justices department to ensure that custodial sentences are actually imposed on convicted offenders, as many of the offenders are getting away with non-custodial sentences.\n3. Lobby the government to introduce new laws that penalise parents for their children carrying knives by requiring them to sit in the dock with their child when in court, and compelling them to attend a 12-week course if their child is convicted.\n4. Build community centres with sports facilities for children up to the age of 18 to focus on prevention of crime rather than treating symptoms after the fact.\n5. Lobby the Department for Education to equip students with tools to prepare them for parenting. Criminal behaviour often has its roots in poor parenting, and right now Britain’s education system does nothing to prepare the next generation to raise children.\nNo other candidate is prepared to do what needs to be done – they are either too ignorant, too incompetent, or too scared to truly address London’s crime problem.\n- Significantly raise fitness standards required to become a police officer\n- Improve legal training for police officers. This will save time and resources in the long term, as officers will be experts in the laws they are enforcing\n- Train every police officer in defensive martial arts, ensuring officers can protect themselves while carrying out their duties and enabling them to detain suspects without causing harm\n- Depoliticise and professionalise the Met. The only concern that the police should have is protecting the public\n- Instruct the Metropolitan Police to end the recording of non-crime hate incidents (NCHI) and lobby the College of Policing to review its Hate Crimes Operational Guidance (HCOG)\n- Scrutinise officers’ records to ensure that individuals with a history of violent/sexually abusive behavior are expelled from the force\n- Raise police salary.\n- Deprioritise the enforcement of lighter drug offences (e.g. marajuana possession) and take a harder stance on hard drugs like crack and heroin\n- Subsidised gym memberships\n- Office of Mayor nutrition plans available to all\n- Make subsidised women’s sanitary products available in all toilets in public buildings\n- Promote and subsidise ovulation tests instead of the contraceptive pill\n- Centre health in advertising throughout the city. Ban ads promoting unhealthy lifestyles, e.g. obesity\n- Ban advertising of hyper-processed foods, e.g. “plant-based” meat alternatives and fast food\n- Reverse osmosis water filters fitted in every school and hospital\n- Facilitate the launch of a campaign aimed at promoting safety and public health with regards to the 5G rollout in London\n- Abolish ULEZ & Congestion Charge\n- Remove and auction off all infrastructure created to impose ULEZ, and reinvest the money in TfL\n- Get a handle on TfL’s finances. This will allow for cuts to travel fares\n- Begin the process of automating the tube\n- Explore funding options to fix every pothole in London and maintain high standards across all public highways\n- Begin the process of installing full platform barriers, as seen at Westminster and Waterloo, at every tube station\n- Optimise London’s cycle lane network to provide residents greater opportunity to travel by bicycle safely, whilst minimising potential impacts on motorists/traffic flow\n- Expand transport links (particularly overground and tube services) in South London boroughs\n- Introduce new bus routes for new developments before they are completed – providing better public transport links for residents\n- Enable holders of the Older Person’s Freedom Pass and 60+ London Oyster to travel for free 24 hours a day, 7 days a week\n- Publish an updated London Housing Strategy that prioritises:\n- Encouraging high density residential development. Build upwards, not outwards\n- Consulting with the boroughs to set ambitious housing targets for each local authority\n- Taking a more nuanced approach to the Green Belt, whereby land containing derelict structures are identified for potential development\n- Ensuring aesthetic standards, in-keeping with London’s historic building style, are adhered to by developers. Refer developments that do not conform to the Secretary of State for review\n- Commit not to impede local councils that wish to remove low traffic neighbourhoods and to hold referenda on this issue in every borough\n- Set aside funds to assist boroughs in providing community spaces, recreational facilities, parks and other common areas\n- Explore strategies to repurpose abandoned or unused commercial buildings/land for housing\n- Abolish net zero targets\n- Pursue an aggressive carbon offset policy which will include:\n- Planting 700 hectares of new tree canopy cover\n- Supporting the creation of at least 6 major new parks or nature reserves\n- Supporting the establishment of 100 new community orchards and at least 4 new large community farms\n- Create more jobs in public cleanliness – more street cleaners, more litter pickers\n- Clean up the Thames\n- Abolish unnecessary bureaucracy and “talking shops”, e.g. The London Partnership Board\n- Establish a Mayor of London radio channel, through which I will speak directly to the people of London on a regular basis\n- Lobby for the right of parents to view all teaching materials used in school, and for schools to be fully transparent about any resources supplied by third-party organisations\n- Produce statutory guidance for all London’s public sector organisations on free speech and the protected characteristic of belief\n- Use the power and influence of the mayoralty to resist the infringement of Londoners rights by central government\n- Reduce City Hall’s share of Council Tax to pre-Khan levels over the course of my mayoral term\n- Pressure the Government to increase the rateable value threshold at which SMEs start paying business rates",
  "https_michli_co_uk_/https_michli_co_uk/content_1.html": "Andreas Michli is a proud father, health and fitness entrepreneur, businessman, campaigner, and lifelong Londoner. He is the founder of one of London’s most acclaimed bodybuilding gyms, and he has dedicated his life to the pursuit of strength, discipline, and service to his community.\nDuring the COVID-19 lockdowns of 2020, Andreas was issued with over £120,000 in fines and ordered to close his business. He refused, fought his case in court, and won with costs awarded. Since then, he has increasingly felt that London’s so-called leaders do not have the city’s best interests at heart – and now, the time has come to do something about it.\nWith the Office of Mayor in his crosshairs, he intends to bring an entirely new style of politics to the halls of power: one informed not by a white-collar career, nor by a selfish will to power, but by a ruthless work ethic cultivated through years of bodybuilding, entrepreneurship, and fighting for everyones freedom.\nSubscribe to the Make London Strong Newsletter\nStay up to date on Andreas’ campaign with the weekly Make London Strong Newsletter. Hear directly from Andreas about the progress of the campaign, as well as his general thoughts on the state of London.\nContact\nDo you have any questions about Andreas, his campaign, or his programme for London? Do you want to support him or get involved? Use the contact form below, and we will get back to you as soon as we can.\nCountdown to the Election\nDay(s)\n:\nHour(s)\n:\nMinute(s)\n:\nSecond(s)",
  "https_michli_co_uk_/https_michli_co_uk_get-involved_campaign-for-andreas/content_3.html": "Campaign for Andreas If you would like to volunteer to campaign for Andreas, please fill out the form below and we will be in touch. Name Email Address Phone number 10 + 9 = Submit"
}