{
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk_blog/content_8.html": "A personal blog covering the lighter side of politics.\nExposing the truth about DEI, Diversity, Equity and Inclusion.\nDiscussing the damage caused by the disastrous Rachel Reeves budget and the outright attack on our farmers.\nA very social event with Roger Gravett the Reform UK London area organiser as the main speaker followed by Nigel's Mum talking about a younger Nigel. 13/12/24\nAnother successful branch meeting and a good opportunity to talk to members at the bar afterwards. 14/11/24\nAn evening organised by the oldest established Commons dinner club with Nigel as guest speaker. 12th November 24\nDiscussing Sadiq Kahn and fire arms officers of the Metropolitan Police. 9th November\nDiscussing dangerous migrants entering the UK. 31st October.\nHad the opportunity to question Robert Jenrick on Patrick Christys show prior to the final selection vote. 30th October.\nStudio co-host - 18th October.\nA view from the table, waiting for the the start time. Very happy to see Nigel's mum in attendance again.\nApplying as much pressure on Labour as we can to stop them implementing any increase on fuel duty. 15th October\nWe held what turned out to be a very successful first branch meeting in Hayes. Ben Habib was our main speaker, he was, as usual very well received, even by the black cat who join the head table. The two empty seats at the front and all others were filled before the start. 8th October.\nA superb lunch with our MP's in The Calvary & Guards Club. 8th October\nStudio co-host - 28th September\nA big thank you to The Spectator, the drinks sponsors and the crew of the Will for putting together such a wonderful event. A day of clays, claret, cognac and cruising on the Thames. I will definitely be booking again next year to defend my 'Spectator Magazine Clay Shot of 2024' title. 20th September 2024\nDiscussing the more worrying aspects of a Labour government. 11th September 2024\nCovering the static nature of 'Labour think' versus a more dynamic approach to taxation. 8th September 2024\nDiscussing the concept of things only getting worse under Labour. 28th August 2024\nAnother opportunity to put the world to rights. 20th August 2024\nDiscussing how to stop the riots.\nDiscussing whether Labour are under the thumb of the unions.\nBack with my sparing partner from the Workers Party, Nadia Klok on Dr Roger Gewolb's show. 14th July\nDiscussing the folly of Labour's housing plans.\nDo I think Starmer will reverse Brexit? Yes, via the back door.\nPost election breakdown of events. 5th July 2024\nAn incredible result considering the amount of time we had to mount a campaign. Thank you and well done to all the Bromley volunteers.\nDiscussing the campaign, Reform UK and the election tomorrow. 4th July 2024\nAlan Cook, Reform UK candidate for the Bromley and Biggin Hill constituency goes head to head with Nadia Klok of the Workers Party of Britain, candidate for Brent West in the 2024 UK General Election and London secretary of the Party.\n1st July 2024\nThank you to all who came to the stall today, truly unbelievable levels of support.\nWell done Biggin Hill Carnival organisers for a great day in the sunshine. No longer are people saying “I am voting for you”, now it’s my family, my office , my team, my friends are voting for you. There has been a palpable change in the levels of support especially in the youth. We can win Bromley & Biggin Hill. 29/6/24\nIf toots were votes, we would have a landslide victory in South East London on the 4th July.\nA truly unbelievable response today from motorists. 28/6/24\nAnother day, another station and a few support vehicles helping to get the message out there. 26/6/24\nAlan Cook on the The Lembit Öpik Show, TNT Radio 26th June 2024.\nA good turn out by the public, for the Bromley Experts by Experience hustings. We were short a few candidates though, another no show by the Tory’s.\nNot a bus, but the battle car has been travelling around the constituency for many weeks. Ben and I, having fun filming in front of Parliament today. 24/6/24\nAn afternoon in the sun on the verge of the A21. The support from commercial vehicles, from the smallest van to the largest dump truck was near 80%. The workers are clearly fed up with high taxes. It is time for real change.\nA friendly and fun hustings by the London South East Colleges. No show from the Tory’s, panic has clearly set in.\nHelping setup a London press conference, the election has been called, the heat is on. 14/6/24\nEarly arrival to another press conference. The Great British Tax Cut. Time to make work pay. 10/6/24\nInvited to speak at an event in Gillingham Golf Club. Thank you for a great lunch and the opportunity to say a few words. A good turnout and many Kent candidates in attendance. 9/6/24\nThe street stall in Biggin Hill received positive responses from nearly everyone, no negativity at all. I believe people are realising we are the only party offering the bold changes required to make a difference. Look out for the campaign car over the next 4 weeks and don’t forget to toot and wave. 8/6/24\nThe Reform UK, ‘mass immigration’ press release is in full swing and should put the cat among the pigeons. 30th May 2024\nAlan Cook on the The Sonia Poulton Show, TNT Radio 9th May 2024.\nShould Labour u-turn on its workers' rights plans?\nA third place for Alan Cook, Reform UK in the London Assembly vote for Bexley & Bromley. A very big thank you to the 27,603 who voted for me.\n2nd May 2024, the last hurrah for the Howard Cox taxi before it is re-wrapped for the Reform UK general election campaign.\nSpeeches from the Mark James the Orpington PPC, Alan Cook the Bromley & Biggin Hill PPC and Howard Cox.\nWe were a small team distributing the last of the Howard Cox and GLA team leaflets, on May 1st. The final day of campaigning for the London Mayoral and London Assembly Vote. Not a house or other vehicle in site but still in the ULEZ 'dirty air' Tax zone.\nIf toots were votes Howard would win with a landslide. Let’s hope the support we get on the side of the road translates to X’s in the ballot box. Our last road side event before the vote, done.\nBack behind the wheel for a quick drive to Eltham High Street in the Reform UK taxi with Richard Tice, Mark Simpson and Roger Gravett. An overwhelmingly positive response from the public there.\nThe topic of conversation was 'Do you trust Sir Kier Starmer'?\nA good turnout in New Eltham to listen to Richard Tice, Ben Habib, Howard Cox, Roger Gravett and Mark Simpson. Other Reform UK PPC’s & GLA candidates were out leafleting and talking to the public at a street stall near the station.\nWe had the ‘ULEZ exempt’ campaign car at the last anti-ULEZ protest before the Mayoral election. Don't forget to vote Howard Cox, Alan Cook & Reform UK, the only way to stop the war on the motorist and put some common sense into the London Assembly.\nA hustings held in Bickley by the charity “Experts by Experience”. Quite a humbling experience and one that really cements the importance of the position I am hoping to attain.\nDiscussing whether London has become a no-go area for Jewish people.\nA lunch with Richard, Lee and others, just what’s needed to inspire people to believe in the the UK our capital and the fact that you have a political choice.\nA few of the team members helping man the stall and deliver leaflets in the Shortlands & Park Langley ward.\nAlan Cook on the The Lembit Öpik Show, TNT Radio 31st March 2024.\nAlan Cook on the The Lembit Öpik Show, TNT Radio 24th February 2024. Live from the the Reform UK Spring Rally in Doncaster.\nA small selection of the team that helped deliver leaflets and talk to people in Sidcup High Street. A very positive day that ended with a laugh and a pint.\nBen Habib and Howard Cox talking at the Reform UK Kensington & Bayswater team fundraising lunch at Boisdale's restaurant and Jazz bar.\nFurthering the discussion on IP rights and AI creations.\nWe were blessed with the perfect day to kick off Ben Habib’s Wellingborough by-election campaign. Don’t forget, If you want change you have to vote for it.\nRaising the question of what was the role of the biologically confused leader of the Lib Dems in the failure to deliver justice for the victims of the Horizon scandal.\nWhen the enemy is within, no I would not join the armed services today. We need to remove the disease of wokeness from our services.\nPutting forward a case for Reform in the New Year and that you decide if it will be a dry squib and have it go with a bang.\nDiscussing Gender Ideology in schools and nearer the end of the program how many political lives has Rishi Sunak got left.\nDiscussing Harry and his legal dilemmas, not a subject I have any interest in so I changed the subject to canvassing with Richard Tice and Howard Cox in Romford Market.\nA morning canvassing and leafleting with Richard Tice, Howard Cox and many of our PPCs.\nSurveying London from above, planning podcasts with Howard Cox and Ian Collins.\nRaising the question of trust after the presidents of three of the top American universities questioned over student protests.\nSticking it to Rishi, the problems that the Tory's five pledges all relate to are issues that were either created or perpetuated by the current administration.\nAn opportunity to get the team together for a photo shoot followed by an election planning lunch.\nA truly fantastic Christmas lunch, well organised and well attended, thank you for my invitation.\nAnother good turn out, great conversation, people popping in and out with many staying past 10pm.\nPresenting my thoughts on David Cameron's appointment and his comments regarding the UK requiring closer ties with the EU.\nDiscussing whether Nigel Farage going into the jungle is a positive move for such a prominent politician.\nThere couldn't have been a better question for me to debate this week, \"Is it time for a new major party in British politics\"? With Reform UK gaining 3rd place in voter intention polls this week and with four of the polls putting us in double digits, only 8 points behind the Tory party, we are the new force in British politics.\nAn interesting 4 hours, luckily the bar opened at midday. I was told to 'pipe down' on many occasions for being too political. It is a shame that all the answers to all the questions raised were political and only Reform UK policy has the solutions to these problems. But it's not a political meeting, so the Tory councillor kept telling me. Howard Cox and Noel Willcox were both on good form and were very well received.\nAsking if Suella Braverman, being one of the last conservatives left in the Tory Party is actively trying to get herself sacked. My position was that it would not happen as it would deepen the rift, to the point of creating civil war within the party was proven wrong the next morning when she was sacked.\nThe head shaking, tutting and general disbelief coming from the whole audience over what Edmund was saying, forced Andrew Doyle to come back to me to counter the rubbish that was being spoken by the leader of The Climate Party. I gave him both barrels, to which he had no decent comeback.\nIt is always a pleasure to be invited to the GB News studio, so many like minded people to catch-up with and discuss current news and politics.\nDiscussing the rights and wrongs over Israel allowing for humanitarian pauses in the war against Hamas.\nPride of place by the Cenotaph on a glorious, sunny and cloudless day, remembering and respecting our fallen.\nPart of the Reform UK London Mayor and London Assembly team at a briefing session in City Hall.\nFirstly, discussing if we are winning the battle against cancel culture within the UK universities. Secondly, the hot topic of the week the potential new Muslim political party. The 'Party of Islam' had their registration with the electoral commission refused on a number of grounds. They will resubmit and when they are established what effect will it have on their historic political home the Labour Party?\nInvited on to Nana Akua's Great British Debate on GB News. Discussing Kier Starmer's position on Palestine, Israel and Labour's chances in the next general election if the new 'Party of Islam' manages to become a registered UK political party.\nA two day festival with too many topics to list here. The ones I attended were all related to net zero, the public support for this new global industry seems to be waning at quite a speed.\nDead heading the Rose.Discussing Dame Alison Rose, her obscene rewards and why was she not sacked.\nAnother good turnout, the anger is still growing over Sadiq Khan's tax on the poor.\nIn addition to Nigel Farage and Dr Starkey, other speakers are:\nAndrew Allison, Chief Executive of The Freedom Association\nCharlie Bentley-Astor, University of Cambridge graduate and free speech advocate\nNick Buckley, Founder of Mancunian Way\nDavid Campbell Bannerman, Chairman of The Freedom Association\nBaroness (Claire) Fox, Director of the Academy of Ideas\nMark Francois MP, Conservative MP and Chairman of the European Research Group\nMatt Goodwin, Professor of Politics in the School of Politics and International Relations at the University of Kent\nDr. Bryn Harris, Chief Legal Counsel at the Free Speech Union\nEric Kaufman, Professor of Politics at Birkbeck College, University of London\nDr Bernard Lamb, Emiritus Reader in Genetics at Imperial College, London\nMark Littlewood, Director General of the Institute of Economic Affairs\nRafe Heydel-Mankoo, Senior Fellow of the New Culture Forum\nLembit Öpik, former Liberal Democrat MP\nTim Scott, Treasurer of The Freedom Association\nTom Slater, Editor of Spiked Online\nAI & Sustainability: UN Sustainable Development Goals: Where are we now, and where can AI help?\nThe UN SDGs on paper all look positive but what lurks behind them may be construed as a unelected global body attempting to control aspects of otherwise independent nation states.\nThat said there was one outstanding project mentioned, one that improves the efficiency of large cement production plants, the driving force behind that AI product was environmental but the net result is money saving by the operator.\nQuestioning the guests over the Metropolitan Police's response to Jihad chants at protests.\nAn exceptional turnout considering the weather, approaching 300 people, half a dozen dinosaurs and a cockerel. Sirens, whistles, songs and hoots from passing motorists were heard for three hours in the High Street. Roger Gravett, Alan Cook, Mick Geeenhough and Howard Cox were present representing Reform UK.\nMonthly opportunity to meet and question your local Reform UK Party candidates. This month Mick Greenhough for Orpington and Alan Cook for Bromley & Biggin Hill attended. Next month there should be one, two or even three more candidates attending. Some people didn't see the small Reform flags next to our area and therefore didn't find the group, next month we will have a couple of balloons to make this easier!\nSupporting Howard Cox on his interview and lively Q&A session.\nAccompanying Howard Cox for an MP opinion survey for the APPG for Fair Fuel UK.\nAn interesting session with the focus on “Empowering UK Healthcare through Digital Innovation”.\nIn an interesting and lively episode, I managed to put Andrew Doyle right regarding Nigel Farage and which party he is really interested in. I also mentioned the fact that even senior Conservatives that I've spoken to don't believe that they will win the next election. To top it off I had the opportunity to discuss politics, the SDP and Reform UK, with John Cleese.\nA night of good food, good speeches and good company.\nSome speeches from the day are available on the events page.\nA like minded organisation that is backing common sense answers to issues, high-lighting the attack on our freedoms and democracy. A very well attended event and fun after party.\nReform UK spokesperson and London region county organisers social/training evening.\nBack in the GB News studio with Howard Cox who was debating with Ed Gummell the leader of The Climate Party. I was talking about the rise of the anti establishment vote in continental Europe and how we should see the same in the UK.\nWith 58 of the 60 tickets sold it was very nearly sold out. A very enlightening and enjoyable event. A big thanks to the O'Neill's team in Bromley for making us all so welcome and also to Ben, Howard and Roger for their help and speeches.\nNot a positive result today but the battle for a judicial review continues.\nThe first of the Reform UK, Bromley & Biggin Hill social meetings, held at the Wetherspoon pub the Richmal Compton which is opposite Bromley South station. A good turnout of about 20 people, we're intending on holding these every 4 to 6 weeks, details will be placed on the events page.\nAn amazing turnout for the anti-ULEZ Convoy 3. One which saw the first outing of the ULEZ free, Jaguar campaign car, hopefully the next time it is out it will be wrapped in the party colour.\nThe Reform UK London and Westminster spokesman, Luke Wates organised a meet your Mayoral candidate drinks reception..\nAnother very well supported Anti-ULEZ Protest, with Sirens, bells and whistles on the pavement and horns from the support vehicles we made ourselves heard in Parliament.\nSteve and me go back a long way, sometimes I actually agree with him.\nA Britain Club breakfast event in the Commons.\nAfter the 4th September Labour cabinet reshuffle a group of peers in the Lords congratulated Lord Peter Mandelson on getting back into power; a reference to the number of Blairites moved into the shadow cabinet. With the myth of the rift between Starmer and Blair blown away, the reality is that both Blair and Brown have Starmer's ear. The reach of the corporate, globalist bodies and billionaires has its route directly into the Labour Party leadership.\nDue to the upcoming by-election, which is now imminent following the long awaited resignation of Nadine Dorries, I joined a Reform UK team canvassing in Pulloxhill for Dave Holland, our Mid Bedfordshire candidate.\nOur protest started with a group of 40 protesters slow walking the 'Coffin of Democracy' from Charing Cross to Downing Street. I followed the procession in the Reform UK taxi. Both Richard and Howard gave speeches at the gates to Downing Street. Nigel Farage, who just happened to be driving past, jumped out to meet and greet friends, colleagues and protesters. I also bumped into a dear old friend, Nigel Evans MP.\nRichard Tice, Downing Street\nReform UK Taxi - Downing Street\nAlan Cook & Howard Cox, Downing Street\nHoward, Noel, Richard & Alan Cook\nHoward Cox, Downing Street\nAlan Cook & The Deputy Speaker Nigel Evans MP\nSpeeches and an open discussion on the damage caused by ULEZ, followed by planning for tomorrows Downing Street protest.\nAnother very well attended and good natured Anti-ULEZ protest, one which an image mirroring a fictional movement has been picked up on by many a news organisation.\nAnti-ULEZ Protester\nAlan Cook & Howard Cox\nMail Online\nIndependent\nMail Online\nThe Telegraph\nThe Ride to Freedom had many starting places the most famous being the Ace Café London. Other starting points included Clacket Lane services, Cobham services, Heston services, South Mimms services and Thurrock services. I met up with Howard in Bromley and drove the Reform UK taxi to meet our convoy group at Clacket Lane services. A very well organised event, which it needed to be considering the number of attendees. Speeches by Howard Cox, Lembit Opik, Phil Elliot and Kingsley Hamilton.\nLembit Opik - Motorcycle Action Group\nHoward Cox, Alan Cook & Phil Elliot\nPhil Elliot - Ride to Freedom\nHundreds of locals turned up for the third Orpington Anti-ULEZ protest. Howard Cox, the Reform UK Mayoral candidate and I were there for the duration and spoke to many protestors, passers by and motorists. Not one person who spoke to me was in favour of the ULEZ expansion. We were later joined by both old and new tractors and a large crop sprayer for the parade.\nA great opportunity to speak to people in my constituency who will be directly affected by the upcoming ULEZ tax. I was left disturbed by the devastating effect that this tax will have on individuals, small businesses and communities. It has highlighted that we are fighting in the correct corner and that we need to raise the level of protest to protect the public.\nNot only an amazing family day out but also a wonderful opportunity to discuss politics with Alex and Belinda, two very knowledgeable ex MEP's who are involved in and incredibly passionate over the future of UK politics.\nThe week when Nigel Farage went public regarding the recent attempts by the financial sector to cancel him, I asked of the Free Speech Nation Panel, \"was it right to label Jeremy Clarkson sexist because of his bad taste column on Meghan Markle\"? I struggle to follow the logic of the decision\nof the Independent Press Standards Organisation (IPSO)\non the grounds of sexism. The IPSO has encountered much criticism over their decision from many defenders of freedom of speech, of expression and that of the press.\nThe first Reform UK Bromley High Street stall was very well received by almost everyone, only a single person seemed very upset over politically active people being out and about having open, polite political discussions. Hundreds of leaflets were taken and many conversations regarding the current state of British Politics were had. The number one issue highlighted by the public was immigration followed by the cost of living, many were of the opinion that it is the government's race to 'net zero' that is the root cause of the inflation we are experiencing. I would add the relentless quantitative easing over the last few years has also been a major contributor.\nPatrick Christys, the GB News presenter, came over for a chat and photo opportunity before his evening's charity strip with The Dreamboys in Churchill Theatre. Patrick has managed to raise approaching £90k for his chosen charity MIND.\nGreat to see new faces in the Meopham meeting. The Kent area meetings are growing in numbers and are certainly becoming an outlet for like minded people to have passionate and lively political discussions.\nThe Reform UK London Mayoral candidate, Howard Cox and I, showing support for the protesters and cementing our Party position that we will scrap ULEZ in its entirety alongside Low Traffic Networks (LTNs).\nAn opportunity for Howard Cox, the Reform UK London Mayoral Candidate, to talk to members and supporters in Sidcup, Kent. It was well attended by local potential parliamentary candidates from the Party including Roger the London regional organiser, Mark Simpson the spokesman for Eltham, Mick Greenhough the spokesman for Orpington, and Alan Cook spokesman for Bromley & Biggin Hill.\nThe Alma hosted us well and proved to be a fantastic venue for such an event.\nDue to the resignation of Nadine Dorries there will be a by-election in Mid-Beds. I attended the official launch of Dave Holland – Reform UK Party Constituency Candidate for Mid Bedfordshire. The whole event was very well received and only interrupted by a live streamed interview of both Richard Tice and Dave Holland with GB News.\nhttps://www.dave-holland.co.uk/\nI was invited by an old friend to meet William Clouston, the leader of the SDP. My friend Steve Kellerher is the London area organiser for the SDP, I know him because we stood in neighbouring constituencies in the 2019 general election. William and I had a great time discussing the dire straits that UK politics is in, we also briefly covered SDP policy, mainly where it deviates from Reform UK policy.\nThe main purpose of the SDP's evening meeting was an open discussion titled, 'Why did the global political class back lockdowns despite devastating impacts, particularly on the poor? ', this was held between William Clouston and Toby Green, author of 'The COVID Consensus'.\nIt was great to catch up with Francis Foster at Andrew Doyle's Free Speech Nation GB News show. A few years ago I took a stage craft course with Francis at a central London club. Between him and Leo Kearse, freedom of speech is certainly not being held back.\nToby Young interviewed Isabel Oakeshott about the Lockdown Files live on stage at the Unherd Club, 6 Old Queen St. London. It was truly fascinating to get not only the actual facts behind, but also the mentality of, the people making serious government decisions. If anything can convince you that we need a change of Government, these WhatsApp messages ought to do it. There is more to come and not just the missing March\nWhatsApp\nmessages that will hopefully be given to the COVID enquiry. The interview was followed by dinner and a wonderful opportunity to discuss the topic further over dinner with Richard Tice, Isabel Oakeshott and Toby Young at our table.\nKent planning meeting, six local candidates and the area organiser.\nA rather rare early adjournment of the Commons created the opportunity for a drink on the Terrace with friends. This allowed me to let the cat out of the bag, that I have left the Conservative Party. That I have joined Reform UK and will be standing as a candidate for them in the Bromley & Biggin Hill constituency at the next general election.\nDue to my participation in the ‘All Party Parliamentary Group for Blockchain’ the talks I found most relevant and interesting were the ones covering regulation.\nOn Wednesday this week the EU 'Markets in Crypto Assets (MiCA)' regulation was passed into EU law. Now that their crypto market has a core of regulation this will remove uncertainty and should increase investment in the sector. The UK regulators have stated that they want to get crypto regulation correct on the first attempt, a good sentiment but also a delay that will hinder investment in the UK crypto markets. Having said that, I believe the private investor requires a level of protection greater than for similar non-crypto products. There is a reason why so many pundits refer to crypto assets as a form of gambling.\nOn a political note, through the proliferation of not only credit and debit card 'touch and go' but also smart phone payment methods, cash is being used less and less. Some businesses no longer accept cash at all. We need to protect the members of our society who either do not have ability or the desire to be completely cashless.\nA lunch in the stunning surroundings of the Cavalry & Guards Club, Piccadilly, London. An opportunity to share our thoughts with the Party leadership and put across what we believe the Party's priorities ought to be over the next 12 months. Guests included Richard Tice, Ben Habib, Howard Cox and a talk on the 'Lockdown Files' by special guest Isabel Oakeshott.\nRichard drove the Reform UK taxi from Kent to London Bridge. As we crossed London Bridge the reception we received was nothing short of outstanding. Many hundreds of people with air horns and whistles shouting and cheering. A very good natured protest that received almost total support from passing motorists. A great turnout with an almost carnival atmosphere.We parked the taxi, and joined Howard Cox the Reform UK Mayoral candidate walking the bridge, hand shaking and talking to the protesters.\nStreet stall near New Eltham Station. Many people coming to the stall and enquiring about Reform UK and its policies. A great morning that was full of super positive responses from the public and a good number of leaflets handed out. The morning was topped off with a visit by the Reform UK leader Richard Tice, driving the 'Cox 4 London' taxi, our mobile advertising vehicle for Howard Cox the Reform UK London Mayoral Candidate.\nA glorious summer's day and great exercise delivering hundreds of leaflets in the New Eltham area with Mark Simpson the Reform UK candidate for Eltham.\nIf you are not currently concerned over a future Labour Government you ought to be.\nThe talks were led by John McDonnell MP the Labour ex-shadow chancellor, I was expecting a discussion on how to make the large global corporations pay their due in taxes, the Amazons of this world, but no!\nWhen we should be looking at reducing the size of both the Government and the civil service, looking into cost reductions, optimizing and cutting out waste, the forward thinking from Labour is considering the opposite. New taxes, new departments to gather these taxes and to add further to the misery created by having the highest taxation for 70 years, they are looking into capital taxes, land, property, wealth tax and inheritance: they all came under scrutiny. This is not the rich and powerful being discussed but the working classes. During the discussion on taxes, 'justice and equality' was mentioned numerous times, but what was very telling is that 'fairness' was not mentioned even once. They are not just looking at ways to increase tax income but also 'replacing capitalism' was part of the evening's agenda.\nThis is worrying for anyone with even a hint of aspiration, however my thought of the day is, 'keep voting Tory and you'll eventually get Labour!'\nA Discussion hosted by the Ex-Shadow Chancellor John McDonnell MP and chaired by Eva Pascoe, Cybersalon.\nThe speakers were Simon Youel, Head of Policy & Advocacy at Positive Money, Izabella Kaminska, Senior Finance editor at Politico and Brett Scott, author of Cloud Money: cash, cards, crypto & the war for our wallets.\nIt was a lively evening made all the more interesting by the difference of opinion not only within the audience but also between the speakers. Being involved with the APPG for Digital Skills which is proud to push for digital inclusion and up-skilling I was very disapointed that this room, even though full of socialists was not overly concerned for the people who are not digital savvy or don't have access to computers or smart phones, there was very little concerns over the managed decline of cash and the Pound in our pocket.\nI was not chosen to speak even though late last year I attended a round table with the Bank of England discussing CBDC's. The Bank is currently team building and stated that a product would not be ready for implementation until the end of this decade, therefore the real threat to the cash in our pockets will more likely come from stable coins as they will soon be regulated by the imminent passing of the ' Financial Services and Markets Bill'.\nStanding room only, a very well attended evidence session on 'Industrial Policy & Artificial Intelligence:\nWhat should our AI Industrial Strategy be?\nWith a forward by the Minister for AI & IP - Viscount Camrose and chaired by Lord Clement-Jones CBE & Stephen Metcalfe MP\nAdvisory board meeting prior to the Evidence Session on 'Industrial Policy &\nArtificial Intelligence.\nChairs: Lord Clement-Jones CBE & Stephen Metcalfe MP.\nWe were pretty much all in agreement that the incredibly fast pace at which AI is developing, trying to regulate it would not be possible due to the methodical nature of the political mechanism required to do so, the way forward for the UK is to take the lead, formulate and agree industry AI standards.\nHoward Cox of Fair Fuel UK announced as the Reform UK London Mayoral Candidate.\nDiscussing the finer details of next years Mayoral election with Gawain Towler - International PR Consultant and Martin Daubney - GB News Anchor, journalist and Ex-MEP.\nFund raising Dinner - Derbyshire County Cricket Club\nA great night catching up with old friends and making plenty of new ones. It was a high spirited evening that even the persistent downpour throughout the day couldn't dampen, indeed the sight of two Mallards on the cricket pitch only served to raise the spirits even higher. It was a great opportunity to help the party raise funds and have unfettered access to the Reform UK Team from the Leader down. After many, many conversations on Politics, CBDC's, blockchain and other subjects, a small donation, a Party tie and a double win on the raffle, the night drew to a close.\nAfter spending my morning in Speakers Corner listening to 'Let Women Speak', I was requested to question the 'Free Speech Nation' panel over protections for women who speak out for women's rights.\nAt The Reformer's Tree in Hyde Park which is slightly South West of the traditional\nMarble Arch Speakers Corner area, the women's rights activist Kellie-Jay Keen-Minshull aka 'Posey Parker' and many others spoke at length but with passion covering the erosion of women's rights by the trans extremists lobby. Although clearly on the correct side of the gender discussion some of the speakers were a little too anti-men for my liking. Also in attendance was Laurence Fox the leader of The Reclaim Party, whom I found, rather surprisingly, far less critical of the Conservative Party than the leadership of Reform UK is.\nEvidence session of the All Party Parliamentary Group on Artificial\nIntelligence in the House of Lords covered National Security & Defence:\nAutonomous Weapons.\nChair & Co-Chair - Lord Tim Clement-Jones & Stephen Metcalfe\nSpeakers\nRt. Rev. Steven Croft, Lord Bishop of Oxford.\nTaniel Yusef, UK Campaign to Stop Killer Robots.\nMariarosaria Taddeo, Assoc. Prof. & Senior Research Fellow, Oxford Internet\nInstitute.\nVerity Coyle, Amnesty International.\nDr Sidharth Kaushal, Royal United Services Institute (RUSI).\nDr Daniel Clarke, Rebellion Defence.\nHaving previously designed an autonomous vessel, I\nfound this discussion very interesting. I was the lead designer of an unmanned,\nfully autonomous, satellite controllable, 3d printed, hybrid - vertical wind\nturbine and solar energy charged, electric ocean going vessel. This device was\nnot a weapon but a tool for ocean research and remote sporting events.\nWe entered the realm of intelligent weaponry many\ndecades ago, however the possibility of Artificial Intelligence and Machine\nLearning being used for target selection does raise many ethical\nquestions. Robotic deadly force is a frightening prospect, but so are nuclear\nweapons!\nA frightening weapons platform is also a great\ndeterrent, development will continue but at least we have a forum to progress\nthe world wide regulation covering the implementation of these technologies.\nAPPG Blocchain evidence meeting 22/6 at the UK House of Commons hosted by Martin Docherty-Hughes MP, Professor Birgitte Andersen from Big Innovation Centre, Lord Chris Holmes and Lord Cromwell.\nVery happy to see two representatives from 'Stratis Platform', Iain McCain and Krushang Patel\nin Westminster, all of our previous meeting have been here in Bromley, Stratis are one of the UKs leading layer-1 blockchain platform providers.\nAlso the 'Head of Change Strategy at the Department for International Trade', Gintare Geleziunaite, was in attendance showing interest from our Governmental trade bodies in Blockchain.\nA recurring topic in all of the recent meetings has been the need for regulation, soft touch and expedient regulation and not the layers of red tape that has often come from our regulatory bodies.\nReform UK - Bromley & Biggin Hill",
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk_links/content_3.html": "Menu\nHome Page\nBlog\nBio\nPolicies\nEvents\nLinks\nMedia\nSubscribe\nExternal Links\nReform UK\nfairfueluk.com\nNet Zero Watch\nThe Freedom Association\nFree Speech Union\nHeterodox Academy\nALLIANCE OF BRITISH DRIVERS\nThe Daily Sceptic\nCLintel\nTax Payers' Alliance",
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk/content_1.html": "Reform UK London Borough of Bromley Branch\nBromley & Biggin Hill, Orpington, Beckenham & Penge\nNot receiving local branch emails, subscribe via the branch subscribe page.\nDon't change your politics change your party\nJoin or donate to Reform UK today, Britain's fastest growing political party, click here to visit the Reform UK main website\nI caught up with Nigel in the green room after the press conference, and what an announcement, Nigel as leader and standing in Clacton. Great news indeed. We are in the midst of a 100 year event in British politics, joint the revolt. join Reform UK.\nWe pay a tax, 'Vehicle Tax' to drive on the roads.\nWe pay a tax, 'Fuel Duty' on the fuel we use when we drive.\nWe pay value added tax, 'VAT' on the fuel we buy.\nWe pay value added tax, 'VAT' on the Fuel Duty Tax.\nWe pay the Congestion Charge tax to drive in central London.\nWe pay the ULEZ tax to drive in greater & central London.\nThe freedom given by personal transportation should not be taken for granted and should not be the preserve of the wealthy.\nReform UK is the party for the motorist, Howard Cox, (Fair Fuel UK) the Reform UK Mayoral candidate has already saved the UK motorists billions of pounds.\nbromleyandbigginhill@reformuk.com\nPromoted by Reform UK - 124 City Road, London. EC1V 2NX",
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk_bio/content_7.html": "I am not a socialist,\nI therefore had deep concerns over the UK’s\nfurther integration with the EU project.\nNot only was the promised referendum on the Maastricht Treaty in 2006 delayed indefinitely, but David Cameron's \"Cast Iron Guarantee\" for a referendum on the Lisbon Treaty in 2009 was broken. This overt politicising of the trading block and the removal of democracy in the process was enough for me to dedicate time, effort and money to a move into politics that culminated in me standing as a parliamentary candidate for the Brexit Party in 2019. Afterwards I joined the Conservative Party, and started their candidate selection process. My plan was to change the party for the better from within, to push for a party that put the UK first, had full control of its borders, a low tax outlook and a party that believed in full sovereignty and self-determination. It didn't take long for me to realise that the direction of the Party was not going to change, in fact the global socialist view over the national one was always going to win.\nAfter a long conversation in the Commons\non the subject of immigration with David Davies MP and Sir Bill Wiggin MP, I realised that there is just not the political will to solve or reverse, what the general public see as being detrimental to the UK, its culture and its future. That week I cancelled my Conservative Party membership and joined Reform UK.\nReform UK is the only Party, through the application of common sense and being free from the restrictions governed by a left or right political ideology, that represents the man in the street, family values and puts the national interest first. For the past century it has been the case that if you keep voting Tory eventually you get Labour. The perfect storm is upon us, this may be our once in a century opportunity to break the two party system and create a real choice in British politics.\n-----------------------------------------------------------\nI am a member of the All Party Parliamentary Group (APPG) for Artificial Intelligence\na member of the APPG for Blockchain\nI am also involved with the APPG for Digital Skills\nand the APPG for Crypto & Digital Assets\n---------------------\nI am the Vice-Chair of a Parliamentary debate club that believes in promoting and fighting for the golden principles of a free society, personal freedom, limited government, national self-confidence & enterprise culture.\n---------------------\nI have served on the environmental committee of a residents society, have been the Co-Vice Chair of a charitable society and was voted onto a Neighbourhood Forum by residents.\n---------------------\nMy parents met in the services, my father was in the Fleet Air Arm and my mother was in the Women's Royal Naval Service. I was born in a RAF base, my family moved to South East London just before I was one year old. I grew up, I was schooled and secured my first job whilst living in Sidcup then Bickley.\nMy second job was with\nthe Prudential in Holborn Bars\nworking as technological support for a team of actuaries. I moved internally to the fund management team covering the Far Eastern markets. My next move was to become a freelance IT consultant, this change in my career direction saw me working for a great number of the Investment companies, banks and insurance companies that populate the City and beyond. Currently my family and I split our time between Bromley and Westminster.\nReform UK - Bromley & Biggin Hill",
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk_media/content_6.html": "Menu\nHome Page\nBlog\nBio\nPolicies\nEvents\nLinks\nMedia\nSubscribe\nALAN COOK\nParliamentary Candidate\nREFORM UK -\nBROMLEY & BIGGIN HILL 2024\nBrexit Party - Old Bexley & Sidcup 2019\nLondon Assembly candidate for Boroughs of Bexley & Bromley 2024\nAvailable for interviews and media appearances in Bromley, Westminster and Zoom.\n07951 680314 - Alan.Cook@ReformUK.com\nRecent\nAppearances\nGB NEWS - NANA AKUA\nGREAT BRITISH DEBATE\n30 appearances\nDiscussing selected news stories of the week\nTALK TV\nANDRE & ASH SHOW\nAs a zoom guest and in studio co-host.\nTNT RADIO & TV\nVarious shows\nover 20 appearances\nDiscussing politics and recent stories in the press\nThe Gospel according to Dr Roger GEWOLB\nTHE LEMBIT ÖPIK SHOW\nTHE PELLE NEROTH TAYLOR SHOW\nTHE MUCKRAKERS\nTHE SONIA POULTON SHOW\nCroydon Constitutionalists\nOctober 17th 2023\nInterviewed by the Croydon Constitutionalists\nLink opens a new tab.\nhttps://croydonconstitutionalists.uk/alan-cook-bromley2023/",
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk_subscribe/content_4.html": "- You need to tick the opt in box to receive emails from your branch -\nreformparty.uk - privacy_policy",
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk_policies/content_2.html": "Our Contract is not just another party manifesto. It sets out the reforms that Britain needs in the first 100 days following a general election and thereafter. It has been produced with advice from a range of independent economists, think tanks and advisors on savings and costings.\nReform UK - Bromley & Biggin Hill",
  "https_www_reformukbromley_co_uk_/https_www_reformukbromley_co_uk_events/content_5.html": "Events for the London Borough of Bromley Branch\nMain speaker is Lembit Öpik\nMain speaker is Gawain Towler - NEW VENUE\nProfessor Matthew Goodwin\nTuesday 25th February - 7:30pm for 8pm\nProfessor Matt Goodwin will be our guest speaker.\nBromley United Services Club\n33 London Rd, Bromley BR1 1DG\nBar available before, during and after.\nAlan Cook, Julien Grainger & Gary Stevens\nMain speaker is Roger Gravett\nMain speaker is Simon Fawthrop\nMain speaker is Howard Cox\nHear from Howard Cox our London Mayor candidate 2024 and from your branch team.\nThursday 17th October 7:30pm\nRoyal British Legion\n58 Queensway, Petts Wood, Orpington BR5 1DH\nFull bar available\nHear from Ben Habib and your branch team.\nTuesday 8th October 7:30pm - 8pm start\nThe Victory Social Club\nKechill Gardens, Hayes BR2 7NG\nTea & coffee available\nPlease call if you wish to join us on any of these days. 07951 680314\nMonday 1st July\nLeafleting in Bickley from 10:30, meet at my house.\nTuesday 2nd July\nLeafleting in Bickley from 10:30, meet at my house.\nWednesday 3rd July\nGreeting & leafleting Bromley South Station 4:30pm - 6:30pmSocial drinks meeting in the Richmal Crompton from 6:30pm\nSaturday 29TH June 11:30AM - 5:00PMChurch Road Recreation Ground TN16 3LB\nDue to illness the campaign bus is no longer available this weekend, we will be setting up a street stall outside Bromley South train station and leafletting the local area. Please do come along to help out and meet Howard and the team from 10:30am.\nBromley Action Day and street stall in Market Square on the 3rd February from 12pm. Join Howard Cox our Reform UK Mayoral candidate and members of our London Assembly team and local PPCs.\nIf any volunteers would like to help delivering leaflets locally please arrive at 10:30 sharp. We will divide you into small teams and walk the local residential streets delivering leaflets.\nIf you are willing and available please do email so we have an idea of numbers,\nplease also email if you would like to help out on the stall and handing out leaflets in the high street.\nBromleyandBigginHill@reformuk.com\nAs well as hearing from party leader Richard Tice, our Mayoral candidate Howard Cox will be outlining his bold, positive plan for London and challenging Sadiq Khan. After the speeches, you will have the opportunity to ask your questions directly.\nPlease know all your support is very much appreciated and all funds raised go towards helping us locally.\nTwo-Course Meal\n26th January 2024 6:30 pm for 7:00 pm until late\nThe Alma, Sidcup\nTickets will be £145.00 and are limited in number, so bookings will be taken on a first come first serve basis.\nTo book please call 0800 414 8525, between 9.30am-4.30pm Monday to Friday, and ask for Alison who will take your details and book you a place.\nBoth Howard Cox our Reform UK mayoral candidate and Alan Cook the candidate for Bromley & Biggin Hill will be there, please come alone and say hello. Bring a whistle and make yourself seen and heard. This is not a Reform UK event but the party is very much against this tax on the poor.\n2023 Conference speech\n2023 Conference speech\n2023 Conference speech\n2023 Conference speech\n2023 Conference speech\n2023 Conference speech\nBen Habib appointed Joint Deputy Leader\nMeet, greet and listen to:\nBen Habib, business man and ex MEP.\nHoward Cox, Reform UK London Mayoral candidate.\nAlan Cook, Reform UK candidate for Bromley & Biggin Hill.\nAlso in attendance will be one or more ex-MEPs. The event will take place in The Old Brewery Room which is located on the first floor up a single flight of stairs.\nThe event will be partially seated so arrive early for the best chance of securing a seat. The premises are licensed, there will be plenty of opportunity to purchase refreshments.\nReform UK - Bromley & Biggin Hill"
}