{
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_author_steve_page_3/content_17.html": "by steve | Mar 22, 2024 | Uncategorised\nCornwall has ranked as one of the worst regions for ‘Deaths of Despair’, a study has found. Deaths of Despair (DoD) are socially patterned fatalities typically attributed to drug and alcohol misuse and suicide. They tend to occur much more frequently in socially...\nby steve | Mar 11, 2024 | Uncategorised\nThe Police and Crime Commissioner (PCC) elections in Devon & Cornwall are taking place on 2 May – but are you ready to vote? You will now need to show an approved form of photo ID at polling stations when there is a Parliamentary or Police and Crime Commissioner...\nby steve | Mar 11, 2024 | News\nThe South West is blighted by shop theft – with incidents 50% higher than five years ago. 30% of independent convenience stores in the South West – which make up 70% of the total convenience sector – have reported an increase in shop theft. The cost to a typical Devon...\nby steve | Feb 29, 2024 | News\nWith the approach of the 2024 elections, the Liberal Democrats have sharpened their focus on law enforcement and criminal justice – areas vital to the well-being and security of the public. Their crime and policing policies strike a balance between Prevention,...",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_03_11_get-your-vote-in-on-may-2-what-you-need-to-know-about-voter-id/content_22.html": "The Police and Crime Commissioner (PCC) elections in Devon & Cornwall are taking place on 2 May – but are you ready to vote?\nYou will now need to show an approved form of photo ID at polling stations when there is a Parliamentary or Police and Crime Commissioner election. Full details are available here.\nIf you are registered and eligible to vote you can either vote:\n• in person at a polling station\n• by post. You can apply for postal voting here.\n• by proxy (allowing someone you trust to vote on your behalf). Find out more here.\nPhotographic identification is a mandatory requirement for everyone voting at polling stations, since the Elections Act 2022.\nPhoto ID is accepted, including a driving licence, passport, Older Person’s Bus Pass, a blue badge or Disabled Person’s Bus Pass. The full list of accepted ID can be found here.\nYou can also use an expired ID as long as the photograph is still a good likeness.\nIf you do not have accepted photo ID, then a free Voter Authority Certificate can be obtained online here. Applications must be submitted by Wednesday April 24 to be processed in time for the May 2 election. The Voter Authority Certificate is valid for 10 years and is valid for all elections.\nRemember – put your cross in the box for Steve Lodge! Thank you.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_contact/content_10.html": "Contact Steve\nUse the form below to send a message to me. If you would like a response please include a telephone number or email address.\nAny information you provide will only be used for the purposes of the contact requested, and is not stored other than in the email inbox of the recipient.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_category_uncategorised/content_20.html": "by steve | Mar 22, 2024 | Uncategorised\nCornwall has ranked as one of the worst regions for ‘Deaths of Despair’, a study has found. Deaths of Despair (DoD) are socially patterned fatalities typically attributed to drug and alcohol misuse and suicide. They tend to occur much more frequently in socially...\nby steve | Mar 11, 2024 | Uncategorised\nThe Police and Crime Commissioner (PCC) elections in Devon & Cornwall are taking place on 2 May – but are you ready to vote? You will now need to show an approved form of photo ID at polling stations when there is a Parliamentary or Police and Crime Commissioner...",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_03_29_support-our-burglary-response-guarantee/content_15.html": "Everyone deserves to feel safe in their own home.\nBut last year there were 45,233 reported burglaries where a police officer didn’t then visit the scene of the crime. Too many victims are let down while criminals are getting away with it\nReports have shown that as many as 4 in 5 burglaries reported in England and Wales have gone unsolved since 2019. Families deserve more justice than this.\nLiberal Democrats want to see a Burglary Response Guarantee – that all burglaries will be attended by police and properly investigated. You can back our plan here:",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk/content_1.html": "Steve Lodge\nSteve Lodge is the Liberal Democrat for Tiverton West in the Devon County Council elections on May 1, 2025.\nI WANT TO BE YOUR VOICE IN DEVON\nLet’s face it – the Conservatives at County Hall have lost touch with our community.\nOur local roads are crumbling. Our children are being left behind at school. Our social care costs are spiralling out of control. Budgets are routinely overspent with little to show for it.\nIf Devon County Council was a business it would be bankrupt after years of mismanagement and poor leadership. Communities like ours are ignored, left behind, and voiceless.\nThe County Council are failing to repair Devon’s roads. Children’s services have been found to be inadequate or requiring improvement for over a decade under their leadership. They have failed to invest in our communities and have run Devon’s finances into the ground.\nConservative neglect has made Devon the Pothole capital of England, with a £200 million backlog of repairs after wasting money on private contractors that don’t deliver value. Liberal Democrats will fix our roads by investing in repairs and improvements, bringing highway maintenance back in house, and ending the lunacy of leaving potholes only half-repaired.\nWe deserve better than further failure, and together we can achieve it! I am proud that my Liberal Democrat colleagues on Mid Devon District Council have balanced the books and protected services for two years running. Together, we will sweep through County Hall to throw out the waste and demand accountability and change – and I will stand up to the government, no matter what colour it is, to get fair funding for Devon.\nMore and more people are pledging their support to the Liberal Democrats to speak up for them in County Hall – it’s the only way to make sure the Conservatives are beaten here in Tiverton West and rural Devon.\nOnly the Lib Dems can beat the Conservatives in our area. Labour have no local councillors.\nMake sure you have your say on how we can get real change for the better in Devon.\nSteve\nLet’s get a real local champion to be our next County Councillor\n-\nPutting our community first\nOur community deserves better. Whether it’s fighting to fix our roads, for improved SEND provision, better post-16 education opportunities, enhancing rural transport links, eliminating waste, or protecting vital public services from under-funding and loss, my focus is on delivering meaningful change for our community.\nSteve’s proven track record of delivery\nSteve is working closely with our MP to represent our market town, rural communities and local businesses in Parliament. With a background in finance, Steve is looking to cut the waste and year-on-year losses in Devon County Council and balance the books whilst investing in more efficient and better delivered services\n- Protecting our treasured local services\nDevon is strapped for cash and the Conservative-led Council is raiding local services to fill their financial black hole. After the County Council chose to close our mobile libraries, I am campaigning with Tiverton’s Liberal Democrat MP Rachel Gilmour to replace Tiverton High School’s crumbling buildings with a new modern campus. I am determined that Devon must look wider than just Exeter for economic growth.\nTake my local survey\nI know many residents are concerned about a range of issues in our region – from the backlog of unfilled potholes to the overspend and underdelivery on children’s services. That’s why I’m asking for your views today. Please complete my survey – it will take only 2 minutes.\nVoter ID required on May 1st\nYou’ll need to bring ID to vote at a polling station in the Devon County Council elections.\nDon’t have ID? Click here to apply for free voter ID now.\nPlease vote – and remember, postal votes are essential for the DCC election on May 1st\nIt’s vital to vote for change on May 1st. Please get out and vote – but if you’re unable then apply for your postal vote now.\nApply for a postal vote. Click here to get your form.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2025_02_05_democracy-wins-the-conservatves-have-failed-to-cancel-devon-elections/content_5.html": "In the House of Commons today, the Deputy Prime Minister confirmed that the Devon County Council Elections will go ahead, in spite of the Conservative Leadership asking for them to be postponed.\nThanks to this announcement, the people of Devon will be able to exercise their democratic right at the ballot box, and vote for a new council.\nThis is the article written by Bradley Gerrard, local democracy reporter:\nDCC’s bid to have this year’s local elections postponed rejected\nDevon’s county council elections will go ahead in May after the government rejected a request to postpone them.\nThe county council’s ruling Conservatives wanted to delay the elections for a year as plans for an overhaul of local government become clearer.\nBut deputy prime minister Angela Rayner has only agreed to “half the requests” by councils across England, noting that the government’s starting point is “for all elections to go ahead unless there was a strong reason for postponement”.\nMs Rayner says all areas with a two-tier structure of local government , which includes Devon, will be invited to submit proposals for new unitary councils.\nLast month a majority of Devon’s county councillors voted to apply to the government to postpone local elections scheduled for Thursday 1 May.\nHowever, Liberal Democrat councillors objected to the idea.\nMartin Wrigley, Lib Dem MP for Newton Abbot, said: “It isn’t difficult to see why they were trying to avoid facing the electorate again after their disastrous general election results.\n“Thankfully the government has clearly seen through this thinly veiled attempt to silence the voices of over a million voters. They have made the right decision in allowing voters to go to the ballot boxes this May.\n“After years of chaotic Conservative control, it is time for change and across the county, Liberal Democrats are working hard to be that change locally, as we have been in Westminster.”\nMinisters want to abolish the two-tier system of local government, whereby different services in the same area are carried out by separate councils.\nThe government wants to create larger councils that oversee populations of at least 500,000 people, and it wants them to be unitary in style, meaning that all services are conducted by one council.\nIt has indicated some exceptions to that size may be allowed. Exeter City Council could be one of those that applies to be a unitary authority.\nDevon alreadcy has two unitaries, Torbay and Plymouth, but in the rest of Devon, the county council is responsible for largers services, such highways, education, and social services, while district councils are responsible for other functions, such as recycling and planning.\nElsewhere, Ms Rayner named six areas where devolution would begin to progress. Devolution in this context is the idea of an elected mayor overseeing more than one of the new larger unitary councils in something likely to be called a mayoral strategic authority.\nMs Rayner the outcome of such a process was “simple”.\n“It will mean more money in people’s pockets, and quicker, better, cheaper transport designed with local people in mind, and politics back in the service of working people,” she said.\nShe named Devon and Torbay as having “foundational” devolution, in that Devon County Council and Torbay Council have created a combined county authority (CCA).\nThis CCA is designed to give the area greater control over certain aspects, such as transport, but did not involve electing a mayor.\nThere are some calls for Devon to combine with Cornwall to form a strategic authority, under the leadership of an elected mayor. Cornwall Council is set against the very notice. Response across Devon has been more nuanced.\nIt is likely to be some time before the situation becomes clear.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_04_23_29-of-burglaries-still-going-unattended-in-devon-cornwall/content_7.html": "29% of burglaries in Devon & Cornwall went unattended by Devon & Cornwall Police last year, despite a government promise to attend all of them, an investigation by the Liberal Democrats has revealed.\nSteve Lodge, who is standing for election as Police & Crime Commissioner for the Liberal Democrats on May 2, said it showed the Conservative government was making yet more “empty promises” on crime and letting burglars and other criminals off the hook.\nIn total, a shocking 599 of domestic burglaries in Devon & Cornwall went unattended by a police officer in 2023.\nStaggeringly, the latest Home Office statistics show that three in four burglaries went unsolved in the year ending September 2023, or 213,814 burglaries over that period.\nThe figures were revealed through a series of Freedom of Information requests by the Liberal Democrats to all police forces in England, with 24 forces providing full responses. They show that 25,938 domestic burglaries went unattended by police across England and Wales in 2023 – accounting for 20% of all cases recorded.\nThis is despite a claim from the National Police Chiefs’ Council (NPCC) last June that all domestic burglaries were being attended by police. Former Conservative Home Secretary Suella Braverman welcomed the claim at the time, saying she was delighted that police had “fulfilled their commitment to attend all domestic burglaries.”\nThe Liberal Democrats are calling for a legal Burglary Response Guarantee under which all domestic burglaries would be attended by the police and properly investigated. This would be accompanied by a return to proper community policing, where officers are visible, trusted and focused on tackling neighbourhood crime like burglaries.\nSteve Lodge said:\n“The Lib Dems recently discovered that in Devon & Cornwall it was taking an average of 22 hours to respond to a burglary. We thought that was poor, and now we find out nearly a third get no response at all. It’s not right to blame the police for this failure, as they are overstretched and underfunded. The issue is around empty promises from Conservative ministers that are leaving our community to pay the price with scores of burglaries going unsolved.\n“Burglaries are an appalling crime to have to endure and it can leave local people feeling unsafe in their own homes. The ongoing failure to investigate and attend every burglary is letting criminals off the hook while victims are abandoned and let down.\n“The Liberal Democrats would bring in a legal guarantee to ensure burglary victims are visited by a police officer and their cases properly investigated. It is the very least that the public expects and deserves.”\nENDS\nNotes to Editors:\nThis data was uncovered by a FOI to all 39 police forces in England. Their responses, which can be accessed here, provided the following data:\nHow many incidents of domestic burglary have been reported to your force in the past three calendar years: 2021, 2022 and 2023\nA breakdown of how many of these reports led to a police officer visiting the scene of the incident, also broken down by calendar year.\nData on burglary outcomes, broken down by police force, is available here. Source: Home Office, Crime Outcomes in England and Wales, year to September 2023.\nThen-Home Secretary Suella Braverman confirmed that police chiefs were “fulfill[ing]” their pledge to attend every home burglary in June 2023. More details can be found here.\nThe Liberal Democrats are calling for a new statutory guarantee that all domestic burglaries must be attended by the police and properly investigated.\nTo implement this guarantee, we are calling on the Government to:\nReturn to proper community policing, where officers have the time and resources they need to focus on preventing and solving crime;\nUrgently draw up a strategy to tackle the shortage of detectives; and\nSet up a new national Online Crime Agency, to better protect people from online crime while freeing up local forces’ time to tackle burglars.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_02_29_vision-for-policing/content_19.html": "With the approach of the 2024 elections, the Liberal Democrats have sharpened their focus on law enforcement and criminal justice – areas vital to the well-being and security of the public. Their crime and policing policies strike a balance between Prevention, Effectiveness, and Trust, demonstrating why a shift in government could usher in a welcomed era of reform and improvement.\nPrevention at the Forefront\nThe Liberal Democrats emphasize Prevention. Their policies aim to tackle the root causes of crime, rather than merely responding to offenses after they occur. By investing in youth services and ensuring comprehensive support for those with mental health issues, the party seeks to build communities where criminal activity is less likely to thrive.\nThe proposed increase in community policing further represents this preventive approach. The Liberal Democrats understand that familiarity breeds trust; hence, a police officer known in the community is more likely to diffuse tensions and resolve issues before they escalate.\nSmarter Policing for a Safer Tomorrow\nEffectiveness in policing cannot be overstated—the Liberal Democrats get this. The party advocates for modernizing the police force by providing officers with technology that can streamline administrative duties and allow for more time on the beat. Digital evidence-gathering tools and investments in cybercrime units cater to the evolving nature of crime in the 21st century.\nFurthermore, their crime policies feature a strong stance against serious offenses like domestic abuse and hate crimes, pledging comprehensive support to victims and firm action against perpetrators. The establishment of a Violence Against Women Commissioner underscores their commitment to addressing gender-based violence head-on.\nRebuilding Trust Through Transparency\nThe erosion of confidence in policing institutions necessitates a rebuild of public trust, a task the Liberal Democrats do not take lightly. Measures such as increased transparency, robust accountability mechanisms, and in-depth training on bias are central to their vision.\nThe call for body cameras for on-duty officers and better data on stop-and-search incidents are examples of the party’s push for a more accountable police force, one that earns the public’s trust through consistent and equitable application of the law.\nA Change in Government: A Change in Method\nThe policies of the Liberal Democrats reflect a broader paradigm shift—a movement towards addressing complex social issues with innovative and humane solutions. The party’s emphasis on a balanced approach to policing and crime—blending prevention, effectiveness, and trust-building initiatives—resonates with a public that is increasingly aware of the intricacies of social justice.\nWhat the Liberal Democrats propose is a comprehensive blueprint that envisions a safer, more inclusive society. Their policies reach beyond mere punitive measures, suggesting a transformative effect on communities and the nation at large.\nWith the 2024 elections on the horizon, the Liberal Democrats are positioning themselves as the harbingers of change—a change predicated on the belief that a truly safe and secure United Kingdom is one where Prevention, Effectiveness, and Trust form the pillars of its policing and crime policy.\nThis platform not only reveals where current government policies may have missed the mark but illustrates how innovative and community-focused approaches to crime and policing can pave the way for a more harmonious society. It’s a call for a societal renovation—one where every citizen feels protected and heard, where justice is not just an ideal but an everyday reality.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_04_08_police-taking-over-22-hours-hours-to-respond-to-burglary-calls-in-devon-cornwall/content_4.html": "Police in Devon & Cornwall are taking an average of 22 hours to respond to burglary calls, damning new figures uncovered by the Liberal Democrats have revealed.\nThere is a dramatic 25% increase on response times compared to figures from 2021/22 nationally – but with no comparison figures available for Devon & Cornwall police due to continued faulty IT systems.\nAcross England, police are taking an average of 9 hours and 8 minutes to show up at the scene when a burglary was reported. This is an 87% increase on burglary response times in 2020/21.\nLib Dem candidate for Police and Crime Commissioner, Steve Lodge, believes that years of ineffective resourcing have left local police forces overstretched, under-resourced and unable to effectively respond to local crime.\nThis includes taking more than 4,500 Police Community Support Officers (PCSOs) off the streets since 2015.\nSteve Lodge and the Lib Dems are calling for a return to proper community policing, where officers are visible, trusted and able to focus on responding to neighbourhood crime like burglaries.\nCommenting, Steve Lodge, said:\n“In Devon & Cornwall the response time is 22 hours and 11 minutes – and compare that to Bedfordshire where it’s 15 minutes and you have to ask what’s going wrong? Only two other forces in the country that response have higher response times.\n“Having your home burgled is a traumatic experience, and victims deserve a swift response from the police. Yet thanks to the Conservative Government, this is increasingly out of reach.\n“People in Devon & Cornwall deserve to feel safe in their own homes. The fact that traumatised burglary victims are being left waiting for hours, wondering if the police will even arrive, is unacceptable. To think that crucial evidence may be lost in the process too is unforgivable.\n“It’s time to finally restore proper community policing, so people can be confident that if they do fall victim to crime, the police will turn up and investigate properly.”\nThe election for Police & Crime Commissioner takes place on May 2nd.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_category_news_page_2/content_16.html": "by steve | Apr 22, 2024 | News\nSteve Lodge pledges proper community policing as Police & Crime Commissioner candidate for the Liberal Democrats Steve Lodge is the Liberal Democrat candidate for the Devon & Cornwall Police and Crime Commissioner election on May 2nd. Steve has been selected...\nby steve | Apr 8, 2024 | News\nPolice in Devon & Cornwall are taking an average of 22 hours to respond to burglary calls, damning new figures uncovered by the Liberal Democrats have revealed. There is a dramatic 25% increase on response times compared to figures from 2021/22 nationally...\nby steve | Apr 3, 2024 | News\nThe Liberal Democrat candidate for Police & Crime Commissioner in Devon & Cornwall has accused the Conservative government of “neglecting” rural communities as new data reveals that the Devon & Cornwall force has only 3 police officers and staff dedicated...\nby steve | Mar 29, 2024 | News\nEveryone deserves to feel safe in their own home. But last year there were 45,233 reported burglaries where a police officer didn’t then visit the scene of the crime. Too many victims are let down while criminals are getting away with it Reports have shown that as...\nby steve | Mar 11, 2024 | News\nThe South West is blighted by shop theft – with incidents 50% higher than five years ago. 30% of independent convenience stores in the South West – which make up 70% of the total convenience sector – have reported an increase in shop theft. The cost to a typical Devon...\nby steve | Feb 29, 2024 | News\nWith the approach of the 2024 elections, the Liberal Democrats have sharpened their focus on law enforcement and criminal justice – areas vital to the well-being and security of the public. Their crime and policing policies strike a balance between Prevention,...",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_03_11_not-enough-is-being-done-to-prevent-shop-thefts-in-the-south-west/content_18.html": "The South West is blighted by shop theft – with incidents 50% higher than five years ago. 30% of independent convenience stores in the South West – which make up 70% of the total convenience sector – have reported an increase in shop theft.\nThe cost to a typical Devon and Cornwall convenience store amounts to £2574 annually – and retailers are having to invest thousands in their own security measures to prevent theft, attacks on staff and anti-social behaviour.\nThe Association of Convenience Stores (ACS) has recommended a range of policy changes such as shoplifting ‘most wanted’ lists, and I hope these will be reviewed and considered. But we need more than this.\nThe LibDems want to steer a return to proper community policing, not just a sticking plaster approach that has seen a handful of front desks reopened in our region. It is vital that the police strengthens bonds with local communities to prevent crime and improve safety.\nWe also need to see the police tackling anti-social behaviour around local shops. The Conservatives have failed on crime, with the public and overstretched police officers left to bear the burden. There are huge backlogs in the courts which are denying victims the justice they deserve and it’s clear we need action on prosecution rates. We heard recently that as many as three quarters of burglaries remain unsolved in our region – but the problem also applies to shoplifting.\nI’m fighting not just for fair funding but also for smarter spending, and effective crime reduction strategies such as restorative justice, tackling prolific offenders, and evidence-driven policing.\nSee the ACS press release here: https://www.acs.org.uk/press-releases/shop-theft-record-smashed-local-shops-face-retail-crime-crisis",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_author_steve/content_2.html": "by steve | Mar 21, 2025 | News\nThe UK Government’s English Devolution White Paper proposes replacing the existing two-tier council system with unitary authorities serving populations of approximately 500,000. This has led to necessary discussions among Devon’s local councils regarding...\nby steve | Mar 12, 2025 | News\nClimate change is not just a priority for responsible world leaders, it should be a concern for us all at a local level. My personal view is very clear: I will work to ensure we reduce our impacts on the environment in Devon and stick by our commitment to net zero –...\nby steve | Feb 28, 2025 | News\nA HISTORY OF SERVING OUR COMMUNITY I’m Steve Lodge I have lived and run a successful business in Tiverton for more than 20 years. I am well-known for bringing top stand-up comedy to Tiverton Community Arts Theatre – an organisation I love. I am a leading voice...\nby steve | Feb 5, 2025 | News\nIn the House of Commons today, the Deputy Prime Minister confirmed that the Devon County Council Elections will go ahead, in spite of the Conservative Leadership asking for them to be postponed. Thanks to this announcement, the people of Devon will be able to exercise...\nby steve | Apr 23, 2024 | News\n29% of burglaries in Devon & Cornwall went unattended by Devon & Cornwall Police last year, despite a government promise to attend all of them, an investigation by the Liberal Democrats has revealed. Steve Lodge, who is standing for election as...",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2025_03_21_broad-opposition-to-devons-two-tier-system-becoming-a-unitary-authority/content_13.html": "The UK Government’s English Devolution White Paper proposes replacing the existing two-tier council system with unitary authorities serving populations of approximately 500,000. This has led to necessary discussions among Devon’s local councils regarding potential restructuring.\nThe Liberal Democrats have criticised Labour’s plan to reorganise local government by abolishing the two-tier system of county and district councils in favor of unitary authorities. They argue that this restructuring is wasteful, particularly due to the associated costs and the scheduling of two sets of elections within a two-year span.\nAdditionally, the Liberal Democrats have accused Labour of attempting to manipulate the electoral process to their advantage. Ed Davey, leader of the Liberal Democrats, has claimed that Labour and the Conservatives are colluding to prevent the rise of other parties in key areas affected by the proposed changes.\nDevon’s seven district councils, along with Exeter City Council, have collectively expressed opposition to the idea of a single county-wide unitary authority. Instead, they are exploring alternative configurations that align with the government’s criteria while preserving local representation.\nOne proposal under consideration involves forming two separate unitary authorities within Devon. This approach aims to balance the benefits of streamlined governance with the need for local responsiveness.\nExeter City Council has prevously indicated its intention to seek unitary status independently, aiming to manage all local government functions within its jurisdiction. This move reflects Exeter’s desire to tailor services more closely to the specific needs of its urban population.\nIn February, the districts reached initial agreement to work towards the formation of two new Councils that combine existing areas as follows;\n- A Unitary combining the South Hams, Teignbridge and West Devon areas with Torbay\n- A Unitary including East, Mid and North Devon alongside Torridge District and the City of Exeter\nPlymouth would remain a unitary on its own. However mutiple other options are proposed. November is the hard deadline for submissions – and there is no timetable if this should happen, but it could be 2 to 3 years. There is considerable further work to do to develop these proposals.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2025_03_12_lib-dems-are-committed-to-net-zero-unlike-the-opposition/content_9.html": "Climate change is not just a priority for responsible world leaders, it should be a concern for us all at a local level. My personal view is very clear: I will work to ensure we reduce our impacts on the environment in Devon and stick by our commitment to net zero – for all our futures.\nThe Reform Party want to scrap Net Zero, and the Conservative candidate for Tiverton West refers to it as a ‘Net Zero fallacy’ and ‘climate clap trap’! I stand with our leader Sir Ed Davey and MP Rachel Gilmour in a pledge to achieve if not exceed the Net Zero target.\nThe Liberal Democrat Party in the UK is committed to addressing climate change and has set ambitious targets to achieve net-zero greenhouse gas emissions. In the 2024 general election manifesto, “For a Fair Deal”, we pledged to reach net-zero emissions by 2045, five years ahead of the current government target of 2050.\nTo support this goal, the party has proposed significant investments in green infrastructure, innovation, training, and skills across the UK. These initiatives aim to boost economic growth while ensuring environmental sustainability.\nAdditionally, Liberal Democrat MP Roz Savage introduced the Climate and Nature Bill in October 2024. This proposed legislation seeks to:\nReduce the UK's greenhouse gas emissions in line with international commitments under the Paris Agreement.\nHalt and reverse the destruction of the natural world, aligning with the Global Biodiversity Framework 2022.\nEstablish a temporary Climate and Nature Assembly to advise on strategies to achieve these targets.\nThese actions underscore the Liberal Democrats’ dedication to proactive and accelerated measures in combating climate change and achieving net-zero emissions. You can read more here.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2025_02_28_meet-steve-lodge-the-best-choice-to-be-tiverton-wests-new-councillor/content_8.html": "A HISTORY OF SERVING OUR COMMUNITY\nI’m Steve Lodge I have lived and run a successful business in Tiverton for more than 20 years. I am well-known for bringing top stand-up comedy to Tiverton Community Arts Theatre – an organisation I love. I am a leading voice for small businesses across Mid Devon with the Federation of Small Businesses. With two autistic children, I am a champion for education and better SEND provision which focuses on the needs of each child.\nI have always been active in addressing challenges head on. I am the Lib Dem spokesman for police and crime in Devon & Cornwall, and demand a tougher focus on crime especially in rural areas, and a visible police presence in our communities.”\nTHE LOCAL CHAMPION WITH A VISION\nI became involved in the community because I saw areas where things could – and should – be better. I wanted to use my career and experience of fighting for SEND support to better represent people, to improve opportunities for children, and to give back to the place I am proud to call home.\nPublic service isn’t about titles or meetings – it’s about showing up, speaking out and getting things done. Tiverton, Bampton and our villages deserve strong leadership, clear vision and relentless commitment to making things better. That’s what I stand for.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_author_steve_page_2/content_11.html": "by steve | Apr 22, 2024 | News\nDevon & Cornwall Police Federation have issued a damning press release after their pay and morale survey blasted a hole in the force’s ability to retain staff in a service that is already in need of more officers. Among the findings of the pay and morale...\nby steve | Apr 22, 2024 | News\nSteve Lodge pledges proper community policing as Police & Crime Commissioner candidate for the Liberal Democrats Steve Lodge is the Liberal Democrat candidate for the Devon & Cornwall Police and Crime Commissioner election on May 2nd. Steve has been selected...\nby steve | Apr 8, 2024 | News\nPolice in Devon & Cornwall are taking an average of 22 hours to respond to burglary calls, damning new figures uncovered by the Liberal Democrats have revealed. There is a dramatic 25% increase on response times compared to figures from 2021/22 nationally...\nby steve | Apr 3, 2024 | News\nThe Liberal Democrat candidate for Police & Crime Commissioner in Devon & Cornwall has accused the Conservative government of “neglecting” rural communities as new data reveals that the Devon & Cornwall force has only 3 police officers and staff dedicated...\nby steve | Mar 29, 2024 | News\nEveryone deserves to feel safe in their own home. But last year there were 45,233 reported burglaries where a police officer didn’t then visit the scene of the crime. Too many victims are let down while criminals are getting away with it Reports have shown that as...",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_04_22_introducing-steve-lodge-rebuilding-trust-unity-and-accountability-in-the-fight-against-crime/content_3.html": "Steve Lodge pledges proper community policing as Police & Crime Commissioner candidate for the Liberal Democrats\nSteve Lodge is the Liberal Democrat candidate for the Devon & Cornwall Police and Crime Commissioner election on May 2nd.\nSteve has been selected to stand for the role that was created in 2012 to represent the public in Devon, Cornwall and Isles of Scilly and hold the police to account.\nWith 25 years’ experience in business and governance, including work as a regional officer for the Federation of Small Businesses and as a Non-Executive Director in healthcare, Steve also has a passionate commitment to public service.\nHe said: “I have huge respect for the police and their excellent work, but on the doorstep I keep hearing that improvement is needed. I especially want to help Devon & Cornwall Police out of special measures, and to build trust in combatting the issues people most care about – from anti-social behaviour and drugs offences to domestic violence and rural crime.\n“The need for visible, local policing resonates strongly with almost everyone I speak to. This fits with the pledges made by the Liberal Democrats to steer a return to proper community policing. And by proper we mean a thought-out plan that focuses on more visible engagement with communities.\n“Building trust begins with listening, and I want to understand people’s experiences in order to build safer neighbourhoods. It’s not good enough that four in five burglaries go unsolved. It’s not right that anti-social behaviour is allowed to blight people’s lives.\n“With this must come a focus on rehabilitation, and preventing crime includes stopping reoffending. I want to support rehabilitation programs that address the root causes of criminal behaviour.\n“Above all I want to see fair funding for policing. Every pound should count towards a more effective policing system. We advocate for fair funding and smarter spending focused on outcomes, not just inputs, and I do not underestimate the battle we have to correct the billions cut from police budgets by the Conservatives in the past decade.\n“It’s a real honour to be selected to stand, and even more so to have spoken to so many people in Devon and Cornwall about their priorities and concerns. I’ll be committed to upholding the Liberal Democrat values of fairness, equality and liberty – and that means doing my best to get things right.”\nAdrian Sanders, former MP for Torbay and Regional Chair for Devon and Cornwall Liberal Democrats, said: “With Steve Lodge we have a great opportunity to put the prevention of crime, restorative justice, and more bobbies on the beat at the top of the agenda.\n“We need someone who will put the concerns of people first.”\nThe Police and Crime Commissioner election is on May 2nd.\nPromoted by Todd Olive on behalf of Stephen Lodge (Liberal Democrats), both at The Hive, School Hill, Whimple, EX5 2TS.",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_04_03_only-3-police-officers-and-staff-are-dedicated-to-rural-crime-teams-across-devon-cornwall/content_6.html": "The Liberal Democrat candidate for Police & Crime Commissioner in Devon & Cornwall has accused the Conservative government of “neglecting” rural communities as new data reveals that the Devon & Cornwall force has only 3 police officers and staff dedicated to rural crime teams.\nPCC candidate Steve Lodge said: “This is a damning statistic for our region where the rural community makes up a significant part of our landscape and income. This represents 0.05% of the Devon & Cornwall Police’s overall workforce – half that of the average in England and Wales which itself is just 0.1%.\n“Last year, Liberal Democrat MP for Tiverton & Honiton, Richard Foord, tabled a Bill that would require the Home Secretary to bring forward a strategy for tackling rural crime. While current initiatives such as Project Recall that aims to raise awareness about dog control in rural areas is welcome, much more needs to be done.”\nThrough a series of Freedom of Information requests, the Liberal Democrats have uncovered how many officers and staff are assigned to rural crime teams in each police force. 37 forces provided responses, including Devon & Cornwall. These disturbing revelations come as rural crime remains on the rise. NFU Mutual’s 2023 Rural Crime Report revealed that in 2022, the cost of rural crime across the UK rose by 22%, to an estimated total of £49.5 million.\nCommenting, Liberal Democrat Leader Ed Davey MP said: “Yet again, we are seeing the shocking neglect of our rural communities from this Conservative government.\n“Local communities are worried sick about the impacts of rural crime, and to have such a small number of officers dedicated to tackling this serious issue is shocking. No wonder so many cases are going unsolved and criminals are getting off the hook.”\nThe Liberal Democrat are arguing that every force should have a specialist coordinator in their rural crime team, in line with recommendations from The National Rural Crime Network.\nRural crime is “crime and anti-social behaviour occurring in rural areas”, and includes many specific types of crimes that are unique to the countryside like livestock theft. These teams are focused on preventing and solving rural crime, with specialist knowledge, equipment and skills.\nENDS\nCaption: Richard Foord MP and Steve Lodge, Police & Crime Commissioner candidate\nNotes to Editor:\nThis data was uncovered by a FOI request to all 43 police forces in England and Wales. Their responses, which can be accessed here, provided the following information:\n- How many police officers and police staff were assigned to your Rural Crime Team, in FTE, as of the following dates:\n- 31st December 2023\n- 31st December 2022\n- 31st December 2021\nAs of September 2023, there were 147,098 FTE police officers and 79,688 FTE police staff and designated officers. Source: Home Office, Police workforce, England and Wales: 30 September 2023.\nAlthough there is no widely agreed definition, rural crime is defined by the National Rural Crime Network as “all crime and anti-social behaviour occurring in rural areas. This includes problems typically associated with the countryside such as wildlife and heritage crime, farm equipment and animal thefts.”",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_03_22_we-must-deal-with-deaths-of-despair-in-cornwall/content_21.html": "Cornwall has ranked as one of the worst regions for ‘Deaths of Despair’, a study has found. Deaths of Despair (DoD) are socially patterned fatalities typically attributed to drug and alcohol misuse and suicide. They tend to occur much more frequently in socially deprived communities.\nResearchers in Manchester have published a report in ‘Social Science and Medicine’ that shows that 46,200 people lost their lives due to Death of Despair in England (2019–2021), with most in the North. However Cornwall ranked 7th of the regions in the report for mortality rate, with almost double the DoDs in the study period compared to neighbouring Devon.\nCommenting, Steve Lodge, Lib Dem candidate for Police & Crime Commissioner in the forthcoming election, said the study highlights the need for a very different approach to policing in Cornwall.\n“This is a devastating statistic for Cornwall and one that highlights the need for earlier intervention in such cases. It’s important to remember that these are ‘lives of despair ‘and can be saved with the right approach. Individuals in despair are likely to have recent trouble with police, a history of imprisonment, more violent behaviours, homelessness, and parental adverse histories.\n“If we can identify patterns of behaviour sooner then we can save lives. It’s very similar to identifying patterns of behaviour in violence against women and girls, an issue I have been discussing with Lib Dem parliamentary candidates in Cornwall. The issues highlight how important a multi-agency approach is to supporting people in difficult personal situations. The ongoing impact on the police is particularly high when signals are missed.\n“I am committed to more engagement with senior officers, communities and other agencies and a renewed focus on community policing and reform. I believe we can prevent tragic deaths and the impacts they have on society in the county.”\nDeaths of Despair are an avoidable human cost of inequitable resource distribution. The conclusions of the research underscore the imperative for accelerated implementation of the UK Government’s policy on ‘Levelling Up’, which has come under recent criticism. A week ago a parliamentary watchdog reported there were “no compelling examples of delivery” of the levelling up agenda.\nNOTES\nhttps://www.sciencedirect.com/science/article/pii/S0277953624000042?via%3Dihub",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_category_news/content_12.html": "by steve | Mar 21, 2025 | News\nThe UK Government’s English Devolution White Paper proposes replacing the existing two-tier council system with unitary authorities serving populations of approximately 500,000. This has led to necessary discussions among Devon’s local councils regarding...\nby steve | Mar 12, 2025 | News\nClimate change is not just a priority for responsible world leaders, it should be a concern for us all at a local level. My personal view is very clear: I will work to ensure we reduce our impacts on the environment in Devon and stick by our commitment to net zero –...\nby steve | Feb 28, 2025 | News\nA HISTORY OF SERVING OUR COMMUNITY I’m Steve Lodge I have lived and run a successful business in Tiverton for more than 20 years. I am well-known for bringing top stand-up comedy to Tiverton Community Arts Theatre – an organisation I love. I am a leading voice...\nby steve | Feb 5, 2025 | News\nIn the House of Commons today, the Deputy Prime Minister confirmed that the Devon County Council Elections will go ahead, in spite of the Conservative Leadership asking for them to be postponed. Thanks to this announcement, the people of Devon will be able to exercise...\nby steve | Apr 23, 2024 | News\n29% of burglaries in Devon & Cornwall went unattended by Devon & Cornwall Police last year, despite a government promise to attend all of them, an investigation by the Liberal Democrats has revealed. Steve Lodge, who is standing for election as...\nby steve | Apr 22, 2024 | News\nDevon & Cornwall Police Federation have issued a damning press release after their pay and morale survey blasted a hole in the force’s ability to retain staff in a service that is already in need of more officers. Among the findings of the pay and morale...",
  "https_stevelodge_co_uk_/https_stevelodge_co_uk_2024_04_22_1-in-5-police-officers-plan-to-quit-devon-cornwall-police-federation/content_14.html": "Devon & Cornwall Police Federation have issued a damning press release after their pay and morale survey blasted a hole in the force’s ability to retain staff in a service that is already in need of more officers.\nAmong the findings of the pay and morale survey, 95 per cent of police officers said how the police are treated by the Government had a negative impact on their morale.\nSteve Lodge said: “News from the Devon & Cornwall Police Federation that that 1 in 5 police officers plan to quit should ring warning bells to the Government. Spending on police has only just crept up to 2011 levels in real terms – which means there has been underfunding of the police amounting to billions of pounds for well over a decade. It is understandable that confidence in the Government by police officers is so low.\n“This Government has also asked council tax payers to pick up much of the bill for policing, and the current Conservative Police & Crime Commissioner has increased the police precept by 4.9% when people are struggling to cope with the cost of living crisis. It is time this Government was removed and people got a fair deal – and if elected I will press hard for fair funding and smarter spending so that we invest in better policing.”\n• 81 per cent said their pay had a negative impact on their morale.\n• 73 per cent said they would not recommend joining the police to others.\n• 71 per cent said they did not feel valued within the police.\n• 92 per cent of respondents feel they are not fairly paid given the stresses and strains of their job.\n• 86 per cent said they do not feel there are enough officers to meet the demands of their team or unit.\n• 64 per cent said their workload has been ‘too high’ or ‘much too high’ over the last 12 months.\n• 39 per cent said their workload being too high had an impact on their mental health and wellbeing.\nThe press release is available here: https://www.polfed.org/dcp/news/latest-news/pay-and-morale-survey-undervalued-police-officers-planning-to-quit/"
}