{
  "https_www_ketteringgreenparty_org_/https_www_ketteringgreenparty_org/content_1.html": "YOUR GREEN COUNCILLORS IN\nKETTERING\nWe’re working for you in Kettering\nOur aim is to make Kettering an even better place for its people to live in.\nWe love our town and want to see it improve and thrive.\nIn 2021 the first Green Party Councillors were elected to North Northamptonshire Council and Kettering Town Council.\nIn May 2023 Councillor Emily Fedorowycz became the first ever Green Mayor of Kettering.\nSAVE WEEKLEY HALL WOOD\nWe have supported the campaign to Save Weekley Hall Wood from the start in 2020\nWOMEN’S MARCH\nEmily helped organise the first Kettering Women’s March in December 2021\nCOP26 RALLY\nDez was asked to speak in Northampton at the COP26 march in November 2021\nEMILY ON THE BBC\nEmily on the telly! She was interviewed by BBC Look East in the run up to COP26\nMEET THE TEAM\nDEZ DELL\nNorth Northants and Kettering Town Councillor – Clover Hill and Brambleside\nDez was born, raised and lives in Kettering. His mission is to build a better community for everyone who lives here. Dez volunteers with several local organisations such as Save Weekley Hall Wood, Kettering Eco Group, Kettering Arts Centre and is a trustee of Kettering Refugee Assistance.\n“I believe that listening to and acting upon the concerns of local people and improving our sense of community is key to bettering Kettering.”\nEMILY FEDOROWYCZ\nNorth Northants and Kettering Town Councillor – Clover Hill and All Saints\nCo-founder of the Kettering Eco Group (with Dez), Emily is also a trustee of Kettering Refugee Assistance. Emily and Dez first met on volunteer night shifts at the homeless centre, Safe Until Daylight.\nDez said, “Emily is one of the most caring and motivated people I know. Her boundless energy and drive to help the community is so inspirational to me.”\nEmily says, “I’ve loved every minute working hard for Kettering over the past few years and have been lucky enough to support many local groups doing some wonderful things.”\nSARAH TUBBS\nNorth Northants and Kettering Town Councillor – Clover Hill and All Saints\nSarah Tubbs is a marine biologist and founder of a Cambodian conservation project that exists to improve our understanding of the country’s marine life as well as study its endangered species, such as dolphins. She is eager to make Kettering a better place to live, work and play and is a committed local campaigner.\nInterested in joining the Green Party?\nWe had our best ever results in Northamptonshire at the local elections on May 6th 2021.\nDez, Emily and Sarah were elected to North Northamptonshire Council. On Kettering Town Council they are joined by James Towns and Keiron Farrow bringing us to 5 councillors in Kettering."
}