{
  "https_reformuk_org_uk_harrogate": "Harrogate & Knaresborough - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Jonathan Swales HARROGATE & KNARESBOROUGH COMPASSIONATE CONSERVATISM small state, personal freedoms. Name Email Message Send Jonathan Swales HARROGATE & KNARESBOROUGH COMPASSIONATE CONSERVATISM small state, personal freedoms. Name Email Message Send Discover More Local Ties Harrogate born and bred from a family of local business owners. Passionate about the Harrogate & Knaresborough area, its people and heritage. Work & Education Chartered Engineer with MBA, ex corporate world now independent small business owner. Why Reform UK I can’t stand by and watch our country, values and culture be destroyed by a weak, disinterested government.  Vote for change – vote Reform. Britain needs Reform and Reform needs you 🫵 ➡️ Join us today: https://t.co/LsuDatJVpm pic.twitter.com/qlGprIit32 — Reform UK (@reformparty_uk) March 22, 2024 Facebook Youtube Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Our Supporters Leading products and services in North Yorkshire Software for schools. Lesson plans for teachers. Electrical Contractor, Harrogate. Studley Hotel, Harrogate. Vehicle repair. Classic car restoration. Tockwith, York. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk": "Yorkshire - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Reform Yorkshire branches established 2024 Vote Reform via Post Skipton and Ripon Branch Click here Jonathan Swales Harrogate & Knaresborough Click here Lee Martin Taylor Richmond & Northallerton Click here David Bowes Scarborough & Whitby Click here NEWS Not looking to become a paid member yet? Sign up for our email newsletter. Click here MEMBER Join Reform UK. Recurring Membership can automatically renew. Click here DONATE Fund your local branch. Leaflets, events, infrastructure. Click here Skipton Ripon Pilot Branch Meeting Darley 29 September 2024 Richard Tice Speaking in Skipton 14 January 2024 Remembrance Sunday 10 November 2024 Farmers' Protest Thirsk 19 November 2024 North Yorkshire Branches Find my branch Our supporters Leading products and services in North Yorkshire Software for schools. Lesson plans for teachers. Electrical Contractor, Harrogate. Studley Hotel, Harrogate. Vehicle repair. Classic car restoration. Tockwith, York. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_events": "Events - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Reserve Your Seat Regular seats £12.00 – Purchase Checkout Added to basket Front row seats £20.00 – Purchase Checkout Added to basket DATE: Sunday 14th January 2024. TIME: Conference room opens 6pm. Richard Tice takes stage 7pm. Bar available. EVENT LOCATION: Shown on purchase receipt. ADDITIONAL INFO: A purchase receipt will be emailed to you. This receipt is also your ticket. Please print and bring to the event. If you do not receive the email check your Junk box. Admission is not guaranteed without a printed receipt. If you have any problems please message Simon Garvey. CLICK HERE RSVP Richard Brown Click here Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_checkout": "Checkout - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Checkout Your basket is empty. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_candidates": "Candidate Search - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site REFORM UK\nCANDIDATES find and connect You can navigate through our menu or use this search bar: Search Search North Yorkshire Harrogate and Knaresborough Richmond & Northallerton Scarborough and Whitby Skipton and Ripon Wetherby & Easingwold West Yorkshire Bradford South Colne Valley Leeds East Leeds South West & Morley Shipley Spen Valley Wetherby & Easingwold Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_skiptonripon": "Skipton and Ripon - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Paula Pearse RIPON CITY COUNCIL CANDIDATE TRADITIONAL CONSERVATISM communication, community, integrity Name Email Message Send Paula Pearse RIPON CITY COUNCIL CANDIDATE TRADITIONAL CONSERVATISM communication, community, integrity Name Email Message Send Discover More Local Ties Lives in Ripon. Recently became very active in local politics. Work & Education Chef. Building Society Subpostmistress. Crown Court Clerk. Why Reform UK Return to common sense values which the Tories and Labour have abandoned. Vote Reform via Post Click here Become A Member Click here Donate Click here Thank you Reform UK voters 2024. From a standing start Skipton & Ripon achieved 16%. Unprecedented. The political pendulum swung left under the Tories. It will reach maxima under Labour. Reform are the only credible centre-right option. Support WILL grow 15%+ next election. pic.twitter.com/nkSxQ6fl5g — Reform UK - Skipton & Ripon (@ReformUKyorks) July 5, 2024 Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Our Supporters Leading products and services in North Yorkshire Software for schools. Lesson plans for teachers. Electrical Contractor, Harrogate. Studley Hotel, Harrogate. Vehicle repair. Classic car restoration. Tockwith, York. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_richmond": "Richmond and Northallerton - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Lee M. Taylor RICHMOND & NORTHALLERTON VOICE FROM THE CROWD transparency, fairness, unity. Name Email Message Send Lee M. Taylor RICHMOND & NORTHALLERTON VOICE FROM THE CROWD transparency, fairness, unity. Name Email Message Send Discover More Local Ties Born and raised in Yorkshire. In 2017 my family permanently settled in Catterick Garrison. Work & Education Spent 22 years serving in the British Army Royal Electrical and Mechanical engineers – radar technician. Why Reform UK Reform UK offers the only positive alternative to the status quo. A bold, innovative vision and a clear change of direction. Britain needs Reform and Reform needs you 🫵 ➡️ Join us today: https://t.co/LsuDatJVpm pic.twitter.com/qlGprIit32 — Reform UK (@reformparty_uk) March 22, 2024 Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_scarborough": "Scarborough and Whitby - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site David Bowes Scarborough & Whitby RESTORATIVE TRADITIONAL CONSERVATISM family, heritage, liberty. Name Email Message Send David Bowes Scarborough & Whitby RESTORATIVE TRADITIONAL CONSERVATISM family, heritage, liberty. Name Email Message Send Discover More Local Ties Live & work in Scarborough & Whitby. My family and heritage are North Yorkshire, it’s a county I love. I enjoy fossil hunting on our coast. I love walking on our moors, spending time with my family & books. Work & Education BSc (Hons) 2:1, CIM Professional Dip Marketing (Oxford Marketing college), ABPI (Association of British Pharmaceutical Industries). Why Reform UK A genuine traditional conservative alternative. Move away from a dictatorial, top-down, nanny state back to popular democratic representation, in the interest of the British people. Britain needs Reform and Reform needs you 🫵 ➡️ Join us today: https://t.co/LsuDatJVpm pic.twitter.com/qlGprIit32 — Reform UK (@reformparty_uk) March 22, 2024 Facebook Youtube Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_colnevalley": "Colne Valley - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Stuart Hale COLNE VALLEY THE ONLY OPPOSITION TO LABOUR Deeds not Words. Name Email Message Send Stuart Hale COLNE VALLEY THE ONLY OPPOSITION TO LABOUR Deeds not Words. Name Email Message Send Discover More Local Ties Lives in Holmfirth with my family, educated in Huddersfield, lived in surrounding area for over 26 years. Work & Education University of Huddersfield – BA with honours in Business Administration, and a further degree in Law. Why Reform UK I will always put Britain first, and I am asking you to help me make that change. This is Paul Davies the #Labour MP for Colne Valley. Mr Davies voted to scrap the winter fuel allowance for pensioners. His old council seat is now vacant but he thinks the #HolmeValley will always be a Labour seat. Shall we give him a shock? #reformUK #REFORM24 @ActionBrexit pic.twitter.com/8DT9XzqGSO — colnevalley.reform (@Colnevalleyref) September 27, 2024 Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_leedseast": "Leeds East - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site David Dresser Leeds East PROGRESSIVE REFORM progressive, efficiency, fairness. Name Email Message Send David Dresser Leeds East PROGRESSIVE REFORM progressive, efficiency, fairness. Name Email Message Send Discover More Local Ties Born and lived in Leeds most of my life and my family have been in Leeds since the 1890’s. Work & Education Solicitor and Photographer, MA in International Studies specialising in the Middle East, Islamic Radicalism and the Cold War, Leeds University. LLM in Commercial Intellectual Property Law, Nottingham Trent Why Reform UK I have been active in local politics for over 30 years with both Labour and the Liberal Democrats. I have concluded that only a shift to Reform will save the country from failed Tory and Labour policies. Labour’s budget is going to be full of shocks. This Government is making economic decisions on the basis of who will vote for them at the next election, not what is best for the country. Only Reform will deliver change for the whole country, and put the British people first. pic.twitter.com/1lbJ4xrT6i — Reform UK (@reformparty_uk) August 27, 2024 Facebook Youtube Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_leedssouthwest": "Leeds South West and Morley - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site James Kendall LEEDS SOUTH WEST & MORLEY CONSERVATIVE everyday a new challange. Name Email Message Send James Kendall LEEDS SOUTH WEST & MORLEY CONSERVATIVE everyday a new challenge. Name Email Message Send Discover More Local Ties I have lived and worked in Morley. Many of my family, friends and business associates operate from Morley and the surrounding areas. Work & Education Worked for various companies in Morley from Smiths Metal Centre, Parker Fultration, Citylink and worked along side many more. Why Reform UK Always been political, supporting the Conservative Party. After years of betrayal I had to stand for a party that puts the UK first. Spring conference in Doncaster pic.twitter.com/5FV7SoVShj — Reform UK Leeds southwest and morley (@reformukLeeds) April 5, 2024 Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales",
  "https_reformuk_org_uk_shipley": "Shipley - Reform UK Skip to content yorkshire Events Checkout Candidate Search Reform UK National Site Events Checkout Candidate Search Reform UK National Site Derrick Hodgson Shipley BREXITEER onwards and upwards. Name Email Message Send Derrick Hodgson Shipley BREXITEER onwards and upwards. Name Email Message Send Discover More Local Ties Lived in Bingley for 18 years. Chair of the Bingley actions stations group – volunteers that looked after the Bingley & Crossflatts rail stations. Work & Education Electrical engineer and run a window furnishing business which is in its 18 th year. Between 2011 and 2013 set up a solar panel business. Why Reform UK Lower Taxes. Net zero immigration. Cheaper energy. Zero waiting lists. Britain needs Reform and Reform needs you 🫵 ➡️ Join us today: https://t.co/LsuDatJVpm pic.twitter.com/qlGprIit32 — Reform UK (@reformparty_uk) March 22, 2024 Facebook Youtube Does Reform UK Represent Me? Richard Tice As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again. To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense\nwould be a good start! Reform our Economy Higher growth rates are the only way to better\nwages and more tax revenues that can be\ninvested in better healthcare and other\npublic services. Our bold economic vision\nfrees up over 6 million people from paying\nIncome Tax and frees up over 1.2 million\nsmall businesses and self-employed from\npaying Corporation Tax. We would also\naim to remove a raft of other stifling taxes\nin a responsible, timely way. Reform our Public Sector We must be ambitious, seeking faster,\nmore efficient public services that work\nbetter for us all. For example, with health,\nwe should demand zero waiting lists and\nwe have a bold plan to achieve this vision.\nOur police need to focus on preventing\ncrime and catching criminals. Our schools\nmust educate our children properly\nto prepare them for a competitive,\nchallenging world. Our Border Force must\nprotect our borders. Reform our Energy Strategy The Westminster Net Zero plan is making us all net poorer whilst creating more\nemissions. It is therefore net stupid. Our energy plan will use our own energy treasure under our feet, and create thousands\nof British jobs, by making our industries\ncompetitive again. It will save consumers\nconsiderable amounts of money on their\nbills every year. We would also nationalise\n50% of key utility companies to stop\nconsumers being ripped off. Reform our Institutions Major change is needed to the bodies that\nimpact our lives - the unelected cronyism\nof the House of Lords, the unaccountable\ncivil service and the bloated BBC. Reform\nis essential to our voting system so it is\nfairer and more representative; the two party system embeds the status quo and prevents real change. common questions How will you stop the boats? A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense. Let’s welcome those who have high level skills and talents that we need – such as doctors, engineers, software developers, scientists and surgeons – in tightly controlled numbers that meet our requirements. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values. This must not be an excuse, however, for cheaper labour that reduces wages in the UK, nor must it be an excuse for not training our own wonderful young people. Illegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats. We must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did. We must also create a new Department of Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose. Everyone must know that no-one coming via these illegal routes will be allowed to stay in the UK. Cases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs. The cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared. What's your stance on lockdowns? Our freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them – income tax was a temporary tax on the rich to pay for a war over 200 years ago! We will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way. Mandatory vaccination? Reform UK is OPPOSED to mandatory vaccination after recent scientific data and medical professional testimony came to light. How can we fix the NHS? The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue. The frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world. Let’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists. We must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery. • If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere. • If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere. • If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically. Surveys show that patients don’t mind who treats their condition, they just want to be treated quickly! Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential. Institutions like the BBC? • Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose. • Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive – a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed. • Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation. • Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise. How will you lower energy bills? We had a major problem even before the Ukraine war. The growth in heavily subsidised renewable energy has led to over £10 billion of inflation-linked subsidies every year with an extra £5 billion of annual related network operating and balancing costs. This totals £15 billion every year, approximately £500 per household directly or indirectly. Much of the renewable industry is overseas owned, meaning they are making vast profits at British consumers’ expense. Renewables are unreliable when the wind does not blow, so they need the insurance backup of gas generating capacity, which adds significantly to costs due to duplication. In wartime situations the Government must control the price of critical production like energy. This happened in WW2. The Reform UK plan works as follows: • Require all UK energy producers to sell to UK suppliers only at the average 2021 price. • Domestic cap set to average £2,000 per year. • Business cap set at maximum 35 pence per kwh. • Extra help still needed for the most vulnerable. • The above will exist until normal conditions return and the supply crisis is fixed. • This transforms the Government finances as it puts the cost on the producer not the taxpayer, which is what unsettled markets so much in September 2022. • The windfall tax would be scrapped as the producers are no longer making windfall profits under this plan. Do you advocate proportional representation? Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential. How will you grow the economy? The Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million. The combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance. Smart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms. Reform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare. Central Bank Digital Currency? Reform UK will oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society. How will you improve Education? On Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds. • We would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate. • We would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university. • Our schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end. • Schools must focus on the basics of teaching every child to read and write. • Teachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution. • We must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. Police and Crime? We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals. • Increase police numbers in the community, with officers on the beat, engaging with the local people. • Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets. • Target the menace of County Lines drug dealers, gangs and the growth of knife crime. • Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork. • Reform our courts and justice system to work faster and smarter. Military and Defence? The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few. It is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel. Reform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health. Net Zero and Energy? We are all concerned about the environment and we all want cleaner air. Honesty is vital. We face the gravest energy crisis since WW2. We are in a global energy war. Terrorists are blowing up gas pipelines and power plants. Westminster’s obsession with Net Zero is making us all net poorer every year. It is creating more emissions, not less, as it forces us to buy our energy from overseas. It is thus sending our jobs and money overseas, making it “net stupid”. The Conservatives, encouraged by Labour and the Liberal Democrats, over the last 12 years have been grossly negligent. They have turned the UK from being a net exporter of energy into a large net importer of energy. They have foolishly left us strategically exposed to overseas state actors. This is despite the fact that the UK sits on vast energy reserves of coal, oil, natural gas, shale gas and lithium. We should be using our own British energy treasure, creating wealth and jobs to remain here in the UK, not disappear overseas. New technologies mean we can extract these commodities safely in a cleaner, cheaper way. Cheap energy is the foundation stone to allow manufacturing to thrive and grow. It is essential for our remaining steel industry to remain competitive. Without it we are doomed to see more jobs and money go abroad. Climate Change? It is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life. Reform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming, though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change. There is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as: • The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery. • Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago. • The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist! • The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels. • Overall sea ice cover in Antarctica has not declined in recent decades. • Polar bear numbers in the Arctic are increasing, not decreasing. Promoted by Reform UK, Millbank Tower, 21-24 Millbank, London, SW1P 4QP © Reform UK | Company number 16260766 | Registered in England & Wales"
}