{
  "https_littlemorevoice_co_uk_/https_littlemorevoice_co_uk/content_1.html": "My Message\nI have often voted and been disappointed that my choice has not won. But I have always accepted the decision in the belief that although Democracy may not be a perfect system, it is the only system which considers the views and opinions of each of us equally.\nMy belief in our freedoms and way of life has been shocked at the realisation that the Local Traffic Networks were imposed on us in clear disregard of a majority view of our local residents.\nLives have been devastated and complaints recorded from local businesses, residents, emergency services, bus services and the councils own research and yet they continue to ignore the devastation and misery this has brought to so many. Instead they boast that children who should be taught to be aware of the dangers on the road, can now wander carelessly in the road and a few indulged individuals can enjoy a quiet road that was never an expectation when they happily moved into their homes.\nI intend to offer a choice to the people of Littlemore. I will remind them that it was these Liberal Democrats supported by Labour and the Greens who voted in these evil and divisive LTN restrictions and the whole project was funded by central Conservative government. If there is to be change and a change that is wanted by the people who will endure those changes, it can only be offered by an independent candidate whose pledge is to be guided by the people they represent.\nIt is now your choice. If you want to be heard you must vote and encourage your neighbours as never before, to realise that it is you that can make the change that we all so desperately need.\nI have been blown away by the support I have received since announcing I intended to stand as an Independent Candidate for Littlemore at the local elections next May.\nNow I need your help. Contact me and tell me your story of the impact the local council has had on your life. Am I wrong and you like the LTN restrictions or have these restrictions caused you insurmountable difficulties. I intend to offer you a choice and from the overwhelming support I have received so far, I believe it is a choice you want but it is a choice you will have to vote for.\nYou will have to be part of the change. I cannot do this alone and I will always remember that I am your voice. Tell me what you think and what you want had help me to make the changes for you.\nEmail: [email protected] or visit me on facebook at littlemore voice",
  "https_littlemorevoice_co_uk_/https_littlemorevoice_co_uk_media/content_3.html": "Skip to content\nSearch Toggle\nAnne Stares - Littlemore Voice\nAbout\nMedia\nContact\nMenu\nSearch for:\nSubmit\nWebsite currently being constructed. Please call back soon",
  "https_littlemorevoice_co_uk_/https_littlemorevoice_co_uk_about/content_5.html": "I’m Anne and I hope to tell you more very soon\nThis page is being prepared . . .\nTemporary text – please call back very soon . . .\nTemporary text – please call back soon\nThis page is being prepared . . .\nTemporary text – please call back very soon . . .\nTemporary text – please call back soon",
  "https_littlemorevoice_co_uk_/https_littlemorevoice_co_uk_contact/content_4.html": "Skip to content\nSearch Toggle\nAnne Stares - Littlemore Voice\nAbout\nMedia\nContact\nMenu\nSearch for:\nSubmit\nPlease contact me and tell me what’s important to you\nName\nEmail\n*\nMessage\n*\nContact me",
  "https_littlemorevoice_co_uk_/https_littlemorevoice_co_uk_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}