{
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_feed/content_18.html": null,
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_get-involved/content_4.html": "We are getting Britain back on the right track but need the help and support of local people like you.\nIn May 2021 we took control of Nuneaton and Bedworth Borough Council and have begun the process of turning our town around. But we need to ensure that we keep control in May 2024's elections so that we can continue our programme of change and deliver the Vision, Ambition and Aspiration that our town needs.\nIf you'd like to get involved, there are a number of different ways you can help us depending upon the amount of time you wish to spend.\nTo find out about the different ways you can help us, just select an option from the menu on the left hand side.\nNo matter how little or how much time you can give, please get in touch - we'd love to hear from you!",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_wilkos-move-part-transforming-nuneaton/content_7.html": "The current Wilkos site will be transformed to provide a new state of the art library and business centre, and those plans are now one step closer with the relocation of the much-loved shop.\nMany residents have asked about future of the old Woolworths site, and we can now confirm that Wilkos will be relocating to the site and bring the shop back into full use once again.\nCllr Kris Wilson, Leader of the Council, commented:\nWilko’s is an integral part of Nuneaton Town Centre, and the move to the old Woolworth’s site will ensure their presence in Nuneaton for years to come.\nRegenerating Nuneaton is essential to building a better future for our town, and this move with enable a new state of the art library and business centre to be built.\nThis is yet another positive step forward in Transforming Nuneaton.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_events/content_11.html": "Skip to main content\nNuneaton\nConservatives\nMain navigation\nOur map\nNews\nGet involved\nPeople\nContact\nNuneaton\nConservatives\nFuture Events\nSorry, we haven't got any upcoming events.\nPlease check back soon to see future events.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_category_National-News/content_3.html": "The Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News\nKemi gives a speech at the Alliance for Responsible Citizenship Conference 18th February 2025 On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values National News\nRebuilding Trust with our new Immigration Policy 10th February 2025 Kemi’s new plan for immigration shows the Party is back in the service of the British people National News\nKemi’’s First Speech of 2025: Rebuilding Trust 27th January 2025 Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party National News",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_people_cllr-mandy-tromans-galley-common/content_33.html": "Galley Common Ward Councillor - NBBC\nGalley Common Division Councillor - WCC\nMandy has been elected to serve as the Borough and County Councillor for Galley Common in May 2021.\nShe is determined to provide support to the residents of Galley Common. If you need assistance from Mandy then please get in touch.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_kemis-first-speech-2025-rebuilding-trust/content_14.html": "Tweet Monday, 27 January, 2025 National News Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_nbbc-conservative-team/content_22.html": "The Conservative Team and Nuneaton and Bedworth Borough Council are there to stand up and fight for the residents of Nuneaton and Bedworth, no matter which ward the members represent. It is their job to present the vision of the Borough now under a Conservative administration and help residents with any issue that may arise. We will not only take on our own residents issues, but if a residents from any other ward is not getting effective representation from their Councillor then we are more than prepared to provide a voice for you on your behalf.\nAll of the different services that the Council provides have been divided up amongst our Group and it is our job put forward our vision, ambition, and aspiration for Nuneaton and Bedworth.\nSince taking control of the Council in May 2021, the new Conservative Cabinet is as follows:\n- Leader of the Council and Portfolio Holder for Business and Regeneration - Cllr Kris Wilson\n- Deputy Leader of the Council and Portfolio Holder for Housing and Communities - Cllr Clare Golby\n- Portfolio Holder for Finance and Corporate Affairs: Cllr Sam Croft\n- Portfolio Holder for Health and Environment - Cllr Julian Gutteridge\n- Portfolio Holder for Public Services - Cllr Sue Markham\n- Portfolio Holder for Planning and Regulation - Cllr Richard Smith",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_grayson-place-launched-nuneaton/content_29.html": "Residents across Nuneaton have been following with interest the regeneration that is taking place in Abbey Street. With diggers on site and foundations being laid, construction work is gathering pace.\nNow, as work is progressing the Conservatives have - after running a competition alongside Nuneaton Memories - named the new development in honour of Nuneaton's most famous son... Larry Grayson.\nIn his prime he was able to attract 23 million viewers and was the embodiment of leisure and entertainment. At home in Nuneaton, his love for his home town was always on show and residents still fondly recall him. Now, he will form part of Nuneaton's future and be at the heart of leisure and entertainment once more.\nGrayson Place will be the home of a new hotel, cinema, entertainment centre, food hall, multi-storey car park, education facilities and new shops.\nAs Grayson Place takes shape, 400 jobs will be created during the construction and 1,500 jobs when completed.\nCllr Kris Wilson, Leader of the Council, launched the new name at an event at the Town Hall:\nIt’s an exciting time for Nuneaton as we finally unveil the new name for the redevelopment around Abbey Street, Grayson Place. We are pleased to share this milestone with the local community, who were consulted in the selection of an inspired new place name. Comedian and TV personality Larry Grayson was a proud Nuneaton local and a fantastic performer. It is fitting that, as Grayson Place becomes a new entertainment and leisure destination for Nuneaton, one of its most famous past entertainers will be remembered here.\nMore information about Grayson Place can be found here: Grayson Place",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_accessibility/content_21.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_conservative-partys-final-party-election-broadcast/content_27.html": "Tweet Tuesday, 29 April, 2025 National News Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are\nConservative response to Labour's Emergency Budget Wednesday, 26 March, 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_people_type_Association-Officers/content_30.html": "Skip to main content\nNuneaton\nConservatives\nMain navigation\nOur map\nNews\nGet involved\nPeople\nContact\nNuneaton\nConservatives\nAssociation Officers\nList of Association Officers\nAssociation Officers",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_people_cllr-kristofer-wilson/content_25.html": "Leader of the Opposition - NBBC\nWhitestone Ward Councillor - NBBC\nShadow Portfolio Holder for Business & Regeneration - NBBC\nKristofer has been one of the Conservative Councillors for Whitestone Ward since May 2010 and re-elected recently in 2024.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_conservatives-deliver-new-play-equipment-across-nuneaton/content_35.html": "In our budget in February 2022, we invested £50,000 to undertake a programme of work to improve the play equipment across the Borough that is showing its age and is in need of improvement.\nMarston Lane Fields play area has now received four new pieces of equipment after being left with just piece of equipment for years. Conservative Wem Book Councillor Scott Harbison listed to local residents around Marston Lane, and after discussing his concerns with the Cabinet Member for Parks, Cllr Julian Gutteridge, residents in Wem Brook will now be able to enjoy new equipment and offer a wider variety of fun to the local children.\nWe have already installed new equipment in Stockingford Recreation Ground, and there are further plans to upgrade play facilities in Montana Walk, Riversley Park and Buttermere Park.\nCllr Julian Gutteridge, Cabinet Member for Health and Environment, said:\nWe are delighted to be able to provide this much-needed play equipment at several sites across our Borough.\nPlay is very important to the growth and development of our youngsters, and we are pleased to play our part in this by giving them some top-quality equipment.\nCllr Kris Wilson, Leader of the Council, also commented:\nIn our budget last year we set aside money to improve play areas across our Borough that were in desperate need of some attention. I’m thrilled that we have been able to deliver these upgrades that will make a real difference to local communities in Nuneaton and Bedworth.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_conservative-response-labours-emergency-budget/content_2.html": "Tweet Wednesday, 26 March, 2025 National News Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk/content_1.html": "Latest News\nOur Map\nFollow us on Twitter\nLike us on Facebook\nDonate\nWith your help we're building a strong voice for local Conservatives.\nAny donation will make a difference.\nJoin or Renew\nBy joining the Conservative Party, you're doing your bit to help change Britain.\nYour support is vital to our campaign to build a better future.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_properties-recovered-so-families-need-can-get-support/content_34.html": "Council housing stock is vital to ensure that the most vulnerable people in Nuneaton have a safe and secure home. Unfortunately, some defaulters are thousands of pounds in arrears with their rent and the Conservative council is taking action to ensure that the houses can be re-let to those who are in genuine need.\nOwing up to £5,000 in rent arrears, court action has resulted in three properties being repossessed. These houses will now be used to house those on the waiting list.\nAs a Council we are committed to working with tenants who are in genuine difficulty and will engage with us. But we must make sure that the houses within our ownership are used in the most appropriate way.\nCllr Clare Golby, Deputy Leader and Cabinet Member for Housing, explained:\nDuring the pandemic, due to temporary legislation, local councils couldn’t take legal action for rent arrears.\nThis means that some tenants in Nuneaton and Bedworth Borough simply stopped paying their rent and there was nothing the Council could do about it.\nThe legislation has now reverted back to normal, and we are ramping up operations in a big push to catch up with defaulters.\nIf you are one of our tenants and are having genuine difficulty paying your rent, please talk to us. We can help. I can’t emphasise this enough.\nIf you are a deliberate defaulter we will catch up with you.\nNuneaton and Bedworth Borough Council provides housing to residents in Nuneaton, Bedworth, Bulkington, Exhall and Keresley.\nDeliberate rent arrears or abandoned properties are a burden on the local authority and the tax payer, plus with a shortage of housing stock for families in need it’s a waste of homes that could be used by people desperately in need.\nI will not allow properties to be abandoned and stood empty or people to intentionally not pay what they owe.\nWe will take the necessary action to get our property back.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_contact/content_19.html": "If you'd like to help with our work locally or tell us about an issue or concern within the Nuneaton constituency, please contact us using the form below, call us on 024 7632 7878 or email directly : [email protected]\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_conservatives-call-out-labours-plans-remove-local-local-government/content_9.html": "The Labour Deputy Prime Minister yesterday (16 December 2024) released the Labour Government’s plans to force all local councils to merge into larger authorities.\nCllr Kris Wilson, Leader of the Opposition (Whitestone), said:\nLabour’s plans ride a coach and horses through the idea that local government should be local. It should be for local people to decide whether they want to change how their council’s work and not be imposed by a Whitehall diktat.\nUnder the proposals released by the Government yesterday, ministers have set out that they expect local councils’ to be merged into new councils’ that have at least 500,000 residents and where local areas refuse to do so they will step in and force it to happen.\nCllr Wilson continued:\nSetting an arbitrary figure of 500,000 people as somehow local is clearly absurd. In my experience, local communities want councils to serve their local area. There is a real danger that unless plans are made with the local community it will take democracy further away from the voter.\nIn just 6 months of a Labour Government, the trend against local democracy is clear. First, they imposed central housing targets without regard to the local area. Then they have just announced that they will get rid of local planning committees for some planning applications, removing the ability of local councillors and residents to stand up for their area. Now, they plan to force massive councils on local areas without any local consultation.\nIn December 2023, the then-Conservative Council at Nuneaton and Bedworth voted to support the principle that there should be no local government re-organisation for Warwickshire without local consultation. The Conservative and Labour Councillors all voted for this proposal.\nCllr Wilson concluded:\nLabour joined with us last Christmas in giving a clear message that it should be for local people to decide on what their local council looks like. The question now is – will Labour locally now back their residents in Nuneaton or Bedworth, or will they be the turkeys that vote for Christmas and support their Labour paymasters instead?",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_people/content_20.html": "Cllr Kristofer Wilson (Whitestone) Leader of the Opposition - NBBC Whitestone Ward Councillor - NBBC Shadow Portfolio Holder for Business & Regeneration - NBBC Borough Councillors\nCllr Sam Croft (Galley Common) Galley Common Councillor - NBBC Deputy Leader of the Opposition - NBBC Shadow Portfolio Holder for Finance and Corporate Affairs Borough Councillors\nCllr Rob Tromans (St Nicolas) St Nicolas Ward Councillor - NBBC Weddington Division Councillor - WCC Chair of the Licensing Committee County CouncillorsBorough Councillors\nCllr Julian Gutteridge (Whitestone) Whitestone Ward Councillor - NBBC Health & Environment Portfolio Holder - NBBC Chair of NABCEL Shareholder Committee - NBBC Borough Councillors\nCllr Richard Baxter-Payne (Attleborough) Attleborough Ward Councillor - NBBC Attleborough Division Councillor - WCC Chair of the Audit and Standards Committee - NBBC County CouncillorsBorough Councillors\nCllr Brett Beetham (Kingswood and Camp Hill) Kingswood Ward Councillor - NBBC Camp Hill Division Councillor - WCC County CouncillorsBorough Councillors\nCllr Jeff Clarke (St Nicolas) Mayor of Nuneaton and Bedworth St Nicolas Ward Councillor - NBBC Nuneaton East Division Councillor - WCC County CouncillorsBorough Councillors\nCllr Jack Kennaugh (Barpool) Barpool Ward Councillor - NBBC Stockingford Division Councillor - WCC County CouncillorsBorough Councillors\nCllr Mandy Tromans (Galley Common) Galley Common Ward Councillor - NBBC Galley Common Division Councillor - WCC County CouncillorsBorough Councillors",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_kemi-launches-policy-renewal-programme/content_8.html": "Tweet Tuesday, 18 March, 2025 National News At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_rebuilding-trust-our-new-immigration-policy/content_13.html": "Tweet Monday, 10 February, 2025 National News Kemi’s new plan for immigration shows the Party is back in the service of the British people\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_events_feed/content_26.html": null,
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_people_cllr-rob-tromans-st-nicolas/content_28.html": "Since first being elected in 2014, Rob has worked tirelessly to make St Nicolas, the area in which he and his family live, an even better place to live. Rob was delighted to be re-elected in 2018.\nIn that time Rob has achieved so much for the community. He has been tackling the issues which matter to local residents, holding regular sessions where he speaks and hears residents’ issues first hand.\nRob is concerned about Labour’s overdevelopment of St Nicolas and the wider area. He supports Conservative plans for an immediate review of Labour’s failed Borough Plan so that it better protects existing areas and communities.\nRob has also been working hard to secure investment in the vital infrastructure, schools, roads and GP services which our area needs with the additional houses Labour have passed.\nSince May 2021 he has also been honoured to be elected as the County Councillor for Weddington. He is determined to restore the investment to the infrastructure in Weddington that has been neglected over the previous 8 years under the previous incumbent.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news/content_5.html": "Conservatives call-out Labour’s plans to remove the “local” from Local Government Tuesday, 17 December, 2024 Following the release of the English Devolution White Paper, local Conservatives in Nuneaton and Bedworth call out the proposed mandatory abolition of local councils. Local News\nConservatives call Special Council over disastrous impact of Labour 17th September 2024 Local Conservatives have called a special council for Friday 4 October at 6pm to call for action over the disastrous impacts of Labour taking control of the... Local News\nLabour waste £4500 on redecorating Leader's Office 2nd September 2024 At a time when Labour are claiming that there is no money to support the Bulkington Christmas Light switch on, Conservatives uncover they have wasted £4500 on a... Local News\nConservatives defeat housing developer appeal in Weddington 8th July 2024 The appeal against 700 houses in Weddington along the A5 that was rejected by the Conservatives when in control of the Borough Council has been defeated -... Local News\nGrayson Place launched in Nuneaton 14th February 2023 Conservatives finally honour famous son Larry Grayson and ensure he is part of Nuneaton's future Local News\nConservative Budget at Town Hall puts services first 13th February 2023 In the face of tough economic times, Conservatives protect and invest in vital services Local News\nWilkos on the move as part of Transforming Nuneaton 8th February 2023 Wilkos will move to the centre of Nuneaton as part of the regeneration plans Local News\nProperties recovered so that families in need can get support 3rd February 2023 Three council properties have been recovered after thousands of pounds owed in rent Local News\nButtermere Park upgrades delivered under Conservatives 26th January 2023 Residents in St Nicolas will soon see a whole new park delivered in Buttermere now money is secured Local News\nConservatives deliver new play equipment across Nuneaton 16th January 2023 New play equipment is being delivered under Conservatives after years of neglect under Labour Local News\nThe Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_people_cllr-julian-gutteridge-whitestone/content_32.html": "Whitestone Ward Councillor - NBBC\nHealth & Environment Portfolio Holder - NBBC\nChair of NABCEL Shareholder Committee - NBBC\nCllr Julian Gutteridge is one of the Conservative Borough Councillors for the Whitestone Ward, having been elected in May 2016.\nAs a resident of Whitestone, Julian takes a keen interest in the issues facing our area and works alongside his fellow colleagues to make improvements where possible.\nJulian is the Cabinet Member for Health & Environment and is determined to improve our play and open space areas across the Borough and the performance of the Glendale grounds maintenance contract that we have inherited from the previous Labour administration.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_kemi-gives-speech-alliance-responsible-citizenship-conference/content_17.html": "Tweet Tuesday, 18 February, 2025 National News On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_map-locations/content_15.html": "Nuneaton\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_privacy/content_6.html": "This document outlines how Nuneaton Conservatives processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Nuneaton Conservatives\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Nuneaton Conservatives.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Nuneaton Conservatives, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Nuneaton Conservatives via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_conservative-budget-town-hall-puts-services-first/content_31.html": "Conservatives at the Town Hall have passed a budget that will see the services that residents rely on the most protected and supports our local economy in the difficult times that we are currently facing.\nWith the inflationary pressures that gripping the global economy, local council finances have been put under extreme pressure. But Conservatives have delivered a budget that puts the needs of residents in Nuneaton and Bedworth first:\n- Creating a new £75,000 per year budget to continue the upgrades of local play parks across the Borough\n- Secured £750,000 investment from the Arts Council in local arts projects with local schools and colleges that will also help build key skills for the future\n- Celebrating The King's Coronation in May with £20,000 set aside to support local community events\n- Freezing the Green Bin Charge at £40 per year\n- Keeping the great car parking offer in our towns at £1.50 for 3 hours parking\n- Reforming the Council so that it is fit for the future and not a throwback to the 1980s\nThe Labour and Green parties at the Council voted against all of these measures of investment and support in our Borough.\nInstead, they voted to slash funding for Coronation events, abolish the budget for new play equipment, spend almost £1 million on new windows for the Town Hall and install new light bulbs in council street lights that would take almost 181 years to pay off.\nCllr Kris Wilson, Leader of the Council, said:\nDespite the challenging economic times we are facing, the Conservative budget offers local residents a package that puts their needs first and invests in the things that the Council does that actually makes a difference on a daily basis. In contrast, yet again the opposition parties had nothing to offer the people of Nuneaton and Bedworth.\nOnly the Conservatives have the vision, ambition and aspiration to turn around our Borough after decades of failure under Labour.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_kemis-speech-foreign-policy/content_10.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_cdn-cgi_l_email-protection/content_36.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_cookies/content_23.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_buttermere-park-upgrades-delivered-under-conservatives/content_16.html": "After years of housing development being forced upon residents in the St Nicolas ward, local residents will finally be able to get an upgrade to Buttermere Park which will be funded by money paid by developers.\nUsing section 106 money that house builders have to pay to offset the harm caused by developments, the park will get a complete refurbishment. Most of the equipment was originally installed with the original St Nicolas Park estate and is now due to be upgraded.\nThe plan will see new equipment, improved footpaths and other enhancements to the natural environment. Also included in the plans are accessible play equipment for children who have physical disabilities. This will let them enjoy the great new surroundings that will be created around them.\nCllr Julian Gutteridge, Cabinet Member for Health and Environment, has been leading on the plans and following amendments after a round consultation is looking forward to seeing the park being delivered over the coming months.\nI am incredibly proud of this project; the facilities we aim to provide will be first class. Not only will we be able to bring new play equipment and pathways to the park, but also beautiful new surroundings with more trees and wild flowers.",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_news_conservatives-call-special-council-over-disastrous-impact-labour/content_24.html": "Since May, and especially since July, the residents of Nuneaton have already begun to see that yet again we are being let down by Labour.\nThe regeneration of Nuneaton has been delayed, funding for Bedworth put at risk, funding for support at the Bulkington Christmas Lights has been scrapped and housing targets ramped up by 83%. Now, we will see 14,992 pensioners in the Nuneaton constituency will see their Winter Fuel Payment cut and see the support for the elderly decimated.\nThese important issues for the resident of Nuneaton and Bedworth deserve to be debated. So, local Conservatives have called a special meeting of the Council so that the impact on our community can be raised and action taken on their behalf.\nCllr Kris Wilson, Leader of the Opposition, said:\n\"On Friday 4 October at 6pm we will finally get to discuss the 5 months' that has seen the residents of Nuneaton and Bedworth treated with contempt. From the future of our town centres, imposing house building on our green belt that does not meet our local need to abandoning the support for local pensioners we have seen Labour's real priorities in action.\n\"These are all important issues that residents are rightly concerned about, and they rightly expect their local elected councillors to stand up for them. Our motions all call for action and we will soon see where councillors stand - on the side of the people of Nuneaton and Bedworth or being puppets of the Prime Minister at Number 10.\"\nThe meeting on Friday 4 October will be a public meeting that residents can come along to watch or ask to speak during the section on Public Participation.\nCllr Wilson concluded:\n\"Any residents who want to come and make their views known to members of the council should contact the council to indicate their wish to speak. Many people have already commented online at how all of these issues are going to impact them and their communities. Now they have an opportunity to make their voices heard.\"",
  "https_www_nuneatonconservatives_org_uk/https_www_nuneatonconservatives_org_uk_about-rss/content_12.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour."
}