{
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_tag_andrew-cooper/content_45.html": "“Off Yer Bike” 29th June 2020 / 24th March 2024 by Following a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […] Read more » Andrew Cooper Huddersfield Kirklees Newsome\nTime to press the reset button on all we know 11th June 2020 / 24th March 2024 by “Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […] Read more » Andrew Cooper Covid19 Kirklees",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_people/content_3.html": "Skip to content\nSkip to footer\nKirklees\nMenu\nNews\nPeople\nGet Involved\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nPeople\nPeople\nOur Green Candidates In Kirklees\nAndrew Cooper has been a Green Party councillor for the Newsome ward since 1999. He has been re-elected 7 times and in May received 67% of the vote.\nA committed campaigner for Huddersfield, Andrew proposed the successful insulation scheme, ‘Warmzone, that insulated over 50,000 houses, helping keep homes warm and reduce fuel bills. He worked with Save Our Trees campaigners to stop Kirklees Council from removing street trees in Edgerton Road. He also served on the EU Committee of the Regions, as a UK representative, until Brexit.\nWhether it has been opposing closures of dementia care homes or on the conflict in Gaza, Andrew has spoken truth to power and backed the priorities of local people. Andrew has the track record we need for our next Huddersfield MP.\nIn the most recent local elections in Huddersfield, the Green Party were the main challengers to Labour and were less than 3% behind Labour with the Lib Dems and Conservatives way behind.\n“We need a voice for Huddersfield in Parliament. A Labour Government is a certainty, and we have a Labour-led Kirklees Council. There is no danger of the Conservatives winning in Huddersfield!\n“All Labour MPs have to follow their Party Whip. A Labour MP could not put the local people before party and speak for Huddersfield. Green MPs are not whipped so I would be free to speak up for local people.”\nGet involved >\nHeather L Peacock is the Green Party candidate for Colne Valley (which includes Holme Valley, Golcar and Lindley).\nShe works for the NHS and is an activist and campaigner with local groups including Save the Trees Kirklees, Kirklees Climate and Nature Action Network and Better Buses West Yorkshire.\n“I have lived in the Colne Valley all my life and raised my family here. I have worked for the NHS for many years. I am training to be a Unite the Union rep at the Huddersfield Royal Infirmary.\n“Like most people, I feel we need radical changes – to tackle polluted rivers and lakes, the cost of living crisis, the lack of funding for our council services, chaotic housing policies and spiralling student debt.\n“I want our NHS to be great again. With years of inadequate planning and chronic under resourcing we now have 7.54 million people waiting for treatment. Staff morale is at an all-time low with band 2 staff now on 1p above the minimum wage. The best party for safeguarding the principles of the NHS is the Green Party. We will properly fund health and social care and invest in prevention to ensure a healthier population.\n“I want a better future for our children and grandchildren with a party that will provide a fairer and greener country. I would be honoured to represent the amazing people of Colne Valley and would work tirelessly to bring about the changes we all need.”\nElection leaflet >\nGet involved >\nMartin Price is the Green Party parliamentary candidate for the new Spen Valley constituency, which includes Mirfield, Kirkheaton, Birstall, Birkenshaw, Liversedge, Gomersal, Heckmondwike and Cleckheaton.\nHe and his family have lived in the constituency for over 20 years. He is an active member of Mirfield in Bloom, a ‘Recycling Champion Hero’ and a trustee of a Church of England owned ancient woodland in Birstall.\nMartin has worked in UK and international business management for many years, attaining director positions in two companies. His specialism is pharmaceutical and medical device manufacturing, with a focus on product compliance and IT systems.\nEarly in his career Martin spent 6 years working in Zimbabwe, Africa. Being a practical person, he was challenged on many levels but successfully completed significant projects included sanitation, clean water and school rebuilding.\nMartin says: “Incompetence in Westminster and Whitehall has damaged the livelihoods of so many people in our community and degraded our environment.\n“I would prioritise measures that encourage and safeguard biodiversity in our wonderful green spaces and aim to improve access. Protection of the natural environment is an essential part of tackling the warming of our planet.\n“If elected as your Member of Parliament I would promote social justice at home and internationally. We need to create a fairer, greener country that is fit for future generations. It’s time to put Spen Valley in a safe pair of hands – I would be accountable to the people who elected me.”\nGet involved >\nMeet Neil Doig – a businessman, dedicated geography teacher, and published author passionate about our planet and its people.\nNeil Doig is not just a candidate; he’s a voice for change. With a background in finance, education, and working on the front line of the energy industry, he offers a unique perspective to address our community’s challenges.\nAs the founder of Money Tipps® education technology platform, Neil has empowered thousands to manage their finances, tackling the cost of living crisis. His book, “Millennial Money Mindset,” fights for a measure of progress that values people and the planet over profit.\nNeil knows we face unprecedented challenges—from the climate crisis and the cost of living to the erosion of democracy and public services like the NHS. But solutions are within reach.\nBy championing policies like taxing the wealthiest individuals, we can raise billions to invest directly into our NHS. With increased funding, we can improve our schools, reduce NHS waiting times, and invest into renewable energy to heat our homes without destroying the planet\nNeil is fighting for a fairer, greener, and more prosperous future for Yorkshire and beyond.\nJoin us in making history. Vote Neil Doig, your Green Party candidate for Ossett and Denby Dale, and let’s build a better future together. Your vote. Our future.\nGet involved >\nSimon Cope is the Green Party candidate for the Dewsbury & Batley constituency, which also includes Thornhill, Whitley, Briestfield, Flockton, and Grange Moor.\nA proud resident of Dewsbury for over two decades, Simon returned to Yorkshire after working in London, settling in this diverse mill town with his wife Marnie and their two daughters. Alongside his career in the audio-visual industry, Simon played a pivotal role in founding the fan-owned cooperative football club Scarborough Athletic, serving as its first volunteer chair. He was also elected to the board of Supporters Direct, supporting sports fans in gaining ownership and influence over their clubs. Recently, as a governor at Boothroyd Primary Academy, Simon has gained valuable insights into the challenges facing our education system.\nSimon’s commitment to the community extends to volunteering as a coach for the Borough of Kirklees Artistic Swimming Club and assisting with local parkrun and Dewsbury Road Runners race events. He is passionate about investing in active travel and public transport, as well as improving home insulation to reduce energy bills and tackle climate change. Simon’s dedication to these issues drives his commitment to building a greener, fairer future for Dewsbury & Batley.\nGet involved >\nOUR GREEN COUNCILLORS\nCouncillor Andrew Cooper\nNewsome Ward\nContact Andrew\nCouncillor Sue Lee Richards\nNewsome Ward\nContact Sue\nCouncillor Karen Allison\nNewsome Ward\nContact Karen\nCouncillor Alex Vickers\nCrosland Moor & Netherton\nContact Alex\nTo top",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_06_21_fly-tipping-is-a-never-ending-problem-in-milnsbridge/content_7.html": "Heather Peacock, Green Party parliamentary candidate for Colne Valley and trees campaigner, has been working hard in the last week to save Milnsbridge from dumping of waste.\n“Fly tipping is a never-ending problem in Milnsbridge”, says local resident Heather, “I am determined to see it stopped. It will need a mix of community resistance, prosecutions and seizure of vehicles used for dumping to tackle this.\nHeather and local residents have reported several instances of rubbish being dumped on Bankhouse Road and George Street in Milnsbridge this week. Much of the dumping arises from people avoiding disposal charges and taxes on building and construction waste.\n“We need to establish a zero tolerance of this practice to eradicate health hazards and reduce environmental damage. A lot of the waste is dumped near a site designated by Kirklees Wildlife Habitat Network.”\nHeather says that people with waste to get rid of should use reputable waste disposal companies with Waste Carrier licences to help reduce instances of fly-tipping. Residents should record and report the vehicle registrations of fly-tippers.\nThese latest incidents are part of a pattern blighting this “forgotten” village, says Heather who also voiced concern about neglect by Network Rail. “Two of their walls that have needed rebuilding since last year. One by the Dale in Dale Street and another at the back of Armitage Road leading to Bank House Road. It’s been ongoing since last year and they still haven’t fixed the problem.”",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_tag_covid19/content_31.html": "Time to press the reset button on all we know 11th June 2020 / 24th March 2024 by “Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […] Read more » Andrew Cooper Covid19 Kirklees",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_author_petertaylor/content_4.html": "5th July 2024 / 11th July 2024 by petertaylor\nHuddersfield: Greens come second Andrew Cooper was second in Huddersfield and polled 10,568 votes – only 4.500 votes behind Labour – one of the biggest Green votes in the country. He fought a dynamic campaign which reached all parts of the constituency, which already has 4 Green Party councillors. The use of social media, strong […]\nRead more »\n3rd July 2024 by petertaylor\nKirklees Climate Commission with Friends of the Earth in Huddersfield we have now collated the responses to a General Election candidate survey. Our Green Party candidates, Andrew Cooper and Heather Peacock scored highest in a detailed climate and nature survey. We would especially encourage you to look at Kirklees Climate Commission’s Q&A responses from candidates. The full […]\n1st July 2024 / 1st July 2024 by petertaylor\nAndrew Cooper thanked activists for ensuring a full coverage of the constituency. He said that far from being a divisive issue our concern about Palestine and Gaza had “brought people of the town together”. Heather Peacock said that she had witnessed serious deterioration of health services over the past 14 years. She has worked for […]\n21st June 2024 / 21st June 2024 by petertaylor\nHeather Peacock, Green Party parliamentary candidate for Colne Valley and trees campaigner, has been working hard in the last week to save Milnsbridge from dumping of waste. “Fly tipping is a never-ending problem in Milnsbridge”, says local resident Heather, “I am determined to see it stopped. It will need a mix of community resistance, prosecutions […]\n11th June 2024 by petertaylor\nThe five parliamentary candidates standing for the Green Party in the General election in July are Colne Valley – Heather Peacock; Dewsbury & Batley – Simon Cope; Huddersfield – Andrew Cooper; Ossett & Denby Dale – Neil Doig; Spen Valley – Martin Price. The boundary changes have put Denby Dale and Kirkburton in a new […]\n11th June 2024 / 11th June 2024 by petertaylor\nWe need a voice for Huddersfield in Parliament.A Labour Government is a certainty and we have a Labour lead Kirklees Council. A Labour MP could not speak up for Huddersfield and put Party before local people. All Labour MPs have to follow their Party Whip.Andrew Cooper would be free to speak up for local people. Whether […]\nAndrew Cooper says “the Green Party Stands with Palestine” in a letter to electors in the Huddersfield constituency. The letter (see below) sets out the position in full. This initiative follows on from a motion proposed by Greens to Kirklees Council calling for an immediate permanent cease fire. View image below as pdf >>\n7th June 2024 / 11th June 2024 by petertaylor\nIn the most recent local elections the Green Party were the main challengers to Labour locally and were less than 3% behind Labour with the Lib Dems and Conservatives way behind. There is no danger of the Conservatives winning in Huddersfield!\n7th June 2024 / 8th June 2024 by petertaylor\nGreen candidates in May elections for Kirklees Council recorded some stunning victories and a near miss. In Crosland Moor & Netherton ward, Alex Vickers was elected by a majority of 354 and a vote share of 41%. In 2023 she came second. Her victory in 2024 was the result of having undertaken a great deal […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_tag_huddersfield/content_44.html": "Sue and Karen help with Castle Hill clean up 29th June 2020 / 24th March 2024 by Lockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […] Read more » Huddersfield Karen Alison Kirklees Newsome Sue Lee-Richards\n“Off Yer Bike” 29th June 2020 / 24th March 2024 by Following a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […] Read more » Andrew Cooper Huddersfield Kirklees Newsome",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_06_07_greens-breakthrough-in-local-elections/content_13.html": "Green candidates in May elections for Kirklees Council recorded some stunning victories and a near miss.\nIn Crosland Moor & Netherton ward, Alex Vickers was elected by a majority of 354 and a vote share of 41%. In 2023 she came second. Her victory in 2024 was the result of having undertaken a great deal of local casework and becoming a regular sight in the ward.\nIn Newsome ward, Andrew Cooper recorded the largest majority in the town, taking a 67% share of the votes cast. He was re-elected for the seventh time, having first become a councillor in 1999.\nIn Greenhead ward, Maryam Jawaid came within 41 votes of beating sitting Labour councillor Sheik Ullah. Maryam organised an energetic campaign involving many local people so helping pave the way for a general election campaign.\nOverall, in Huddersfield constituency the Green Party share of the vote was only 3% behind Labour’s.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_colnevalley/content_47.html": "Colne valley content\n11th June 2020 / 24th March 2024 by\n“Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […]\nRead more »\n15th November 2019 / 24th March 2024 by\nGreen Party members joined a demonstration by local campaigners outside the Town Hall in Huddersfield on 13th November before the Kirklees full council debated the Climate Emergency Report. In the debate many councillors felt it was an important step forward and should not be a party political issues. But there were significant criticism about a […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_07_03_local-green-candidates-score-well-in-climate-and-nature-survey/content_8.html": "Kirklees Climate Commission with Friends of the Earth in Huddersfield we have now collated the responses to a General Election candidate survey. Our Green Party candidates, Andrew Cooper and Heather Peacock scored highest in a detailed climate and nature survey.\nWe would especially encourage you to look at Kirklees Climate Commission’s Q&A responses from candidates.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_06_11_andrew-cooper-we-need-a-new-voice-in-parliament/content_10.html": "We need a voice for Huddersfield in Parliament.\nA Labour Government is a certainty and we have a Labour lead Kirklees Council.\nA Labour MP could not speak up for Huddersfield and put Party before local people. All Labour MPs have to follow their Party Whip.\nAndrew Cooper would be free to speak up for local people.\nWhether it has been opposing closures of dementia care homes or on the conflict in Gaza, Andrew has spoken truth to power and backed the priorities of local people.\nAndrew has the track record we need for our next Huddersfield MP\nAndrew has been a Councillor for the Newsome Ward for 25 years and has been re-elected 7 times. At the last local elections he received 67% of the vote, The Green Party’s highest ever share of the vote in Huddersfield.\nAndrew has dealt with hundreds of issues on behalf of local people. People know that he will do his best to resolve their problems.\nFunding our NHS, Addressing the Cost of Living crisis, Protecting our environment.\nOnly the Green Party is prepared to raise the billions needed to invest in our public services by taxing the billionaires and the super rich.\nA wealth tax on the richest 1% would raise over £70 Billion.\nPublished by Peter Taylor, 18 Lane Head Lane, Kirkburton, Huddersfield HD8",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2019_11_15_830/content_34.html": "Green Party members joined a demonstration by local campaigners outside the Town Hall in Huddersfield on 13th November before the Kirklees full council debated the Climate Emergency Report.\nIn the debate many councillors felt it was an important step forward and should not be a party political issues. But there were significant criticism about a lack of ambition in the report’s recommendations. Cllr Andrew Cooper, a member of the Climate Emergency Working Group, declined to sign it off. Later the council noted the report.\nAndrew Cooper commented: “It is how the Cabinet responds to criticism on trees policy, their support for airport expansion and building standards by which they will be judged”.\nPublished at the same time, the Air Quality Action Plan for Kirklees was also approved. Although offering an up to date analysis of the issues, it is also not ambitious and lacks targets. Amongst the key measures absent from the air plan was any proposal to amend taxi licensing to ensure a cleaner fleet in the 2020s.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_tag_kirklees/content_27.html": "Sue and Karen help with Castle Hill clean up 29th June 2020 / 24th March 2024 by Lockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […] Read more » Huddersfield Karen Alison Kirklees Newsome Sue Lee-Richards\n“Off Yer Bike” 29th June 2020 / 24th March 2024 by Following a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […] Read more » Andrew Cooper Huddersfield Kirklees Newsome\nTime to press the reset button on all we know 11th June 2020 / 24th March 2024 by “Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […] Read more » Andrew Cooper Covid19 Kirklees",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2022_04_12_greens-oppose-motorway-warehousing-developments/content_22.html": "Above: Green Party councillor, Matt Edwards with local activist Celia Hickson in Oakenshaw\nGreens in Bradford and Kirklees are supporting campaigners, Save Our Spen, in fighting plans for a huge new warehouse in Kirklees close to a busy junction on M62. Sited near junction 26 (Chain Bar), it is expected to provide a massive warehouse for Amazon with movements 24 hours a day.\nThis proposal, if approved would act as a major traffic generator and put more pressure on local roads near Scholes and Oakenshaw. It is part of a trend towards more and more employment sited close to motorways junctions, partly to satisfy our increasing desire for our internet shopping.\nThe new warehouse plan is opposed by Save Our Spen, a campaign by residents and businesses affected by the plans. For more details and ideas of how to object see https://saveourspen.co.uk\nAnother massive warehouse complex, called Interchange 26, is under construction on the former North Bierley sewage works. Interchange 16 was criticised by Councillor Matt Edwards, (Green Party – Tong Ward, Bradford) when it sought to expand its warehousing activities after initial planning approval.\nHe said: “We have already seen Kirklees Council approve this massive development – completely ignoring the concerns of residents of Oakenshaw and the parents of children at Woodlands Primary School. Now the developer is wanting to go even further.”",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2020_06_29_off-yer-bike/content_29.html": "Following a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time for a special Police Trail bike unit to operate in the area and spent time with local residents spotting when the illegal activity was going on to direct the police. One youth in Newsome fled from police who had cornered him leaving his bike behind. This will now be sent to the crusher\nCouncillor Andrew Cooper said:\n“We’re obviously pleased about this but realise that there will be other bikes out there that are being used illegally. I’d like to thank all the local people who kept us informed and we will do all we can to get these bikes seized, removed and crushed”",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2022_04_12_full-slate-of-candidates-in-kirklees-2022/content_40.html": "Green Party candidates are contesting 21 wards in Kirklees. Of the 21 candidates, 8 are women. Karen Allison is defending her seat in Newsome ward.\nKirkburton parish councillor, Richard Burton, is the Green’s candidate in Kirkburton ward. In Greenhead ward, Heather Peacock, a leading campaigner with Save The Trees Kirklees, is the party’s candidate.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_news_page_2/content_19.html": "Nearly Full Slate of Candidates in Kirklees 2022 12th April 2022 / 13th April 2022 by Green Party candidates are contesting 21 wards in Kirklees. Of the 21 candidates, 8 are women. Karen Allison is defending her seat in Newsome ward. Kirkburton parish councillor, Richard Burton, is the Green’s candidate in Kirkburton ward. In Greenhead ward, Heather Peacock, a leading campaigner with Save The Trees Kirklees, is the party’s candidate. Read more »\nCreating Warm Homes 12th April 2022 / 12th April 2022 by One example [of climate action] is the pilot project retrofitting 8 council properties on Abbey Road in Fartown. Labour Cabinet members trooped up there for a photocall with Labour Leader Keir Starmer. It looks like some good work has been carried out there, but it is a one off pilot project with no plan to […] Read more »\nWeak Record on Climate Change 12th April 2022 / 12th April 2022 by On Climate Change, Labour in Kirklees is a pretty average council but talk as if they are national leaders. They just aren’t. Climate Emergency UK who independently assess councils responses to Climate Change gave Kirklees a humiliating 0% due to their lack of a Climate Action Plan to address the problem. This was confirmed this week when […] Read more »\nPlanning Controversies 12th April 2022 / 12th April 2022 by Labour has been a shambles on Kirklees Council. The evidence is plentiful. The debacle over the Council breaking it’s promise to host the National Rugby League Museum in The George Hotel, the A629 road widening project which will see the felling of 126 trees on an iconic entrance way to Huddersfield, Labour Councillors backing the building of […] Read more »\nGreen Party activist fights for local wildlife 12th April 2022 / 12th April 2022 by The prospects of environmental disaster at a local quarry was presented to Kirklees Cabinet in March by Clare Walters, Green Party parish councillor and election candidate for Dalton ward. Clare asked for support from officers but at the end of the meeting was disappointed. Activist and wildlife conservation adviser, Clare Walters who is a member […] Read more »\nGreens oppose motorway warehousing developments 12th April 2022 / 14th April 2022 by Greens in Bradford and Kirklees are supporting campaigners, Save Our Spen, in fighting plans for a huge new warehouse in Kirklees close to a busy junction on M62. Sited near junction 26 (Chain Bar), it is expected to provide a massive warehouse for Amazon with movements 24 hours a day. Read more »\nFull Slate of Candidates in Kirklees 12th April 2021 / 14th April 2021 by Green Party candidates are contesting all 23 wards in Kirklees. Including two by-elections, there are 25 candidates – 9 women and 14 men. Andrew Cooper is defending his seat in Newsome he first won twenty -two years ago. He is also the Green Party candidate for West Yorkshire Mayor. David Knight is candidate in Kirkburton […] Read more »\nChris Green candidate for Crosland Moor and Netherton 12th April 2021 / 12th April 2021 by Chris Green, Green Party candidate for Crosland Moor and Netherton, is concerned about the impact on the ward of new housing for example in Netherton and the proposed building of nearly 800 homes in Crosland Hill. He said: “People are worried about increased pressures from new housing – on traffic, schools and services. “I want […] Read more »\nSue and Karen help with Castle Hill clean up 29th June 2020 / 24th March 2024 by Lockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […] Read more » Huddersfield Karen Alison Kirklees Newsome Sue Lee-Richards\n“Off Yer Bike” 29th June 2020 / 24th March 2024 by Following a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […] Read more » Andrew Cooper Huddersfield Kirklees Newsome",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2022_04_12_planning-controversies/content_35.html": "Labour has been a shambles on Kirklees Council. The evidence is plentiful. The debacle over the Council breaking it’s promise to host the National Rugby League Museum in The George Hotel, the A629 road widening project which will see the felling of 126 trees on an iconic entrance way to Huddersfield, Labour Councillors backing the building of a modern hotel on Castle Hill, the site of an Iron Age hill fort and the Leader of the Council proclaiming he had encouraged the environmentally disastrous Amazon Warehouse development near Cleckheaton then denying later he had any view on the planning application. Leadership on Kirklees Council has been sadly lacking and the Labour Group seem unable or unwilling to address the problem.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_get-involved/content_16.html": "Kirklees Green Party relies on teams of committed volunteers and activists who work all year round for our local area – not just during election time.\nThere is always work to do behind the scenes. This can involve delivering leaflets, knocking on doors (canvassing), phoning members and stuffing envelopes.\nSome of our activities involve campaigning – about road schemes, response to climate emergency, food poverty or international issues.\nOur focus has to be on local and general elections. In May 2026 there will be council elections when all Kirklees councillors’ term of office will end and new wards boundaries kick in.\nMembers also contribute to developing policies or take on social media work or data analysis. Finally, there are some social events or community clean-up activities that active members can get involved in.\nFinally, we sometimes need help to hold and run fund-raising events although signing a direct debt to help us each month is much the best way to fund elections.\nTo volunteer, please fill in the form on the contact page and one of our team will get back to you. Alternatively, please feel free to contact us directly for a chat. Please get in touch if you require any more information or have any specific access needs. You don’t have to be a member of the Green Party to volunteer your time with us.\nTo contact parliamentary candidates and to engage with social media here are the details:\nColne Valley: Heather Peacock\nEmail: colne.valley@votegreen.uk\nFacebook: https://www.facebook.com/kirkleesgreens/\nTwitter: https://x.com/Greens4CV and https://x.com/Heather95238955\nDewsbury & Batley: Simon Cope\nEmail: dewsbury.batley@votegreen.uk\nFacebook: https://www.facebook.com/simon4dewsburybatley\nTwitter: https://twitter.com/simonjcope\nInstagram: https://www.instagram.com/simoncopes/\nHuddersfield: Andrew Cooper [to follow]\nEmail: AndrewCooperGreenParty@gmail.com\nCampaign Hotline: 07526 069562:\nOssett & Denby Dale: Neil Doig\nSee details on web: https://wakefieldgreenparty.org.uk/neil-doig/\nSpen Valley: Martin Price\nEmail: spen.valley@votegreen.uk\nFacebook: https://www.facebook.com/kirkleesgreens/\nTwitter: https://x.com/kirkleesgreens",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_tag_karenallison/content_30.html": "Sue and Karen help with Castle Hill clean up 29th June 2020 / 24th March 2024 by Lockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […] Read more » Huddersfield Karen Alison Kirklees Newsome Sue Lee-Richards",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2021_04_12_chris-green-candidate-for-crosland-moor-and-netherton/content_41.html": "Chris Green, Green Party candidate for Crosland Moor and Netherton, is concerned about the impact on the ward of new housing for example in Netherton and the proposed building of nearly 800 homes in Crosland Hill.\nHe said: “People are worried about increased pressures from new housing – on traffic, schools and services.\n“I want to see our neighbourhoods made safer. Let’s unlock the ideas people have about how to improve road safety. The dangers of speeding traffic, inconsiderate parking and poor air quality are increasingly worrying people. We can make it safer for children and students to walk and cycle.”\nChris in favour of low cost traffic calming (as Green councillors have installed in Newsome ward), better footpaths and cycle paths. He says they all help to make for safer, more liveable streets. He supports the extension of the Meltham Greenway beyond Netherton to Lockwood to encourage cycling and walking.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_local-elections-2024/content_38.html": "7th June 2024 / 11th June 2024 by petertaylor\nIn the most recent local elections the Green Party were the main challengers to Labour locally and were less than 3% behind Labour with the Lib Dems and Conservatives way behind. There is no danger of the Conservatives winning in Huddersfield!\nRead more »\n7th June 2024 / 8th June 2024 by petertaylor\nGreen candidates in May elections for Kirklees Council recorded some stunning victories and a near miss. In Crosland Moor & Netherton ward, Alex Vickers was elected by a majority of 354 and a vote share of 41%. In 2023 she came second. Her victory in 2024 was the result of having undertaken a great deal […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2022_04_12_weak-record-on-climate-change/content_32.html": "On Climate Change, Labour in Kirklees is a pretty average council but talk as if they are national leaders. They just aren’t. Climate Emergency UK who independently assess councils responses to Climate Change gave Kirklees a humiliating 0% due to their lack of a Climate Action Plan to address the problem. This was confirmed this week when a report by the University of Leeds identified the lack of a Climate Action Plan. As the report is published on the Council’s website and has the support of the Kirklees Climate Commission it is pretty clear it’s accepted by Kirklees. The fact is that many other Councils have got Climate Action Plans and have done much more than Kirklees on Climate Change.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_tag_newsome/content_21.html": "Sue and Karen help with Castle Hill clean up 29th June 2020 / 24th March 2024 by Lockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […] Read more » Huddersfield Karen Alison Kirklees Newsome Sue Lee-Richards\n“Off Yer Bike” 29th June 2020 / 24th March 2024 by Following a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […] Read more » Andrew Cooper Huddersfield Kirklees Newsome",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_covid19/content_42.html": "Covid 19\n11th June 2020 / 24th March 2024 by\n“Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […]\nRead more »",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_local-elections-2022/content_17.html": "12th April 2022 / 12th April 2022 by\nWe are heading into another round of Kirklees Elections. So the possibility of a Labour Council with a majority doesn’t exactly fill me with hope and joy – just potential disappointment. Don’t get me wrong, there are plenty of good people in the Labour Party and I would much rather have a Labour Party that […]\nRead more »\n12th April 2022 / 13th April 2022 by\nGreen Party candidates are contesting 21 wards in Kirklees. Of the 21 candidates, 8 are women. Karen Allison is defending her seat in Newsome ward. Kirkburton parish councillor, Richard Burton, is the Green’s candidate in Kirkburton ward. In Greenhead ward, Heather Peacock, a leading campaigner with Save The Trees Kirklees, is the party’s candidate.\nOne example [of climate action] is the pilot project retrofitting 8 council properties on Abbey Road in Fartown. Labour Cabinet members trooped up there for a photocall with Labour Leader Keir Starmer. It looks like some good work has been carried out there, but it is a one off pilot project with no plan to […]\nOn Climate Change, Labour in Kirklees is a pretty average council but talk as if they are national leaders. They just aren’t. Climate Emergency UK who independently assess councils responses to Climate Change gave Kirklees a humiliating 0% due to their lack of a Climate Action Plan to address the problem. This was confirmed this week when […]\nLabour has been a shambles on Kirklees Council. The evidence is plentiful. The debacle over the Council breaking it’s promise to host the National Rugby League Museum in The George Hotel, the A629 road widening project which will see the felling of 126 trees on an iconic entrance way to Huddersfield, Labour Councillors backing the building of […]\nThe prospects of environmental disaster at a local quarry was presented to Kirklees Cabinet in March by Clare Walters, Green Party parish councillor and election candidate for Dalton ward. Clare asked for support from officers but at the end of the meeting was disappointed. Activist and wildlife conservation adviser, Clare Walters who is a member […]\n12th April 2022 / 14th April 2022 by\nGreens in Bradford and Kirklees are supporting campaigners, Save Our Spen, in fighting plans for a huge new warehouse in Kirklees close to a busy junction on M62. Sited near junction 26 (Chain Bar), it is expected to provide a massive warehouse for Amazon with movements 24 hours a day.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2022_04_12_green-party-activist-fights-for-local-wildlife/content_39.html": "The prospects of environmental disaster at a local quarry was presented to Kirklees Cabinet in March by Clare Walters, Green Party parish councillor and election candidate for Dalton ward. Clare asked for support from officers but at the end of the meeting was disappointed.\nActivist and wildlife conservation adviser, Clare Walters who is a member of Kirkburton Parish Council, was reporting to Kirklees Cabinet about the recent developments at Laneside quarry in Kirkheaton.\nClare said: “Things have now become urgent. Returning lapwing and skylarks have nowhere to nest, their breeding area uninhabitable because of overstocking by cattle. It is not too late – if the animals are removed before mid-March and the grassland rested and cut for hay then the birds might still breed.\n“I have collected signatures from over 1500 local people who love this little hidden gem and want it to be saved but It seems that nobody in a position to avert this destruction is listening. In desperation, I went to the Council’s cabinet, hoping that the councillors present would alert the relevant officers to the urgency of the issue. The response was not encouraging, but I will continue to work to save the site for wildlife while ever there is.”\nThe history of the quarry\nLaneside quarry in Kirkheaton was used to extract clay for Elliot’s brickworks. After the factory closed in around 1974 it lay idle for many years and became an oasis for wildlife amidst countryside increasingly impoverished by intensive silage, grain production and grazing by dairy herds.\nThe quarry is an SSSI because of the presence of great crested newts. It is also a designated priority habitat as part of the UK Biodiversity Action Plan because of the priority species it contained. It was until very recently home to grasshopper warblers, song thrush, reed bunting, garden warblers, lapwing and skylarks as well as wall brown and dingy skipper butterflies, pipistrelle and noctule bats, badgers, foxes and roe deer.\nIn 2000, owners Elliot’s were granted planning permission to change the use to a landfill site on condition that they carried out extensive mitigation. This they began before selling the site on to Casey’s who remained the owners and, although they did no landfill works, continued with the upkeep of mitigation areas until 2019 when they sold the quarry on to Crompton’s. By this time the value of the site for wildlife had increased and an impressive species list was compiled annually by local naturalists.\nNew owners Crompton applied to the council for change of use from a repository for household refuse to a recycling area for building rubble and a site for dumping soil. Despite the declaration of a Climate Emergency, Kirklees Council failed to us this opportunity to review the permissions. If they had it could have prevented the felling of Cockley Beck, an ancient semi natural woodland within the quarry area, or to review the protection needed for the site to avoid reduced numbers and diversity of wildlife.\nClare has been attempting to engage with Crompton’s, Natural England, Kirklees ecologists, planners and councillors for two years.\nSadly Crompton’s have carried out no maintenance of mitigation areas since they took ownership. They have inadvertently destroyed much of the value of the site while building haul roads into the quarry. As a result, sensitive species such as the grasshopper warblers and dingy skipper have now been lost. They have also introduced a herd of highland cattle which have been left to overgraze and poach a grassy hillside which had been a nesting site for skylark and lapwing.\nClare is still pushing for changes. She argues for a new management agreement to be put in place to save the colony of 25 lapwing that bred on the site until last year and all the other species that flourished on the site.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_kirklees/content_46.html": "29th June 2020 / 24th March 2024 by\nLockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […]\nRead more »\nFollowing a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […]\n11th June 2020 / 24th March 2024 by\n“Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […]\n15th November 2019 / 24th March 2024 by\nGreen Party members joined a demonstration by local campaigners outside the Town Hall in Huddersfield on 13th November before the Kirklees full council debated the Climate Emergency Report. In the debate many councillors felt it was an important step forward and should not be a party political issues. But there were significant criticism about a […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_news/content_18.html": "Green Party Election Results 2024 5th July 2024 / 11th July 2024 by petertaylor Huddersfield: Greens come second Andrew Cooper was second in Huddersfield and polled 10,568 votes – only 4.500 votes behind Labour – one of the biggest Green votes in the country. He fought a dynamic campaign which reached all parts of the constituency, which already has 4 Green Party councillors. The use of social media, strong […] Read more »\nLocal Green candidates score well in climate and nature survey 3rd July 2024 by petertaylor Kirklees Climate Commission with Friends of the Earth in Huddersfield we have now collated the responses to a General Election candidate survey. Our Green Party candidates, Andrew Cooper and Heather Peacock scored highest in a detailed climate and nature survey. We would especially encourage you to look at Kirklees Climate Commission’s Q&A responses from candidates. The full […] Read more »\nRally at Castle Hill, Huddersfield 1st July 2024 / 1st July 2024 by petertaylor Andrew Cooper thanked activists for ensuring a full coverage of the constituency. He said that far from being a divisive issue our concern about Palestine and Gaza had “brought people of the town together”. Heather Peacock said that she had witnessed serious deterioration of health services over the past 14 years. She has worked for […] Read more »\nFly tipping is a never-ending problem in Milnsbridge 21st June 2024 / 21st June 2024 by petertaylor Heather Peacock, Green Party parliamentary candidate for Colne Valley and trees campaigner, has been working hard in the last week to save Milnsbridge from dumping of waste. “Fly tipping is a never-ending problem in Milnsbridge”, says local resident Heather, “I am determined to see it stopped. It will need a mix of community resistance, prosecutions […] Read more »\nGreen Party fields candidates in all 5 constituencies in Kirklees 11th June 2024 by petertaylor The five parliamentary candidates standing for the Green Party in the General election in July are Colne Valley – Heather Peacock; Dewsbury & Batley – Simon Cope; Huddersfield – Andrew Cooper; Ossett & Denby Dale – Neil Doig; Spen Valley – Martin Price. The boundary changes have put Denby Dale and Kirkburton in a new […] Read more »\nAndrew Cooper: We Need a New Voice in Parliament 11th June 2024 / 11th June 2024 by petertaylor We need a voice for Huddersfield in Parliament.A Labour Government is a certainty and we have a Labour lead Kirklees Council. A Labour MP could not speak up for Huddersfield and put Party before local people. All Labour MPs have to follow their Party Whip.Andrew Cooper would be free to speak up for local people. Whether […] Read more »\nA letter on Gaza to voters in Huddersfield 11th June 2024 / 11th June 2024 by petertaylor Andrew Cooper says “the Green Party Stands with Palestine” in a letter to electors in the Huddersfield constituency. The letter (see below) sets out the position in full. This initiative follows on from a motion proposed by Greens to Kirklees Council calling for an immediate permanent cease fire. View image below as pdf >> Read more »\nLocal Election Result in Huddersfield 7th June 2024 / 11th June 2024 by petertaylor In the most recent local elections the Green Party were the main challengers to Labour locally and were less than 3% behind Labour with the Lib Dems and Conservatives way behind. There is no danger of the Conservatives winning in Huddersfield! Read more »\nGreens breakthrough in local elections 7th June 2024 / 8th June 2024 by petertaylor Green candidates in May elections for Kirklees Council recorded some stunning victories and a near miss. In Crosland Moor & Netherton ward, Alex Vickers was elected by a majority of 354 and a vote share of 41%. In 2023 she came second. Her victory in 2024 was the result of having undertaken a great deal […] Read more »\nVote Green on 5th May 12th April 2022 / 12th April 2022 by We are heading into another round of Kirklees Elections. So the possibility of a Labour Council with a majority doesn’t exactly fill me with hope and joy – just potential disappointment. Don’t get me wrong, there are plenty of good people in the Labour Party and I would much rather have a Labour Party that […] Read more »",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2021_04_12_full-slate-of-candidates-in-kirklees/content_33.html": "Green Party candidates are contesting all 23 wards in Kirklees. Including two by-elections, there are 25 candidates – 9 women and 14 men.\nAndrew Cooper is defending his seat in Newsome he first won twenty -two years ago. He is also the Green Party candidate for West Yorkshire Mayor.\nDavid Knight is candidate in Kirkburton where he has lived for over 25 years and is already a parish councillor. David is a keen environmentalist actively involved local in conservation projects. The Greens are mounting a strong challenge in Kirkburton Ward.\nIn Birstall and Birkenshaw, two candidates are standing to fill two vacancies – Ty Akram who lives locally and fought Batley & Spen for the Green Party in the general election and Ross Peltier, who is a Rugby League international representing Jamaica.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2020_06_11_reset/content_28.html": "“Normal life” is on hold.”\nFor many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a darned good time on occasion, are all closed. Workplaces, cafes, restaurants, pubs, churches, mosques, temples, schools are all empty. The treadmill of everyday life has stopped for the first time in generations. The machine has stopped. We can’t simply start it again without asking some serious questions about what is important to us.\nIt is a time to reflect, to think about the things that we value and all that we want to see changed for the better.\nWe have relied on the Public and voluntary sectors like never before. They are valued like never before and so is what they can do to protect us and provide for our everyday needs. This is something the private sector simply cannot and would never match.\nThe NHS’s future has to be secured, but it has got to go way beyond the warm words that all politicians say. Those who supported a market of NHS services need to reflect on whether the likes of Richard Branson have any place making a profit from our health services.\nA positive out of this awful situation is the benefit to our local and global environment. The “engines of death” no longer leave their trails across the sky as planes are grounded at airports, our roads are uncongested and cycling has become a much safer option. The air is cleaner than ever before with the knock on benefit to climate change and public health.\nMillions have discovered the joys of video conferencing apps for meetings, conferences or even simply meeting up with friends for a drink. That will not disappear when lockdown ceases. The need to travel and meet face to face will be much less.\nOur sense of community has grown. People have been confined to their homes largely and many have helped their more vulnerable neighbours through difficult times. The Thursday night clapping rituals for the NHS have brought many together as never before.\nWith local government and the NHS having been at the forefront of the fight against COVID 19 there can be no return to austerity economics. Boris Johnson professes to have opposed Conservative austerity (but there is little evidence for that in his voting record). So now we have ensure that the vision we have for a clean environment, a more equal society and one that has support for community at the heart of its thinking is supported by the economic choices we make.\nSo now we must provide the space for a public debate on the future for the UK so we can press the reset button on all we know and have a new consensus about the better future that can be achieved for us all.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_contact/content_5.html": "Published on behalf of Andrew Cooper, Heather Peacock, Simon Cope by Peter Taylor, 18 Lane Head Lane, Kirkburton, Huddersfield HD8 0SQ\nPublished on behalf of Martin Price by Sue Lee-Richards, 45 New Laithe Hill, Huddersfield HD4 6RF\nPublished on behalf of Neil Doig by Janet Mackintosh, 5 Haldane Crescent, Wakefield WF1 4TE",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2020_06_29_sue-and-karen-help-with-castle-hill-clean-up/content_24.html": "Lockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed at the bottom of the road up to Castle Hill but this could be a few weeks before it happens.\nSue Lee-Richards who has been involved in a number of clean ups on Castle Hill said,\n“Much as we like getting together with people from the community to make Castle Hill tidier it would be much better if people treated the area with the respect such a beautiful and iconic part of our town deserves.”",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_tag_suelee/content_25.html": "Sue and Karen help with Castle Hill clean up 29th June 2020 / 24th March 2024 by Lockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […] Read more » Huddersfield Karen Alison Kirklees Newsome Sue Lee-Richards",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_donate/content_12.html": "You can make a one-off or regular donation of any amount to Kirklees Green Party. You can set up a standing order (form Below) or make a one off payment by bank transfer.\nOur bank details are:\nHuddersfield and Kirkburton Green Party\nSort Code: 09-01-28 Account No: 58668268\nPlease contact us if you have any questions, and to let us know of your dontation.\nYour donations directly help us work towards a sustainable, greener and fairer Kirklees. Thank you in advance for your support.\nData Protection Act. The information you supply us with will be treated by Kirklees Green Party in the strictest confidence, in accordance with the Data Protection Act 1998 and will not be passed on to any third parties. *Under the Political Party Elections and Referendums Act 2000 (PPERA) you must be on the electoral register in the UK ‘excluding the Channel Islands and the Isle of Man’ in order to make a donation of more than £500.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_06_11_green-party-fields-candidates-in-all-5-constituencies-in-kirklees/content_15.html": "The five parliamentary candidates standing for the Green Party in the General election in July are Colne Valley – Heather Peacock; Dewsbury & Batley – Simon Cope; Huddersfield – Andrew Cooper; Ossett & Denby Dale – Neil Doig; Spen Valley – Martin Price.\nThe boundary changes have put Denby Dale and Kirkburton in a new Ossett & Denby Dale constituency; Mirfield in Spen Valley; Crosland Moor and Netherton in Huddersfield.\nA short biography and election address for all candidates can be found HERE >>\nA full campaign is operating in Huddersfield constituency where Green Party has a serious chance of upsetting expectations. Green Party votes in the local elections were within 3% of the Labour share of the votes across the 6 wards.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_general-election-2024/content_9.html": "5th July 2024 / 11th July 2024 by petertaylor\nHuddersfield: Greens come second Andrew Cooper was second in Huddersfield and polled 10,568 votes – only 4.500 votes behind Labour – one of the biggest Green votes in the country. He fought a dynamic campaign which reached all parts of the constituency, which already has 4 Green Party councillors. The use of social media, strong […]\nRead more »\n3rd July 2024 by petertaylor\nKirklees Climate Commission with Friends of the Earth in Huddersfield we have now collated the responses to a General Election candidate survey. Our Green Party candidates, Andrew Cooper and Heather Peacock scored highest in a detailed climate and nature survey. We would especially encourage you to look at Kirklees Climate Commission’s Q&A responses from candidates. The full […]\n1st July 2024 / 1st July 2024 by petertaylor\nAndrew Cooper thanked activists for ensuring a full coverage of the constituency. He said that far from being a divisive issue our concern about Palestine and Gaza had “brought people of the town together”. Heather Peacock said that she had witnessed serious deterioration of health services over the past 14 years. She has worked for […]\n21st June 2024 / 21st June 2024 by petertaylor\nHeather Peacock, Green Party parliamentary candidate for Colne Valley and trees campaigner, has been working hard in the last week to save Milnsbridge from dumping of waste. “Fly tipping is a never-ending problem in Milnsbridge”, says local resident Heather, “I am determined to see it stopped. It will need a mix of community resistance, prosecutions […]\n11th June 2024 by petertaylor\nThe five parliamentary candidates standing for the Green Party in the General election in July are Colne Valley – Heather Peacock; Dewsbury & Batley – Simon Cope; Huddersfield – Andrew Cooper; Ossett & Denby Dale – Neil Doig; Spen Valley – Martin Price. The boundary changes have put Denby Dale and Kirkburton in a new […]\n11th June 2024 / 11th June 2024 by petertaylor\nWe need a voice for Huddersfield in Parliament.A Labour Government is a certainty and we have a Labour lead Kirklees Council. A Labour MP could not speak up for Huddersfield and put Party before local people. All Labour MPs have to follow their Party Whip.Andrew Cooper would be free to speak up for local people. Whether […]\nAndrew Cooper says “the Green Party Stands with Palestine” in a letter to electors in the Huddersfield constituency. The letter (see below) sets out the position in full. This initiative follows on from a motion proposed by Greens to Kirklees Council calling for an immediate permanent cease fire. View image below as pdf >>",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2022_04_12_creating-warm-homes/content_23.html": "One example [of climate action] is the pilot project retrofitting 8 council properties on Abbey Road in Fartown. Labour Cabinet members trooped up there for a photocall with Labour Leader Keir Starmer. It looks like some good work has been carried out there, but it is a one off pilot project with no plan to be replicated and no funds to do it again. In the Green Group Budget Amendment we proposed using the Energiesprong approach used by among others Nottingham City Council. With no funding coming from central Govt this offered a self funding and economically sustainable model. Labour rejected it.\nThere are other examples 6 years on from the All Party Passivhaus report that recommended making the Passivhaus Standard the norm for Kirklees new build housing projects, Labour are finally doing a 6 house pilot project. We have no idea really what will be learned from the pilot that can’t be gleaned from just asking more forward-thinking Councils like Exeter City Council that started on the Passivhaus approach 15 years ago. It is another example of timidity and tokenism when we need real leadership.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk/content_1.html": "Think global, act local!\nThe Green Party is growing fast. Despite our unfair elections system, we punch above our weight. We represent people in Westminster and in a record number of local councils across the country. Green candidates will be on the ballot paper in the General Election in all constituencies in Kirklees.\nIn Kirklees we now have four Green Party councillors. Andrew Cooper, Karen Allison and Sue Lee-Richards were joined in May 2024 by Alex Vickers who was elected for Crosland Moor & Netherton. In Greenhead ward, Maryam Jawaid came within 41 votes of beating the sitting Labour councillor. In 2026 we will be working hard to elect even more. We also have Green councillors playing a part in parish and town councils.\nTogether with our members and supporters, our councillors are working on a wide range of issues locally to improve the lives of all people across Kirklees, and to safeguard our local environment.\nWe depend on the contribution of people rather than corporate finance. With your support we can achieve so much more for the people and the environment of Kirklees.\nHelp us lead change\nThe Green Party is the only major political party in the UK that is committed fully to a life based on democracy and justice within the planet’s limits.\nThe Green Party has always dared to be different – and we’ve always known the power of good ideas.\nUnlike others, we know that our planet has environmental limits, we understand that not everyone wants to live to work, that inequality is not just unfair, but damaging to everyone in society. And we have the bold solutions which allow us to offer inspiration in this age of uncertainty.\nWe are the only party dedicated to fighting for our environment and ensuring we live in a fair and just society\nCandidates 2024\nLatest News\n- Green Party Election Results 2024Huddersfield: Greens come second Andrew Cooper was second in Huddersfield and polled 10,568 votes – only 4.500 votes behind Labour – one of the biggest Green votes in the country. He fought a dynamic campaign which reached all parts of… Read more: Green Party Election Results 2024\n- Local Green candidates score well in climate and nature survey Kirklees Climate Commission with Friends of the Earth in Huddersfield we have now collated the responses to a General Election candidate survey. Our Green Party candidates, Andrew Cooper and Heather Peacock scored highest in a detailed climate and nature survey. We would… Read more: Local Green candidates score well in climate and nature survey\n- Rally at Castle Hill, HuddersfieldAndrew Cooper thanked activists for ensuring a full coverage of the constituency. He said that far from being a divisive issue our concern about Palestine and Gaza had “brought people of the town together”. Heather Peacock said that she had… Read more: Rally at Castle Hill, Huddersfield\nUpcoming Events\n- No upcoming events",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_06_11_a-letter-on-gaza-to-voters-in-huddersfield/content_11.html": "Andrew Cooper says “the Green Party Stands with Palestine” in a letter to electors in the Huddersfield constituency. The letter (see below) sets out the position in full. This initiative follows on from a motion proposed by Greens to Kirklees Council calling for an immediate permanent cease fire.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_06_07_the-green-party-is/content_20.html": "In the most recent local elections the Green Party were the main challengers to Labour locally and were less than 3% behind Labour with the Lib Dems and Conservatives way behind.\nThere is no danger of the Conservatives winning in Huddersfield!\nIn the most recent local elections the Green Party were the main challengers to Labour locally and were less than 3% behind Labour with the Lib Dems and Conservatives way behind.\nThere is no danger of the Conservatives winning in Huddersfield!",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_huddersfield/content_37.html": "Huddersfield Content\n29th June 2020 / 24th March 2024 by\nLockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […]\nRead more »\nFollowing a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […]\n11th June 2020 / 24th March 2024 by\n“Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […]\n15th November 2019 / 24th March 2024 by\nGreen Party members joined a demonstration by local campaigners outside the Town Hall in Huddersfield on 13th November before the Kirklees full council debated the Climate Emergency Report. In the debate many councillors felt it was an important step forward and should not be a party political issues. But there were significant criticism about a […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2022_04_12_vote-green-on-5th-may/content_14.html": "We are heading into another round of Kirklees Elections. So the possibility of a Labour Council with a majority doesn’t exactly fill me with hope and joy – just potential disappointment. Don’t get me wrong, there are plenty of good people in the Labour Party and I would much rather have a Labour Party that I could work with than what we have in Kirklees at present.\nSo on 5th May vote Green, elect more Green Councillors and let’s play our proper part in tackling climate change and the cost of living crisis.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_07_05_green-party-election-results-2024/content_2.html": "Huddersfield: Greens come second\nAndrew Cooper was second in Huddersfield and polled 10,568 votes – only 4.500 votes behind Labour – one of the biggest Green votes in the country.\nHe fought a dynamic campaign which reached all parts of the constituency, which already has 4 Green Party councillors.\nThe use of social media, strong leaflets and a last minute election day “push” created high profile and a lot of public support for a principled policies on inequality, health services, climate crisis and on Gaza/Palestine. .\nPhoto: Cllr Dad, Returning Officer announces the Huddersfield result.\n4 Green MPs\nThis declaration heralded the first news of a new green MP. This was in Bristol where Carla Denyer was elected with a substantial majority. Later three more results gave us 4 Green MPs\nGreens poll well in Dewsbury & Batley\nSimon Cope secured over 2000 votes and saved his deposit in the new Dewsbury & Batley constituency. Here Simon is pictured listening to acceptance speech of Iqbal Mohamed, the newly elected MP who secured 41% of the votes.\nColne Valley: Candidate receives 3,500 votes\nThe Colne Valley constituency declaration was last and saw Jason McCartney (Con) unseated and Paul Davies (a Labour councillor for Holme Valley South) elected as a new MP.\nHeather Peacock fought a strong campaign, marred by late delivery of a freepost leaflet. She was particularly effective and outspoken in hustings about the decline of the NHS under the Tories, and secured nearly 3,500 votes (7.5%).\nSpen Valley: Candidate beats Libdem and Independent\nIn the new constituency of Spen Valley, our candidate Martin Price, an engineer who lives in Mirfield, picked up the Green baton.\nHe secured over 5% of the votes and beat the Lib Dems and the Independent candidates. Popular local MP Kim Leadbeater (Labour) was elected with a significant majority and promised to work to include all sections of the community.\nOssett & Denby Dale\nNeil Doig secured nearly 5% of the vote in the new constituency of Ossett & Denby Dale which also includes most of Kirkburton ward. Former Dewsbury MP Mark Eastwood lost to Labour in this contest. One third of the constituency is in Kirklees so the count took place in Wakefield.",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_newsome/content_36.html": "29th June 2020 / 24th March 2024 by\nLockdown has seen a rise in anti-social behaviour at Castle Hill late at night with increased littering and ‘souped up’ noisy cars going up there in the early hours of the morning. Karen and Sue have been to Castle Hill helping with community clean ups. The Council is also looking at having a barrier installed […]\nRead more »\nFollowing a joint initiative by West Yorkshire Police and Newsome Ward Councillors a number of illegal trail bikes and quad bikes have been seized. Riders of these bikes frequently use them without helmets are uninsured and ride on footpaths and fields in the area causing noise and disturbance. Newsome Ward Green Councillors funded the time […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_candidates/content_48.html": "12th April 2021 / 14th April 2021 by\nGreen Party candidates are contesting all 23 wards in Kirklees. Including two by-elections, there are 25 candidates – 9 women and 14 men. Andrew Cooper is defending his seat in Newsome he first won twenty -two years ago. He is also the Green Party candidate for West Yorkshire Mayor. David Knight is candidate in Kirkburton […]\nRead more »\n12th April 2021 / 12th April 2021 by\nChris Green, Green Party candidate for Crosland Moor and Netherton, is concerned about the impact on the ward of new housing for example in Netherton and the proposed building of nearly 800 homes in Crosland Hill. He said: “People are worried about increased pressures from new housing – on traffic, schools and services. “I want […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_category_north-kirklees/content_43.html": "North Kirklees Content\n11th June 2020 / 24th March 2024 by\n“Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […]\nRead more »\n15th November 2019 / 24th March 2024 by\nGreen Party members joined a demonstration by local campaigners outside the Town Hall in Huddersfield on 13th November before the Kirklees full council debated the Climate Emergency Report. In the debate many councillors felt it was an important step forward and should not be a party political issues. But there were significant criticism about a […]",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_news_page_3/content_26.html": "Time to press the reset button on all we know 11th June 2020 / 24th March 2024 by “Normal life” is on hold.” For many of us the ‘pause’ button has been pressed on all we know. The all consuming, news dominating B word ‘Brexit’ has been replaced with the C-word ‘Corona’ or ‘Covid19’. The physical places where we once came together as a society, where we met, collaborated, planned and had a […] Read more » Andrew Cooper Covid19 Kirklees\nKirklees climate Emergency Protest 15th November 2019 / 24th March 2024 by Green Party members joined a demonstration by local campaigners outside the Town Hall in Huddersfield on 13th November before the Kirklees full council debated the Climate Emergency Report. In the debate many councillors felt it was an important step forward and should not be a party political issues. But there were significant criticism about a […] Read more »",
  "https_kirklees_greenparty_org_uk_/https_kirklees_greenparty_org_uk_2024_07_01_our-rally-at-castle-hill-huddersfield/content_6.html": "Andrew Cooper thanked activists for ensuring a full coverage of the constituency. He said that far from being a divisive issue our concern about Palestine and Gaza had “brought people of the town together”.\nHeather Peacock said that she had witnessed serious deterioration of health services over the past 14 years. She has worked for 30 years in the NHS. At the recent hustings in Holmfirth she challenged both retiring MP Jason McCartney and Labour candidate Paul Davies over their NHS policies which would further increase the extent of private provision within the health service.\nThe keynote speaker was Natalie Bennett (member of House of Lords, right of picture). she was joined by three of our parliamentary candidates – Andrew Cooper (Huddersfield, centre), Heather Peacock (Colne Valley, second from right) and Martin Price (Spen Valley, left)."
}