{
  "https_feslrezakhan_com_/https_feslrezakhan_com/content_1.html": "I am Fesl Reza-Khan, your Green Party MP candidate for Oldham East and Saddleworth.\nI am Fesl Reza-Khan, your Green Party MP candidate for Oldham East and Saddleworth.\nI grew up in Oldham, but as a result of the economic devastation in my town, I left to join the Army. Whilst there, I gained a degree in International Relations from Staffordshire before switching to a career in Banking, followed by Local government, where I delivered projects from housing to regeneration. I have lived in various English cities including Cambridge, Stoke and Bristol before settling back in Manchester. Currently, I run my own successful investment business. I am married to an amazing, independent woman and together we have a bouncy baby daughter.\nI strongly believe in public service and have served as chair of the Manchester Council Black Officers Association and Greater Manchester Police Independent Advisory Group. Most recently, I became chair of the Manchester Muslim Community group, where I helped unite our communities against the Manchester Arena attack. Currently, I am a policy advisor to the Manchester Council Green group and co-founded the Muslim Greens group within the party to help increase the diversity of our membership.\nI hate injustice more than anything in the world. I grew up benefiting from a functioning NHS and an affordable higher education. But it’s all gone, our housing stock, water companies and gold reserves, all sold off on the cheap. On top of all this, the very survival of our species is in question due to climate change. All of our wars, disagreements and wealth will be irrelevant if the planet has decided it has had enough of us. Last year (2023) was the hottest on record and we have had 10 months in a row where all temperature records have been broken. For Humanity, the sale ends at midnight and it’s 11:59 pm. All the while those we have elected are busy rearranging the deckchairs and the band continues to play.\nI am a very worried Father. But I refuse to let it end like this. Our children deserve better and it can be fixed. I will start with political honesty, the best leadership and innovative problem-solving.\nWhat Next?\nAt the General Election, we have the chance to send a clear message that people want change. Green Party votes send a message to say we want a change in political priorities to tackle widening social inequality and for urgent action on climate change – something we have just 8 years to deal with. Every Green vote sends that message.\nBut there’s more. You can help change the course of British politics with more than just your vote. If you want to know what comes next, why not join our journey by volunteering and joining us in the Green party?\n© Fesl Reza-Khan 2024. All Rights Reserved"
}