{
  "https_communityindependents_org_/https_communityindependents_org_data-privacy/content_2.html": "Data Privacy Statement\nContact details\nName: Ben Challis\nAddress: 12 Arundel Drive, Stroud, GL5 3SH\nPhone number: 07404 546064\nEmail: info@communityindependents.org\nName: Ben Challis\nAddress: 12 Arundel Drive, Stroud, GL5 3SH\nPhone number: 07404 546064\nEmail: info@communityindependents.org\nThe type of information we collect\nWe currently collect and process the following information:\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful basis we rely on for processing this information is your consent.\nYou can remove your consent at any time.You can do this by contacting info@communityindependents.org\n- Personal identifiers and contact details, including area of residence (ward level), e-mail addresses and phone numbers.\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful basis we rely on for processing this information is your consent.\nYou can remove your consent at any time.You can do this by contacting info@communityindependents.org\nHow we get the personal information and why we have it\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\n- You have completed our survey, subscribed to our newsletter, signed up to our mailing list or engaged through our social media channels (including whatsapp)\n- You have provided your personal information directly to one of our volunteers or candidates.\nWe may receive personal information indirectly through social media service providers, where you have engaged with the Community Independents via their platform (such as What’s App or Facebook).\nWe use the information that you have given us to inform our campaigning activities: including providing you with updates on our campaign, activities and events; to seek your views on issues related to the area in which you live; and to provide you with information on how to get involved.\nWe may share this information with candidates and/or volunteers working on behalf of the Community Independents campaign. We will never share your information with any third-party organisation.\nDate: 30/01/2024",
  "https_communityindependents_org_/https_communityindependents_org/content_1.html": "Thursday, 2nd May\nWe know that people and the communities they live in are best-placed to solve the problems they face.\nThe role of councillors is to enable and empower everyone to take action and get things done.\nOur communities are at their best when they are empowered to use their voice, and to share perspectives and experiences on any given issue.\nAs your representatives, it is our mission to create safe and accessible spaces in which everyone feels free to speak.\nWe are open and clear about how we make decisions, encouraging collaborative decision making and co-creating how we share our news.\nWe are directly accountable to the community we serve. We believe in participatory democracy where everyone has a voice.\nWe are an independent network of local councillors: activists and community leaders from across Stroud district, who are here to put people before politics.\nWe believe that local government has the potential to make a big difference to everyday life for everybody.\nWe are standing as councillors because we want to bridge the gaps between our communities and political power.\nWe want to turn this experience into political action and use our understanding of everyday life in our area to shape the decisions that are made for all of us.\nThis means we are free to speak up for the people we represent, make decisions that consider everyone’s interests and prioritise work that helps our communities.\nBetween us, we have built up a comprehensive understanding and lived experience that we can bring to the discussion.\nWe create opportunities to learn from everyone we work with.\nThere are three Ward Councillors for Cainscross. If you live there, we are asking you to trust ONE of your THREE votes to our independent candidate — Charlie MITCHELL.\nCharlie MITCHELL [she/her] works tirelessly on inclusivity and has pioneered a number of initiatives that bring people together, finding practical solutions to help meet their needs.\nCharlie is keen to make all of our public spaces more accessible and has also launched a programme of support for parents of children who see the world differently.\nRodborough has two Ward Councillors. Robin LAYFIELD is currently one of them and plays a key role on the Co-operative Alliance Leadership Team.\nWe are asking you to pledge BOTH YOUR VOTES to keep Robin on the council and help us to bring Helen ELLIOTT-BOULT onto the district council for Rodborough too.\nHelen ELLIOTT-BOULT [she/her] cares deeply about the environment, women’s rights and social justice.\nHelen has been a Parish Councillor since 2021. She helped to lead Rodborough right through the pandemic, co-ordinating volunteer networks and establishing many of our street-based Whatsapp groups.\nRobin LAYFIELD [he/they] has been a Stroud District Councillor representing Rodborough since 2021.\nRobin is passionately committed to inclusion, a fair chance for everyone and a grassroots politics based on actions and not just words.\nRobin always puts the needs of our close-knit community first.\nStroud Slade will be electing one Ward Councillor and we are asking you to vote for Thea PILIKIAN.\nThea PILIKIAN [she/her] is a teacher and works at Kid’s Stuff at Brimscombe Mill.\nThea believes that community hubs like Middle of the Hill and Top of Town are vital for local resilience.\nThea is friendly and approachable, above all she really cares and she is standing to represent Slade Ward on May 2 to be your voice on the district council.\nThea is also standing for Stroud Town Council as an independent, alongside Dee NOLSON and Laurie DAVIES. There are three Town Council places and we are asking you to support all three of these independent, community-minded women for the town council.\n- Housing Committee\n- Environment Committee (Vice-Chair)\n- Members Development Working Group (Chair)\n- Alliance Leadership Team\n- 🏳️🌈 Equality, Diversity & Inclusion Member Champion\n- Equality, Diversity, Inclusion & Equity Working Group\n- Regeneration & Investment Board\n- Stroud Regeneration Board\n- 2030 Community Engagement Board\n- Strategic Planning Advisory Board\n- Community, Services & Licensing Committee (Vice-Chair)\n- Leisure oversight board\n- Unite the Union rep\n- Chair of Council\n- Audit & Standards Committee\n- ✊🏽 Migrants Member Champion\n- 🎖️ Armed Forces Champion\nThe Co-operative Alliance that leads the district council was established in 2012 and is one of the longest running cross-party administrations in the UK.\nIn that time, Community Independents have sat on key committees and have occupied senior roles at Ebley Mill: demonstrating that independent councillors can make a serious and meaningful contribution to the work of the district council.\nAt the council-level, Community Independents have lived by their values to stand up for equitable employment practices for staff working at the Leisure Centre.\nCommunity Independents participate in Stroud’s Neurodiverse Universe, Rodborough Sunday Social and Stroud Imagines.\nThis includes establishing Repair cafés to reduce wastage, attracting new investment into walking & cycling and accessible town centres, promoting the canal as a nature haven and supporting better flood mitigation, as well as championing e-bike hire schemes, along with improvements to public transport.\nWe are passionate about the protection of outdoor space including the commons, parks and recreational spaces.\n*Third spaces are places where people can gather to socialise or create or entertain, that are open to all and where there is no expectation of payment or cost.\nIf you are an independent local councillor — or — a community leader that feels strongly aligned with our values and would like to bring your voice to the work we do, let's talk.\nSend a message to our WhatsApp number 07404546064 with the name of your ward (CAINSCROSS, RODBOROUGH or SLADE) and we'll check back in with you on Election Day"
}