{
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_events/content_18.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nEVENTS\nEVENTS\nDecember Soundbath\nSoundbath December 10th 4.30pm\nJoin us for a fantastically chilled and healing soundbath complete with singing bowls, chimes, gongs and drums. We spend a relaxing hour cocooned in cosy blankets allowing the vibrations to permeate the room and our consciousness. Follow the guided meditation or just allow your mind to wander. Followed by optional refreshments. Bring with you a yoga or camping mat, a blanket or quilt and cushion or pillow. Some items will be available to borrow at the clinic on a first come, first served basis.\nLocation - ReCoop Health, Aston Road, CV11 5DT\nPrice: £16.00\nWorkshops, Reiki Dojo & Potions Club\nSessions are held at the Therapy Rooms, ReCoop Health , Aston Rd, Nuneaton, CV11 5DT.\nPRE -BOOKING FOR EVENTS IS ESSENTIAL\nPotions Club\nPotions Club is a monthly formulation club where we learn about how to mix aromatherapy blends and formulate our own cosmetics, skincare and green cleaning products.\nPast sessions have included creating bespoke facial masks, making Chocolate Body Velvet whipped body butter, tailored cleansers, pulse blends and bath oils - not to mention reed diffusers.\nMonthly themes are updated regularly so click on the icon to go to the Potions Club page to see what's coming and to book in.\nPre booking is essential so we can ensure everyone has all the ingredients they need. Great fun but informative and practical too.\nReiki Dojo\nA friendly, inclusive Reiki share circle and community with the option of Reiki training at all levels. Our community meets monthly to share Reiki together. The circle also spends time in guided meditations and strengthening energy work.\nEveryone is welcome, whether you have never heard of Reiki and are curious to learn more or are a seasoned Reiki Master or Teacher.\nMembers can simply attend, receive attunements or undertake their next level Reiki raining, there's no obligation to do so to be a member but it's an option.\nAll levels of training can be pursued.\nWorkshops\nAll of the community workshops are lead by a qualified teacher, Lindsey, so a high standard of teaching is assured. All workshops aim to share safe, simple and effective therapeutic techniques for families to use at home.\nThe emphasis on these sessions is on safety and good technique so you can be confident you have the skills to share with your nearest and dearest. Lindsey wants everyone to have access to therapies for self care and to safeguard wellbeing. Touch therapies are an excellent way to promote health and support communication and enhance relationships.\nThese sessions aren't accredited professional therapy training, which Lindsey also offers, so if you are interested in training to become a professional therapist, please get in touch! brookes.beauty@gmail.com",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_professional-training/content_19.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nProfessional Therapy Training\nAvailable Courses\n- Swedish Body Massage\n- Aromatherapy\n- Aromatherapy Massage\n- Pregnancy Massage\n- Aromatherapy for Pregnancy Massage\n- Facials\n- Reflexology\n- Deep Tissue Massage\n- Hot Stone Massage\n- Reiki (Level One to Master Teacher)\n- Indian Head Massage\n- Hopi Ear Candling\n- Crystal Healing\n- Chakra Balancing\n- Meditation\nProfessional, accredited training by experienced tutors.\nWe offer Introductory and postgraduate accredited professional therapy training at our clinic in Nuneaton, Warwickshire. We're really accessible, being located close to the M1, M6, M69 and a short, direct walk from Nuneaton train station.\nOur courses comprise of CPD training for qualified practitioners and longer skills based learning for those wishing to become qualified therapists. Our courses are accredited, insurable and taught to a very high standard by an experienced teacher, Lindsey Brookes.\nLindsey has over 25 years teaching experience and has a thriving private complementary therapy practice. She creates an inclusive environment for everyone to learn in her beautiful clinic. Professional therapy courses and CPD postgraduate courses are accredited and insurable. Attendance, Introductory and community courses are open to everyone. Lindsey also offers courses in how to launch and grow your own therapy business to ensure success with your new skills. An optional mentored case study programme is also available to support new therapists following their initla practical training.\nUse the forms below to register your interest and we will happily provide all the information you need.\nTraining is available in\n- Swedish Body Massage\n- Aromatherapy\n- Aromatherapy Massage\n- Pregnancy Massage\n- Aromatherapy for Pregnancy Massage\n- Facials\n- Reflexology\n- Deep Tissue Massage\n- Hot Stone Massage\n- Reiki (Level One to Master Teacher)\n- Indian Head Massage\n- Hopi Ear Candling\n- Crystal Healing\n- Chakra Balancing\n- Meditation",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_reflexology/content_5.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nReflexology\nReflexology is a relaxing complementary therapy, based on the theory that different points on the feet, lower leg, hands, face or ears correspond with different areas of the body.\nThe experience is deeply soothing and relaxing, has immense comforting benefits for mental health and sleep difficulties and is suitable for patients undergoing palliative care. Lindsey works holistically with clients, mindful of any medical treatment they are receiving, to promote better health and wellbeing.\nBenefits of reflexology can include:\n- Stress reduction and anxiety relief\n- Improved sleep\n- Increased circulation and feeling of comfort in feet and lower legs\n- Emotional support\nFull Reflexology treatments are 1 hour - £45\nReflexology can be combined with other treatments in appointments for 60, 90 or 120 minutes.\nA fantastic Combination is the Head in the Clouds Treatment which includes Indan Head Massage and Reflexology. Foot Smoothing with Reflexology is a great combination if you have dry skin on the feet.\nContact us directly for personalised advice and guidance on whether treatments are suitable for your individual needs, text or whatsapp 07966389702.",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_treatments-and-therapies/content_6.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nTreatments & Therapies\nAll of our Complementary and Holistic treatments are bespoke and totally personalised to each individual client.\nOur experienced therapists are proficient in a wide range of techniques. We tailor each client’s session to their personal needs and preferences and are mindful of their budget.\nAll treatments are available in 30, 60, 90 or 120 minute sessions and include aromatherapy as standard, unless inappropriate or contraindicated. Any therapy can be combined during a bespoke appointment e.g. a facial with back massage or Reflexology with a back or Indian Head Massage, time permitting.\nSince the practice strives to be as ecologically sound as possible we use only premium luxury products that are effective and have impeccable ethical credentials. Always natural, organic where possible. If you wish to avoid certain ingredients or would like a purely vegan treatment, please ask prior to your treatment so we can prepare correctly.",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_about-me/content_12.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nAbout Me\nI am a passionate advocate of Complementary Therapies since spending most of my 20’s living and working in Japan. Contributing to Japan’s impressive longevity and well-being statistics is the mainstream nature of holistic therapies like massage, shiatsu, reflexology, which are viewed as standard self-care activities to maintain good life balance and wellbeing. Having benefitted significantly from regular therapy treatments myself and the natural approach to self-care and illness prevention, I was overjoyed to realise a long-held dream to retrain as a professional therapist following my return to the UK.\nI work with respected partners such as Neal’s Yard Remedies Organic and other premium luxury brands with impeccable ecological credentials and a strong reputation for outstanding effectiveness which means my clients get the absolute best in terms of the quality of their treatments and the professional grade products used. These are also available for clients to purchase to continue to get results at home between treatments.\nLocation:\nBrookes Beauty\nat Recoop Health\nAston Road\nAbbey Green\nNuneaton\nCV11 5DT\nHours:\nWe are open by appointment during the week daytime and evenings and Saturdays depending on the training calendar. Public workshops, events, pop uo spas and professional therapy training feature at the weekends although members of the Therapy Team are available for appointments when the venue isn't exclusively booked.\nLate evening appointments during the week on Tuesdays, Thursdays and Fridays until 8.30 pm are subject to availability and booking.\nBirthday and hen do proivate Pop Up Spas and parties are available.",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_mens-treatments/content_7.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nMen's Treatments\nBody Treatments are available in 30, 60, or 90 minutes treatment sessions.\n30 minutes - £28\n60 minutes - £42\n90 minutes - £60\nMale clients are welcome at the practice and can choose from any of the treatments available. Since all treatments are bespoke and tailored to each client men can be assured they will be advised of appropriate products and techniques.\nMen's facials, grooming manicures and pedicures are as popular amongst our male clients as deep tissue massage and muscle management.\nFacial\nExpress Facial 30 minutes - £28\nSignature Facial 60 minutes - £42\nLuxury Facial 90 minutes - £65\nIntense Lift Age Defence Facial 90 minutes - £75\nMassage treatments\n- Deep Tissue Massage\n- Myofascial release\n- Emmett Technique\n- Hot Stones Massage\n- Aromatherapy Massage\n- Swedish Massage",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_workplace-wellbeing/content_2.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nWORKPLACE WELLBEING\nTailored Programmes & Pop Up Stations\nBrookes Beauty fields a team of experienced, fully qualified and insured therapists who come to your workplace or organisation.\nto British businesses due to stress, many companies, small and large, are instituting Workplace Wellbeing programmes, as\nrecommended by the Health and Safety Executive.\nOur programmes help to manage and reduce stress at work, applying short but effective 20 minute sessions per client.\nWe offer a range of treatments, designed for both groups and individuals from Relaxation sessions, Reiki and Reflexology, to Indian Head and Accupressure Massage, delivered to employees in the workplace.\nClients remain fully clothed throughout and return to their desks refreshed, pleasantly alert and gently energised.\nWe arrive and set up in a quiet area in your place of work and deliver treatments. We aim to make our service as flexible as possible, to fit in with the requirements of your workforce.\nWorkplace Wellbeing Package Enqury",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_pop-up-spa-sessions/content_14.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nPrivate Pop Up Spa Sessions\nArrange exclusive use of the treatment suite for a private pamper day or evening, ideal for birthdays, hen parties and celebrations or just a well-earned treat.\nTailor your own bespoke spa programme add catering, activities or workshops alongside your treatments or simply opt for a treatment package designed for your group's needs and budget.\nPrivate sessions are held at the weekend only and are subject to availability. We also deliver fabulously relaxing and group pamper sessions, tailored to your needs at your chosen venue or home, subject to suitability.\nYour pamper programme is designed exclusively for you and your guests and can accommodate various budgets within one session, making it a flexible option.\nPlease contact us to discuss your requirements.\nWe promise you a fantastic experience!\nPrices start from £25 per person.",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_exclusive-treatments/content_4.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nExclusive Treatments\nPurchasing these treatments via this page will trigger an eVoucher to be sent to you with full instructions on how to book. Please make sure to include correct email and mobile phone details when purchasing so we can deliver the eVoucher correctly and contact you in the event of any issues. To book these treatments direct on the online booking systems go here: https://bit.ly/bookingBB\nBee Lovely Top To Toe Ritual\nThis treatment treats the whole body starting with a deeply luxurious and soothing full body massage with the Bee Lovely All Over Body Balm and Body Butter. Special attention is paid to the feet, head with scalp massage and a lifting, scultping toning facal. It preps skin beautifully for Summer holidays, pampers Winter skin and gives a fragrant hydrating treat. Suitable for all skins, including sensitive.\nBee Lovely Top to Toe Ritual £85 (105 minutes)\nHead in the Clouds Ritual\nDelightful relaxing Indian Head massage with optional oil and scalp treatment (can be performed dry). Dispelling tension in the neck, shoulders, head and face. Coupled with a full Foot Reflexology sequence which takes care of the base, promoting deep relaxation and stress relief. The beauty of this deeply relaxing treatment is the whole body benefits, you leave feeeling nourished, cherished and peaceful.\nHead In The Clouds Ritual £50 (60 minutes)\nWild Rose Full Body Glow Ritual\nThis gorgeous treatment hits every spot, includes exfoliation, full body massage, scalp treatment, signature Glow facial and smoothing foot treatment. It is aromatic, blissful and deeply relaxing. Available as a gift voucher, this is a 2 hour indulgence and not to be missed.\nWild Rose Full body Glow Ritual £95 (120 minutes)\nSmoothing Aromatic Body Ritual\nThe smoothing ritual includes a free gift, a natural sisal exfoliation mitt that can be used at home to keep skin soft. Beginning with a light dry exfoliation with your sisal mitt, there follows a full body massage with the specially formulated Aromatic Body Butter. It includes an exfoliating foot treatment using fragrant body polish and massage with hydrating foot balm . This beautiful treatment leaves skin nourished and hydrated and beautifully fragrant.\nSmoothing Aromatic Ritual £70 (90 minutes)",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_aromatherapy-personal-remedies/content_21.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nClinical Aromatherapy Service\nThe Clinical Aromatherapy Service is a personalised service designed to serve individual clients anywhere who seek complementary remedies to support their health and well being.\nOur Clinical Aromatherapist, Lindsey Brookes, consults with clients either by phone, email, Skype or face to face and takes a full client health history, is essential to deliver a safe fully insured service. This information is protected by the Data Protection Act and is held in complete confidence. Please see our Data Protection Policy.\nDepending on your needs and preferences, products will be created for your use. Common ailments that can be successfully resolved using aromatherapy are stress, anxiety, sleep and hormonal problems, pain (muscular and nerve), circulatory, inflammatory, stiffness and tension.\nEnquiry for Fragrant Pharmacy Services",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_massage-lesson-for-two/content_10.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nBespoke Workshops\nMassage Lesson for Two\nWhat a fantastic gift to surprise your partner, pal sibling or room mate with!\nThis 3 hour massage lesson will teach you both how to perform simple, effective massage techniques with confidence. Each person gets to choose their target massage zone from:\n- Back, neck and shoulders\n- Legs and hips, lower back\n- Feet and/ or head\n- Face\nThis makes a great experience gift available as a voucher to gift to a wonderful couple you know asa wedding or anniversary present and is a perfect surprise for Christmas!\nPurchase your session then contact the clinic on 07966389702 to book your convenient date for your session. Weekend, evening and weekday appointments are accomodated, subkect to availability. Popular dates and times may be booked out in advance but we'll do our best to accomodate you.\nThis is a bespoke lesson so the techniques will be tailored to your needs, it will mean you can both share massage at home competently and with confidence. It is fun, relaxing and is the gift that keeps on giving!\n£190 for 2 people for a 3 hour personalised lesson",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_body/content_20.html": "top of page\nBrookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nBody Treatments\nBody Treatments are available in 30, 60, or 90 minutes treatment sessions.\n30 minutes - £32\n60 minutes - £45\n90 minutes - £65\n120 minutes - £85\nBrowse our full Treatment Brochure and Price List\n- Salt Glows\n- Detox/ anti-cellulite lymph drainage massage\n- Couples Hot Stone Massage\n- Wild Rose Full Body Ritual\n- Honey Bunny Top to Toe Ritual\n- Foot Smoothing Treatment\nSpecial Body treatments\nAll massage treatments may be combined with other therapies on request.\nbottom of page",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_contact-me/content_16.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nContact Us\nTo join our VIP customer list and receive Special Offers and free tester products, fill in the form below. There are frequent Flash Promotions and messages regarding events.\nTo make direct contact for an enquiry, please text 07966 389702 or email brookes.beauty@gmail.com\nYou can use the comments box below to request information, samples, products or to request a callback or send us feedback. However we don't recommend you try to book a treatment using this form, it's better to text 07966 389702 or call 024 7632 8337.\nAlternatively, book online.\nThank you!",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_policies/content_22.html": "top of page\nBrookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nbottom of page\nBrookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_reiki/content_8.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nReiki Treatments & Reiki Courses\nReiki is a Japanese technique for stress reduction and relaxation that also promotes healing. It is administered by the practitioner laying their hands on or above the client or recipient who is fully clothed and is based on the idea that an unseen \"life force energy\" flows through us. If one's life force energy is low, we are more likely to feel unwell or stressed. We are more likely to feel well, strong and content when our energy is balanced and strong.\nThe word Reiki is made of two Japanese words - Rei which means \"God's Wisdom or the Higher Power\" and Ki which is \"life force energy\". So Reiki is actually \"spiritually guided life force energy.\"\nThe feelings experienced during a treatment vary from person to person. Reported effects include the whole or parts of the body enjoying feelings of a glowing radiance that flows through and around you, pools of warmth, seeing colours and a sense of enhanced perception.\nReiki treats the whole person including body, emotions, mind and spirit creating many beneficial effects that include relaxation and feelings of peace, security and wellbeing.\nReiki Treatments\n30 minute - £32\n60 minute - £45\n90 minute - £65\nReiki Training - Payment Plans available on request\nReiki Level One - £150\nReiki level Two - £150\nReiki Master - £250\nReiki Teacher - £350\nReiki can be added to standard facial and massage treatments to create a bespoke session. Chakra Balancing, Crystals and pendulum work can also be included.\nReiki training - coming soon, please contact us if you are interested in joining a course as they are held throughout the year.",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_potions-club/content_15.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nPOTIONS CLUB\nPOTIONS CLUB\nWhat is Potions Club?\nPotions Club is a fascinating monthly mash up of dabbling with essential oils and creating luxe home skincare and products - all while saving the planet and our pennies too!\nFancy mixing your own lotions and potions? Love a bit of kitchen witchery?\nIf you ever tried to make 'Rose Petal Perfume' as a child & felt disappointed with the results, you are going to LOVE Potions Club!\nIt's also an opportunity to learn how to use essential oils and simple aromatherapy blending techniques to use safely in the home. Some of our blends are designed to be effective home remedies and some are more for pleasure.\nAs we go along, we'll learn a bit about the body, how to care for your skin and how to make beautiful, unique handmade gifts easily and simply at home for your loved ones. Every session will include make and takes so you get to enjoy your creations at home and you also get the workbook or manual to keep recreating them time and again.\nCheck out the calendar below for upcoming sessions and to get tickets.\nPRE BOOKING IS ESSENTIAL TO ENSURE EVERY POTIONEER IS PROVIDED FOR!\nAll ingredients and equipment provided.\nDate: Saturday 18th June 2022 Time: 2 - 5:00 PM\nLocation: Brookes Beauty @ReCoop Health, Aston Road, Abbey Green, Nuneaton, CV11 5DT - Free Parking\nJune Potions Club Workshop - Whipped Body Butter & Aroma blends to support anxiety\nLearn about creating your own herbal, infused, medicinal oils for use in your own future projects or to use at home. Learn different methods to creating the infusions and which herbs work best and their various properties. We'll also be creating pulse blend remedies for using aromas on the go. The manual you receive means they're also easy to adapt for making more at home. All Ingredients are included in project cost and all equipment will be provided. Pre booking is essential to ensure we have enough ingredients for each Potioneer. Kits will be provided in the event you aren't able to attend.\nPrice: £25.00",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_copy-of-reiki/content_13.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nReiki Dojo - Reiki Courses and Training\nThere are four levels of Usui Reiki Training available at Brookes Therapies. We begin with Level One, and go right through to Master Teacher level. Sudents are supported throughout their Reiki journey and regular Reiki share circles and practical opportunities are organosed. We also have additional Meditaion classes, Crystal Therapy training and workshops.\nReiki Training - Payment Plans available on request\nReiki Level One - £150\nReiki level Two - £150\nReiki Master - £250\nReiki Teacher - £350\nLevel One\nLevel One Reiki training includes 4 powerful attunements throughout the 2 day course and is focussed on the basic practice of Reiki, the precepts and how to deliver self healing treatemnts. You will follow a 21 day 'Cleanse' following your course where you will try to perform Reiki on yourself daily, just for short periods and maintain a learning gratitude journal noting down any changes, challenges and benefits you are noticing. Regular practice helps you to become really comfortable with delivering Reiki and attuning your life gradually to the simple precepts. You may notice signifcant shifts in energy and feelings of enhanced wellbeing and comfort as you practice, although everyone's experience is different.\nReiki can be added to standard facial and massage treatments to create a bespoke session. Chakra Balancing, Crystals and pendulum work can also be included.\nReiki training - coming soon, please contact us if you are interested in joining a course as they are held throughout the year.\nReiki Training - Payment Plans available on request\nReiki Level One - £150\nReiki level Two - £150\nReiki Master - £250\nReiki Teacher - £350",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_manicure-and-pedicure/content_17.html": "top of page\nBrookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nManicure & Pedicures\nManicure\nBasic Grooming Manicure - £30\nLuxury Manicure - £42\nHot Stone Manicure - £25\nHealing Hands heat treatment with head massage - £42\nPedicures\nBasic Grooming Pedicure - £28\nFoot smoothing with massage - £42\nLuxury Pedicure - £30\nHot Stone Foot Massage - £42\nCloud 9 – massage of feet and head - £42\nFor information on our reflexology services please click here\nbottom of page",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com/content_1.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nWelcome to Brookes Therapies, where the art of touch meets the science of healing.\nOur specialised, inclusive massage practice is dedicated to helping you achieve profound relaxation, pain relief, and holistic wellbeing in a safe, nurturing environment. Our treatments are always tailored to each ndividual client to maximise your outcomes. But that's not all; we go beyond the ordinary. In addition to our exceptional massage services, we offer accredited professional therapy training programs for those who are passionate about the art of healing and want to make a meaningful difference in the lives of others.\nWe offer a range of holistic therapies - aromatherapy massage, deep tissue massage, hot stone massage, Reflexology, facials, Reiki, chakra balancing, Indian Head massage and combination treatments.\nAt Brookes Therapies, we understand that each individual is unique, with their own specific needs and concerns. Our team of highly skilled and certified massage therapists are committed to delivering personalised massage experiences that cater to your exact requirements. Whether you seek relief from chronic pain, stress reduction, or simply want to indulge in a luxurious spa-like experience, we have the expertise to guide you.\nBut that's not where our commitment to healing ends. If you're inspired to delve deeper into the world of therapeutic touch and embark on a career path in holistic healing, our accredited professional therapy training programs are designed just for you. Our comprehensive courses are taught by our industry experts, equipping you with the skills and knowledge needed to become a certified massage therapist, ensuring you're fully prepared not only to make a positive impact on the lives of your future clients but to launch a succesful and thriving therapy business.\nDiscover a world of natural therapies and techniques designed to help you stay well and feel better. Our mission is for our clients to leave us feeling better than when they arrived and our consistent 100% 5 star reviews suggest we are definitely achieving this!\nExplore our website to learn more about our services and training programs, and join us on a journey toards feeling amazing!\nThe lead therapist, training principal and business owner Lindsey Brookes, has been practising complementary and holistic therapies since 2010 and teaching since 2017. The practice is committed to promoting wellbeing and health support using natural, ethical, and environmentally sound products and techniques.",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_my-qualifications/content_3.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nMy Qualifications\nNVQ Level 2 VTCT Complementary Therapies\nNVQ Level 3 VTCT Complementary Therapies\nPostgraduate Diploma in Aromatherapy Blending\nPostgraduate Certificate in Indian Head Massage\nPostgraduate Certificate in Holistic Facials\nPostgraduate Certificate in Manicure & Pedicure Services\nReiki Level 1 & 2 & Master, Master Teacher\nEmmett Technique Short Course\nCertificate in Accupressure and Seated Massage\nPostgraduate Certificate in Advanced Massage Techniques\nPostgraduate Certificate in Lifting Facial Massage\nPostgraduate Diploma in Hot Stone Massage\nPostgraduate Certificate in Thai Compress Massage\nIIAA Bridal & Occasion and Male Make Up\nCity & Guilds Level 3 in Bridal Hair Design\nPostgraduate Diploma in Crystal Healing\nPostgraduate Diploma in Myofascial Release\nPostgraduate Diploma in Clinical Aromatherapy for Respiratory Support in Palliative Care (Royal Marsden Hospital)\nBereavement Support training\nPostgraduate Diploma in Aromatherapy & Pregnancy Massage\nAET Adult Education & Teaching Diploma Level 3\nLevel 3 Assessor for Vocational Training",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_facial/content_9.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nHolistic Facials\nFacial Treatments are available in 30, 60 or 90 minutes treatment sessions and each session time allows for different levels of service. Longer appointments are able to be combined with other treatments (60 and 90 minute appointments) such as massage or reflexology.\nFor full details on each treatment please download the full brochure\n30 minutes - £35\nSignature Facials - Tailored Specialised Treatments\n60 minutes £45\nFrankincense Grounding & Nourishing Facial\nRadiance Glow Facial with Wild Rose & Rosehip\nLuxe Facial\n90 minutes - £70\nFull aromatherapy facial with neck and shoulder massage with lymphatic dranage techniques to reduce puffiness and improve complexion with nurturing extras, including Indian Head Massage & Coconut Scalp Treatment. Also includes Facial Reflexology sequence and foot smoothing and softening treatment.\nIntense Lift Age Defence Facial\n90 minutes- £70\nImmediate and noticeable lifting and firming treatment suitable for all skin types. This facial massage boosts the immune system and stimulates lymph flow, removing toxins while deep feelings of relaxation revitalise and reduce symptoms of stress.\nThis advanced facial massage treats both the surface and deep facial tissues and decollete with highly refined, soothing, gentle hand and finger manipulation. Incorporating Neal's Yard Remedies, Frankincense Lift range of products, clients benefit from NYR's advanced green technology and the high levels of Frankincense deliver an emotional lift alongside potent facial rejuvenation.\nSulpt and Lift Facial Massage\n90 minutes £65 / 60 Minutes £50\nOne hour facial with nurturing extras, including Indian Head Massage & Coconut Scalp Treatment and Facial reflexology sequences and foot smoothing treatment.",
  "https_www_brookesbeauty_com/https_www_brookesbeauty_com_gift-vouchers/content_11.html": "Brookes Therapies @ ReCoop Health, Aston Road, Abbey Green, Nuneaton WARWICKSHIRE CV11 5DT UK\nBrookes Therapies & Wellbeing\nTherapies and Education for Body and Mind\nGive the gift of massage and wellbeing to those you love.\nGift Vouchers\n- SIX PACK Treatment Subscriptions - GET A FREE TREATMENT! (Pay for 5 treatments get 6th free )\n- Couples Hot Stones Massage vouchers\n- Full Body Aromatherapy Massage Voucher\n- Couple's Massage Tailored Lesson\n- Pregnancy Massage voucher\n- 60 Minute Treatment voucher\nWe all know someone who always puts others first, show them how much you appreciate them by gifting them relaxation and stress busting treatments.\nSIX PACK TREATMENT SUBSCRIPTION - ONE HOUR\nBuy 5 and get a 6th treatment absolutely FREE! Clients are free to choose any treatment, massage, facial, reflexology, Reiki etc at each visit. There is no expiry date for the treatment subscription so you're at liberty to book at your convenience. Many clients choose to book a series of monthly sessions before repurchasing another subscription. One hour treatments are usually £45.\nPrice: £225.00\nSIX PACK TREATMENT SUBSCRIPTION - 90 MINUTES\nBuy 5 and get a 6th treatment absolutely FREE! Clients are free to choose any treatment, massage, facial, reflexology, Reiki etc at each visit. There is an 18 month expiry date for the treatment subscription so you're at liberty to book at your convenience. Many clients choose to book a monthly session before repurchasing. 90 minute treatments are usually £65.\nPrice: £325.\nDOUBLE HOT STONE MASSAGE / COUPLES HOT STONE MASSAGE\n2 hour tandem hot stone massage treatment for 2 people with a single therapist. Deeply relax during this fabulous stress busting heat treatment. Comprises a full body hot stone massage for both, relieving muscular stress and creating a deep sense of wellbeing and comfort. Resting heat periods are interspersed with heated massage periods to really allow the gentle heat to permeate the muscles. A great gift for that stressed couple you love or a fab treat for friends, siblings, parents and adult offspring..\nPrice: £140\nFULL BODY AROMATHERAPY MASSAGE\n90 minutes of fragrant bliss! This treatment gets into those tight spots to relax and destress. gentle but firm pressure and delightful essential oil blends work all over, back, legs, arms, feet, head, neck and face. Essential oil blends are tailored to your personal needs during your session. Your personal blend is also available to purchase to take home if you wish.\nPrice £65.00\nTAILORED MASSAGE LESSON\nThree hour tailored lesson for pairs or couples tailored to their peronal needs. Ever come home at the end of the day with a tense neck or sore back and wished your other half could soothe the aches and pains? Learn together how to adress each others niggles from a qualified therapy instructor so you can massage safely and effectively at home. Included is a gift box with massage oils to use at home. Makes a fantastic gift.\nPrice £180.00\nFULL BODY AROMATHERAPY MASSAGE\nFull body massage tailored to the expectant Mum's peronal needs. This isn't just the ultimate pampering exerience for pregnant ladies, it'a bespoke treatment tackling aches and pains of pregnancy too in a safe and effective treatment. Makes a wonderful gift and can also be purchased as a Six Pack offer.\nPRICE £75\nONE HOUR TREATMENT VOUCHER\nGive the gift of choice! This voucher allows the receiver to book froma range of treatments of their choice, so they have the freedom to tailor their experience and you don't need to worry of you bpught them the right gift! Choose from massage, aromatherapy massage, Reflexology, Signature or Express Facial, Indian Head Massage or Reiki.\nPRICE £45"
}