{
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_news_green-party-councillors-fighting-against-sewage/content_5.html": "To show support for the ‘Surfers Against Sewage’ campaign, Reuben, Charles and Netty, newly elected Havant Green Party Councillors, organised a local ‘Paddle Out’ off Hayling Island. They want to, once again, highlight the issues around concerns for cleaner waters of our coast and estuary. They wish to promote the success in achieving ‘Blue Flag’ status at Hayling Island beachlands area. However, it would be fantastic if water quality standards could be raised throughout the Borough’s coastline and estuary.\nJoined by locals, they aimed to highlight the ongoing issue of sewage discharges from Budds farm and the risks it can bring to sea users. Clean Harbours Partnership (CHP) tested water samples from Langstone and Chichester harbours, in November.\n‘One site showed 760 times the maximum level of E. coli that would be allowed if it was a bathing area’, CHP said.\nCLLR Reuben Mychaleckyj quotes “After door knocking hundreds of residents around the area, sewage and clean waters was the number one issue raised. We want to show our support for a quicker resolution to the problem and let residents know that we’ll do everything within our powers to make our waters safe and healthy once again”.\nCLLR Charles Robert quotes. “We have such a beautiful coastline right on our doorstep, and it’s a concern that a number of residents feel apprehensive about entering the water along some parts of the coast and estuary. Parents should not have to deliberate as to whether to keep their children from entering the sea and we are hopeful to find a way forward, with energy and ambition, brought by the newly formed Coalition leading Havant Borough Council.”\nSouthern Water said it was ‘investing £22m to increase capacity at Budds Farm, reducing the risk of discharges into Langstone Harbour’.",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_donate/content_3.html": "Skip to content\nSkip to footer\nHavant\nMenu\nOur Local Issues\nEvents\nNews\nPeople\nAbout Us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nDonate\nDonate\nTo top",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_news_author_reuben-mychaleckyj/content_11.html": "23 May 2024 / 23 May 2024 by Reuben Mychaleckyj\nTo show support for the ‘Surfers Against Sewage’ campaign, Reuben, Charles and Netty, newly elected Havant Green Party Councillors, organised a local ‘Paddle Out’ off Hayling Island. They want to, once again, highlight the issues around concerns for cleaner waters of our coast and estuary. They wish to promote the success in achieving ‘Blue Flag’ […]\nRead more »",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_people/content_2.html": "Our Councillors\nCllr Grainne Rason\nEmsworth Councillor (2023-)\nHavant Green Party Membership Officer\nI am Grainne Rason and I am the Green party councillor for Emsworth. It takes time and training to become more effective as a councillor so I wish to continue in the role to capitalise on what I have learnt about how to negotiate and work with other councillors and officers to get the best for the Environment and deal with the threats to species extinction. I have been working hard for local residents on matters such as the threat of development to greenfield sites, and Southern water’s plans for using Havant Thicket reservoir. I sit on the council Planning and Audit and Finance committee meeting and the Climate Panel. I am a member of Emsworth Community Centre and am working closely with Emsworth Residents Forum on strategy planning for better community facilities for North Emsworth including active travel and youth activities.\nCllr Reuben Mychaleckyj\nEmsworth Councillor (2024-)\nSocial Media Manager\nI’m really proud to have been selected as the Green Party candidate for our beautiful Emsworth Ward in the May 2024 elections. You may recognise me litter-picking with my kids on the school run down the Emsworth road in the mornings. Here are some reasons why I think you should give me a chance in the next local elections.\nI’m a small business owner and third generation Ukrainian, born in Lancaster and moved down to this incredible part of the country seven years ago. I’ve seen first hand the outpouring of love and ongoing support for the people of Ukraine in this area and it gives me belief that great things can happen when people come together in tight knit communities.\nI’m a keen surfer and love swimming in the sea, so it’s of great concern to me and many other residents about the cleanliness of our waters. I’ve been closely following the Havant Thicket reservoir plans to add recycled sewage water to our drinking water, and have been voicing concerns at local meetings as much as possible. Also I would want to campaign to get these companies to face more regulations, so they can’t just keep flooding our seas with untreated sewage water every time there’s a storm. We need to take back control of our waters.\nSo far in the last year I’ve been out supporting our incredible NHS workers and teachers on their strike days. These vital institutions affect every single person in this country and they are being run into the ground by this Government.\nCllr Charles Robert\nEmsworth Councillor (2024-)\nI am proud to be selected as a candidate for the Green Party in Emsworth. I moved to Emsworth 10 years ago for its open spaces, sea, meadow and woodlands; everything is within walking distance. I was a science teacher for 18 years, then developed ICT in a number of London schools. Now I am a mountain leader and volunteer with our local scout troop. I love walking whist sharing my passion and expertise for our native plants. I am keen to improve safety for pedestrians and cyclists on the A259, and challenge the dumping of sewage in our harbour.\nCllr Netty Shepherd\nHayling East Councillor (2024-)\nHavant Green Party Co-Coordinator\nI’m really proud to have been selected as a candidate for Hayling East in the May ‘24 Elections.\nI’m passionate about Hayling Island having lived there for the past 30+ years. I have 2 school age children and am deputy chair of their school PTA. Over the past 2 years I’ve been involved in a lot of fundraising activities to help enrich the school curriculum.\nMy career has been mostly in IT and I’ve spent the past 20 years in Telecoms in various sales and marketing roles. The big thing my career has taught me is that relationship building is the key to success in every sphere.\nAfter a period of redundancy, I founded Wildflower Island a project for improving the bio-diversity of Hayling Island and protecting our green spaces. In 2019 our team planted 3500 native spring flowering bulbs outside Mill Rythe school and secured funding for Mengham Infant School’s Community Garden. I am now working with HBC on a community garden project at Avenue Road, North Hayling and am really excited about the possibility of including a wildlife area and community raised beds.\nI am very concerned about the housebuilding developments that are taking place on greenfield sites across the Borough. We need affordable housing, but it needs to be built in the right locations – not on areas prone to flooding or whose infrastructure can’t cope.\nI think we should restart water quality testing as a matter of urgency, we need to know when raw sewage is going into our harbours and rivers – it’s a matter of public health.\nGreen councillors work hard and I plan to work hard for the residents of Hayling East.\nOur Members\nNatasha Parker\nHavant Green Party Co-Coordinator\nI grew up on Hayling and have now chosen to raise my two daughters here. I’m a primary school teacher and in my spare time, I love to be out exploring our beautiful natural environment. Recently, I’ve been a volunteer in local tree planting projects and I’ve also signed up to work on the new Avenue Road community garden. As a concerned beach user, I became a regular beach cleaner and started the Plastic Free Hayling Island campaign in 2018.\nI came into politics because I feel that the Island we all love is under threat; with each passing year, Hayling appears even more forgotten and neglected. It’s clear to see there’s a lack of investment in sea defences and flood prevention, and our infrastructure is beyond capacity.\nWe know that voting for Green councillors can help change all of that. We want to listen to and work with residents, to bring fresh ideas and ambitious solutions to solve Hayling’s issues. Let’s protect Hayling, our beautiful Island, together.",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_news_category_news/content_7.html": "23 May 2024 / 23 May 2024 by Reuben Mychaleckyj\nTo show support for the ‘Surfers Against Sewage’ campaign, Reuben, Charles and Netty, newly elected Havant Green Party Councillors, organised a local ‘Paddle Out’ off Hayling Island. They want to, once again, highlight the issues around concerns for cleaner waters of our coast and estuary. They wish to promote the success in achieving ‘Blue Flag’ […]\nRead more »",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_events/content_6.html": "Skip to content\nSkip to footer\nHavant\nMenu\nOur Local Issues\nEvents\nNews\nPeople\nAbout Us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nEvents\nEvents\nMay 19, 2025: Havant Green Party Italian Evening\nTo top",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_contact/content_4.html": "Skip to content\nSkip to footer\nHavant\nMenu\nOur Local Issues\nEvents\nNews\nPeople\nAbout Us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nContact\nHome\nContact\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_news_tag_langstone-harbour/content_13.html": "Green Party Councillors Fighting Against Sewage 23 May 2024 / 23 May 2024 by Reuben Mychaleckyj To show support for the ‘Surfers Against Sewage’ campaign, Reuben, Charles and Netty, newly elected Havant Green Party Councillors, organised a local ‘Paddle Out’ off Hayling Island. They want to, once again, highlight the issues around concerns for cleaner waters of our coast and estuary. They wish to promote the success in achieving ‘Blue Flag’ […] Read more » Langstone Harbour Sewage",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_about-us/content_8.html": "The Green Party is growing fast. We now represent people in Westminster and in a record number of local councils, as well as in the London Assembly.\nHere in Havant, we now have four Green Councillors, up from just one last year. We’re working hard to get more Councillors elected to add that much needed voice to the Council chamber, to address the critical issues that the older parties are not even discussing.\nWe’re working progressively on local issues; to improve the lives of all people in Havant, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on power of people, especially those in our local community, rather than corporate finance in all that we do. Get involved with us today to help us achieve even more for Havant.",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_our-issues/content_9.html": "We care deeply about our local communities and their environment. We have a whole roster of issues we plan to tackle. Listed below are the campaign issues for which our councillors were elected in 2024, and explainations for why we care and what we will do to change them.\nAccompanying the text-based summaries of these issues are videos of our own Emsworth councillor Grainne Rason, explaining to us what her plans are for Emsworth this year.\nIt’s time to go Green!\nSewage in our Harbours\nOur residents feel that it is unsafe to go on our seas because of the sewage; it’s affecting the local economy and it’s caused by the water companies. The solutions are to change the OFWAT rules, to invest in maintenance and regulation, to restore the environmental agency to full strength and to hold the water company bosses to account.\nGreen councillors will work with our local groups and Clean Harbours Partnership, The Final\nStraw Foundation, 3 Harbours Rowing and Riverfly to work together to have a stronger voice.\nTraffic\nWe have already carried out a traffic survey of the four busy roads in Emsworth. That was over 500 homes. We did this because we know Hampshire Highways won’t listen without evidence. 78% of our respondents said traffic was too fast.\nEmsworth is now getting an SID (a speed-indicated device). This will be mobile and moved around our busy roads, but we need longer-term solutions for all of our wards. That means: safer crossings, 20mph zones around the schools and where the residents know it has needed, and ensuring the crossings are properly maintained for safety.\nOur public transport is being cut, and we will also be campaigning to have better bus services in places where they are sorely needed.\nOver-Development\nHavant’s green spaces are being targeted for development because residential developers recognise this is a highly desirable area and that they can sell houses for huge sums. This is unacceptable, and our candidates will campaign to preserve our open green spaces and agricultural land.\nWe will also work to have retrofitting across the borough because we have some of the most poorly insulated homes in Europe; we have poor energy security, and yet 46% of carbon emissions in Havant are from housing.\nOur homes need to have 21st century energy saving.\nRecycling\nWe will continue to campaign for curbside glass recycling and push for more bins which are more accessible and in more convenient locations. We will especially campaign for communal glass bins where we have assisted living flats.\nHavant Borough Council have made some progress on recycling and passed a motion to investigate bins for hard plastics, disposable vapes and food waste. But we need action sooner, especially\non disposable vapes. Vapes are extremely hazardous and contain valuable metals, especially lithium.\nThey cause fires when they’re not disposed of correctly. We will be working to have more locations for recycling and better publicity so people know where to recycle and why vapes should be recycled.\nWe will be working with officers and residents to get food waste recycling established as early as possible.\nHavant Thicket Reservoir and Southern Waters Recycling Scheme\nSouthern Water and Portsmouth Water plan to use the new reservoir at Havant Thicket to store water from “effluent recycling”. That’s from sewage.\nAnd this is to supply water to the Southampton area and later to Havant when there is a drought.\nWe are told we are in a water stressed area. Abstraction from the chalk rivers and streams has to stop. However, the scheme Southern Water propose is untested in this country, involves huge amounts of infrastructure and energy, when we are already energy insecure. So, where is this energy going to come from?\nSouthern Water have so far failed to explain why other, easier and quicker to build schemes\nhave been shelved. The owners of Southern Water are the same investment bank that once\nowned Thames Water. And the Green Party have been challenging this scheme from the time\nthe thicket plans were first passed by Havant Borough Council.\nHavant Borough Council did not see the small print which said the reservoir could be used for\nrecycled water. We are working with the Environmental Agency and Natural England to ensure they are fully aware of Southern Water’s lack of transparency and of the alternatives which they could and should be considering to protect our chalk streams and rivers sooner and less expensively.\nProtecting the Ems River\nThe Green Party are working behind the scenes to help protect the Ems. The change in our weather patterns is causing the Ems to dry out when we have droughts. Portsmouth Water are now acting to protect our chalk streams by looking at ways to reduce abstraction over the next five years.\nRayner Piper, our candidate for Hermitage, has set up a project called Riverfly. He has got funding for equipment and has organized volunteers to sample all five main chalk streams, including the Ems, every month to show how healthy they are.\nAnd he has surprised the Environmental Agency with the quality of his results. And it’s by collecting these results, he is helping to show how water abstraction is affecting the health of the Ems.",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_news_tag_sewage/content_10.html": "Green Party Councillors Fighting Against Sewage 23 May 2024 / 23 May 2024 by Reuben Mychaleckyj To show support for the ‘Surfers Against Sewage’ campaign, Reuben, Charles and Netty, newly elected Havant Green Party Councillors, organised a local ‘Paddle Out’ off Hayling Island. They want to, once again, highlight the issues around concerns for cleaner waters of our coast and estuary. They wish to promote the success in achieving ‘Blue Flag’ […] Read more » Langstone Harbour Sewage",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk/content_1.html": "Welcome to Havant Green Party\nHavant Green Party aims to create a just, equitable and sustainable society. We value our community and are dedicated to helping people and the planet work in harmony.\nWe are proud to have four Green Councillors sitting on Havant Borough Council (HBC), as of May 2024!",
  "https_havant_greenparty_org_uk_/https_havant_greenparty_org_uk_news/content_12.html": "Green Party Councillors Fighting Against Sewage 23 May 2024 / 23 May 2024 by Reuben Mychaleckyj To show support for the ‘Surfers Against Sewage’ campaign, Reuben, Charles and Netty, newly elected Havant Green Party Councillors, organised a local ‘Paddle Out’ off Hayling Island. They want to, once again, highlight the issues around concerns for cleaner waters of our coast and estuary. They wish to promote the success in achieving ‘Blue Flag’ […] Read more » Langstone Harbour Sewage"
}