{
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_wimborne-minster/content_17.html": "Wimborne Minster\nShane Bartlett\nShane was born in Wimborne and lives with his wife, Tracey and two daughters who attended local schools like himself. Shane now works in the medical industry. When he is not doing ‘Dad’s taxi service’, Shane likes walking across the Dorset countryside and reading about History.\nHe has served on the Town Council since 2011and in 2015 Pat Hymers chose Shane to be her successor and was elected alongside Cllr David Morgan before becoming Mayor of Wimborne in the 2015/16 civic year. In 2017 Shane was proud to be elected the Dorset County Councillor for Wimborne and Colehill West.\nHe saved Leigh Park playing field which was under threat of development by giving it ‘Fields in Trust’ status, led the project and secured £15,000 of additional funding for the skate park facility in Redcotts Recreation Ground. He also took the lead in the refurbishment and installation of the new pay area in Redcotts. He has achieved getting additional funding projects for Riverside Wimborne and negotiated a new building for the Planet Youth Advisory Centre after the Conservative cuts in children's services. He has used his ward budget to support organisations and volunteer groups within the community. Shane cares about the people and places that make up Wimborne and he is not afraid to roll up his sleeves and get stuck in.\nTel: 07593 197302 Email: cllrshane.bartlett@dorsetcouncil.gov.uk\nDavid Morgan\nDavid has lived in and around Wimborne for the last 55 years and has been on East Dorset District Council for 16 years with a near attendance of 100%. In that time he has been instrumental in many successful projects, such as saving Old Road car park from development, stopping the closure of the Tourist Information Centre, helping residents with planning problems/homelessness and various other day to day issues.\nHe has been involved in many organisations in the town including being Trustee Chairman of the Priest’s House Museum and Tourist Information Centre which has now completed its £1.6 million Revival Project, Trustee of the Allendale Centre, Trustee of the Citizens Advice, Board member of Walford Mill Craft, The Youth Cafe, Dreamboats, Reef Youth Centre (Colehill) and Vision Wimborne.\nDavid is a longstanding member of Wimborne Methodist Church, married to Heather and has a son Robin who is a police officer. He has taught at schools locally in Dorset for 44 years so is particularly passionate about education.\nTel: 01202 821115 Email: cllrdavid.morgan@dorsetcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_colehill-and-wimborne-east/content_19.html": "Colehill and Wimborne East\nJindy Atwal\nJindy has lived in the Wimborne area for the past 20 years along with her two children. Jindy is a secondary teacher who is passionate about education and child care provision, with almost 20 years’ experience in the profession.\nBeing a teacher, Jindy has gained valuable first-hand knowledge of the needs of our children and the challenges faced by our teachers. Her passion for making a difference to the lives of children and young people and her experience in the classroom means Jindy is bringing a new approach to the Council.\nJindy is incredibly motivated about giving back to the community. She loves rolling up her sleeves and getting involved in helping to make the local area a better place - from litter picks to tree planting, she is enjoys getting involved in improving Colehill!\nEach year Jindy participates in a 100km+ hike in the local area to raise money for the Eve Appeal, a cancer research charity, and is in support of the Lib Dem two-month cancer treatment guarantee which will ensure cancer patients will receive treatment shortly after their diagnosis.\nIn her spare time, you can find Jindy out and about in our lovely countryside taking long hikes, cycles and runs. She loves listening to live music and ventures to as many concerts as she can.\nEmail: cllrjindy.atwal@dorsetcouncil.gov.uk\nAndy Todd\nAndy loves living in Colehill with his wife, Sharon, and their two daughters who both attend local schools. For many years Andy has worked in the exhibition industry, organising large industrial trade shows around the world, most recently as a board director at a global trade show company.\nAndy has a strong track record of working for the community. Coopted onto Colehill Parish Council two years ago, he sits on the Finance & General Purposes Committee and consistently works to ensure council taxpayers get value for their money.\nAndy was a Parent Governor for Hayeswood First School whilst his children were there, becoming Chair of the Academy Committee for his final year. He has a hands-on approach when it comes to helping improve our local area and is determined to improve facilities for local people of all ages.\nHaving played rugby as an amateur in Ireland, Northern Spain and West London before retiring, Andrew remains actively involved in sport, further supporting his community by taking on the role of membership secretary of his local sports club and sitting on the county organising committee, representing Dorset's interests at the National Association.\nEmail: cllrandy.todd@dorsetcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_bearwood-and-merley/content_21.html": "Bearwood and Merley\nCouncillor Richard Burton\nRichard has lived locally since his first teaching job back in 1986 and for the past 22 years has lived in Merley with his wife, daughter and dog Lexi. He has taught at many local schools and rose to Head of Science and Head of Year.\nHe was first elected to the new Bournemouth, Christchurch and Poole Unitary Council in 2019. Richard is passionate about environmental issues and plays a leading role in Merley Win on Waste.\nSince retiring, Richard has been an active member of the local community as a coordinator for the Merley Neighbourhood Watch and an Ambassador for the local charity Ideas2Action. When not out and about walking his dog, Richard enjoys cycling, tending to his allotment, brewing craft beer and listening to an eclectic mixture of music.\nTel: 07999 381458 Email: Richard.Burton@bcpcouncil.gov.uk\nCouncillor David Brown\nDavid has lived in Bearwood and Merley for over 25 years and was first elected to represent the Merley & Bearwood ward in 2007 and was then re-elected in 2011 and 2015.\nDavid is a graduate of Bournemouth University and following a successful career in the local Financial Services industry, he now dedicates his time to working for the local community through his involvement in many charity and community projects. He works voluntarily as a Trustee and Chairman of Kinson Community Centre, a Trustee and Vice Chairman of Bearwood Community Centre, and a committee member of Bearwood Social Club.\nAs an approved foster carer for Poole Council for many years David has fostered over 50 children and teenagers. He is also a member of the Dorset Police and Crime Panel overseeing the work of Dorset Police.\nTel: 07729 524570 Email: David.Brown@bcpcouncil.gov.uk\nCouncillor Marcus Andrews\nMarried to Sally, Marcus has lived in Merley for 18 years and his step-daughter and twin daughters have attended local schools.\nMarcus is a Chartered Surveyor dealing with commercial property and helping Merley shop tenants since the early 1980’s. Having worked for a local firm of estate agents since leaving school, he is now one of their Directors. Marcus lived in Bournemouth for several years and twice stood for the Lib Dems there. He served previously as Christchurch's first ever Lib Dem councillor in the 90s and was first elected to the new Bournemouth, Christchurch and Poole Unitary Council in 2019.\nOut of work Marcus enjoys, among other things, supporting AFC Bournemouth.\nTel: 07776 237874 Email: Marcus.Andrews@bcpcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/content_1.html": "Colehill & Wimborne Minster East\nJindy Atwal\nJindy has lived in the Wimborne area for the past 20 years along with her two children. Jindy is a secondary teacher who is passionate about education and child care provision, with almost 20 years’ experience in the profession.\nExperience\nBeing a teacher, Jindy has gained valuable first-hand knowledge of the needs of our children and the challenges faced by our teachers. Her passion for making a difference to the lives of children and young people and her experience in the classroom means Jindy will bring a new approach to the Council.\nJindy is incredibly motivated about giving back to the community. She loves rolling up her sleeves and getting involved in helping to make the local area a better place - from litter picks to tree planting, she is keen to get involved in improving Colehill!\nEach year Jindy participates in a 100km+ hike in the local area to raise money for the Eve Appeal, a cancer research charity, and is in support of the Lib Dem two-month cancer treatment guarantee which will ensure cancer patients will receive treatment shortly after their diagnosis.\nHobbies & Interests\nIn her spare time, you can find Jindy out and about in our lovely countryside taking long hikes, cycles and runs. She loves listening to live music and ventures to as many concerts as she can.\nTel: 01202 658629\nEmail: r.atwal@yahoo.com\nAndrew Todd\nAndrew loves living in Colehill with his wife, Sharon, and their two daughters who both attend local schools. For many years Andrew has worked in the exhibition industry, organising large industrial trade shows around the world, most recently as a board director at a global trade show company. Andrew has the business and organisational skills to get things done and to be a great local councillor.\nExperience\nAndrew has a strong track record of working for the community. Coopted onto Colehill Parish Council two years ago, he sits on the Finance & General Purposes Committee and consistently works to ensure council taxpayers get value for their money.\nAndrew was a Parent Governor for Hayeswood First School whilst his children were there, becoming Chair of the Academy Committee for his final year. Andrew has a hands-on approach when it comes to helping improve our local area and is determined to improve facilities for local people of all ages.\nSupporting local people is second nature for Andrew who would like to see more consistency in local planning and is committed to fighting for the preservation of the nature of our village and surrounding area.\nHobbies & Interests\nHaving played rugby as an amateur in Ireland, Northern Spain and West London before retiring, Andrew remains actively involved in sport, further supporting his community by taking on the role of membership secretary of his local sports club and sitting on the county organising committee, representing Dorset's interests at the National Association.\nTel: 020 8819 2144\nEmail: AndyTodd.Colehill@gmail.com",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_the-three-towns-alliance-priorities/content_38.html": "The Three Towns Alliance priorities\n13 Jun 2023\nPutting People First\n- Introducing a Residents’ Card which provides benefits to people who live in BCP. Within it, we will consider the reintroduction of the Access to Leisure scheme and learning benefits, extending the staff benefits scheme for residents and offering meaningful rewards for volunteering.\n- A full governance review for Community, Parish and Town councils. We will also be pushing for a governance review to decide how the council can be effectively led; be this a cabinet, community or hybrid model. We commit to holding regular ‘community conversations’ and listen to residents.\n- Improve public involvement in council meetings. In addition to this we want to encourage neighbourhood meetings with consideration of devolved budgets and review how CIL (Community Infrastructure Levy) is apportioned and spent.\n- Ensure we have an open and transparent council by restoring the Overview and Scrutiny board to ensure we are fully accountable for all our decisions and ensure decisions made by the cabinet are done in public.\n- Get a grip on utilities, builders and other contractors to ensure better planning, management, regulation, scheduling and communication on works to avoid as best we can the chaos of recent months, and ensure enforcement on overrun. Ensure developers fund full repairs where public services are damaged such as kerb deliveries damaging pavements.\n- Procurement reform to promote local & sustainable businesses.\n- Ensure the planning system has an ‘infrastructure first’ approach. This will include use of local plans and supplementary planning documents.\n- Transform the customer experience at BCP by ensuring phones are answered and that the website is easy to navigate and ensuring mobile reporting works well with smartphones, smartchat and integrated third party reporting. Creating ‘Help Hubs’ in our communities.\n- Review policy to maximise the potential from second homes and empty homes. We will consider implications of AIRBNBs and other informal letting. This will be done by promoting permanent residences and opportunities for young working people.\n- Improve access to sport, leisure and culture for local residents by progressing sports strategies to support a variety of sports and leisure for wellbeing at all ages (including hosting competitions).\n- Reintroduce the Transport Advisory Group (TAG) and speed up decisions for minor road issues (such as yellow lines and disabled spaces). We will also publish a matrix and annually review the list of schemes.\n- Strengthen support for voluntary groups in their communities.\n- Continue to work in partnership with the aim of expanding the Cultural Experience.\nDefending Local Services\n- Have a more effective involvement in health & wellbeing and integrated care by introducing health partnerships that have wellbeing and Public Health benefits and lobbying Government for Health and Social Care reforms.\n- Invest in Youth Services.\n- Lobby around ‘right to buy’ to retain rented stock.\n- Escalate council house building for social rent and affordable rent, we will reduce and eventually remove the need for families to use B&B and also shared facilities.\n- Review SEN provision in mainstream schools with the aim of creating additional local places and work with schools and families to reduce exclusion.\n- Upgrade libraries to become community hubs. This is to protect their place within communities & to train staff to support residents with services such as blue badge applications, reporting and completing consultations.\n- Review public toilet provision, including refurbishment and we will restore and include new facilities. We will also include unisex and changing places.\n- Create a strong bus partnership to expand the use and reduce car reliance. We want to consider new social routes as well as young persons subsidised travel (to improve the school run) and also look into a resident card partner.\n- Improve the local transport offering with progression of Dorset Metro Rail, improve working with Beryl, integrate use of public transport, provide mobility hubs (including parcel collection services), encourage car sharing and improve EV (electric vehicles).\n- Promote the identities and heritage of our three towns and our neighbourhoods. This will be done by considering the wider role for town councils and developing and protecting facilities for neighbourhood and district centres\n- Boost the shared lives programme and support family carers and review the delivery and offer of Public Health in local neighbourhoods.\n- Develop mental health and wellbeing programmes through the public health budget to tackle issues such as loneliness.\nClean and Safe Neighbourhoods\n- Prioritise basic services including dealing with potholes, litter and fly-tipping, and promote the use of planters and volunteers to encourage people to take pride in their area.\n- Ensure safer streets by introducing PACTs (Police & Community Teams) as well as support local neighbourhood watch, community speedwatch and enforcement teams.\n- Ensure a strong partnership with the Police including the Police and Crime Commissioner and the Chief Constable.\n- Create a clear Play Strategy to include all ages and accessibility to ensure our parks are modern, accessible and desirable to visit.\n- Support groups such as ‘Friends of’ for parks and open spaces and do an outcome based review of Parks Foundation\n- Get the Climate Plan back on track and make progress clear & accountable by creating a ‘Net Zero Group’. Set interim targets (both council and community-wide) to demonstrate the path we are on and allow communities to engage with the process through ‘Green Ambassadors’.\n- Expand the School Streets programme.\n- Enforce action on dangerous parking and extend moving vehicle offences action.\n- Progress 20 is plenty in residential areas.\n- Improve air quality by reducing idling – especially near schools.\n- Promote and lobby over water quality of rivers and harbours.\n- Prepare for the future on drainage capacity.\n- Review remainder of TCF (Transforming Cities Fund) programme.\nThriving Economies and Communities\n- Invest in district shopping and local centres.\n- Improve support for business groups including Traders Associations & BIDs.\n- Set up an inward investment team to focus on retail and hospitality to encourage cross-fertilisation, establish a council-led retail taskforce, promote a ‘Landlords Forum’\n- Improve town centre safety and cleanliness. This will help us to reduce the fear of crime and increase dwell time for shoppers. Some initial steps we will take include resurfacing pedestrianised high streets (to include Highcliffe high street pavement), increase the amount of commercial bins and appoint neighbourhood specific lead-officers.\n- Develop ‘meanwhile’ (whilst a place is without purpose prior to development like empty shops and unused land. This is by focussing on encouraging pop-up shops where appropriate to fill empty shop units and looking at the variety of ways the empty spaces could be used including for temporary homes.\n- Reform Future Places so that it is focussing on fewer schemes.\n- Learn from those that are getting it right. This will be achieved in part by partnership working as well as cross-regional working.\n- Revisiting and delivering the revised Local Plan we will be able to protect the character of our areas.\n- Take an ‘infrastructure first’ approach, including prioritising the protection of community spaces.\n- Focus on transport links, local energy, climate and the green belt.\n- Prioritise the climate response by considering - insulation, renewable energy and flooding.\n- Develop closer links to universities especially around the development of town centres.\n- Improved planning enforcement and developer compliance\n- Split the Planning Committee into two, with a strategic option.\n- Reduce the £1.3Bn debt threshold to what we actually need.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_vikki-speaks-on-the-funding-crisis-for-special-educational-needs/content_46.html": "Vikki speaks on the funding crisis for Special Educational Needs\n13 Sep 2024\nClick below to watch Vikki discussng SEND funding in Parliament.\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_wareham/content_27.html": "Wareham\nBeryl Ezzard\nBorn in Purbeck, Beryl downsized to Wareham after her retirement. She is very passionate about our local area and has been representing residents in the ward since 2004.\nBeryl understands the concerns of residents, she has been an central member of the Purbeck Transport Action Group and the Purbeck Community Rail Partnership for many years, promoting public transport and “ active travel”: cycling & walking in Purbeck. Beryl is also an advocate for the Swanage Railway to have a permanent link to Wareham branch-line; relieving road congestion on the A351. Lobbying the Rail Minister, MP’s, and DC to support and fund this long awaited project.\n.\nTel: 01929 550138 Email: cllrberyl.ezzard@dorsetcouncil.gov.uk\nRyan Holloway\nRyan was raised in Sandford, where he attended the local school, and has lived in the Purbeck area all of his life. He completed an apprenticeship with a local Wareham engineering company, which set him off on a career within the engineering sector, now running his own small local business.\nHe is an advocate for supporting local businesses. He has long supported the need for more apprenticeships in the area, to give young people more opportunities close to home. Ryan has been a Town Councillor in the Purbeck area for 3 years prior to representing Wareham and its surrounding area on Dorset council for the past five years. He has the experience to get things done. Outside of being a Councillor, Ryan also volunteered for the local HM Coastguard.\nTel: 07783362330 Email: cllrryan.holloway@dorsetcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk/content_20.html": "Almost 7,000 over 80s at risk of losing Winter Fuel Payments in MDNP\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nThe Mid Dorset and North Poole Liberal Democrats are an organisation that work tirelessly for their local community. Branching across Poole, Purbeck and East Dorset, your Lib Dem Councillors were elected because of their commitment to their local communities.\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nLeader of the Liberal Democrats Ed Davey has today (Wednesday 18th September) appointed Vikki Slade to be the party’s Housing Communities and Local Government Spokesperson.\nVikki spoke in Parliament this week to highlight the issue of the funding crisis in Special Educational Needs and the impact it has on Councils such as BCP.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_priorities-1-1-1-1-1-2/content_15.html": "Broadstone E-News 16th January 2024\nDevolution Option Agreed\nBoth the current and the previous governments have been keen to roll out further devolution options to the various regions.\nQuoting from the Government White Paper: England is one of the most centralised countries in the developed world. Devolution across England is fundamental to achieving the change the public expect and deserve: growth, more joined-up delivery of public services, and politics being done with communities, not to them.\nMayoral devolution works because Mayors can use their mandate for change to take the difficult decisions needed to drive growth; their standing and soft power to convene local partners to tackle shared problems; and their platform to tackle the obstacles to growth that need a regional approach.\nVarious deals have been discussed locally for a number of years now without reaching a beneficial conclusion. Many of councillors on BCP council would have favoured a BCP only deal however, on 16th December, the Government issued a revised White Paper that set a target population for each Mayoral area of 1.5m. That ruled out a BCP only deal, a fact that was confirmed in subsequent conversations with the Government.\nThe paper stated that it would not allow any ‘devolution islands’ so with all our neighbours submitting proposals, we would have been forced by the Government to join one of them. Therefore it was better for us to make that decision ourselves.\nThis new white paper also added a date of Friday 10th January for submitting a proposal. So all of a sudden, we had just over 3 weeks, across the Christmas period, to agree a proposal. BCP Council Leader, Millie Earl, met with Baroness Taylor last week where she agreed an extension to that date to allow the full Council to meet on Wednesday 15th to discuss it and come to a democratic decision.\nThere were 2 options to consider; Hampshire and Solent, including Southampton, Portsmouth and the Isle of Wight, or Heart of Wessex, a much larger geographical area including Dorset, Somerset and Wiltshire, with the possible later inclusion of Swindon.\nA long debate was had on the merits of both options with the Heart of Wessex coming out on top.\nWe have yet to get a full understanding of what this may mean for all of our residents, given the little information provided by Government so far, but it allows us to progress to the next stage of negotiations.\nMany of you may well be sceptical of this process and may point to BCP as an example of something that has yet to deliver the promised benefits. But this is different, and given we are being forced into making a decision before the devolution policy has been fully scrutinised and debated in Parliament and although we don't agree with how it's been done, it is essential that we act to get the best for residents. London and Manchester are good examples of where that has happened.\nTo save making this article any longer, here are some links to further information, we will, of course, keep you advised of developments.\nSign up for our Newsletter for more updates\nThe best way to keep up to date with key Broadstone topics such as Devolution, a Town Council, Planning Applications, Road Closures and events is to sign up for our e-newsletter.\nPlease email Peter.sidaway@gmail.com to sign up.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_petitions_disposable-bbq-ban/content_2.html": "Petition: Stop Disposable Barbecues\nMP Calls for Urgent Action on Wildfires, Fire Service Funding, and Ban on Disposable BBQs\nMid Dorset and North Poole MP Vikki Slade, has called on the Government to take urgent action to tackle the growing threat of wildfires across Dorset and the UK, following two devastating fires at Upton Heath and Canford Heath in recent days.\nSpeaking in the House of Commons, the MP described how over 70 football pitches worth of protected heathland had been lost in a single night—threatening vulnerable wildlife during breeding season and putting nearby homes at risk.\n“Dorset is burning. Last week, a precious stretch of lowland habitat was ablaze in the middle of the ground-nesting bird season. Our biodiversity is at risk, our homes are at risk and our future is at risk. These are not isolated incidents; they are frighteningly normal.”\nThe MP praised the heroic efforts of Dorset & Wiltshire Fire and Rescue crews but warned that: “chronic underfunding is leaving fire services unable to meet rising demand. I have seen what the fire crews do - heroes running towards danger as we run away.” Vikki noted that Dorset Fire Services had been forced to remove appliances from Poole and Wareham with further threats to Wimborne and Bere Regis, “we’re asking firefighters to do more with less and that’s a recipe for disaster.”\nVikki added: “As climate change makes our landscapes hotter and drier, we are living in a perfect storm. Fires are more frequent, more intense, and harder to contain. Almost every one of these fires, from Upton Heath to Wareham Forest, was caused by human activity - a carelessly dropped cigarette, illegal campfires, disposable barbeques or worse, deliberate arson.\nTo many people, disposable barbeques are seen as a sign of warmer weather approaching and a way to spend more time outdoors. Yet disposable barbeques have been the spark behind countless wildfires - over 1,000 in London in just a year.\nLocal authorities can and do impose public space protection orders, and Dorset is consulting on one, but if petrol stations and supermarkets keep selling barbecues, people will keep buying them. Disposable barbecues not only cause fires; they get left behind on beaches, burn unsuspecting feet and create litter.\nVikki said: “We must consider a ban. We have learnt to live without plastic bags – we can live without single use barbeques too.\nI know that much work has already been done to get local supermarkets to ban disposable barbeques, Asda in Canford Heath have agreed, we need more supermarkets, petrol stations and large DIY stores to follow their lead.\nAs we head into the Easter break, I encourage people to enjoy Dorset. It is a jewel of the UK, but please leave your barbecue at home.\n“Let’s not make this a season of smoke and sirens. Let’s protect the people who protect us, and the places we love.”\nYou can sign the petition to ban disposable barbeques below:\nE-Petition: Banning Disposable BBQs\nPlease sign this petition to show your support for banning disposable BBQs - you can do this by leaving your details below.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_budget-a-desperate-deception-as-families-in-area-face-soaring-bills/content_45.html": "Budget a “desperate deception” as families in Mid Dorset and North Poole face soaring bills\nMid Dorset and North Poole’s Liberal Democrats have labelled the Chancellor’s budget announcement today a “desperate deception”, with income tax bills still set to rise for local people.\nMid Dorset and North Poole’s Liberal Democrats have said that local residents will see through this “deception” by the Chancellor and that people don’t want more “empty promises” from this Conservative government whilst “local health services are left on their knees”.\nLiberal Democrat spokesperson for Mid Dorset and North Poole’s, Vikki Slade said\n“This Budget will barely touch the sides for families and pensioners around here, who are facing soaring mortgage bills while the cost of the weekly shop goes through the roof.\n“People in Mid Dorset and North Poole know that their tax bills will remain sky high after this budget, and the Chancellor is attempting a desperate deception after years of income tax hikes.\n“People don’t want more Conservative empty promises while our local health services are left on their knees. They want proper change through a General Election so we can kick this Conservative government out of office.\n“It’s clear the choice Mid Dorset and North Poole at the next election will be between an out-of-touch Conservative MP or a hard–working Liberal Democrat local champion.”",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_page-4/content_41.html": "Vikki Slade elected as leader of BCP Council\nFollowing an incredible set of election results across the three towns, Councillor Vikki Slade has been elected to become the leader of BCP Council.\nThe Mid Dorset and North Poole Liberal Democrats are an organisation that work tirelessly for their local community. Branching across Poole, Purbeck and East Dorset, your Lib Dem Councillors were elected because of their commitment to their local communities.\nFollowing an incredible set of election results across the three towns, Councillor Vikki Slade has been elected to become the leader of BCP Council.\nThe recent BCP elections saw a surge of support for the Liberal Democrats, with the party gaining an impressive 15 seats on the council. This result makes them the largest party in the council by far, with 28 councillors in total to the Conservative's 12.\nIt is clear that Cllr Mellor’s resignation has been a long time coming following a series of unforgivable financial decisions from the Conservatives that have saddled residents with mounting debt and wasted huge sums of tax-payers money on ‘dodgy deals’ and vanity projects\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.\nNo child should ever have to experience sexual abuse. These are horrifying crimes that cause so much harm to the children who are victims. We will keep up the pressure so that the action needed to make our communities safe all children finally happens.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_stour-allen-vale/content_4.html": "Stour & Allen Vale\nWill Chakawhata\nWill has lived in Dorset for the last 25 years along with his family, his children attend local schools. He has worked in the NHS for over two decades, first training as a mental health nurse, then progressing into senior leadership roles.\nWorking in the NHS, Will has seen first hand the impact that chronic underfunding from the Conservative government has had on our public services. Will wants to fight for more funding for our local GPs, dentists and police. Through his passion for making a difference to our community and his experience means he is bringing fresh approach to the Council.\nWill has a proven track record of working in his community, from volunteering as a Magistrate in Dorset for over 10 years, to chairing one of the the scrutiny panels for the Police and Crime Commissioner. He has been instrumental in improving accountability and performance within Dorset Police.\nWill is focused on using his skills and experience to directly improve facilities for local people of all ages.\nIn his spare time, Will enjoys taking walks past High Hall to Badbury Rings and Kingston Lacy, while listening to his favourite Jazz and Blues music. He can often be found cheering on his son’s football matches, who played for Sturminster Marshall for many years.\nEmail: cllrwill.chakawhata@dorsetcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_values/content_30.html": "What we stand for\nThe Liberal Democrats exist to build and safeguard a fair, free and open society, in which we seek to balance the fundamental values of liberty, equality and community, and in which no-one shall be enslaved by poverty, ignorance or conformity.\nPreamble to the Liberal Democrat Constitution\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nLiberty\nWe believe in the right of individuals to make their own decisions about how they live their lives, as long as they do not cause harm to others.\nOur aim is to empower and support individuals to pursue their dreams, to make the most of their talents and to live their lives as they wish.\nEquality\nWe stand by the idea that without equality, true liberty cannot be realised.\nThis requires an active state to: ensure that no one is held back by poverty, poor health, or discrimination, including on the basis of personal characteristics or beliefs; provide access to education or training, and other public services, including a welfare safety net; and guarantee that everyone enjoys equality before the law.\nDemocracy\nWe understand that through democracy, every citizen is empowered to make their voice heard, without being dominated by entrenched interests or the power of money; checks and balances, so that those in power cannot abuse their positions for personal gain or political advantage; and a plurality of views, where no individual or organisation is deterred from speaking truth to power.\nCommunity\nWe believe it is important to provide support for a diverse range of organisations that enable individuals to join together in the pursuit of common goals or activities; and the decentralisation of political and economic power to local government and the nations and regions of the UK.\nHuman Rights\nProviding, defending and promoting equal legal rights for everyone to pursue their lives according to their abilities, wishes and means, with no discrimination on the basis of religion or belief, gender, sexuality, age, ethnicity, disability, or minority status in their country of birth or permanent residency is highly important to us.\nInternationalism\nWe support a fairer and more equal, tolerant and connected world and collaboration with the UK's neighbours - including, ultimately, rejoining the EU - in guaranteeing peace and security, tackling the climate and nature emergencies, standing up to corporate power and spreading prosperity around the world.\nEnvironmentalism\nWe value the importance of acting at home and internationally to promote environmentally sustainable means of production and consumption and living in harmony with nature.\nOur policies\nLearn more about the influence these values have on Liberal Democrat policy",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_vikki-slade_contact-vikki-1/content_6.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_vikki-slade-mp-backs-motion-to-protect-thousands-of-pensioners-in-mid-dorset-and-north-poole-from-winter-fuel-payment-cut/content_50.html": "Vikki Slade MP backs motion to protect thousands of pensioners in Mid Dorset and North Poole from Winter Fuel Payment cut\nLiberal Democrat MP Vikki Slade has backed a motion in Parliament to block government plans to scrap Winter Fuel Payments for most pensioners.\nIt comes as new analysis shows an estimated 23,037 pensioners in Mid Dorset and North Poole are at risk of losing the £300 payment, which helps with heating bills in the cold winter months.\nThis is the estimated number of pensioners in the constituency who don't receive pension credit, and so will lose the winter fuel allowance under the government’s plans unless they receive other benefits. The figures were compiled by the House of Commons Library based on data from the Department of Work and Pensions.\nIf passed, the Liberal Democrat motion would protect local pensioners by blocking the government’s changes and restoring their winter fuel payments. It is set to be tabled as soon as Parliament returns next week and has been backed by all 72 Liberal Democrat MPs.\nAcross the country, 11 million pensioners are set to lose their winter fuel payment under the government’s plans, including two million that the charity Age UK has said will struggle to afford their energy bills as a result. This is despite the average energy bill being set to rise by £149 a year from October.\nThe Liberal Democrats are urging the government to think again to protect poorer and more vulnerable pensioners from being forced to choose between eating and heating this winter.\nLiberal Democrat MP for Mid Dorset and North Poole, Vikki Slade said:\n“I’ve heard from countless pensioners across Mid Dorset and North Poole worried about losing this vital support and how they will afford their energy bills this winter.\n“Stripping support from many of the poorest pensioners in MDNP just as energy bills are set to rise again is simply wrong, and most of us were really shocked to hear the announcement when it came just before summer recess. It could force vulnerable elderly people in our community to choose between eating and heating this winter.\n“That is why me and my fellow Liberal Democrat MPs will do everything we can to block these plans as soon as Parliament returns. I have also reached out to Age UK for a meeting to see how we can encourage more pensioners who do not claim Pension Credit to put in an application and get what they are entitled to.\n“I recognise that the new government faces difficult choices after the appalling mess left by the Conservatives. But a rethink is urgently needed so that poorer and vulnerable pensioners in our community continue to get the support they so desperately need.”\nNotes\nUnder the government’s changes only those pensioners who receive pension credit or other means-tested benefits will still get the £300 winter fuel allowance towards the cost of their energy bills.\nA breakdown of the number of pensioners not receiving pension credit by constituency, compiled by the House of Commons Library, is available here (source: DWP Stat-xplore)\nThe Liberal Democrats will table a parliamentary motion (known as a “prayer”) to block the Social Fund Winter Fuel Payment Regulations 2024, published by the Government last week, from becoming law. If passed by the House of Commons, the motion would keep the current system of universal Winter Fuel Payments for pensioner households in place.\nAge UK research has estimated that two million pensioners will struggle to pay their energy bills due to this cut, see here.\nContact Vikki.Slade.MP@Parliament.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_lib-dems-make-massive-gains-in-bcp-council-election/content_35.html": "Lib Dems make big gains in BCP council election\nThe recent BCP elections saw a surge of support for the Liberal Democrats, with the party gaining an impressive 15 seats on the council. This result makes them the largest party in the council by far, with 28 councillors in total to the Conservative's 12.\nThese results are an indication that the party's message of positive change, working hard all year round and getting basics right is resonating with voters.\nDuring the campaign, many residents were reporting feeling frustrated and taken for granted by the previous Conservative-led administration. This frustration was evident in Talbot and Branksome Woods where the Lib Dems gained a councillor in a previously 'strong' Conservative area and the Conservative leader only managed to cling on to his seat by 5 votes.\nThe Liberal Democrats have maintained their stronghold in three Mid Dorset North Poole wards with all previous councillors being re-elected and two new additions. Councillor Peter Sidaway will join Councillor Vikki Slade in Broadstone after the retirement of long-standing Councillor Mike Brooke, while Councillor Clare Weight secured a seat in Canford Heath previously held by a Conservative. Councillor Weight's win has ensured that all three seats in Canford Heath are once again occupied by Liberal Democrat councillors.\nAs the Liberal Democrats celebrate their incredible victory, they remain focused on their mission to create positive change and move forward towards a better future for the BCP area and a council that listens to the residents.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_drew-mellor-finally-resigns/content_40.html": "Drew Mellor finally resigns!\nFollowing the resignation of the Conservative leader on BCP Council, Councillor Vikki Slade, Leader of the Liberal Democrats' on BCP Council, has issued this statement:\nIt is clear that Cllr Mellor’s resignation has been a long time coming following a series of unforgivable financial decisions from the Conservatives that have saddled residents with mounting debt and wasted huge sums of tax-payers money on ‘dodgy deals’ and vanity projects and in some respects it is surprising that it has taken him so long to do this, given we have been calling on him to go for over a year.\nWhat Cllr Mellor fails to acknowledge is that residents will face a huge council tax rise because of his administration’s serious mismanagement of the council’s budget. Now he’s ducking out of his responsibilities leaving residents to pick up the tab. During the scrutiny meeting earlier this month I called him a coward for putting forward cuts that would not bite until after the election and he has now proved to be exactly that – what more cowardly act than to resign just as your budget paper is published.\nThe Conservatives may be hoping that they can claw back some semblance of credibility in the run up to May’s local elections by switching their leader. But residents need to remember that all of their Conservative councillors and those who continue to support him from a supposed ‘independent’ position have been complicit in pushing the council further and further towards bankruptcy.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-party-1/content_18.html": "Mid Dorset & North Poole Liberal Democrats\nThe Mid Dorset and North Poole Liberal Democrats are an organisation that work tirelessly for their local community. Branching across Poole, Purbeck and East Dorset, your Lib Dem Councillors were elected because of their commitment to their local communities.\nOur previous member of parliament, Annette Brooke, and local campaigner, Vikki Slade have shown incredible dedication and have served the community beyond measure.\nWe will continue to campaign on local issues to serve local families so, if you have a problem, you can find your local councillor here.\nIf you would like to be a part of the Mid Dorset and North Poole Liberal Democrats and attend social events, deliver leaflets or volunteer at our office, please sign up here.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_vikki-slade-celebrates-international-womens-day/content_49.html": "Vikki Slade Celebrates International Women’s Day\nVikki commented: ‘There have been many incredible women who have inspired me throughout my life. My mum, who fought for the life she wanted and showed me how to love life.\nDame Annette Brooke, who asked me to stand for parliament and demonstrated how being a Liberal Democrat MP can make a real difference. My girls Molly & Abbi, who are growing into brilliant women, aiming to make difference to medical research & the planet. The girls we have fostered (M, E, M, S and K) who drive me to make sure every child meets their potential. The homeless mums I have supported especially Emma & Chloe. And finally, the women who made it possible for people like me to represent communities, to stand for parliament & to improve the world. Without the suffragettes, women’s rights movements and the UN we might not be able to achieve our potential.\nVikki Slade is the LibDem Parliamentary candidate for Mid Dorset and North Poole",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_search/content_8.html": "Buy Dorset, Back Britain\nBuy Dorset, Back Britain Vikki Slade MP encourages Dorset residents to ‘Buy Dorset, Back Britain’ Vikki said: “We should support our Great British products to protect them from the economic shock…\nBuy Dorset, Back Britain Vikki Slade MP encourages Dorset residents to ‘Buy Dorset, Back Britain’ Vikki said: “We should support our Great British products to protect them from the economic shock…\nWareham Level Crossing Vikki Secures Future of Wareham Level Crossing The future of Wareham's Level crossing had been in jeopardy for many years as Network Rail and other organisations had…\nBaker's Arms Roundabout Vikki Takes Baker's Arms Flooding Issue to Parliament The Baker's Arms roundabout on the A35 has severe issues as when it floods it cuts off Wareham and most of the Purbeck…\nPetition: Stop Disposable Barbecues MP Calls for Urgent Action on Wildfires, Fire Service Funding, and Ban on Disposable BBQs Mid Dorset and North Poole MP Vikki Slade, has called on the…\nContact Us Contact the Mid Dorset & North Poole Liberal Democrats office Mid Dorset & North Poole Lib Dems are based at Liberal Hall, 14 York Road, Broadstone, BH18 8ET. …\nContact us Got an issue you need help with? Got a question that you need an answer to? Contact us here and we can help! There'll be a contact form coming soon as part of the forms tool that…\nBroadstone E-News 16th January 2024 Growing Businesses and Thriving High Streets Devolution Option Agreed Both the current and the previous governments have been keen to roll out further…",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_broadstone/content_3.html": "Broadstone\nCouncillor Vikki Slade\nPrior to her election to Poole Council in May 2011, Vikki was Chair of Broadstone Chamber of Trade for seven years and was committed to ensuring the success of the Christmas Parades and Lights. Having run a cafe and catering business since 2001 with her husband Paul, Vikki campaigned for reform of business rates, fairer parking charges and support for district shopping areas.\nShe founded Broadstone Fields in Trust Association - creating the Annual Summer Fun Day - and has been chair of Broadstone Youth Club since 2012, where she also volunteers as a Youth Leader. On council Vikki helped develop the Anti-Bullying Strategy and is outspoken on children’s mental health services (CAMHS). She has also been a volunteer employability mentor at a number of secondary schools through Young Enterprise.\nVikki is a trained Dementia Friend and worked with local disability groups to improve access to shops and businesses, reducing pavement clutter and parking. She has campaigned for new play equipment at both parks, better access to, and maintenance of, the Castleman Trailway for pedestrians, wheelchair users and cyclists. She continues to press the Council for new natural play equipment and other facilities at Broadstone Recreation Ground.\nVikki has four children, and wants to continue to create a safe, vibrant community with good employment prospects and to protect the environment for future generations.\nTel: 01202 658629 Email: Vikki.Slade@bcpcouncil.gov.uk\nCouncillor Peter Sidaway\nBorn in Poole, Peter has lived in Broadstone for the majority of his life since the age of 8. His family ran the 'Sidaways' newsagents in Dunyeats Road (now the Attic), which is fondly remembered by many local residents.\nAfter spending much of his career working away from home as a programme director in the Life, Pensions and wealth management industry, Peter is now semi-retired and able to enjoy getting fully involved locally. He is wholly committed to the Broadstone community and has recently been involved in a number of projects including the Christmas Lights, Musical Markets and Rock on the Rec, as well as being on the leadership team for both the Broadstone Neighbourhood Forum and the fledgling Broadstone Business Community.\nHis 4 children all attended the local schools, with the youngest currently completing his final year at Poole Grammar. Married to Olivia, he is passionate about reducing the impact of poverty in our area, ensuring the success of local businesses, building a vibrant, attractive high street and the current climate emergency.\nPeter can often be found in the area walking his Jack Russell, Bella, and in his spare time he will probably be playing guitar or watching his beloved West Bromwich Albion, a passion he got from his grandfather many years ago.\nTel: 07871184452 Email: peter.sidaway@bcpcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_mdnp-local-news_page-1/content_48.html": "Almost 7,000 over 80s at risk of losing Winter Fuel Payments in MDNP\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nLeader of the Liberal Democrats Ed Davey has today (Wednesday 18th September) appointed Vikki Slade to be the party’s Housing Communities and Local Government Spokesperson.\nVikki spoke in Parliament this week to highlight the issue of the funding crisis in Special Educational Needs and the impact it has on Councils such as BCP.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team/content_7.html": "Your Lib Dem Team\nMid Dorset & North Poole's Liberal Democrat Councillors\nThe Mid Dorset & North Poole Liberal Democrats are working for you all year round, not just at election times! Find the details for your local team below.\nThe Mid Dorset & North Poole Liberal Democrats are working for you all year round, not just at election times! Find the details for your local team below.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_vikki-slade-appointed-libdem-spokesperson-for-housing-communities-and-local-government/content_23.html": "Vikki Slade appointed LibDem spokesperson for Housing Communities and Local Government\nLeader of the Liberal Democrats Ed Davey has today (Wednesday 18th September) appointed Vikki Slade to be the party’s Housing Communities and Local Government Spokesperson.\nThe appointment of Vikki to the role follows the Liberal Democrats’ first reshuffle since the party won a record number of seats in the general election.\nEd Davey urged his party to focus on the “people’s priorities” and “clean up the mess left by the Conservative party.” This follows Ed Davey’s speech to Liberal Democrat conference this weekend, where he set out plans to be a “responsible opposition”.\nVikki Slade has now vowed to take local issues in Mid Dorset and North Poole, and across Dorset & BCP Councils to the heart of Westminster. The MP will now use their role in the House of Commons to champion local issues and hold the government to account on policy decisions.\nThe MP for Mid Dorset and North Poole has already hit the ground running since the general election, by raising Local Government funding, Special Educational Needs and the impact of asylum seekers on housing in the chamber.\nCommenting on the new appointment, Liberal Democrat MP Vikki Slade said:\n“It is an honour to take on this role and speak for my party on this incredible brief.\n“I am grateful to Ed Davey for this opportunity to hold ministers to account in the House of Commons. I will not take this responsibility for granted and will use it to hold the government to account, giving a voice to local people on the issues they care about most.\n“As a former Local Government Leader and senior member of the Local Government Association I know only too well how local services have been undermined by the massive cuts to funding and the impact this has on our diverse communities.\nThe Covid-19 pandemic demonstrated the importance of strong communities and with so many groups struggling to reform and rebuild in the aftermath, and with increased poverty creating additional demand for services, as Liberal Democrats we must stand up for the sector.\n“I got involved in politics to represent small businesses and the high street, and I am delighted that I now have the opportunity to voice the concerns of retail, hospitality and communities at the highest level, using the planning system to enhance their future alongside my colleagues in the business and trade roles.\n“Our country was failed by years of chaos under the previous Conservative government, we face a cost-of-living crisis and a housing emergency. We need the new Government to work at pace to protect and improve our communities and it is time for the Liberal Democrats to provide proper opposition in Westminster that will hold them to account and champion the people’s priorities.”\nLeader of the Liberal Democrats, Ed Davey said:\n“My new frontbench will champion the people’s priorities, ensuring we hold the new government to account as a responsible opposition.\n“I am humbled by the result of the General Election and the millions of voters who put their trust in the Liberal Democrats, including many for the first time. We will stand up for our communities every day on the issues that matter most, fixing health and care services, tackling the cost of living crisis and protecting our precious environment.\n“I am so proud of my entire team of 72 Liberal Democrat MPs who will serve as strong local champions in Westminster as we clean up the mess left by the Conservative government.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_vikki-slade_campaigns/content_13.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_mdnp-local-news_page-3/content_37.html": "77% of all burglaries in Dorset go unsolved\nA staggering 77% of burglaries went unsolved in Dorset in the 2022/2023 financial year - an average of 6 per day, new analysis has revealed.\nA staggering 77% of burglaries went unsolved in Dorset in the 2022/2023 financial year - an average of 6 per day, new analysis has revealed.\nVikki Slade says Lib Dems have “wind in our sails” following historic by-election victory. In Somerton and Frome, the Lib Dems overturned a massive Conservative majority of 19,000, with a swing of 29%.\nFollowing the success of the May 2023 elections, the Three Towns Alliance was formed to lead BCP Council. The alliance is led by the Liberal Democrats and comprises other independent parties across the BCP area. Find out more about their priorities.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_vikki-slade_campaigns_buy-dorset-back-britain/content_12.html": "Buy Dorset, Back Britain\nVikki Slade MP encourages Dorset residents to ‘Buy Dorset, Back Britain’\nIn response to Donald Trump's tariffs wreaking havoc on international trade, Vikki Slade encourages Dorset residents to buy local and prioritise our British businesses.\nVikki said: “We should support our Great British products to protect them from the economic shock caused by Donald Trump’s aggressive trade war, whether it’s using local producers or spending on our high streets.”\n\"I visited retailers in Wareham to hear more about the challenges they are currently facing and to see some of the brilliant things already being done to support local retailers championing local producers.\"\n“I have also recently been hosting round table events where I have invited local professionals from a range of sectors to engage in discussions about the hurdles they face professionally and to explore what could be meaningfully done to have a positive impact.\"\n“I will continue to visit retailers and will be asking them to take part in my spring survey so I can better understand the hurdles they face.”\nWorryingly, our Dorset farmers may also be put in even further stress after the Times reported that tariffs on US beef, chicken and pork would all be slashed in a proposed agreement between Trump and the UK. American animal welfare standards are lower than on our family farms who have already been undercut following the Conservative’s disastrous deal with Australia and New Zealand.\nIt is estimated that Trump’s tariffs could wipe out up to 1% of GDP, pushing many British businesses to the wall. The measures that have so far been announced by the US will see 10% tariffs on UK exports and 25% tariffs on all automotive exports to the US.\nThe Liberal Democrats have outlined a number of steps the Government should already be taking to back British businesses in the face of tariffs and stagnant economic growth. They included scrapping the growth-crushing jobs tax coming into effect in the coming days and overhauling the broken business rates system to unleash the growth potential of our high-streets and manufacturers.\nAction must be taken to shield British businesses from the incoming storm.\nCome and take our small business survey\nIf you are a small business owner, we would love to receive some of your feedback by filling in our small business survey.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_corfe-mullen/content_9.html": "Corfe Mullen\nScott Florek\nScott has lived in Corfe Mullen for 12 years with his partner and his dog, Darcie. Although he was born and raised in a city he much prefers and appreciates the rural aspect and environment of Corfe Mullen. Scott works locally; he often uses public transport to travel to work and understands the importance of this network.\nScott represents Corfe Mullen on Dorset Council and the Town Council, he enjoys listening to residents, advocating for them and raising their concerns. He has the experience to represent our community.\nHe has a strong track record of volunteering in the community. Scott, along with his ward colleague Duncan, has worked hard to raise much needed funds for the people of Ukraine as well as closer to home raising funds for the Lewis-Manning Hospice Care.\nScott has always been interested in environmental issues and is particularly passionate about protecting our greenbelt from over development to ensure they remain a resource for the community and for the wildlife that live in our area.\nScott likes to keep fit and regularly plays Badminton at a local gym. He is an avid reader and is the Chairman of the Friends of Corfe Mullen Library, where he is seeking to increase activities for residents to enjoy. He also enjoys gardening and can often be found walking his dog, Darcie, on the local heathland.\nEmail: cllrscott.florek@dorsetcouncil.gov.uk\nDuncan Sowry-House\nDuncan was born and raised in Dorset and moved to Corfe Mullen over 18 years ago, where he now lives with his family. As a local employer of 50 people, Duncan understands the struggles business and families have been experiencing, especially in these tough times. As well as founding his engineering company, Duncan also worked locally as a Postmaster for 15 years.\nDuncan has dedicated much of his life to community service, having served as a Town Councillor and for the last 5 years as Chairman and Mayor of Corfe Mullen.\nDuring lockdown, he co-founded CM Resilience, personally delivering nearly 4,000 prescriptions to vulnerable residents alongside his ward colleague Scott. Duncan also volunteers with the local Youth Trust and has served as a Local Authority and Parent Governor at his children’s schools. Additionally, he has been a voluntary classroom assistant in Corfe Mullen, giving him insight into the importance of quality child-centred education.\nDuncan also offers mainstream activities for adults with learning difficulties and founded FireWise Wessex, which helps local residents safeguard their homes from the risk of wildfires.\nDuncan enjoys reading, gardening and walks with his puppy. He collects and lectures on Poole Pottery and writes a regular column for the local Link Magazine: Gardening Matters.\nEmail: cllrdash@dorsetcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_contact-our-party/content_10.html": "Contact us\nGot an issue you need help with? Got a question that you need an answer to?\nContact us here and we can help!\nThere'll be a contact form coming soon as part of the forms tool that you can embed here.\nGot an issue you need help with? Got a question that you need an answer to?\nContact us here and we can help!\nThere'll be a contact form coming soon as part of the forms tool that you can embed here.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_lytchett-matravers-and-upton/content_26.html": "Lytchett Matravers and Upton\nAlex Brenton\nAlex has lived and worked in Purbeck for most of her life, her children went to local schools. She and her husband Rob have a background in farming and gardening with a wide understanding of rural, local and conservation issues. She is a garden consultant. A former Dorset County Councillor, Alex originally became a local campaigner lobbying for road safety measures at Morden Park Corner and on the A35 from Lytchett Matravers to Bere Regis a fight which continues. She has been on the Morden Parish Council for nearly 20 years, most of them as chairman.\nTel: 01929 459496 Email: cllralex.brenton@dorsetcouncil.gov.uk\nAndrew Starr\nAndrew has lived in Upton for 33 years since moving from Bournemouth. Married to Wendy for 40 years, they have 2 children and grandchildren who have all attended or attending local schools. Andrew has eight years experience as a councillor or Purbeck District Council representing Upton West, including as the Natural Environment Spokesperson. A former telecommunications engineer, Andrew is a very active grandfather, frequently to be met at Upton Infant and Junior Schools' gates. Passionate about protecting and enhancing our local environment, treasurer and active member of the Keep Upton Tidy Group and a keen cyclist.\nTel: 07592 358177 Email: cllrandrew.starr@dorsetcouncil.gov.uk\nSteve Robinson\nSteve, who moved to Upton in 2016, has worked in the community and voluntary sector all his life and recently retired from running the Dorset based charity Prama, overseeing various social care and community services such as clubs for those experiencing loneliness and isolation as well as community groups offering various activities from IT training to gardening.\nThrough his work, Steve has found his passion for helping communities become all age friendly and aims to be a trusted spokesperson for those who feel excluded and disadvantaged.\nSteve is an avid campaigner and has spoken at Parliamentary groups on local issues including the cost of living crisis, broadband access and pension changes. Most recently, Steve has been campaigning for improved road safety around Lytchett Bay. He is not afraid to speak and campaign on behalf of his residents through his experience of regularly speaking at his local church and appearances on Radio 4 news programmes and local radio stations.\nSteve has very recently been elected to represent the local area on Dorset Council as well as on the Lytchett Minster and Upton Town Council, which he sees as an opportunity to continue the community work that he is passionate about on a local level at a time of increasing need.\nSteve is a member of St Dunstan’s church in Upton. He has two (frequently muddy) dogs and is a keen adventurer and traveller.\nEmail: cllrsteve.robinson@dorsetcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_page-3/content_36.html": "77% of all burglaries in Dorset go unsolved\nA staggering 77% of burglaries went unsolved in Dorset in the 2022/2023 financial year - an average of 6 per day, new analysis has revealed.\nThe Mid Dorset and North Poole Liberal Democrats are an organisation that work tirelessly for their local community. Branching across Poole, Purbeck and East Dorset, your Lib Dem Councillors were elected because of their commitment to their local communities.\nA staggering 77% of burglaries went unsolved in Dorset in the 2022/2023 financial year - an average of 6 per day, new analysis has revealed.\nVikki Slade says Lib Dems have “wind in our sails” following historic by-election victory. In Somerton and Frome, the Lib Dems overturned a massive Conservative majority of 19,000, with a swing of 29%.\nFollowing the success of the May 2023 elections, the Three Towns Alliance was formed to lead BCP Council. The alliance is led by the Liberal Democrats and comprises other independent parties across the BCP area. Find out more about their priorities.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nThe UK needs to strengthen both our Armed Forces and our soft power.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_donate/content_5.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_mdnp-local-news_page-2/content_39.html": "Vikki Slade MP backs motion to protect thousands of pensioners in Mid Dorset and North Poole from Winter Fuel Payment cut\nLiberal Democrat MP Vikki Slade has backed a motion in Parliament to block government plans to scrap Winter Fuel Payments for most pensioners.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_mdnp-local-news/content_24.html": "Almost 7,000 over 80s at risk of losing Winter Fuel Payments in MDNP\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nLeader of the Liberal Democrats Ed Davey has today (Wednesday 18th September) appointed Vikki Slade to be the party’s Housing Communities and Local Government Spokesperson.\nVikki spoke in Parliament this week to highlight the issue of the funding crisis in Special Educational Needs and the impact it has on Councils such as BCP.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_team2025/content_28.html": "Volunteer\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_mdnp-local-news_page-4/content_25.html": "Vikki Slade elected as leader of BCP Council\nFollowing an incredible set of election results across the three towns, Councillor Vikki Slade has been elected to become the leader of BCP Council.\nFollowing an incredible set of election results across the three towns, Councillor Vikki Slade has been elected to become the leader of BCP Council.\nThe recent BCP elections saw a surge of support for the Liberal Democrats, with the party gaining an impressive 15 seats on the council. This result makes them the largest party in the council by far, with 28 councillors in total to the Conservative's 12.\nIt is clear that Cllr Mellor’s resignation has been a long time coming following a series of unforgivable financial decisions from the Conservatives that have saddled residents with mounting debt and wasted huge sums of tax-payers money on ‘dodgy deals’ and vanity projects",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_vikki-slade/content_31.html": "Vikki Slade - Your Member of Parliament\nVikki is a committed and passionate campaigner and in addition to being the Member of Parliament for Mid Dorset & North Poole, she is one of the ward councillors for Broadstone, a member of the Liberal Democrat’s Regional Executive and the Vice Chair of Liberal Democrat Campaign for Gender Balance.\nVikki’s background is in financial services and management but she left the industry to work full time in her family business after the birth of her son in 2005. During the 14 years that she ran their catering business and cafe, Vikki became involved in mentoring disadvantaged young people and offered a number of apprenticeships and work placements. She also became involved with a number of community groups, including leading the local Chamber of Trade which not only campaigned for small business issues but ran the town’s community events.\nShe founded Broadstone Fields in Trust Association - creating the Annual Summer Fun Day - and has been chair of Broadstone Youth Club since 2012, where she also volunteers as a Youth Leader. She has also been a volunteer employability mentor at a number of secondary schools through Young Enterprise. Vikki is a trained Dementia Friend and worked with local disability groups to improve access to shops and businesses, reducing pavement clutter and parking.\nVikki has four children, and wants to continue to create a safe, vibrant community with good employment prospects and to protect the environment for future generations.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_hidden-pages_bakers-arms-roundabout/content_29.html": "Baker's Arms Roundabout\nVikki Takes Baker's Arms Flooding Issue to Parliament\nLib Dem MP Vikki Slade has called on the Government to take action on flooding on our local roads.\nThe Baker's Arms roundabout on the A35 has severe issues as when it floods it cuts off Wareham and most of the Purbeck area from the rest of Dorset - causing traffic chaos and long delays, especially at peak times.\nVikki has been taking action on the issue by raising it in Parliament and asking the Flooding Minister for action to protect our vital highways infrastructure from floods.\nVikki said: “We all know this is not a new issue. This has been going on for many years and with flooding incidents increasing across Dorset. I am concerned that nothing has been done.”\nShe continued: \"I know that the previous MP made this a campaign priority and so I had assumed there would be a record of meetings and correspondence with the Department of Transport in relation to this matter and a permanent solution on the horizon. Unfortunately, the Department of Transport have now confirmed that they have no record of this being raised with them.\nOver the last couple of months I have written to the DfT, the Environment Agency and Dorset Council to seek a solution to the constant flooding. I have been in direct contact with local Highways Officers and the Flood Risk Management Team to further review the situation. Following this, it was agreed that the Highways Team would conduct an investigation of all the drainage assets surrounding the roundabout, with the goal of ensuring that they are in good condition. As a result, a full cleanse of the drainage system will now follow, which includes some ground clearance and reopening the outlets to improve capacity and tackle the standing water.\"\nVikki added: \"On visiting the site recently, I was pleased to see that some of the initial stage ground clearance has begun. However, since Bakers Arms Roundabout is a key part of the network, it is anticipated that the full works will require temporary closure of the roundabout, which will have a significant impact on traffic and local people.\nTraffic management will be a crucial part of the planning, and they have assured me that they are aware of the need for clear communication with the public, especially you as local residents. Presently, they are working closely with delivery agents and traffic colleagues to determine the best time for the works.\nWhile these efforts will not immediately resolve the underlying flooding issues at this location, they should help reduce the flooding's impact during periods of heavy rainfall and mitigate disruption to road users.\nPlease be assured that I will continue to actively push for solutions and work tirelessly for local people to improve the situation that we all know has been going on for far too long.\"",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_survey/content_14.html": "Vikki Slade MP and the local Lib Dems are listening to you\nPlease complete the survey by clicking on the button below\nI'm proud to be your local MP. I promise to stand up for our area and to ensure the voices of the residents in Mid Dorset & North Poole are heard loudly and clearly in Westminster. Your priorities are my priorities and so I will ensure that I'm focused on the things that matter to you. That's why I'm asking you to take 60 seconds to fill in this survey and share what's important to you. Your feedback will help shape my work and ensure our communities get a fair deal. Thank you for taking the time to share.\nVikki Slade MP",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_77-of-all-burglaries-in-dorset-go-unsolved/content_47.html": "77% of all burglaries in Dorset go unsolved\nA staggering 77% of burglaries went unsolved in Dorset in the 2022/2023 financial year - an average of 6 per day, new analysis has revealed.\nThe figures, from official Home Office statistics, show that in 2022/2023, a total of 2189 burglaries in Dorset were closed without a suspect being identified, accounting for 77% of all cases. Meanwhile, just 4% of Dorset burglaries resulted in a suspect being charged or summonsed.\nThe figures in our area match the national picture, with 77% going unsolved but across England and Wales the charge rate is slightly higher at 6%.\nWhilst the Police and Crime Commissioner has welcomed an increase in police numbers, since 2015, the Conservatives have taken over 4,000 Police Community Support Officers off the streets across the country. And as of last year, just 12% of officers across England and Wales were assigned to frontline neighbourhood policing teams.\nThe Liberal Democrats are calling for a return to proper community policing, where officers are trusted and visible in their neighbourhoods, with the time and resources to focus on tackling local crimes like burglaries. The party is also calling for a new “Burglary Response Guarantee” under which all domestic burglaries would be attended by the police and properly investigated.\nCommenting, Liberal Democrat Parliamentary Candidate for Mid Dorset and North Poole, Vikki Slade, said:\n“Everyone deserves to feel safe and secure in their own homes. But under this terrible Government, so many burglars are getting off scot-free. These figures will bring little comfort to families and pensioners in Dorset. We are not expecting a return to a bobby on the beat but the balance between dealing with organised and violent crime and neighbourhood policing needs to change.\n“It’s a disgrace that our local communities are paying the price for the Conservative Government’s failures to get tough on burglaries.\n“The Conservatives must finally bring back proper community policing and back the Liberal Democrats Burglary Response Guarantee so all burglaries are attended by the police. It’s the only way to reverse these shocking figures.”",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_contact-us/content_16.html": "Contact Us\nWe're working for you all year round, not just at election times.\nContact the Mid Dorset & North Poole Liberal Democrats office\nMid Dorset & North Poole Lib Dems are based at Liberal Hall, 14 York Road, Broadstone, BH18 8ET.\nOffice Opening Times: Monday - Friday from 9am until 5pm\nYou can get in contact with us by:\n☎️ 01202 658629\n📧 office@mdnplibdems.org\nHall hire: If you would like to hire the hall or studio please contact the Liberal Hall team via email: broadstoneliberalhall@gmail.com",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_almost-7000-over-80s-at-risk-of-losing-winter-fuel-payments-in-mdnp/content_44.html": "Almost 7,000 over 80s at risk of losing Winter Fuel Payments in MDNP\n6,696 of those aged over 80 in Mid Dorset & North Poole are at risk of losing their Winter Fuel Payments due to the government’s cuts, the latest official statistics released today (24th September) have revealed.\nLocal Liberal Democrat MP, Vikki Slade, has called on the new government to “change course” in the face of these new statistics saying that ministers must “protect vulnerable pensioners” with thousands at risk of having to choose between heating and eating this winter.\nAnalysis of the new data shows that in Mid Dorset & North Poole, 6,696 pensioners aged over 80 are not in receipt of pension credit and will lose their Winter Fuel Payment they were previously entitled to unless they receive other benefits.\nAll those aged over 80 were previously entitled to £300 each to help with their energy bills to stay warm during the winter months but many will now lose this money.\nIn total, last year those aged over 80 in Mid Dorset & North Poole received £1.8m in support with just over £4m given out to all pensioners in the constituency. This figure will drastically fall this winter following the withdrawal of support by the government for the vast majority of pensioners.\nIn total 23,166 pensioners in Mid Dorset & North Poole do not receive pension credit and are also at risk of losing support due to the government’s cuts.\nAge UK has previously said that 2.5 million pensioners will “be in serious trouble” this winter due to the cutting of the payments. Mid Dorset & North Poole MP, Vikki Slade has called on the government to “reverse these proposals and protect vulnerable pensioners” this winter.\nLiberal Democrat MP for Mid Dorset & North Poole said:\n“Thousands of pensioners here in Mid Dorset & North Poole are desperately worried about how they will make it through this winter. I am concerned most about those older pensioners, and these figures are deeply worrying.\n“I have heard countless stories from those who now say they will have to choose between staying warm or putting food on the table as a result of this government’s decision.\n“Cutting these payments for thousands of my constituents, including many that are just barely getting by, is the completely wrong thing to be doing.\n“It is not too late for this new government to change course, reverse these proposals and protect vulnerable pensioners here in Mid Dorset & North Poole this winter.”",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_our-team_canford-heath/content_32.html": "Canford Heath\nCouncillor Sandra Moore\nSandra has served Canford Heath residents since 2000. She lives in Canford Heath with her husband, Tony, and is a Mum and Grandma to two lively boys.\nSandra is actively involved in many Canford Heath organisations including: The TEACH Trust, Limelights, Canford Heath Neighbourhood Watch, ARCH and Friends of the Canford Heath Library.\nShe organises regular community litter picks across Canford Heath together with various environmental projects in addition to organising regular pre-loved book sales. Sandra has always campaigned against social injustice and uses her wide-ranging council experience to help improve Canford Heath for the benefit of her residents.\nTel: 01202 388418 Email: Sandra.Moore@bcpcouncil.gov.uk\nCouncillor Chris Matthews\nChris is married to Mel with two daughters and lives in Canford Heath. Chris was a Canford Heath councillor from 2003 to 2015 returning in 2019, and has a long record of action for getting things done for local people.\nChris is passionate about lifelong learning and is a social science lecturer; his special interest is social care and affordable housing for our young people, two issues he feels are the most important in getting a good deal for Canford Heath residents. Chris and his border collie Beauty are a familiar sight walking around the Heath.\nTel: 01202 656838 Email: Chris.Matthews@bcpcouncil.gov.uk\nCouncillor Clare Weight\nClare moved to Canford Heath in 2006. She wasn’t always political, but has always been a believer in open mindedness, policies based on evidence and a long-term approach. The Liberal Democrats was thus a natural choice and she has been a proud member since 2015.\nClare has spent her career so far in financial services. The unprecedented budget deficit that has arisen under the current Conservative leadership deeply concerns her. She has decided to stand for council this year because she wants to support Vikki Slade as part of a united team.\nIn work, Clare visits clients all over Dorset. She is used to listening and responding to people’s concerns, often wading through bureaucracy to provide the clarity people need.\nClare regularly uses the local gym and is passionate about providing good facilities for local families. She has also recently learnt to crochet and has made items to raise money for Unicef’s Ukraine Appeal and the Royal British Legion. She also regularly visits Canford Heath Library for cookbooks and Ashdown Sports Centre to work up an appetite.\nTel: 01202 127548 Email: clare.weight@bcpcouncil.gov.uk",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_page-1/content_22.html": "Almost 7,000 over 80s at risk of losing Winter Fuel Payments in MDNP\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nThe Mid Dorset and North Poole Liberal Democrats are an organisation that work tirelessly for their local community. Branching across Poole, Purbeck and East Dorset, your Lib Dem Councillors were elected because of their commitment to their local communities.\nAlmost 7,000 over 80s at risk of losing Winter Fuel Payments in Mid Dorset & North Poole as local MP calls on govt to “change course”\nLeader of the Liberal Democrats Ed Davey has today (Wednesday 18th September) appointed Vikki Slade to be the party’s Housing Communities and Local Government Spokesperson.\nVikki spoke in Parliament this week to highlight the issue of the funding crisis in Special Educational Needs and the impact it has on Councils such as BCP.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_page-2/content_43.html": "Vikki Slade MP backs motion to protect thousands of pensioners in Mid Dorset and North Poole from Winter Fuel Payment cut\nLiberal Democrat MP Vikki Slade has backed a motion in Parliament to block government plans to scrap Winter Fuel Payments for most pensioners.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_lib-dems-have-wind-in-our-sails-following-historic-by-election-victory-1/content_42.html": "Lib Dems have “wind in our sails” following historic by-election victory\nVikki Slade, Liberal Democrat MP candidate for Mid Dorset and North Poole has\nsaid the party’s victory in the Somerton and Frome by-election shows the party\nhas the “wind in our sails.”\nThe Lib Dems overturned a massive Conservative majority of 19,000, with a swing of\n29%. A swing just a fraction of the size to that seen in Somerset would see the\nLiberal Democrats gain Mid Dorset and North Poole from the Conservative Party at\nthe next General Election.\nLiberal Democrat Parliamentary Candidate for MDNP, Vikki Slade said:\n“The Liberal Democrats have the wind in our sails following the stunning by-\nelection win in Somerset. If that result was repeated here in Mid Dorset during a\nGeneral Election, we would be on course for a historic victory.\n“Having visited Somerset several times and knocking on hundreds of doors during the\nby-election, I hear the same thing there as I do here in MDNP. People are telling me\nthey're sick of having to wait weeks to see a GP while seeing their mortgages and rents\ngo through the roof, they are sick of sewage in the rivers and they are fed up with the\ncircus of the Conservative Party at Westminster.\n“It’s clear that at the next election, it will be a two horse race here between the Liberal\nDemocrats and the Conservatives.\"",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_petitions/content_11.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_vikki-slade_campaigns_wareham-level-crossing/content_33.html": "Wareham Level Crossing\nVikki Secures Future of Wareham Level Crossing\nAfter holding meetings with both Network Rail and the Rail Minister, Vikki Slade has secured the future of Wareham's beloved Level Crossing.\nThe future of Wareham's Level crossing had been in jeopardy for many years as Network Rail and other organisations had previously intended to close the crossing and cease its operations altogether.\nFollowing a series of meetings, Network Rail have finally agreed that the current arrangements with manually operated gates to maintain ground-level pedestrian access at Wareham rail crossing will continue in place for the long term.\nThey have also agreed to remove the previous expected expiry date of 2038 that would have seen pedestrian right of access across the tracks removed. It has instead been replaced with a rolling agreement to be signed with Dorset Council.\nVikki said: \"We are all incredibly proud of this achievement. I have long been aware of the ongoing dispute at the Wareham crossing and after hearing the concerns of the community, most recently at the protest on 1st February this year, I made it my mission as your MP to ensure those concerns were heard by the Rail Minister and Network Rail so that I could push for a long-term, sustainable solution that worked for all of Wareham.\nOver the last few years, the community in Wareham have been clear that they do not want their town divided. Residents have registered their strong opposition to proposals for closure of the crossing and have highlighted concerns around accessibility and the impact on the community.\nBoth Councillor Nick Ireland and I have worked hard to ensure that the people of Wareham have been heard. We are absolutely delighted that through our efforts the future of Wareham Crossing is secure.\"",
  "https_www_middorsetlibdems_org_uk_dorset-elections-2024_colehill-wimborne-minster-east-2/https_www_middorsetlibdems_org_uk_news_article_vikki-slade-elected-as-leader-of-bcp-council/content_34.html": "Vikki Slade elected as leader of BCP Council\nFollowing an incredible set of election results across the three towns, Councillor Vikki Slade has been elected to become the leader of BCP Council.\nWith 28 seats, the Lib Dems are the largest party on BCP Council and, as well as leading the council, Vikki is heading up the Three Towns Alliance - an alliance that includes the Christchurch Independents, Bournemouth Independents and Poole People. Together they hold 44 seats.\nThe Green Party are also loosely involved with a Confidence and Support Agreement which ensures that the council’s response to climate change and a review of the governance structure of the council is prioritised. These issues are already important to Councillor Slade and the Liberal Democrats, so they were pleased to confirm this and to indicate a range of additional measures to improve community involvement and environmental responsibility.\nDetails of the council’s new priorities will be shared over the next few weeks as the new team understands more about the financial constraints under which they will be working and considers how to prioritise new projects alongside the considerable workload that the council already has.\nCouncillor Slade said: “I am delighted and honoured to have been chosen to lead this council again. We live in a beautiful place with huge potential, but there is so much that needs to be done so that people and communities realise that potential.\n\"This administration will be based on the solid foundations of openness, transparency, accountability, honesty and integrity.”\nShe added: \"The council will be welcoming to everyone, with decisions that are explained, questions answered, a place where challenge and scrutiny is embraced and encouraged.\"\n“This means we’ll be prioritising the things that matter to you. We want you to have confidence in us to work with and for you, knowing that we’re on your side. We know that won’t happen overnight and we need to earn your trust.”\nThe Three Towns Alliance Cabinet is:\n• Cllr Millie Earl, Deputy Leader and Connected Communities (Liberal Democrat)\n• Cllr David Brown, Health and Wellbeing (Liberal Democrat)\n• Cllr Richard Burton, Children and Young People (Liberal Democrat)\n• Cllr Mike Cox, Finance (Liberal Democrat)\n• Cllr Andy Hadley, Climate Response, Environment and Energy (Poole People - Independent and local)\n• Cllr Jeff Hanna, Transformation and Resource (Liberal Democrat)\n• Cllr Andy Martin, Customer, Communications and Culture (Christchurch Independents)\n• Cllr Kieron Wilson, Housing, Planning and Regulation (Independent)"
}