{
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_article_your-vote-is-at-risk/content_34.html": "your vote is at risk\nThe Conservative Government is making it harder for you to vote. The new law passed in 2022 means that for the first time ever in the UK, you will not be allowed to vote if you don’t have the right type of ID, or you forget to take it with you. In the United States this sort of law is called “voter suppression” and it has been deliberately introduced to stop minorities from exercising their right to vote.\n“There is one easy action you can take right now to protect your vote,” says Cllr Nick Ireland, “get a postal vote!” It’s free and easy. A postal vote will guarantee you have your say. Your ballot paper arrives straight to your door and can be returned by Freepost in the weeks before an election. To sign up for postal votes, you can either complete a form online by following the link here. Alternatively you can download and fill in this form from the electoral commission and return it to your local electoral registration office. You can find you local electoral registration office here. The law on postal vote registration has changed. Please do not use the previous electoral commission forms as they will no longer be accepted.\nIf you would still like to vote in person but do not have one of the accepted forms of ID, you can apply for a Voter Authority Certificate. It is free and acts as a form of photo ID that is only valid when you vote.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_alex-fuhrmann/content_10.html": "Alex Fuhrmann\nWeymouth Town Council - Westham East\nOnce described by my teacher as “never going anywhere,” I’ve spent much of my adult life abroad, taking opportunities and fostering a love of the wider world. Through my passion of sport and travel, I have had the privilege to live in Sierra Leone, Arizona and also had stints studying and working across the United States where I met my beautiful wife.\nHaving settled back in Weymouth long term to have our family, I worked in film production and the music industry, finally becoming a primary school teacher in Westham and proud supporter of local sport. I spent many years developing Weymouth Basketball Club and more recently spearheaded the formation of the Dorset Basketball Association (serving as chair), providing local and county level competition for senior and junior age groups.\nI always wanted to run for local office and represent my community in a positive way. After years of watching (predominantly) retired, out of touch cllrs make decisions about our areas, I felt an urge to change the way in which the role of councillor could be fulfilled. In my role, I make efforts to fully engage with my community using positive initiatives. I also strive to develop a team ethos across all parties and personalities in the chamber, much for the betterment of all residents.\nNothing is plain sailing when you are engulfed by the vocation of serving your community, but I do my best whilst also having a young family and a professional work life. To quote David Brent in the office; If you want the rainbow, you've got to put up with the rain.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_gill-taylor/content_18.html": "Gill Taylor\nDorset council - Westham, Weymouth Town Council - Westham West\nI've lived in Weymouth in the same house for more than 40 years. I've been a Councillor for Weymouth and Portland Borough Council since 2008 and then for Dorset Council and Weymouth Town Council since they were formed in 2019. I am currently the Chair of the People and Health Scrutiny Committee which I really enjoy. Prior to that, I worked at Cefas in the Fish Health Inspectorate. I am married to Trefor and between us we have four children. I became a Councillor because I wanted to give something back to the community that I had lived in for many years and I wanted to help people. I love meeting residents and doing ward work and hopefully I make a difference to people's lives. My main hobbies are reading (always fiction), embroidery and doing puzzles.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_article_2023-autumn-conference-review/content_40.html": "2023 Autumn Conference Review\nAutumn conference 2023 was a sensation! I left feeling joyous about the democratic nature of the Liberal Democrats, of which I am a proud member, and overwhelmingly satisfied with the motions that were passed. The Liberal Democrats are buoyant and optimistic at all levels of the party. We are speaking with a consistent message of hope and a firm belief in evidence-based policies.\nThe Liberal Democrat Conference embodies all that is precious about democracy, rigorous debate that leads to the peaceful and non-coerced resolutions.\nI was particularly ecstatic about the ‘Investing in our Children’s Future’ motion, which was successfully passed.\nI am a full-time teacher in one of our local secondary schools and I know how important it is that the younger generations are empowered by a wide-ranging curriculum and are allowed to use their creativity to thrive.\nWe are calling on government to increase per-pupil funding above the rate of inflation each year and mental health provision to be enhanced by putting a dedicated and qualified mental health practitioner in every school. Our young people are suffering due to long-established poverty in certain areas of South Dorset. This is made worse by the cost-of-living crisis.\nThe Liberal Democrats will provide free school meals for all children in primary education and all secondary age children whose families receive Universal Credit. The motion will also\nlead to a broader curriculum which will embrace the creative minds of our young people, rather than create a population with narrow educational backgrounds and restricted creativity.\nLocal and national elections loom large, and we are confident that we can sweep up seats across the ‘blue wall’ through our community centred approach led by hard working councillors and MPs. Long-term conservative voters have lost faith in their party. The Liberal Democrats offer an alternative that respects the evidence of experts, and bases policies upon research, rather than merely seeking to provide soundbites for the press.\nThe Liberal Democrat membership has an extremely exciting year ahead!",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_focus/content_19.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_sign-up-for-updates-1-1/content_14.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_matt-bell_about-matt-bell/content_6.html": "Get to know your Parliamentary Candidate\nMatt Bell wants to champion the needs of the community in which he grew up, lives, teaches, and raises his family. Matt already fights for the needs of Dorset people every day as a councillor and activist on issues such as flooding, car parking, pharmacies and homes. He wants to continue to provide South Dorset with a listening ear and a strong voice, but this time in Westminster!\nMatt is a teacher in South Dorset and is also a keen cyclist and former Weymouth hockey player. He has been an active part of the community since his childhood. He has on-the-ground understanding of the needs and desires of the people of South Dorset due to his experiences as a resident, parent and education professional. Matt has been successful in pressing for real local change and reversing the damage done by the previously Conservative-led Council, most recently through campaigning for improved management of Radipole Lake, striving to address the pharmacy crisis on Portland and representing Weymouth in speeches and lobbying to address sky-rocketing parking charges in coastal areas of Dorset.\n“I am proud to call South Dorset my home and will strive to improve the lives of all residents. I’m standing to ensure we get an MP who is fighting for our area and putting local needs first.” – Matt Bell",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_matt-bell_contact/content_17.html": "Contact Matt\nGet in touch with your Lib Dem Parliamentary Candidate for South Dorset\nMatt is always keen to hear from local residents in South Dorset. His email is: mattbellsouthdorset@gmail.com\nPlease use email where possible and remember to include your full name, address and postcode.\nMatt is also very active on social media. To keep up to date with his election campaign, you can follow him on Facebook and Twitter.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_matt-bell/content_1.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_page-2/content_32.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk/content_25.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_person/content_26.html": "David Harris\nWeymouth Town Council - Westham North\nI have been a local councillor every year except 1 since 1993. I started representing Westham North on Weymouth and Portland Borough Council and stayed in this position until I was mayor in 2006/2007. Due to an illness I did not fight the election in that year but this gave me the chance to fight the DCC elections the following year when I gained the ward representing Westham West and Westham North in 2008 and stayed on the council until the re-organisation in 2019. I the last few years I was chairman of the audit and governance committee, the one committee the opposition were required to chair. After reorganisation I returned to Westham North and was elected to serve on the town council who elected me as its first leader as the Lib Dems are the biggest party.\nI am married to Jenny and have two grown up children, and have lived in Southill since 1990. I love gardening and walking.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_uk-lib-dem-news_page-3/content_12.html": "Making Britain a science superpower\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nThe UK needs to strengthen both our Armed Forces and our soft power.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_focus_march-2024-1/content_38.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_volunteer/content_4.html": "Get Involved\nHelp us make a difference in your community\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1-1/content_2.html": "Councillors Working For You\nDorset Councillors\nParish and Town Councillors\nDavid Civil - Lodmoor\nBeverly Day - Upwey and Broadwey\nLee Harmsworth - Westham East",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_page-1/content_37.html": "Lib Dem S.Dorset parliamentary candidate Matt Bell\nWEYMOUTH teacher Matt Bell has launched his bid to become South Dorset’s next MP\nWEYMOUTH teacher Matt Bell has launched his bid to become South Dorset’s next MP\nFind out what you can do here\nThe campaign to see a lake dredged after persistent flooding has received a boost as moves start being made to sort out the problem - and Dorset Council admit the area is its responsibility.\nA PROMISE to cut sky-high car park charges in Weymouth is the first priority for Dorset Council according to new leader Nick Ireland.\nMatt Bell's article on the flooding issues in South Dorset and the connection with reduced funding can be found in the latest issue of the Purbeck Gazette (pg23) here\nA talk with Colin Smart, Alasdair Moffett & Gary Jackson",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news/content_16.html": "Lib Dem S.Dorset parliamentary candidate Matt Bell\nWEYMOUTH teacher Matt Bell has launched his bid to become South Dorset’s next MP\nWEYMOUTH teacher Matt Bell has launched his bid to become South Dorset’s next MP\nFind out what you can do here\nThe campaign to see a lake dredged after persistent flooding has received a boost as moves start being made to sort out the problem - and Dorset Council admit the area is its responsibility.\nA PROMISE to cut sky-high car park charges in Weymouth is the first priority for Dorset Council according to new leader Nick Ireland.\nMatt Bell's article on the flooding issues in South Dorset and the connection with reduced funding can be found in the latest issue of the Purbeck Gazette (pg23) here\nA talk with Colin Smart, Alasdair Moffett & Gary Jackson",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_donate/content_8.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_search/content_21.html": "Louise Bown\nLouise Bown Louise Bown was born and brought up in Weymouth. She moved away aged 18 to go to university and then work, but the pull of the seaside brought her back aged 25. She has been happily…\nLouise Bown Louise Bown was born and brought up in Weymouth. She moved away aged 18 to go to university and then work, but the pull of the seaside brought her back aged 25. She has been happily…\nSimon Clifford Simon is chair of three charities helping elderly people, supporting unpaid carers and people with mental health issues. He was elected to Dorset Council and is Cabinet member…\nWEYMOUTH teacher Matt Bell has launched his bid to become South Dorset’s next MP\nThe campaign to see a lake dredged after persistent flooding has received a boost as moves start being made to sort out the problem - and Dorset Council admit the area is its responsibility.\nA PROMISE to cut sky-high car park charges in Weymouth is the first priority for Dorset Council according to new leader Nick Ireland.\nContact Matt Matt is always keen to hear from local residents in South Dorset. His email is: mattbellsouthdorset@gmail.com Please use email where possible and remember to include your full name,…\nMatt's Campaigns in action We are calling on the Government and Dorset Council to take action now to tackle Dorset’s housing crisis. The Liberal Democrats have a plan to make more homes available…\nGet to know your Parliamentary Candidate Get to know your Parliamentary Candidate Matt Bell wants to champion the needs of the community in which he grew up, lives, teaches, and raises his…",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_current-coucillors-h_david-northam/content_13.html": "David Northam\nWeymouth Town Council - Wey Valley\nI have lived in Weymouth since 1977 where I have worked as a teacher, engineer and business manager. I am married to Christine and have 2 children, now adults, who both went to school in Weymouth. I am a keen walker, birdwatcher and enjoy sports.\nI retired in 2019 and chose to run for Weymouth Town Council because I wanted to give Weymouth a stronger voice. Currently I am focusing on the Weymouth Neighbourhood plan as chair of the steering group. It has 4 councillors and 7 residents. This plan will provide a loud voice for residents to make Weymouth fit for future generations.\nI also helped get the Tumbledown project up and running. Tumbledown provides outdoor activities for many of our most vulnerable people through growing, harvesting and cooking produce for food and, in the process, learning social and life skills.\nI serve on the Planning and Licensing Committee as well as the Human Resources Committee.\nWeymouth is a wonderful place to live with good people, great climate, nature on the doorstep and a rich history. But like many sea-side towns the sunshine hides real problems with lack of job opportunity and access to affordable homes and social housing. I want to help make Weymouth a better place for all, especially the young.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_matt-bell/content_22.html": "Matt Bell\nWeymouth Town Council - Wey Valley\nMatt moved to Weymouth in his childhood and is very proud to call it home. Matt Bell was elected to Weymouth Town Council in 2022, after winning the Wey Valley Ward By-election.\nSince joining the council Matt has tried to be as proactive as possible, despite having two young children and being a full-time school teacher. He has taken on several roles including Sports and Activities Champion, Rights of Way Liaison Officer and Vice-chair of the Services Committee. Matt also sits on the Planning and Licensing Committee.\nMatt works as a secondary school teacher in his ward and aims to represent the views and needs of young people whenever possible. Matt is also passionate about sustainability and encouraging residents to be involved in activities that make the most of our amazing natural and built environment. Weymouth and South Dorset must be areas where people can thrive and prosper in glorious surroundings.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_current-coucillors-h-1_simon-clifford/content_7.html": "Simon Clifford\nSimon is chair of three charities helping elderly people, supporting unpaid carers and people with mental health issues.\nHe was elected to Dorset Council and is Cabinet member responsible for finance and is also a member of Weymouth Town Council.\nAs a long-standing journalist in newspapers, and Editor with the BBC for tv and radio, Simon has been on numerous political campaign trails across the country.\nSimon is delighted to be campaign manager for Matt Bell",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_article_important-planning-application-for-radipole/content_39.html": "Planning application (Passed): Zebra crossings for Radipole Park Drive\nOverview\nYesterday Weymouth Town Councillor Matt Bell proposed some important changes to Radipole Park Drive in a new planning application. It included five new zebra crossings that will improve safety for pedestrians needing to cross the road.\nThe application proposed that they be placed at major crossing points along the road:\n- At the end of the path from Coronation Crescent at the northern end of the community orchard.\n- Crossing the road at the entrance to the childrens climbing frame area and café.\n- Crossing the road next to the tennis club car park.\n- Crossing the road at the current path that enters the roadway through the hedge and meets the footbridge over the railway.\n- Crossing the road at the southern end of Radipole Gardens, alongside the Food Warehouse by Iceland.\nThe planning application has now been passed with an amendment that locations 1 and 2 be prioritised.\nYou can read the full planning application below.\nFull Planning Application\nRadipole Park Drive is a 40mph road leading into a residential area at the northern end and the town centre to the south. Along its path it passes a popular nature reserve, community orchard, playing fields, tennis club, public gardens, car parking, a busy retail and industrial area, and once developments are completed, playground, café, pétanque terrain and sensory garden. This is already a well-used amenity area, with footfall likely to increase after the upgrades are completed, particularly by elderly and young members of the community.\nThe road is currently flanked by a cycle path and pedestrian path on the opposite side to all amenities other than the nature reserve. This leads to many individuals and families crossing a 40mph with no assistance or safety measures. Groups of young people also cross the road without adult supervision and zebra crossings would ease concerns about safety. The hedgerows also frequently reduce visibility for pedestrians and hazard perception for drivers.\nWe would like to see zebra crossings added to all major crossing points.\n- At the end of the path from Coronation Crescent at the northern end of the community orchard.\n- Crossing the road at the entrance to the childrens climbing frame area and café.\n- Crossing the road next to the tennis club car park.\n- Crossing the road at the current path that enters the roadway through the hedge and meets the footbridge over the railway.\n- Crossing the road at the southern end of Radipole Gardens, alongside the Food Warehouse by Iceland.\nCllr Matt Bell\n10th September 2023",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_article_caring-for-our-rivers/content_29.html": "Caring For Our Rivers\nCome along to the caring for our rivers talk organised by the North Dorset Liberal Democrats on Thursday 16th November at Hawkers Farm Barn, Stour Row, SP8 5LZ, 7:00 for 7:30pm.\nThe talk will feature:\nColin Smart, Environmental Farmers Group\nAlasdair Moffett, Upper Axe Landscape recovery project\nGary Jackson, Thames Tideway\nTickets are from £5, please email ros@ndlibdems.com for tickets and more information",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_focus_miscalaneous_preston-winter-2023/content_35.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_uk-lib-dem-news/content_11.html": "Vote Liberal Democrat Today\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_focus_summer-2023_chickerell-summer-2023/content_36.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_focus_miscalaneous_crossways-osmington-owermoigne/content_33.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_ryan-hope/content_3.html": "Ryan Hope\nDorset Council - Westham, Weymouth Town Council - Westham East\nBeing only 20 years of age when I first stood for council, I was continually asked why I wanted to do it and why I was a Liberal Democrat. I joined the Liberal Democrats because they were the only political party I saw working for my community all year round (something that is still the case to this day). I wanted to stand up for our community and work to make it a better place. It was also important to me to ensure there was a young voice in local decision making.\nI was first elected to the Borough of Weymouth & Portland in May 2012. I served for 7 years (re-elected after 4 years) until May 2019 when the council ceased to exist as part of the local government reorganisation plans in Dorset. During my time in office with Weymouth & Portland Council, I represented the Westham North Ward and served on the council's Scrutiny & Policy committees.\nIn 2019 I was successfully elected to the new Dorset Council for the Westham Division along with fellow Liberal Democrat Councillor Gill Taylor where I currently serve on the Place & Resources overview committee.\nI was also elected in 2019 to the new Town Council in the Westham East Ward along with Councillor Alex Fuhrman where I have served on the HR, Finance & Governance and Environment & Services committees of which I am currently the Chairman of.\nAway from the council chamber I’m a 31 years old, Father of 2 children and 1 puppy called Rocket who many of my residents will know from our walks.\nI support many community organisations working both in Westham such as Westham Community Group and Friends of the Marsh and Weymouth as well as charities further afield.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_current-coucillors-h-1_louise-bown/content_23.html": "Louise Bown\nLouise Bown was born and brought up in Weymouth. She moved away aged 18 to go to university and then work, but the pull of the seaside brought her back aged 25. She has been happily living here ever since. She raised a family in Weymouth and has worked at Weymouth College and local schools.\nLouise became a councillor on Dorset Council and Weymouth Town Council in May 2024. For Dorset Council, Louise is vice chair of the Licensing Committee and sits on the Dorset Police and Crime Panel, the Appeals Committee and The People and Health Overview Committee.\nOn Weymouth Town Council, Louise is vice chair of Human Resources Committee and she sits on the Environment and Services Committee. She also sits on the Climate and Ecological Emergency Working Group.\nLouise has been trade union rep in at Weymouth College and at Poole High School and she enjoyed being able to give people a voice. She continues to represent people, for example by working with residents and council officers to find a safe way for school children to cross at Wessex Roundabout.\nShe swims in the sea year round and plays skittles for a local team. Louise loves her home town and knows how lucky she is to love on the Jurassic Coast.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_values/content_24.html": "What we stand for\nThe Liberal Democrats exist to build and safeguard a fair, free and open society, in which we seek to balance the fundamental values of liberty, equality and community, and in which no-one shall be enslaved by poverty, ignorance or conformity.\nPreamble to the Liberal Democrat Constitution\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nLiberty\nWe believe in the right of individuals to make their own decisions about how they live their lives, as long as they do not cause harm to others.\nOur aim is to empower and support individuals to pursue their dreams, to make the most of their talents and to live their lives as they wish.\nEquality\nWe stand by the idea that without equality, true liberty cannot be realised.\nThis requires an active state to: ensure that no one is held back by poverty, poor health, or discrimination, including on the basis of personal characteristics or beliefs; provide access to education or training, and other public services, including a welfare safety net; and guarantee that everyone enjoys equality before the law.\nDemocracy\nWe understand that through democracy, every citizen is empowered to make their voice heard, without being dominated by entrenched interests or the power of money; checks and balances, so that those in power cannot abuse their positions for personal gain or political advantage; and a plurality of views, where no individual or organisation is deterred from speaking truth to power.\nCommunity\nWe believe it is important to provide support for a diverse range of organisations that enable individuals to join together in the pursuit of common goals or activities; and the decentralisation of political and economic power to local government and the nations and regions of the UK.\nHuman Rights\nProviding, defending and promoting equal legal rights for everyone to pursue their lives according to their abilities, wishes and means, with no discrimination on the basis of religion or belief, gender, sexuality, age, ethnicity, disability, or minority status in their country of birth or permanent residency is highly important to us.\nInternationalism\nWe support a fairer and more equal, tolerant and connected world and collaboration with the UK's neighbours - including, ultimately, rejoining the EU - in guaranteeing peace and security, tackling the climate and nature emergencies, standing up to corporate power and spreading prosperity around the world.\nEnvironmentalism\nWe value the importance of acting at home and internationally to promote environmentally sustainable means of production and consumption and living in harmony with nature.\nOur policies\nLearn more about the influence these values have on Liberal Democrat policy",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_contact-1-1/content_9.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_matt-bell_matts-campaigns/content_27.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_uk-lib-dem-news_page-1/content_30.html": "Vote Liberal Democrat Today\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_nick-ireland/content_5.html": "Nick Ireland\nDorset Council - Crossways, Osmington Parish council\nI became interested in politics in 1981 whilst studying for my History ‘O’ level in Liverpool. We were given coursework to follow the foundation of the SDP and the ‘Gang of Four’ over a four week period. At the time it was a seismic shakeup of GB politics - I was hooked.\nAfter University, politics sat on the back-burner. I concentrated on local, apolitical community issues, joining Osmington Parish Council in 2009. In 2015, a friend asked me to stand with her for West Dorset District Council. We both lost narrowly but I was hooked (again). Then, in 2017, I was elected to the Linden Lea Division of Dorset County Council.\nIn 2019, Dorset became a Unitary authority and I was elected to the new Crossways Ward of Dorset Council. Since 2018, I’ve had the honour and privilege to lead the Liberal Democrat group. I stood in the 2019 General Election for the South Dorset Parliamentary Seat. The Lib Dem vote doubled in the process.\nI am very interested in health and wellbeing, sitting on the Health Scrutiny Committee (now People & Health Scrutiny) and also being a Governor of Dorset Healthcare NHS Trust. I’ve also sat on the West & South Planning Committee since 2019, along with numerous other roles.\nI work fulltime as a Software Engineer and live with my wife Liz and dog Roo. We have three adult children, none of whom can afford to live in Dorset! My interests revolve around music and sports, especially swimming (I’ve swum across the English Channel). I also enjoy running and cycling.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_news_focus_january-2024/content_28.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_uk-lib-dem-news_page-2/content_20.html": "Animal Welfare in the Food System\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_our-team-1_current-coucillors-h_tim-young/content_15.html": "Tim Young\nWeymouth Town Council - Westham West\nI am married to a retired nurse. We moved to Weymouth in 1994, and have 2 adult daughters, who both went to local Weymouth schools.\nI retired as a teacher in 2020, although I have since returned to work part time, in order to support Budmouth Academy. Teaching has been a second career, having worked previously as a Software Engineer, for local companies, and prior to that for several large organisations in Manchester. I was elected as Councillor for Westham West in 2022.",
  "https_www_sdlibdems_org_uk_matt-bell/https_www_sdlibdems_org_uk_uk-lib-dem-news_page-4/content_31.html": "Ed Davey marks Holocaust Memorial Day 2025\nToday is Holocaust Memorial Day.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.\nNo child should ever have to experience sexual abuse. These are horrifying crimes that cause so much harm to the children who are victims. We will keep up the pressure so that the action needed to make our communities safe all children finally happens."
}