{
  "https_www_englandcalling_co_uk_/https_www_englandcalling_co_uk_introduction/content_3.html": "Introduction\nCampaign For England's Independence\nThe founder of The English Democrats is Robin Tilbrook, top solicitor and legal campaigner, whose aim is to bring about nothing less than England's independence from the United Kingdom, and stop the takeover of England by world government bodies such as UN, WEF, WHO, ECHR and NATO.\nThe UK is selling us and the other nations within the UK out, England to be divided up into eleven separate statelets in the world government plan.\nThe only way to re-establish England and save the rights of English people, is to take back our country from UK.\nThis can come about in the following manner.\nOur rights as English people were guaranteed to us in the Act Of Union in 1707, and legally UK has broken all the agreements and terms legislated, rendering the Union liable to be nullified through legal challenge.\nThere will not be a judge willing to order the re-establishment of England and English Independence, whatever the legal rights and wrongs of the case.\nPolitically there will have to be a referendum.\nThis can be funded with public money with two sides battling to win - a YES and a NO vote, or IN versus OUT. And the vote must be won, despite all the big money placed to keep England locked inside the restraints of UK and its subservience to UN WHO WEF and others, the world government bodies.\nThe 2018 UN Migration Pact has handed control over UK borders to the UN bringing in millions of immigrants and giving them priority over English people. WEF is destroying our farmers and steel industries. WHO is establishing worldwide totalitarian powers through stealth, and NATO is preparing to drag our menfolk off to a European War.\nTo block all these threats and many more, we have to reverse direction within the UK. But as the monarch is a key advocate of the world government agenda, and the political system and the judiciary so corrupted and politicised, the only objective that will save our people would be to end UK, and lapse all the illegal treaties.\nThe campaign for English Independence must launch and win a referendum.\nThe English Democrats are the only party campaigning for a Peace agenda, whereas all others want mobilisation of the armed forces and do not show any opposition to their deployment to other European countries, including Ukraine. We seek peace through negotiation and an end to the sanctions which are bringing endless war, and driving living costs through the roof.",
  "https_www_englandcalling_co_uk_/https_www_englandcalling_co_uk_membership/content_2.html": "MEMBERSHIP\nJoin us today and show your support for England. We have two membership levels avaialble. We welcome you on-board whichever one you chose.\nShow:\nSort By:",
  "https_www_englandcalling_co_uk_/https_www_englandcalling_co_uk/content_1.html": "English Independence - Are You Ready?\nThis man certainly is ready.Join him.\nOur country burns.\nWe need to get free and start over.\nThe Teds are the only party that represents England and the English.\nThe champion of free speech, and opponent of woke agendas, this time he's not joking.\nIndependence for Johnnie and all of us.\nIt's the only way to go.\nSave our country. Save our rights.\nYou may have taken me but you will never take England! Not as long as I have breath in my body or a bullet in my gun! Johnnie English 2003.\nEngland's Only Chance Of Survival\nPutin says Russia will respond against missiles with missiles.\nFair enough, Mr Starmer.\nThe NATO missile attack against the operational Kursk command centre of Group Of Forces North caused fatalities and injuries among security and services staff, according to Putin. The command centre itself was not hit. Up to 12 Storm Shadow missiles were used. HIMARS were also used. They were either jammed or intercepted, failed to knock out the command centre, but did cause casualties.\nThe retaliation strike against NATO's missiles being fired against Russia was a test of a new ballistic missile on the vast industrial zone of Dniepopetrovsk.\nRussia has committed not to employ such weapons except in reply to aggressive missile attacks against Russia.\nSystems like Oreshnik will be used against countries manufacturing and supplying missiles to Ukraine to use against Russia.\nStarmer clearly wants Britain to be top of that list.\nPolitics in Britain has to prioritise peace negotiation, and end supplying of missiles to Ukraine and NATO.\nWhich Main parties in the UK are offering peace negotiations?\nThere are none. Zero. Zilch.\nReform? The same. No mention of negotiating with Russia.\nThe only party offering to prioritise peace negotiations with Russia are The Teds. The English Democrats.\nStability. The Rule Of Law. Peace.\nAnyone wanting to stop nuclear war, and the destruction of the lives of millions, have only one destination. This is it.\nWhy is England Not A Nation?\nENGLISH VOICE\nJAN 09, 2025\nOr how devolution can make or destroy a Nation\nI had no idea when I started writing this series on regionalisation that it would prove to be such a quagmire of deceit and betrayal against the people of England. England has consistently been betrayed and ‘sold’ to those who want to eliminate her. Strong words but the facts led me to determine that this conclusion has some merit.\nThe latest nail in England’s coffin is the Starmer regime’s acceleration of the development of Metro Mayors; and the creation of the Council for `Nations and Regions. In this piece I will explain what the Council for nation and regions is and why it is another threat to England as a nation state.\nOrigins\nThe Council has its origins in Gordon Brown’s report on the future of the UK which recommended ‘a new and powerful institution to drive co-operation between all its governments – a Council of the Nations and Regions.’ John Denham was critical of Brown for not being radical enough but Denham also warned that ‘Labour in government is usually less radical than in opposition’.\nBrown wanted the Council of Nations and Regions based in statute, with an independent secretariat. It was to be part of a series of constitutional changes, including stronger legal protection for the devolved parliaments, the replacement of the Lords with a union-wide second chamber, a new Council of England to represent English mayors and local government, and a new body to bring together the First Ministers with the UK Prime Minister.\nReality\nToday’s Council was reportedly set up without even informing the Scottish government and will, it seems, be run out of Whitehall’s Cabinet Office.(Formerly under. the oversight of Sue Gray) The King’s Speech contained no proposals to give the CNR (Council for Nations and Regions) legal status and the rest of Brown’s proposals have, for now at least, disappeared.\nFar from being at the heart of a refreshed four nation union in which deeper devolution goes alongside stronger cooperation, today’s CNR is an odd-looking body.\nChaired by the UK Prime Minister, it brings together the First Ministers of Scotland ,Wales and Northern Ireland (and NI’s Deputy First Minister) with England’s twelve directly elected mayors.\nPower imbalance\nYet First Ministers and English Mayors have vastly different powers and sources of authority. The First Ministers are chosen through national parliamentary elections and are responsible for nearly all domestic policy in the devolved nations. Their powers are devolved by statute, and they are responsible for huge budgets (£60bn in the case of Scotland).\nEven the most powerful of England’s mayors has a budget smaller than some large English councils and has few powers devolved by right. Indeed, the total spending power devolved to all England’s mayors at the end of the last financial year was just £2.6bn.\nTony Blair’s meddling\nTony Blair did not endear himself to Welsh Labour when he likened the newly established Welsh Assembly to a parish council. It remains to be seen how keen the elected leaders of the devolved administrations will be at being lumped together with relatively minor players in the governance of England.\nThe SNP are already asking why Scotland’s major cities are not included. National leaders will surely want a stronger and more focussed collaboration with the UK government. The UK government will need it too: Labour’s missions are UK wide, but they can’t be run from London.\nEngland’s Mayors Welcome this\nEngland’s mayors have welcomed their seat at the table. The last Government forced directly mayors on any worthwhile devolution ‘deal’ but it never wanted to give them a collective voice. Has Keir Starmer now done that? I leave you to decide.\nMuch of England’s local government south of the Severn-Wash line (covering many newly elected Labour MPs ) has so far rejected the idea of mayors. This makes the mayoral map decidedly skewed. As important, not even the most advanced Mayoral Combined Authorities have anything like the powers and resources needed to achieve growth, build homes and play their part in the other missions.( Everything is a Mission to the Starmer regime).\nAnd finally\nSo there we have it. This looks like another of Labour’s half hearted initiatives. (now called missions) It’s underfunded and carried out without any consultation. Note the reaction of Scotland who were not informed of this NCR being set up. But the problems is that all these issues will only worsen with time and it is England and her people who will suffer.\nA word to my readers\nIf you like this and want to know more about things English here are some recommended sub stacks and websites.\nMembership Secretary, English Democrats\nCampaign for an English Parliament - a campaigning group working for a proper voice for England\nThe English Democrats Party - the only political party that represents the people of England\nThe Responsible Rebel on substack (views on English issues)\nCampaign For England's Independence\nThe founder of The English Democrats is Robin Tilbrook, top solicitor and legal campaigner, whose aim is to bring about nothing less than England's independence from the United Kingdom, and stop the takeover of England by world government bodies such as UN, WEF, WHO, ECHR and NATO.\nThe UK is selling us and the other nations within the UK out, England to be divided up into eleven separate statelets in the world government plan.\nThe only way to re-establish England and save the rights of English people, is to take back our country from UK.\nThis can come about in the following manner.\nOur rights as English people were guaranteed to us in the Act Of Union in 1707, and legally UK has broken all the agreements and terms legislated, rendering the Union liable to be nullified through legal challenge.\nThere will not be a judge willing to order the re-establishment of England and English Independence, whatever the legal rights and wrongs of the case.\nPolitically there will have to be a referendum.\nThis can be funded with public money with two sides battling to win - a YES and a NO vote, or IN versus OUT. And the vote must be won, despite all the big money placed to keep England locked inside the restraints of UK and its subservience to UN WHO WEF and others, the world government bodies.\nThe 2018 UN Migration Pact has handed control over UK borders to the UN bringing in millions of immigrants and giving them priority over English people. WEF is destroying our farmers and steel industries."
}