{
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_post_candidate-announced-19-10-2021/content_8.html": "Candidate Announced 19/10/2021Paul GannonOct 19, 20211 min readWe are pleased to announce a new candidate for Bolton For Change. Click the link below or take a look at the CANDIDATES page on the menu.Laura Armstrong - Bromley Cross",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_post_bolton-for-change-reform-uk/content_5.html": "Reform UK and Bolton For Change\n- Paul Gannon\n- Nov 21, 2021\n- 2 min read\nUpdated: Dec 6, 2021\nDear Constituent,\nI would like to take this time to introduce ourselves and tell you a little bit about who we are and our aims. Reform UK and Bolton For Change are two newly formed political parties that derived from dissatisfaction at both national and local levels. The last few years have been hard for the majority of us, we have seen a rise in foodbanks, unemployment, homelessness, we have watched the erosion of our health services, access to GPs and more and more loss of our rights. I think we can agree change in administration and reform is needed. We are on our knees.\nTrevor Jones has lived in Bolton all his life, was disheartened with the rundown of his town, watching the poverty get wider, along with no political will for change. Trevor first walked into politics in 2016 - this is not a political career for Trevor. He is passionate about his town and people which is why he started Bolton for Change. Reform UK was created with the same philosophies and passion for change. We cannot keep jumping from Tory to Labour, when each is as bad as the other, there has to be a third alternative if we want change.\nBolton For Change and Reform UK believe that by cross party working we can be a force to be reckoned with and with your support we can have a voice at both local and national level.\nThe next election is May 2022 and we are hoping to have as many candidates as possible, but for that we need you. If like us you are sick and tired of the old regime, then please come forward and stand with us as a candidate, be part of a passionate team that is willing to fight for change.\nThank you for taking the time to read this, Bolton For Change and Reform UK look forward to your support.",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_post_candidates-link-now-live/content_7.html": "Candidates link now LivePaul GannonApr 14, 20221 min readCandidate pages have now been published. Please keep an eye on them for updates.",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org/content_2.html": "ABOUT\n'Introducing a political party for the people of Bolton'\nOur town has lots of problems, and the hard-working people in our town deserve so much better.\nFor far too long nothing has improved, in fact, at times, it feels as if we have gone backwards.\nThe proud people of Bolton are tired of what our Town has become, and the way in which it has been failed\nby representatives of the existing, tired, outdated and out of touch national political offering.\nThese representatives have been controlled by their parties and have often put their national party’s\ninterests and ideologies before that of the people they were elected to represent.\nThere comes a time when you have to say 'Enough Is Enough'.\nThe only way to improve things is to change things.\nThat is why we have formed:\nBOLTON FOR CHANGE\nA local political party, to truly represent and serve the people of Bolton.\nCONTACT\nBOLTON FOR CHANGE\n703 Tonge Moor Road\nBolton\nBL2 3BW",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_about/content_9.html": "ABOUT\nContinuation:\nBolton For Change is registered as a political party with the Electoral Commission PP11460.\nAlthough initially set up by two former candidates of the Brexit party, Bolton For Change is not an extension, it is a fresh start, a Local party focusing on Local Issues.\nWith Brexit almost done, and with the Labour party on life support after turning their backs on their once grassroots voters, many people feel politically homeless.\nBolton For Change now offers you a ‘New’ political home, a real alternative, without labels, Leaver, Remainer does not matter as-long-as you are 100% committed to improving Bolton.\nInitially, we had hoped to put up candidates in at least 14 of the 20 wards up for grabs at the next Local council Election, however, with the amount of interest that we have already received from both possible candidates and supporters, it may be possible to field a candidate within each ward.\nThree sitting Councillors have also shown interest in joining us.\nIf you would like to join us or would like further information, please get in touch with our Team via the contact information on this website.\nMission Statement\nAMBITION - OPPORTUNITIES - SUPPORT\nThe ‘’Bolton for Change’’ Party has been set up to promote the interests of the people of Bolton both at local and national level.\nWe want our voice to be heard, and to make real change within our town which benefits all members of our community.\nWhile we must support those most vulnerable within our community, we must also provide them with the tools and opportunities to improve their own lives.\nImprovements to our local infrastructure are key to a brighter future for our Town, as it will provide critical support for our local economy, unlock our potential, and enabling residents to access new education, skills, and work opportunities.\nTogether, we have the power to inspire AMBITION, by providing OPPORTUNITIES and SUPPORT for everyone with our community.\nCONTACT\nBOLTON FOR CHANGE\n703 Tonge Moor Road\nBolton\nBL2 3BW",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_blog/content_3.html": "top of page\nHOME\nABOUT\nBLOGS\nGET INVOLVED\nMore\nUse tab to navigate through the menu items.\nCampaign Updates and Community News\nCandidates link now Live\nCandidate pages have now been published. Please keep an eye on them for updates.\n1 min read\nReform UK and Bolton For Change meeting\nWe are having a joint Party meeting on Thursday 16th December at 7pm. We look forward to seeing you there. All welcome. We have loads to...\n1 min read\nReform UK and Bolton For Change\nDear Constituent, I would like to take this time to introduce ourselves and tell you a little bit about who we are and our aims. Reform...\n2 min read\nCandidate Announced 19/10/2021\nWe are pleased to announce a new candidate for Bolton For Change. Click the link below or take a look at the CANDIDATES page on the...\n1 min read\nCONTACT\nBOLTON FOR CHANGE\n703 Tonge Moor Road\nBolton\nBL2 3BW\n07798 724440\nEmail:\nboltonforchange@gmail.com\nbottom of page",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_get-involved/content_4.html": "JOIN US\nThere are currently no paid employees within Bolton For Change, and we rely solely on the goodwill and enthusiasm of all our members in every activity we undertake.\nEvery volunteer plays a vital role within the party as we move forward and are vital to ensuring our success at the Local Elections.\nThe future of Bolton For Change is in the hands of our members, so no matter how little or how much time you can spare, it will be greatly appreciated.\nJust a few of the different ways to Get Involved:\nLeafleter\nAs a Leafleter, you would be responsible for an area of residential addresses and would undertake hand deliveries of the Party’s campaign literature. This will, where possible, be within your local area!\nCampaign Days\nWe will be holding Campaign Days throughout Bolton. You will be part of a small team manning a Street Stall, handing out literature and engaging with members of the public within our community!\nCanvasser\nCanvassing is a particularly important part of any campaign and allows us to gain vital information about the electorate’s voting intentions, worries and concerns, etc. This information enables us to campaign effectively and gives us the opportunity to engage one to one with our voters. Canvassing will be carried out in pairs and training and support will be given!\nLet us know how you would like to get involved, tell us about any of your skills which could be utilised by the Party, etc, and a member of our team will get in contact with you as soon as possible.\nThank You in Advance\nKind regards\nTrevor Jones\nParty Leader\nCONTACT\nBOLTON FOR CHANGE\n703 Tonge Moor Road\nBolton\nBL2 3BW",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_post_reform-uk-and-bolton-for-change-meeting/content_6.html": "Reform UK and Bolton For Change meeting\n- Paul Gannon\n- Dec 5, 2021\n- 1 min read\nWe are having a joint Party meeting on Thursday 16th December at 7pm.\nWe look forward to seeing you there.\nAll welcome.\nWe have loads to discuss.\nFarnworth Cricket Club. Lavender Road, Farnworth, Bolton BL4 0EA",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_bromley-cross/content_10.html": "top of page\nHOME\nABOUT\nBLOGS\nGET INVOLVED\nMore\nUse tab to navigate through the menu items.\nBromley Cross\n.\nCONTACT\nBOLTON FOR CHANGE\n703 Tonge Moor Road\nBolton\nBL2 3BW\n07798 724440\nEmail:\nboltonforchange@gmail.com\nbottom of page",
  "https_www_boltonforchange_org_little-lever-darcy-lever/https_www_boltonforchange_org_little-lever-darcy-lever/content_1.html": "top of page\nHOME\nABOUT\nBLOGS\nGET INVOLVED\nMore\nUse tab to navigate through the menu items.\nLittle Lever and Darcy Lever\n.\nCONTACT\nBOLTON FOR CHANGE\n703 Tonge Moor Road\nBolton\nBL2 3BW\n07798 724440\nEmail:\nboltonforchange@gmail.com\nbottom of page"
}