{
  "https_www_steveyemm_com/https_www_steveyemm_com/content_1.html": "A fresh start for Mansfield:\nI have a plan to give Mansfield and Warsop a fresh start with Labour. My plan is focused on the issues that local people have raised with me. I want to be a full time MP you can be proud of, one who gets things done here and who stands up for you on the issues that matter most.\nFrom being a child growing up in Mansfield, to becoming a senior manager in technology and life sciences companies – it’s clear to me that Labour in government must deliver real change in our Mansfield community that impacts prosperity and well-being for every one of us that call Mansfield home.\nAt the coming election you have the power to change our area and our country by voting for change and a new Labour government with me as your hard working, local, full time MP.\nProvide a stable & growing economy with good quality jobs for everyone in Mansfield.\nI grew up here and will make it happen: Skills and opportunities for everyone building on the success of West Notts College, promoting strong inward private sector investment using my experience as an international business leader, and getting real ground-breaking improvements in local rail, road and bus transport infrastructure and access.\nRebuild the NHS, cut waiting times and make it fit for the future.\nMy wife works in the NHS locally – I know that our NHS staff do an amazing job – and that I will fight every day to get the NHS back on its feet with shorter waiting times, better access to GPs and primary care and an end to the 8AM call scramble, and rebuilding NHS dentistry in Mansfield.\nFix our broken housing market & build affordable homes for buyers & renters.\nMy own family understand only too well the challenges faced buying and renting a home in Mansfield – it will be my mission to make sure we build more affordable homes for people to buy and rent. I will make sure that local landlords are held to account on fair treatment of tenants and improved standards of property maintenance.\nTake back our streets & town centre. Crackdown on crime with more police.\nI have shopped in our town centre since I was a kid – I share all of our aspirations to build on recent regeneration initiatives and I will go much further – making sure our town centre visitors feel safe and secure with improved community policing and PCSO support, reform of business rates and powers for the council to reopen boarded up shops.\nFix our roads with a better funding deal from Westminster.\nI live here and drive on our roads and I will make sure that our highways authority Notts. County Council ends short term repairs and moves to a high-quality approach to road maintenance and fixing potholes in Mansfield and ensure that we get a long term ten year settlement for proper finance for our roads."
}