{
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns_immigration-survey/content_11.html": "You want to cut net immigration and stop the boats. And so do we. But I want your views on our plan to do it.\nWe are taking more robust action than an other Government before.\nThat's why we've introduced, and are introducing, new laws to reduce the numbers coming to Britain.\nSo tell me your views on our new immigration legislation, so you can have your say in shaping the UK's immigration policy.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns_relocate-staveley-pavilion/content_6.html": "Chesterfield's Labour Council want to build the Pavilion Building near Market Place.\nHowever, I think this is the wrong site. It will block the market square off from the main road so passers-by will not be able to see any of the events which are being put on, or the recently relaunched Staveley Market on Saturday.\nTell me your views as to where you think the Staveley Pavilion should be located by completing this short survey.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns_improving-our-healthcare-services/content_7.html": "Thousands of residents responded to my last survey demanding better access to healthcare. So we secured £24 million for the new urgent and emergency care department at Royal Chesterfield Hospital, helping to cut waiting lists. Next, we'll work with GPs to increase home visits - so vulnerable residents can access high quality healthcare.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns/content_4.html": "Chesterfield Town Centre Survey Under Labour Councils and Labour MPs, Chesterfield's once great historic Market and Town Centre is dying. Our Town Centre should be thriving. It's the gateway...\nScrap Labour's Green Bin Tax! Chesterfield Labour have voted for a £40 annual tax on your Green bin. Yet the Labour Councillors voted to increase their own allowances by nearly 15% just a...\nChesterfield Bus Survey Cancelled buses. Ongoing unreliability. Limited services. I’ve seen for myself how unreliable buses are here in Chesterfield. When I’ve been knocking on doors...\nImmigration Survey You want to cut net immigration and stop the boats. And so do we. But I want your views on our plan to do it. We are taking more robust action than an other...\nA Christmas Market For Chesterfield! Chesterfield is a historic Market Town. It's on the edge of the Peak District. Yet it doesn't have a Christmas Market. Central to Our Plan for Chesterfield is...\nRe-Open Staveley High Street The one way system has closed off Staveley High Street. It has affected businesses and local traders on Staveley Market. Together, we can re-open Staveley High...\nHow Would You Spend The £20 Million Of Government Investment For Chesterfield? Earlier this month, it was announced that Chesterfield has been awarded a further £20 million in Levelling Up funding for the Government for our Town Centre...\nRelocate Staveley Pavilion Chesterfield's Labour Council want to build the Pavilion Building near Market Place. However, I think this is the wrong site. It will block the market square...\nBuild The Chesterfield-Staveley By-Pass The Chesterfield-Staveley by-pass has been in the works for 90 years. Recently, the Conservative Government funded detailed work to build a business case for...\nLink Ravenside To The Market Ravenside is disconnected From Chesterfield Market. Join my campaign to connect Ravenside To Chesterfield Market - so we can get more people to shop in our Town...\nBring Back The Motorfest Together, we can bring back the Motorfestival to Chesterfield after the Labour Council cancelled it - so we can help Save Our Town Centre!\n2 Hours Free Parking For Chesterfield Let's Save Our Town Centre by making it more affordable to visit Chesterfield. So join my campaign for 2 hours free parking!",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_news_another-ps20-million-government-investment-chesterfield/content_15.html": "Prospective MP Ben Flook has welcomed the news that Chesterfield has been awarded £20 million in funds to help regenerate it's town centre. This comes off the back of an initial £20 million of investment in Chesterfield in 2021, and £25 million for Staveley as part of the Government's Town Deals Fund.\nThe specific details on this fund will be announced in the coming months but, broadly, the £20 million is a ten-year ‘endowment style’ fund. It will now be down to Chesterfield Borough Council to put together a plan.\nThis is just the latest in a long line of examples where levelling up is really happening all across Chesterfield and Staveley:\n- £25 million for Staveley regeneration through the Town Deal\n- The new A&E at the Royal Hospital opened earlier this year\n- The new Hartington unit for mental health at the Royal which is now under construction\n- The first tranche of £20 million for Chesterfield town centre awarded a year or so ago\n- The continuing regeneration of Chesterfield Canal\n- The business case for the Chesterfield-Staveley by-pass\nThis is Levelling Up in action - by helping to create local, skilled jobs - as well as boosting tourism for our area.\nLet Ben Flook know, below, how you would spend the new £20 million for Chesterfield to save our Town Centre.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_news_ben-flook-backs-local-apprenticeships/content_16.html": "As part of his campaign to support local apprenticeships, Ben Flook was delighted to visit Learning Curve's Hair and Beauty Chesterfield Academy this week, to meet Directors and students.\nBen enjoyed discussing the growth of courses at Chesterfield Academy with Learner Recruitment Officer, Helen Bradshaw, and plans to continuing the growth of Chesterfield Academy with local community groups.\nBen also received a treatment from second year beauty students - so pupils could put their learning into practice!\nUpon visiting Chesterfield Academy, Ben said:\nIt was wonderful to speak to so many students and to Helen about their exciting plans for the future. Having been a teacher, supporting apprenticeships is vital to grow our skills base locally. I am delighted that the Government has invested £3.8 billion more into further education and skills - and is providing £1,000 payments to employers and providers when they take on apprentices. It is also good news that the Government has increased the apprentice national minimum wage, having accepted the Low Pay Commission's report in full.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_myplan/content_12.html": "For almost all of the last 85 years, Chesterfield has had a Labour MP and a Labour Council. Local people tell me that Labour have taken our Town for granted - and have done nothing to reverse its decline.\nAs a state school teacher, I know some of the challenges that people are facing.\nI want to work with local people and businesses on Our 6 Point Plan to revive Chesterfield after decades of neglect by Labour MPs and the Labour Council.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns_scrap-labours-green-bin-tax/content_5.html": "Chesterfield Labour have voted for a £40 annual tax on your Green bin.\nYet the Labour Councillors voted to increase their own allowances by nearly 15% just a few weeks ago.\nLet me know what you think, by completing this short survey. Together we will work together to axe Labour's Green Bin Tax!",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_cdn-cgi_l_email-protection/content_17.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_contact/content_2.html": "Skip to main content\nMain navigation\nHome\nAbout Ben\nNews\nMy Plan for Chesterfield\nCampaigns\nChesterfield Survey\nContact\nContact\nLeave this field blank\n[email protected]\nBen on Facebook\nBen on Twitter\nBen on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns_chesterfield-town-centre-survey/content_10.html": "Under Labour Councils and Labour MPs, Chesterfield's once great historic Market and Town Centre is dying.\nOur Town Centre should be thriving. It's the gateway to the Peak District. There's tourist attractions all around us. And so much history to our Town.\nBut decades of Labour MPs and Labour Councils have watched our Town Centre decline.\nBut as your Prospective MP, I want to work with you to change that.\nLike you, I want to make sure our local businesses and market traders have the support they need to thrive.\nAnd ensure shoppers are encouraged to come to our Town Centre - not priced out through car parking like they are at the moment.\nSo I'm asking for your views - so we can work together to save Chesterfield Town Centre.\nLet me know what action you want to see - so we can restore our great historic Market Town.\nThe Government have invested £40 million from the Levelling Up fund to help deliver projects - but we need to make sure the Labour Council spend it wisely.\nOnce I have all the surveys back, I’ll study the results with my team to get action on our shared priorities.\nThank you for helping to restore Chesterfield Town Centre.\nBen Flook\nProspective Conservative MP For Chesterfield",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk/content_1.html": "I'm Ben Flook, Prospective MP for Chesterfield. Since 2019, the Conservatives have invested £65 million in Chesterfield and Staveley; opened a new A&E at the Royal, a new community diagnostic centre and a new Mental Health Unit. We're getting the job done for Chesterfield.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_news_ben-flook-launches-campaign-2-hours-free-parking/content_14.html": "As part of his campaign to Save Chesterfield Town Centre, Ben Flook has launched his campaign for 2 hours free parking to Save Chesterfield Town Centre.\nAt present, free parking is only available at restricted times. Local businesses have told Ben Flook that this doesn't help their businesses - as we instead need to attract people during peak hours.\nWorking with local market traders and business owners, Ben wants to bring in more people to our Town Centre - so we can help local businesses and create local jobs.\nSpeaking about his campaign, Ben said:\nAs part of my campaign to Save Chesterfield Town Centre, I want to bring 2 hours free parking to Chesterfield - to make visiting our Town more affordable for local people. That way, we can help local businesses.",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns_2-hours-free-parking-chesterfield/content_8.html": "Tweet Let's Save Our Town Centre by making it more affordable to visit Chesterfield. So join my campaign for 2 hours free parking! Two Hours Free Parking Current Two Hours Free Parking Campaign Your Views Get involved Your details Leave this field blank Do you agree that Chesterfield Town Centre is in decline? Yes No Unsure Do you support Ben Flook's campaign for 2 Hours Free Parking in Chesterfield? Yes No Unsure How satisfied are you with the services being provided by Chesterfield Borough Council?",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_campaigns_link-ravenside-market/content_3.html": "Ravenside is disconnected From Chesterfield Market. Join my campaign to connect Ravenside To Chesterfield Market - so we can get more people to shop in our Town Centre!\nRavenside is disconnected From Chesterfield Market. Join my campaign to connect Ravenside To Chesterfield Market - so we can get more people to shop in our Town Centre!",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_news/content_13.html": "Ben Flook calls for St. George's Day To Be A Bank Holiday Monday, 8 April, 2024 Prospective MP For Chesterfield, Ben Flook, launched his campaign to make St. George's Day a National Bank Holiday - having spent the afternoon at the Holme Hall Inn. Despite being the Patron Saint of many countries, including Bulgaria, Georgia, Romania, Portugal and parts of Catalonia in Spain as well as England - and being a state holiday in Rio De Janeiro in Brazil, St. George's Day is not a... Local News\nChesterfield's Labour Councillors Vote To Increase Their Pay By Nearly 15% 18th December 2023 Last week, Chesterfield's Labour Councillors voted to increase their own pay by nearly 15 per cent, despite a near £4 million shortfall in the Council's budget... Local News\nStaveley Charity Thank Ben Flook For Fundraising Donation 8th December 2023 The Staveley Project Organiser Team (SPOT) have thanked Conservative parliamentary candidate for Chesterfield, Ben Flook, for a fundraising donation to fund... Local News\nStaveley Town Council Thanks Ben Flook For Saving Remembrance Parade 8th November 2023 Prospective MP for Chesterfield, Ben Flook, and MP for North East Derbyshire, Lee Rowley, successfully raised £2,000 and handed over a cheque last week to the... Local News\nBen Flook Backs Local Apprenticeships 3rd November 2023 As part of his campaign to support local apprenticeships, Ben Flook was delighted to visit Learning Curve's Hair and Beauty Chesterfield Academy this week, to... Local News\nAnother £20 Million Of Government Investment For Chesterfield! 1st October 2023 Prospective MP Ben Flook has welcomed the news that Chesterfield has been awarded £20 million in funds to help regenerate it's town centre. This comes off the... Local News\nBen Flook Calls For Staveley Pavillion To Be Relocated 18th August 2023 In 2021, the Conservative Government invested £25.7 million in Staveley as part of the Towns Deal Fund. This will create local skilled construction jobs... Local News\nBen Flook Supports Staveley Armed Forces Day 9th July 2023 Prospective Conservative MP For Chesterfield, Ben Flook, was delighted to support Staveley Armed Forces day this weekend. The popular family event included... Local News\nBen Flook Launches Campaign For 2 Hours Free Parking 27th June 2023 As part of his campaign to Save Chesterfield Town Centre, Ben Flook has launched his campaign for 2 hours free parking to Save Chesterfield Town Centre. At... Local News\nGovernment Investment Delivers Progress For Staveley Canal 17th June 2023 Exciting work is happening both in Staveley and then further up in Renishaw. Both are examples of where, thanks to record investment from the Conservative... Local News",
  "https_www_benflook_co_uk_/https_www_benflook_co_uk_about-rss/content_9.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour."
}