{
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_news/content_5.html": "People with disabilities in Northampton will be supported to remain in their homes thanks to immediate action that the government is taking to improve adult...\nMike Reader for Northampton South\nJuly 30, 2023 10:34 am\nImportant: No API Key Entered.\nMany features are not available without adding an API Key. Please go to the YouTube Feeds settings page to add an API key after following these instructions.\n20 January 2025\nICE\nEngineering can deliver change and strengthen communities, writes Mike Reader MP, new chair of the All-Party Parliamentary Group for Infrastructure.\n...09 January 2025\nBBC News\nAn MP has appointed a specialist Send (special educational needs and disabilities) caseworker to deal with the “significant volume” of complex cases faced by parents.\n...12 December 2024\nNorthampton Chronicle\nThe success of the University was raised in the House of Commons, as the local Member of Parliament called for fairer funding for institutions like...\n11 December 2024\nMSN\nAnneliese Dodds MP, Minister for Women and Equalities, joined Mike Reader, Member of Parliament for Northampton South, and representatives from Northamptonshire’s charitable sector for a...\n03 December 2024\nWater Magazine\nMike Reader MP (Labour, Northampton South) has been confirmed as the new chair of the All-Party Parliamentary Group on Infrastructure (APPGI).\n...10 November 2024\nNorhamptonshire Telegraph\n262 Christmas boxes for children were donated and packed at The Church of Jesus Christ of Latter-day Saints, on Harlestone Road, Duston on Saturday 9th...\n03 February 2025",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_new-support-for-parents-announced/content_2.html": "As Parliament meets today (Wednesday 8th January) to debate the new Children and Wellbeing Bill, Northampton South Member of Parliament Mike Reader has announced he is strengthening his team with appointment of a specialist SEND caseworker.\nThe appointment of a specialist SEND caseworker is to deal with the “significant volume of complex SEND issues” faced by parents in Northampton South.\nToday, Wednesday 8th January, the Government brings forward its landmark Children and Wellbeing Bill, which promises to deliver free breakfast clubs for primary school children and improvements to protections and support for children with Special Educational Needs and Disabilities (SEND) requirements. The focus of the Labour Government’s Bill puts children’s wellbeing at the forefront of educational reforms to deliver on their mission to break down the barriers to opportunity.\nSEND provision is a key concern for many parents in Northampton, and a frequent casework issue for Mike Reader, Member of Parliament for Northampton South. To coincide with the vote in Parliament, Mike Reader has announced the appointment of a new specialist SEND caseworker in his constituency team to work with parents to help unlock complex cases.\nMike Reader is proud to champion SEND families by announcing the appointment of specialist Robert Martin to his constituency team. “I’ve listened to parents, we know how challenging navigating SEND is. We receive a significant volume of complex SEND issues via surgeries, email and when out campaigning across the constituency. I’ve made the decision to bring in a specialist SEND caseworker into my team. As a Learning Disabilities Nurse, the CEO of a SEND charity that provides support to children and families and a proud parent of a disabled child, Robert brings comprehensive experience and a wealth of knowledge to the role.”\nRobert Martin shared that “I am delighted to be starting as the new SEND Caseworker for Mike Reader MP. Over the years, I have had the privilege of working on numerous projects in collaboration with the NHS, social care services, local authorities, and parents. As the East Midlands Regional Chair of Parent Carer Forums, I have been actively involved in shaping policy and practice. This includes my contributions to the government’s change programme, as well as supporting better outcomes through OFSTED and CQC inspections.”\nLabour’s commitment on SEND will mean no child will fall through the cracks. The government’s bill will cut the cost of sending children to school to make life easier for families, and drive high and rising standards in schools.",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_about/content_7.html": "With 20 years’ experience working in the construction sector globally, Mike brings real-world expertise to Parliament. A local resident in Northampton, he’s fighting for a greener, fairer and more prosperous Northampton.\nI grew up in a family of teachers and educators, where public service was a core value. This dedication to helping others shaped my own path to public office.\nFor nearly 20 years, I worked in the construction and infrastructure sectors, leading teams that delivered major projects across the globe. As a civil engineer by training, I’ve seen first-hand how smart investment in infrastructure can transform communities and create opportunities.\nNorthamptonshire has been my home for two decades, and I’ve watched with growing frustration as our town has faced declining public services, Tory scandal after Tory scandal, and missed opportunities. I live in Northampton and believe we desperately need change – to revitalise our town centre, deliver the homes, GP surgeries and NHS dentists we need, and create stable, well-paying jobs for local people.\nThat’s why I chose to stand for Parliament. I want to use my real-world experience of delivering major projects to make a difference for our community. Whether it’s fighting for better NHS services, securing investment in green industries, or ensuring Northampton gets its fair share of funding, I’m committed to being a strong voice for our town.\nIn Parliament, I chair the All-Party Parliamentary Groups on International Trade and Investment, Food and Drink, Infrastructure and I am the Business Champion for the Construction sector. I’m a delegate on behalf of the UK to the Council of Europe and was one of the few MPs selected for the Armed Forces Parliamentary Scheme and the NFU’s Food and Farming Fellowship.\nI’m passionate about making politics work better for ordinary people. My experience in the private sector has taught me the importance of delivering results, not just making promises. As your MP, I will focus on practical solutions and getting things done for Northampton South.\nMike graduated from Loughborough University with an honours degree in Civil Engineering.\nAfter seeing the failure of the Tory-Lib Dem Coalition, I Joined the Labour Party.\nChosen by industry peers to be the recipient of the UK Constructing Excellence Young Achiever Award\nSelected for Labour’s Future Candidates Programme which was designed to empower people from outside the ‘political bubble’ to stand for Change.\nLabour Members from Northampton South selected Mike to represent them.\nMike was elected on 4th July 2024 with a majority of 4,071, overturning a notional majority of 13,000.\nElected as chair of the Food and Drink, International Trade and Infrastructure APPGs.",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_privacy-policy/content_4.html": "Skip to content\nHome\nFind Help\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nYoutube\nInstagram\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_mike-reader-mp-signs-holocaust-educational-trust-book-of-commitment/content_6.html": "Holocaust Memorial Day falls on 27th January, the liberation of the infamous former Nazi concentration and death camp, Auschwitz-Birkenau. This year marks the 80th anniversary of the liberation in 1945. Across the UK – and internationally – people will come together to remember the Holocaust.\n2025 is a significant anniversary year marking 80 years since the liberation of the Nazi concentration camps of Europe.\nWith survivors becoming older and frailer, this is likely to be the last significant anniversary at which Holocaust survivors will be present, and able to share their eye-witness testimony. As the Holocaust moves from living memory to history, this Holocaust Memorial Day presents a key opportunity to bring the Holocaust to the fore of our national consciousness.\nIn the lead up to and on Holocaust Memorial Day, thousands of commemorative events will be arranged by schools, faith groups and community organisations across the country, remembering all the victims of the Holocaust and subsequent genocides. The theme for this year’s commemorations is ‘For a Better Future’.\nIn the lead up to and on Holocaust Memorial Day, thousands of commemorative events will be arranged by schools, faith groups and community organisations across the country, remembering all the victims of the Holocaust and subsequent genocides. The theme for this year’s commemorations is ‘For a Better Future’.\nAfter signing the Book of Commitment, Mike Reader MP commented:\n“Holocaust Memorial Day this year marks 80 years since the liberation of the infamous former Nazi concentration and death camp, Auschwitz-Birkenau, in 1945. This day is a reminder of the unimaginable horrors of the past and the importance of it never happening again. I pledge to remember the six million Jewish men, women and children who were murdered in the Holocaust and speak out against all forms of antisemitism, which in recent months has risen exponentially and which needs to be tackled head on.”\nKaren Pollock CBE, Chief Executive of the Holocaust Educational Trust, said:\n“This year, on Holocaust Memorial Day, we come together to mark 80 years since the liberation of the extermination and concentration camps of Europe. We remember the six million Jewish men, women, and children who were murdered by the Nazis and their collaborators and we honour those who survived and rebuilt their lives after enduring unimaginable horrors.\nThe images and accounts that emerged at liberation revealed the full scale of the Nazis’ attempt to annihilate the Jewish people and this gave rise to the enduring call ‘Never Again.’ This phrase embodies the hope that the Holocaust would serve as a stark warning to future generations of the consequences of unchecked hatred and antisemitism.\nAs we mark this significant anniversary, the lessons of the Holocaust remain as urgent as ever. With survivors becoming fewer and frailer, and with antisemitism continuing to surge across the world – we must all commit to remembering the six million Jewish victims and must take action to ensure anti-Jewish racism is never again allowed to thrive.”",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk/content_1.html": "With 20 years’ experience working in the construction sector globally, Mike brings real-world expertise to Parliament. A local resident in Northampton, he’s fighting for a greener, fairer and more prosperous Northampton.\nAccessibility Tools",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_significant-investment-announced-to-support-disabled-and-elderly-residents/content_11.html": "People with disabilities in Northampton will be supported to remain in their homes thanks to immediate action that the government is taking to improve adult social care, support the care workforce and take pressure off the NHS.\nHealth and Social Care Secretary Wes Streeting will confirm a funding boost of £384,000 for West Northamptonshire Council as part of an £86 million boost to the Disabled Facilities Grant for this financial year.\nAlongside the funding, the government’s immediate action to support adult social care also includes harnessing the power of care technology to transform care and support older people to live at home for longer, cutting red tape to ensure billions of joint NHS and social care funding is keeping people healthy and taking pressure off the NHS, as well as improved career pathways for care workers and new national standards to ensure providers and families use the best care technology.\nCare workers across Northamptonshire will be better supported to take on further duties to deliver health interventions, such as blood pressure checks, meaning people in Northampton can receive more routine checks and care at home without needing to travel to healthcare settings. The national career structure for care staff will also be expanded, ensuring there are opportunities for career progression and development pathways.\nThe government will also develop a shared digital platform to allow up-to-date medical information to be shared between the NHS and care staff, including when someone last took their medication, to ensure people receive the best possible care.\nAlongside immediate steps to ease pressure on the sector and improve support for care workers, the government is also kickstarting work on the necessary long term reform to overhaul social care and address the inherited challenges it faces. As set out in the manifesto, this deep reform will include the creation of a National Care Service underpinned by national standards, delivering consistency of care across the country.\nAs a first step, the government will launch an independent commission into adult social care to inform the work needed to deliver this. The commission, chaired by Baroness Louise Casey and reporting to the Prime Minister, will work with people drawing on care and support, families, staff, politicians and the public, private and third sector to make clear recommendations for how to rebuild the adult social care system to meet the current and future needs of the population.\nLocal MP Mike Reader said:\n“This funding will be vital in supporting people in Northampton South to live at home with the dignity, independence and quality of life that they deserve.\n“In the election I promised those relying on or waiting for care in our community that a Labour Government would prioritise the investment and long-awaited reforms desperately needed for adult social care. Today we continue to deliver on that promise.”\nHealth and Social Care Secretary Wes Streeting said:\n“In the first six months of this government, work has already begun on stabilising the care sector, investing in prevention, and in carers and care workers. The investment and reforms we’re announcing today will help to modernise social care, get it working more closely with the NHS, and help deliver our Plan for Change.\n“But our ageing society, with costs of care set to double in the next 20 years, demands longer term action.\n“The independent commission will work to build a national consensus around a new National Care Service able to meet the needs of older and disabled people into the 21st century.\n“I have written to opposition parties to invite them to take part in the commission’ work, and asked Baroness\nLouise Casey to build a cross-party consensus, to ensure the national care service survives governments of different shades, just as our NHS has for the past 76 years.\n“We are appointing one of our country’s leading public service reformers, and Whitehall’s greatest do-er, to finally grasp the nettle on social care reform.”",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_terms-of-use/content_10.html": "Skip to content\nHome\nFind Help\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nYoutube\nInstagram\n[getterms_terms_en-au]\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_cookie-policy/content_12.html": "Skip to content\nHome\nFind Help\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nYoutube\nInstagram\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_contact/content_3.html": "Please note that due to strict Parliamentary protocol, I am only able to make enquiries on behalf of my own constituents. To check if you live in my constituency, check your MP here\nAs your MP I can help with a variety of issues and concerns.\nKeeping the issue private, I can write to the relevant department, official, or Minister or make a personal appointment to discuss the issue. This can often go a long way to providing a solution to your issue.\nI can also help to make the issue public by raising it in the House of Commons, where it will be officially recorded, and could potentially come to the attention of the press and public.\nOutside Parliament, you can request that I speak at an event concerning your issue, pledge my support to a campaign or write to the local media on your behalf.\nI hold weekly advice surgeries. They are by appointment only. To make an appointment please send an email using the contact form.\nI run weekly constituency surgeries for face-to-face support.\nMy team in Northampton South can often help without you having to attend an advice surgery. Contact my constituency office via one of the ways listed below and a member of the team will get in touch.\nEmail address for constituency matters and support\nEmail address for parliamentary queries\nAddress\nLeave a voicemail",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_about-me/content_9.html": "With 20 years’ experience working in the construction sector globally, Mike brings real-world expertise to Parliament. A local resident in Northampton, he’s fighting for a greener, fairer and more prosperous Northampton.\nI grew up in a family of teachers and educators, where public service was a core value. This dedication to helping others shaped my own path to public office.\nFor nearly 20 years, I worked in the construction and infrastructure sectors, leading teams that delivered major projects across the globe. As a civil engineer by training, I’ve seen first-hand how smart investment in infrastructure can transform communities and create opportunities.\nNorthamptonshire has been my home for two decades, and I’ve watched with growing frustration as our town has faced declining public services, Tory scandal after Tory scandal, and missed opportunities. I live in Northampton and believe we desperately need change – to revitalise our town centre, deliver the homes, GP surgeries and NHS dentists we need, and create stable, well-paying jobs for local people.\nThat’s why I chose to stand for Parliament. I want to use my real-world experience of delivering major projects to make a difference for our community. Whether it’s fighting for better NHS services, securing investment in green industries, or ensuring Northampton gets its fair share of funding, I’m committed to being a strong voice for our town.\nIn Parliament, I chair the All-Party Parliamentary Groups on International Trade and Investment, Food and Drink, Infrastructure and I am the Business Champion for the Construction sector. I’m a delegate on behalf of the UK to the Council of Europe and was one of the few MPs selected for the Armed Forces Parliamentary Scheme and the NFU’s Food and Farming Fellowship.\nI’m passionate about making politics work better for ordinary people. My experience in the private sector has taught me the importance of delivering results, not just making promises. As your MP, I will focus on practical solutions and getting things done for Northampton South.\nMike graduated from Loughborough University with an honours degree in Civil Engineering.\nAfter seeing the failure of the Tory-Lib Dem Coalition, I Joined the Labour Party.\nChosen by industry peers to be the recipient of the UK Constructing Excellence Young Achiever Award\nSelected for Labour’s Future Candidates Programme which was designed to empower people from outside the ‘political bubble’ to stand for Change.\nLabour Members from Northampton South selected Mike to represent them.\nMike was elected on 4th July 2024 with a majority of 4,071, overturning a notional majority of 13,000.\nElected as chair of the Food and Drink, International Trade and Infrastructure APPGs.",
  "https_www_mikereader_co_uk/https_www_mikereader_co_uk_how-i-can-help/content_8.html": "Please note that due to strict Parliamentary protocol, I am only able to make enquiries on behalf of my own constituents. To check if you live in my constituency, check your MP here\nHow I can help:\nI can highlight constituent concerns by asking questions, initiating debates, or lobbying for policy changes.\nI can help resolve problems with public services like benefits, housing, immigration, or healthcare by contacting relevant government departments or agencies.\nI can write letters, attend meetings, or apply pressure on local councils or organisations to address specific issues.\nWhat I can't do:\nI cannot intervene in disputes between private parties, such as employer-employee conflicts or custody cases.\nI cannot influence court rulings or intervene in legal cases already decided by the judiciary.\nI cannot resolve matters outside of my jurisdiction, such as visa or immigration issues involving foreign governments."
}