{
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_martlesham-heath-tesco-advice-surgery/content_34.html": "Martlesham Heath TESCO Advice Surgery\n- Jennifer Riddell- Carpenter\n- Mar 21\n- 1 min read\nAnother Friday advice surgery this afternoon - this one held in the Tesco cafe at Martlesham Heath. SEND, mental health and a whole host of other issues picked up again today.\nIf I can help with anything email me on jenny.riddellcarpenter.mp@parliament.uk",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_leading-the-send-provision-westminster-hall-debate/content_79.html": "Leading the SEND Provision Westminster Hall Debate\n- Jennifer Riddell- Carpenter\n- Feb 25\n- 1 min read\nThis afternoon, I had the honour of leading the Westminster Hall debate on Special Educational Needs and Disabilities (SEND) provision.\nSadly, many of the stories shared by colleagues during the debate were all too familiar to me, as similar experiences flood my inbox, surgeries and doorstep conversations all too regularly. Parents and families are desperate for help, facing a system that’s failing them.\nI remain fully committed to tackling the SEND crisis that is affecting so many families, and look forward to working with the government to ensure that all children receive the education that they deserve.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_maersk/content_93.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nMaersk Withdrawal From Felixstowe\nI spoke in the chamber today about Maersk’s decision to withdraw from Felixstowe.\nNov 21, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_care/content_141.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nVisit to Ipswich Hospital and meeting the Older Care Team\nLast week, I visited Ipswich Hospital, which serves much of Suffolk Coastal and the wider area.\nJan 16\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_10-3million-of-additional-funding-for-suffolk-send-provision/content_49.html": "£10.3million Of Additional Funding For Suffolk SEND Provision\n- Jennifer Riddell- Carpenter\n- Feb 5\n- 1 min read\nIn a recent written question, I asked the Secretary of State for Education how much additional funding her department has allocated for special educational needs provision by Suffolk County Council following the Autumn Budget last year.\nI was delighted with the response that £10.3million of additional funding has been set aside for Suffolk, that’s good news for families and young people who are affected by SEND. More still needs to be done to make sure we have a system that works here in Suffolk, but it’s a good first step for tackling a crisis that has been long in the making.\nRead more in the EADT here: Suffolk Coastal MP \"delighted\" with extra Government funding | East Anglian Daily Times\nIf you haven’t already, you can still submit into my survey on SEND – I’ve kept it open for a bit longer because so many families have reached out to me – fill it in here: Take part in my SEND survey and report.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-with-the-parliamentary-under-secretary-of-state-for-aviation-maritime-and-security-mike-k/content_47.html": "Meeting with The Parliamentary Under-Secretary of State for Aviation, Maritime, and Security, Mike Kane MP.\n- Jennifer Riddell- Carpenter\n- Nov 28, 2024\n- 1 min read\nYesterday, I met with The Parliamentary Under-Secretary of State for Aviation, Maritime, and Security, Mike Kane MP. We discussed the vital importance of the Port of Felixstowe to the UK's trading and import network, and the critical need to invest in the transport infrastructure that surrounds it.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-with-reydon-parish-council/content_81.html": "Meeting with Reydon Parish Council\n- Jennifer Riddell- Carpenter\n- Nov 15, 2024\n- 1 min read\nGreat to be hosted this afternoon by Reydon Parish Council, a really constructive meeting, and thanks for the warm welcome.\nAnd a chance to pop my head into the village's community fridge, open every Friday and serving people across Reydon. Looking forward to coming back soon!",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_news/content_61.html": "top of page\nNEWS\nLetter to Suffolk County Council calling for open decision on Suffolk Libraries\nAlong with other Suffolk MPs, I have today written to Suffolk County Council to ask them to open their decision on Suffolk Libraries.\nMar 17\nI'm officially (and finally) on TikTok!\nI'm officially (and finally) on TikTok! Follow me for updates, behind the scenes moments, and some fun along the way.\nMar 13\nEADT Column - March 2025 - Suffolk Libraries\nSuffolk Libraries UK are at risk - find out why in my latest EADT Column.\nMar 12\nSuffolk Libraries - World Book Day Reflections\nI raised the issue of Suffolk Libraries being taken in house by Suffolk County Council in the Commons\nMar 7\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_schools/content_65.html": "top of page\nNEWS\nProtection of Children (Digital Safety and Data Protection) Bill\nOn Friday in the House of Commons I spoke in support of the Protection of Children (Digital Safety and Data Protection) Bill.\nMar 12\nBucklesham Primary School Visit\nI had the pleasure of visiting Bucklesham Primary School recently to meet with the staff and students.\nMar 9\nFarlingaye School Students Visit Parliament\nToday I welcomed students from Farlingaye High School in Woodbridge to Parliament.\nJan 21\nFairfield and Colneis Schools Visit\nReally special to visit Fairfield and Colneis Schools this morning.\nNov 22, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_visit-to-st-elizabeth-hospice-in-ipswich/content_115.html": "Visit to St Elizabeth Hospice in Ipswich\n- Jennifer Riddell- Carpenter\n- Jan 23\n- 1 min read\nOn Friday, I visited St Elizabeth Hospice in Ipswich, to meet with the CEO, Judi Newman, and to learn about the hospice’s vital work in supporting patients and families facing life-limiting illnesses.\nSt Elizabeth Hospice is an incredibly calm and peaceful place, where every corner reflects the compassion and care they provide. It was clear to me that this is more than just a healthcare facility—it’s a place where dignity, empathy, and peace are at the heart of everything they do. I’m grateful for the chance to see their impact first-hand and for the warm welcome from Judi and the entire team.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_east-suffolk-business-awards/content_53.html": "East Suffolk Business Awards\n- Jennifer Riddell- Carpenter\n- Nov 15, 2024\n- 1 min read\nWonderful to be at the Suffolk Chamber of Commerce East Suffolk Business Awards Gala evening last night - a brilliant evening celebrating the best of local enterprise and charity. Well done to all the winners - a fantastic evening.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_categories_efra-select-committee/content_39.html": "top of page\nNEWS\nAnglian Water - EFRA Select Committee Questions\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Mark Thurston, CEO of Anglian Water.\nMar 13\nLet me know your views on Anglian Water\nLet me know your views on Anglian Water ahead of them appearing before the Environment, Food, and Rural Affairs Select Committee.\nMar 7\nBluetongue Select Committee Questioning - DEFRA and APHA\nDuring the EFRA Select Committee, we questioned DEFRA and APHA about recent Bluetongue outbreaks.\nMar 5\nYorkshire Water + South West Water/Pennon Group Select Committee Questioning\nYesterday, in the Environment, Food, and Rural Affairs Select Committee, we spoke to Yorkshire Water and Pennon Group / South West Water.\nFeb 26\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_biomass-energy-production-westminster-hall-intervention/content_99.html": "Biomass Energy Production - Westminster Hall Intervention\n- Jennifer Riddell- Carpenter\n- Mar 6\n- 1 min read\nIn Suffolk Coastal, our rivers are the jewel in our crown.\nThat’s why yesterday in Westminster Hall I outlined that it is critical we continue to support biomass energy production, while tackling nitrate run-off, to ensure water quality improvement.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_canvassing/content_96.html": "top of page\nNEWS\nOut on the doors in Warren Heath\nOut on the doors again today, with Pepe and the team. Thanks to the residents of Warren Heath for chatting to me.\nMar 9\nWoodbridge Canvassing and By-Election Candidate Launch\nA sunny day in Woodbridge, talking to residents about the issues that matter to them - and introducing Des Waters, by-election candidate.\nFeb 2\nWeekend Door Knocking in Leiston and Felixstowe\nI was out on the doorstep in Leiston and Felixstowe this weekend with my fantastic teams, talking to people about the issues that matter to\nJan 19\nWoodbridge Door Knocking - November 2024\nI promised I'd be out knocking all year round, not just at elections.\nNov 16, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_win/content_55.html": "top of page\nNEWS\nSuffolk Coastal WIN - DWP Admin Error\nA constituent reached out to me after three years of trying to address a problem with DWP taking a payment from their pension.\nMar 9\nSuffolk Coastal Win - Dangerous Pavements Cleaned in Felixstowe\nA constituent reached out to me after they had slipped over on a pavement in Felixstowe that was covered in moss.\nMar 4\nSuffolk Coastal WIN - Secured Surgery Appointment\nA constituent reached out to me after they had their appointment with a surgeon cancelled in December, despite being \"urgent\" for 15 months.\nFeb 17\nSuffolk Coastal WIN - Overdue VAT Refund\nA local business reached out to me for help as they were months overdue a £10,000 VAT refund from HMRC, and struggling to get the issue...\nJan 29\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_message-from-wes-streeting-to-suffolk-coastal-residents/content_69.html": "Message from Wes Streeting to Suffolk Coastal Residents\n- Jennifer Riddell- Carpenter\n- Feb 6\n- 1 min read\nInterested in shaping the future of the NHS? Do what Wes Streeting, Secretary of State for Health and Social Care says, get involved.\nFELIXSTOWE: Friday 7th February - 4-6pm\nSAXMUNDHAM: Friday 28th February - 6-8pm\nTo RSVP for one of these events, visit: Have your say in the future of the NHS",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_bluetongue-select-committee-questioning-defra-and-apha/content_90.html": "Bluetongue Select Committee Questioning - DEFRA and APHA\n- Jennifer Riddell- Carpenter\n- Mar 5\n- 1 min read\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Dr Christine Middlemiss, Chief Veterinary Officer at the Department for Environment, Food and Rural Affairs (DEFRA), and Dr Jenny Stewart, Interim Chief Executive at the Animal and Plant Health Agency (APHA) on the Recent outbreaks of blue tongue disease in livestock.\nSuffolk Coastal was at the epicentre of this summer’s blue tongue, and I have spoken to many farmers affected - so I was keen to hear about the Department’s response, and the lessons learnt.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_categories_visits/content_6.html": "top of page\nNEWS\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nVisit to Coastal Accessible Transport Services\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago.\nMar 21\nBucklesham Primary School Visit\nI had the pleasure of visiting Bucklesham Primary School recently to meet with the staff and students.\nMar 9\nSuffolk New College Visit\nI recently had of the opportunity to tour the Suffolk New College with Principal Alan Pease.\nMar 8\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_nhs/content_59.html": "top of page\nNEWS\nVisiting The University of Suffolk Dental CIC\nDuring my recent visit to the University of Suffolk Dental CIC, I had the chance to meet CEO Lorraine Mattis, staff, and students.\nMar 1\nSuffolk Coastal WIN - Secured Surgery Appointment\nA constituent reached out to me after they had their appointment with a surgeon cancelled in December, despite being \"urgent\" for 15 months.\nFeb 17\nFelixstowe NHS Workshop and Wangford Coffee Morning\nIt's been a busy couple of days, having last night held my NHS Workshop in Felixstowe, and this morning my first coffee morning in Wangford.\nFeb 8\nMessage from Wes Streeting to Suffolk Coastal Residents\nInterested in shaping the future of the NHS? Do what Wes Streeting, Secretary of State for Health and Social Care says, get involved.\nFeb 6\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_health/content_63.html": "top of page\nNEWS\nVisiting The University of Suffolk Dental CIC\nDuring my recent visit to the University of Suffolk Dental CIC, I had the chance to meet CEO Lorraine Mattis, staff, and students.\nMar 1\nSuffolk Coastal WIN - Secured Surgery Appointment\nA constituent reached out to me after they had their appointment with a surgeon cancelled in December, despite being \"urgent\" for 15 months.\nFeb 17\nEADT February Op-Ed: Solving the SEND crisis must be the top priority in Suffolk\nThe SEND crisis in Suffolk Coastal is real, and families are suffering.\nFeb 12\nFelixstowe NHS Workshop and Wangford Coffee Morning\nIt's been a busy couple of days, having last night held my NHS Workshop in Felixstowe, and this morning my first coffee morning in Wangford.\nFeb 8\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_privacy-policy/content_28.html": "PRIVACY POLICY\nPRIVACY POLICY – UPDATED 26 NOVEMBER 2024\nMy staff and I keep in touch with constituents about my work, take up casework on their behalf and ask for views on issues.\nThis policy explains how I collect and use personal data, and the legal basis for doing so. As the holder of that data I am called the Data Controller. You can also find here an explanation of your rights in relation to that data. My responsible staff member for data protection can be contacted at jenny.riddellcarpenter.mp@parliament.uk or by writing to Jenny Riddell-Carpenter MP, Houses of Parliament, Westminster, London, SW1A 0AA.\nI also have access to other information which I or my office, or volunteers working with me, may use for campaigning purposes or for communicating with Labour Party members. The Data Controller for that information is the Labour Party whose privacy policy can be located here: (https://labour.org.uk/privacy-policy/).\nData collection and use\nMy office will only collect and use personal information for the specific purpose for which it has been obtained.\nPolicy inquiries and casework (personal problems) enquiries bring with them information provided by the constituent and/or on behalf of the constituent. I will only share such information with a third party organisation where this is necessary and reasonable to do so, and therein, that would be only the amount of information deemed necessary to ensure the query is handled efficiently. The data processing is for performing tasks in the public interest or in the exercise of official authority.\nPlease see the “who I share your information with” section for further details.\nIf you register with my website or complete a form or survey sent to you by my office, you may be asked for personal information. In each case, I will seek your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, or phone about my work and give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nOther than in the circumstances above, I will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting the responsible officer for data protection.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my office for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. All personal data is collected on a secure electronic system. Any paper documents supplied to me are scanned onto the electronic system in the data subject’s case file and securely destroyed immediately or returned to the data subject in the post, if they have requested for their return. There are no paper records kept in my office. You are advised to retain your own copies of correspondence, should you wish to keep a record of your case. Information relating to casework will usually be retained for a maximum of one year, unless the casework matter is still ongoing. In such circumstances, personal data shall only be retained for as long as is necessary to resolve the request. I may delete information that I consider repetitive in order to hold minimal personal data.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nMy website does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites\nIf this website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n· Obtain copies of the personal information I hold about you (known as a “subject access request”).\n· Request that personal information you have given your consent for me to use, and that I still hold, is provided in an electronic format so it can be transferred to another data controller (also known as ‘data portability’).\n· Request that I correct or update any personal information held about you.\n· Ask that we erase or restrict the way in which I use your information.\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact the responsible officer for data protection:\nAddress: Jenny Riddell-Carpenter MP, Houses of Parliament, Westminster, London, SW1A 0AA.\nEmail: jenny.riddellcarpenter.mp@parliament.uk",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_visit-with-southgen-at-the-canteen-southwold/content_118.html": "Visit with SouthGen at The Canteen - Southwold\n- Jennifer Riddell- Carpenter\n- Feb 7\n- 1 min read\nWonderful to visit The Canteen Southwold today to see the work that SouthGen have done to bring to life the Old Hospital building back to life, with a community cafe, the library and local affordable housing scheme. The work they do can't be given justice in a single social media post, but this grass roots community initiative is incredible, supporting so many families across Southwold.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_southwold/content_125.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nVisit with SouthGen at The Canteen - Southwold\nWonderful to visit The Canteen Southwold today.\nFeb 7\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_woodbridge-door-knocking-november-2024/content_73.html": "Woodbridge Door Knocking - November 2024\n- Jennifer Riddell- Carpenter\n- Nov 16, 2024\n- 1 min read\nOut this morning with the team knocking on doors in Woodbridge - I really value the time that people give me on the doorstep, and it's important to hear about the issues that matter to you and your family.\nI promised I'd be out knocking all year round, not just at elections. And so far in November alone my team and I have spoken to over 230 of you on the doorstep. See you out again soon!",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_another-busy-felixstowe-surgery/content_70.html": "Another Busy Felixstowe Surgery\n- Jennifer Riddell- Carpenter\n- Feb 15\n- 1 min read\nAnother packed out advice surgery in Felixstowe completed last night - talking to people about issues with the private rented sector, health care needs, and a whole host of other challenges people are facing.\nMy next surgery is in Aldeburgh on 21st Feb, book in via: Surgeries | Jenny4SuffolkCoastal",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-with-the-landguard-trust/content_66.html": "Meeting with The Landguard Trust\n- Jennifer Riddell- Carpenter\n- Mar 3\n- 1 min read\nOn Friday last week, I visited the Landguard Fort and Felixstowe Museum, and heard more about the Landguard Nature Reserve Bird Observatory and nature reserve.\nIt was a real highlight of the week, and a chance to tour Landguard Fort – and see up close the amazing work that volunteers do to preserve our local history. It’s a real jewel in Felixstowe’s crown, and the work of volunteers has brought incredible stories to life – showing the role that our town and coastline played in the Country’s military defence during the wars, and even in peacetime.\nAnd the Museum next door is just as special – and even a little warmer…! A brilliant army of volunteers that keep this special corner of Felixstowe going, whilst telling the stories that matter, and keeping our history alive.\nAs a former historian (perhaps too big a claim – though my Master’s degree was in History…) I really appreciate the work that’s gone into the archiving, and storytelling. Thank you to all the volunteers and staff that took the time to show me around.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_page_2/content_95.html": "top of page\nNEWS\nOut on the doors in Warren Heath\nOut on the doors again today, with Pepe and the team. Thanks to the residents of Warren Heath for chatting to me.\nMar 9\nSuffolk Coastal WIN - DWP Admin Error\nA constituent reached out to me after three years of trying to address a problem with DWP taking a payment from their pension.\nMar 9\nBucklesham Primary School Visit\nI had the pleasure of visiting Bucklesham Primary School recently to meet with the staff and students.\nMar 9\nSuffolk New College Visit\nI recently had of the opportunity to tour the Suffolk New College with Principal Alan Pease.\nMar 8\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_children/content_124.html": "top of page\nNEWS\nProtection of Children (Digital Safety and Data Protection) Bill\nOn Friday in the House of Commons I spoke in support of the Protection of Children (Digital Safety and Data Protection) Bill.\nMar 12\nTobacco and Vapes Bill\nYesterday, I spoke in Parliament to welcome the Tobacco and Vapes Bill.\nNov 27, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_redevelopment-of-james-paget-hospital-and-west-suffolk-hospital-confirmed/content_127.html": "Redevelopment of James Paget Hospital and West Suffolk Hospital CONFIRMED\n- Jennifer Riddell- Carpenter\n- Jan 21\n- 1 min read\nGreat news for Suffolk! The redevelopment of James Paget Hospital and West Suffolk Hospital has been confirmed by Government.\nThis is excellent news, ensuring our community will benefit from top-quality care with modernised facilities for both patients and staff.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-with-minister-emma-hardy-mp-parliamentary-under-secretary-of-state-for-water-and-flooding/content_80.html": "Meeting with Minister Emma Hardy MP: Parliamentary Under-Secretary of State for Water and Flooding\n- Jennifer Riddell- Carpenter\n- Mar 10\n- 1 min read\nI recently met with Minister Emma Hardy MP, Parliamentary Under-Secretary of State for Water and Flooding, to discuss the all too familiar challenges that flooding poses to Suffolk Coastal.\nWe discussed some of the key areas that are repeatedly affected, including Potters Bridge, the River Deben, and the Alde / Ore Estuary, and I am looking forward to continuing to work with her on tackling these issues.\nSuffolk Coastal has long been vulnerable to the impacts of flooding. As someone who is passionate about the welfare of our communities, I’ve seen first-hand the challenges posed by our region’s low-lying coastline and its exposure to the North Sea. Rising sea levels and extreme weather events are a constant concern, and the issue of flooding remains a pressing one for our local area.\nGiven the growing importance of Suffolk Coastal in the UK’s energy landscape—home to Sizewell C and National Grid’s interconnectors—it’s clear that our constituency must be prioritised for flood protection work. The communities that host such critical infrastructure deserve to benefit from the investments that help safeguard their future. Flood defences are not just a precaution; they are a vital necessity to ensure our local environment and way of life are protected.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_dwp-questions-jobs-plus-pilot-scheme/content_62.html": "DWP Questions: Jobs Plus Pilot Scheme\n- Jennifer Riddell- Carpenter\n- Mar 18\n- 1 min read\nIn my last life, before I entered politics, I worked closely with the DWP and campaigned heavily on improving employment support opportunities for people across the country, and to make it easier for people to access employment support. Our current system is broken, and is letting down the very people we should be trying to help. If you’ve ever tried to access employment support you already know this.\nYesterday, I asked the Minister if the Jobs Plus Pilot scheme - which is based on a model in the USA that I worked to bring to the UK, will be extended to Suffolk Coastal. The pilot is already providing employment opportunities for thousands of people in the UK, and is exactly the kind of initiative we need to tackle long-term unemployment and give local people the opportunities they deserve to thrive. I’m looking forward to working with the Minister to make this happen.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_suffolk-libraries-world-book-day-reflections/content_13.html": "Suffolk Libraries - World Book Day Reflections\n- Jennifer Riddell- Carpenter\n- Mar 7\n- 1 min read\nYesterday was World Book Day, and it couldn’t be a more important moment to celebrate the incredible value our libraries bring to communities. Yet, Suffolk County Council's decision to take libraries back in-house flies in the face of common sense.\nSuffolk Libraries UK, an independent charity set up to save Suffolk’s libraries from closure under Conservative austerity, has been one of Suffolk’s proudest success stories. They saved all libraries from closure and opened more libraries. But they do so much more than just provide our community with books. Their health and wellbeing services and community support reach every corner of our County, and the army of volunteers help thousands of people each month.\nBut all is this under threat by Suffolk County Council’s plans to bring it back in house. Sign the petition here: https://www.change.org/p/stop-suffolk-county-council-wrecking-our-fabulous-local-libraries\nI raised the issue yesterday in the House of Commons, and will continue to champion Suffolk Libraries in my discussions against this appalling plan.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_let-me-know-your-views-on-anglian-water/content_72.html": "Let me know your views on Anglian Water\n- Jennifer Riddell- Carpenter\n- Mar 7\n- 1 min read\nLet me know your views on Anglian Water ahead of them appearing before the Environment, Food, and Rural Affairs Select Committee on Wednesday 12th next week. I’ll be putting feedback from the survey directly to the bosses when I question them.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_eadt-february-op-ed-solving-the-send-crisis-must-be-the-top-priority-in-suffolk/content_27.html": "EADT February Op-Ed: Solving the SEND crisis must be the top priority in Suffolk\n- Jennifer Riddell- Carpenter\n- Feb 12\n- 1 min read\nThe SEND crisis in Suffolk Coastal is real, and families are suffering. With new government funding, solving the SEND crisis must be the top priority in Suffolk. Read more in my latest EADT column here:",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_surgeries/content_35.html": "SURGERIES\nLOCAL ADVICE SURGERIES\nI hold regular advice surgeries at locations across the constituency.\nSurgeries are by appointment in 20 minute slots. Appointments are often in high demand, and I will always prioritise urgent cases first.\nTo request a surgery appointment, please click on the \"REQUEST\" button below, and a member of my team will get back to you.\nPlease note: Maximum 2 people per appointment. Due to security issues and based on clear instructions from the police, my team will provide the exact location of the advice surgery 24 hours beforehand.\nUPCOMING SURGERIES\nNEW DATES COMING SOON!\nLOCAL COFFEE MORNINGS\nAs well as surgeries, I also host informal coffee mornings, giving constituents the chance to chat to me about the issues that matter to them.\nThese sessions are perfect for those who prefer a more relaxed setting to discuss their concerns or seek advice. Whether it's a local issue, a policy matter, or just a general chat, I’m here to listen and offer support. It's an opportunity to connect in an informal environment and make sure your voice is heard.\nYou can RSVP for a coffee morning by clicking the \"RSVP\" button below.\nUPCOMING COFFEE MORNINGS\nNEW DATES COMING SOON!",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_letter-to-suffolk-county-council-calling-for-open-decision-on-suffolk-libraries/content_44.html": "Letter to Suffolk County Council calling for open decision on Suffolk Libraries\n- Jennifer Riddell- Carpenter\n- Mar 17\n- 1 min read\nAlong with other Suffolk MPs, I have today written to Suffolk County Council to ask them to open their decision on Suffolk Libraries UK up to consultation so that residents can have their say.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_categories_constituency/content_5.html": "top of page\nNEWS\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nVisit to Coastal Accessible Transport Services\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago.\nMar 21\nMartlesham Heath TESCO Advice Surgery\nAnother Friday advice surgery this afternoon - this one held in the Tesco cafe at Martlesham Heath.\nMar 21\nLetter to Suffolk County Council calling for open decision on Suffolk Libraries\nAlong with other Suffolk MPs, I have today written to Suffolk County Council to ask them to open their decision on Suffolk Libraries.\nMar 17\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org/content_1.html": "Jenny Riddell-Carpenter MP\nYour Member of Parliament for Suffolk Coastal\nEMAIL ME\nJENNY.RIDDELLCARPENTER.MP@PARLIAMENT.UK\nFOLLOW ME ON SOCIAL MEDIA",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_port/content_113.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nMaersk Withdrawal From Felixstowe\nI spoke in the chamber today about Maersk’s decision to withdraw from Felixstowe.\nNov 21, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_request-a-surgery/content_78.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nREQUEST A SURGERY APPOINTMENT\nRequest A Surgery Appointment\n*\nFirst name\n*\nLast name\n*\nEmail\n*\nPhone\n*\nHouse Number / Name\n*\nStreet\n*\nTown\n*\nPostcode\n*\nSummary Of The Issue That You Wish To Discuss With Jenny\n*\nSurgery Locations That Would Work For You\nAldeburgh\nFelixstowe\nLeiston\nMelton\nSaxmundham\nSouthwold\nWoodbridge\nYoxford\nSubscribe to the newsletter?\nSubmit\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_farming/content_109.html": "top of page\nNEWS\nTen Minute Rule Bill \"Food products (market regulation and public procurement)\"\nToday, I was pleased to co-sponsor the Ten Minute Rule Bill \"Food products (market regulation and public procurement)\".\nMar 19\nBluetongue Select Committee Questioning - DEFRA and APHA\nDuring the EFRA Select Committee, we questioned DEFRA and APHA about recent Bluetongue outbreaks.\nMar 5\nLabour MPs Open Letter To Supermarket CEOs\nYesterday, I and 45 other Labour MP’s from across England, Scotland and Wales wrote to the CEOs of the UK’s six largest supermarkets.\nJan 31\nEFRA Select Committee: Impact of changes to APR and IHT\nEFRA Select Committee: Questions on the impact of changes to APR and IHT.\nDec 11, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_update-new-ownership-the-orwell-hotel-felixstowe/content_83.html": "UPDATE - New Ownership - The Orwell Hotel, Felixstowe\n- Jennifer Riddell- Carpenter\n- Feb 12\n- 1 min read\nYesterday, I reached out to the Orwell Hotel to express my concerns about the previous ownership. I’m hopeful that this marks the beginning of better things to come.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_out-on-the-doors-in-warren-heath/content_129.html": "Out on the doors in Warren HeathJennifer Riddell- Carpenter Mar 91 min readOut on the doors again today, with Pepe and the team. Thanks to the residents of Warren Heath for chatting to me - lovely to have the sun out with us too 🌞",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_suffolk-coastal-win-dangerous-pavements-cleaned-in-felixstowe/content_38.html": "Suffolk Coastal Win - Dangerous Pavements Cleaned in Felixstowe\n- Jennifer Riddell- Carpenter\n- Mar 4\n- 1 min read\nA constituent reached out to me after they had slipped over on a pavement in Felixstowe that was covered in moss. I was able to get in contact with East Suffolk Council and have the pavements cleaned to ensure that they were safe.\nHave an issue? Or need support? Get in touch by emailing me at jenny.riddellcarpenter.mp@parliament.uk",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_surgery/content_89.html": "top of page\nNEWS\nMartlesham Heath TESCO Advice Surgery\nAnother Friday advice surgery this afternoon - this one held in the Tesco cafe at Martlesham Heath.\nMar 21\nAnother Busy Felixstowe Surgery\nAnother packed out advice surgery in Felixstowe completed last night.\nFeb 15\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-with-the-fire-brigades-union-in-woodbridge/content_3.html": "Meeting with The Fire Brigades Union in Woodbridge\n- Jennifer Riddell- Carpenter\n- Mar 24\n- 1 min read\n🚒 On Friday, I met with the Fire Brigades Union in #woodbridge to hear directly from firefighters about their vital work and the challenges they face.\nOur emergency services play a crucial role in keeping communities safe, often putting themselves at risk to protect others.\nThank you for hosting me, and for everything that you do.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_rsvp-for-a-coffee-morning/content_48.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nRSVP FOR A COFFEE MORNING\nRSVP For A Coffee Morning\n*\nFirst name\n*\nLast name\n*\nEmail\n*\nPhone\n*\nHouse Number / Name\n*\nStreet\n*\nTown\n*\nPostcode\nSummary Of Any Topics Or Issues That You Wish To Discuss With Jenny\n*\nWhich Event Would You Like To RSVP For?\nSubscribe to the newsletter?\nSubmit\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_suffolk-new-college-visit/content_10.html": "Suffolk New College Visit\n- Jennifer Riddell- Carpenter\n- Mar 8\n- 1 min read\nI recently had of the opportunity to tour the Suffolk New College with Principal Alan Pease. The facilities are truly impressive, offering students incredible opportunities to learn and develop in a modern, supportive environment.\nTo top it off, I enjoyed some delicious cake made by students in their fully operating commercial restaurant. Thank you for hosting me – I am looking forward to visiting the Suffolk Rural College soon.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_coffee-morning/content_117.html": "top of page\nNEWS\nNacton Coffee Morning\nAnother busy morning, this time in Nacton, hosting a coffee morning with residents from Levington and Nacton.\nFeb 22\nFelixstowe NHS Workshop and Wangford Coffee Morning\nIt's been a busy couple of days, having last night held my NHS Workshop in Felixstowe, and this morning my first coffee morning in Wangford.\nFeb 8\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_categories_parliament/content_11.html": "top of page\nNEWS\nPlanning and Infrastructure Bill Debate\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the...\nMar 25\nTen Minute Rule Bill \"Food products (market regulation and public procurement)\"\nToday, I was pleased to co-sponsor the Ten Minute Rule Bill \"Food products (market regulation and public procurement)\".\nMar 19\nDWP Questions: Jobs Plus Pilot Scheme\nYesterday, I asked the Minister if the Jobs Plus Pilot scheme will be extended to Suffolk Coastal.\nMar 18\nAnglian Water - EFRA Select Committee Questions\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Mark Thurston, CEO of Anglian Water.\nMar 13\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_labour-mps-open-letter-to-supermarket-ceos/content_57.html": "Labour MPs Open Letter To Supermarket CEOs\n- Jennifer Riddell- Carpenter\n- Jan 31\n- 1 min read\nYesterday, I and 45 other Labour MP’s from across England, Scotland and Wales wrote to the CEOs of the UK’s six largest supermarkets, calling out their unfair practices that are harming farmers.\nIt can’t be seen as right or fair that farmers often receive 1p profit from the food items they produce, whilst at the same time supermarkets have pursued excessive profits. They’ve forced the value of farming produce down, and misled customers with 'farmwashing'.\nThis has been going on for years, and has been left unchallenged for too long.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_have-your-say-in-the-future-of-the-nhs/content_120.html": "Have your say in the future of the NHS\n- Jennifer Riddell- Carpenter\n- Jan 7\n- 2 min read\nIn October 2024, the Government launched the biggest ever national conversation about the future of our NHS. After 14 years of Conservative neglect and mismanagement, the Labour government is taking action to get the NHS back on its feet and fit for the future.\nThe Health and Social Care Secretary, Wes Streeting ordered a full and independent investigation into the NHS that has since concluded that the NHS is in a ‘critical condition’. Having received the diagnosis of an NHS that is broken, but not beaten, the Government is now developing it's plan to lift it off its knees and make it fit for the future.\nThis plan is being developed with people who use our NHS, the staff who work in it, NHS leaders, health experts, industry, and the wider public.\nIt is vital that communities across Suffolk Coastal have the chance to input into this review. This is why I am hosting workshops across the Constituency, as well as an online survey for those unable to attend the in person events, to make sure everyone who wants to have a chance to input into this review is able to.\nThese workshops, which are part of many being held across the Country, will play a vital role in helping to inform the government’s Ten Year Health Plan, due to be published in the Spring, which will deliver the unprecedented long-term reform needed to turn the NHS around.\nTo sign up to one of my in person workshops, or to take part in the online survey, please complete visit the link below.\nFurther information will be emailed to those registered ahead of the events, and when the online survey launches. You must be a resident in the Suffolk Coastal constituency to take part.\nFELIXSTOWE: Friday 7th February - 4-6pm\nSAXMUNDHAM: Friday 28th February - 6-8pm",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_protection-of-children-digital-safety-and-data-protection-bill/content_119.html": "Protection of Children (Digital Safety and Data Protection) Bill\n- Jennifer Riddell- Carpenter\n- Mar 12\n- 1 min read\nOn Friday in the House of Commons I spoke in support of the Protection of Children (Digital Safety and Data Protection) Bill, and the vital need to tackle smartphone usage in schools.\nThis was also a great opportunity to highlight the incredible work of a campaign that started here in Suffolk Coastal – by Daisy and Joe, founders of Smartphone Free Childhood.\nI know that campaigners are disappointed that all the recommendations didn’t get taken forward, but this is the beginning not the end. I look forward to supporting them on their next steps to keep this campaign moving forward.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_letter/content_94.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nLabour MPs Open Letter To Supermarket CEOs\nYesterday, I and 45 other Labour MP’s from across England, Scotland and Wales wrote to the CEOs of the UK’s six largest supermarkets.\nJan 31\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_transport/content_19.html": "top of page\nNEWS\nVisit to Coastal Accessible Transport Services\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago.\nMar 21\nRoad Safety Visit in Woodbridge\nOut yesterday morning talking to residents about road safety concerns in Woodbridge, on the A12.\nFeb 8\nPotters Bridge Flooding: All-Agency Meeting\nLast week I held an all-agency meeting on the repeated flooding of Potters Bridge.\nDec 10, 2024\nMeeting with The Parliamentary Under-Secretary of State for Aviation, Maritime, and Security, Mike Kane MP.\nYesterday, I met with The Parliamentary Under-Secretary of State for Aviation, Maritime, and Security, Mike Kane MP.\nNov 28, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_parliament/content_68.html": "top of page\nNEWS\nPlanning and Infrastructure Bill Debate\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the...\nMar 25\nTen Minute Rule Bill \"Food products (market regulation and public procurement)\"\nToday, I was pleased to co-sponsor the Ten Minute Rule Bill \"Food products (market regulation and public procurement)\".\nMar 19\nDWP Questions: Jobs Plus Pilot Scheme\nYesterday, I asked the Minister if the Jobs Plus Pilot scheme will be extended to Suffolk Coastal.\nMar 18\nAnglian Water - EFRA Select Committee Questions\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Mark Thurston, CEO of Anglian Water.\nMar 13\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_jennysvisits/content_20.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nJENNY'S VISITS\nHere's a look at where Jenny has been\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_road-safety-visit-in-woodbridge/content_18.html": "Road Safety Visit in Woodbridge\n- Jennifer Riddell- Carpenter\n- Feb 8\n- 1 min read\nOut yesterday morning talking to residents about road safety concerns in Woodbridge, on the A12. The issues raised with me are a real concern for families of all ages - a dangerous road for pedestrians and cars turning on blind corners - and I'll be working to continue to push these issues with the County Council and relevant organisations.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_categories_wins/content_8.html": "top of page\nNEWS\nSuffolk Coastal WIN - DWP Admin Error\nA constituent reached out to me after three years of trying to address a problem with DWP taking a payment from their pension.\nMar 9\nSuffolk Coastal Win - Dangerous Pavements Cleaned in Felixstowe\nA constituent reached out to me after they had slipped over on a pavement in Felixstowe that was covered in moss.\nMar 4\nSuffolk Coastal WIN - Secured Surgery Appointment\nA constituent reached out to me after they had their appointment with a surgeon cancelled in December, despite being \"urgent\" for 15 months.\nFeb 17\nSuffolk Coastal WIN - Overdue VAT Refund\nA local business reached out to me for help as they were months overdue a £10,000 VAT refund from HMRC, and struggling to get the issue...\nJan 29\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-on-the-future-of-trimley-station-1/content_103.html": "Meeting on the future of Trimley Station\n- Jennifer Riddell- Carpenter\n- Feb 3\n- 1 min read\nI was delighted to participate in a meeting on Friday with SAVE Britain's Heritage, community and heritage groups, the local council and Greater Anglia to kick start fresh discussions about the future and opportunities for Trimley Station.\nBuilt as part of the Great Eastern Railway in 1891 by railway architect W.N. Ashbee, Trimley is the last surviving country station in the New Essex style.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_hashtags_woodbridge/content_7.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_casework/content_29.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nSuffolk Coastal WIN - Overdue VAT Refund\nA local business reached out to me for help as they were months overdue a £10,000 VAT refund from HMRC, and struggling to get the issue...\nJan 29\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_page_3/content_92.html": "top of page\nNEWS\nYorkshire Water + South West Water/Pennon Group Select Committee Questioning\nYesterday, in the Environment, Food, and Rural Affairs Select Committee, we spoke to Yorkshire Water and Pennon Group / South West Water.\nFeb 26\nLeading the SEND Provision Westminster Hall Debate\nThis afternoon, I had the honour of leading the Westminster Hall debate on Special Educational Needs and Disabilities (SEND) provision.\nFeb 25\nVisit to Martlesham Wilds with Suffolk Wildlife Trust\nGreat to visit to Martlesham Wilds Nature Reserve on Tuesday to meet with Suffolk Wildlife Trust.\nFeb 24\nNacton Coffee Morning\nAnother busy morning, this time in Nacton, hosting a coffee morning with residents from Levington and Nacton.\nFeb 22\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_felixstowe/content_67.html": "top of page\nNEWS\nSuffolk Coastal Win - Dangerous Pavements Cleaned in Felixstowe\nA constituent reached out to me after they had slipped over on a pavement in Felixstowe that was covered in moss.\nMar 4\nMeeting with The Landguard Trust\nOn Friday last week, I visited the Landguard Fort and Felixstowe Museum, and heard about the Landguard Nature Reserve Bird Observatory.\nMar 3\nAnother Busy Felixstowe Surgery\nAnother packed out advice surgery in Felixstowe completed last night.\nFeb 15\nUPDATE - New Ownership - The Orwell Hotel, Felixstowe\nYesterday, I reached out to the Orwell Hotel to express my concerns about the previous ownership.\nFeb 12\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_business/content_50.html": "top of page\nNEWS\nTen Minute Rule Bill \"Food products (market regulation and public procurement)\"\nToday, I was pleased to co-sponsor the Ten Minute Rule Bill \"Food products (market regulation and public procurement)\".\nMar 19\nDWP Questions: Jobs Plus Pilot Scheme\nYesterday, I asked the Minister if the Jobs Plus Pilot scheme will be extended to Suffolk Coastal.\nMar 18\nLabour MPs Open Letter To Supermarket CEOs\nYesterday, I and 45 other Labour MP’s from across England, Scotland and Wales wrote to the CEOs of the UK’s six largest supermarkets.\nJan 31\nSuffolk Coastal WIN - Overdue VAT Refund\nA local business reached out to me for help as they were months overdue a £10,000 VAT refund from HMRC, and struggling to get the issue...\nJan 29\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_apr/content_121.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nEFRA Select Committee: Impact of changes to APR and IHT\nEFRA Select Committee: Questions on the impact of changes to APR and IHT.\nDec 11, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_infrastructure/content_71.html": "top of page\nNEWS\nMeeting with The Parliamentary Under-Secretary of State for Aviation, Maritime, and Security, Mike Kane MP.\nYesterday, I met with The Parliamentary Under-Secretary of State for Aviation, Maritime, and Security, Mike Kane MP.\nNov 28, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_acceptable-behaviour-policy/content_9.html": "ACCEPTABLE BEHAVIOUR POLICY\nACCEPTABLE BEHAVIOUR POLICY - UPDATED 26 NOVEMBER 2024\nPeople may act out of character in times of trouble or distress. There may have been upsetting or distressing circumstances leading up to a constituent approaching my office.\nHowever I will not tolerate unacceptable behaviour nor actions that result in unacceptable or excessive demands on my staff in that it prevents them from carrying out their duties effectively.\nIt is these behaviours and actions that I aim to manage under this Policy.\nAggressive or abusive behaviour\nI understand that many constituents are often upset and angry about the issues they have raised in their complaint. If that anger escalates into aggression towards my staff, I consider that unacceptable. Any violence, threats or abuse towards staff will not be tolerated.\nViolence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language (whether verbal or written) that may cause staff to feel offended, afraid, threatened or abused.\nI will judge each situation individually and appreciate individuals who come to my office may be upset. While I accept that those who contact me may feel angry, it is not acceptable to shout or swear at anyone in my office.\nUnacceptable language is that which:\n-\nis offensive, derogatory or patronising;\n-\nis discriminatory in any way, including racist, sexist, homophobic or transphobic comments; or\n-\nmakes serious allegations that individuals have committed criminal, corrupt or perverse conduct without any evidence.\nI may decide that comments aimed not at my staff but at third parties are unacceptable because of the effect that listening or reading them may have on my staff. Examples include rudeness, offensive comments, derogatory remarks, making inflammatory statements, or raising unsubstantiated allegations made towards these third parties.\nAll threats against either my staff will be taken very seriously and if staff feel scared or threatened at any point during a conversation with a constituent, the interaction may be ended at any time.\nUnreasonable levels of contact\nSometimes the volume and duration of contact made to my office by an individual causes problems. This can occur over a short period, for example, a number of calls in one day or hour.\nIt may occur over the life-span of a complaint when a constituent repeatedly makes long telephone calls to us or inundates us with copies of information that has been sent already or that is irrelevant to the complaint.\nI consider that the level of contact has become unacceptable when the amount of time spent talking to a constituent on the telephone, or responding to, reviewing and filing emails or written correspondence impacts on my offices’ ability to deal with that complaint, or with other constituents’ complaints.\nHarassment\nMy staff have the right to carry out their duties free from harassment or threats of harassment. I ask everyone to respect that my staff are delivering a service on my behalf and therefore this may not reflect their own views or preferences.\nExamples of behaviours I consider to be harassment against my office include:\n-\nrecording telephone discussions and publishing the information online such as through YouTube, Vimeo, Twitter or other social media;\n-\ncontacting staff using their personal details or social media presence, including but not limited to Facebook, Twitter or LinkedIn;\n-\npublishing personal, sensitive or private information about staff online or other public domains such as noticeboards or newsletters.\nUnacceptable, unreasonable or excessive demands\nA demand becomes unacceptable when it starts to (or when complying with the demand would) impact substantially on the work of my office.\nExamples of this behaviour include:\n-\nrepeatedly demanding a response within a unreasonable timescale;\n-\ninsisting on, or refusing to, speak to a particular member of staff, when that is not possible;\n-\nrepeatedly changing the substance of a complaint or raising unrelated concerns;\n-\nMaking repeated and unnecessary contact during the course of us dealing with a complaint or carrying out an investigation;\n-\nRefusing to accept a decision where explanations for the decision have been provided.\nAn example of such impact would be that the demand takes up an excessive amount of staff time and in doing so disadvantages other constituents and prevents their own complaint from being dealt with quickly.\nUnacceptable and persistence levels of contact\nSometimes the volume and duration of contact made to our service by an individual causes problems. This can occur over a short period or over the life-span of a complaint.\nI consider that the level of contact has become unacceptable when the amount of time spent talking to a constituent on the telephone, or responding to, reviewing and filing emails or written correspondence impacts on our ability to deal with that complaint, or with other constituents’ complaints.\nUnacceptable or persistent levels of contact include:\n-\nContinuous contact while my office is in the process of considering a matter;\n-\nRepeated telephone calls over a short period, for example, a high number calls in one day or week;\n-\nLengthy telephone calls repeating the same points of discussion;\n-\nHigh volumes of information provided by email or post referencing the same issues;\n-\nUnnecessarily or excessive copying us into emails to other parties;\n-\nRepeatedly attending the constituency office without an appointment, especially when asked not to do so.\nRefusal to co-operate\nWhen looking at a complaint, my office will need to ask the individual who has contacted us to work with us. This can include agreeing with us:\n-\nthe complaint we will look at;\n-\nto provide us with further information, evidence or comments on request; or\n-\nhelp us by summarising their concerns.\nSometimes, an individual repeatedly refuses to co-operate and this makes it difficult for us to proceed. My office will always seek to assist someone if they have a specific, genuine difficulty complying with a request.\nHowever, it is unacceptable to bring a complaint to my office and then not respond to clear and appropriate requests by staff.\nReasonable adjustments\nI understand that some constituents may find it difficult for them to express themselves or communicate clearly, especially when they are anxious or upset. In order to do this, we ask that they explain what adjustments they’re looking for and how this will ensure they can access the service my office offers.\nMy office will always consider making reasonable adjustments for a constituent asked to do so. Examples of adjustments we can consider are:\n-\nwe could consider using different methods of communication;\n-\nproviding written communication in large print, coloured text, or in translation where possible;\n-\ngiving clear warnings if conversations become unproductive and allowing constituents to opportunity to modify their behaviour before ending a call.\nHowever, I do not expect my staff to accept being subjected to aggressive, offensive, threatening or abusive actions, language or behaviour.\nI may still use the policy if there are actions or behaviours which are having a negative effect on our staff or our work even where a reasonable adjustment has been made.\nActions I may take\nWhen my office experiences behaviour or demands which are unacceptable, I may consider taking more formal action.\nThe actions I will consider can include the following:\n-\nWarning the constituent about their behaviour and requesting that the constituent modifies their behaviour in future contact with us;\n-\nAppointing a specific point of contact for the constituent;\n-\nCommunicating only in writing or via a representative;\n-\nDeciding not to investigate a complaint on the basis that it has been pursued in a way that is unacceptable.;\n-\nStop all communication with a constituent;\n-\nRestricting or limiting contact;\n-\nReporting the matter to the Police.\nWhere it is decided that formal action must be taken to manage someone’s behaviour I or my office, will inform them of the decision in writing. A note will be placed on our records to this effect.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_woodbridge-royal-mail-delivery-office-visit/content_138.html": "Woodbridge Royal Mail Delivery Office Visit\n- Jennifer Riddell- Carpenter\n- Dec 6, 2024\n- 1 min read\nHad a great visit to the Woodbridge Royal Mail Delivery Office this morning to see the hard work happening ahead of Christmas. Covering one of the largest rural areas of any delivery office, the team is doing an incredible job - thanks for making sure our holiday post gets to where it needs to be!",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_yorkshire-water-south-west-water-pennon-group-select-committee-questioning/content_60.html": "Yorkshire Water + South West Water/Pennon Group Select Committee Questioning\n- Jennifer Riddell- Carpenter\n- Feb 26\n- 1 min read\nYesterday, in the Environment, Food, and Rural Affairs Select Committee, we spoke to Yorkshire Water and Pennon Group / South West Water.\nWater companies must prioritise customers and ensure they are delivering fair and reliable services, especially to the most vulnerable in our communities.\nListen to my questioning of Yorkshire Water CEO here 👇",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_libraries/content_16.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nSuffolk Libraries - World Book Day Reflections\nI raised the issue of Suffolk Libraries being taken in house by Suffolk County Council in the Commons\nMar 7\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_nautilus/content_112.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nNautilus Relocation Announcement\nThis morning, Ofgem announced that they will be reversing their decision on Nautilus.\nNov 12, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_speech/content_74.html": "top of page\nNEWS\nPlanning and Infrastructure Bill Debate\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the...\nMar 25\nTen Minute Rule Bill \"Food products (market regulation and public procurement)\"\nToday, I was pleased to co-sponsor the Ten Minute Rule Bill \"Food products (market regulation and public procurement)\".\nMar 19\nProtection of Children (Digital Safety and Data Protection) Bill\nOn Friday in the House of Commons I spoke in support of the Protection of Children (Digital Safety and Data Protection) Bill.\nMar 12\nBiomass Energy Production - Westminster Hall Intervention\nI outlined that it is critical we continue to support biomass energy production, while tackling nitrate run-off.\nMar 6\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_select-committee/content_110.html": "top of page\nNEWS\nBluetongue Select Committee Questioning - DEFRA and APHA\nDuring the EFRA Select Committee, we questioned DEFRA and APHA about recent Bluetongue outbreaks.\nMar 5\nYorkshire Water + South West Water/Pennon Group Select Committee Questioning\nYesterday, in the Environment, Food, and Rural Affairs Select Committee, we spoke to Yorkshire Water and Pennon Group / South West Water.\nFeb 26\nEFRA Select Committee: Impact of changes to APR and IHT\nEFRA Select Committee: Questions on the impact of changes to APR and IHT.\nDec 11, 2024\nEFRA Select Committee: Questions to OFWAT on Water Pollution\nThis morning, the Environment, Food, and Rural Affairs Select Committee met to question senior figures from OFWAT about water pollution.\nNov 26, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_events/content_104.html": "top of page\nNEWS\nNacton Coffee Morning\nAnother busy morning, this time in Nacton, hosting a coffee morning with residents from Levington and Nacton.\nFeb 22\nMessage from Wes Streeting to Suffolk Coastal Residents\nInterested in shaping the future of the NHS? Do what Wes Streeting, Secretary of State for Health and Social Care says, get involved.\nFeb 6\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_about/content_40.html": "ABOUT\nHow Suffolk has shaped me\nLocal issues are personal priorities for me. Suffolk Coastal is the constituency I grew up in. My dad still lives in the constituency, and my mum lives in a care home in Ipswich.\nI was shaped by my early experiences living in Martlesham Heath. My dad taught at a pupil referral unit in Ipswich, and later in schools throughout Suffolk. He was – and still is – one of my greatest inspirations for what quality education should deliver.\nMy mum was an NHS nurse in Ipswich for much of her career, and for a while she worked in care homes across Ipswich and Suffolk – working night shifts whilst I was young, and often juggling two or three jobs at a time.\nSadly my mum is now suffering from dementia, and her illness is quite advanced. It’s a terrible disease that has robbed our family of so much – like so many other families across Suffolk. But this experience has also given me incredible insight into the UK’s social care system, and how so much more needs to be done to support our older population. The work of the carers and the care homes that have supported Mum over the years has been outstanding – but more needs to be done to support people and their carers, and to make quality care affordable.\nA career in campaigning and creating change\nI moved away from Suffolk in 2005 to go to university, but I kept my ties with the county. I continued my basic training and officer training with the Territorial Army at the TA unit in Ipswich (RLC, 202 Squadron) until 2009.\nUnfortunately, and as many young people in Suffolk experience, I had to move away to build a career in London.\nSuffolk has much to offer – but sadly careers for young people are often built outside of the county. I am keen to champion more employment opportunities across Suffolk, and help to create more routes for people to build careers here, so that young people who want to live, work, and grow in Suffolk can do so.\nMy job as Managing Director at a prominent national communications agency means that I am experienced in leading complex national campaigns that deliver positive change. I’ve led campaigns tackling big issues such as infrastructure and transport, social housing, the UK’s housing crisis, fuel poverty, and the creation of employment opportunities for some of the most hard-to-reach communities in the UK.\nI’m also passionate about creating a clean, green, and vibrant Suffolk Coastal. We are proud to be host to some of the country’s most scenic villages, rivers, and coastline – but we need to do more to protect our natural environment and beautiful landscape.\nIf Suffolk Coastal is to continue to grow and prosper, we need better transport and infrastructure. Too often our roads and train services prevent people from getting to work, or stop people from travelling around the county and beyond. I will work with other leaders across the county to fix our broken transport system, and to attract the inward investment our county needs.\nAs the MP for Suffolk Coastal, I only have one job: to represent the people of Suffolk Coastal. From Southwold, Woodbridge, Leiston, and Felixstowe to Saxmundham – and every village and household across the constituency - I pledge to be the MP that Suffolk Coastal deserves.\nMAIDEN SPEECH",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_felixstowe-nhs-workshop-and-wangford-coffee-morning/content_111.html": "Felixstowe NHS Workshop and Wangford Coffee Morning\n- Jennifer Riddell- Carpenter\n- Feb 8\n- 1 min read\nIt's been a busy couple of days, having last night held my NHS Workshop in Felixstowe, and this morning my first coffee morning in Wangford. Thank you to everybody who came along, it was a chance to hear about the things that matter locally, and our workshop explored some critical issues that ill be taking forward in my submission to the Department for Health and Social Care.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_contact/content_33.html": "top of page\nCONTACT\nPlease email me at jenny.riddellcarpenter.mp@parliament.uk\nWhen emailing please provide your full postal address & any reference numbers of casework that has previously been raised.\nTelephone\n020 7219 7788\nWrite\nIf you would prefer to write to me, please write to:\nJenny Riddell-Carpenter MP\nHouses of Parliament\nWestminster\nLondon\nSW1A 0AA\nRemember to include your full postal address in your letter so that I can write back.\nFELIXSTOWE CONSTITUENCY OFFICE\nI will be opening my constituency office in Felixstowe in early 2025. More details will be shared here and on social media soon.\nFIND YOUR MP\nStrict Parliamentary protocol means MP's are only able to respond to their constituents. You can check whether I am your MP by entering your postcode here:\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_page_4/content_87.html": "top of page\nNEWS\nFelixstowe NHS Workshop and Wangford Coffee Morning\nIt's been a busy couple of days, having last night held my NHS Workshop in Felixstowe, and this morning my first coffee morning in Wangford.\nFeb 8\nRoad Safety Visit in Woodbridge\nOut yesterday morning talking to residents about road safety concerns in Woodbridge, on the A12.\nFeb 8\nVisit with SouthGen at The Canteen - Southwold\nWonderful to visit The Canteen Southwold today.\nFeb 7\nMessage from Wes Streeting to Suffolk Coastal Residents\nInterested in shaping the future of the NHS? Do what Wes Streeting, Secretary of State for Health and Social Care says, get involved.\nFeb 6\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_flooding/content_58.html": "top of page\nNEWS\nMeeting with Minister Emma Hardy MP: Parliamentary Under-Secretary of State for Water and Flooding\nI recently met with Minister Emma Hardy MP, Parliamentary Under-Secretary of State for Water and Flooding, to discuss the all too...\nMar 10\nPotters Bridge Flooding: All-Agency Meeting\nLast week I held an all-agency meeting on the repeated flooding of Potters Bridge.\nDec 10, 2024\nMeeting with residents affected by flooding in Tunstall\nYesterday afternoon I met with residents from Tunstall, who were badly flooded in last year's Storm Babet.\nNov 23, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_woodbridge-christmas-light-switch-on-2024/content_133.html": "Woodbridge Christmas Light Switch On 2024\n- Jennifer Riddell- Carpenter\n- Nov 28, 2024\n- 1 min read\nIt was an absolute honour to join Town Mayor Robin Sanders in switching on Woodbridge's Christmas lights this evening. Thanks to everyone who came out to make this night so special – from the lantern parade and live music, to the food stalls, it was a great start to the festive season and a celebration of our local community.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_minister/content_105.html": "top of page\nNEWS\nMeeting with Minister Emma Hardy MP: Parliamentary Under-Secretary of State for Water and Flooding\nI recently met with Minister Emma Hardy MP, Parliamentary Under-Secretary of State for Water and Flooding, to discuss the all too...\nMar 10\nMessage from Wes Streeting to Suffolk Coastal Residents\nInterested in shaping the future of the NHS? Do what Wes Streeting, Secretary of State for Health and Social Care says, get involved.\nFeb 6\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_heritage/content_82.html": "top of page\nNEWS\nMeeting with The Landguard Trust\nOn Friday last week, I visited the Landguard Fort and Felixstowe Museum, and heard about the Landguard Nature Reserve Bird Observatory.\nMar 3\nMeeting on the future of Trimley Station\nI was delighted to participate in a meeting on Friday about the future of Trimley Station.\nFeb 3\nMeeting On The Future Of Trimley Station\nI met with Trimley Station Trust, Greater Anglia, Community rail and other stakeholders to talk about the future of the Trimley Station.\nFeb 1\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_take-part-in-my-send-survey-and-report/content_98.html": "Take part in my SEND survey and report\n- Jennifer Riddell- Carpenter\n- Jan 3\n- 1 min read\nUpdated: Jan 7\nI want to hear from people in Suffolk Coastal who have been directly affected by Special Educational Needs and Disabilities (SEND).\nProvide your feedback through my survey here.\nI'm asking all parents of young students who have been impacted by SEND provision and services in Suffolk Coastal to get in touch to share their experiences with me, via this survey.\nI am looking for feedback from current students, as well as past experiences of SEND in Suffolk over the last five years (from 2019). Families and young people who want to submit their views into this survey will have until the end of January to provide feedback.\nEvidence that is provided will help input into a special “insights report” on SEND in Suffolk Coastal, and be used as a submission to Government and to Suffolk County Council.\nPlease note: Families and young people who take part in this call for evidence, and the subsequent report, may be invited to take part in future work undertaken by Jenny Riddell-Carpenter on the issue – including visits to Westminster and in meetings in the constituency.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_suffolk-coastal-win-dwp-admin-error/content_22.html": "Suffolk Coastal WIN - DWP Admin Error\n- Jennifer Riddell- Carpenter\n- Mar 9\n- 1 min read\nA constituent reached out to me after three years of trying to address a problem with DWP taking a payment from their pension, in an administrative error. I was able to get in contact with DWP on behalf of the constituent and resolve the issue.\nIf you need support, don’t hesitate to get in touch by emailing me at jenny.riddellcarpenter.mp@parliament.uk",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_suffolk-coastal-win-overdue-vat-refund/content_26.html": "Suffolk Coastal WIN - Overdue VAT Refund\n- Jennifer Riddell- Carpenter\n- Jan 29\n- 1 min read\nA local business reached out to me for help as they were months overdue a £10,000 VAT refund from HMRC, and struggling to get the issue resolved. After raising the issue with HMRC, and putting pressure on them to ensure that the money owed was paid as soon as possible, I was able to secure the payment for them.\nIf you or your business need support, don’t hesitate to get in touch by emailing me at jenny.riddellcarpenter.mp@parliament.uk",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-on-the-future-of-trimley-station/content_101.html": "Meeting On The Future Of Trimley Station\n- Jennifer Riddell- Carpenter\n- Feb 1\n- 1 min read\nI didn't manage to take many photos yesterday, but I did grab a few from my meeting with Trimley Station Trust, Greater Anglia, Community rail and a host of other stakeholders to talk about the future of the Trimley station building. Its a beautiful building that needs quite a lot of help to restore it to its former glory. Watch this space to hear more plans about to revive the campaign to restore the building to its former glory.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_fairfield-and-colneis-schools-visit/content_108.html": "Fairfield and Colneis Schools Visit\n- Jennifer Riddell- Carpenter\n- Nov 22, 2024\n- 1 min read\nReally special to visit Fairfield and Colneis Schools this morning - thank you to the two student council reps who showed me around Colneis - you did a brilliant job!\nThanks for having me, it was great to have the chance to meet the head teacher, Mr Girling, the leadership team, governors, teachers and students.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_wangford/content_114.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nFelixstowe NHS Workshop and Wangford Coffee Morning\nIt's been a busy couple of days, having last night held my NHS Workshop in Felixstowe, and this morning my first coffee morning in Wangford.\nFeb 8\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_tobacco-and-vapes-bill/content_134.html": "Tobacco and Vapes Bill\n- Jennifer Riddell- Carpenter\n- Nov 27, 2024\n- 1 min read\nI don't want to see sweet shops selling vapes on our high streets, or any vapes that are clearly marketed at children. That's why I spoke yesterday to welcome the Tobacco and Vapes Bill in Parliament, which will not only ban the practice of marketing vapes to children, but will also create the first smoke-free generation. This legislation will ensure that children turning 15 this year can never legally buy tobacco.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_constituency/content_15.html": "top of page\nNEWS\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nVisit to Coastal Accessible Transport Services\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago.\nMar 21\nMartlesham Heath TESCO Advice Surgery\nAnother Friday advice surgery this afternoon - this one held in the Tesco cafe at Martlesham Heath.\nMar 21\nDWP Questions: Jobs Plus Pilot Scheme\nYesterday, I asked the Minister if the Jobs Plus Pilot scheme will be extended to Suffolk Coastal.\nMar 18\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_farlingaye-school-students-visit-parliament/content_88.html": "Farlingaye School Students Visit Parliament\n- Jennifer Riddell- Carpenter\n- Jan 21\n- 1 min read\nToday I welcomed students from Farlingaye High School in Woodbridge, to Parliament. It’s always inspiring to see young people so engaged and eager to learn about politics and to see how it all works here in Parliament. Thank you for the thoughtful questions and really good discussion.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_community/content_43.html": "top of page\nNEWS\nVisit to Coastal Accessible Transport Services\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago.\nMar 21\nMartlesham Heath TESCO Advice Surgery\nAnother Friday advice surgery this afternoon - this one held in the Tesco cafe at Martlesham Heath.\nMar 21\nLetter to Suffolk County Council calling for open decision on Suffolk Libraries\nAlong with other Suffolk MPs, I have today written to Suffolk County Council to ask them to open their decision on Suffolk Libraries.\nMar 17\nEADT Column - March 2025 - Suffolk Libraries\nSuffolk Libraries UK are at risk - find out why in my latest EADT Column.\nMar 12\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_smoking/content_139.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nTobacco and Vapes Bill\nYesterday, I spoke in Parliament to welcome the Tobacco and Vapes Bill.\nNov 27, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_weekend-door-knocking-in-leiston-and-felixstowe/content_130.html": "Weekend Door Knocking in Leiston and Felixstowe\n- Jennifer Riddell- Carpenter\n- Jan 19\n- 1 min read\nI was out on the doorstep in Leiston and Felixstowe this weekend with my fantastic teams, talking to people about the issues that matter to them and their families. Lots of new casework picked up - including more SEND and housing related issues.\nIf you have a child who is battling the system, there is still time to complete my\nThank you to everyone who spoke to me and my team.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_maersk-withdrawal-from-felixstowe/content_84.html": "Maersk Withdrawal From Felixstowe\n- Jennifer Riddell- Carpenter\n- Nov 21, 2024\n- 1 min read\nUpdated: Nov 27, 2024\nI spoke in the chamber today about Maersk’s decision to withdraw from Felixstowe.\nAs the UK's largest and busiest port, and a major contributor to national GDP, we must be investing in the transport infrastructure that surrounds Felixstowe to ensure that it remains competitive – especially our roads and our rail links.\nWe have a history of complacency and under investment in transport infrastructure in the east of England – and we need the new Labour Government to invest where the previous Government failed.\nIn light of this, I have written to the Secretary of State for Transport to highlight the urgent need for further transport infrastructure investment in Suffolk and surrounding Felixstowe, such as the Haughley and Ely junction, as well as the long overdue upgrades to the A14.\nI will continue working alongside the Port, local stakeholders, and national government to push for the necessary investment that will secure the future of our region and its communities.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_anglian-water-efra-select-committee-questions/content_24.html": "Anglian Water - EFRA Select Committee Questions\n- Jennifer Riddell- Carpenter\n- Mar 13\n- 1 min read\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Mark Thurston, CEO of Anglian Water, challenging the transparency of bonuses and the process that decides if they are paid. We also discussed water quality, testing processes and leaks, as well as their customer service record compared to other providers.\nThank you to all of those who responded to my survey - I will be writing to Anglian Water to follow up on the points raised.\nWatch a clip of the exchange here 👇",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_visits/content_23.html": "top of page\nNEWS\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nBucklesham Primary School Visit\nI had the pleasure of visiting Bucklesham Primary School recently to meet with the staff and students.\nMar 9\nSuffolk New College Visit\nI recently had of the opportunity to tour the Suffolk New College with Principal Alan Pease.\nMar 8\nMeeting with The Landguard Trust\nOn Friday last week, I visited the Landguard Fort and Felixstowe Museum, and heard about the Landguard Nature Reserve Bird Observatory.\nMar 3\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_page_6/content_107.html": "top of page\nNEWS\nEFRA Select Committee: Impact of changes to APR and IHT\nEFRA Select Committee: Questions on the impact of changes to APR and IHT.\nDec 11, 2024\nPotters Bridge Flooding: All-Agency Meeting\nLast week I held an all-agency meeting on the repeated flooding of Potters Bridge.\nDec 10, 2024\nBriefing on the Water (Special Measures) Bill\nYesterday in Parliament, I attended a briefing on the Water (Special Measures) Bill.\nDec 10, 2024\nPushchair Pitstop Christmas Party 2024\nWonderful to join Pitstop for their Xmas bash on Saturday. I even got the chance to see Santa and make a wreath!\nDec 7, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_vapes/content_140.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nTobacco and Vapes Bill\nYesterday, I spoke in Parliament to welcome the Tobacco and Vapes Bill.\nNov 27, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_environment/content_75.html": "top of page\nNEWS\nPlanning and Infrastructure Bill Debate\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the...\nMar 25\nAnglian Water - EFRA Select Committee Questions\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Mark Thurston, CEO of Anglian Water.\nMar 13\nMeeting with Minister Emma Hardy MP: Parliamentary Under-Secretary of State for Water and Flooding\nI recently met with Minister Emma Hardy MP, Parliamentary Under-Secretary of State for Water and Flooding, to discuss the all too...\nMar 10\nLet me know your views on Anglian Water\nLet me know your views on Anglian Water ahead of them appearing before the Environment, Food, and Rural Affairs Select Committee.\nMar 7\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_categories_news/content_4.html": "top of page\nNEWS\nLetter to Suffolk County Council calling for open decision on Suffolk Libraries\nAlong with other Suffolk MPs, I have today written to Suffolk County Council to ask them to open their decision on Suffolk Libraries.\nMar 17\nI'm officially (and finally) on TikTok!\nI'm officially (and finally) on TikTok! Follow me for updates, behind the scenes moments, and some fun along the way.\nMar 13\nEADT Column - March 2025 - Suffolk Libraries\nSuffolk Libraries UK are at risk - find out why in my latest EADT Column.\nMar 12\nSuffolk Libraries - World Book Day Reflections\nI raised the issue of Suffolk Libraries being taken in house by Suffolk County Council in the Commons\nMar 7\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_efra-select-committee-questions-ofwat-on-water-pollution/content_123.html": "EFRA Select Committee: Questions to OFWAT on Water Pollution\n- Jennifer Riddell- Carpenter\n- Nov 26, 2024\n- 1 min read\nUpdated: Nov 27, 2024\nThis morning, the Environment, Food, and Rural Affairs Select Committee met to question senior figures from OFWAT about the ongoing issues of water pollution and sewage spills. These are serious concerns that directly impact the health of our rivers, lakes, and coastlines, as well as the communities who rely on clean water. Holding water companies accountable is essential to ensuring they are doing everything they can to prevent pollution and protect our environment for future generations. I asked about environmental performance of water companies, and the enforcement powers of Ofwat.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_page_5/content_85.html": "top of page\nNEWS\nVisit to St Elizabeth Hospice in Ipswich\nOn Friday, I visited St Elizabeth Hospice in Ipswich, to meet CEO Judi Newman and her staff, and learn about the hospice's vital work.\nJan 23\nWestminster Hall Debate: Listed Places of Worship\nToday I spoke in Westminster Hall about the vital role listed places of worship play as community hubs.\nJan 22\nFarlingaye School Students Visit Parliament\nToday I welcomed students from Farlingaye High School in Woodbridge to Parliament.\nJan 21\nRedevelopment of James Paget Hospital and West Suffolk Hospital CONFIRMED\nGreat news for Suffolk! The redevelopment of James Paget Hospital and West Suffolk Hospital has been confirmed by Government.\nJan 21\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_potters-bridge-flooding-all-agency-meeting/content_45.html": "Potters Bridge Flooding: All-Agency Meeting\n- Jennifer Riddell- Carpenter\n- Dec 10, 2024\n- 3 min read\nThe repeated flooding and closure of Potters Bridge continues to have a significant impact on our local communities, emergency services, and businesses. This issue is much more than a simple inconvenience—it's a real challenge that affects the wellbeing and livelihoods of all who live and work here.\nOn Wednesday 4th December 2024, I chaired a meeting with representatives from Suffolk County Council (SCC), East Suffolk Council, Suffolk Highways, the Environment Agency (EA), and Natural England to address this ongoing issue. I made it clear from the outset that we need both short-term fixes and long-term solutions—and we need them communicated clearly and quickly so that the community can stay informed.\nDuring the meeting, I was briefed on the current situation. The gullies (drains) at Potters Bridge were last cleared on October 23, 2024, and Suffolk Highways have dedicated resources, including diversion signage, ready to respond when flooding occurs. However, I pressed for more proactive measures - to help now, and in future flooding incidents.\nWhile cleaning the gullies reactively after flooding is one step, the bigger challenge is the surrounding marshland water levels, which are heavily impacted by storm tides. This makes it difficult to maintain consistent clearance. I urged the team to explore proactive ways to manage the flow of water before it becomes a problem.\nSuffolk Highways shared the news that with a new contractor now in place, there is a clearer system for deploying road closure signage within two hours of a flooding event, no matter the time of day. This is certainly a step forward, but I raised concerns about the process for officially closing the road. They explained that decisions are made on-site by an inspector, who uses professional judgment to assess safety in real-time. While I understand this approach, I believe we need to ensure consistency in how those decisions are made.\nAccess to the outfall area, which plays a crucial role in managing flooding, was also discussed. The EA is working to clear the outfall, but their ability to do so is limited by access to the land. I’ve been vocal about the need to ensure sustainable access to this vital site, especially given how important the bridge is as a connection between Southwold and the surrounding communities, as well as a critical link to the local hospital.\nOne of the biggest concerns raised by the community has been the lack of communication. Many residents feel frustrated by the absence of information about what’s being done to resolve the issue. I’ve urged the council to improve its communication efforts—whether through the website, social media, or other channels—so that everyone feels informed and engaged as we work to find a solution.\nThe meeting ended with discussions on what will happen when the Environment Agency’s right to access the outfall expires in the medium term. Plans are being made for a smooth transition of responsibilities from the EA to SCC, and we’ll be scheduling follow-up meetings with all key stakeholders to ensure a coordinated approach moving forward.\nI will continue to push for the necessary actions and a sustainable, long-term solution to resolve the flooding at Potter’s Bridge. This situation is truly exceptional, and it’s going to take the combined effort of all the agencies involved to protect our community, our businesses, and our way of life.\nThank you to everyone who has been working on this issue - from the community, through to the responsible parties. It is vital that we continue to prioritise the importance of this road, and I'll continue to liaise directly with the responsible parties - pushing for immediate solutions, as well as longer term answers.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_send/content_30.html": "top of page\nNEWS\nLeading the SEND Provision Westminster Hall Debate\nThis afternoon, I had the honour of leading the Westminster Hall debate on Special Educational Needs and Disabilities (SEND) provision.\nFeb 25\nEADT February Op-Ed: Solving the SEND crisis must be the top priority in Suffolk\nThe SEND crisis in Suffolk Coastal is real, and families are suffering.\nFeb 12\n£10.3million Of Additional Funding For Suffolk SEND Provision\nIn a recent written question, I asked the Secretary of State for Education how much additional funding her department has allocated for...\nFeb 5\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog/content_36.html": "top of page\nNEWS\nPlanning and Infrastructure Bill Debate\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the...\nMar 25\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nVisit to Coastal Accessible Transport Services\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago.\nMar 21\nMartlesham Heath TESCO Advice Surgery\nAnother Friday advice surgery this afternoon - this one held in the Tesco cafe at Martlesham Heath.\nMar 21\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_woodbridge/content_14.html": "top of page\nNEWS\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nVisit to Martlesham Wilds with Suffolk Wildlife Trust\nGreat to visit to Martlesham Wilds Nature Reserve on Tuesday to meet with Suffolk Wildlife Trust.\nFeb 24\nRoad Safety Visit in Woodbridge\nOut yesterday morning talking to residents about road safety concerns in Woodbridge, on the A12.\nFeb 8\nWoodbridge Canvassing and By-Election Candidate Launch\nA sunny day in Woodbridge, talking to residents about the issues that matter to them - and introducing Des Waters, by-election candidate.\nFeb 2\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_suffolk-coastal-win-secured-surgery-appointment/content_21.html": "Suffolk Coastal WIN - Secured Surgery Appointment\n- Jennifer Riddell- Carpenter\n- Feb 17\n- 1 min read\nA constituent reached out to me after they had their appointment with a surgeon cancelled in December, despite their case being classed as urgent 15 months before. I was able to get in contact with the hospital on their behalf and secure them a new appointment.\nIf you need support, including with healthcare related issues, don’t hesitate to get in touch by emailing me at jenny.riddellcarpenter.mp@parliament.uk",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_hospital/content_135.html": "top of page\nNEWS\nRedevelopment of James Paget Hospital and West Suffolk Hospital CONFIRMED\nGreat news for Suffolk! The redevelopment of James Paget Hospital and West Suffolk Hospital has been confirmed by Government.\nJan 21\nVisit to Ipswich Hospital and meeting the Older Care Team\nLast week, I visited Ipswich Hospital, which serves much of Suffolk Coastal and the wider area.\nJan 16\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_planning-and-infrastructure-bill-debate/content_17.html": "Planning and Infrastructure Bill Debate\n- Jennifer Riddell- Carpenter\n- Mar 25\n- 1 min read\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the planning and delivery of major energy infrastructure projects. In the short term, developers must work together better - the cumulative impact of these projects is vast and we need better coordination now.\nAs I made clear to Ministers yesterday- this hasn't been good enough. I'm pushing to make sure that the \"land use framework\" be developed further to be a \"land and sea use framework\" to improve and coordinate plans. I was clear that we must expect better from private energy developers. They make a fortune and they can afford to deliver better for net zero and for nature.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_visiting-the-university-of-suffolk-dental-cic/content_76.html": "Visiting The University of Suffolk Dental CIC\n- Jennifer Riddell- Carpenter\n- Mar 1\n- 1 min read\nThis government is delivering for the people of Suffolk Coastal, with 15,413 additional urgent dental care appointments being made available for Suffolk and North East Essex ICB.\nDuring my recent visit to the University of Suffolk Dental CIC, I had the chance to meet CEO Lorraine Mattis, the leadership team, staff, and students. We discussed how their work in training the next generation of dental nurses plays a key role in tackling the ongoing dental challenges in Suffolk, helping to support efforts like the additional appointments to improve access to care.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_energy/content_46.html": "top of page\nNEWS\nPlanning and Infrastructure Bill Debate\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the...\nMar 25\nNautilus Relocation Announcement\nThis morning, Ofgem announced that they will be reversing their decision on Nautilus.\nNov 12, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_visit-to-ipswich-hospital-and-meeting-the-older-care-team/content_137.html": "Visit to Ipswich Hospital and meeting the Older Care Team\n- Jennifer Riddell- Carpenter\n- Jan 16\n- 1 min read\nLast week, I visited Ipswich Hospital, which serves much of Suffolk Coastal and the wider area.\nDuring my visit, we talked about the strain the hospital is under with the current flu outbreak - and the wider pressures that emergency health care is under all year round.\nThe reforms, funding and commitment to supporting our NHS will help build a stronger health care system, but it doesn't make it easier for those working in our NHS or receiving care today. Thank you to everyone working so hard to deliver under such enormous pressure.\nI also meet with Dr Dan Coates and the Older Care team. Their innovative approach ensures frailer patients receive tailored support in a calmer, less stressful environment, allowing them to get the best care possible. A huge thank you for hosting me and for the ongoing dedication to providing such compassionate care.\nIf you want to get involved in helping to shape the future of our NHS, join me for one of my upcoming workshops in Felixstowe, Saxmundham or via my online survey. More details available here.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_page_7/content_52.html": "top of page\nNEWS\nMaersk Withdrawal From Felixstowe\nI spoke in the chamber today about Maersk’s decision to withdraw from Felixstowe.\nNov 21, 2024\nWoodbridge Door Knocking - November 2024\nI promised I'd be out knocking all year round, not just at elections.\nNov 16, 2024\nEast Suffolk Business Awards\nWonderful to be at the Suffolk Chamber of Commerce East Suffolk Business Awards Gala evening last night.\nNov 15, 2024\nMeeting with Reydon Parish Council\nGreat to be hosted this afternoon by Reydon Parish Council, a really constructive meeting, and thanks for the warm welcome.\nNov 15, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_education/content_32.html": "top of page\nNEWS\nBucklesham Primary School Visit\nI had the pleasure of visiting Bucklesham Primary School recently to meet with the staff and students.\nMar 9\nSuffolk New College Visit\nI recently had of the opportunity to tour the Suffolk New College with Principal Alan Pease.\nMar 8\nLeading the SEND Provision Westminster Hall Debate\nThis afternoon, I had the honour of leading the Westminster Hall debate on Special Educational Needs and Disabilities (SEND) provision.\nFeb 25\nEADT February Op-Ed: Solving the SEND crisis must be the top priority in Suffolk\nThe SEND crisis in Suffolk Coastal is real, and families are suffering.\nFeb 12\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_ten-minute-rule-bill-food-products-market-regulation-and-public-procurement/content_41.html": "Ten Minute Rule Bill \"Food products (market regulation and public procurement)\"\n- Jennifer Riddell- Carpenter\n- Mar 19\n- 1 min read\nSupermarkets are squeezing the food supply chain too tightly, often forcing unfair prices on farmers, producers and the whole supply chain. These giant corporations are acting more like cartels; forcing unfair prices and practices on farmers, all while profiting from rising costs. Two of the 'big six' supermarkets didn't even pay corporation tax last year.\nToday, I was pleased to co-sponsor the Ten Minute Rule Bill \"Food products (market regulation and public procurement)\", which aims to tackle this issue head-on. This bill aims to give more powers to the Groceries Code Adjudicator and create stronger coordination with the Agricultural Supply Chain Adjudicator, ensuring fairer practices, better public procurement for British food, and clearer labelling. It’s time to level the playing field and give our farmers the support they deserve.\nTen Minute Rule bills don't tend to make it far in our 'legislative process' - but its an important issue that I have been talking about a lot recently in parliament and in the press. Watch my speech about this very topic in the commons last week 👇",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_road-safety/content_54.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nRoad Safety Visit in Woodbridge\nOut yesterday morning talking to residents about road safety concerns in Woodbridge, on the A12.\nFeb 8\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_pollution/content_131.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nEFRA Select Committee: Questions to OFWAT on Water Pollution\nThis morning, the Environment, Food, and Rural Affairs Select Committee met to question senior figures from OFWAT about water pollution.\nNov 26, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_efra-select-committee-impact-of-changes-to-apr-and-iht/content_102.html": "EFRA Select Committee: Impact of changes to APR and IHT\n- Jennifer Riddell- Carpenter\n- Dec 11, 2024\n- 1 min read\nThis morning, as a member of the Environment, Food, and Rural Affairs Select Committee, I questioned key stakeholders from the farming industry about the impact of changes to Agricultural Property Relief and Inheritance Tax.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_eadt-column-march-2025-suffolk-libraries/content_12.html": "EADT Column - March 2025 - Suffolk Libraries\n- Jennifer Riddell- Carpenter\n- Mar 12\n- 1 min read\nSuffolk Libraries UK are at risk - find out why the decision by Suffolk County Council to take the libraries back in house will hurt our community in my latest EADT column 👇",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_nacton-coffee-morning/content_128.html": "Nacton Coffee Morning\n- Jennifer Riddell- Carpenter\n- Feb 22\n- 1 min read\nAnother busy morning, this time in Nacton, hosting a coffee morning with residents from Levington and Nacton. Thank you to everybody who came along, it was great to meet so many of you.\nMy next coffee morning is going to be in Wrentham in 2 weeks - RSVP here:",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_woodbridge-canvassing-and-by-election-candidate-launch/content_56.html": "Woodbridge Canvassing and By-Election Candidate Launch\n- Jennifer Riddell- Carpenter\n- Feb 2\n- 1 min read\nA sunny day in Woodbridge, talking to residents about the issues that matter to them - parking, roads and road safety - lots going on, and lots to do. And delighted to also introduce Des Waters, as the Labour candidate for the upcoming by-election for East Suffolk Council Woodbridge ward on 27th Feb. I've known Des for years, he's a brilliant campaigner, passionate advocate for the environment and a good friend. Very happy to endorse Des for Woodbridge!",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_visit-to-coastal-accessible-transport-services/content_2.html": "Visit to Coastal Accessible Transport Services\n- Jennifer Riddell- Carpenter\n- Mar 21\n- 1 min read\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago, to see firsthand the incredible work they do for our community. For those who can’t access public transport—whether due to mobility challenges or rural isolation—CATS is a lifeline, providing reliable and accessible transport to those who need it most.\n🙌 A huge thank you to the dedicated team and volunteers who keep this vital service running. Your commitment makes a real difference in people’s lives!",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_suffolk-coastal/content_42.html": "top of page\nNEWS\nPlanning and Infrastructure Bill Debate\nIn yesterday's Planning and Infrastructure Bill debate in the Commons, I called out the last government's lack of leadership on the...\nMar 25\nMeeting with The Fire Brigades Union in Woodbridge\nOn Friday, I met with the Fire Brigades Union in woodbridge to hear directly from firefighters about their vital work.\nMar 24\nVisit to Coastal Accessible Transport Services\nI had the pleasure of visiting Coastal Accessible Transport Services (CATS) a few weeks ago.\nMar 21\nMartlesham Heath TESCO Advice Surgery\nAnother Friday advice surgery this afternoon - this one held in the Tesco cafe at Martlesham Heath.\nMar 21\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_leiston/content_136.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nWeekend Door Knocking in Leiston and Felixstowe\nI was out on the doorstep in Leiston and Felixstowe this weekend with my fantastic teams, talking to people about the issues that matter to\nJan 19\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_i-m-officially-and-finally-on-tiktok/content_25.html": "I'm officially (and finally) on TikTok!Jennifer Riddell- Carpenter Mar 131 min readFollow me on TikTok for updates, behind-the-scenes moments, and some fun along the way 👇https://www.tiktok.com/@jenny.suffolk.coastal",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_westminster-hall-debate-listed-places-of-worship/content_122.html": "Westminster Hall Debate: Listed Places of Worship\n- Jennifer Riddell- Carpenter\n- Jan 22\n- 1 min read\nUpdated: Feb 1\nLast week I spoke in Westminster Hall about the vital role listed places of worship play as community hubs. These historic spaces are more than just places of worship—they are centres for connection, support, and service that do so much to support out local communities.\nI was pleased the Government has today committed to this grant scheme for a further year, with £23million being made available.\nWhilst speaking in the debate I was able to highlight some of the great work undertaken by many places of worship in Suffolk Coastal who serve their communities so well.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_visit-to-martlesham-wilds-with-suffolk-wildlife-trust/content_31.html": "Visit to Martlesham Wilds with Suffolk Wildlife Trust\n- Jennifer Riddell- Carpenter\n- Feb 24\n- 1 min read\nGreat to visit to Martlesham Wilds Nature Reserve on Tuesday to meet with Suffolk Wildlife Trust – a chance to talk about their work to protect and enhance nature, right across Suffolk.\nMartlesham Wilds is on my doorstep, and a great example of rewilding – where “nature gets to take the lead”, and a former organic farm has been returned to nature, and opened up to the public to enjoy.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_bucklesham-primary-school-visit/content_51.html": "Bucklesham Primary School Visit\n- Jennifer Riddell- Carpenter\n- Mar 9\n- 1 min read\nI had the pleasure of visiting Bucklesham Primary School recently to meet with the staff and students. We talked about the SEND challenges the school faces, and I had the chance to meet with the head pupil and members of the Student Council. A big thank you for showing me around and talking to me about their own priorities for the school and the students.\nThe school – and the students - raised their concerns with me about the nearby road having a 60mph speed limit. It’s clearly an unsafe road, especially so close to a primary school, frequently crossed by parents and children. I’ll be liaising again with the council to address this issue and ensure the safety of everyone in the area.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_westminster-hall/content_91.html": "top of page\nNEWS\nBiomass Energy Production - Westminster Hall Intervention\nI outlined that it is critical we continue to support biomass energy production, while tackling nitrate run-off.\nMar 6\nLeading the SEND Provision Westminster Hall Debate\nThis afternoon, I had the honour of leading the Westminster Hall debate on Special Educational Needs and Disabilities (SEND) provision.\nFeb 25\nWestminster Hall Debate: Listed Places of Worship\nToday I spoke in Westminster Hall about the vital role listed places of worship play as community hubs.\nJan 22\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_labour/content_106.html": "top of page\nNEWS\nWoodbridge Canvassing and By-Election Candidate Launch\nA sunny day in Woodbridge, talking to residents about the issues that matter to them - and introducing Des Waters, by-election candidate.\nFeb 2\nLabour MPs Open Letter To Supermarket CEOs\nYesterday, I and 45 other Labour MP’s from across England, Scotland and Wales wrote to the CEOs of the UK’s six largest supermarkets.\nJan 31\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_briefing-on-the-water-special-measures-bill/content_116.html": "Briefing on the Water (Special Measures) Bill\n- Jennifer Riddell- Carpenter\n- Dec 10, 2024\n- 1 min read\nYesterday in Parliament, I attended a briefing on the Water (Special Measures) Bill, where I had the opportunity to meet with experts, stakeholders, and activists. It’s clear that our current system of water ownership and governance is falling short of delivering the clean water and reliable sewerage services that the public rightfully expects.\nI’m optimistic about the changes this Bill could bring. It’s a crucial opportunity to address these challenges and ensure our rivers, lakes, and seas are safe, sustainable, and fit for both people and wildlife. We need stronger, more effective action to make this a reality.\nGreat to catch up with Feargal Sharkey too!",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_efra/content_77.html": "top of page\nNEWS\nAnglian Water - EFRA Select Committee Questions\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Mark Thurston, CEO of Anglian Water.\nMar 13\nBluetongue Select Committee Questioning - DEFRA and APHA\nDuring the EFRA Select Committee, we questioned DEFRA and APHA about recent Bluetongue outbreaks.\nMar 5\nYorkshire Water + South West Water/Pennon Group Select Committee Questioning\nYesterday, in the Environment, Food, and Rural Affairs Select Committee, we spoke to Yorkshire Water and Pennon Group / South West Water.\nFeb 26\nEFRA Select Committee: Impact of changes to APR and IHT\nEFRA Select Committee: Questions on the impact of changes to APR and IHT.\nDec 11, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_christmas/content_132.html": "top of page\nNEWS\nPushchair Pitstop Christmas Party 2024\nWonderful to join Pitstop for their Xmas bash on Saturday. I even got the chance to see Santa and make a wreath!\nDec 7, 2024\nWoodbridge Royal Mail Delivery Office Visit\nHad a great visit to the Woodbridge Royal Mail Delivery Office this morning to see the hard work happening ahead of Christmas.\nDec 6, 2024\nWoodbridge Christmas Light Switch On 2024\nIt was an absolute honour to join Town Mayor Robin Sanders in switching on Woodbridge's Christmas lights this evening.\nNov 28, 2024\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_meeting-with-residents-affected-by-flooding-in-tunstall/content_100.html": "Meeting with residents affected by flooding in Tunstall\n- Jennifer Riddell- Carpenter\n- Nov 23, 2024\n- 1 min read\nYesterday afternoon I met with residents from Tunstall, who were badly flooded in last year's Storm Babet - and they are desperately now try to make sure that their homes are better protected from flooding risks again. I'll be working with the residents to make sure all the measures that promised by the County Council and other agencies are put in place.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_dentists/content_97.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nVisiting The University of Suffolk Dental CIC\nDuring my recent visit to the University of Suffolk Dental CIC, I had the chance to meet CEO Lorraine Mattis, staff, and students.\nMar 1\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_water/content_37.html": "top of page\nNEWS\nAnglian Water - EFRA Select Committee Questions\nYesterday in the Environment, Food, and Rural Affairs Select Committee, I questioned Mark Thurston, CEO of Anglian Water.\nMar 13\nMeeting with Minister Emma Hardy MP: Parliamentary Under-Secretary of State for Water and Flooding\nI recently met with Minister Emma Hardy MP, Parliamentary Under-Secretary of State for Water and Flooding, to discuss the all too...\nMar 10\nLet me know your views on Anglian Water\nLet me know your views on Anglian Water ahead of them appearing before the Environment, Food, and Rural Affairs Select Committee.\nMar 7\nYorkshire Water + South West Water/Pennon Group Select Committee Questioning\nYesterday, in the Environment, Food, and Rural Affairs Select Committee, we spoke to Yorkshire Water and Pennon Group / South West Water.\nFeb 26\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_nautilus-relocation-announcement/content_64.html": "Nautilus Relocation Announcement\n- Jennifer Riddell- Carpenter\n- Nov 12, 2024\n- 1 min read\nUpdated: Nov 27, 2024\nThis morning, Ofgem announced that they will be reversing their decision on Nautilus - and that the landing point should be located at the Isle of Grain. This is fantastic news.\nToday in the House of Commons, I spoke on this announcement - which comes after direct recommendations, meetings and submissions from me since the election, as well as the feedback Ofgem received from local communities, environmental groups, and other stakeholders.\nThis is a key step in balancing the UK’s energy transition with the protection of our natural environment. I’ve been clear since day one that brownfield sites should be the priority for infrastructure projects. I’m confident this decision will lead to a more sustainable, well-planned project.",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_blog_tags_aldeburgh/content_86.html": "top of page\nHome\nSurgeries\nNews\nAbout\nJenny's Visits\nContact\nNEWS\nAll Posts\nParliament\nNews\nEFRA Select Committee\nConstituency\nVisits\nWINS\nAnother Busy Felixstowe Surgery\nAnother packed out advice surgery in Felixstowe completed last night.\nFeb 15\nbottom of page",
  "https_www_jennyforsuffolkcoastal_org/https_www_jennyforsuffolkcoastal_org_post_pushchair-pitstop-christmas-party-2024/content_126.html": "Pushchair Pitstop Christmas Party 2024Jennifer Riddell- Carpenter Dec 7, 20241 min readWonderful to join Pushchair Pitstop for their Xmas bash on Saturday. I even got the chance to see Santa and make a wreath!"
}