{
  "https_www_andrewfeinstein_org_/https_www_andrewfeinstein_org/content_1.html": "We’re fed up with spiralling costs and broken public services, as the super-rich get richer. Camden, there’s another choice that will put community first.\nI’m Andrew Feinstein, and I’m standing as the independent candidate for Holborn & St Pancras. Together, we can say no to austerity and corruption, and say yes to prosperity and equality. Sign-up below for campaign updates.\nJoin us to make history\nOur campaign will require knocking on every door to get the message out. There are many ways to help from leafleting, canvassing to running street stalls. Join our volunteer team today.\nWhy I'm Standing\nI’ve lived in Camden for over 22 years with my family and cherish the diversity and togetherness of our community. I served in Nelson Mandela’s government as an MP and served on the finance and trade industry committee. I founded an organisation investigating corruption into the global arms trade. Through this work, I’ve seen how our tax money is used to fund weapons, while we’re left with the rising cost of rent, food, and bills.\nTories and Labour choose to squeeze working people as the super-rich get richer. The two main parties refuse to tax the extremely wealthy, protect the NHS from further privatisation, or bring in rent caps. Voting for Labour will change nothing.\nI was chosen by members of our community to run as an Independent MP, because of my moral values and experience building an economy that works for people, not corporations. As an Independent, I’ll listen to local people, not billionaires. I’ll work for more and improved social housing, funding for our public services, and an end to the main parties’ support for genocide. It’ll be an honor to serve my community and do what’s best for local people.\nDon’t lose out.\nCheck your ID is accepted.\nCheck Your voter ID\n-\nGet involved\nJoin us for local campaign events and activities!\n-\nExternal groups\nWe welcome organisations who want to campaign for us but there are important legal and ethical requirements to be aware of.\n-\nDonate\nWhilst our campaign is covered, do consider donating as we’ll continue promoting a new kind of politics locally post-election."
}