{
  "https_fight2survive_org_/https_fight2survive_org_join-us/content_2.html": "Spread the Word: Be Our Campaign Champion\nHere's how you can be part of this movement\nVolunteer Your Time: Join us in canvassing, phone banking, or helping at campaign events to support our outreach efforts directly within our community.\nMake a Financial Contribution: Every donation helps us to fund essential campaign activities and materials in Feltham and Heston. No amount is too small, and every contribution matters.\nHost a Campaign Event: Organize house parties or informational sessions in Feltham and Heston to educate and engage neighbors about our mission and Prabhdeep’s vision for change.\n- Spread the Word: Use your social media platforms or engage in conversations with friends and family in Feltham and Heston to build awareness and support.\n- Display Campaign Materials: Show your support publicly with yard signs and banners around Feltham and Heston, or wear campaign gear to local events and gatherings.\n- Offer Professional Skills and Services: If you have specific skills such as legal expertise, marketing experience, or event coordination, consider offering them to enhance our campaign efforts in our area.\nJoin US Today !\nSign up for our email newsletter to receive updates, guidelines, and more information about our campaign. Together, we can ignite change, shape the conversation, and ensure a brighter future for all.\nJoin us today, and let’s make history together.",
  "https_fight2survive_org_/https_fight2survive_org_phase-3/content_6.html": "Phase 3 Mass Hunger Strike: Outside Sadiq Khan's Residence\nFrom Solo to Solidarity: Continuing the Fight\nPrabhdeep Singh’s lone protest in Phase 2 evolved into a powerful display of unity in Phase 3. During the weekend from September 29, 2023, to October 1, 2023, a transformative Mass Hunger Strike was organized by Prabhdeep Singh, with steadfast support from Kris Karn, outside Mr. Sadiq Khan’s residence in Tooting, London.\nThe Mass Hunger Strike marked a continuation of the resilient protest against the ULEZ expansion that began as a solitary effort. In Phase 3, Prabhdeep Singh found solidarity as five more individuals, including Nick Arlett, Marion, Leo NO ULEZ, Peter, and Navdeep Singh, actively joined the hunger strike. Together, they formed a formidable collective voice against the challenges posed by ULEZ.\nOur Demands:\nAt Fight2Survive, we advocate for change that addresses the pressing issues faced by communities in the United Kingdom. Our demands are rooted in the pursuit of a fair and equitable society, where individuals and families can thrive without the burden of economic challenges\nAffordable Living Policies:\nWe demand the implementation of comprehensive and sustainable policies that promote affordable living. This includes measures to address the cost of living crisis, such as fair pricing regulations, accessible housing solutions, and initiatives that alleviate financial burdens on households. Our aim is to create an environment where basic necessities are within reach for everyone, fostering a society where economic challenges are minimized.\nEquitable Economic Support:\nWe advocate for equitable economic support that ensures a safety net for those facing financial hardships. This involves the development and enhancement of social welfare programs, unemployment benefits, and financial assistance initiatives. Our demand is to create a robust support system that safeguards the well-being of individuals and families during economic downturns, fostering resilience and reducing the impact of financial crises.\nTransparent and Inclusive Governance:\nWe call for transparent and inclusive governance practices that actively involve the community in decision-making processes. This includes advocating for policies that address the concerns of the public, engaging in open dialogue with citizens, and fostering a collaborative approach to policy development. Our demand is for a governance framework that listens to the diverse voices of the population, ensuring that policies are fair, just, and representative of the needs of the people.",
  "https_fight2survive_org_/https_fight2survive_org_about/content_7.html": "Driven by Empathy, Fueled by Action: Discover the Heart of Fight2Survive\nOur Mission\nOur mission is rooted in the belief that every person deserves the opportunity to live a life free from financial hardship and insecurity. We recognize the impact that factors such as inflation, economic disparities, and policy decisions can have on people’s lives. Our aim is to raise awareness, inspire action, and foster a sense of community that empowers individuals to overcome these challenges.\nJoin The Fight\nIf you believe in the importance of a fair and just society where everyone has the opportunity to thrive, we invite you to join us in our mission. Whether it’s participating in our campaigns, spreading awareness, or contributing to our efforts, your involvement can make a real impact.\nAt Fight2Survive, we stand united against the challenges of today to create a brighter, more inclusive tomorrow. Together, we can overcome obstacles, drive change, and build a society that empowers and uplifts all its members.\nJoin us today and be part of the journey towards a better future.",
  "https_fight2survive_org_/https_fight2survive_org_phase-1/content_3.html": "Phase 1 Hunger Strike: Fighting to Survive Inflation\nTaking a Stand Against Soaring Inflation\nIn the face of skyrocketing inflation and the increasing burden it places on households across the UK, Fight2Survive has embarked on a bold mission to demand economic justice. Since early 2021, the cost of living has been on the rise, impacting the affordability of goods and services for ordinary citizens. In May 2022, the annual rate of inflation reached its highest level since 1982, leaving families struggling to make ends meet. Consumer prices, as measured by the Consumer Prices Index (CPI), surged by a staggering 9.1% compared to the previous year.\nOur Demands:\nAs we take this stand to fight for survival against the crushing weight of inflation, we present our demands, rooted in the principles of fairness, equality, and economic relief for all.\nWindfall Tax on Big Energy Bosses\nIt's time for accountability. We demand a windfall tax on the CEOs of energy companies who have reaped disproportionate profits while ordinary citizens bear the brunt of rising energy costs. This tax will contribute to addressing the financial strain on households and investing in sustainable energy solutions.\nImmediate Relief: Releasing VAT from Fuel & Energy Bills\nTo provide swift and tangible relief to struggling families, we call for the release of VAT from fuel and energy bills. This move will alleviate financial pressure and offer immediate support to those grappling with mounting expenses.\nFair Wages for Essential Workers\nThe backbone of our nation relies on the hard work of railway workers, Post Office workers, BT, Openreach, and others. We demand an increase in the basic pay rate for these essential workers who contribute significantly to the country's functioning. Their demands should not be ignored.\nWe Are Not Non-Political\nThough we may not hold political positions, we refuse to be dismissed as apolitical. Our actions reflect our commitment to advocating for the well-being of every citizen, free from the constraints of partisan agendas.\nChange of Policies, Not Just Faces\nBoris's resignation is not enough to address the pressing issues we face. We require a fundamental change of policies that prioritizes the interests of the people over political posturing.\nPrioritize the People's Survival\nIt's time for the Tory government to redirect its attention. We urge the government to cease favoring oligarchies and, instead, to concentrate on securing the survival of everyday citizens.\nSlash Energy Bills\nIn our pursuit of economic justice, we demand a reduction in energy bills. This reduction will ease the financial burden on households and contribute to a fairer distribution of resources.\nEnd Food Poverty\nNo citizen should go hungry. We demand swift action to end food poverty, ensuring that everyone has access to nourishing meals and the basic necessities of life.",
  "https_fight2survive_org_/https_fight2survive_org_contact/content_4.html": "Contact Fight2Survive: Your Voice Matters to Us\nOur team is dedicated to fostering meaningful conversations with individuals, supporters, and advocates who share our passion for positive transformation. Your input is invaluable as we work together to address the challenges of the cost of living crisis and create opportunities for financial empowerment.",
  "https_fight2survive_org_/https_fight2survive_org_phase-4/content_5.html": "Phase 4: From Streets to Parliament\nThe Strategic Alliance with Reform UK\nIn recognition of our shared values and objectives, Fight2Survive has formed a strategic alliance with the Reform UK party. This partnership amplifies our ability to effect change, combining our grassroots vigor with a powerful political platform. Prabhdeep Singh’s candidacy for Feltham and Heston under the Reform UK banner is a testament to our united front against injustices and disparities affecting our community.\nPrabhdeep Singh's Candidacy and Vision\nPrabhdeep Singh embodies the spirit and determination of Fight2Survive. His decision to run as the Reform UK Parliamentary Candidate for Feltham and Heston is a beacon of hope for all of us seeking tangible, lasting change. Prabhdeep’s deep-rooted connection with our community and his forward-looking vision are central to our collaborative mission with Reform UK.",
  "https_fight2survive_org_/https_fight2survive_org/content_1.html": "Breaking the Chains of Inflation: Fight for Affordable UK Living\nMeet the Force for Change\nAt Fight2Survive, we’re driven by a profound commitment to alleviating the financial strain experienced by families across the United Kingdom. Our organization, Fight2Survive, emerged as a beacon of hope and change in the face of this growing crisis. We believe that every individual deserves the opportunity to thrive without being weighed down by economic challenges. Through our dedicated campaign, we’re rallying communities, families, and citizens to unite against these rising costs.\nOur mission encompasses more than just addressing the symptoms of inflation; it’s about creating sustainable change for a brighter future. We’re working tirelessly to raise awareness, advocate for fair pricing, and implement actionable solutions that directly counter the impact of inflation on daily lives.\nPhase 4: From Streets to Parliament\nEmbarking on a pivotal chapter in our movement, we introduce ‘From Streets to Parliament’—a bold leap forward with the Reform UK party. This phase marks a transformative journey for Fight2Survive, led by Prabhdeep Singh. Together, we’re not just advocating from the outside; we’re stepping into the arena of decision-making to champion the causes closest to our hearts.\nPhase 2: #NO 2 ULez\nAs London’s Ultra Low Emission Zone (ULEZ) gears up for an expanded rollout in August 2023, our Phase 2 campaign, “No to ULEZ,” takes center stage in advocating for the concerns of the everyday citizen. With each passing day, the cost of living crisis looms larger, burdening families and individuals across the city. The ULEZ, with its daily fee of £12.50, translates to an annual cost of approximately £4,500 – a significant financial strain that raises questions about affordability, fairness, and the impact on vulnerable communities.\nDiscrimination\nDISCRIMINATION against those who cannot afford to buy or upgrade their vehicle (largely due to the already soaring costs of simply living with basic necessities !).\nBankruptcy\nBANKRUPTCY can be a reality to those on a minimum wage who have to purchase a new vehicle and then struggle to keep up the instalments.\nTAX\nTAX on the working class under the pretext of clean air. There is no backing for this which can be seen by the £5 drop off charges at airports. How does paying £5 clean the air?\nPrabhdeep Singh on a 7 day hunger strike against ulez\n\" Listen to the People \"\nIn a powerful display of conviction, our Prabhdeep Singh, a British Army veteran and former Royal Army Dental Corp member, has embarked on a 7-day hunger strike to protest the expansion of Sadiq Khan’s Ultra Low Emission Zone (ULEZ). The ULEZ, characterized by its £12.50 daily clean-air tax, has stirred substantial controversy, particularly for its impending expansion across London.\nMr. Singh’s hunger strike is a poignant plea against the ULEZ expansion, which he views as an additional burden on those already grappling with the cost-of-living crisis and food poverty.\nIn the Headlines: Prabhdeep Singh's Resolute Stand Against ULEZ\n@DailyMail\n@itv.com"
}