{
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_maiden-speech/content_9.html": "Maiden Speech in Parliament on 18th July 2024\nThank you, Mr Deputy Speaker.\nIt’s a great pleasure to follow the Honourable Member for Wetherby and Easingwold and the excellent maiden speeches from my Honourable friends for Ealing Southall and Doncaster East and the Isle of Axholme.\nIt gives me great delight to address this House as the new Member of Parliament for Kensington & Bayswater.\nI won’t say the last seven weeks have been easy.\nI know many honourable members are still catching up on their sleep after the campaign trail, but having our twins born the first week of the General Election campaign took things to another level.\nIf timing is everything in politics, then this is certainly not a combination I would recommend anyone repeating – even if they will have a great story to tell when they are older.\nI do want to take a moment to thank the team at Queen Charlotte’s and across the Imperial College NHS Trust for their incredible care.\nOur NHS staff deserve our utmost respect and support – and I hope in the future St Mary’s, Hammersmith and Charing Cross hospitals will finally get what they need to become the first class premises that patients and staff deserve, including delivering on the plans for a brand new St Mary’s hospital.\nI want to pay tribute to my two predecessors in this new constituency.\nFelicity Buchan worked hard for the residents of Kensington in the past five years, and I want to particularly commend her work on the Homes for Ukraine programme.\nThere are some issues central to our national and international security that transcend party politics – and supporting the struggle for a free Ukraine is one of them and I’m grateful for her work on this issue.\nKensington & Bayswater is home to the Ukrainian Cultural Centre, the Ukraine Embassy and a substantial Ukrainian population – and having personally worked to support democracy and anti-corruption efforts in Ukraine for many years – I will make sure our Ukrainian community continues to have a strong advocate in Parliament.\nI was also fortunate enough to inherit part of Dame Karen Buck’s former constituency of Westminster North – and under previous boundaries, Karen represented North Kensington for many years.\nI know from experience that tens of thousands of residents have been directly assisted by Karen and her team with expertise and empathy.\nAnd I hope I can emulate even a small part of her unwavering focus on tackling poverty and our housing crisis – whether it is holding our social housing landlords to account, providing protection for private renters and abolishing section 21 no-fault evictions, or finally ending the outdated feudal leasehold system.\nKaren did a monumental amount of work to advance these causes and I’m sure will be delighted with their inclusion in the King’s Speech.\nShe has always exemplified public service over self-interest and I will do my best to try and live up to her legacy – and I know how grateful we all are for her 27 years of service in this House.\nKensington & Bayswater is an incredible part of London as many of you will already know – with amazing community organisations, businesses, entrepreneurs, charities, heritage, music, parks, schools and so much going for it – but also a deep inequality that has widened in recent years.\nThere is now a gulf of 19 years between the life expectancy of a woman born in Notting Dale in North Kensington compared with Holland Park – only a third of a mile away from each other – a gap that has increased by 5 years in the last decade alone.\nOver 6000 children are living in poverty, and over 3000 families are on a growing housing waiting list.\nSo while we are rightly proud of our contribution to the nation’s economy in terms of growth, talent and innovation in so many different industries.\nAnd we celebrate the tourists who come to visit our museums, Portobello Road and our parks – we must also tackle the underlying causes of that inequality, from housing to education and employment opportunities.\nBecause I know from the thousands of people I’ve met across our constituency that far too many feel like government is not working for them.\nThey see too many politicians putting political party before country, self-interest before community.\nAnd I know that trust in government – and politicians – has plummeted in this country as a result.\nBut it doesn’t have to be this way. I’ve spent my career working to make democracy work better in dozens of countries around the world by supporting reformers in government to work with civil society to be more transparent, more inclusive and more accountable – and to deliver for people on the priorities they care about.\nIn Kensington & Bayswater that means for example getting a grip on the dirty money in luxury property that still stains our community.\nDespite recent progress in legislation and the leadership that Baroness Hodge and others have shown in this House, we still have one of the highest numbers of anonymously owned properties registered in tax havens in our constituency – with loopholes allowing autocrats and kleptocats to continue shielding their ownership.\nMany of those properties sit empty – hurting our local businesses, our schools and hollowing out our sense of a shared community.\nSo I am determined to build on our Kensington Against Dirty Money campaign, and continue advocating for London to end its reputation as the dirty money capital of the world, and instead become the anti-corruption capital of the world.\nThere is no worse example of what happens when government stops listening to people, and transparency and accountability is discarded, than what happened at Grenfell Tower over seven years ago.\n72 people lost their lives in an entirely preventable tragedy – and yet we still do not have Truth, Justice and Change for the bereaved, survivors and affected community.\nThese are people whose lives were changed forever on the 14th June 2017, and who have had to wait far too long for justice, and for those responsible to be held to account.\nIn the coming weeks the second phase of the Public Inquiry will report and I know honourable members here will join me in looking to those recommendations to ensure that a tragedy like Grenfell can never happen again.\nI warmly welcome the inclusion of the duty of candour law for public servants in the King’s Speech and applaud the effective campaigning from those affected by Grenfell, Hillsborough, Infected Blood, Windrush and others who have suffered from the unacceptable defensive culture across too much of the public sector.\nAnd I hope we can look at further measures to ensure robust oversight of the implementation of recommendations from these inquiries.\nMr Deputy Speaker, Kensington & Bayswater is a special place, making a huge contribution to our national life in so many ways, and my hope is working with this Labour government we become a fairer place too, building on our strengths and addressing the inequalities that hold us back.\nIt won’t be easy and it won’t happen overnight. As a QPR fan I’ve learnt over many years to be realistic.\nBut we have to grasp this opportunity, to restore faith and trust in government and our democracy and to provide hope once again for a brighter future.\nI thank you, Mr. Deputy Speaker, for giving me the opportunity to make my maiden speech today.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_appointment-as-chair-of-appg-on-anti-corruption-and-responsible-tax/content_17.html": "I am delighted to be elected as Chair of the cross-party Anti-Corruption group – with a great set of co-chairs and members from different political parties.\nWith trust in politics so low, tackling corruption is even more important – and there is a lot to do domestically and abroad.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_environment/content_15.html": "North Kensington Community Energy visit with Ed Miliband MP\nIt was a privilege to visit North Kensington Community Energy with Labour’s Shadow Secretary of State of Climate Change and Net Zero, Ed Miliband MP, to see the community-owned solar project in action at Westway Sports Centre. North Kensington Community Energy was born in 2018 with the aim of making Kensington & Chelsea a […]\nFighting for cleaner air for Kensington and Bayswater\nAs your MP for Kensington and Bayswater, I will always fight for cleaner air for our children Clean air helps to increase children’s life expectancy, reduces hospital admissions for asthma and serious lung conditions, and enables people to lead longer, healthier lives. That’s why I’ve been meeting with national and local organisations who are championing […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_uncategorized/content_42.html": "Statement on Notting Hill Carnival deaths\nMy statement on the tragic deaths of Cher Maximen and Imnetu after separate incidents at Notting Hill Carnival over the Bank Holiday Weekend.\nAppointment as Chair of APPG on Anti-Corruption and Responsible Tax\nI am delighted to be elected as Chair of the cross-party Anti-Corruption group – with a great set of co-chairs and members from different political parties. With trust in politics so low, tackling corruption is even more important – and there is a lot to do domestically and abroad.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_privacy-policy/content_39.html": "As the MP for Kensington and Bayswater, I and my constituency staff correspond with constituents to answer policy enquiries, take up casework, and ask for views on local and national issues.\nAs the holder of that data, I am the Data Controller. By virtue of my work as a Member of Parliament, my office staff will also have access to limited data in order to ensure the smooth running of my office. This policy will therefore reference “we”, to include me as MP, as well as my office staff.\nThis document explains how I collect and use personal data arising from this correspondence, the legal basis for doing so, and explains your rights in relation to your personal data.\nData collection and use\nPolicy enquiries and casework (where a constituent seeks my support on a matter that affects them personally) bring with them personal data provided by or on behalf of the constituent. This personal data may include, but is not limited to: name, address, email address, telephone number.\nIt may also include ‘Special Category’ data which is usually considered more private and sensitive. Special Category data relates to a person’s racial or ethnic origin; political opinions; religious or philosophical beliefs; trade union membership; genetic data; biometric data (where used for identification purposes); health; sex life; sexual orientation.\nWe will only collect and use personal data for the specific purpose for which it has been provided. We will only use Special Category data where we have both a legal basis to do so, as well as an additional condition to process.\nWe will not transfer your data beyond the EEA unless we have implemented appropriate safeguards, which are likely to be Standard Contractual Clauses, or where an “adequacy decision” has been granted by the appropriate authorities.\nWho do I share your personal information with?\nWhen processing your correspondence, we will only share your information with a third-party organisation where it is necessary and reasonable to do so.\nThird-parties, include but are not limited to: government departments, local authorities, public bodies, health trusts, regulators, system providers (with appropriate agreements or contracts in place).\nWe will only share as much information as is necessary to take your enquiry forward.\nWe will never share or sell your personal data to other organisations for direct marketing purposes.\nLawful basis for processing\nPersonal data is processed for one or more of the following lawful bases:\nRetention of personal data\nWe will only retain your personal information for as long as it is necessary to fulfil the purposes described when your personal data was originally collected. However, to provide the best service and representation for constituents, it may be necessary to revisit closed casework and policy enquiries. Closed policy enquiries will be securely and permanently deleted at the end of the Parliamentary session in which they were made. We may retain information about closed casework to be able to give you full support, should you contact us again for help. If you wish to exercise your rights to erasure, you are welcome to do so. Please see the ‘Your rights’ section for more information.\nSecurity of your Data\nWe are committed to processing and retaining data within established technological and physical controls in a transparent manner, as well as promoting and safeguarding the information rights of data subjects.\nOur procedures ensure that technological and physical controls are in place that guarantee the privacy of data subjects, the security of data held on technological systems is processed according to an established lawful processing condition. Any such procedures will be reviewed as necessary and updated to ensure their effectiveness in line with advances in technology.\nLinks to other websites\nCorrespondence from my office may provide links to other websites. We are not responsible for the content or privacy practices of these websites.\nYour rights\nYou have the following rights in relation to your personal information. Should you wish to exercise these rights, please contact the Constituency Office (contact details below):\nAsk me a question, offer your support, and keep up to date with my campaign to be your next Member of Parliament.\nPromoted by Flo Hutchings on behalf of Joe Powell both at 222 Kensal Road, Westbourne Park W10 5BN. My office may use the information you provide about your views to understand which issues are most relevant to you and to help us campaign better. By virtue of my work as Member of Parliament, I use your personal data for a variety of reasons related to engaging in the democratic process as your elected representative. Where we rely on consent, you are always able to opt out. We may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. To find out more about how we use your personal data and to view our Profiling Notice, please see our privacy policy.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_post-office-itv-drama-star-backs-labour-in-kensington-bayswater/content_12.html": "I’ll vote Labour after making Post Office drama, says Paula Vennells actor.\nThis week, the Horizon Inquiry heard evidence from the former Post Office CEO Paula Vennells.\nI’m proud that Lia Williams, who played Paula Vennells in the ITV drama Mr Bates V The Post Office, has announced that she will be backing Labour in her home constituency of Kensington and Bayswater.\nIn an exclusive video for our campaign for change, Lia said:\n“I’m going to vote for Joe because he fights this kind of corruption – he cares for victims of corruption in a very personal way”\nFrom dodgy Covid contracts to lobbying scandals and the treatment of sub-postmasters, it is clear this government has totally failed to tackle corruption.\nIf I’m election to become the MP for Kensington and Bayswater, I will continue to fight against corruption and campaign to clean up politics after years of Tory decay.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_grenfell-debate-in-parlimaent/content_49.html": "This week we had a full debate day in Parliament about Grenfell and the Inquiry Report.\nThis was, first and foremost, a moment to remember the 72 people who lost their lives in an entirely foreseeable and preventable tragedy.\nThere were powerful speeches from across the House, and many bereaved, next of kin, survivors and community members joined in the gallery.\nI want to thank each of you personally for watching or contacting me about the debate.\nI know that with each inquiry hearing, each news story, each government announcement and each new promise of change, you are forced to relive the horrific events of that night.\nAnd I know this week would have been painful too.\nYour voices must remain at the heart of the government’s response – and to all future decisions about Grenfell, and I will continue to advocate in Parliament for Truth, Justice and meaningful Change.\nYou can watch my full speech below.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_elections/content_8.html": "Labour wins landslide and takes Kensington & Bayswater\nLast Thursday, this community sent a loud and clear message that after 14 long years of Conservative government, it’s time for change. I’m proud of the positive campaign we ran, and I want to thank the people of Kensington & Bayswater for putting your trust in me. Being the MP for Kensington & Bayswater […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_local-business/content_28.html": "Labour’s plan for our high streets\nOur Labour plan for high streets will make a big difference for places like High Street Kensington and Portobello Road Residents and local businesses often tell me that they want to see change on our high streets. From bank closures and rising anti-social behaviour, it’s clear more needs to be done to make places like High […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_labours-plan-for-our-high-streets/content_32.html": "Our Labour plan for high streets will make a big difference for places like High Street Kensington and Portobello Road\nResidents and local businesses often tell me that they want to see change on our high streets.\nFrom bank closures and rising anti-social behaviour, it’s clear more needs to be done to make places like High Street Kensington and Portobello Road a safe and enjoyable destination for residents to go shopping.\nLabour has a plan to breathe life back into our high streets and deliver the change residents want to see:\n- 13,000 more neighbourhood police and PCSOs\n- Guaranteed face-to-face banking in every community\n- Replace business rates\n- Stamp out late payments\n- Revamp empty shops, pubs, and community spaces",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_meeting-with-acting-ukranian-ambassador-to-the-uk/content_11.html": "Discussion with Eduard Fesko, Ukraine’s acting ambassador to the UK\nIn the meeting at the Embassy of Ukraine in Holland Park, I emphasised Labour’s continued support for Ukraine. We discussed what more can be done to close the legal loopholes that allow Putin’s allies to store corrupt wealth in Kensington and Bayswater and across London.\nWe also discussed supporting the local Ukrainian community in this constituency. If I am elected to become Labour’s MP for Kensington and Bayswater, I look forward to continuing my work engaging with the Embassy and Ukrainian residents in Kensington and Bayswater.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_making-our-streets-safe-again/content_25.html": "No one should feel afraid in their community\nResidents across the Borough often tell me that rising crime and anti-social behaviour are key issues facing our community.\nMore needs to be done to make High Street Kensington a safe and enjoyable destination for residents to go shopping.\nI recently met with the Safer Business Network to visit High Street Kensington outlets affected by high shoplifting levels.\nSpeaking to shop staff in M&S, Zara, Space NK and TK Maxx, I heard that a failure to take tougher action against shoplifters often means retailers are taking matters into their own hands.\nNationally, Labour has a plan to tackle shoplifting gangs by ending the £200 rule brought in by the Tories, which stops shop thefts under £200 being investigated – even if the same gang comes back time and again. A Labour government will clamp down on violence against shopworkers, making it easier to take action against repeat offenders and creating a new specific offence of assault against retail workers.\nNo one should feel afraid in their community, or be constantly targeted by fraudsters. That’s why I’m putting safer streets at the heart of my message to give Kensington & Bayswater a fresh start.\nLabour has a plan to Take Back Our High Streets.\nNationally, Labour has a plan to tackle shoplifting gangs by ending the £200 rule brought in by the Tories, which stops shop thefts under £200 being investigated – even if the same gang comes back time and again. A Labour government will clamp down on violence against shopworkers, making it easier to take action against repeat offenders and creating a new specific offence of assault against retail workers.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_petition_repair-st-marys-hospital/content_31.html": "The government has biggest-ever government investment in the St Mary’s rebuild is a massive vote of confidence for the project. Residents across North and West London are desperate for this project to start as soon as possible and I agree.\nThe £50m investment over the next three years will allow planning and development work to be accelerated and explore maximising the Paddington Basin site, so we can secure financing to bring forward construction as soon as possible.\nThis funding allows us to get the project back on track after the Conservative government removed it from the New Hospital Programme in May 2023.\nBut we need to keep the pressure up to ensure we secure all the funding needed for a new St Mary’s.\nSign my petition today.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_news/content_2.html": "Biggest ever government investment announced for new St Mary’s hospital\nThe New Hospital Programme has today confirmed a £50 million investment over the next three years to allow Imperial College Healthcare to continue to the detailed design and planning phase for...",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_signup/content_7.html": "Subscribe to my e-newsletter to find out more about my work in Parliament and Kensington and Bayswater\nYou can manage your preferences or unsubscribe at any time. We may also send you emails with the latest news on our campaigns and local events. We may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications about campaigns and events you receive from us. We may also use your answers to help us campaign better. If signing up for an event, we may still use the details provided to contact you specifically, about that event. If you would like to know more about how we use your information, please visit: www.joepowell.org.uk/privacy-policy",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_plan_for_schools/content_43.html": "Visit to Fox Primary with the Shadow Education Secretary Bridget Phillipson MP\nFamilies and parents across Kensington and Bayswater often tell me they want urgent change in our schools.\nI was delighted to visit Fox Primary with our Shadow Education Secretary Bridget Phillipson MP to see their brilliant work to support children in our community to learn and thrive.\nOne of Labour’s top priorities is to break down the barriers to opportunity for all children. Our schools are central to that mission, but they are facing massive challenges.\nAs part of Labour’s first step for change (more on that below!), we’re committed to hiring 6,500 more teachers to address the recruitment crisis that is failing children across the UK, providing mental health support in all our schools and reforming Ofsted to make it more meaningful.\nAfter 14 years of Tory failure, our children deserve better. With a Labour government, we can get our education system back on track.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_education/content_27.html": "Breaking down barriers to opportunity in Kensington\nVisit to Fox Primary with the Shadow Education Secretary Bridget Phillipson MP Families and parents across Kensington and Bayswater often tell me they want urgent change in our schools. I was delighted to visit Fox Primary with our Shadow Education Secretary Bridget Phillipson MP to see their brilliant work to support children in our community […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_fighting-for-cleaner-air-for-kensington-and-bayswater/content_33.html": "As your MP for Kensington and Bayswater, I will always fight for cleaner air for our children\nClean air helps to increase children’s life expectancy, reduces hospital admissions for asthma and serious lung conditions, and enables people to lead longer, healthier lives.\nThat’s why I’ve been meeting with national and local organisations who are championing cleaner air for residents in Kensington and Bayswater and why I continue to push Kensington & Chelsea Council to take more measures to encourage active travel in our borough.\nFor too long, lung health has been sidelined, under-treated and under-resourced. Lung conditions affect 1 in 5 people in the UK, and in 2020/2021, there were over 10,000 respiratory-related emergency hospital admissions in North West London, a major cause of winter pressures on our health service.\nI recently met with the national charity Asthma + Lung UK to address how poor lung health affects residents of Kensington and Bayswater. We discussed the urgent need for change to remove health inequalities and improve lung health for all.\nI recently met with Clean Air Bayswater, a group of local residents taking action to improve the air quality in Bayswater. Clean Air Bayswater brings together local schools, residents, and businesses to ensure that everyone in our community understands the importance of breathing clean air and the role we all play in improving it.\nAs your MP for Kensington & Bayswater, I will continue championing national and local projects to make our community a safer, healthier place to live.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_international/content_41.html": "Celebrating Ukraine Independence Day\nIt was an honour to celebrate Ukraine Independence Day in Holland Park with hundreds of people from across the British Ukrainian community and supporters. My message was clear: we are with you for as long it takes, with whatever it takes, until there is victory for Ukraine and peace. https://youtu.be/X_Qz_pPL4EA I’ve asked the government to […]\nStatement on Gaza and Israel\nMany residents have contacted me about the terrible situation in Gaza and Israel. I support an immediate ceasefire, a massive increase in aid, the release of hostages and accountability for implementing the ICJ provisional recommendations. I want to see the path to a two-state solution revived with a fully recognised Palestinian state achieved as soon as […]\nMeeting with Acting Ukrainian Ambassador to the UK\nDiscussion with Eduard Fesko, Ukraine’s acting ambassador to the UK In the meeting at the Embassy of Ukraine in Holland Park, I emphasised Labour’s continued support for Ukraine. We discussed what more can be done to close the legal loopholes that allow Putin’s allies to store corrupt wealth in Kensington and Bayswater and across London. […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_reopen-kensington-palace-garden/content_3.html": "I’m calling on The Crown Estate to urgently open Kensington Palace Gardens to pedestrians and cyclists, after their decision to close the road.\nThe Crown Estate owns the road, which provides a crucial, safe connection between Notting Hill Gate and Kensington High Street for thousands of pedestrians and cyclists every day.\nIn a letter to the Crown Estate, I wrote: “Kensington Palace Gardens is a crucial north-south thoroughfare for local residents and visitors.\n“The Borough of Kensington and Chelsea ranks bottom for healthy and safe streets in Inner London, making the road even more important for pedestrians and cyclists.\n“Your decision will impact thousands of people a day, and sets a dangerous precedent of decisions being taken without consultation with your neighbours and the local community who will rightly view this as a selfish and spiteful act.”\nThe last thing we need with a Council and MP with a track record of blocking any initiatives to make our streets safer is one of the few safe roads for pedestrians and cyclists to be closed.\nSign my petition today and ask The Crown Estate to think again, and reopen the road.\nRead more about my campaign to reopen Kensington Palace Gardens in the Evening Standard here.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_statement-on-the-grenfell-inquiry-stage-ii-report/content_6.html": "Ask me a question, offer your support, and keep up to date with my campaign to be your next Member of Parliament.\nPromoted by Flo Hutchings on behalf of Joe Powell both at 222 Kensal Road, Westbourne Park W10 5BN. My office may use the information you provide about your views to understand which issues are most relevant to you and to help us campaign better. By virtue of my work as Member of Parliament, I use your personal data for a variety of reasons related to engaging in the democratic process as your elected representative. Where we rely on consent, you are always able to opt out. We may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. To find out more about how we use your personal data and to view our Profiling Notice, please see our privacy policy.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_breaking-news-labour-commits-to-new-st-marys/content_18.html": "It was a privilege to visit the hospital on Tuesday, alongside the Shadow Secretary of State for Health Wes Streeting, to announce this important news for patients and staff across Kensington & Bayswater.\nSince becoming your Labour candidate for Kensington and Bayswater, I have campaigned tirelessly for St Mary’s to be saved – and with your help, we have succeeded!\nSt Mary’s was one of 40 new hospitals that Boris Johnson and the Conservative MP for Kensington promised to build in their 2019 General Election campaign. However, the Tories shamefully removed St Mary’s from their 2030 New Hospital Programme last May, despite the terrible condition of the estate. Their claim that a few million pounds of planning money is a substitute for the £2.2 billion needed for a new hospital is disingenuous and insulting to staff and patients.\nThe three local hospitals in the Imperial College Healthcare Trust —St Mary’s, Hammersmith, and Charing Cross—have the largest major risk repair backlog of any NHS estate in the country. The Conservative government’s decision to break its promise to our hospitals was described by the CEO as “hugely damaging to the health and healthcare of hundreds of thousands of people.”\nI am delighted that Labour will reverse this decision if we win on 4th July.\nI also want to take this opportunity to thank everyone who signed my petition to rebuild our local hospitals and took part in our local ‘Save Our NHS’ campaign I launched last year.\nThere is now a clear choice for our community at the election. If you want a new St Mary’s, lower waiting lists, more mental health workers, and NHS dentistry back on its feet, then vote Labour on July 4th.\nTogether, with a Labour government, we can deliver the change our NHS desperately needs.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_parliament/content_24.html": "Appointment as Chair of APPG on Anti-Corruption and Responsible Tax\nI am delighted to be elected as Chair of the cross-party Anti-Corruption group – with a great set of co-chairs and members from different political parties. With trust in politics so low, tackling corruption is even more important – and there is a lot to do domestically and abroad.\nMaiden Speech in Parliament\nMaiden Speech in Parliament on 18th July 2024 Thank you, Mr Deputy Speaker. It’s a great pleasure to follow the Honourable Member for Wetherby and Easingwold and the excellent maiden speeches from my Honourable friends for Ealing Southall and Doncaster East and the Isle of Axholme. It gives me great delight to address this House […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_biggest-ever-government-investment-announced-for-new-st-marys-hospital/content_10.html": "The New Hospital Programme has today confirmed a £50 million investment over the next three years to allow Imperial College Healthcare to continue to the detailed design and planning phase for its St Mary’s Hospital redevelopment in Paddington.\nThis phase of work is intended to conclude with planning consent for a new hospital within a redeveloped life sciences campus in 2027/28. A first tranche of £19.4 million has been released from what is anticipated to be a total of around £50 million to complete this phase.\nJoe Powell, the MP for Kensington and Bayswater said:\n“Today’s news of the biggest ever government investment in the new St Mary’s project is a massive vote of confidence for the project. Residents across North and West London are desperate for this project to start as soon as possible and I agree.\n“The £50m investment over the next three years will allow planning and development work to be accelerated, and explore maximising the Paddington Basin site so we can secure financing to bring forward construction as soon as possible.\n“This funding allows us to take that step and get the project back on track after the Conservative government removed it from the national 2030 New Hospital Programme in May 2023.”",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_statement-on-notting-hill-carnival-deaths/content_14.html": "My statement on the tragic deaths of Cher Maximen and Imnetu after separate incidents at Notting Hill Carnival over the Bank Holiday Weekend.\nMy statement on the tragic deaths of Cher Maximen and Imnetu after separate incidents at Notting Hill Carnival over the Bank Holiday Weekend.\nAsk me a question, offer your support, and keep up to date with my campaign to be your next Member of Parliament.\nPromoted by Flo Hutchings on behalf of Joe Powell both at 222 Kensal Road, Westbourne Park W10 5BN. My office may use the information you provide about your views to understand which issues are most relevant to you and to help us campaign better. By virtue of my work as Member of Parliament, I use your personal data for a variety of reasons related to engaging in the democratic process as your elected representative. Where we rely on consent, you are always able to opt out. We may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. To find out more about how we use your personal data and to view our Profiling Notice, please see our privacy policy.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_healthcare/content_22.html": "Biggest ever government investment announced for new St Mary’s hospital\nThe New Hospital Programme has today confirmed a £50 million investment over the next three years to allow Imperial College Healthcare to continue to the detailed design and planning phase for its St Mary’s Hospital redevelopment in Paddington. This phase of work is intended to conclude with planning consent for a new hospital within a redeveloped […]\nStatement on the Chancellor’s announcement of New Hospital Programme review\nResponding to the Chancellor’s statement to the House of Commons on the 29th July 2024 on UK public finances, including that the Government will “conduct a complete reset of the New Hospital Programme, with a thorough, realistic and costed timetable for delivery”, Labour MP for Kensington and Bayswater Joe Powell said: “The case for a […]\nBREAKING NEWS: Labour commits to new St Mary’s\nIt was a privilege to visit the hospital on Tuesday, alongside the Shadow Secretary of State for Health Wes Streeting, to announce this important news for patients and staff across Kensington & Bayswater. Since becoming your Labour candidate for Kensington and Bayswater, I have campaigned tirelessly for St Mary’s to be saved – and with […]\nThis is why Gabrielle is voting Labour\nOnly Labour can be trusted with our NHS after 14 years of Tory neglect North Kensington resident Gabrielle tells me her story and why she believes a Labour government can rebuild the foundations of our NHS. https://youtu.be/nTcKpKcyBRA With waiting lists now at 7.5 million people, I am outraged that the government has broken its election promise […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_this-is-why-gabriel-is-voting-labour/content_20.html": "Only Labour can be trusted with our NHS after 14 years of Tory neglect\nWith waiting lists now at 7.5 million people, I am outraged that the government has broken its election promise to our community to rebuild and repair St Mary’s, Hammersmith, and Charing Cross hospitals by 2030.\nThe Conservative government’s decision to break its promise to our hospital was described by Imperial College Healthcare NHS Trust as “hugely damaging to the health and healthcare of hundreds of thousands of people.”\nThat’s why I wrote a joint letter to the Health Secretary in November, the seventh in just 13 years under the Tories, urging the government to reinstate their broken pledge to save our local hospitals.\nThe longer the Tories are in power the longer patients in Kensington and Bayswater will wait.\nLabour has a plan to slash the NHS waiting list with 40, 000 new appointments a year.\nLabour has turned the NHS around before. And we’ll do it again.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_we-did-it/content_26.html": "Last Thursday, this community sent a loud and clear message that after 14 long years of Conservative government, it’s time for change.\nI’m proud of the positive campaign we ran, and I want to thank the people of Kensington & Bayswater for putting your trust in me. Being the MP for Kensington & Bayswater is the greatest honour of my life.\nThe hard work starts now.\nI know from the thousands of people I’ve met on the doorstep that for too many in our community, government is not working for them.\nFrom the millions on NHS waiting lists, to households struggling to make ends meet, to the housing crisis for renters, social tenants, and homeowners, and to the bereaved, survivors, and affected community still waiting for justice seven years after the Grenfell fire tragedy, it is clear that trust in government—and politicians—is at rock bottom in this country as a result.\nThat’s why I chose to stand to represent this community. As your MP, I will continue fighting to tackle corruption, fix the housing crisis and create more opportunities for our young people. Under Labour, we will start the work to build a new St Mary’s Hospital and get the NHS back on its feet again, delivering for patients in Kensington and Bayswater.\nAs we near the publication of the Phase 2 Report on the Grenfell in September, I will continue advocating for truth, justice, and change.\nNone of this will be easy or indeed happen overnight, but I believe with Keir Starmer as Prime Minister and the Labour Party in government, change is coming.\nRegardless of whether you voted for me or not, I will work hard to earn your trust and deliver for our community.\nP.S. I am in the process of setting up my new office. If you are a constituent with a casework query, please get in touch with my office [email protected].",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_shining-a-light-on-corruption/content_29.html": "Tackling corruption and inequality in the heart of Kensington\nTaking on corruption and tax dodging will always be at the core of my mission. Dirty money erodes our democracy, increases inequality, and means we have fewer public resources for health, education and other public services.\nI led a ‘kleptocracy tour’ with Margaret Hodge MP, visiting luxury Kensington homes bought by foreign leaders who are subject to sanctions. These properties are linked to the Russian foreign minister, Sergei Lavrov, and the Azerbaijani president, Ilham Aliyev, in gated communities in Kensington.\nFor too long, we have allowed luxury properties to be bought up by autocrats, oligarchs and their families who are looting their own countries and stashing that wealth in places like this. This undermines those pushing for democracy in places like Russia and Azerbaijan, but it also undermines our local communities which is why I launched Kensington Against Dirty Money in 2022.\nDirty money also drives obscene levels of inequality in our community. This borough has 4 out of the 10 most expensive streets in England, and we also have two of the poorest neighbourhoods in London.\nThe life expectancy gap for women in those neighbourhoods is now 11.9 years – the largest increase in inequality in the past decade in the whole country.\nAt the same time, we have a housing crisis with more than 3,000 households waiting for a home and 2,100 in temporary accommodation. We have the highest number of empty homes in the country.\nThis can’t go on.\nI know from campaigning across this constituency as a parliamentary candidate that people want change. It’s bad for our housing crisis, bad for our schools with half-empty classrooms, and it’s bad for local businesses. It hollows out the community.\nIf elected as your MP for Kensington and Bayswater I will:",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_housing/content_16.html": "Statement on the Grenfell Inquiry Stage II report\nMy statement on the Grenfell Inquiry Stage II report\nLabour’s offer on leasehold reform\nLeaseholders in Kensington & Bayswater have been let down by the Tories. It’s time for change. For far too many leaseholders, the reality of home ownership falls woefully short of the dream they were promised. Labour will act where the Conservatives have failed and finally bring the feudal leasehold system to an end. […]\nShining a light on dirty money in Kensington\nTackling corruption and inequality in the heart of Kensington Taking on corruption and tax dodging will always be at the core of my mission. Dirty money erodes our democracy, increases inequality, and means we have fewer public resources for health, education and other public services. I led a ‘kleptocracy tour’ with Margaret Hodge MP, visiting […]\nFire safety meeting with Mike Amesbury MP\nThis year we finally need Truth and Justice for Grenfell bereaved and survivors I met with Mike Amesbury MP, Labour’s spokesperson for building safety, to discuss issues around fire safety for those still living in dangerous flats. It is nearly seven years on from the Grenfell fire, yet only 21% of high-rise flats have been […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_tactical-vote-sites-recommend-voting-labour-in-kensington-bayswater/content_37.html": "We’re in a tight two-horse race in Kensington and Bayswater and the latest recommendations from Get Voting confirm that.\nThe latest MRP poll from Best for Britain shows the gap between the Tories and Labour in Kensington is narrowing, with Labour only 8 points ahead.\nWhile the polls look positive for Labour nationally, it will be much tighter here in Kensington & Bayswater.\nIf you want to change the government, the only party to vote for in Kensington & Bayswater is Labour.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_crime/content_46.html": "Statement on the violence witnessed across the country\nMaking Our Streets Safe Again\nNo one should feel afraid in their community Residents across the Borough often tell me that rising crime and anti-social behaviour are key issues facing our community. More needs to be done to make High Street Kensington a safe and enjoyable destination for residents to go shopping. I recently met with the Safer Business Network […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_community/content_30.html": "Statement on the Grenfell Inquiry Stage II report\nMy statement on the Grenfell Inquiry Stage II report\nVisit to QPR in the Community Trust\nUnderstanding the role we can play in using the power of football to promote positive change It was a privilege to visit QPR in the Community Trust in North Kensington to see the incredible work they do to support children in our community. Being born in a certain area should never define your health, opportunities […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_petition_reopen-kensington-palace-gardens/content_36.html": "I’m calling on The Crown Estate to urgently reopen Kensington Palace Gardens to pedestrians and cyclists after they decided to close the road.\nThe Crown Estate owns the road, which provides a crucial, safe connection between Notting Hill Gate and Kensington High Street for thousands of pedestrians and cyclists every day.\nKensington & Chelsea is already ranked the worst inner London borough for active travel by the Healthy Streets coalition. The last thing we need with a Council and MP with a track record of blocking any initiatives to make our streets safer is one of the few safe roads for pedestrians and cyclists to be closed.\nSign my petition today and ask The Crown Estate to think again, and reopen the road.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk/content_1.html": "The case for a new St Mary’s Hospital has never been stronger, as is the need for a floor-by-floor refurbishment of Hammersmith and Charing Cross hospitals.\nPatients and staff have been let down for years, and I was appalled that the entire Imperial College NHS Trust was relegated from the list of projects to be completed by 2030 by the previous Conservative government. The money to build a new St Mary’s hospital was simply never allocated, giving people false hope and rightly creating distrust in the entire New Hospital Programme.\nI welcome the Government’s review of the New Hospital Programme. It is vital we get clarity on the funding for these three local hospitals so that plans can advance.\nAs the new MP for Kensington and Bayswater, I will continue working closely with the Imperial Trust team, the Health Secretary, and surrounding MPs to secure the best possible outcomes for our community, including a plan to get our local hospitals what they need as soon as possible.\nJoe Powell is an anti-corruption champion who has spent his life campaigning for social justice and democracy in West London, Britain and around the world, delivering real results.\nBefore becoming an MP, he was Deputy CEO of the Open Government Partnership, an organisation founded by Barack Obama to support democracy globally, including in Britain where Joe ran successful campaigns to force big oil, gas and mining companies to open up their books and pay their taxes.\nJoe is an active and winning campaigner for a fairer Kensington. In 2022, he founded the Kensington Against Dirty Money campaign that has pushed national and local governments to take action on inequality by reducing corrupt wealth in our borough, going after empty homes, and investing more in social housing.\nJoe lives in Ladbroke Grove, and grew up in Queen’s Park. He is a proud member of our community. His son and twins were born at Queen Charlotte’s Hospital and he’s a lifelong QPR fan.\nSqueezed wages, runaway food inflation, soaring rents and mortgages, and Tory tax rises have left British households suffering.\nLabour has extended the windfall tax on oil and gas company profits to provide added support for households and business.\nThe Tories broke their promise to rebuild or upgrade St Mary’s Paddington, Hammersmith and Charing Cross hospitals by 2030. Imperial College Healthcare NHS Trust says this decision will be “hugely damaging for the health and healthcare of hundreds of thousands of people”.\nUnder a Labour government, I will continue to make the case for our local hospitals.\nToo many of our communities suffer from anti-social behaviour and crime made worse by over a decade of cuts, including a cut of 75% to London’s Police and Community Support Officers.\nI will continue to campaign to keep Notting Hill Police Station in public hands, and Labour will prevent crime by putting 13,000 extra neighbourhood police and PCSOs on Britain’s streets.\nRents and mortgages are through the roof, and we have a huge shortage of social housing. Labour will build 1.5 million new homes, and I will continue to campaign against dirty money in luxury property, for leasehold reform and for Truth, Justice and Change for Grenfell bereaved and survivors.\nAs your MP I am always here to listen, support and amplify the campaign for those responsible to be held accountable, and for changes to be made to ensure this never happens again.\nI co-founded Kensington Against Dirty Money because we are at the epicentre of Britain’s addiction to corrupt wealth, much of it stashed in luxury property in our borough.\nTaking on corruption and tax dodging is at the core of my mission, because it erodes our democracy, increases inequality, and means we have less public resources for health, education and other public services.\nThe climate emergency is the greatest threat to humankind. Its effects can be felt right here in our community, in the form of flooding and extreme temperatures. Air pollution blights many of our neighbourhoods, harming our children. Labour will insulate millions of homes, and make Britain a clean energy superpower.\nLocally, I am supporting schemes to reduce air pollution, promoting community energy projects and working with local groups and the Council to encourage more active travel like cycling and walking.\nThe Tories have broken their promise to rebuild or upgrade St Mary’s Paddington, Hammersmith and Charing Cross hospitals by 2030.\nImperial College Healthcare NHS Trust says this decision will be “hugely damaging for the health and healthcare of hundreds of thousands of people”.\nJoe will fight for our local hospitals.\nDirty money is directly contributing to Kensington being the most unequal borough in the country.\nJoe is campaigning to know who really owns and controls property in Kensington, and then for investigators to go after the ill gotten gains and seize properties brought with corrupt funds. Those funds should be made available to help tackle our housing crisis.\nWe need less dirty money in Kensington, and more investment in social housing.\nAs your MP Joe will always be there to listen, support and amplify the campaign for those responsible to be held accountable, and for changes to be made to ensure this never happens again.\nI'm disappointed that the Royal Parks Police closure has been confirmed by the Met, despite objections from many Members of Parliament including @RNBlake and I.\nThere are serious challenges with robbery and theft in London, including around our Royal Parks, and I believe we…\nResidents in Tollbridge Close are dealing with a horrific situation —rubbish, rats, and fly-tipping.\nI visited the community to see the situation first-hand — and it’s completely unacceptable.\n@sovereignha, the housing association responsible for this area, must act…\nDelighted to see @TfL deliver step-free access at Knightsbridge Tube Station! 🚆🛗\nIt's great to see @TFL's step-free upgrade at Knightsbridge station - this is a huge win for my constituency of Kensington and Bayswater.\nWith over 13 million journeys passing through each year, this vital improvement will make a real difference — boosting accessibility for…\nAlways a highlight to welcome our brilliant schools, Fox Primary, to parliament.\nThe children had great questions about our local community, life in Parliament and why QPR are the best team in West London!\n@josephpowell @MOROCCOinLondon We've got a lovely event at Maida Hill Market today 12-3pm. Come on down for Moroccan vibes! #HarrowRoad\nI’m delighted to have hosted our Moroccan Forum last night and foster a space for dialogue and discussion for the local Moroccan community.\nAlongside key community leaders, local organisations and the Consul General @MOROCCOinLondon, we heard about the need for youth…\nSun and smiles all round in Bolsover today campaigning for the fabulous @JoannieDixon with Bolsover’s brilliant MP @NatalieFleetMP and the lovely @josephpowell #teamlabour #labourdoorstep\nAsk me a question, share your views and keep up to date with my work and campaigns as your Member of Parliament for Kensington and Bayswater.\nPromoted by Flo Hutchings on behalf of Joe Powell both at 222 Kensal Road, Westbourne Park. The Labour Party may use the information you provide about your views to understand which issues are most relevant to you and to help us campaign better. The Labour Party uses your personal data for a variety of reasons related to engaging in the democratic process. Where we rely on consent, you are always able to opt out. We may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. To find out more about how we use your personal data and to view our Profiling Notice, please see Privacy Policy",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_labour-wins-london-elections/content_40.html": "Labour’s Sadiq Khan wins historic third term as London Mayor taking West Central in the Mayoral and Assembly elections for the first time\nThe result shows only Labour can beat the Conservatives at the General Election this year.\nSadiq Khan made history on 2nd May by winning a third term with a notable swing towards Labour. The final results saw Sadiq Khan win 1,088,225 votes to the Conservative’s 811,518.\nLabour made key gains in the West Central London Assembly seat, securing over 10,000 votes more than the Conservative candidate. The constituency, which covers the boroughs of Hammersmith and Fulham, Kensington and Chelsea (RBKC) and Westminster, decisively backed Labour in the mayoral and London Assembly vote. This is the first time Labour has won in West Central.\nA historic third term for Sadiq Khan in City Hall means Labour can continue delivering for our great city and the residents of Kensington and Bayswater – from building more affordable homes to more police on our streets and keeping our children healthy with free school meals and tougher action on air quality.\nLabour takes West Central in the London Assembly\nLabour won the West Central London Assembly seat for the first time, electing James Small-Edwards as the first-ever Labour London Assembly member with a majority of 4,000 votes.\nJames will be a brilliant Assembly Member and advocate for our area, bringing much-needed positive change to residents. In his acceptance speech, James emphasised that continuing support for the cost of living crisis will be one of his key priorities, alongside more affordable housing and action on climate change.\nNorland ward by-election\nLabour also made huge inroads in the Norland ward RBKC council by-election, taking second place with 29% of the vote. This election saw a 9% increase in the Party’s vote share since 2022 and a swing from Conservative to Labour.\nThe Norland by-election results show Labour is making progress in Kensington. With the Liberal Democrats trailing in a distant third place, securing only 13% of the vote, the results show it will be a close two-horse race between Labour and the Tories at the General Electio",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_transport/content_38.html": "I’m calling on The Crown Estate to reopen Kensington Palace Gardens to cyclists and pedestrians\nI’m calling on The Crown Estate to urgently open Kensington Palace Gardens to pedestrians and cyclists, after their decision to close the road. The Crown Estate owns the road, which provides a crucial, safe connection between Notting Hill Gate and Kensington High Street for thousands of pedestrians and cyclists every day. In a letter to […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_visit-to-qpr-trust/content_47.html": "Understanding the role we can play in using the power of football to promote positive change\nIt was a privilege to visit QPR in the Community Trust in North Kensington to see the incredible work they do to support children in our community.\nBeing born in a certain area should never define your health, opportunities and aspirations.\nThe Trust’s mission is to create a stronger, healthier, more active community where everyone can thrive, addressing local needs and making a difference to young people in our communities.\nEstablished in 1994 and obtaining charitable status in 2009, the Trust – driven by local needs and with the support of partners, funders and stakeholders – work across seven London boroughs to provide opportunities based on the main objectives of health, education, social inclusion and participation.\nTackling national issues at a local level, every year the Trust engage with 23,000 participants with a focus on:\n- Positive physical and mental health\n- Supporting young people to reach their full potential",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_celebrating-ukraine-independence-day/content_45.html": "It was an honour to celebrate Ukraine Independence Day in Holland Park with hundreds of people from across the British Ukrainian community and supporters.\nMy message was clear: we are with you for as long it takes, with whatever it takes, until there is victory for Ukraine and peace.\nI’ve asked the government to take the first step of immediately releasing frozen Russian assets so they can be used to assist the Ukrainian cause.\nLocally, I am committed to campaigning against the dirty money stashed in luxury property by Russian kleptocrats, and other corrupt oligarchs from around the globe, who continue to use our city to launder their money and avoid international sanctions.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_grenfell/content_19.html": "Grenfell Debate in Parlimaent\nThis week we had a full debate day in Parliament about Grenfell and the Inquiry Report. This was, first and foremost, a moment to remember the 72 people who lost their lives in an entirely foreseeable and preventable tragedy. There were powerful speeches from across the House, and many bereaved, next of kin, […]\nStatement on the Grenfell Inquiry Stage II report\nMy statement on the Grenfell Inquiry Stage II report\nStatement on Grenfell 7th Anniversary\nAfter seven long years, the bereaved and survivors of the Grenfell Tower tragedy are still waiting for Truth, Justice and Change. My thoughts are with them today. Next month a new government will be formed and regardless of party, it must do more. We need to see the implementation of the public inquiry recommendations and […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_statement-on-review-of-the-new-hospital-programme/content_48.html": "Responding to the Chancellor’s statement to the House of Commons on the 29th July 2024 on UK public finances, including that the Government will “conduct a complete reset of the New Hospital Programme, with a thorough, realistic and costed timetable for delivery”, Labour MP for Kensington and Bayswater Joe Powell said:\n“The case for a new St Mary’s Hospital has never been stronger, as is the need for a floor-by-floor refurbishment of Hammersmith and Charing Cross hospitals.\nPatients and staff have been let down for years, and I was appalled that in May last year, the entire Imperial College NHS Trust was relegated from the list of projects to be completed by 2030 by the previous Conservative government. The money to build a new St Mary’s hospital was simply never allocated, giving people false hope and rightly creating distrust in the entire New Hospital Programme.\nTherefore I join Imperial College NHS Trust in welcoming the Government’s review of the New Hospital Programme. It is vital we get clarity on the funding for these three local hospitals so that plans can advance.\nAs the new MP for Kensington and Bayswater, I will continue working closely with the Imperial Trust team, the Health Secretary, and surrounding MPs to secure the best possible outcomes for our community, including a plan to get our local hospitals what they need as soon as possible.”",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_category_campaigns/content_35.html": "Tactical vote sites recommend voting Labour in Kensington & Bayswater to beat the Tories\nWe’re in a tight two-horse race in Kensington and Bayswater and the latest recommendations from Get Voting confirm that. The latest MRP poll from Best for Britain shows the gap between the Tories and Labour in Kensington is narrowing, with Labour only 8 points ahead. While the polls look positive for Labour nationally, it […]\nThis is why Hugo is voting Labour\nIn Kensington and Bayswater, it’s a straight fight between Labour and the Conservatives. No one else can win. The Tories won by 150 votes here at the last election. We can’t afford to split the vote again after 14 years of Tory failure. People like Hugo are switching from the Liberal Democrats to Labour because […]\nPost Office ITV drama star backs Labour in Kensington & Bayswater\nI’ll vote Labour after making Post Office drama, says Paula Vennells actor. This week, the Horizon Inquiry heard evidence from the former Post Office CEO Paula Vennells. I’m proud that Lia Williams, who played Paula Vennells in the ITV drama Mr Bates V The Post Office, has announced that she will be backing Labour in […]\nLabour wins London Elections\nLabour’s Sadiq Khan wins historic third term as London Mayor taking West Central in the Mayoral and Assembly elections for the first time The result shows only Labour can beat the Conservatives at the General Election this year. Sadiq Khan made history on 2nd May by winning a third term with a notable swing towards […]",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_statement-on-gaza-and-israel/content_4.html": "Many residents have contacted me about the terrible situation in Gaza and Israel.\nI support an immediate ceasefire, a massive increase in aid, the release of hostages and accountability for implementing the ICJ provisional recommendations. I want to see the path to a two-state solution revived with a fully recognised Palestinian state achieved as soon as possible, not just at the end of a lengthy process. This commitment was reinforced in the Labour Party manifesto which states “Palestinian statehood is an inalienable right of the Palestinian people. It is not in the gift of any neighbour and it is also essential to the long-term security of Israel.” However challenging it may be, it is the UK’s moral duty to work with our international partners to achieve a two-state solution and sustainable peace in the region.\nI’ve worked my entire career in international development, open government and anti-corruption – so I care deeply about human rights and tackling poverty. It’s clear to me that the suffering of the innocent people of Gaza is an affront to those values, as are the long-standing indictments of corruption against Benjamin Netanyahu. It’s also why we need change so desperately in this country and in our area. If we want to tackle the housing crisis, make work pay, implement real climate change policies, and rebuild our NHS then we need a Labour government and a Labour MP in Kensington & Bayswater. Any other vote risks five more years of Conservative government and five more years of a Tory MP for our community.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_labours-offer-on-leasehold-reform/content_5.html": "Leaseholders in Kensington & Bayswater have been let down by the Tories.\nIt’s time for change.\nFor far too many leaseholders, the reality of home ownership falls woefully short of the dream they were promised.\nLabour will act where the Conservatives have failed and finally bring the feudal leasehold system to an end.\nWe will enact the package of Law Commission proposals on leasehold enfranchisement, right to manage and commonhold.\nWe will take further steps to ban new leasehold flats and ensure commonhold is the default tenure. We will tackle unregulated and unaffordable ground rent charges.\nLabour act to bring the injustice of ‘fleecehold’ private housing estates and unfair maintenance costs to an end.\nIt was brilliant to welcome Matthew Pennycook to Kensington and Bayswater to discuss Labour’s plans for leasehold reform.\nAs your MP for Kensington and Bayswater, I’ll do everything I can to fight for leaseholders",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_statement-on-violence-witnessed-across-the-country/content_34.html": "Ask me a question, offer your support, and keep up to date with my campaign to be your next Member of Parliament.\nPromoted by Flo Hutchings on behalf of Joe Powell both at 222 Kensal Road, Westbourne Park W10 5BN. My office may use the information you provide about your views to understand which issues are most relevant to you and to help us campaign better. By virtue of my work as Member of Parliament, I use your personal data for a variety of reasons related to engaging in the democratic process as your elected representative. Where we rely on consent, you are always able to opt out. We may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. To find out more about how we use your personal data and to view our Profiling Notice, please see our privacy policy.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_grenfell-7th-anniversary/content_21.html": "After seven long years, the bereaved and survivors of the Grenfell Tower tragedy are still waiting for Truth, Justice and Change. My thoughts are with them today.\nNext month a new government will be formed and regardless of party, it must do more. We need to see the implementation of the public inquiry recommendations and the passage of the Hillsborough Law to place a legal duty of candour on public servants and authorities, and provide legal aid for the victims of disasters or state-related deaths.\nWe must also see a renewed focus on building safety, speed up remediation work to fix dangerous cladding and make sure those responsible for the building safety crisis pay to put it right.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_this-is-why-hugo-is-voting-labour/content_13.html": "In Kensington and Bayswater, it’s a straight fight between Labour and the Conservatives. No one else can win.\nThe Tories won by 150 votes here at the last election.\nWe can’t afford to split the vote again after 14 years of Tory failure.\nPeople like Hugo are switching from the Liberal Democrats to Labour because it’s time for change.\nJoin Hugo and vote for change with Labour on 4th July.",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_north-kensington-community-energy-visit-with-ed-miliband-mp/content_44.html": "It was a privilege to visit North Kensington Community Energy with Labour’s Shadow Secretary of State of Climate Change and Net Zero, Ed Miliband MP, to see the community-owned solar project in action at Westway Sports Centre.\nNorth Kensington Community Energy was born in 2018 with the aim of making Kensington & Chelsea a greener and fairer borough by installing community-owned solar panels.\nUnder a Labour government, our Local Power Plan will support community-owned projects like this around the country to lower bills, create jobs, and tackle climate change.\nLabour’s Green Prosperity Plan\nTo address the climate crisis, the Labour Party has committed to a Green Prosperity Plan. Labour has committed to achieving the substantial majority of our emissions by 2020, making climate justice a priority, and taking action to accelerate the benefits of nature restoration and recovery.\nLabour’s mission is to make the UK a clean energy superpower. It is a plan that will make energy cheap and secure so that the British public never again faces spiralling bills, boost jobs and investment in every region and nation of the country, and grow our economy from the bottom up and middle out.\nPowered by our Green Prosperity Plan, a Labour government will help Britain lead the world in cheaper, cleaner power and industry:\n1. Cutting energy bills for good – taking up to £1,400 off the annual household bill and £53 billion off energy bills\n2. Establish GB Energy – a new home-grown, publicly-owned champion in clean energy generation – to build jobs and supply chains here at home\n3. Upgrade millions of homes with our Warm Homes Plan, so that families have cheaper energy bills permanently, with warm, future-proofed homes\n4. Set up the National Wealth Fund, which will create good, well-paying jobs by investing alongside the private sector in gigafactories, clean steel plants, renewable-ready ports, green hydrogen and energy storage.\n5. Act fast to lead the worst with clean and cheap power by 2030, backing up the builders, not the blockers so Britain gets the cheap, clean power we need",
  "https_www_joepowell_org_uk_/https_www_joepowell_org_uk_meeting-with-mike-amsbury-mp/content_23.html": "This year we finally need Truth and Justice for Grenfell bereaved and survivors\nI met with Mike Amesbury MP, Labour’s spokesperson for building safety, to discuss issues around fire safety for those still living in dangerous flats.\nIt is nearly seven years on from the Grenfell fire, yet only 21% of high-rise flats have been made fully safe and hundreds of thousands of people are still trapped in dangerous flammable flats.\nAs your MP, I will always be there to listen, support and amplify the campaign to hold those responsible to be held accountable, and for changes to be made to ensure this never happens again."
}