{
  "https_joshforwestcumbria_co_uk/https_joshforwestcumbria_co_uk/content_1.html": "I’m so proud to be elected as your first Labour MP for Whitehaven and Workington and West Cumbria’s voice in Parliament.\nAs your MP I will fight for and deliver for West Cumbria. I’ve spent the last year meeting thousands of local people, listening to your concerns and turning those into my priorities to deliver as your MP now the General Election has concluded. Read my plan for West Cumbria\nPlease contact me with any issues or to share your ideas and together, let’s build a brighter future for West Cumbria.\nJoin my e-mail list\nJoin my e-mail list and I’ll keep you up to date with local campaigns and events. I’ll also be regularly seeking your views on a range of topics to help shape my priorities as your Labour MP.",
  "https_joshforwestcumbria_co_uk/https_joshforwestcumbria_co_uk_gp-survey/content_4.html": "I hear on the doorstep all the time from people struggling to get an appointment with their GP. There are fewer GPs to care for a growing, ageing population with a high number of health conditions. This has knock on effects, with referral to diagnostic testing and specialist help delayed.\nThis is an issue across the country after 14 years of Tory government. But we face particularly acute challenges here in West Cumbria.\nLabour has made building an NHS fit for the future one of the defining missions of the next Labour government and I’ve detailed Labour’s plan to reform primary care at the bottom of this page.\nBut we can’t wait for the next government, we need action now. Complete my survey so I have a clear picture of the current situation to make the strongest possible case for change with local and national decision makers.\nShare your views\nYour response will be anonymised and used to provide feedback to local GP practices and decision makers in the NHS about service improvements.\nWe may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. We may also use your answers to help us campaign better.\nIf you would like to know more about how we use your information click here\nLabour’s plan to build an NHS fit for the future\nGeneral practice is the bedrock of our NHS, acting as the front door of the health service. For most people, their local GP surgery is the first port of call when a health problem starts, so excellent primary care is vital. But primary care is increasingly overwhelmed and inaccessible.\nPatients need new and more varied opportunities to access the healthcare they need. This will speed up patient access and free up GP time to deliver the high-quality, expert healthcare that only they can.\nReforming primary care is a core element of Labour’s mission to build an NHS fit for the future.\nTo make primary care fit for the 21st Century, Labour will:\n- Improve GP access: Right now, people’s experience of accessing general practice is at an all-time low, and we are seeing widespread examples of GP partnerships being forced to close because fewer GPs want to take on the burden, leaving patients without access to vital services. Labour will make the future of general practice sustainable by ensuring we train more GPs, take pressure off those currently working in the system, and shift the focus of care out of hospitals and into the community. As well as this, Labour will modernise the way people book appointments to ensure that patients can easily book appointments in the manner they choose, by harnessing the power of the NHS App to end the 8am scramble, and by allowing people to book directly for routine checks like long-term condition reviews and cervical cancer screening tests.\n- Bring back the family doctor: For those who would benefit from seeing the same clinician regularly (for example those living with chronic illness), Labour will improve continuity of care, which is associated with better health outcomes and fewer hospital admissions. We will support practices to effectively stratify appointments between those who need a quick opinion on a one-off health issue, and those who benefit from continuity. We will also include continuity of care in the framework used to assess the financial incentives given to GP practices.\n- Join up community health and social care services: Labour will work with the NHS to bring together services in the community, learning from sites where this is already happening and working well. Labour will encourage Integrated Care Systems (ICSs) to identify opportunities to join up services, including by co-locating them on a single site where existing estate capacity allows and capitalising on the opportunity of closer working with voluntary organisations that are embedded in communities. The aim will be for more patients to have one point of contact for appointments with a range of professionals and services working together as part of a neighbourhood team, including their family doctor, carer, health visitor, physiotherapist, dentist, social prescriber or mental health specialist. This will make a particular difference to patients who have more than one condition, who often attend several very different clinics that each prescribe different medication or lifestyle changes, without co-ordination. To improve their experience of care, Labour will work towards ensuring everyone with complex multi-morbidites has a named care co-ordinator in the community who can act as a single point of contact, stopping them from being pushed from pillar to post.\n- Open new referral routes: Labour will instruct the National Institute for Health and Care Excellence (NICE) to make recommendations on expanding instances where someone can refer themselves to a specialist service or diagnostic test, and on simplifying existing referral routes (building on successful single point of access programmes). For example, all patients should routinely be able to be referred directly to hospital by their optician.\n- Further expand the role of community pharmacy: Whilst the Government has announced some sticking plaster proposals in this area, we will go further, accelerating the roll out of independent prescribing to establish a Community Pharmacist Prescribing Service covering a broad range of common conditions. Labour will also cut unnecessary red tape to allow pharmacy technicians to step up to some roles, ensuring pharmacists can work to the top of their license and focus on their expertise in prescribing and medicines management, rather than repetitive dispensing processes. Supported by greater digital interoperability, this will enable them to support GPs in the management of long-term conditions like hypertension and COPD and in tackling the serious issue of overprescribing, which is responsible for thousands of avoidable hospital admissions every year.\n- Free-up GP appointments by boosting mental health support: Alongside recruiting thousands more mental health staff to cut waiting lists and ensure more people can access treatment, Labour will create an open-access mental health hub for children and young people in every community. We will also introduce professional support in every secondary school and bring in the first ever long-term, whole-Government plan to improve outcomes for people with mental health needs.\n- Create a Neighbourhood NHS Workforce: Labour will double the number of district nurses and train 5,000 more health visitors. This will allow far more patients to be seen in the comfort of their home and provide a route to catching problems early and setting healthy habits. Doubling the number of district nurses will allow the NHS to expand ‘hospital at home’ services, like virtual wards, and they are also vital for delivering the healthcare of the future by bringing hospital standard care into the home using technology. Training 5,000 more health visitors will take pressure off GPs and A&E, end the postcode lottery families experience in getting support, improve continuity of care and ensure every child gets access to consistent healthcare.\nRead Labour’s full, detailed plan to build an NHS fit for the future",
  "https_joshforwestcumbria_co_uk/http_joshforwestcumbria_co_uk_dentistry/content_7.html": "There is not a single dentist accepting adult NHS patients anywhere in West Cumbria.\nThe no. 1 cause of A&E attendance among children is tooth decay.\nPeople are literally pulling their own teeth out.\nThe Tories have had 14 years to fix NHS dentistry and they’ve failed.\nWorking with the next Labour government, here’s my Dental Rescue Plan for West Cumbria:\n- Thousands more NHS appointments with local dentists immediately\n- Recruitment and incentives for more NHS dentists to work in West Cumbria\n- Reform of the NHS dentistry contract to fix the problems in the long term and ensure everyone can access an NHS dentist in the future\nBut we can’t wait for the next government, we need action now. Complete my survey so I have a clear picture of the current situation to make the case for change with local and national decision makers.\nShare your views\nWe may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. We may also use your answers to help us campaign better.\nIf you would like to know more about how we use your information click here",
  "https_joshforwestcumbria_co_uk/https_joshforwestcumbria_co_uk_keepae247/content_6.html": "Overnight access to the Accident & Emergency department at West Cumberland Hospital is potentially under threat.\nSign up to keep up to date with our campaign:\nIn a story in the Whitehaven News, a spokesperson for North Cumbria Integrated Care NHS Foundation Trust admitted that “there is a risk that we may be unable to provide appropriate overnight cover in the future” due to the lack of emergency doctors.\nThis could leave patients in West Cumbria forced to travel an hour to the nearest A&E at Cumberland Infirmary in Carlisle in the middle of the night.\nI am wholly opposed to any suggestion that we lose a fully-staffed, fully operational 24/7 A&E department capable of dealing with emergency patients at any hour of the day or night. The government need to step up to stop us losing any part of this vital service in West Cumbria.\nSign my petition to the Health Secretary calling on him to step up and fix the mess he’s created:\nDetails of the campaign so far can be found below. I’ll keep this page updated as the campaign progresses.\n8th August – letter to the CEO of North Cumbria Integrated Care NHS Foundation Trust\nI wrote to the Chief Executive of the trust to demand urgent answers to my questions about reports that our A&E is struggling to maintain an overnight service.\n9th August – response to my letter from the CEO\n“We recognise that the people of west Cumbria need access to safe emergency care and we are working very hard to maintain services in the face of potential temporary staffing shortages. The good news is that we have recently successfully recruited two more permanent consultants to our A&E team – one has recently joined us and the other will join us in September. While we do still have some gaps, which we cover with agency locum and bank doctors, we are in the best position we have been in for some time. In the longer term, we have strategies to train more clinical staff to a higher level in line with the Royal College of Emergency Medicine’s medical workforce guidelines for small and rural emergency departments. We also attend recruitment fairs having recently been in both London and Glasgow.\n“However, it is true to say that recruiting middle and senior emergency clinicians to work in west Cumbria is challenging, which means at times our workforce is stretched. As you would expect, we have business continuity plans in place for this and a range of scenarios across the Trust to enable us to continue to provide safe services for patients at all times. The A&E business continuity plan for WCH was developed with our clinical teams last year to ensure we can continue to provide a safe service in the department should a staffing issue arise with regard to middle grade doctors covering the overnight rota. To date, we have not needed to enact this plan, however should we need to do so, we would proactively inform our partners and the public and explain what this would mean in practical terms.\n“The plan details the contingency arrangements for the overnight rota. If the plan was implemented, the A&E department would remain open at all times and if someone walked into the department between those hours, they would be assessed and a decision made about the best course of action for their safe care or treatment. This may involve being directly referred to another department at WCH, or being transferred to the Cumberland Infirmary in Carlisle (CIC). For someone arriving via ambulance, our colleagues at North West Ambulance Service have been involved in the continuity plans and we would discuss the best course of action on a case-by-case basis. There would be an on-call consultant who could be contacted in an emergency as well as on-call consultants for other areas as normal such as paediatrics and surgery. The department would also plan to increase senior nursing cover during those shifts.”\nThe response suggests that there is a chance of the withdrawal of overnight A&E services, in all but name. The contingency plan is to keep the doors open but – in the case of a lack of senior medical personnel – send some patients to the Cumberland Infirmary who might otherwise be treated in A&E during business as usual. This is not the level of service local people expect and it would not meet any reasonable definition of a 24 hr A&E department.\nI know that the trust are doing everything they can to recruit staff and keep a fully functioning A&E at West Cumberland. They’re being forced to make extremely difficult decisions about services because the government failed to provide an NHS workforce plan for more than a decade. The government’s mismanagement is having very real consequences for the quality of health and social care for people in West Cumbria.\n10th August – public meeting on the future of emergency care in West Cumbria\nI organised a public meeting to discuss the issue with Wes Streeting MP, Labour’s Shadow Secretary of State for Health and Social Care, and Mahesh Dhebar of the ‘We need West Cumberland Hospital’ campaign group on 10th August.\nSee coverage of the meeting in the Whitehaven News\n10th August – visit to University of Cumbria\nI joined Labour’s Parliamentary candidate for Carlisle, Julie Minns, on a visit to the University of Cumbria to learn more about their partnership with Imperial College London which will train 50 doctors here, from Cumbria, for Cumbria.\nRead coverage of the visit in the News & Star\nThis is a great start but doesn’t go far enough, but there is a government cap on the number of medical school places. Wes Streeting confirmed Labour’s plan to double the numbers and I’ll be pushing to deliver this and make sure that West Cumbria benefits from this.\n6th September – follow up letter to the CEO of North Cumbria NHS Integrated Care Foundation Trust\nThis week I wrote a follow up letter to Lyn Simpson relaying the concerns raised by patients and staff members at our public meeting over the summer.\n15th September – meeting with the Chair of North Cumbria NHS Integrated Care Foundation Trust\nThis week I received a response to my above letter from the CEO, thanking us for our support of the hospital and agreeing that our proposal for more board and governor meetings in West Cumbria is a sensible one that they’ll look into.\nToday I met with the Chair of the trust to discuss emergency care. It was a productive discussion and I hope the first of many. I want to work with the trust on this and secure the future of a 24/7 A&E at West Cumberland Hospital.\nI’ll be visiting the hospital in the coming weeks and meeting with the trust leadership to discuss this issue in more detail and support their efforts to recruit more doctors to work in West Cumbria.\nI’ll keep this page updated as the campaign progresses.\nSign up to keep up to date with our campaign:",
  "https_joshforwestcumbria_co_uk/https_joshforwestcumbria_co_uk_contact/content_2.html": "Join my e-mail list\nJoin my e-mail list and I’ll keep you up to date with local campaigns and events. I’ll also be regularly seeking your views on a range of topics to help shape my priorities as your Labour MP.\nGet in touch\nIf you’d like to tell me something, share an idea, ask a question or request help with an issue, provide your details below and a member of my team will be in touch.\nI consent to sharing my contact details with Josh MacAlister and receiving updates from him about his work and campaigns. I understand I can opt out at any time by clicking the unsubscribe link in any of the e-mails. View my privacy policy.\nIf you need to attach evidence then e-mail me directly on hello@joshmacalister.uk, but please provide all of the information above.\nYou can also:\nCall my office: 01946 458 023\nText my office: 07520 666785\nOr write to me: Office of Josh MacAlister MP, First Floor, 35-40 James Street, Whitehaven, CA28 7HZ.\nNB: Your first port of call to raise issues about local council services should be the reporting function on Cumberland Council’s website: www.cumberland.gov.uk and / or your local councillor. I can’t help you with a council issue if you haven’t done this first.\nPlease note that due to strict Parliamentary protocols I can only support constituents living in Whitehaven and Workington constituency. If you do not provide your address you will not receive a response.\nIf you are unsure which constituency you live in, check here: https://members.parliament.uk/FindYourMP",
  "https_joshforwestcumbria_co_uk/https_joshforwestcumbria_co_uk_myplan/content_3.html": "Local people are fed up of politicians promising jam tomorrow before an election and then breaking their promises when the election has been and gone.\nI’m not going to do that.\nOver the last year I have been running a listening campaign to help shape my priorities if elected as your next Labour MP for Whitehaven & Workington.\nMy team and I have knocked on over 25,000 doors across West Cumbria and spoken to more than 10,000 people. 2,000 residents have completed my residents survey and I’ve visited dozens of local businesses, schools, charities and community organisations.\nI’ve laid out a clear plan showing you what I’ll fight for – based on what thousands of you have told me is most important to you – and how I’ll work to deliver it if I’m elected as your MP.\nI’ve spent my entire career getting things done outside politics for children and vulnerable families and I want to put that experience to use to deliver for you and your family.\nMy plan for West Cumbria\n1. Action to bring down bills and put more money in your pocket\nThe Tories crashed the economy and working people in West Cumbria are paying the price. Everywhere I go residents and small business owners tell me they’re concerned about the cost of living crisis. Higher mortgage payments, soaring energy bills and rising costs for food and fuel. Thousands of local families are struggling.\nAs your MP, working with a Labour Government, I will:\n- Vote to bring in a proper windfall tax on oil and gas giants so that their record profits can be used to ease the pressure on the cost of living.\n- Back action to help homeowners and renters feeling the crunch as a result of the cost of living crisis, including a package of mandatory mortgage measures from lenders to support homeowners and a new Private Renters Charter to make renting fairer and more affordable.\n- Fight to get homes in West Cumbria – which are some of the coldest in the country – to the front of the queue for Labour’s Warm Homes Plan – a home insulation programme which will upgrade 5 million homes in the next Parliament with energy efficiency measures and bring down energy bills by hundreds of pounds per year.\n- Support Labour’s New Deal for Working People, delivering a genuine living wage, banning zero hours contracts and ending fire and rehire. Because creating well-paid jobs across all parts of our country will make working people better off and more secure.\n2. Protect and improve local NHS services\nAfter 14 years of Conservative government our precious NHS is on its knees.\n- There is a workforce crisis, with too few doctors, nurses and other professionals.\n- It’s difficult to get a GP appointment and impossible to find an NHS dentist.\n- People are waiting months for access to mental health services and languishing for years on waiting lists to get treatment.\nThe blame lies at the door of 10 Downing Street. The longer the Conservatives are in power, the longer patients will wait.\nThere is no quick fix, but we need an MP and a government with a plan.\n- Work with government, local NHS providers and universities to double the number of medical school places offered here in Cumbria, so we can train more doctors here to work here. Complete my GP access survey\n- Vote for Labour’s plan to cut waiting times quickly by paying NHS staff overtime to deliver 40,000 extra appointments a week on evenings and weekends in the short term and by giving the NHS the staff and technology it needs in the longer term, including doubling the number of scanners, so patients with conditions like cancer are diagnosed earlier, giving them the best chance of survival.\n- Fight to ensure we always have a fully-staffed, fully-operational, 24/7 A&E at West Cumberland Hospital. Support my campaign\n- Bring a mental health hub for children and young people to West Cumbria and ensure mental health is treated as seriously as physical health, with Labour’s plan to recruit an extra 8,500 mental health professionals working in communities and schools to bring down waiting times for mental health support and improve services through early intervention.\n- Back promised emergency investment to create 700,000 new NHS dental appointments in the short term and reform the NHS dentistry contract and bring more NHS dentists to West Cumbria in the longer term. Complete my dentistry survey\nThe last Labour government delivered the shortest waits and highest patient satisfaction in history. We did it before and we can do it again. Labour will give Britain its NHS back.\n3. Back new nuclear and industry to deliver sustainable, long-term, high quality jobs\nOur ports and docks were the engine room of the Industrial Revolution. We were home to the world’s first civil nuclear power station. Workington steel can still be found in rail tracks around the world. We’ve since fallen behind. But we’re on the edge of another industrial revolution and there’s a new opportunity – if we seize it.\nWe need a plan that will help us to regain control of our future. A plan for long-term jobs that families can count on. A realistic, bold, ambitious and focused plan that empowers the enterprise of local leaders.\nThat’s why I’ve launched a local industrial plan that would deliver 1,000 new jobs in new nuclear, new green steel and an expansion of the Port of Workington.\nRead my detailed plan below\n4. Put more police back on our streets\nUnder the Tories, our police stations have been closed, seeing the police on your street is a thing of the past, anti-social behaviour and drug-related crime is rife in our towns and rural crime is hitting our villages hard. More than 90% of crimes go unsolved. Criminals have never had it so good.\nAs your MP, working with a Labour Government and with David Allen, Labour’s Police, Fire and Crime Commissioner in Cumbria, I will:\n- Vote for Labour’s plan to put 13,000 officers back on the streets across the country and work to make sure we get our fair share here in West Cumbria. Sign my petition\n- Work with the Police, Fire and Crime Commissioner and Cumbria Police to expand the rural crime team, with more officers and resources to support our rural communities.\n- Work with the police and council to turbo charge the targeted anti-social behaviour operations in our town centres, with a more regular, visible policing presence and a zero tolerance approach to stamp out anti-social behaviour and make our town centres safer for residents and visitors.\n- Support Labour’s plan to halve violence against women and girls in the next decade.\n5. Revitalise our town centres and back local businesses\nOur town centres are on their knees after 14 years of cuts to council funding and a lack of planning to support the high street from the government. Businesses are struggling with rising costs and lower footfall and more close every week. We shouldn’t accept that decline is inevitable. I won’t.\nAs your MP, working with a Labour Government, our local council and with businesses, I will:\n- Vote for Labour’s plan to scrap business rates and introduce a fairer system which supports small businesses to grow.\n- Work to develop masterplans for our towns to bring them back to life.\n- Fight to secure meaningful investment from government and the private sector to deliver those plans by championing our area at every opportunity.\n- Work to improve public transport links into and between our towns and villages to make it easier to get into town without a car.\n- Tackle anti-social behaviour as mentioned above to make our town centres safer.\nThese are my top local priorities but I will of course be working on a whole range of issues if elected. Your concerns are my concerns and I’ll be a champion for our area and its people.\nYou can read Labour’s manifesto for change here.\nJoin my e-mail list\nJoin my e-mail list and I’ll keep you up to date with my plans, local campaigns and events. I’ll also be regularly seeking your views on a range of topics to help shape my priorities as your Parliamentary candidate and next Labour MP.",
  "https_joshforwestcumbria_co_uk/https_joshforwestcumbria_co_uk_police/content_5.html": "Crime and anti-social behaviour are major issues in communities across West Cumbria and the massive cuts we’ve seen to police numbers are partly responsible for this.\nThe next Labour government will put 13,000 police officers back on the beat. That means more visible policing, with bobbies back on your street again.\nIf I’m elected as your MP I’ll fight to make sure we get our fair share of these police officers here in West Cumbria.\nBut I want the current government to act now.\nSign my petition\nWe may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. We may also use your answers to help us campaign better.\nIf you would like to know more about how we use your information click here"
}