{
  "https_wallace4dg_co_uk_/https_wallace4dg_co_uk/content_1.html": "James Wallace for Dumfries & Galloway\nI was born and raised in Dumfries & Galloway, and all my family live here. But two chaotic Governments, fighting among themselves, are letting down our region and our families. It’s time for change.\nLabour CAN win in Dumfries & Galloway\nA local candidate for national issues\nDumfries & Galloway matters to me. I was born and raised here and all my family live locally. THAT MAKES ME PROUD to be standing to be your Scottish Labour MP as our region’s voice in Parliament.\nDumfries & Galloway elected a Labour MP the last time there was a Labour Government. In fact, Labour MP Russell Brown represented our region with 46% of the vote until as recently as 2015. But after years of chaos and division – 14 under the Tories, and 17 years under the SNP – our region has been let down. Both governments have failed to deliver good services, they are divided – each onto their third leader in one Parliamentary term – and they have left thousands of local families struggling to make ends meet and worried for the future.\nI have a record of delivery for working people outside politics that shows you can have confidence in me to get the job done as your MP. I was one of the youngest to sit and pass the New York bar exam. I’ve built a broad range of knowledge and experience. First, as a pensions lawyer working with trustees to help protect members’ benefits. And secondly, as a Chartered Financial Planner working with individuals planning their retirement.\nThis puts me in a unique position to hit the ground running and work hard for the region.\nDumfries & Galloway has huge potential. It is one of the most beautiful places in the country. It has passionate people that go out of their way to help others. Working together we can deliver the change that our region needs, the change that Scotland needs, and the change in Government that Britain so desperately is looking for.\nI promise that as your MP I will fight for and deliver for Dumfries & Galloway. It’s time to end the chaos. Dumfries & Galloway has suffered. The SNP have drained the region of its best and brightest by moving jobs to the Central Belt – along with an awful record on health, education, and transport (all things the SNP have power to control). Wigtownshire has felt this acutely with a lack of access to basic health services, Galloway hospital at risk, transport in chaos and the treacherous A75 all compounding a feeling the region has been forgotten in both Holyrood and Westminster.\nAnd the Conservatives have also lost all credibility. They have presided over an austerity regime that has decimated the public sector, reduced productivity, and taken UK tax levels to the highest in 70 years – with nothing to show for it. In this Parliamentary term alone, we have had: three Prime Ministers (so far), constant drama, and one Chancellor causing catastrophic economic damage all paid for by working people in the way of higher mortgages and a cost of living crisis.\nEnough must be enough. Time to stop the chaos, turn the page and rebuild our country.\nMy Dumfries & Galloway story started with one grandad that came back from the war and worked as a butcher in Dumfries, and the other was headmaster of Dumfries Academy. I had the good fortune to have business, education, and community at the heart of my upbringing. My parents went to university with my mum training as a radiographer and my dad going back into the family business and since has built up different businesses in the region. For the last 20 years and now along with my brother (who used to manage his own local business in Castle Douglas) they run a large commercial plastics recycling factory in the region.\nSpending my weekends in and around Loch Ken, exploring the delights of Galloway and plenty of Duke of Edinburgh walks throughout the region (thanks to amazing volunteers!), all make me incredibly grateful to have grown up here.\nOne of the biggest impacts in my life was probably attending Loreburn Primary then Dumfries Academy with teachers giving me both the opportunity and the confidence to grow – pushing my boundaries beyond what I thought I was capable of. I will always remember that final day of school at the Academy walking out of the school gates – I knew I wanted to help make a difference (however big or small) in the world.\nI look forward to working with you all and I am grateful for any help you can give (however big or small).\n-\nPromoted by Linda Dorward on behalf of James Wallace both at lower ground floor 17 Buccleuch Street, Dumfries DG1 2AT",
  "https_wallace4dg_co_uk_/https_wallace4dg_co_uk_about/content_2.html": "James Wallace was born and grew up in Dumfries & Galloway. He trained in law and then moved to specialise in pensions. He is passionate about the region and he wants Westminster and Holyrood to work together in the interests of Dumfries & Galloway. At the moment, the SNP in Holyrood and Tories in Westminster refuse to work together, and James hopes to be part of making our governments work for us. It’s time for change."
}