{
  "https_www_torcuil_scot_/https_www_torcuil_scot_contact_privacy-policy/content_4.html": "Who we are\nOur website address is: https://www.torcuil.scot.\nComments\nWhen visitors leave comments on the site we collect the data shown in the comments form, and also the visitor’s IP address and browser user agent string to help spam detection.\nAn anonymized string created from your email address (also called a hash) may be provided to the Gravatar service to see if you are using it. The Gravatar service privacy policy is available here: https://automattic.com/privacy/. After approval of your comment, your profile picture is visible to the public in the context of your comment.\nMedia\nIf you upload images to the website, you should avoid uploading images with embedded location data (EXIF GPS) included. Visitors to the website can download and extract any location data from images on the website.\nCookies\nIf you leave a comment on our site you may opt-in to saving your name, email address and website in cookies. These are for your convenience so that you do not have to fill in your details again when you leave another comment. These cookies will last for one year.\nIf you visit our login page, we will set a temporary cookie to determine if your browser accepts cookies. This cookie contains no personal data and is discarded when you close your browser.\nWhen you log in, we will also set up several cookies to save your login information and your screen display choices. Login cookies last for two days, and screen options cookies last for a year. If you select “Remember Me”, your login will persist for two weeks. If you log out of your account, the login cookies will be removed.\nIf you edit or publish an article, an additional cookie will be saved in your browser. This cookie includes no personal data and simply indicates the post ID of the article you just edited. It expires after 1 day.\nEmbedded content from other websites\nArticles on this site may include embedded content (e.g. videos, images, articles, etc.). Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website.\nThese websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracking your interaction with the embedded content if you have an account and are logged in to that website.\nWho we share your data with\nIf you request a password reset, your IP address will be included in the reset email.\nHow long we retain your data\nSuggested text: If you leave a comment, the comment and its metadata are retained indefinitely. This is so we can recognize and approve any follow-up comments automatically instead of holding them in a moderation queue.\nFor users that register on our website (if any), we also store the personal information they provide in their user profile. All users can see, edit, or delete their personal information at any time (except they cannot change their username). Website administrators can also see and edit that information.\nWhat rights you have over your data\nSuggested text: If you have an account on this site, or have left comments, you can request to receive an exported file of the personal data we hold about you, including any data you have provided to us. You can also request that we erase any personal data we hold about you. This does not include any data we are obliged to keep for administrative, legal, or security purposes.\nWhere your data is sent\nSuggested text: Visitor comments may be checked through an automated spam detection service.",
  "https_www_torcuil_scot_/https_www_torcuil_scot_sign-the-petition/content_2.html": "Sign the petition and join the campaign to Save Stornoway Post Office.\nSign below and share on Facebook\nSign the petition and join the campaign to Save Stornoway Post Office.\nStornoway Post Office is under threat of closure in a hit-list of 115 Crown Offices announced by the Post Office\nThe loss of the main Post Office would be a huge blow to town and the island..\nIt is essential that the islands retain the full range of services which a Crown Office provides in an accessible location. I think every option other than closure must be looked at.\nSign our petition to make the Post Office and Government Ministers aware of the depth of feeling in the Western Isles.\nWe, the undersigned, are committed to the retention of a Crown Post Office in its current location on Francis Street, Stornoway; call on the Post Office to enter into meaningful discussions about how this can be achieved and in the meantime to suspend the threat of closure.\nSave Stornoway Post Office!\nSave Stornoway Post Office!",
  "https_www_torcuil_scot_/https_www_torcuil_scot/content_1.html": "Get in touch\nGet in touch if you have any questions or if you think there is something I should know about.\nWrite to me\nPlease include your full name, address and postcode.\nConstituency office:\n36 Kenneth St, Stornoway, Isle of Lewis HS1 2DR\nGet in touch if you have any questions or if you think there is something I should know about.\nPlease include your full name, address and postcode.\nConstituency office:\n36 Kenneth St, Stornoway, Isle of Lewis HS1 2DR",
  "https_www_torcuil_scot_/https_www_torcuil_scot_news/content_5.html": "Get in touch\nGet in touch if you have any questions or if you think there is something I should know about.\nWrite to me\nPlease include your full name, address and postcode.\nConstituency office:\n36 Kenneth St, Stornoway, Isle of Lewis HS1 2DR\nGet in touch if you have any questions or if you think there is something I should know about.\nPlease include your full name, address and postcode.\nConstituency office:\n36 Kenneth St, Stornoway, Isle of Lewis HS1 2DR",
  "https_www_torcuil_scot_/https_www_torcuil_scot_tc/content_3.html": "Living in hope\nThis is the website of Torcuil Crichton, MP for Na h-Eileanan an Iar. Here is where you will find news and information about my work on behalf of the people of the Western Isles.\nI’m a Labour politician but I am here to serve everyone and to do my utmost for every islander.\nIf you’d like to raise any topic with me or if you’d like to meet to discuss any particular issue, get in touch here and we will make arrangements.\nI have caseworkers in Lewis and Uist covering the whole of the Western Isles and hold regular surgeries and coffee mornings which you are welcome to come along to.\nI always maintain that our best days are ahead of us and that by working together we will improve the islands and the world.\nWe come alive in hope.\nTorcuil Crichton MP"
}