{
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_candidates/content_2.html": "Alton Town - Lizzie Marshall\nHello, I’m Lizzie Marshall, and I’m excited to to be the candidate representing Alton Town in the Hampshire County Council elections.\nI was born in Southampton but settled in Alton in 2013. My husband, Jon, and I fell in love with the beauty of this town and its welcoming community. We married locally and have built our life here, and we are proud to raise our family here.\nMy career has been as a registered nurse, a specialist community public health nurse, and now a teacher of nursing, and health and social care at a college. I have had the privilege of working with people from all walks of life, supporting them through some of their most challenging times. Working on the front lines of healthcare, I’ve seen first-hand how policy decisions affect people’s lives. This experience has shaped my deep commitment to public service and my passion for empowering others.\nI’m standing as a candidate because I believe in authentic representation. Alton deserves infrastructure, especially healthcare services, that matches its growth. It is vital that we protect public health and wellbeing as councils navigate financial challenges. I am determined to bring my experiences to the council, advocate for the community, and ensure that residents’ voices are heard.\nAlton Rural - Alex Ehrmann\nI have lived in Ropley for over 25 very happy years. It has been a great place to bring up a family, work and enjoy so much of the fantastic aspects of Hampshire life.\nWhile out talking to residents throughout the Alton Rural area, however, I hear the same frustrations and concerns about present life in Hampshire. People are fed up with the state of our roads and pavements, worry about further cuts to public services, waiting times at GP surgeries and hospitals, and want to properly protect our precious environment.\nFor too long the Conservatives running Hampshire County Council have taken local residents' votes for granted. But the results of the District council elections and the near elimination of the Conservatives' 22,000 majority in the General Election show that people have rightly had enough.\nWe need a County Council that listens to you and acts genuinely on your behalf. A council where we can properly represent you and your interests so that you are part of making the decisions that affect us all. It's time for a change for the better in Hampshire: it's time for a Liberal-Democrat-led Hampshire County Council. Help me ensure Alton Rural is part of that change\nPetersfield Butser - David Podger\nI’m Hampshire born with strong Hampshire roots and have lived in Lovedean and Petersfield for over 20 years.\nI have been out speaking to residents on the door step throughout 2024 and am continuing in 2025. Wherever I go I hear the same concerns: the state of our roads and pavements, fears over further cuts to public services, waiting times at GP surgeries, threats to close recycling centres that are then mysteriously reversed.\nFor too long, the Conservatives have taken the votes of local residents for granted. But the results of the District Council election and near elimination of the Conservative’s 22,000 majority in the general election show that people have had enough.\nPetersfield and Clanfield now have no Conservative District Councillors. I am working hard to ensure that there are no Conservative County Councillors in East Hampshire.\nWe need a County Council that trusts you more and really listens to you. A Council where you can be part of making the decisions that affect us all. It’s time for a change in Hampshire. It’s time for a Liberal Democrat-led Hampshire County Council.\nPetersfield Hangers - Thomas Figgins\nI was born in Petersfield and have had a strong connection to the local area from a young age, having first become politically engaged locally at 16 helping to work for a better deal for people in Petersfield and the Hangers.\nI've served Petersfield already as a Town Councillor since June 2023 and have loved every chance to make a positive difference working for the betterment of our community. Knocking on doors to listen to residents is the most important thing to do, we want to make sure that we deliver on what is most important for people locally. Whether it's the state of potholes on our roads, bus routes being axed, GP waiting times or the appalling state of recycling we will always fight for you and your concerns.\nFor too long the Conservatives have taken locals for granted, acted with impunity and borderline recklessness with public services. However, the recent results in the general election have shown that people have rightly had enough of Conservative administrations.\nWe need a County Council that listens and delivers on what residents need. A council that doesn't run behind closed doors and away from locals but one that works hand in hand with people to ensure the best results for everyone. It's time for a new and improved Hampshire; It's time for a Liberal Democrat led Hampshire County Council.\nLiphook, Grayshott & Headley - Lynsey Conway\nI’m a local mum, working in health and charity sector, who has lived in the area for over ten years.\nI previously stood for District Councillor in Bramshott and Liphook – and in 2023, I stood in Grayshott, where I narrowly missed out to the Conservatives by a tiny margin (41 votes).\nMy key areas of interest are enhancing local mental health services; improving Special Educational Needs (SEN) provision for children and young adults; and helping to address local traffic problems, particularly in Grayshott and Liphook, for the safety and well-being of our residents.\nI want to listen and truly represent your views during what could be the last, truly local democratic elections. NB: district councils are likely to be abolished as part of the Government’s plans for devolution and formation of large, unitary authorities.\nI am excited about the journey ahead and look forward to working with you all to bring positive change to our area.\nCatherington - Toby Woodcock\nHaving been born and raised in the Horndean area, I have developed a deep understanding and appreciation for the unique character of our community. At its heart, this is a place we all call home, a community defined by its shared values.\nLocal government is where real change begins. Our communities face challenges that require fresh ideas, collaboration and a commitment to fairness. As your representative, I will work to ensure your voice is heard and your concerns are addressed, not just in our community, but also across the broader county.\nAt its core, politics is the art of ensuring a better future for all. In these times of economic uncertainty, deepening inequality and the ever-present threat of climate crisis. We need bold, pragmatic leadership that can bridge our societal and political differences and benefit the needs of the many, not the few.\nThe challenges we face in our community are not dissimilar to those faced by our friends and neighbours across the Country. To create a brighter future, we must demand fresh ideas and a shared commitment to progress. I am here to work with our community, listen to our community and serve our community for the benefit of all.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_team_alton/content_7.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_team_petersfield/content_34.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_about-us_our-core-values/content_37.html": "Seven Core Lib Dem Values\nThese seven Core Values were voted on in October 2021 at the Party Conference by an open one Member, one Vote process (and should be read in conjunction with the inspiring Vision in the Preamble to the Constitution)\nLiberty\nThe right of individuals to make their own decisions about how they live their lives, as long as they do not cause harm to others; our aim is to empower and support individuals to pursue their dreams, to make the most of their talents and to live their lives as they wish.\nEquality\nWithout which true liberty cannot be realised, which requires an active state to: ensure that no one is held back by poverty, poor health, or discrimination, including on the basis of personal characteristics or beliefs; provide access to education or training, and other public services, including a welfare safety net; and guarantee that everyone enjoys equality before the law.\nDemocracy\nThrough which every citizen is empowered to make their voice heard, without being dominated by entrenched interests or the power of money; checks and balances, so that those in power cannot abuse their positions for personal gain or political advantage; and a plurality of views, where no individual or organisation is deterred from speaking truth to power.\nCommunity\nSupport for a diverse range of organisations that enable individuals to join together in the pursuit of common goals or activities; and the decentralisation of political and economic power to local government and the nations and regions of the UK.\nHuman rights\nProviding, defending and promoting equal legal rights for everyone to pursue their lives according to their abilities, wishes and means, with no discrimination on the basis of religion or belief, gender, sexuality, age, ethnicity, disability, or minority status in their country of birth or permanent residency.\nInternationalism\nSupport for a fairer and more equal, tolerant and connected world and collaboration with the UK's neighbours - including, ultimately, rejoining the EU - in guaranteeing peace and security, tackling the climate and nature emergencies, standing up to corporate power and spreading prosperity around the world\nEnvironmentalism\nActing at home and internationally to promote environmentally sustainable means of production and consumption and living in harmony with nature.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_about-us_preamble-to-the-constitution/content_31.html": "Preamble to the Lib Dem Constitution\nThe Liberal Democrats exist to build and safeguard a fair, free and open society, in which we seek to balance the fundamental values of liberty, equality and community, and in which no-one shall be enslaved by poverty, ignorance or conformity.\nWe believe that each generation is responsible for the fate of our planet and, by safeguarding the balance of nature and the environment, for the long-term continuity of life in all its forms.\nWe champion the freedom, dignity and well-being of individuals, we acknowledge and respect their right to freedom of conscience and their right to develop their talents to the full. We aim to disperse power, to foster diversity and to nurture creativity. We believe that the role of the state is to enable all citizens to attain these ideals, to contribute fully to their communities and to take part in the decisions which affect their lives.\nWe look forward to a world in which all people share the same basic rights, in which they live together in peace and in which their different cultures will be able to develop freely. Upholding these values of individual and social justice, we reject all prejudice and discrimination based upon race, ethnicity, caste, heritage, class, religion or belief, age, disability, sex, gender or sexual orientation and oppose all forms of entrenched privilege and inequality. Recognising that the quest for freedom and justice can never end, we promote human rights and open government, a sustainable economy which serves genuine need, public services of the highest quality, international action based on a recognition of the interdependence of all the world’s peoples and responsible stewardship of the earth and its resources.\nWe believe that people should be involved in running their communities. We are determined to strengthen the democratic process and ensure that there is a just and representative system of government with effective Parliamentary institutions, freedom of information, decisions taken at the lowest practicable level and a fair voting system for all elections. We will at all times defend the right to speak, write, worship, associate and vote freely, and we will protect the right of citizens to enjoy privacy in their own lives and homes.\nWe believe that sovereignty rests with the people and that authority in a democracy derives from the people. We therefore acknowledge their right to determine the form of government best suited to their needs and commit ourselves to the promotion of a democratic federal framework within which as much power as feasible is exercised by the nations and regions of the United Kingdom. We similarly commit ourselves to the promotion of a flourishing system of democratic local government in which decisions are taken and services delivered at the most local level which is viable.\nWe will foster a strong and sustainable economy which enables people to thrive in their communities, assessing progress by measuring people’s wellbeing. Such an economy will encourage necessary wealth creating processes, develop and use the skills of the people and work to the benefit of all, with a just distribution of the rewards of success. We want to see democracy, participation and the co-operative principle in industry and commerce within a competitive environment in which the state allows the market to operate freely where possible but intervenes where necessary. We will promote scientific research and innovation and will harness technological change to human advantage. We will work for a sense of partnership and community in all areas of life.\nWe recognise that the independence of individuals is safeguarded by their personal ownership of property, but that the market alone does not distribute wealth or income fairly. We support the widest possible distribution of wealth and promote the rights of all citizens to social provision and cultural activity. We seek to make public services responsive to the people they serve, to encourage variety and innovation within them and to make them available on equal terms to all.\nOur responsibility for justice and liberty cannot be confined by national boundaries; we are committed to fight poverty, oppression, hunger, ignorance, disease and aggression wherever they occur and to promote the free movement of ideas, people, goods and services. Setting aside national sovereignty when necessary, we will work with other countries towards an equitable and peaceful international order and a durable system of common security. Within the European Community we affirm the values of federalism and integration and work for unity based on these principles. We will contribute to the process of peace and disarmament, the elimination of world poverty and the collective safeguarding of democracy by playing a full and constructive role in international organisations which share similar aims and objectives. These are the conditions of liberty and social justice which it is the responsibility of each citizen and the duty of the state to protect and enlarge.\nThe Liberal Democrats consist of people working together for the achievement of these aims.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_louise-bevan-1/content_38.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_hampshire-hospitals-declare-critical-incident-as-beds-full/content_24.html": "Hampshire Hospitals Declare Critical Incident As Beds Full\nThis week, Hampshire Hospitals NHS trust declared a critical incident, saying hospitals are completely full.\nThe Trust looks after the Royal Hampshire Hospital in Winchester and Basingstoke Hospital, both serving East Hampshire. This is the second time the trust has declared a critical incident in less than a month.\nAfter months of warnings from a local Liberal Democrat MP about the winter crisis, the trust were forced to urge patients to seek alternatives. On Monday, the Trust said they had \"no capacity to admit further patients needing our care\".\nThis cannot be allowed to continue. Everyone deserves access to the care they need, when they need it.\nLib Dem MP Danny Chambers spoke to the BBC urging the government to fix both the 'front door' of the NHS - GPs and primary care - and the 'back door' of the NHS - social care. Listen here.\nWhen the Trust declared a critical incident in December, the Lib Dem MP for Winchester wrote to Labour ministers demanding immediate help to prevent a repeat occurence. Sadly, events repeated themselves this week.\nUnfortunately this is not uncommon, with Portsmouth University Hospitals NHS Trust - who run Queen Alexandra Hospital serving the south of East Hampshire - having declared similar capacity problems last year.\nThere is no fixing the NHS without fixing social care so that people can be discharged into the community safely, freeing up crucial hospital beds.\nDuring the last critical incident in December, nearly 200 beds were taken up at Winchester Hospital by people who were ready to be discharged, if help was available at home or in the community.\nSadly, the government recently put off their \"first steps\" of social care reform until 2028. It's just not good enough.\nTo fix the NHS, everyone needs proper access to their GP to catch health issues before they are urgent. This is only achievable if there are more GPs to see people.\nPeople from all over East Hampshire have already signed the petition for more GPs. Have you?\nEast Hampshire needs more GPs\nPeople in East Hampshire need more GPs so they can see a doctor when they need to.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_john-hutchinson-2-1-1-1/content_41.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_get-involved_poster-request/content_5.html": "Get your poster\nPutting a poster in your garden or window is a great way to support the Lib Dems at election time. Sign up here to get your poster from the local Lib Dems at the next election.\nPutting a poster in your garden or window is a great way to support the Lib Dems at election time. Sign up here to get your poster from the local Lib Dems at the next election.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_elaine-woodard/content_44.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_raising-council-charges-will-hurt-residents-say-lib-dems/content_46.html": "\"Raising council charges will hurt residents\" say Lib Dems\nTo reduce their £1.75 million ‘black hole’ in East Hampshire's finances, the council's Conservative leadership has decided to increase charges for council services by 10% across the board. This increase is on top of one agreed just a few months ago.\nThe Liberal Democrats fiercly oppose this blanket measure. Everyone uses council services from time to time, whether it's car parking or use of council facilities.\nDuring the cost of living crisis, raising fees such as parking charges will hit those who can afford it the least.\nCouncillor Elaine Woodard, Leader of the Liberal Democrat Group on East Hampshire District Council, said:\n“Raising these charges will be a real knock for East Hampshire residents and businesses.”\n“We need to attract shoppers into Alton and Petersfield, but raising parking charges will send people to Guildford, Winchester or Portsmouth instead.”\n“The Conservatives have made a real mess of the budget. They need to balance the books, but raising charges by a blanket 10% will hurt some of our worst-off residents.”\nAt the council meeting Liberal Democrat councillors expressed concerns about the effect on families' budgets and local businesses.\nWe'll always do our best to keep you up to date with changes at the council.\nStay in the loop by getting emails from us, we usually send no more than one or two a week.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_team_clanfield/content_13.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_discussion-grouyp-march-2025/content_23.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_john_hutchinson/content_42.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk/content_1.html": "Discussion Group - May 2025\nPaul Ferguson, Chief Reporter at the Petersfield Post will be our guest speaker.\nPaul Ferguson, Chief Reporter at the Petersfield Post will be our guest speaker.\nElectoral Reform: Why is the UK (except Wales, Scotland and Northern Ireland) still using First Past The Post in elections? What are the alternatives?\nThe Climate Crisis: The re-election of Trump, USA withdrawal from the Paris Agreement and the recent COP summit. What does it mean? Speaker is Paul Turner.\nThomas was born in Petersfield and has had a strong connection to the local area from a young age, first becoming politically engaged locally at 16 helping to work for a fair deal for people in Petersfield and the Hangers.\nHampshire Lib Dem MP urges government to help NHS with GPs and social care\nI’m Hampshire born with strong Hampshire roots and have lived in Lovedean and Petersfield for over 20 years.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_phil-shaw/content_43.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_david-podger/content_39.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_team_petersfield-ehdc/content_30.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_roland-richardson/content_36.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_contact-us/content_12.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_thomas-figgins-announced-as-the-liberal-democrat-county-council-candidate-for-petersfield-hangers/content_6.html": "Thomas Figgins announced as the Liberal Democrat County Council candidate for Petersfield Hangers\n\"I was born in Petersfield and have had a strong connection to the local area from a young age, having first become politically engaged locally at 16 helping to work for a better deal for people in Petersfield and the Hangers.\nI've served Petersfield already as a Town Councillor since June 2023 and have loved every chance to make a positive difference working for the betterment of our community. Knocking on doors to listen to residents is the most important thing to do, we want to make sure that we deliver on what is most important for people locally. Whether it's the state of potholes on our roads, bus routes being axed, GP waiting times or the appalling state of recycling we will always fight for you and your concerns.\nFor too long the Conservatives have taken locals for granted, acted with impunity and borderline recklessness with public services. However, the recent results in the general election have shown that people have rightly had enough of Conservative administrations.\nWe need a County Council that listens and delivers on what residents need. A council that doesn't run behind closed doors and away from locals but one that works hand in hand with people to ensure the best results for everyone. It's time for a new and improved Hampshire; It's time for a Liberal Democrat led Hampshire County Council.\"",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_steve-hunt/content_14.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_suzie-burns/content_18.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_chris-tonge/content_33.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_donate-to-east-hants-lds/content_9.html": "Donate to East Hampshire Liberal Democrats\nWe raise most of our funds locally to campaign here. No corporate donors, no unions, just individuals who care about local democracy and national issues.\nYour can donate by debit bank card using this link: Donate by bank card\nor donate by bank transfer: Unity Trust Bank, Account name East Hampshire Liberal Democrats Account nr 20456155 Sort Code 60-83-01.\nor donate by cheque to: The Treasurer, East Hampshire Liberal Democrats, Woodbine Cottage, Hawkley Road, Liss, GU33 6JP.\nIf you donate £500 or more then legally we need your name and address, please email to treasurer@ehlibdems.org.uk It will not be published by the Electoral Commission if less than £11,180 in one calendar year.\nThank you very much for your support",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_get-involved/content_11.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news/content_25.html": "Discussion Group - May 2025\nPaul Ferguson, Chief Reporter at the Petersfield Post will be our guest speaker.\nPaul Ferguson, Chief Reporter at the Petersfield Post will be our guest speaker.\nElectoral Reform: Why is the UK (except Wales, Scotland and Northern Ireland) still using First Past The Post in elections? What are the alternatives?\nThe Climate Crisis: The re-election of Trump, USA withdrawal from the Paris Agreement and the recent COP summit. What does it mean? Speaker is Paul Turner.\nThomas was born in Petersfield and has had a strong connection to the local area from a young age, first becoming politically engaged locally at 16 helping to work for a fair deal for people in Petersfield and the Hangers.\nHampshire Lib Dem MP urges government to help NHS with GPs and social care\nI’m Hampshire born with strong Hampshire roots and have lived in Lovedean and Petersfield for over 20 years.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nNo child should ever have to experience sexual abuse. These are horrifying crimes that cause so much harm to the children who are victims. We will keep up the pressure so that the action needed to make our communities safe all children finally happens.\nGovernment must deliver the change people are yearning for",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_our-campaigns/content_16.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_discussion-group-january-2025/content_40.html": "Discussion group - January 2025\n29 Dec 2024\nThe background to the meeting is the current crisis in the Prison Service which has been made obvious by the decision to release some prisoners early as a result of the riots re\nThe background to the meeting is the current crisis in the Prison Service which has been made obvious by the decision to release some prisoners early as a result of the riots re",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_email-sign-up/content_35.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_emily-young/content_10.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_east-hampshire-christmas-and-new-year-bin-collections/content_45.html": "East Hampshire Christmas and New Year Bin Collections\nWhether it's leftover wrapping paper or discreetly discarded sprouts you're looking to get rid of over Christmas, make sure you put your bin out on the right day!\nLots of bin collection dates change over Christmas and into the start of January as refuse collectors take a well-earned break on Christmas Day.\nTo catch up, this means there will be some Saturday collections over Christmas.\nSee our chart for all the changes and when you can expect your bin to be collected.\nWe regularly send local news to our email subscribers. If you like updates like this, why not sign up below?\nWEEK ONE: 23-27 December\n| Usual collection | Festive collection |\n|---|---|\n| Mon 23 December | No change |\n| Tue 24 December | No change |\n| Wed 25 December | Fri 27 December |\n| Thu 26 December | Sat 28 December |\n| Fri 27 December | Mon 30 December |\nWEEK TWO: 30 December - 3 January\n| Usual collection | Festive collection |\n|---|---|\n| Mon 30 December | Tue 31 December |\n| Tue 31 December | Thu 2 January |\n| Wed 1 January | Fri 3 January |\n| Thu 2 January | Sat 4 January |\n| Fri 3 January | Mon 6 January |\nWEEK THREE: 6-10 January\n| Usual collection | Festive collection |\n|---|---|\n| Mon 6 January | Tue 7 January |\n| Tue 7 January | Wed 8 January |\n| Wed 8 January | Thu 9 January |\n| Thu 9 January | Fri 10 January |\n| Fri 10 January | Sat 11 January |\nNormal service resumes on Monday 13 January 2025.\nIf your bin is not collected on time, you should report it to the council here.\nCan we keep you updated with local news?",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_discussion-group-may-2025/content_26.html": "Discussion Group - May 2025\nPaul will talk initially about the current role of the local media with specific reference to the Petersfield Post. He will also talk about the rapid changes taking place in the media especially regarding Social Media.\nWe will look at where people now get their news from, consider how reliable these new sources are and the implications for a democratic society.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_gps/content_17.html": "1.8 GP million appointments took over 2 weeks to happen in our NHS area last year\nPeople had to wait more than two weeks for over 1.8 million GP appointments in Hampshire and Isle of Wight NHS in 2023. This means too many people are not seeing a GP when they need to.\nWhen healthcare is delayed, outcomes are worse for the patient and more expensive for the NHS. Liberal Democrats are calling for more GPs for East Hampshire, and for measures to relieve the pressure on GPs, such as allowing pharmacists to issue some prescriptions.\nDo you agree with us that East Hampshire needs more GPs so everyone can access the care they need, when they need it?\nEast Hampshire needs more GPs\nPeople in East Hampshire need more GPs so they can see a doctor when they need to.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_team_horndean/content_20.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_about-us/content_28.html": "East Hampshire Liberal Democrats is a friendly local party which exists to promote the Liberal Democrat's vision and values and put these into practice. These are shown as drop down menus in the About Us tab as the What the Lib Dems believe (from the Lib Dem constitution) and Seven Core Values.\nIn order to deliver that vision, we campaign broadly and work to support the election of Liberal Democrat Councillors and MPs. Locally, we have been making great progress in councillors and vote share.\nAs a volunteer-led and democratic party, we always welcome contact from members and supporters – and if you want, with you always in control, we always have ways in which you can help!\nOur members and ward teams are found across the district as local branches. Please use the Contact tab to get in touch.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_team/content_21.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_john-hutchinson-1/content_22.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_donate/content_4.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowOur donations will help campaigning in East Hampshire for the election of councillors to fully represent the residents in the East Hampshire District Council area, and policies to support support society, sustainability and climate issues.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_ginny-boxall/content_8.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_discussion-group-february-2025/content_27.html": "Discussion group - February 2025\nThe Climate Crisis: The re-election of Trump, USA withdrawal from the Paris Agreement and the recent COP summit. What does it mean? Speaker is Paul Turner.\nPaul describes himself as a \"radical geographer and teacher as well as a social and environmental activist”. He is the educational lead for the Ministry of Eco Education which is a charitable project promoting initiative sustainability education for children across the country.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_volunteer/content_29.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_search/content_32.html": "Discussion Group - May 2025\nPaul Ferguson, Chief Reporter at the Petersfield Post will be our guest speaker.\nPaul Ferguson, Chief Reporter at the Petersfield Post will be our guest speaker.\nElectoral Reform: Why is the UK (except Wales, Scotland and Northern Ireland) still using First Past The Post in elections? What are the alternatives?\nThe Climate Crisis: The re-election of Trump, USA withdrawal from the Paris Agreement and the recent COP summit. What does it mean? Speaker is Paul Turner.\nThomas was born in Petersfield and has had a strong connection to the local area from a young age, first becoming politically engaged locally at 16 helping to work for a fair deal for people in…\nHampshire Lib Dem MP urges government to help NHS with GPs and social care\nI’m Hampshire born with strong Hampshire roots and have lived in Lovedean and Petersfield for over 20 years.\nAlton Town Alton Town - Lizzie Marshall Hello, I’m Lizzie Marshall, and I’m excited to to be the candidate representing Alton Town in the Hampshire County Council elections. I was born in…\nJanuary's talk will be by Amy Dolley of the Howard League for Prison Reform. The background to the meeting is the current crisis in the Prison Service which has been made obvious by the decision to…\nAll the dates you need to know for getting rid of wrapping paper\nConservative-led East Hampshire District Council has decided to raise charges for council services, including car parking.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_news_article_david-podger-announced-as-liberal-democrat-county-council-candidate-for-petersfield-butser/content_19.html": "David Podger announced as Liberal Democrat County Council candidate for Petersfield Butser\nPetersfield Butser - David Podger\nI’m Hampshire born with strong Hampshire roots and have lived in Lovedean and Petersfield for over 20 years.\nI have been out speaking to residents on the door step throughout 2024 and am continuing in 2025. Wherever I go I hear the same concerns: the state of our roads and pavements, fears over further cuts to public services, waiting times at GP surgeries, threats to close recycling centres that are then mysteriously reversed.\nFor too long, the Conservatives have taken the votes of local residents for granted. But the results of the District Council election and near elimination of the Conservative’s 22,000 majority in the general election show that people have had enough.\nPetersfield and Clanfield now have no Conservative District Councillors. I am working hard to ensure that there are no Conservative County Councillors in East Hampshire.\nWe need a County Council that trusts you more and really listens to you. A Council where you can be part of making the decisions that affect us all. It’s time for a change in Hampshire. It’s time for a Liberal Democrat-led Hampshire County Council.\nPetersfield Butser division covers most of Petersfield including the Heath and Bell Hill. It also covers Clanfield, Chalton, East Meon and Langrish along with other villages.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_warren-moore/content_15.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_branches/content_3.html": "Alton Branch\nAlton branch includes Alton town and the surrounding rural areas\nThe electoral area covered includes the county divisions of Alton Town and Alton Rural.\nhttps://www.facebook.com/AltonLiberalDemocrats\nEmail: alton@ehlibdems.org.uk\nPetersfield Area Branch\nThis branch includes around Petersfield, west to Ropley and south to Horndean and Rowlands Castle.\nThe electoral area covered includes the county divisions of Catherington, Petersfield Butser and Petersfield Hangers.\nhttps://www.facebook.com/PetersfieldLibDems\nEmail: petersfield@ehlibdems.org.uk\nWoolmer Forest Branch\nThis branch includes Bordon & Whitehill, Grayshott, Headley, Liphook and surrounding villages.\nThe electoral area covered includes the county divisions of Liphook, Headley & Grayshott\nhttps://www.facebook.com/LiphookHeadleyGrayshottLibDems\nand Whitehill, Bordon & Lindford.\nhttps://www.facebook.com/whitehillbordonlindfordlibdems\nEmail: hello@ehlibdems.org.uk",
  "https_www_ehlibdems_org_uk_/https_www_ehlibdems_org_uk_phil-shaw-PTC/content_47.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information."
}