{
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_sign-up/content_6.html": "Home\nMeet Yuan\nMy Priorities\nCampaigns\nWork for Yuan Yang MP\nGet in Touch\nPlus\nGive us a brief overview of what you'd like to talk about, so we can best help you.\nI would like to receive email updates from Yuan Yang about her work in parliament, the constituency, and her ongoing campaigns.\nBy submitting this form, you agree to the storage of your data and the usage of your information in line with this website's privacy policy.",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_jobs_constituency-intern/content_7.html": "top of page\nJob Title: Constituency Intern - 3 roles\nWorking For: Yuan Yang (MP for Earley and Woodley)\nLocation: Constituency Office/Home\nSalary: £24,570 -25,643 pro-rata\nLength of Contract: 1 st March 2025 - 31st March 2025\nJob Details\nYuan Yang MP is recruiting for three paid interns to join her constituency team. This is an exciting opportunity to support the dedicated local team in serving constituents, supporting with the important duties of an MP’s office.\nThese are full-time roles, though part-time and flexible working requests will be considered. Please note that these are fixed term, one-month roles. No prior experience in politics or government is needed. We will prioritise candidates from backgrounds that are underrepresented in politics, as well as those who can display deep local knowledge of the constituency.\nYuan is looking for proactive candidates who display initiative and can take on a range of different tasks, with a primary focus on drafting policy responses to constituent questions. An ability to draft strong written responses is crucial; training, support and information will be provided throughout.\nThe Constituency Interns will have the opportunity to learn about the full scope of work undertaken in the office of an active and impactful local MP, to work closely with team members in a range of roles, and to help shape the work too. There will also be an opportunity to visit parliament and occasionally work in Yuan’s Parliamentary Office.\nTo get the most out of the internship, successful candidates will spend a good amount of time working in the constituency office – so the ability to travel to the Reading/Earley area is vital.\nKey responsibilities:\nDrafting responses to constituents on policy issues:\n-\nResearching key topics and topical issues\n-\nWriting substantive responses to questions and queries\n-\nManaging policy casework systems\nProviding basic administrative support:\n-\nEntering and managing data\n-\nCreating contact directories\n-\nMail merging, preparing letters\n-\nLearning/assisting with writing content for letters, website and social media\n-\nAssisting/learning how to monitor media coverage and brief the MP\n-\nAssist with arrangements for events; this may include venue research and bookings; compiling and managing guest-lists; liaising with suppliers; and providing on-the-day event support as required.\nPerson Specification:\nEssential:\n-\nGood written and verbal communication skills\n-\nGood working knowledge of current affairs\n-\nGood knowledge of the important issues within Earley and Woodley\n-\nGood all round IT skills\n-\nAbility to work well as part of a team and use own initiative\n-\nSympathetic to the values of the Labour Party\nDesirable:\n-\nA-Levels or equivalent qualifications\nUpon appointment you will be required to apply for security clearance, undertaken by the Security Vetting and Pass Office. See Members’ Staff Security Clearance page for further info. MPs generally pay staff in accordance with IPSA guidelines.\nInterview/Start Dates\nClosing Date: 13th February 2025\n-\nThe closing time for applications is 15:00 on the closing date.\n-\nInterviews will take place by Teams on Wednesday 27 February.\n-\nThe start date for the successful candidates will ideally be 1 st March 2025.\nApplication Details\nPlease send a relevant CV and a short statement of maximum 150 words, explaining why you’d be interested in the role. Additionally, please include a piece of written work you have completed that you feel demonstrates your writing ability - this could be anything from a blog to a formal piece of coursework. Please send to yuan.yang.mp@parliament.uk with ‘Constituency Intern Application - \"Your First and Last Name\"’ in the subject line.\nbottom of page",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_privacy-policy/content_9.html": "Privacy Policy\nI am the MP for Earley and Woodley. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nData Collection & Use\nThe office of Yuan Yang MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do so where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, e-mail, phone or text message about my work and give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector, and I may write to you in connection with my activities as an MP.\nI will only send e-mails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nTo communicate with you about my work as the MP for Earley and Woodley, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases if you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Earley and Woodley, or until you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nYour rights:\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used.\nYou can:\n-\nObtain copies of the personal information I hold about you (known as a “subject access request”)\n-\nRequest that I correct or update any personal information held about you\n-\nAsk that we erase or restrict the way in which I use your information\n-\nRequest that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nData Protection Officer, Office of Yuan Yang MP, House of Commons, London, SW1A 0AA\nyuan.yang.mp@parliament.uk - subject of the email as ‘data protection’\nAlternatively, you have the right to complain to the Information Commissioner’s Office (the “ICO”) if you are not satisfied with the way I use your information. You can contact the ICO by writing to: Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, Cheshire SK9 5AF.",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_jobs/content_3.html": "top of page\nHome\nMeet Yuan\nMy Priorities\nCampaigns\nWork for Yuan Yang MP\nJob - Constituency Intern\nGet in Touch\nPlus\nUse tab to navigate through the menu items.\nI'm Currently Hiring for the Following Roles:\nConstituency Intern\nI'm recruiting for three paid interns to join her constituency team. This is an exciting opportunity to support the dedicated local team in serving constituents, supporting with the important duties of an MP’s office.\nbottom of page",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_updates/content_4.html": "top of page\nGet in touch\nEmail me at yuan.yang.mp@parliament.uk or call our office at 0118 324 0847.\nGet updates about my work in Parliament and in the Constituency:\nSee how your data is used: Privacy Policy\nbottom of page\nSee how your data is used: Privacy Policy",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_local-voices/content_8.html": "Our Constituency\nEarley and Woodley Constituency includes over 70,000 voters across south Reading, Sonning, Shinfield, Earley, and Woodley.\nFollowing fantastic results at this year's local elections, Labour is now the biggest party across the 9 wards that make up our new constituency - only we can beat the Conservatives in Earley and Woodley.\nIt is clear that residents want a fresh start for Earley and Woodley constituency, and are ready to put their trust in our changed Labour Party to make it happen.\n\"Traditionally I vote Conservative. But after scandal after scandal, our rivers being poisoned, potholes in the road. I think we need change, so I’m voting Labour in the general election.\"\nMatthew Wells\nTradesman in Woodley\n\"The NHS requires radical change, modernisation and long-term planning. Both locally and nationally Labour will rise to this challenge to make it a service that provides the medical and social care patients should expect and staff are valued and supported. Labour have an excellent candidate in Yuan Yang, she has many of the skills required both to serve as our local MP and contribute to national issues.\"\nIan Kemp\nGP in Reading\n\"I'm a youth worker and I've lived in Earley for almost 30 years now. Every day, I see young people struggling with mental health. Labour will put early-stage intervention into every school, and that’s something I’m really excited to see. I believe a Labour government will bring answers that we haven’t had for the past 14 years, and that’s why I'll be voting Labour in Earley and Woodley this year.\"\nChris Doughty\nYouth Worker in Earley\n\"It’s so obvious to me that people are desperate for a bold new vision for themselves and their families. It’s a vision for a fairer society with strong public services built on the opportunities that come from the green transition. Yuan has already achieved remarkable things through her intellect and hard work.\"\nAndrew Charlton-Perez\nEarley resident and former Chair of Governors of Radstock Primary School\n“In this new constituency, the demand for groundbreaking leadership is paramount. Yuan's intellect and intuition extend far beyond the realm of national and international affairs, revealing a profound and nuanced grasp of local concerns. Moreover, Yuan's aptitude for introducing fresh, innovative ideas to the table is precisely what we require to tackle the multitude of issues that confront us today. Her unique blend of knowledge and creativity makes her an exceptional choice to represent our interests in Parliament.”\nTahir Naqash\nEarley resident and Labour Party member\nNational endorsements\n\"I first met Yuan when she was an economics student and her sharp mind and clear convictions inspired me. Over the past decade I've seen her go on to inspire a generation of young economists worldwide through setting up the Rethinking Economics campaign. I have huge confidence in her ability to win campaigns, and to stand for a greener future.\"\nKate Raworth\nAuthor of Doughnut Economics\n\"Yuan is a gifted economist with extensive knowledge of global economic and financial systems, but also deeply committed to social justice in Britain and across the world. We need people like Yuan in parliament.\"\nLord Adair Turner\nFormer chair of the UK Committee on Climate Change",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_rfc-petition/content_11.html": "PETITION: Hold an Inquiry into Reading FC's Absent Owner\n10, 458 SIGNATURES SO FAR\nFootball has an ownership problem.\nSince 2012, Reading Football Club has been through multiple owners and, in the last five years alone, has slid towards insolvency under the ownership of Mr Dai Yongge and Ms Dai Xiu Li. Staff have been paid late, multiple winding-up petitions have been issued by HMRC and staff have been forced to endure redundancies and late wage payments on multiple occasions.\nWith no end in sight, Reading FC risks becoming the latest example of a historic, community-centred club destroyed by fickle owners who cannot be held to account. This has to change, now.\nReading FC isn’t the only club that has suffered at the hands of poor, absent owners - dozens of other clubs across England and Wales are currently in trouble. The Government’s Football Governance Bill will help clubs in future, but clubs in peril now need answers.\nAn inquiry into how Reading deteriorated in this way will not only identify those responsible, but also provide valuable insights into poor governance for the new Independent Football Regulator. Other fans should not have to go through the same turmoil.\nWe are calling for the Culture, Media and Sport Select Committee and the Business and Trade Select Committee to launch an inquiry into the ownership and governance affairs of Reading Football Club since 29 May 2012 on grounds of public interest, with a particular focus on the governance of Reading Football Club since May 2017.\nSign our petition today:\nBy Submitting this form you agree to the processing and storage of your data by Yuan Yang MP in accordance with our privacy policy.",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_meet-yuan/content_2.html": "Meet Yuan\nI’m Yuan, your Member of Parliament. I live in Earley with my family, and I will stay rooted here.\nMy parents came to the UK when I was four years old with very little. I started primary school not knowing how to speak English - but I got a great education and went on to attend a brilliant university. We eventually settled in Earley and built our lives here.\nI’m a local activist with a national platform, as a journalist and seasoned campaigner. I founded an education charity, called Rethinking Economics, that’s trained and mobilised thousands of activists. Now, ten years on, the charity is serving students in over a hundred universities around the world.\nI’m an economist, who went to university during the financial crisis, and started work during the recession. That’s why I’m so passionate about economic justice - I will advocate for a new economy and support Labour's New Deal for Working People.\nI'm determined to rebuild trust in politics from the ground-up.\nLet's build a better future, together.",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_management-charges_firstport-meeting/content_12.html": "Home\nMeet Yuan\nMy Priorities\nCampaigns\nWork for Yuan Yang MP\nGet in Touch\nPlus\nI am a resident of Loddon Park, or a property managed by FirstPort\nConsent to store your data in line with our privacy policy\nBy ticking this box you agree to the use of your data for this purpose*\nI would like to receive Yuan Yang MP's regular email newsletter",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org/content_1.html": "top of page\nI'm Yuan Yang,\nLabour MP for our\nnew constituency of\nEarley and Woodley, covering Shinfield and Whitley.\nI’m your Labour MP in our new seat, which covers Whitley, Earley, Woodley, Sonning, and Shinfield.\nFor some Constituents, I'm their first Labour MP. Many others have lost faith in politics altogether - I will deliver for all constituents by making politics about public service.\nOver the coming weeks, I will open Earley and Woodley Constituency’s first constituency office, rebuilding trust from the ground-up.\nI will represent all constituents, regardless of how they voted this time.\nTrust and leadership needs to be earned through action - it’s time to get to work.\nbottom of page",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_my-priorities/content_5.html": "top of page\nPersonal Pledges\nStaying Local\nA Local MP: I will continue living in our constituency so that I can always be in touch with your needs.\nAccountable to You: As a former journalist, I’m committed to transparency and accountability. I will make myself available to answer your questions through email, phone calls and regular open surgeries.\nOn Your Side\nSupporting You: I will open an office here in the constituency to welcome anyone who needs our support.\nFighting for You in Parliament: I will campaign on the issues that matter to you most – such as improving education, reducing waiting lists and getting our economy working again.\nDedicated\nI will be a full-time representative and not take any second jobs, in order to concentrate on fighting for you.\nbottom of page",
  "https_www_yuanforearleyandwoodley_org/https_www_yuanforearleyandwoodley_org_management-charges/content_10.html": "top of page\nTackling unfair property charges facing leaseholders and freeholders in our Constituency\nThousands of families across our constituency are paying unfair and opaque property management charges in new-build developments in Shinfield, Spencers' Wood, Woodley and beyond. This issue comes up when I speak to residents on the doorstep almost every week, and so I've made it one of my priority campaigns over the course of this Parliament.\nMany people have seen significant rises in their fees with little or no explanation, only to receive poor service in return.\nIf you live in a leasehold or freehold home, and are experiencing issues with service charge abuse, I went to hear from you: fill out my survey below.\nbottom of page"
}