{
  "https_noahlaw_co_uk/https_noahlaw_co_uk_about-me/content_3.html": "I grew up in Lostwithiel, went to school in the constituency at Fowey, and completed my Bachelor’s degree at the University of Exeter’s Cornwall Campus.\nIn the years since, I’ve worked in London, Birmingham, and Helsinki, Finland – as well as in developing countries – and, since the pandemic, largely been back home in Cornwall. I earned masters degrees in economic history from Cambridge and business administration from Oxford and earned the Chartered Financial Analyst designation.\nWith such a variety of movement, you might understand why I longed to come home, back to my beloved family who, as nurses and teachers, raised me with Labour values, and bring to bear my experience in economic development against the challenges Cornwall faces.\nAs a local, young but professionally experienced parliamentarian, I well understand what it will take to stop the brain drain and get a new generation inspired to the potential of our county.\nIn my spare time, I enjoy making music, art and architecture, and riding the waves on the north coast.\nI also enjoy travelling and learning about different cultures. I won’t pretend to have more than a cursory understanding of Cornish, but I do speak Finnish, French, and German.\nI am inspired to bring both lessons of Nordic social democracy and global development success stories like the Asian tigers back home to Cornwall and get our economy roaring, whilst ensuring the benefits accrue to the people who create the wealth – working people and their families.\nI have yearned all my life to build a better Cornwall. And the experience I’ve gained the past few years, combined with the tools a Labour Government will put at our disposal, mean I can deliver it. I’m passionate about policy that can improve people’s lives and, despite a demanding professional life, and dedicated campaigner, with proper Labour values, who gets how business works and how make it deliver for working people.\nI’ll be an MP with the energy and ideas to provide a fresh start for our part of Cornwall.",
  "https_noahlaw_co_uk/https_noahlaw_co_uk/content_1.html": "Fighting for Cornish Prosperity\nI’m an economic development professional and your newly elected MP for St Austell & Newquay.\nI’ll fight to transform the fortunes of our part of Cornwall and deliver great, green jobs, homes for people not profit, and world class public services.\nWe are sat on some of the most significant natural resources and cultural value that Britain has to offer. And yet, St Austell & Newquay includes some of the poorest areas in the country.\nWe deserve better and I am determined to use my experience to help deliver it for working people and their families.",
  "https_noahlaw_co_uk/https_noahlaw_co_uk_contact/content_4.html": "Contact your Member of Parliament for St Austell and Newquay.\nI am still in the process of setting up my office, therefore response time to your email will be greater than usual, and your patience is appreciated.\nPlease note, if you are a constituent living in St Austell & Newquay, I require your contact details including your name and postal address to allow me to take up your case. Parliamentary protocol means I can only act for those living within the constituency.\nOffice phone number: 020 7219 7751\nEmail: Please fill in the below form. I will ensure that myself or one of my team gets back to you.",
  "https_noahlaw_co_uk/https_noahlaw_co_uk_privacy-policy/content_5.html": "Privacy Policy\nI am the Member of Parliament (MP) for the St Austell & Newquay constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf, and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (http://labour.org.uk/privacy-policy/) for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy data protection officer can be contacted at noah.law.mp@parliament.uk.\nData collection and use\nThe Office of Noah Law MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary to advocate on your behalf. Please see the “who I share your information with” section for more information on this.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector, and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any authorised decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities, and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nTo communicate with you about my work as the MP for St Austell & Newquay, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete the request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain personal information so long as I am the MP for St Austell & Newquay, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I will also use IP addresses in the aggregate to track which pages people visit to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites\nThis website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n- Obtain copies of the personal information I hold about you (known as a “subject access request”)\n- Request that I correct or update any personal information held about you\n- Ask that we erase or restrict the way in which I use your information\n- Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer using this email address:\nAlternatively, you have the right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "https_noahlaw_co_uk/https_noahlaw_co_uk_noahs-3-pledges/content_2.html": "Fighting for Cornish Prosperity\nClick here to sign up for my upcoming events on my Pledge to Fix the Cornish Housing Crisis in February."
}