{
  "https_alexballinger_org_uk_/https_alexballinger_org_uk_community-champion/content_2.html": "November 2024\nDecember 2024\nCopyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_alexballinger_org_uk_/https_alexballinger_org_uk_privacy-notice/content_8.html": "This is the privacy notice for the office of Alex Ballinger, MP for Halesowen. This notice relates to his policy and casework activities.\nAlex is the controller responsible for your personal data. You can contact him using the Get in touch function on this website.\nWe process information about you including your name, contact details and any information that you provide to us e.g. about a query or problem that you share with us.\nThis office discharges the duties of a Member of Parliament. We conduct constituency casework and respond to communications about policy e.g. petitions, campaigns, etc.. We hold constituency surgeries and community engagement events.\nWe process this personal data because it is necessary for the performance of a task in the public interest. If we process special categories of personal data, we do so on the basis that it is substantially in the public interest. We will process your data only to the extent necessary for this purpose.\nWe may share your personal data with other organisations in the course of dealing with your casework or query e.g. local authorities, public bodies, schools, health care providers, etc..\nWe will hold your personal data for the duration of Alex's tenure as the Member of Parliament for Halesowen.\nYou have the right to request access to your personal data, to have incorrect data about you rectified, to have data erased, to have restrictions placed on our use of your data, and the right to object to our use of your data.\nEach of these rights is subject to exemptions and limitations.\nIf you wish to exercise any of these rights, please get in touch.\nIn the event that you wish to complain about our processing of your data, please contact the Information Commissioner's Office.\nFor more information on how the Labour Party processes your personal data, please visit the Labour Party website.\nCopyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN",
  "https_alexballinger_org_uk_/https_alexballinger_org_uk_work-in-parliament/content_6.html": "Copyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_alexballinger_org_uk_/https_alexballinger_org_uk_how-can-i-help%3F/content_7.html": "My casework service is supported by three full-time members of staff.\nWe’re a small team but we work really hard to support as many people as possible, as quickly as possible.\nBecause we receive so many requests for assistance we sometimes have to prioritise urgent cases first. We'll also prioritise personal emails over any automated campaign emails.\nBefore you get in touch it's important that you know there is a strict Parliamentary protocol which prevents me from intervening on behalf of another MP’s constituents.\nSo please do double check that you live in the Halesowen constituency and that I am your member of Parliament. Enter your postcode here to check.\nCopyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN",
  "https_alexballinger_org_uk_/https_alexballinger_org_uk/content_1.html": "Sign up to receive regular updates from me\nCopyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_alexballinger_org_uk_/https_alexballinger_org_uk_about-alex/content_5.html": "Alex is the Member of Parliament for Halesowen. He was elected in 2024.\nAlex has always been driven by public service. He served with the Royal Marines, led humanitarian projects in the Middle East, and before getting elected ran a mental health charity that helped people across Birmingham and the Black Country.\nAlex twice served our country in Afghanistan helping keep our country safe, before becoming an aid worker and diplomat. Alex helped set up schools and hospitals for people fleeing war zones, helped organise aid convoys to Syria and worked on girls education in Pakistan.\nCopyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN",
  "https_alexballinger_org_uk_/https_alexballinger_org_uk_get-in-touch/content_4.html": "This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nCopyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_alexballinger_org_uk_/https_alexballinger_org_uk_home/content_3.html": "Sign up to receive regular updates from me\nCopyright © 2024 Alex Ballinger - All Rights Reserved.\nPromoted by Matt Collins on behalf of Alex Ballinger, both at 14 Peckingham Street, Halesowen B63 3AN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
}