{
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_newsletter/content_17.html": "Stay up to date with what I've been up to by signing up to my email newsletter which will be delivered to your inbox regularly.\nYes, subscribe me to your newsletter.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_the-west-brom/content_8.html": "The West Brom\n- Sarah Coombes\n- Sep 18, 2024\n- 1 min read\nThe West Brom is such an important business to the area, and in line with its mutual principles, shares my desire to serve the community and local people.\nI was delighted to meet many of the team this week and to answer lots of interesting questions about how we get Britain building, support people through the cost of living crisis and ensure secure homes for families",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_gp-appointments/content_4.html": "GP Appointments\n- Sarah Coombes\n- Oct 8, 2024\n- 1 min read\nUpdated: Oct 21, 2024\nGP appointments is one of the issues that constituents contact me about most. Today I asked the Prime Minister what the Government are doing to make sure we can all see a GP when we need to.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_profile_sarah_profile/content_13.html": "top of page\nProfile\nJoin date: May 8, 2023\nPosts (37)\nOct 9, 2024 ∙ 1 min\nMaiden Speech\nFor most people when they hear the words West Bromwich, the next word they think of is Albion. We are so proud of our club (even if it is...\n189\n0\nOct 8, 2024 ∙ 1 min\nGP Appointments\nGP appointments is one of the issues that constituents contact me about most. Today I asked the Prime Minister what the Government are...\n127\n0\nSep 29, 2024 ∙ 1 min\nWest Brom Fire Station\nWest Midlands Fire Service is vital to our safety - from fires, to RTAs, to safety checks and prevention. It was great to spend time...\n32\n0\nSarah Coombes\nAdmin\nMore actions\nbottom of page",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_boing-boing/content_6.html": "Boing Boing\n- Sarah Coombes\n- Sep 27, 2024\n- 1 min read\nThe Albion is so important to our area and it was great to catch up with Mark Miles this week to discuss how we can work together going forward.\nGood luck to the Baggies today. Let’s keep this unbeaten run going!",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_privacypolicy/content_22.html": "Privacy policy\nI am the MP for West Bromwich Constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/ ) for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy responsible officer for data protection can be contacted at laura.rollins@parliament.uk\nData collection and use\nThe office of Sarah Coombes MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with:\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for West Bromwich Constituency, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary, although I may retain information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for West Bromwich Constituency, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites:\nThis website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights:\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n-\nObtain copies of the personal information I hold about you (known as a “subject access request”)\n-\nRequest that I correct or update any personal information held about you\n-\nAsk that we erase or restrict the way in which I use your information\n-\nRequest that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications form me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my responsible officer:\nThe Office Manager\nOffice of Sarah Coombes MP\nAlternatively you have right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_west-brom-fire-station/content_5.html": "West Brom Fire Station\n- Sarah Coombes\n- Sep 29, 2024\n- 1 min read\nWest Midlands Fire Service is vital to our safety - from fires, to RTAs, to safety checks and prevention. It was great to spend time with White Watch at West Bromwich Fire Station to hear about what they do to keep us safe and the challenges they face.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_industrial-strategy/content_21.html": "Industrial Strategy\n- Sarah Coombes\n- Sep 4, 2024\n- 1 min read\nUpdated: Oct 21, 2024\nWe have a strong and proud history of manufacturing in the Black Country and it was good to hear from Jonathan Reynolds MP today that our region has a major role to play in the forthcoming Industrial Strategy.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_new-houses-in-west-bromwich/content_3.html": "New Houses in West Bromwich\n- Sarah Coombes\n- Sep 24, 2024\n- 1 min read\nIt was fantastic to visit Green Square Accord's Swan Lane development here in West Bromwich recently, where 147 much needed affordable and social rent homes are being built by Morro Partnerships.\nYou can read more here: https://www.greensquareaccord.co.uk/.../west-brom-mp.../",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_blog/content_24.html": "top of page\nMaiden Speech\nFor most people when they hear the words West Bromwich, the next word they think of is Albion. We are so proud of our club (even if it is...\nOct 9, 2024\nGP Appointments\nGP appointments is one of the issues that constituents contact me about most. Today I asked the Prime Minister what the Government are...\nOct 8, 2024\nWest Brom Fire Station\nWest Midlands Fire Service is vital to our safety - from fires, to RTAs, to safety checks and prevention. It was great to spend time...\nSep 29, 2024\nBoing Boing\nThe Albion is so important to our area and it was great to catch up with Mark Miles this week to discuss how we can work together going...\nSep 27, 2024\nbottom of page",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_utilita-hub/content_9.html": "Utilita Hub\n- Sarah Coombes\n- Sep 17, 2024\n- 1 min read\nThe Utilita Hub in West Brom has been offering local people advice on energy bills and energy efficiency for the last four years. It was good to visit the team this week and talk about the support they offer the community as well as the future of GB Energy.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_crafts-at-good-shepherd-with-st-john/content_19.html": "Crafts at Good Shepherd with St JohnSarah CoombesAug 27, 20241 min readIt was lovely to spend time at Good Shepherd with St John joining in with the craft activities and seeing the valuable contribution they make to the community.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_evidence-in-court/content_18.html": "Evidence in Court\n- Sarah Coombes\n- Sep 9, 2024\n- 1 min read\nUpdated: Oct 21, 2024\nFor many people giving evidence in court can be distressing. Today I asked the Minister what the Government were doing to ensure victims could give evidence by video link if needed.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_improving-transport/content_20.html": "Improving Transport\n- Sarah Coombes\n- Sep 3, 2024\n- 1 min read\nIt was great to chat with our new Deputy Mayor Sharon Thompson earlier at the Intelligent Transport system event in Parliament. I look forward to working together to ensure the West Mids has an even better modern transport network.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_midland-met-opening/content_2.html": "Midland Met Opening\n- Sarah Coombes\n- Sep 19, 2024\n- 1 min read\nIt was brilliant to be at the brand new Midland Met today, and hear from the heroic team that delivered this new hospital - which was first proposed by the last Labour government!\nPeople in Sandwell deserve the best, most advanced healthcare and that is what this hospital is about. Given the Black Country health system is the second most deprived in the country, I hope all the modernity and ambition of Midland Met will make a big difference to our health outcomes.\nI’ve been in close contact with the leaders of the NHS trust about the transition of the A&E from Sandwell to Midland Met, which will happen when the new hospital formally opens. An urgent treatment centre will still be at Sandwell for things like sprains and breaks.\nThis is a really important moment for our area and I am committed to supporting the community with the change.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_west-mids-police/content_11.html": "West Mids Police\n- Sarah Coombes\n- Sep 15, 2024\n- 1 min read\nIt was good to visit the West Midlands Police command centre today and have the opportunity to raise some local policing and crime issues, such as antisocial behaviour, youth violence and car theft, with the Chief Constable and Police and Crime Commissioner.\nThe Chief Constable set out the improvements made at west Mids police in recent years but recognised they need to do more to improve the response to crimes like car theft which I know is a huge issue in Great Barr, Tamebridge and many areas across the constituency.\nI’ll continue to work closely with the police going forward.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_maiden-speech/content_12.html": "Maiden Speech\n- Sarah Coombes\n- Oct 9, 2024\n- 1 min read\nUpdated: Oct 21, 2024\nFor most people when they hear the words West Bromwich, the next word they think of is Albion. We are so proud of our club (even if it is just over the constituency boundary), so naturally I had to mention them in my maiden speech today.\nI know what a privilege and responsibility it is to represent the people of West Bromwich constituency and I hope I can do you proud.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk/content_1.html": "top of page\nfor West Bromwich, Oldbury, Great Barr, Tividale & Rowley\nI'm proud to be your Labour MP for West Bromwich constituency.\nEach week our local Labour team is out listening to residents' concerns and is ready to build a positive future for families and communities in West Bromwich, Oldbury, Great Barr, Tividale & Rowley.\nPlease do have a look at what I've been up to recently below.\nDon't hesitate to get in touch — I'd love to hear from you.\nNews\nPromoted by Laura Rollins on behalf of Sarah Coombes both at Unit 130059, PO Box 15113, Birmingham, B2 2NJ\nbottom of page",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_protecting-our-canals/content_10.html": "Protecting our CanalsSarah CoombesSep 12, 20241 min readUpdated: Oct 21, 2024Our canals are an important asset here in the Black Country. Yesterday I asked the Secretary of State what the Government is doing to protect our canals and waterways.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_forge-mill-farm/content_16.html": "Forge Mill Farm\n- Sarah Coombes\n- Aug 21, 2024\n- 1 min read\nIt was fantastic to visit Forge Mill Farm at Sandwell Valley Country Park and see the new natural play barn as well as all of the summer holiday activities. We’re so lucky to have such an amazing place on our doorsteps.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_home/content_23.html": "See what I've been up to in West Bromwich recently\nBy submitting this form you consent to being contacted about Sarah Coombes for West Bromwich. You can opt out at any time by emailing sarah@sarahcoombes.co.uk. Privacy policy available here.\nThanks for submitting.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_ryders-green-visit-parliament/content_14.html": "Ryders Green Visit Parliament\n- Sarah Coombes\n- Sep 11, 2024\n- 1 min read\nIt was a real pleasure to welcome the newly elected school council from Ryders Green Primary School to Parliament. They were full of energy and questions for their MP! Schools can book visits to Parliament here.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_great-barr-foodbank/content_25.html": "Great Barr Foodbank\n- Sarah Coombes\n- Sep 5, 2024\n- 1 min read\nWhile people are still struggling with the cost of living, food banks are a lifeline for many. It was great to meet the volunteers at Great Barr Foodbank today and see the tremendous work they do supporting the community.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_office-standards/content_15.html": "Office Standards\nI am proud to represent over 70,000 people from the West Bromwich constituency. My casework service is supported by three members of staff. We’re a small team of dedicated staff who work hard to support as many people as possible, as quickly as possible.\nThere are occasions when people may act out of character in times of trouble or distress. There may have been upsetting or distressing circumstances leading up to a constituent approaching my office.\nHowever, I will not tolerate unacceptable behaviour nor actions that result in unacceptable or excessive demands on my staff in a way that it prevents them from carrying out their duties effectively.\nIt is these behaviours and actions that I aim to manage under this Policy.\nAggressive or abusive behaviour\nI understand that many constituents are often upset and angry about the issues they have raised with me. If that anger escalates into aggression towards my team, I consider that unacceptable. Any violence or abuse towards my team will not be tolerated.\nViolence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language (whether verbal or written) that may cause staff to feel offended, afraid, threatened or abused.\nI will judge each situation individually and appreciate individuals who come to my office may be upset. While I accept that those who contact me may feel angry, it is not acceptable to shout or swear at anyone in my office.\nUnacceptable language is that which:\n-\nis offensive, derogatory or patronising,\n-\nis discriminatory in any way, including racist, sexist, homophobic or transphobic comments; or\n-\nmakes serious allegations that individuals have committed criminal, corrupt or perverse conduct without any evidence.\nI may decide that comments aimed not at my team but at third parties are unacceptable because of the effect that listening or reading them may have on my team.\nExamples include rudeness, offensive comments, derogatory remarks, making inflammatory statements, or raising unsubstantiated allegations made towards these third parties.\nAll threats against either myself or my team will be taken extremely seriously and if my team feel scared or threatened at any point during a conversation with a constituent, the interaction may be ended at any time and the Police may be contacted.\nUnreasonable demands\nA demand becomes unacceptable when it starts to (or when complying with the demand would) impact substantially on the work my staff carry out on my behalf.\nExamples of this behaviour include:\n-\nrepeatedly demanding response within an unreasonable timescale,\n-\ninsisting on seeing or speaking to a particular member of staff, when that is not possible,\n-\nrepeatedly changing the substance of a complaint or raising unrelated concerns.\nAn example of such impact would be that the demand takes up an excessive amount of time and in doing so disadvantages other constituents and prevents their own complaint from being dealt with quickly.\nUnreasonable levels of contact\nSometimes the volume, frequency and duration of contact made to my office by an individual causes problems. This can occur over a short period, for example, a number of calls in one day or hour, or frequent and persistent emails on a vast range of issues which take up a disproportionate amount of staff time.\nIt may occur over the life-span of a complaint when a constituent repeatedly makes long telephone calls to us or inundates us with copies of information that has been sent already or that is irrelevant to the complaint.\nI consider that the level of contact has become unacceptable when the amount of time spent talking to a constituent on the telephone, or responding to, reviewing and filing emails or written correspondence impacts on my office's ability to deal with that complaint, or with other constituents’ complaints.\nHarassment\nMy team has the right to carry out their duties free from harassment or threats of harassment. I ask everyone to respect that my team are delivering a service on my behalf and therefore this may not reflect their own views or preferences.\nExamples of behaviours I consider to be harassment against my office include:\n-\nrecording telephone discussions and publishing the information online such as through YouTube, Vimeo or Twitter;\n-\ncontacting staff using their personal details or social media presence such as Facebook, Twitter or LinkedIn;\n-\npublishing personal, sensitive or private information about staff online or other public domains such as noticeboards or newsletters.\nUnacceptable or excessive demands\nA demand becomes unacceptable when it starts to (or when complying with the demand would) impact substantially on the work of my office.\nExamples of this behaviour include:\n-\nrepeatedly demanding a response within a unreasonable timescale,\n-\ninsisting on, or refusing to, speak to a particular member of staff, when that is not possible,\n-\nrepeatedly changing the substance of a complaint or raising unrelated concerns, including “spamming” my office with emails on a vast range of issues.\n-\nMaking repeated and unnecessary contact during the course of us dealing with a complaint or carrying out an investigation,\n-\nRefusing to accept a decision where explanations for the decision have been provided.\nAn example of such impact would be that the demand takes up an excessive amount of staff time and in doing so disadvantages other constituents and prevents their own complaint from being dealt with quickly.\nRefusal to co-operate.\nWhen looking at a complaint, my office will need to ask the individual who has contacted us to work with us. This can include agreeing with us:\n-\nthe complaint we will look at,\n-\nto provide us with further information, evidence or comments on request, or\n-\nhelp us by summarising their concerns.\nSometimes, an individual repeatedly refuses to co-operate or fails to respond to our requests and this makes it difficult for us to proceed. My office will always seek to assist someone if they have a specific, genuine difficulty complying with a request.\nHowever, it is unacceptable to bring a complaint to my office and then not respond to clear and appropriate requests by my team.\nReasonable adjustments\nI understand that some constituents may find it difficult to express themselves or communicate clearly, especially when they are anxious or upset. In order to do this, we ask that they explain what adjustments they’re looking for and how this will ensure they can access the service my office offers.\nMy office will always consider making reasonable adjustments for a constituent asked to do so. Examples of adjustments we can consider are:\n-\nwe could consider using different methods of communication;\n-\nproviding written communication in large print, coloured text, or in translation;\n-\ngiving clear warnings if conversations become unproductive and allowing constituents to opportunity to modify their behaviour before ending a call.\nHowever, I do not expect my staff to accept being subjected to aggressive, offensive, threatening or abusive actions, language or behaviour.\nI may still use the policy if there are actions or behaviours which are having a negative effect on our staff or our work even where a reasonable adjustment has been made.\nActions I may take:\nWhen my office experiences behaviour or demands which are unacceptable, I may consider taking more formal action. The actions I will consider may include the following:\n-\nWarning the constituent about their behaviour and requesting that the constituent modifies their behaviour in future contact with us.\n-\nReporting an individual to the Police.\n-\nAppointing a specific point of contact for the constituent\n-\nCommunicating only in writing or via a representative\n-\nDeciding not to investigate a complaint on the basis that it has been pursued in a way that is unacceptable.\n-\nStop all communication with a constituent\n-\nRestricting or limiting contact\n-\nYour telephone number and email may be automatically blocked from our systems.\nWhere it is decided that formal action must be taken a note may be placed on our records to this effect.",
  "https_www_sarahcoombes_co_uk_/https_www_sarahcoombes_co_uk_post_raising-road-safety/content_7.html": "Raising Road Safety\n- Sarah Coombes\n- Sep 19, 2024\n- 1 min read\nYesterday I met with the Cabinet Member and officers at Sandwell Council to discuss concerns around road safety and how we can make our roads safer in the borough.\nWe discussed the A457, the junction of Monksfield Ave with Newton Road, and street racing at Kenrick Way, as well as more general road safety matters."
}