{
  "https_nigelgardner_uk_/https_nigelgardner_uk_2025_03_07_the-council-is-in-a-financial-hole-but-still-found-100k-for-a-golf-hole/content_20.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_05_10_tory-candidate-says-labours-vat-plans-could-hurt-towns-economy/content_12.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_01_30_gardner-tells-minister-we-dont-want-giant-luton-airport-plan/content_30.html": "As campaigners continue to oppose the planned expansion of Luton Airport, the local man who hopes to be the new MP here has written to the Minister of Aviation calling on the Government to halt plans to almost double the size of Luton airport.\nThe plans would see Luton Airport almost double in size from 18 million passengers a year to a whopping 32 million – the same size as Gatwick.\n‘The people of Harpenden and our beautiful villages don’t want the equivalent of Gatwick Airport on their door-steps. We have to come together as a community and stop this,’ Nigel Gardner told local residents.\nAviation will be the single largest producer of carbon emissions by 2050, forecasts show. ‘How can we be serious about net zero if we double the size of Luton airport’ added Gardner, who grew up locally.\n‘Luton is simply the wrong location for another giant airport.’\n‘This expansion needs to be put on ice until we have a proper strategy for the reduction of aviation emissions’, Mr Gardner wrote.\n‘I remember growing up in Flamstead and my parents complaining about the noise from the planes. That was long before Ryanair, Easyjet, TUI and Wizz Air. Now it’s far, far, worse.’\nHarpenden Councillor Teresa Heritage said, ‘Luton airport already has a bad record enforcing planning conditions, with cargo flights and private jets taking off at all hours. The growth plans will make this so much worse for local residents.’\nCampaigners are also worried by the increase in road traffic congestion. ‘Be it the M1 or the Lower Luton Road we just don’t have the capacity for more traffic’ added Gardner.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2025_03_26_nigel-gardner-unless-conservatives-can-focus-on-young-people-the-next-election-is-already-lost/content_25.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2025_03_26_harpenden-left-a-ghost-town-in-the-wake-of-on-street-parking-charges/content_22.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2025_04_08_london-luton-airport-expansion-approval-what-does-it-mean-for-district/content_2.html": "Conservative Parliamentary candidate for Harpenden, Nigel Gardner, was also unhappy with the decision: “The consequences of the Government’s decision will be felt on our doorsteps and in our playgrounds and back gardens for decades to come.\n“I grew up under a Luton flightpath, with my parents complaining about the noise. In those days there was a fraction of the air traffic. I simply dread to think of all the extra noise, pollution, and added traffic on the Lower Luton Road and our other local thoroughfares.”\n“This is a slap in the face for all the local people who have spoken up against this senseless plan – and a sad, sad day for anyone who cares about the climate.”",
  "https_nigelgardner_uk_/https_nigelgardner_uk_privacy-policy/content_3.html": "Last updated: March 26, 2024\nThis Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.\nWe use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy. This Privacy Policy has been created with the help of the Free Privacy Policy Generator.\nThe words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.\nFor the purposes of this Privacy Policy:\nAccount means a unique account created for You to access our Service or parts of our Service.\nAffiliate means an entity that controls, is controlled by or is under common control with a party, where \"control\" means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.\nCompany (referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Nigel Gardner.\nCookies are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.\nCountry refers to: United Kingdom\nDevice means any device that can access the Service such as a computer, a cellphone or a digital tablet.\nPersonal Data is any information that relates to an identified or identifiable individual.\nService refers to the Website.\nService Provider means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.\nUsage Data refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).\nWebsite refers to Nigel Gardner, accessible from https://nigelgardner.uk\nYou means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.\nWhile using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:\nEmail address\nFirst name and last name\nPhone number\nUsage Data\nUsage Data is collected automatically when using the Service.\nUsage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.\nWhen You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.\nWe may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.\nWe use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include:\nCookies can be \"Persistent\" or \"Session\" Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies on the Free Privacy Policy website article.\nWe use both Session and Persistent Cookies for the purposes set out below:\nNecessary / Essential Cookies\nType: Session Cookies\nAdministered by: Us\nPurpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.\nCookies Policy / Notice Acceptance Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies identify if users have accepted the use of cookies on the Website.\nFunctionality Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.\nFor more information about the cookies we use and your choices regarding cookies, please visit our Cookies Policy or the Cookies section of our Privacy Policy.\nThe Company may use Personal Data for the following purposes:\nTo provide and maintain our Service, including to monitor the usage of our Service.\nTo manage Your Account: to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.\nFor the performance of a contract: the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.\nTo contact You: To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.\nTo provide You with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.\nTo manage Your requests: To attend and manage Your requests to Us.\nFor business transfers: We may use Your information to evaluate or conduct a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of Our assets, whether as a going concern or as part of bankruptcy, liquidation, or similar proceeding, in which Personal Data held by Us about our Service users is among the assets transferred.\nFor other purposes: We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.\nWe may share Your personal information in the following situations:\nThe Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.\nThe Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.\nYour information, including Personal Data, is processed at the Company's operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.\nYour consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.\nThe Company will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.\nYou have the right to delete or request that We assist in deleting the Personal Data that We have collected about You.\nOur Service may give You the ability to delete certain information about You from within the Service.\nYou may update, amend, or delete Your information at any time by signing in to Your Account, if you have one, and visiting the account settings section that allows you to manage Your personal information. You may also contact Us to request access to, correct, or delete any personal information that You have provided to Us.\nPlease note, however, that We may need to retain certain information when we have a legal obligation or lawful basis to do so.\nIf the Company is involved in a merger, acquisition or asset sale, Your Personal Data may be transferred. We will provide notice before Your Personal Data is transferred and becomes subject to a different Privacy Policy.\nUnder certain circumstances, the Company may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).\nThe Company may disclose Your Personal Data in the good faith belief that such action is necessary to:\nThe security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.\nOur Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.\nIf We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.\nOur Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.\nWe have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.\nWe may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.\nWe will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.\nYou are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.\nIf you have any questions about this Privacy Policy, You can contact us:",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_07_02_harpo-berko-times-defence-secretary-and-former-south-west-herts-mp-back-tory-candidate/content_14.html": "As we enter the final stages of the General Election campaign, Harpenden and Berkhamsted Conservative candidate Nigel Gardner has received two new endorsements.\nThe first is from Welwyn Hatfield MP and defence secretary Grant Shapps, who said: “I know first-hand that Nigel will be a true local champion…\n“In a more volatile and dangerous world, Nigel understands how seriously you take our country’s security, and that’s why he backs our pledge to spend 2.5% of GDP on defence, amounting to billions of pounds in extra funding for our armed forces…”\nDavid Gauke, who was Conservative MP for South West Herts from 2005-2019, and then as an independent MP until the end of that Parliament, has also pledged his support.\nAt the time his constituency included Berkhamsted, Tring and the surrounding villages.\nHe said: “If I lived in Harpenden and Berkhamsted, I have to say I’d be voting for Nigel Gardner.. Now I understand there are a lot of people who are disenchanted with the Conservative Party because I’m one of them.\n“But in Harpenden and Berkhamsted you have got a candidate who will provide moderate, sensible, common sense Conservative values; will stand up to the extremes who want to take over the Conservative Party; and if there’s a Labour government, he’ll hold them to account in an effective way.”\nMeanwhile, Lib Dem candidate Victoria Collins’ campaign has received a fresh boost from comedian and actor Steve Coogan, five years after he gave his endorsement to St Albans’ Daisy Cooper ahead of her election as MP.\nSo can lightning strike twice and he secure victory for the Lib Dems in Harpenden and Berkhamsted?\n“I hope so. I just want to get the Tories out and the Lib Dem candidates generally have values that I adhere to but the principal message is to vote tactically.\n“You know my loyalty shifts, I’ve got certain issues with Labour at the moment but generally I support them, but the most important thing is to get the Tories out in a decisive way and that means voting tactically, so in certain constituencies voting Lib Dem, and in others voting Labour. So that’s what I’m advising people to do.”\nA recent poll on the General Election published by The Economist, predicts a slight Lib Dem victory in Harpenden and Berkhamsted with 30 per cent of the vote, Conservatives just below at 28 per cent, and Labour third at 20 per cent. But UK Polling Report puts the Conservatives in the lead with 26.8%, Labour second on 24.14%, and Lib Dems third on 22.5%, but admits the result is too close to call.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_03_19_call-for-aonb-the-way-forward/content_17.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_01_29_we-must-stop-marshcroft-development-says-gardner/content_6.html": "Plans for 1,400 more HOUSES, 3,400 more PEOPLE and 2,000 more CARS on Tring’s green belt must be stopped says Conservative Parliamentary Candidate for Harpenden & Berkhamsted, Nigel Gardner.\n“Marshcroft would change the nature of Tring”, Gardner told local residents. “If it goes ahead, we will damage the social fabric of our town, cause irreversible harm to our green belt, and put an unacceptable strain on local services.”\nThe Marshcroft development would see 1,400 new homes built on 300 acres of green belt countryside on the eastern side of Tring. “It is our duty to protect Tring’s beautiful countryside for future generations”, Gardner said.\n“Increasing Tring’s population by 30% will add huge pressure on our infrastructure and local public services”.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_press/content_10.html": "\"The consequences of the Government’s decision will be felt on our doorsteps and in our playgrounds and back gardens for decades to come. I grew up under a Luton flightpath, with my parents complaining about the noise. In those days there was a fraction of the air traffic. I simply dread to think of all the extra noise, pollution, and added traffic on the Lower Luton Road and our other local thoroughfares.\"",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_01_27_berkhamsted-news-tory-candidate-shares-election-hopes/content_11.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_05_29_deputy-prime-minister-%e2%81%a6oliver-dowden%e2%81%a9-visits-wheathampstead/content_8.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_news/content_4.html": "Thank you David for joining us in this wonderful new constituency of Harpenden, Berkhamsted, Tring and our amazing villages - including Flamstead where I grew up.\nThank you David for joining us in this wonderful new constituency of Harpenden, Berkhamsted, Tring and our amazing villages - including Flamstead where I grew up.\nWe need to keep our free parking bays, and save those precious, pensioner parking permits in Harpenden.\nGrant Shapps Defence Secretary backs Nigel Gardner as the man that will put Britain’s defenses first\nDavid Gauke asks his supporters in Berkhamsted, Tring and the amazing villages he used to represent to vote for Nigel Gardner on July 4th.\nBuying cakes this afternoon with the Home Secretary James Cleverly in Harpenden for his wonderful protection officers - the hidden heroes behind this election.\nGardner and Dowden joined local team Wheathampstead Wanderers for a kick-about on the all-weather pitch. Oliver followed in the footsteps of party chairman Richard Holden to become the second big-name Tory MP to lend his support to Nigel’s campaign.\nGreat reception for Rishi Suank this afternoon from the voters of Berkhamsted\nWe are raring to go in Harpenden, Berkhamsted, Tring and our amazing villages\nLocal Council leaders have decided to axe Senior Citizens' parking permits for the vast majority of Harpenden’s pensioners. Only those receiving benefits will keep the much valued permits. Nigel Gardner - the former businessman whose family go back generations in Harpenden - is urging the local Council to change its mind.\nAs campaigners continue to oppose the expansion of Luton Airport, the local man who hopes to be our new MP has written to the Minister of Aviation calling on the Government to halt the plans.\nPlans for 1,400 more HOUSES, 3,400 more PEOPLE and 2,000 more CARS on Tring's green belt must be stopped says Conservative Parliamentary Candidate for Tring, Nigel Gardner.\nLocal school leaders believe up to a third of parents will withdraw their children from private schools if VAT is added to school fees. And fears are growing that this exodus will overwhelm top local state schools.\nWhatever our individual politics, we all value our wonderful green spaces. That's why Nigel Gardner's call for Area Of Outstanding Natural Beauty (AONB) status for the countryside around Harpenden is so welcome.\nLib Dem run Dacorum Council is planning to drastically increase parking charges in Tring town centre. \"I'm calling on the Lib Dem council to rethink these draconian increases - and I'm happy to work with them to come up with better proposals,' said Nigel Gardner\nLib Dem run St Albans District Council is planning to build thousands of new houses on the green belt around Harpenden. \"We need cross-party support to protect our green belt\", said Nigel Gardner.\nLib Dem run St Albans District Council is planning to drastically increase parking charges across Harpenden town centre. \"These charges will hit our High Street like a bombshell\", said former businessman, Nigel Gardner.\nCome the general election Harpenden, Berkhamsted and Tring will form a new Parliamentary seat running across a whole swathe of Hertfordshire.\nMy family and I live in the new Hitchin seat, so I have made the decision to contest that seat at the election - and on Saturday I was delighted that Nigel Gardner has been selected as the Conservative candidate for the new Harpenden & Berkhamsted seat.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_07_02_harpo-berko-times-friends-reunited-david-cameron-catches-up-with-uni-pal-nigel-gardner-in-harpenden/content_31.html": "Unusually for a Friday afternoon, there is a big buzz of people gathered in The Oddfellows Arms in Harpenden’s Leyton Green, while outside a large security detail of men in suits and earpieces wait near their black Jeeps and monitor the situation.\nIt was upstairs at the pub that Conservative prospective Parliamentary candidate Nigel Gardner’s grandmother and her five sisters were born, so he said it seemed right that he should take his old university friend there for a pint when he was town.\nNigel and our current Foreign Secretary – and now Lord – David Cameron first met more than 30 years ago at Oxford University.\nIt followed what might be seen as an inauspicious first meeting. Nigel arrived at the prestigious hall of learning after catching a National Express coach from Luton.\n“When I arrived I sat next to this young chap with bushy hair and said to him, ‘Where are you from?’ He said ‘Luton’, I heard Luton. I said I had just come on the National Express and I didn’t see him on the coach. ‘Did your parents bring you?’ He looked at me, and this time he said it very clearly, ‘Not Luton, Eton’. And that was David Cameron.”\nFlash-forwards three decades, and Nigel is campaigning to win the new constituency of Harpenden and Berkhamsted for the Conservatives, while former Prime Minister and Tory party leader David has recently returned to government as Foreign Secretary.\nOutside the pub there is quite the assembly. Apart from local Tory campaigners there are some Oxford students who have been following in David’s stead. There is a lot of blue. It’s all very Harpenden and you’d really never know right now that I was born in Salford.\nAll of a sudden David walks in. He gives a quick talk about how brilliant Nigel will be if he is elected as MP, all reassuring charm, calm voice, pragmatic clothing and jovial demeanour. I hear myself give a little whoop amid the clapping. Am I now a Tory?\nDavid pulls a pint of Rebellion behind the bar – classic has-to-be-done part of any politician visits pub shenanigans. He tells a story about how when he met Chinese president Xi Jinping at The Plough in Cadsden, next to Chequers, the Chinese secret police said there was no way Xi was drinking a pint of Rebellion Beer, so they opted for a Greene King IPA instead.\nWe walk through the High Street, the sun is shining and a man stops to ask for a selfie with David outside Serena Hart. A foreign Big Issue vendor wishes us a good afternoon and another pub landlord invites him in for a pint which is politely declined with a “We may pop in on the way back!” Very diplomatic, but that sort of goes with the job.\nNigel and David visit Serena Hart where David compliments owner Mary Durkin on her dress, adding that his wife is a dressmaker. Hers is from M&S it turns out. They have a bit of a chat about parking issues and the worry there is locally about free parking being taken away by St Albans district council.\nThere’s a similar conversation at clothing boutique Oui a few doors, but I missed much of it when I was frogmarched outside by one of his team and quizzed on my motives for being there.\nI told them I was a local journalist writing a colour piece on the visit, adding that “although I am NOT a Tory” they don’t need to be concerned. I’m still not sure what exactly they were worried I was going to report. Just justifying their jobs while they still have them, perhaps. Ooh scathing – oops I broke my promise!\nI manage to have a proper – albeit short – chat with David in the offices of local housebuilders Jarvis. I ask him what Nigel was like back in their university days.\n“He was very bright. He was quite bouncy. I remember that I was there for my interview and I think Nigel was the first person who came up and said hello. And we haven’t really looked back since then.\n“He’s always been very outgoing, very intelligent, very hard-working. And these are all good qualities that you need as a Member of Parliament.”\nIt’s refreshing to hear a politician say something positive about another politician – you can’t always guarantee that will be the case, even when they’re from the same party!\nI ask him why he thinks it is important to support small businesses and high streets like ours: “The high streets are such important parts of our community and they’re only going to survive if we help them. They’re under enormous pressure because of everyone shopping on Amazon and buying online and all the rest of it. And so we have to think what can we do to help have a varied, interesting high street.\n“We can help by keeping free parking, we can help by making sure the planning authorities are creative and make sure they bring interesting people in, we can make sure have a bit of a decluttering of some of our roads and signs, which good local councils do.”\nThis is a big passion of Nigel’s campaign, to protect the high street, keep it local and keep parking accessible to all, and he’s obviously pleased to receive the thumbs-up from David.\nSo what is David personally most proud of the Conservatives achieving during the past 14 years in government?\n“Well I think the biggest thing we had to do was to get the economy back on track and actually there have been 800 jobs created for every day that this government has been in office,” he says, echoing comments he first made back in 2015.\n“So I know we’ve got lots of difficult things we have to do with the economy, but fundamentally today… four per cent unemployment, over two per cent annualised growth and two per cent inflation. That is a world away from the inheritance I got in 2010 when we were in real trouble. So that was the biggest thing.”\nWhat has not gone well for the Tories, I ask him… conscious of the time.\n“We’ve had the twin glaciers of Covid hitting the economy and the Ukraine war pushing up inflation. So the last two years we’ve had to spend time getting back into a strong position and that’s been painful and difficult.”\nHe is not wrong there is he? Painful and difficult is one way of putting it and the thing about a global pandemic is that it wasn’t in anybody’s manifesto was it? No mention of Liz Truss’ economic implosion mind.\nHow does he think he is going to be feeling when he wakes up next Friday morning?\n“Look I don’t… I never know if these polls are right or wrong. They told me I was going to lose in 2015 and I won. This time we’re told that we’re going to do really badly but who knows?\n“The only thing I do know is if you vote for Nigel Gardner here in Harpenden and Berkhamsted you’ll get a hard-working Conservative MP standing up for high streets and small towns and villages and rural areas in Parliament and if the polls are right it’ll be even more important to do so.”\nHe says that he has found the reception in Harpenden “pretty good, actually”, adding that if the whole country was like one particular hairdressers he’d just been into, the General Election would be a Tory landslide: “Brilliant…very friendly people!”\nUnlike some of his peers, he says he has never placed a bet on himself to win or lose an election, but adds: “In 2005 when I stood for leadership of the Conservative Party there was someone who ran our party up in the north-east and he got odds on me at 66:1. Every time I went up to the north-east, which is sometimes quite a tricky area for Conservatives, as I got off the train he used to give me an enormous bear hug.”\nThe man won enough to take his whole family on a world cruise, he jokes. Nigel laughs. Genuinely. They’re definitely good pals.\nHe clarifies his views on the gambling scandal: “Obviously what’s happened is very, very wrong, and it’s right that there’s an independent investigation and also one by the Gambling Commission. If people have used inside information, that is completely wrong.”\nHow would he convince me to vote for Nigel then? “You should vote Blue because you’re getting a hard-working Conservative MP. He’s built businesses. You’ve got a hard-working Conservative MP who was born here, brought up here, and knows the area like the back of his hand.”\nI mention that our childhood dog was called Maggie, and he laughs: “That’s a good start!”\nMy session with the Foreign Secretary draws to a close, with just enough time for some photos taken by local snapper Penny Bird, before David heads off with his team back to running the country.\nSo what did Nigel make of the experience? I caught up with him later to find out: “It was quite a surreal afternoon, taking the Foreign Secretary and former PM to pull a pint behind the bar in the pub where my granny was born upstairs!\n“I saw on the High Street he has the same charm and ease with people I remember from 30 years ago – he was literally the first person I talked to at Oxford. Life moves in strange circles.”\nWhether David Cameron is still Foreign Secretary come Friday remains to be seen, but none of that takes away from the rather fun experience of meeting him in Harpenden last week. Will I be voting Tory now? Well dear reader, that’s between me and my ballot paper!",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_01_26_st-albans-times-parking-shake-up-could-bring-an-end-to-free-spaces-across-district/content_29.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_05_31_buying-cakes-this-afternoon-with-the-home-secretary-%e2%81%a6james-cleverly/content_5.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_01_26_labours-tax-is-threat-to-schools/content_9.html": "Local school leaders believe up to a third of parents will withdraw their children from private schools if VAT is added to school fees. And fears are growing that this exodus will overwhelm top local state schools.\nLabour has announced that it plans to immediately slap VAT on school fees if elected at the General Election which must happen before January 2025.\n“Local school leaders have told me they fear Labour’s VAT hike will force up to a third of parents to withdraw their children from local independent schools, said Nigel Gardner, who was educated at Aldwickbury and then St Albans School.\n“This is an ideological policy that will punish local parents who sacrifice so much to pay for their children’s education, and increase pressure on our over-subscribed top local state schools.”\nIndependent education is believed to be the single biggest private sector employer in the new Harpenden and Berkhamsted constituency. Concerns are also growing about the knock-on effects such an exodus will have on our local economy.\nWith over 600 people employed in Berkhamsted alone by private schools, the knock-on economic effects on our town will be disastrous.\n“This Labour tax raid will hit swathes of local families – whether their children are at state or private schools – and damage our local economy.”",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2025_04_04_st-albans-council-faces-legal-proceedings-by-harpenden-town-council-over-parking-charges/content_26.html": "St Albans district council has been served legal papers by Harpenden Town Council relating to the controversial on-street parking charges.\nSADC strategic director for community and place delivery Chris Traill has confirmed the receipt of the papers: “We have received a pre-action protocol letter from Harpenden Town Council on the new parking restrictions and have responded to it. We cannot make any further comment on such legal proceedings.”\nA pre-action protocol outlines the conduct and steps parties are expected to take before commencing legal proceedings for specific types of civil claims, aiming to encourage early information exchange, settlement, and efficient case management without the need for legal proceedings.\nRetailers and residents alike have opposed the measures – which were revealed by the St Albans Times last year – with an e-petition opposing the scheme signed by 1,774 people, and a further 1,264 and 6,022 signing paper and Change.org versions.\nHarpenden Town Clerk Carl Cheevers previously warned that should SADC go ahead with the parking proposals, given the volume and focus of the public consultation, he believed it would be acting in potential breach of the Road Traffic Act and consultation process guidelines such as the Gunning Principles, which could lead HTC to go as far as to consider a Judicial Review.\nMr Cheevers told town councillors in November: “In this scenario, HTC may wish to instruct professional legal advice to get a view as to whether the decision has been taken through a flawed process. HTC could instruct an initial view which it would need to formally consider.\n“If this view suggested that there have been issues with the process, then HTC could consider instigating further action in the form of a Judicial Review. This is a complicated and costly action to take, however it is a route open to HTC.”\nThe Gunning Principles are a set of four key rules established by the UK courts to ensure fairness in public consultations.\nOf particular relevance to this particular process are:\n* Consultation must take place when the proposal is still at a formative stage: The decision-makers must not have already made up their minds. Consultation should happen early enough in the decision-making process so that the opinions and feedback received can genuinely influence the outcome.\nAnd:\n* The product of consultation must be conscientiously taken into account: The responses received during the consultation must be given genuine consideration before any final decisions are made. Decision-makers must show they have engaged with and reflected on the feedback, even if they do not adopt all suggestions.\nCouncil leader Cllr Paul de Kort was also unable to discuss the latest developments, and could only say: “Due to the council receiving a pre-action protocol from Harpenden Town Council, I am unable to comment.”\nHarpenden Town Clerk Carl Cheevers issued a brief statement this evening: “Harpenden Town Council has previously set out its strong objection to the introduction of on-street parking charges across Harpenden Town Centre and continues to hold significant concerns regarding the impact that this will have on local businesses.\n“The town council issued a pre-action protocol letter in February to SADC setting out that it is considering instigating court proceedings in the form of a Judicial Review.\n“We are currently in a ‘pre-election period’ ahead of the town council by-elections on 1 May 2025. During pre-election periods, we follow statutory guidance on communications and publicity which means that we won’t be commenting on this matter any further at this stage.\n“We expect to publish a detailed statement shortly after the by-elections.”\nFormer Conservative candidate for Harpenden, Nigel Gardner, put the parking charges at the heart of his campaign: “Hats off to our Harpenden Town Councillors.\n“It’s a sad day when Harpenden has to launch legal proceedings against St Albans council and their officials. But there was simply no other way to defend our High Street traders and local community.”\n“I implore St Albans council to listen, come to the table, and to compromise. If they really care about council taxpayers’ money it is the only course open to them.\n“So much of this sorry saga reminds me of the ill-fated attempt by St Albans council to impose a one-way system in the late ’80s. It brought our roads and local economy to a standstill. That time councillors showed courage, accepted they had got it wrong, and did a u-turn.\n“Today, the people of Harpenden and council taxpayers across the district deserve another u-turn from St Albans council officials.”",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_04_09_another-week-another-poll-but-do-they-actually-mean-anything/content_28.html": "While the country waits for Rishi Sunak to stop laughing and finally set a date for this year’s General Election, pollsters are having a field day predicting the results.\nUnder the Dissolution and Calling of Parliament Act 2022, the power to call a General Election was restored to the Prime Minister after a period when it was at the behest of the House of Commons, but the latest a Parliament can be dissolved has to be on the fifth anniversary of the day it first met.\nThat means the PM actually has until December 17 to name the date, with 25 working days allowed to prepare, meaning the next General Election must be held by January 28 2025.\nAsked recently when the UK would be going to the polls by a BBC local radio presenter, Mr Sunak laughed off her questions, prompting the interviewer to ask: “Why is that funny?”\nThere have been several major polls attempting to cast a fortune-teller’s gaze over the eventual day when we put our crosses on the ballot papers, with the result of the newly formed Harpenden and Berkhamsted constituency being particular volatile.\nIn January, a survey commissioned by the Conservative Britain Alliance from YouGov MRP predicted the Liberal Democrats romping to victory with 38 per cent of the vote, and the Conservatives trailing behind on 30 per cent.\nBut a more recent poll of 15,000 people by agency Survation on behalf of the Best for Britain campaign group said Labour was on track to win the seat with 37 per cent, the Tories on 35 per cent, and the Lib Dems only on 15 per cent.\nThen no sooner had the results of the Survation survey been sampled, but YouGov was back with a detailed seat-by-seat analysis of potential results, this time giving Harpenden and Berkhamsted to the Conservatives with 34.9 per cent of the vote, compared to the Lib Dems on 24.8% and Labour on 22.1%.\nTory candidate Nigel Gardner responded: “The polls are coming in thick and fast, with two mega ones last week – each polling more than 15,000 people. The Survation poll saw Labour a few hundred votes ahead in Harpenden and Berkhamsted, whilst in the YouGov one I managed to come out on top.\n“Of course the only result that matters is how the good people of Harpenden and Berkhamsted and our amazing villages vote on polling day. And between now and then I am working as hard as hard as I can to show that I will be a hard-working, responsible, common sense, local MP – who will look after the interests of all our residents whatever their politics. And to show that a Starmer Government will be bad for our economy, and a disaster for our Green Belt.”\nSymon Vegro, chair of Harpenden and Berkhamsted Labour Party said: “Some polls will show us winning in the constituency, some polls will show us coming third, but the very fact that the Lib Dems are so relentless in their messaging that Labour cannot win shows how worried they are!\n“If you look at the overall picture Labour is still in a strong and improving position. Even this poll – which is not consistent with other polls in recent weeks – shows that the Lib Dems – at best – are level pegging with Labour in this constituency.\n“The choice at the General Election is between another five years of Conservative chaos or a decade of national renewal with Labour. The Lib Dems have no plan for government and no plan for Harpenden and Berkhamsted.\n“Voters in Harpenden and Berkhamsted should not buy into the Lib Dem myth that Labour is not interested in this seat.”\nVictoria Collins, Liberal Democrat Parliamentary candidate for Harpenden and Berkhamsted, also responded to the latest survey, echoing similar sentiments made by Nigel: “The only poll that matters is when voters go to the ballot box for the General Election. Across Harpenden and Berkhamsted, voters are already showing their support for the Liberal Democrats with incredible local election success. We now have 80 per cent of the councillors right across the seat from Tring, Berkhamsted and Harpenden to Redbourn, Wheathampstead and Jersey Farm.\n“The fact that local MPs, such as Bim Afolami, have run off to stand in other areas, reflects how the Conservatives know this is no longer a safe seat. The Liberal Democrats, on the other hand, are working hard for local people day-in day-out to give them an MP who actually stands up for them.”\nFor current Hitchin and Harpenden MP Bim Afolami, the future looks even more grim, with calls for the Tory grassroots to deselect him before any General Election. The publication Conservative Post has drawn up a list of 10 current Tory MPs who it feels are not “conservative” enough, with Mr Afolami at the very top.\nMr Afolami’s office was contacted for comment on this story but failed to respond.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_06_06_harpo-berko-times-prime-minister-rishi-sunak-visits-berkhamsted-tory-candidate-nigel-gardner/content_23.html": "Ahead of a heavily-publicised visit to Chesham, the Prime Minister took time out of his busy schedule to give his backing to Harpenden and Berkhamsted Conservative Parliamentary candidate Nigel Gardner.\nRishi Sunak made the most of the May bank holiday sunshine to take a stroll through the new constituency and meet with supporters in the High Street.\nNigel said: “It was wonderful to have the PM join me for that most British of bank holiday traditions – a visit to Woods garden centre – before we hit the High Street for cakes at Daisy and Co.\n“Walking down the High Street we met with lots of local residents keen for a selfie with Rishi – most of whom promised to vote Conservative in the forthcoming General Election!”",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_06_04_the-herts-ad-general-election-2024-james-cleverly-campaigns-in-harpenden/content_18.html": "Mr Cleverly joined James Spencer and Nigel Gardner, Conservative candidates for the St Albans and Harpenden and Berkhamsted constituencies respectively.\nThe pair toured the Home Secretary around the Harpenden area and visited local businesses.\nMr Gardner said: “It was wonderful to welcome the Home Secretary to Harpenden.\n“We took a stroll along the High Street and listened to both residents and business owners who are apoplectic about the councils ill thought out parking plans.\n“We need to save our pensioners parking permits and make parking on the High Street as simple as possible. Otherwise our town will pay the price.”\nMr Spencer is aiming to unseat Liberal Democrat deputy leader Daisy Cooper. Ms Cooper won the seat by 6,000 votes, gaining the seat from the Tories back in 2019.\nHe said: “The message the Home Secretary gave to residents and business owners was clear. The choice at the next election is either a government led by Rishi Sunak or one led by Sir Keir Starmer and Angela Rayner.\n“In both St Albans and Harpenden and Berkhamsted, a vote for any other party other than the Conservatives risks letting Labour in.”\nWhile polls suggest Labour are unlikely to win in St Albans, a Liberal Democrat win in a traditionally Conservative seat would still indirectly help Sir Keir’s bid to reach number 10.\nHarpenden and Berkhamsted is a new constituency, born out of the ashes of the old Hitchin and Harpenden seat following 2022’s boundary review.\nMr Gardner is seeking to become the first MP for the area, but polls suggest the Liberal Democrats to be on course to take the seat.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_05_31_st-albans-times-deputy-pm-shoots-for-nigel-gardner-in-visit-to-wheathampstead-pitch/content_16.html": "Deputy Prime Minister Oliver Dowden took time out from the dramas of Westminster to enjoy a kickabout in the sun with Parliamentary candidate Nigel Gardner.\nThe Hertsmere MP, who lives in the St Albans district, met with Harpenden and Berkhamsted Tory hopeful Nigel at the all-weather pitch used by the Wheathampstead Wanderers.\nFunded by the Premier League and The Facilities Fund, Sport England and the 948 Sports Foundation, the £200,000 pitch opened in 2014 following a fundraising campaign led by then-vice chair of the parish council Annie Brewster.\nOliver followed in the footsteps of party chairman Richard Holden to become the second big-name Tory MP to lend his support to Nigel’s campaign.\nBefore trying and failing to score against the Wanderers’ youth team goalie, the two politicians met for a coffee and a chat at the nearby Brewhouse together with St Albans candidate James Spencer.\nBack on the agenda was the issue of VAT on independent school fees, a Labour policy which Nigel says has proved surprisingly important to voters unhappy with the thought of funding the extra cost.\n“It’s inconsequential in the amount of money they’re going to raise, because they’re not actually going to raise any money, they’re probably going to lose money,” Nigel explained.\n“But it’s extremely consequential in what it does to people’s lives, and not just parents who struggle to send their kids to private education, also those parents who are trying to get their kids into top state schools, because it’s going to make the competition fiercer.”\nDespite the very real threat posed by Liberal Democrat candidate Victoria Collins in the constituency, Oliver repeats the Tory mantra that this General Election is a fight between the Conservatives and Labour.\nHe said: “There’s only two people who can walk through the door of number 10 Downing Street, Keir Starmer or Rishi Sunak, and I think people need to focus their minds on that.\n“I think in a seat like this, I think the evidence is clear actually that in the end people will probably have to choose between a Labour and a Conservative candidate.\n“Of course people have frustrations about what’s happened over the past five years, but this isn’t about the past five years, this is about the next five years.”\nAs a local resident, what does he feel are the top issues for the St Albans district?\n“Number one, the Green Belt. That is exactly what’s at risk in this election. If you look at Labour’s policy, they’ve got a cunning policy, which is they say, there’s all this Green Belt that people don’t actually like, so we’re going to designate it Grey Belt.\n“Well what do you think they’re going to do? They’re going to designate the Green Belt as Grey Belt and they’re going to build all over it. The thing that makes this area so great is we have the best of both worlds, we’ve got lovely countryside, easy access into London, but ultimately they don’t care about areas like this. This isn’t where the roots of the Labour Party lie.\n“Number two is the expansion of Luton Airport, and I know that in Nigel you’ll have a very strong candidate who’s actually going to fight against it.”\nAfter visiting the all-weather pitch, there was just enough time to check out the site of the new Wanderers club house off Butterfield Road, which should be finished in the autumn.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2025_02_03_st-albans-times-town-council-considers-options-after-parking-charges-approved/content_15.html": "2024 Tory Parliamentary candidate for Harpenden, Nigel Gardner, whose campaign was fought on opposing the charges, added: “I am furious. For the past year, Harpenden residents, Harpenden businesses and Harpenden lovers across the political spectrum have made it abundantly clear that they don’t want these parking charges.\n“They are bad for our local economy, bad for our most vulnerable residents, and bad for our local community.\n“These charges are being pushed through by Chris Traill, the council’s director of strategy, who lives in Leicester and has never knowingly tried to park in Harpenden. I fear they are ideologically driven as part of a war on local motorists.\n“TS Eliot wrote April was the cruellest month. For Harpenden’s high street traders, Ms Traill has ensured this year the cruellest month will be February.\n“I now hope that the town council – which has admirably put Harpenden’s interests above those of party – will move ahead with a Judicial Review to stop Ms Traill’s plans in their tracks.”",
  "https_nigelgardner_uk_/https_nigelgardner_uk_contact/content_19.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_07_02_mix-92-6-radio-interview-harpenden-and-berkhamsted-candidate-nigel-gardner-conservative/content_24.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_nigel-working-for-you/content_32.html": "I love this place – it’s deep in my DNA. My family go back many generations here. My grandmother was born upstairs in Harpenden’s Oddfellows Arms, one of six sisters all born upstairs in the pub. I was brought up in Flamstead – right in the heart of our new constituency and went to school in Harpenden. That’s why I’m standing here and working for you. In the last month I have been campaigning to:\nStop the plan to double the size of Luton airport. I took our amazing local campaigners to meet with the Minister for Aviation and Transport Decarbonisation to make it crystal clear that the plan to double the size of Luton airport is bad for our local environment, means more noise, and more traffic especially on the Lower Luton Road and the M1. Crucially it makes net zero even harder to achieve. We really don’t want the equivalent of Gatwick airport on our doorsteps.\nI love this place – it’s deep in my DNA. My family go back many generations here. My grandmother was born upstairs in Harpenden’s Oddfellows Arms, one of six sisters all born upstairs in the pub. I was brought up in Flamstead – right in the heart of our new constituency and went to school in Harpenden. That’s why I’m standing here and working for you. In the last month I have been campaigning to:\nStop the plan to double the size of Luton airport. I took our amazing local campaigners to meet with the Minister for Aviation and Transport Decarbonisation to make it crystal clear that the plan to double the size of Luton airport is bad for our local environment, means more noise, and more traffic especially on the Lower Luton Road and the M1. Crucially it makes net zero even harder to achieve. We really don’t want the equivalent of Gatwick airport on our doorsteps.\nSupport our High Streets. I’ve called out Council plans to axe pensioner parking permits in Harpenden, axe Redbourn’s free car park, and axe our free on-street parking in Tring and Harpenden. I believe we need to support and nurture our High Streets and make it as easy as possible for people to visit. Council plans do the opposite and I’ve called on our Lib Dem colleagues across the constituency to rethink these changes, and offered to work with them to come up with better proposals.\nOppose Starmer’s plan to slap VAT on independent school fees. I’ve met with school leaders from local private and state schools. They are worried that this ideological policy will hit not only local parents who sacrifice so much to pay for independent education, but will also increase pressure across our constituency on our top local state schools. And with private education a significant employer in our constituency, accounting for 600 jobs in Berkhamsted alone, I’m worried this Labour policy will be damaging to our local economy.\nSupport our High Streets. I’ve called out Council plans to axe pensioner parking permits in Harpenden, axe Redbourn’s free car park, and axe our free on-street parking in Tring and Harpenden. I believe we need to support and nurture our High Streets and make it as easy as possible for people to visit. Council plans do the opposite and I’ve called on our Lib Dem colleagues across the constituency to rethink these changes, and offered to work with them to come up with better proposals.\nOppose Starmer’s plan to slap VAT on independent school fees. I’ve met with school leaders from local private and state schools. They are worried that this ideological policy will hit not only local parents who sacrifice so much to pay for independent education, but will also increase pressure across our constituency on our top local state schools. And with private education a significant employer in our constituency, accounting for 600 jobs in Berkhamsted alone, I’m worried this Labour policy will be damaging to our local economy.\nI want to be a champion for everyone who lives here – whatever your politics.",
  "https_nigelgardner_uk_/https_nigelgardner_uk/content_1.html": "\"The consequences of the Government’s decision will be felt on our doorsteps and in our playgrounds and back gardens for decades to come. I grew up under a Luton flightpath, with my parents complaining about the noise. In those days there was a fraction of the air traffic. I simply dread to think of all the extra noise, pollution, and added traffic on the Lower Luton Road and our other local thoroughfares.\"",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_03_19_lib-dem-council-threat-to-local-green-belt/content_13.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_01_31_nigel-gardner-calls-on-council-to-save-senior-citizens-parking-permits/content_27.html": "Local Council leaders have decided to axe Senior Citizens’ parking permits for the vast majority of pensioners. Only those receiving benefits will keep the much valued permits. Nigel Gardner – the former businessman whose family go back generations in Harpenden – is urging the local Council to change its mind.\n“The means testing of pensioners’ parking permits is something with which I profoundly disagree”, Nigel Gardner told local media. “It is simply wrong that those who have worked all their lives and paid their taxes should have their parking permits taken away.”\nIn a further blow to residents and High Street traders, the Lib Dem run Council plans to cut free on-street parking, making short shopping stops more difficult.\n“With the cost of living crisis, these are the wrong policies at the wrong time. Not only are they wrong for residents, they will also make life harder for our hard pressed, hard-working High Street traders.”\n“I’m calling on our Lib Dem colleagues to put our pensioners and high streets first and rethink these draconian changes – and I’m happy to work with them to come up with better proposals.”",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_06_27_david-gauke-asks-his-supporters-in-berkhamsted-tring-and-the-amazing-villages-he-used-to-represent-to-vote-for-nigel-gardner-on-july-4th/content_21.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_nigelgardner_uk_/https_nigelgardner_uk_2024_01_27_starmer-or-gardner-the-choice-ahead/content_7.html": "Come the general election Harpenden, Berkhamsted and Tring will form a new Parliamentary seat running across a whole swathe of Hertfordshire.\nRecent figures put Labour and the Conservatives neck and neck in our new constituency – with hardly a whisker between them, followed by the Lib Dems and then Reform.\nOf course, we would love you to back Nigel Gardner – who grew up in the heart of our new constituency and whose family goes back many generations here. We believe he will be a powerful new local voice, standing up for common sense local conservatism.\nAs our story this month highlights, local education leaders fear Labour’s plans to slap VAT on school fees will damage our children’s education, our economy and our town.\nIt’s only by voting Gardner not Starmer that we can help Harpenden & Berkhamsted avoid this ideological Labour tax plan. It really is a simple binary choice.\nOf course, we would love you to back Nigel Gardner – who grew up in the heart of our new constituency and whose family goes back many generations in Harpenden. We believe he will be a powerful new local voice, standing up for common sense local conservatism.\nAs our story this month highlights, local education leaders fear Labour’s plans to slap VAT on school fees will damage our children’s education, our economy and our town.\nIt’s only by voting Gardner not Starmer that we can help Harpenden & Berkhamsted avoid this ideological Labour tax plan. It really is a simple binary choice."
}