{
  "https_reformukorpington_co_uk_/https_reformukorpington_co_uk_policies/content_6.html": "INTRODUCTION\nAs a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again.\nTo do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense would be a good start!\nThe nation faces many challenges, but we can overcome them. To succeed, we need to do Brexit properly and save the Union by protecting Northern Ireland. We must grow our way out of the crisis, we cannot tax our way out of it. We must stand up for our core democratic values, our civil liberties, our right to free speech. Let’s celebrate our pride in being British: our amazing culture, our unbreakable communities, our incredible heritage. Let’s stop all the woke nonsense that is holding us back. Let’s have a proper immigration policy that works for our country and protects our borders. This means net zero immigration so we can train and support our own people. It means zero illegal immigration. Together, let’s make great things happen !\nLeaving the undemocratic EU was just the beginning. People’s eyes have been opened as to the benefits of being an independent sovereign nation. Reform is now possible and essential in these key\nareas:\n1.Reform our Economy:\nTo succeed faster growth is vital. Higher growth rates are the only way to better wages and more tax revenues that can be invested in better healthcare and other public services. Our bold economic vision frees up over 6 million people from paying Income Tax and frees up over 1.2 million small businesses and self-employed from paying Corporation Tax. We would also aim to remove a raft of other stifling taxes in a responsible, timely way. This will generate much faster growth than seen in recent decades. We must also stop wasting taxpayers’ money.\n2. Reform our Public Sector:\nWe must be ambitious, seeking faster, more efficient public services that work better for us all. For example, with health, we should demand zero waiting lists and we have a bold plan to achieve this vision. Our police need to focus on preventing crime and catching criminals. Our schools must educate our children properly to prepare them for a competitive, challenging world, whilst protecting them from age inappropriate sex education and gender questioning. Our Border Force must protect our borders.\n3. Reform our Energy Strategy:\nWe all care about the environment and want cleaner air, and we can do this in a strategic, affordable way. Yet the Westminster Net Zero plan is making us all net poorer whilst creating more emissions overall as it outsources them overseas. It is therefore net stupid. It is adding huge extra costs to us all as consumers and to our businesses. This will send hundreds of thousands of British jobs to China and elsewhere. Our energy plan will use our own energy treasure under our feet, and create thousands of British jobs, by making our industries competitive again. It will save consumers considerable amounts of money on their bills every year. We would also nationalise 50% of key utility companies to stop consumers being ripped off with the other 50% being owned by British pension funds for British pensioners.\n4. Reform our Institutions:\nMajor change is needed to the bodies that impact our lives — the unelected cronyism of the House of Lords, the unaccountable civil service and the bloated BBC. Reform is essential to our voting system so it is fairer and more representative; the two-party system embeds the status quo and prevents real change.\nOur freedom is so precious, yet we have taken it for granted. Our freedom is so valuable, yet so vulnerable. The restrictions on our freedoms by the Government during the Covid pandemic amounted to a major erosion of our rights and civil liberties. Governments are very good at imposing temporary measures, but very bad at getting rid of them — income tax was a temporary tax on the rich to pay for a war over 200 years ago!\nWe will campaign relentlessly to protect our civil liberties and freedom of speech. We must be able to debate, test and challenge different views, consensus thinking, scientific theories and the establishment approach in a respectful way.\nThe Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services.\nInflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million.\nThe combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance.\nSmart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms.\nReform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare.\nOur ‘Emergency Recovery Plan’ can be seen in detail at reformparty.uk\nReform UK will also oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society.\nSTIMULUS PLAN\n- Free up 6 million people from paying Income Tax by lifting the minimum threshold to £20,000 from £12,571 p.a. This amounts to 1 in 5 taxpayers. Basic Income Tax rate stays at 20%\n- The less well-off benefit proportionately the most, saving £1,500 p.a. @£20,000 salary, circa £30 per week.\n- Free up 1.2 million SMEs from paying Corporation Tax (over 80% of companies) by lifting the minimum profit threshold to £100,000.\n- Reduce the cost of living by lowering consumer taxes, which will reduce Inflation whilst stimulating growth:\n- Scrap VAT on energy bills = saves £100 / year per household.\n- Scrap environmental levies = saves £160 / year per household.\n- Lower fuel duty by 20p / litre =saves £240 / year per driver.\n- Lower VAT from 20% to 18% = saves £300 / year per household\n- Funded by cost savings totalling approximately £85 billion:\n- Reduce wasteful Government spending: £5 in £100 = £50 billion\nper year. - Enable well over 1 million out of the over 5 million on out of work\nbenefits back into jobs: saves circa £15-20 billion per year. Some 1.5\nmillion more people are on benefits than pre-Covid, so a return just to\n2019 levels is eminently realistic. - Tax the Renewable Energy industry the full amount of the circa £11\nbillion in subsidies they currently receive under old contracts; they\nclaim it is cheaper than other energy forms, so they no longer\nneed taxpayer support.\n- Reduce wasteful Government spending: £5 in £100 = £50 billion\n- Remove vast swathes of unnecessary regulations that hinder growth.\nREORGANISING QUANTITATIVE EASING DEBT\nWe would reorganise the Bank of England internal Quantitative Easing (QE) debt into a 75 year wartime-like Corona Bond, with a fixed notional\ninterest rate of 2%, to be left on the Bank’s computer as internal debt. As this QE debt represents some 35% of the national debt at some £850 billion,\nthis will calm markets by removing the refinance and interest rate risk. It will save some £10-15 billion in nominal annual interest payments used by the\nTreasury in their forecasts. The Bank must stop its plans for Quantitative Tightening which will increase interest payments completely unnecessarily and\nworry the markets.\nThe Bank of England must also stop paying interest on reserves created by money-printing QE to commercial banks, which other central banks are not doing. It is an unnecessary transfer of taxpayers’ money to wealthy City institutions, which totals some £20-40 billion per year, depending on interest rates.\nThis money can instead be used to fund our policies to create higher net wages, with lower taxes and lower inflation, especially focusing on the health\nand social sector.\nLOW TAX, SIMPLER TAX CREATES FASTER GROWTH\nMedium term tax simplification ambitions as conditions allow:\n- Reduce the main Corporation tax rate from 25% to 20%.\n- Lift threshold for 40% income tax rate to £70,000.\nReduce and simplify residential Stamp Duty: 0% below £750k, 2% on £750k–£1.5m, & 4% above, will stimulate\neconomic activity and construction. - Abolish the burdensome Apprenticeship Levy, which ironically reduced apprentice numbers.\n- Abolish business rates for small & medium firms, offset with Online\nDelivery Tax at 3%, which will create a fairer playing field for High Street and physical versus online businesses. - Abolish Stamp Duty on share trading, this will help savers and enable the City to compete globally.\n- Abolish Inheritance Tax for all estates under £2m (98% of all estates). 20% tax above £2m — executors can choose\nto give this to registered charities or HMRC. - Abolish the burdensome IR35 rules introduced by the Conservatives in recent years.\n- We aim to reform the over-complicated tax system on savings and pensions, that currently benefits those with the\nmost to save at the expense of those on lower incomes\nReform UK will save £100 billion of taxpayers money to pay for these lower taxes:\n- Scrap the bloated vanity project HS2 saving £100 billion, of which £50 billion would be spent on infrastructure in the\nNorth-East and North-West, resulting in a £50 billion net saving. - Put the cost of the energy price cap on the UK producers not the taxpayers. This should save tens of billions each year, depending on global prices\nOur public services are paid for and valued by us all. The faster our economy grows by having lower, simpler taxes, the more money there is to invest in public services. With reform, they can work better, faster, and more efficiently. There is far too much waste and not enough ambition.\nThe vast and growing mountain of daft, unproductive regulations that hinder small businesses and restrict growth are all part of the same problem in the public sector — lacking in common sense. They go hand in hand with the wasteful spending\nThe NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue.\nThe frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world.\nLet’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists\nWe must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery.\n– If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere.\n– If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere.\n– If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere.\nWe must also urgently solve the staffing crisis in health and social care. Our healthcare plan includes zero basic rate income tax for 3 years for all\nfrontline patient facing staff in health and social care. This will significantly help retain and attract back recently departed staff, whilst we train new staff as well.\nThis should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings. Overall efficiency will improve dramatically.\nCitizens in many countries expect and demand to see a doctor within 1 day, so should we. This is why reform is essential.\nOn Education, let’s invest more wisely in young people: university students are being ripped off with high fees often for just online learning. Many degree courses could be done in 2 years not 3 years, which would save students many thousands of pounds.\nWe would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate.\nWe would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work,\nrather than accruing debt at university.\nOur schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end.\nSchools must focus on the basics of teaching every child to read and write.\nTeachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution.\nWe must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate. There are only 2 sexes and 2 genders, and it is a safeguarding issue to confuse children by suggesting otherwise.\nWe must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level Common sense dictates more police on\nthe streets will help prevent crime and help catch criminals.\n- Increase police numbers in the community, with officers on the beat, engaging with the local people.\n- Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets.\n- Target the menace of County Lines drug dealers, gangs and the growth of knife crime.\n- Our police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork.\n- Reform our courts and justice system to work faster and smarter.\nThe United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few.\nIt is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, especially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel.\nReform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential. Let’s properly protect our troops and veterans from unwarranted, never-ending legal claims. Let’s invest in properly equipping and housing our armed forces. Let’s invest in training our brave people for new jobs when they leave the services. Let’s provide the support they deserve in healthcare and mental health.\n- Reform the BBC: Bloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose.\n- Reform the unelected, crony-filled House of Lords: Recent abuse has been offensive — a former Prime Minister ennobling his brother, mates\nand personal donors by making them peers is indefensible. A properly representative second House is needed. - Reform the Civil Service: Better leadership, more accountability, and greater welcome of successful people from the private sector to come in and\nserve the nation. - Reform the voting system: To make it more representative. Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential.\n- Reform the postal voting system: We must combat fraud and abuse to ensure trust in our democracy. We have seen real problems first-hand in recent elections and this problem is far bigger than many realise.",
  "https_reformukorpington_co_uk_/https_reformukorpington_co_uk_events/content_3.html": "Coming Events\nSATURDAY, 22 June, 10.30 – 1.30 pm – Orpington Street Stall – corner of High Street/Station Road by Tesco\nCome a long and join in or just me the candidate and the team.\nMONDAY, 24 June, 5.00 – 6.30 pm – Orpington Station (both sides) – leafleting commuters\nTUESDAY, 25 June, 3.00 – 5.30 pm – Road Show – Hewitts Farm (roadside outside farm on A224)\nAction Day and street stall by Tesco in Orpington High Street (Outside of King Palace) – 16th March 2024\nOrpington Candidate Constituency Meeting – Crofton Halls Orpington – TBA\nBromley Pageant of Motoring event cancelled for 2024\nAfter 40 years the Norman Park Classic Car event has been cancelled due to the new ULEZ restrictions in Bromley Borough. The Norman Park venue is no longer seen as a viable option due to the cost of driving in to the ULEZ area.\nULEZ Action day – Orpington War Memorial – 10th February 2024 12:00 – 15:00\nULEZ Action day – Biggin Hill (TN16 3LB) – 17th February 2024 12:00 – 15:00\nThis was an extremely well attended event of around 500 people with the likes of Howard Cox (Reform UK – London Mayor Candidate), Mike Greenhough (Reform UK – Orpington Candidate) and Alan Cook (Reform UK – Bromley and Biggin Hill Candidate).",
  "https_reformukorpington_co_uk_/https_reformukorpington_co_uk_about/content_5.html": "Skip to content\nHome\nAbout\nPolicies\nParty News\nLocal News\nEvents\nNavigation Menu\nNavigation Menu\nHome\nAbout\nPolicies\nParty News\nLocal News\nEvents",
  "https_reformukorpington_co_uk_/https_reformukorpington_co_uk/content_1.html": "WELCOME TO REFORM UK!\nWe can make Britain great again.\nTo do this, reform is essential in the way our country is run and managed, so it works properly for the people.\nIn many areas, just the application of basic common sense would be a good start! The nation faces many challenges, but we can overcome them. To succeed, we need to do Brexit properly. We must grow our way out of the crisis, we cannot tax our way out of it. We must stand up for our core democratic values, our civil liberties, our right to free speech.\nLet’s celebrate our pride in being British: our amazing culture, our unbreakable communities, our incredible heritage. Let’s stop all the woke nonsense that is holding us back. Let’s have a proper immigration policy that works for our country and protects our borders. Together, let’s make great things happen !\nReform is essential in these key areas:\n1. Reform our Economy:\nTo succeed faster growth is vital.\nHigher growth rates are the only way to better wages and more tax revenues that can be invested in better healthcare and other public services.\nOur bold economic vision frees up over 6 million people from paying Income Tax and frees up over 1.2 million small businesses and self-employed from paying Corporation Tax. We would also aim to remove a raft of other stifling taxes in a responsible, timely way. This will generate much faster growth than seen in recent decades. We must also stop wasting taxpayers money…\n2. Reform our Energy Strategy:\nWe all care about the environment and want cleaner air, and we can do this in a strategic, affordable way. Yet the Westminster Net Zero plan is making us all net poorer whilst creating more emissions overall as it outsources them overseas. It is therefore net stupid. It is adding huge extra costs to us all as consumers and to our businesses. This will send hundreds of thousands of British jobs to China and elsewhere. Our energy plan will use our own energy treasure under our feet, and create thousands of British jobs, by making our industries competitive again. It will save consumers considerable amounts of money on their bills every year. We would also nationalise 50% of key utility companies to stop consumers being ripped off with the other 50% being owned by British pension funds for British pensioners…\n3. Reform our Public Sector:\nWe must be ambitious, seeking faster, more efficient public services that work better for us all. For example, with health, we should demand zero waiting lists and we have a bold plan to achieve this vision. Our police need to focus on preventing crime and catching criminals. Our schools must educate our children properly to prepare them for a competitive, challenging world. Our Border Force must protect our borders…\n4. Reform our Institutions:\nMajor change is needed to the bodies that impact our lives — the unelected cronyism of the House of Lords, the unaccountable civil service and the bloated BBC. Reform is essential to our voting system so it is fairer and more representative; the two-party system embeds the status quo and prevents real change…\nTogether let’s Make Britain Great!\nBest Wishes,\nRichard Tice\nLeader of Reform UK",
  "https_reformukorpington_co_uk_/https_reformukorpington_co_uk_local-news/content_2.html": "Orpington’s First Action Day\nWe held our first Action Day on Saturday 16th March in Orpington High St. A fantastic attendances by candidates and supporters alike. It was an excellent day with an overwhelmingly positive reception from the local residents. This is just the beginning. We are here to support the residents of Orpington and we have many more events planned over the coming weeks.\nAttendees:\nHoward Cox (London Mayor Candidate)\nMick Greenhough (Orpington candidate)\nMark Simpson (Eltham and Chislehurst Candidate)\nAlan Cook (Bromley and Biggin Hill Candidate)\nOrpington Reform UK Support team.\nAbolish ULEZ and LTNs\nAbolish all of the disastrous Ultra Low Emissions Zones and Low Traffic Neighbourhoods, including the negative aspects of 15 minute cities. Remove 20mph zones apart from outside schools.\nEradicate Potholes\nEnsure potholes are attended to in a timely fashion and where possible tarmac whole sections for damaged road, instead of patching.\nSave our High Streets\nRescue our struggling high streets with free short stay parking, business rate cuts, encouraging homes in town centres, targeted investment, local resident discount schemes and more.\nPlanning\nWe will protect our green spaces and heritage by building new homes on brownfield sites and make sure real infrastructure like road improvements, school places and medical facilities come first.\nNo Whip\nAll of our councillors are whip free, which means they can vote on matters that concern you and your community without interference from the party.\nDecentralise\nMore power to local areas.\nCouncil Spending\nCommon sense local spending. Cutting wasteful spending.",
  "https_reformukorpington_co_uk_/https_reformukorpington_co_uk_https-www-reformparty-uk-wellingborough-by-election-campaign-launch/content_4.html": "Skip to content\nHome\nAbout\nPolicies\nParty News\nLocal News\nEvents\nNavigation Menu\nNavigation Menu\nHome\nAbout\nPolicies\nParty News\nLocal News\nEvents"
}