{
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_get-involved/content_7.html": "Jamila Robertson\nCONSERVATIVE\nHome\nNews\nContact\nAbout\nMore\nJoin Jamila, Sign Up Now\nTell us how you’d like to get involved, a member of our team will get in touch soon\nThanks for submitting!",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_news/content_2.html": "top of page\nCAMPAIGN NEWS\nThe Latest Updates\nSearch\nIf you want to WFH, maybe you should work for yourself. Jamila Robertson writes for CityAM.\nI was delighted to make my debut for City AM on the controversial topic of Working From Home (WFH). You can read the full article on...\nFeb 142 min read\nJamila launches the Mod Cons Podcast\nIt's been a labour of love to launch the Mod Cons Podcast, with the fantastic Laura Burns and Stewart Waine. At Mod Cons we hope to be a...\nOct 2, 20241 min read\nJamila Makes Her Jeremy Vine Debut\nJamila Robertson Makes Her Jeremy Vine Debut. I was delighted to make my debut on the Jeremy Vine show on Tuesday, 3rd September 2024. I...\nSep 9, 20241 min read\nPrime Minister Rishi Sunak and Jamila Robertson, Parliamentary Candidate for Brent East, visit Neasden Temple\nLast night, Rishi Sunak and Conservative Parliamentary Candidate for Brent East, Jamila Robertson, visited Neasden Temple in the final...\nJun 30, 20241 min read\nbottom of page",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_post_jamila-robertson-launches-her-plan-for-brent-east/content_8.html": "Jamila Robertson, Launches Her Plan For Brent East\n- Jamila Robertson\n- Jun 25, 2024\n- 2 min read\nIt has been an honour to speak with the residents of Brent East and have the opportunity to represent your views in Parliament.\nI have been working hard meeting constituents, local businesses and campaign groups, understanding which issues are most important, how I can best support people locally, and where efforts should be focused.\nI have listened to those views and the issues raised are addressed here in My Plan for Brent East.\nAs your MP, my priorities will be: tackling crime; building more family and first homes; saving our high-streets and backing small businesses; upskilling the next generation, and giving everyone easy access to care. So here is my plan for Brent East; it's time for a fresh start, and a fresh voice.\n1. Tackling Crime\nResidents are concerned about the rise in shop-lifting and gang-related crime in the area. I will work hard, with local police and business owners, to tackle this.\nSince 2019, we’ve removed 138,000 dangerous weapons from our streets, and we want to do more. I back our innovative approaches to cutting crime, like using metal detector wands to minimise the invasiveness of stop and search; and investing more in youth clubs.\n2. Building Family & First Homes\nResidents have expressed their concerns about the type of homes being built in Brent East - they want family homes, and affordable rents.\nAffordable rent schemes enable people to save for their first homes, and as a young person who struggled to get onto the ladder, I relate to this. In Brent we don’t just want more 1 and 2 bedroom apartments. We need family homes. This will be a priority for me. As will, ensuring that new developments come with infrastructure. That’s why I support the Conservative plan, to ensure new GP surgeries are built in areas with new housing growth.\n3. Backing Small Businesses & Saving our High Streets\nAccess to cash is crucial for small businesses and residents, which is why I will campaign that every major high street in Brent East provides access to a bank, or banking hub.\nI will also call for a major review of the business rates system.\n4. 100,000 more apprentices a year\nThe Conservative government has delivered over 5.8 million apprenticeship starts since 2010.\nI'm a small business owner and I've given paid work experience to young people. I've seen first-hand the benefits this has had on their confidence and careers.\nThat’s why I back our plan to help small businesses provide 20,000 apprenticeship opportunities, in addition to 100,000 new apprenticeships every year.\n5. Easy Access to Healthcare\nHealthcare is a priority for us all. We will focus on healthcare and technology efficiencies, to drive more appointments and improve patient satisfaction in Brent.\nSupply must match demand, which is why I back the Conservative plan to build 100 new GP surgeries in areas of housing growth. I will push for our fair share of these surgeries in Brent.\n6. Keeping Brent Beautiful\nBrent is beautiful, but the local Labour Council are not listening to residents’ concerns about blue bags, fly-tipping, potholes, pavements and the general upkeep of the area.\nThis is why I back the Conservative plan to make fly-tipping an offence which carries 3 to 6 penalty points on a driving licence.",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_contact/content_3.html": "Jamila Robertson\nCONSERVATIVE\nHome\nNews\nContact\nAbout\nMore\nReach Me Anytime\nFor press and general inquiries, contact Jamila today:\ncontact@jamilarobertson.co.uk\nThanks for submitting!",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk/content_1.html": "Sign Up To My Newsletter\nABOUT ME\nPutting My Experience\nto Work\nJamila Robertson stood in the 2024 General Election as the Conservative Parliamentary Candidate for Brent East.\nJamila Robertson is an entrepreneur, mentor and school Governor.\nShe created the Slapp makeup app in 2016, where with just a selfie you could instantly find the right makeup, wherever you lived and whenever you wanted. The app has been featured in the Daily Mail, Guardian and Elle Magazine.\nJamila speaks in schools and colleges up and down the country, inspiring young people to become entrepreneurs, go into STEM and to take up work experience.\nAs a school Governor in two local primary schools, Jamila is focused on the curriculum, and ensuring young people have access to networks and a range of career possibilities.\nDuring the pandemic, Jamila offered eight under 24 year olds work experience in her business via the Kickstart scheme, in order to give them their first steps into the workplace and the confidence that had been dented by the pandemic.\nShe is a passionate advocate for upskilling those on Universal Credit to empower people back to work and to build the SMEs of the future.",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_post_jamila-writes-for-cityam/content_10.html": "If you want to WFH, maybe you should work for yourself. Jamila Robertson writes for CityAM.\n- Jamila Robertson\n- Feb 14\n- 2 min read\nI was delighted to make my debut for City AM on the controversial topic of Working From Home (WFH).\nYou can read the full article on City AM with a short extract below.\nWant to WFH, perhaps it’s time to work for yourself?\nThe reason behind the WFH crisis? People want the lifestyle of an entrepreneur without the risks, writes Jamila Robertson\nBy Donald Trump’s orders, today is the day federal employees must return to the office or face termination. The President remarked that apart from being unproductive, the allowance for federal employees to work from home was unfair to the millions of people working hard from job sites. The battle lines have been drawn, this is about fairness.\nAnd it’s a battle taking place on our shores too. I was struck by the end of Panorama’s recent report on whether we should still be working from home, especially the remarks of Chris Goss, co-founder of Hospital Records: “All of a sudden, it seems like there’s a notion that everyone should be able to have their full-time, fully-paid up bonus-ridden job from the comfort of their kitchen. It’s simply my conviction that we, as a team, can do so much more when we’re together; and that’s my privilege, because I’m the boss and I’ve built this up.”\nAnd he’s right. If you’re looking for complete flexibility in when and where you work, you should work for yourself. Yet, despite 25 per cent of UK adults wishing they could, only 15 per cent do. According to the ONS, in 2019, there were 5m self-employed people in the UK, the highest number since records began. In 2024 this dropped to under 4.4m. There are many reasons for this....",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_post_jamila-makes-her-jeremy-vine-debut/content_4.html": "Jamila Makes Her Jeremy Vine Debut\n- Jamila Robertson\n- Sep 9, 2024\n- 1 min read\nJamila Robertson Makes Her Jeremy Vine Debut.\nI was delighted to make my debut on the Jeremy Vine show on Tuesday, 3rd September 2024.\nI joined broadcasting legend Jeremy Vine and TV personality and author Andy West.\nWe discussed an assortment of topics, from Labour's cruel recall of the Winter Fuel Payment for some of the poorest pensioners in the country, to the Conservatives' introduction of childcare support for 9-month-olds to 2-year-olds and the scarcity of pharmacies in rural communities.\nIt was a wonderful experience, and I hope to continue to lend my voice to communicating the 'why' of Conservatism.",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_profile_jamila-london_profile/content_11.html": null,
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_about/content_9.html": "ABOUT ME\nJamila Robertson is an entrepreneur, political commentator, and school Governor.\nJamila is Director of the Centre for the Future of Work.\nJamila Robertson stood in the 2024 General Election as the Conservative Parliamentary Candidate for Brent East.\nIn 2016, she created the Slapp makeup app, so with just a selfie you could instantly find the right products for you; wherever you lived and whenever you wanted.\nJamila speaks in schools and colleges across the country, inspiring young people to become entrepreneurs, go into STEM and take up work experience.\nAs a school Governor in two local primary schools, Jamila is focused on ensuring young people have access to networks and a range of career possibilities.\nDuring the pandemic, Jamila offered eight under 24 year olds work experience in her business via the Kickstart scheme, in order to give them their first steps into the workplace and the confidence that had been dented by the pandemic.\nShe is a passionate advocate for upskilling those on Universal Credit to empower people back to work, and build the SMEs of the future.\nJamila studied Classics at UCL before going on to gain an NCTJ in Newspaper Journalism, and an MA in Fashion Journalism at the London College of Fashion (UAL).\nJamila attended Christ's Hospital school in Horsham, West Sussex, where she spent her time volunteering and giving back through Community Service locally and in Romania, and was selected to meet Her Late Majesty Queen Elizabeth II. Jamila studied a political history course at the University of Oxford and was selected to be part of the Coalition for Global Prosperity's inaugural Future Leaders programme.\nJamila is Vice Chair of the Kensington, Chelsea, Bayswater and Fulham Conservative Association; Chair of the Conservative Women's Organisation in Kensington, Chelsea & Fulham; and is Vice Chair of the Conservative Rural Forum.",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_post_jamila-launches-the-mod-cons-podcast/content_5.html": "Jamila launches the Mod Cons Podcast\n- Jamila Robertson\n- Oct 2, 2024\n- 1 min read\nIt's been a labour of love to launch the Mod Cons Podcast, with the fantastic Laura Burns and Stewart Waine.\nAt Mod Cons we hope to be a fresh voice for Conservatism and help people to understand why two ‘creatives’ ended up standing in local and national government for the Conservative Party.\nWe'll be discussing topics of the week, and speaking with experts across the political landscape about the national issues of the moment.\nFollow us: @modconspod\nTikTok - https://www.tiktok.com/@modconspod\nInstagram - https://www.instagram.com/modconspod\nWatch the podcast on YouTube - https://www.youtube.com/@ModConsPod\nI hope you love it!",
  "https_www_jamilarobertson_co_uk_/https_www_jamilarobertson_co_uk_post_prime-minister-rishi-sunak-and-jamila-robertson-parliamentary-candidate-for-brent-east-visit-neasd/content_6.html": "Prime Minister Rishi Sunak and Jamila Robertson, Parliamentary Candidate for Brent East, visit Neasden Temple\n- Jamila Robertson\n- Jun 30, 2024\n- 1 min read\nLast night, Rishi Sunak and Conservative Parliamentary Candidate for Brent East, Jamila Robertson, visited Neasden Temple in the final days of the General Election campaign.\nGuests at the BAPS Shri Swaminarayan Mandir, included the Prime Minister’s wife Akshata Murty, Bob Blackman, Ameet Jogia and Lord Popat.\nIn his speech to hundreds of attendees, Mr Sunak said, “the United Kingdom is the world’s most successful multi-ethnic, multi-faith democracy and we should all be uplifted by that.”\n“I know the pride there is to have a British Asian Prime Minister and I am determined to never let you down,” he added.\n“I am proud to be the first British Asian Prime Minister and I am even prouder that it is not a big deal.”\nThe Prime Minister, commended Ms Robertson for her values of hard work, education and entrepreneurship, and said he shared the values of hard work, education and family, as Conservative values.\nJamila Robertson, welcomed Prime Minister Sunak and Mrs Murty to Brent East, and thanked the Neasden Temple team for \"an unforgettable evening\".\nPictures by Edward Massey / CCHQ and Jamila Robertson."
}