{
  "https_www_joedancey_co_uk_/https_www_joedancey_co_uk/content_1.html": "I consent to sharing my e-mail address with Joe Dancey and receiving updates from him about his campaign. I understand I can opt out at any time by clicking the unsubscribe link in any of the e-mails. View Labour’s privacy policy at labour.org.uk/privacy-policy\nMy plan for Stockton West\nWhy I'm standing to be the next MP for Stockton West\nLatest News\nFighting for\nStockton West\nHeading Three\nCouple of lines of text in here about the issue\nProud town put down by a clown\nNovember 26: Tory Home Secretary James Cleverly was caught on camera putting Stockton down\nToday I wrote an article in the national press after Stockton came under attack from the Conservative government’s new Home Secretary.I am committed to stand up for Stockton so went straight out to defend it in national TV news from Yarm High Street and in the national press, as well as our local champions at BBC Tees, Teesside Live and The Northern Echo.The Mirror gave me space to defend Stockton alongside its forensic exposé of how AI technology has proven once and for all that the Home Sec said what we know he said. You can read the full piece below.This isn’t party political. We all make mistakes but it’s about our elected representatives being accountable and doing what is right.Stockton North’s Labour MP Alex Cunningham MP sprung to his feet immediately in the House of Commons to defend our town. We come from different parties but Tees Valley Mayor Lord Ben Houchen was right to condemn Mr Cleverly for “dragging Stockton’s name through the mud”.I believe that Stockton South’s former Conservative MPs Lord James Wharton and Tim Devlin would have called out such an attack on our town just as Paul Williams, Dari Taylor and Lord Ian Wrigglesworth would have done.Former MP for Stockton and Tory Prime Minister Harold Macmillan would never have let it stand. It’s a question of decency in my opinion.That’s why it’s a mystery that the current MP won’t take a stand.At the next election, the new seat of Stockton West will choose a new MP and the choice is simple.Does your candidate stand up for Stockton or not?PROUD TOWN PUT DOWN BY A CLOWNI grew up in Stockton and it’s the place I’m proud to call home today. Straddling County Durham and North Yorkshire, Stockton has a proud history and a bright future.\nThe Stockton to Darlington railway gave the world its first steam-operated public train service in 1825. Today we still host Britain’s export-rich chemical cluster where my own dad worked.\nStockton High Street is the widest in the country, and historic Yarm and Norton sit alongside hard-working Thornaby, Billingham and Ingleby Barwick as places where decent people graft and serve Great Britain in the NHS, schools and the Armed Forces.\nWe’re a proud people, but we’re also fair-minded.\nStockton gave the Home Secretary the chance to come clean, own up and come to our town to apologise. He didn’t .\nTo add insult to injury, Stockton South’s Tory MP, Matt Vickers, leapt to the Home Secretary’s defence, instead of defending our town.\nWho was he kidding when he wrote he understood “there’s some debate about what was said and by whom”? We all heard the tape. Now the Mirror has proved it once and for all.\nInstead of levelling Stockton up, Tory ministers are putting Stockton down.\nThis isn’t about left versus right, but right versus wrong.\nJames Cleverly should resign and Matt Vickers should hang his head in shame for putting loyalty to this clown before his loyalty to our town.\nThe Green Industrial Revolution\nOctober 27: Joe spoke to Teesside Live about his positive vision for Stockton West\nGreat to speak to Teesside Live about my positive vision for Stockton West.As a Teessider, I am local and rooted in Stockton West, and have the experience to deliver on the issues that matter most like the Conservatives’ cost of living crisis, saving our NHS, cutting crime, and delivering new and better-paid jobs.Only a long-term industrial strategy powered by a new Labour government can enable Great Britain to seize our once-in-lifetime opportunity to lead the world again by unleashing the Green Industrial Revolution on Teesside.Click here to read the full article on Teesside Live\nWatch Joe Dancey set out his priorities for Stockton West\nClick the icons to find out what Labour's 5 missions will mean for Stockton West\nGive every child the best start\nIt’s not talent that’s unevenly distributed, it’s opportunity.Every child deserves the best start in life, whatever our background and wherever we’re born.It’s not right that so many people round here miss children and grandchildren who felt they had no choice but to move away for university and work.I want our young people to be able to make their home and careers here.Labour will:\n• Make sure we have world-class teaching in every classroom with 6,500 new specialist teachers\n• Introduce free primary school breakfast clubs so kids start the day with hungry minds, not hungry bellies\n• Introduce new Technical Excellence Colleges in partnership with local businesses to give our people the skills need to build a great career\nTake back our streets\nTory police cuts mean crime, anti-social behaviour, drug dealing, fly-tipping and shoplifting blight lives on Stockton West’s streets and estates, and hurt local business.As well as catching criminals, they must then face justice. I am disgusted that rapists will receive softer sentences because prisons are full.Labour will:\n• Restore neighbourhood policing with 13,000 new neighbourhood police and PCSOs, with mandatory guaranteed patrols of town centres by dedicated officers\n• Enforce tougher sentences for serious crime, and improve support for victims\n• Tougher penalties for those who commit anti-social behaviour and make fly-tippers clean up our streets through community pay-back\nGet our NHS back on its feet\nLabour delivered the shortest waiting times and the highest patient satisfaction in history.After 13 years under the Tories the NHS is in crisis. Waiting lists are at record levels. People struggle to see a GP. NHS dentists are in short supply.I’ll fight for the future of North Tees Hospital and make sure that we get our fair share of the staff we need to treat patients on time.Labour will:\n• Provide 2 million more appointments each year to cut the backlog, with extra evening and weekend slots\n• Deliver 700,000 extra NHS dentist appointments so that you can get a dentist when you need one\n• Provide mental health support in every primary and secondary school and provide a mental health hub for our local community\n• Double the number of medical school places and train thousands more doctors, nurses and midwives each year so that the NHS has the staff it needs to see us on time\n• Bring back the family doctor by cutting red tape\nPowering Teesside’s Industrial Future\nWith Teesside at the heart of the Green Industrial Revolution, we could deliver the high-paid and high-skilled jobs we need and give Britain its energy security back.However, Rishi Sunak is putting this future at risk by pulling the plug on Net Zero. Even local Conservative politicians admit Tory short-termism is undermining Teesside’s future.Labour’s industrial strategy supports Teesside, and we will:\n• Make Britain a clean energy superpower, expanding renewables and new nuclear power to cut bills, create jobs and give Britain its energy security back\n• Set up the National Wealth Fund to invest alongside the private sector in green steel plants, gigafactories, hydrogen and energy storage\nTackling the cost of living crisis\nNorth East families are finding it tough. Even those on decent wages are feeling the pinch.Tory mismanagement of the economy has led to rising mortgages, higher energy bills and the price of the weekly shop going up. As people cut back, it hurts local shops and high streets.Labour won’t make the same reckless mistakes. Instead Labour will:\n• Tackle the cost of living crisis with a real windfall tax on the excess profits of big oil and gas companies\n• Support high street businesses by scrapping business rates and replacing them with a fairer system that asks online giants to pay their fair share\nWhy I'm standing to be the next MP for Stockton West\nI am local and rooted in Stockton West, have the experience to get things done and will always put our community first.After all, this community gave everything to me. I grew up in Eaglescliffe and today I live in Yarm. Junction Farm Primary School then Egglescliffe Comprehensive helped me win a place at Oxford University. My father was a chemical engineer at Seal Sands and my mother worked as an NHS stroke nurse at James Cook Hospital.I’ve spent my career making a difference in both private and public sectors. After helping to deliver Britain’s first-ever National Minimum Wage, I served at the heart of the UK government. In 2007, Lord Sebastian Coe recruited me for his office at the London 2012 Olympic Games where we put the best of Britain on show to the world.Today I am self-employed and, since 2015, have used my national experience to help business and industry in Teesside secure millions of pounds of private and public investment for new jobs and innovation.After 14 years of Conservative government, it’s time for change. Mortgages and bills have soared thanks to Liz Truss and Rishi Sunak’s cost of living crisis, forcing local firms out of business. Our NHS is going through the worst crisis in its history where the sick struggle to get a GP or dentist appointment. North Tees Hospital is crumbling.Britain can only achieve its potential with a change of government and a new MP for Stockton West. I’ll be out and about to meet as many people as possible ahead of the election and I’d love to hear from you.It’s time for change in Stockton West.Best wishes\nJoe\nGeneral Election 2024 survey\nPlease share with me your priorities and thoughts...\nThe Labour Party uses your personal data for a variety of reasons related to engaging in the democratic process. Where we rely on consent, you are always able to opt out.We may use the information you provide, such as name and postcode, to match the data provided to your electoral register record held on our electoral database, which could inform future communications you receive from us. We may also use your answers to help us campaign better.To find out more about how we use your personal data and to view our Profiling Notice, please see labour.org/privacy-policy",
  "https_www_joedancey_co_uk_/https_www_joedancey_co_uk_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}