{
  "https_emmafoody_com/https_emmafoody_com_2024_11_08_the-autumn-budget-2024/content_55.html": "The Budget: A Fresh Start for a Brighter Future\nMy question to the Chancellor of the Exchequer ahead of the Budget announcement\nOver the last week we saw the presentation of the first Labour budget in 15 years, a pivotal moment for this country. This budget isn’t just a set of numbers—it’s a chance to rebuild and restore the foundations of this country that have been neglected for far too long. For too many years, communities in Cramlington and Killingworth constituency have had their ambitions stifled by an out-of-touch Conservative government, one that preferred to sweep problems under the rug rather than face them head-on. But the time for ignoring the issues is over. This budget marks the beginning of a new chapter—one that seeks to undo the damage of the past and set us on a path towards a better future.\nFixing the Foundations – Local Transport and Infrastructure\nOne of the most pressing issues in places across Cramlington and Killingworth, and indeed the country, has been the sorry state of our local transport infrastructure. For years, people have been frustrated by roads riddled with potholes, buses that never arrive, and a lack of investment in the vital services we rely on. In this budget, we’re taking steps to fix that.\nThe additional £500 million for road maintenance will go a long way in addressing the huge backlog of repairs, with a particular focus on fixing potholes—an all-too-visible symbol of years of decline. This commitment to repairing one million potholes a year is a key pledge that was welcomed with enthusiasm during the election. But it’s not just about roads. We’re also committed to improving bus services, particularly in areas like the North East, where local leadership has worked hard to bring better public transport solutions to communities. Extending the bus fare cap until the end of next year at £3, that was due to completely expire and send the cost of some rural route to £14 per trip, will help protect vital services and ensure people can still afford to get to work, school, and other essential places.\nSupporting people with the cost of living\nAnother major challenge facing families across the country has been the relentless squeeze on household budgets. The catastrophic economic missteps of the past government—most notably the disastrous Liz Truss budget—left many paying the price through rising bills and financial uncertainty. In this budget, we’re making clear that Labour is here to support working people and those who need it most.\nOne of the key measures is the increase in the living wage. For too long, workers have faced stagnant wages that have failed to keep pace with rising living costs. This budget will put more money in people’s pockets, helping them make ends meet. Additionally, we’re introducing the largest single increase in carers’ allowance since it was first introduced. Carers play a vital role in our society, often going unrecognised and unpaid, and this boost will provide much-needed support for those who care for our loved ones.\nFor those on Universal Credit, we’re also reducing debt repayments, offering vital relief to people who are struggling the most. These measures, along with others aimed at helping the most vulnerable, reflect our commitment to creating a fairer society where everyone has a chance to succeed.\nRebuilding our public services – Investing in Policing and the NHS\nWhen I spoke with voters on the doorstep during the election, I heard one consistent message: communities are feeling less safe, and crime is going unpunished. It’s clear that too many of our streets are being blighted by anti-social behaviour, and people no longer feel protected by the services meant to keep them safe. This budget addresses that concern head-on, with funding to recruit 13,000 additional police officers to restore neighbourhood policing and ensure safer communities for all.\nBut safety isn’t just about policing; it’s also about the state of our NHS. I’ve worked for the emergency services myself, and have seen firsthand the pressure that staff are under, and the strain patients face due to long waiting lists and overstretched services. I was recently reminded of this when I bumped into a former supervisor who is now retired, but still passionate about the NHS. We talked about how much harder things have become for ambulance staff and patients alike. That’s why I’m particularly proud of the £25.6 billion cash injection into the NHS announced in this budget. This is the first step in reducing waiting times and rebuilding our healthcare services, ensuring that people get the care they deserve without unnecessary delays.\nFixing the foundations\nIn summary, this budget is about more than just fiscal responsibility; it’s about putting people first. It’s about ensuring that communities like Cramlington, Killingworth and all our towns and villages, which have suffered from years of austerity, can begin to recover and thrive once again. The road ahead will not be easy, and we cannot fix everything in one go. But this budget marks a significant step forward. It’s the first of many, a starting point from which we can build a better, fairer, and more prosperous country for everyone.\nAs I’ve listened to the contributions from the opposition over the past few days, it’s clear to me that they have learned nothing from the message sent by the British people in the last election. We have listened. We are acting. And we will continue to put people’s needs at the heart of our decisions. This is the beginning of the journey, and together, we will make it a success.\nImage attribution – UK Parliament",
  "https_emmafoody_com/https_emmafoody_com/content_1.html": "LATEST NEWS\nBeing elected as the first Labour and Co-operative Member of Parliament for the new Cramlington and Killingworth constituency was a huge honour. I am so grateful for the trust you have put in me as your elected representative, and I will work tirelessly to deliver for our communities, our region and country here and in Parliament.\nLocal Transport\nTransport is vital for people to get to work, to see family and friends, to access education and training and to support the local economy. I’m working with our North East Mayor locally, and the Labour government nationally to secure a transport system that is more reliable, is greener and meets the needs of our communities.\nYour Champion\nI was born, raised, and live in our community. What matters to people here matters to me too and I want to be our champion in Parliament, raising the issues that are important locally. I have a local office and team to help support residents, I hold regular surgeries across the constituency, and I attend events with local schools, community group and residents’ organisations.",
  "https_emmafoody_com/https_emmafoody_com_2024_10_18_broadband-access-in-cramlington-and-killingworth-constituency/content_58.html": "Access outside commercial full-fibre broadband deployment areas\nEmma Foody, Member of Parliament for Cramlington and Killingworth, has highlighted the need for greater action to support residents impacted by inadequate broadband coverage.\nAccess to good quality and reliable broadband is essential to ensure people can study or work, but too many find themselves with poor and unreliable connections, outside commercial broadband roll out and especially in our more rural communities.\nSpeaking during Science, Innovation and Technology Questions in the Commons, the I highlighted that “Access to reliable broadband is essential to residents across Cramlington and Killingworth. However, for those who fall just outside commercial full fibre broadband deployment areas, it remains a real issue impacting on their ability to work and study”. I went on to ask “what further action can the government take to ensure that residents falling just outside current roll out areas aren’t left behind?”\nIn response, the Secretary of State replied “We are making sure that the market for digital provision is a functioning market that will deliver for providers, and where providers are in areas where the market isn’t as full as we like, those marker providers need to be working together to make sure every resident across her constituency get the connectivity that they deserve”.\nFollowing the question, I commented:\n“Access to good quality and reliable broadband is essential to ensure people can study or work, but too many find themselves with poor and unreliable connections, outside commercial broadband roll out.\n“I welcome the Secretary of State confirming that action is being taken to ensure adequate provision and will continue to work to ensure that this issue is addressed for communities across Cramlington and Killingworth”.\nYou can view the transcript of the exchange here.",
  "https_emmafoody_com/https_emmafoody_com_2025_03_07_2025-survey/content_7.html": "2025 Survey | Findings and Actions\nThank you to the hundreds of people who completed my 2025 Cramlington and Killingworth constituency priorities survey. It was great to have so many people sharing their experiences and priorities from right across the constituency on both national and local priorities for this year.\nThis feedback, alongside ongoing discussions and engagement with my office helps me to ensure that the voices from Cramlington and Killingworth are heard in Parliament and that I am raising the matters relevant to people.\nResponses\nThe Economy and Cost of Living was the highest concern both nationally and locally. Nationally the biggest issues raised in addition were Health and Social Care and Immigration and Borders.\nLocally, as well as the Economy and Cost of Living, Crime and Safety and Transport and Infrastructure were the key priorities.\nThe responses to the survey reenforce what I see raised with my when speaking to residents, at my surgeries and in my mailbox from constituents.\nAction to tackle key priorities\nEconomy and Cost of Living\nSecuring growth and a stable economy is at the centre of the Government’s Plan for Change. The Plan for Change includes in its six steps delivering Higher Living Standards across the country, so that working people have more money in their pocket. This was my promise to constituents at the election and since being elected, I continue to work in Parliament towards this.\nI have supported measures within Parliament to increase the National Living Wage, to Make Work Pay and through measures such as rolling out free breakfast clubs for primary aged pupils, cutting the cost of school uniforms and providing better protections for those living in rented accommodation which all help towards tackling the cost of living.\nI have attended conferences and spoken alongside trade unions on the importance of good paid work and Labour’s New Deal for Working People which will deliver real change for working people.\nLocally, my team and I have supported constituents in accessing financial support, welfare, debt and addressing housing issues in the office and at my surgeries. I have also worked with and visited businesses to discuss investment in our area and supporting growth locally.\nTransport\nI know that access to good, reliable transport is critical for getting around, whether to work, to see family and friends or for education. Our constituency is diverse with a mix of towns and villages, each with their own transport challenges.\nI have spoken in Parliament about access to buses, especially in rural areas, and how these are a critical lifeline for many residents. I am working with the North East Mayor Kim McGuinness on implementation of the Better Buses Bill and devolution agenda, bringing buses into public ownership and ensuring one cohesive network across our constituency and region, and I have met with Nexus on the rollout of the new metros.\nI have met with National Highways and the North East Combined Authority to discuss Moor Farm Roundabout, and met in Parliament with the Roads Minister, as well as questioning the Secretary of State for Transport on investment in Moor Farm and Seaton Burn.\nI have also spoken about the welcomed additional investment to tackle potholes and welcomed the announcement for the third runway at Heathrow, which has long been a campaign for Newcastle Airport and will open up additional investment opportunities for our region.\nIt was great to attend the opening day of the Northumberland Line and travel from Seaton Delaval to Newcastle on our new line. I have also engaged with Northern about concerns with accessibility.\nHealth and Social Care\nI welcome that the government have already achieved the goal of reaching over 2million additional NHS appointments in the first six months, helping to tackle the backlogs and delays that too many constituents have faced.\nI have spoken in Parliament about the importance of addressing these issues and have met with local professionals working at the Northumbria Specialist Emergency Care Hospital in Cramlington and visited local GP surgeries and pharmacies.\nI welcome that the government is rolling out 700,000 extra dentist appointments and continue to work to ensure that there is good access to local healthcare across the constituency.\nImmigration\nImmigration was raised as a key national issue, although less so locally and I have spoken in Parliament about my concern with the previous government’s Rwanda scheme and the amount of money that this wasted without delivering any deterrent.\nThe government is taking action to address concerns on immigration. Since July, over 19,000 people without a right to be in the UK have been removed with enforced returns up 24% since last year and a 23% increase in foreign criminals removed. Alongside this, there has been action to address illegal working with a 73% increase in enforcement activity and arrests.\nThe government’s Border Security, Asylum and Immigration Bill is introducing new counter-terror style powers to tackle people-trafficking gangs and will give law enforcement agencies stronger powers to take action to disrupt, investigate and prosecute organised criminal people smuggling gangs.\nCrime and Anti-Social Behaviour\nAnti-social behaviour, and especially off-road bikes, were raised as areas of significant concern.\nI have met and continue to meet regularly with the Police and Crime Commissioner and local authorities to discuss concerns in this area and ensure Cramlington and Killingworth is receiving the attention and resources required.\nI welcome that the government, after years of police budgets being slashed, are investing in neighbourhood policing to tackle crime and anti-social behaviour to keep communities safe, with North East Police Forces seeing an additional £100million being provided in funding.\nNext Steps\nWith the outcome of the survey, as well as ongoing engagement with residents whether on the doors, at my surgeries, coffee mornings, further surveys and from contact from constituents, I will continue to work on the priorities that matter locally to residents across the Cramlington and Killingworth constituency.\nPlease keep an eye out for further surveys and ways to engage and if you don’t already, please follow me on my social media and sign up to my newsletter to be kept up to date on my activities.\nAs always, please do get in touch and share your views!\nGraphic Attribution – Vecteezy",
  "https_emmafoody_com/https_emmafoody_com_category_arts-and-culture/content_45.html": "Government Consultation on the Ticket Market Arts and Culture Government Consultation on the Ticket Market Cramlington and Killingworth MP welcomes government consultation on the ticket market Emma Foody, MP for…emmaJanuary 15, 2025\nSecondary Ticketing Market Debate Arts and Culture Secondary Ticketing Market Debate Westminster Hall Debate on Secondary Ticket Market Emma Foody MP takes on the secondary ticketing market to protect fans…emmaNovember 1, 2024",
  "https_emmafoody_com/https_emmafoody_com_2024_09_19_meeting-nexus/content_9.html": "Advocating for Cramlington & Killingworth public transport\nRecently I spent some time with Nexus to get updates on the Metro system and raise some of the issues constituents have been raising.\nSome of your topics we covered;\nAnti-Social Behaviour – Officials talked us through some of the additional security measures that have been taken, both at Northumberland Park and across the network generally. These ranged from additional CCTV and increased security personnel, to school visits and collaboration with the police.\nScheduling – We had a productive conversation about metro timetables and punctuality. Nexus reassured me they are in the process of developing a robust, carefully considered plan in terms of scheduling. They are aware of the challenges and need for improvement to the service, and are working hard to get it where it needs to be.\nNew Fleet – Officials talked us through some of the next steps in getting the (extremely swish!) new trains rolled out. I was so impressed with the new model, and Nexus showed us all the ways their extensive public consultation had been implemented; from hand rail design to accessibility, it was clear communities have been listened to in the latest design.\nNetwork Integration – We talked a lot about how the linking of transport services across the region would be extremely beneficial to Cramlington and Killingworth constituents, where buses are the primary mode of public transport. I heard about Nexus’ long term vision and advocacy on this issue. It was so exciting to hear about their collaboration with Northern Rail and ideas around the Northumberland Line, which will be game changing for residents in the northern part of our constituency – very exciting stuff!\nOfficers from Nexus spoke honestly about their determination to deliver a first class transport system, and their hopes to reignite excitement in the Metro service. As local and regional transport becomes an increasingly important focus, I’m excited for further conversations with Nexus and other transport providers to ensure an improved service constituents across Cramlington and Killingworth constituency.",
  "https_emmafoody_com/https_emmafoody_com_contact/content_4.html": "Skip to main content\nHit enter to search or ESC to close\nClose Search\nMenu\nHome\nAbout Me\nMy Work\nOur Constituency\nLatest News\nResources\nSurgeries\nContact\nemma.foody.mp@parliament.uk\n0191 429 8750\n@emmalfoody\n@efoody\nFor information on how I use and protect your data, please read my Privacy Policy.\nPrivacy Policy\nClose Menu\nHome\nAbout Me\nMy Work\nOur Constituency\nLatest News\nResources\nSurgeries\nContact",
  "https_emmafoody_com/https_emmafoody_com_privacypolicy/content_16.html": "As the Member of Parliament for the Cramlington and Killingworth constituency and to best represent our community, it is important to keep in touch about my work, take up casework on their behalf and ask for views on local issues.\nMy Privacy Policy sets out how as your Member of Parliament, I collect and use personal data to represent you in Parliament, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nThe responsible office in my office can be contacted be contacted via e-mail at emma.foody.mp@parliament.uk or via telephone on 0191 691 1587.\nAs a Labour MP, I also have access to other information which I or my office, or volunteers working with me, may use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/) for details of what information they hold, why, and how they use and process that information.\nData collection and use\nThe office of Emma Foody MP will only collect and use personal information for the specific purpose for which it has been obtained.\nWhen undertaking casework using personal information provided by or on behalf of a constituent. It may be necessary for me or my office to share your information with third party organisations. I or my office will only do this where it is necessary and reasonable to do so, and we will share only the minimum amount of personal information necessary in order to advocate on your behalf. The Office will contact you using your preferred method of contact, whether this is phone, email or post.\nAs an elected official, I have a legal entitlement to the full electoral register for my constituency, including the full name and address of every registered elector, which may be used to write to you in connection with my activities as an MP.\nI have a regular e-mail update that will be sent to residents who sign up to the newsletter, however this will only be sent to those who have proactively signed up to the newsletter, providing explicit consent for me to do so. This consent can be withdrawn at any time through the unsubscribe function or by e-mailing me on emma.foody.mp@parliament.uk.\nWhen using this website to register to receive my regular e-bulletin, you will be asked for limited personal information. I will only use this for the purposes for which you provide it.\nI will not use personal data for any automated decision making or profiling.\nLawful bases for processing\nThe lawful bases for processing data are set out in Article 6 of the General Data Protection Regulation (GDPR). I process data under the ‘consent’, ‘public task’ or ‘legitimate interests’ bases, as set out on the ICO’s website.\nWho I share your information with\nWhere constituents share information with me for me to act on their behalf and contact relevant agencies, casework, this will only be shared with the relevant agency that I am taking the issue up on your behalf of, whether a local authority, government department, third party organisation or charity.\nYour details will be held on a casework management system that is GDPR-compliant. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my officer responsible for data protection for more information.\nOther than in the circumstances above, I or my office will not share personal information with other organisations without your explicit consent.\nNo data will be transferred outside of the EU unless to a country deemed adequate by the EU for data protection purposes, or unless covered by the EU-US Privacy Shield Framework.\nRetention of personal data\nI will keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the your Member of Parliament, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\nObtain copies of the personal information I hold about you (known as a “subject access request”)\nRequest that I correct or update any personal information held about you\nAsk that we erase or restrict the way in which I use your information\nRequest that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my officer responsible for data protection via:\nEmma Foody MP\nHouse of Commons\nLondon SW1A 0AA\nemma.foody.mp@parliament.uk\n0191 691 1587\nAlternatively you have right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "https_emmafoody_com/https_emmafoody_com_2025_01_24_moor-farm-update/content_29.html": "Moor Farm Update\nMoor Farm and Seaton Burn Roundabouts are critical pieces of local infrastructure, with the current congestion and capacity impacting on local residents and businesses.\nSince being elected in July, I have met with the Highways Agency and the North East Combined Authority and worked with Northumberland and North Tyneside Councils seeking improvements to the roundabouts and works through the Road Improvement Strategy.\nIn December I met with the Roads Minister and following the meeting, I made further representations to her and the Highways Agency.\nI have recently received a response and, despite some information that has been circulated locally, the Minister has confirmed that the situation remains the same as it was previously and under the previous government. Moor Farm and Seaton Burn Roundabouts remain part of the Road Improvement Strategy Pipeline and the Government continues to consider this, alongside the other schemes in the Pipeline.\nI will continue to highlight the importance of the required improvements and to keep residents updated.",
  "https_emmafoody_com/https_emmafoody_com_category_housing/content_27.html": "Void Properties in Northumberland Housing Void Properties in Northumberland Void properties worsen the housing crisis warns MP Cramlington and Killingworth MP, Emma Foody, today…emmaApril 4, 2025\nFleeceholds are hampering new housing targets Housing Fleeceholds are hampering new housing targets Fleeceholds are hampering new housing targets The government has set out ambitious housing targets to…emmaMarch 18, 2025\nCalls to End the Feudal Leasehold System Housing Calls to End the Feudal Leasehold System MP Calls for Government debate to End the Feudal Leasehold System Emma Foody, Labour and…emmaMarch 6, 2025\nBill Tackling ‘Fleecehold’ Housing Bill Tackling ‘Fleecehold’ Cramlington and Killingworth MP backing for Bill to tackle ‘Fleecehold’ Emma Foody, Labour and Co-Operative…emmaMarch 4, 2025\nAdopted Estates Housing Adopted Estates Cramlington and Killingworth MP holds debate in Parliament on estate adoption in the North East Cramlington…Emma Foody CommsOctober 17, 2024",
  "https_emmafoody_com/https_emmafoody_com_category_health/content_33.html": "Welcome action on NHS backlogs Health Welcome action on NHS backlogs Welcome action on NHS backlogs Emma Foody, Labour and Co-operative MP for Cramlington and Killingworth,…emmaMarch 21, 2025\nNHS Winter Pressures Health NHS Winter Pressures Emma Foody MP raises NHS winter pressures and importance of vaccinations. Cramlington and Killingworth MP…emmaDecember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_author_emmafoodycomms/content_53.html": "Adopted Estates Housing Adopted Estates Cramlington and Killingworth MP holds debate in Parliament on estate adoption in the North East Cramlington…Emma Foody CommsOctober 17, 2024\nSupporting the Fire Service Local Services Supporting the Fire Service Recent engagement with our fire service and supporting local firefighters Policy Area Local ServicesSince being…Emma Foody CommsOctober 10, 2024",
  "https_emmafoody_com/https_emmafoody_com_2025_01_24_public-services-in-rural-areas/content_19.html": "Unreliable public transport in rural Northumberland\nEmma Foody MP for Cramlington and Killingworth has raised the issue of unreliable local transport in Northumberland in a House of Commons debate, following her recent conversation with a constituent.\nSpeaking during a debate on Public Services in Rural Areas called by David Smith MP for North Northumberland, Emma Foody MP stated “as a fellow MP that covers part of Northumberland, we know all too well the impact we have seen on public services in recent years.”\n“A recent case subject which a constituent got in touch with me about, was a Mum in New Hartley. She was sharing how the unreliability and inconsistency of the local bus service means that her son is often late for school.”\n“Does he agree with me that it is unacceptable for children to miss out on their education, as a consequence of poor public services being delivered in rural areas?”\nDavid Smith MP responded “I couldn’t agree more. I’m going to come on to talk about bus services. But it’s especially challenging in counties like our own in Northumberland, and I certainly find that with regard to students in my constituency struggling to get to school.”\nFollowing the debate, Emma Foody MP commented “Public services in rural areas are a lifeline but too often they are inconsistent and unreliable. We must ensure that rural areas receive the public services they deserve and need, including public transport.”",
  "https_emmafoody_com/https_emmafoody_com_2024_11_01_infected-blood-scandal/content_23.html": "Cramlington and Killingworth MP welcomes action on infected blood scandal\nEmma Foody, Member of Parliament for Cramlington and Killingworth, spoke in the House of Commons to welcome action from the Labour government to ensure compensation for those impacted by the infected blood scandal, both the effected and affected.\nThe Infected Blood Compensation Authority has been set up, with Sir Robert Francis KC as Chair, and the body has started to ensure the necessary work to ensure compensation payments are made as soon as possible, with the Government expecting the Authority to begin making payments by the end of the year.\nDuring the debate, Ms Foody reflected on meeting with one of her constituents, who wishes to remain anonymous and highlighting that “not long after being elected, I met one of my constituents who is a victim of the scandal. He was a core participant in the inquiry, and his case is referenced anonymously in the report. Meeting him and hearing his story, about his fight for justice and the impact it has had on his life and his family, will forever remain with me”\nWelcoming the action from the Government, Ms Foody continued that “It is welcome that, following feedback, the Government have made a series of changes, including the regular support payments, new routes for those seeking bespoke compensation claims and packages for those subjected to unethical testing. It is positive that the Infected Blood Compensation Authority has begun the steps to deliver this scheme and ensure that compensation payments are made as soon as possible, and that the payments will start by the end of the year, because victims have already waited too long. As Sir Robert Francis has said, that can provide a credible means of offering significant and, in many cases, life-changing sums to persons infected and affected by this terrible scandal”.\nReflecting on the debate, Ms Foody added “the motion before us is a testament to those, including my constituent, who have fought for decades to bring justice to those impacted. I pay tribute to all of them, as it is their work that has brought us to where we are today. I cannot imagine how it will feel to finally receive the recognition and the acknowledgment of what has happened. It is incumbent on us to ensure that it happens swiftly and provides proper recourse. I hope that, as a result of the action that we are already taking by introducing the Hillsborough law and the wider duty of candour, we can deliver a culture change so that no one will ever have to fight for justice like that again”.",
  "https_emmafoody_com/https_emmafoody_com_2025_03_13_anti-social-behaviour-and-off-road-bikes/content_46.html": "Emma Foody MP Welcomes Government Commitment to Tackle Menacing Off-Road Bikes in Cramlington and Killingworth\nEmma Foody MP, Labour and Co-op Party Member of Parliament for Cramlington and Killingworth, has reinforced her commitment to tackling anti-social behaviour after raising concerns about off-road bikes in the House of Commons. During the Business Statement, she highlighted the overwhelming feedback from local residents regarding the dangers and disturbances caused by these vehicles.\nSpeaking in the Commons, Emma Foody MP said:\n“In my recent 2025 Cramlington and Killingworth Priorities Survey, residents have consistently raised anti-social behaviour and off-road bikes. I know the measures in the Crime and Policing Bill will send a strong message that this behaviour will no longer be tolerated. But can we have a debate on the action that this government is taking to tackle the issue and ensure that the police have the powers and the resources that they need to remove these menacing bikes from our streets?”\nResponding to her concerns, Lucy Powell MP, Leader of the House of Commons, agreed on the need for action, stating:\n“Well, she’s absolutely right. And I’m sure like her, you know, I absolutely welcome the measures in the Crime and Policing Bill that we debated at second reading earlier this week. I think it’s certainly for my constituents too—the powers that we’re giving to the police to seize and crush these menacing off-road quad bikes and others—is probably one of the most popular things this government has done in recent weeks. But she’s absolutely right. We need to make sure that once these new powers are given, the police really do have the resources and can operationalise their intention.”\nEmma Foody MP has been vocal in advocating for stronger measures to address the persistent problem of off-road bike misuse in Cramlington and Killingworth. The new provisions in the Crime and Policing Bill will make it easier for police to seize these vehicles, removing the need for a prior warning and ensuring that offenders face immediate consequences.\nShe also welcomed the introduction of Respect Orders, which will grant police and local authorities stronger powers to take swift action against offenders, ensuring that residents are protected from ongoing disruption. Additionally, the Bill strengthens enforcement measures against fly-tipping and abandoned vehicles, tackling wider anti-social behaviour issues that contribute to a sense of disorder in communities.\nEmma Foody MP commented:\n“For too long, residents in Cramlington and Killingworth have suffered from the reckless and intimidating behaviour of those misusing off-road bikes. The new powers in the Crime and Policing Bill will send a clear message that this will no longer be tolerated. I will continue to fight for safer streets and a stronger police presence to ensure that our communities are not only safer but also feel safer.”\nThe Labour government has pledged to increase police numbers and provide additional resources to ensure effective enforcement of these measures.\nEmma Foody MP encourages residents to continue sharing their concerns and experiences, reinforcing the importance of tackling anti-social behaviour together. Constituents are invited to get in touch with her office for further discussions and updates.",
  "https_emmafoody_com/https_emmafoody_com_2024_11_01_secondary-ticketing-market-debate/content_59.html": "Westminster Hall Debate on Secondary Ticket Market\nEmma Foody MP takes on the secondary ticketing market to protect fans access to sport and culture.\nEmma Foody MP, Member of Parliament for Cramlington and Killingworth has led a debate on the secondary ticketing market standing up for fans access to sport and culture. The debate, attended by a number of cross party MPs was an opportunity to discuss the issues facing fans and the industry as a result of the secondary ticketing market.\nThe debate was secured by Ms Foody following a number of high-profile incidents of fans trying to buy tickets to events which have been tainted by ticket touts, surge pricing websites and illegal bots scrapping thousands of tickets away from real fans. Those fans have seen the very same tickets listed minutes later on secondary ticket platforms for up to 500% more.\nSpeaking in the debate the Labour and Co-operative Party MP said “culture should be available to all, and not just the privileged few. Live entertainment shouldn’t only be the prevue of those able and willing to pay extortionate prices.\n“People already save up for the cost price to access these events, they shouldn’t be made to pay multiples of that. A system that allows for ticket harvesting, surge pricing and tickets being resold as multiples of their original values excludes people from the enjoyment of a gig, sporting event or show.\n“They are actions that freeze people out of enjoyment, take away their chance of having those special memorable moments that live entertainment can bring, whether it’s music or sport.”\nResponding to the debate in Westminster Hall, Minister for Creative Industries, Arts and Tourism Chris Bryant MP said “Change is coming. And I will just say to all the people I have referred to Gigsberg and Viagogo, StubHub, Ticketmaster and all the rest. Change is coming and you should start getting ready for it.”\nFollowing the debate, Emma Foody MP said “Just today we have seen people in the North East unable to get a hold of Sam Fender tickets, despite various mechanisms put in place to try and protect them. It has been reports that more than 50 tickets have already been listed by one vendor overseas.”\nGeneral Secretary of the Co-operative Party Joe Fortune said “The Co-operative Party has a long and proud history of standing up for consumers. That’s why we won’t stand by while music fans face a choice between being ripped off or missing out. We welcome this government’s commitment to take action on ticket touts. It’s time for proper enforcement that keeps fans at the heart of live music.”\nThe financial implications of these practices are substantial, with ticket touts profiting approximately £145 million annually from music fans. Recent research by O2 found that 62% of music fans purchasing tickets from resale platforms do not realise they are buying from other individuals and 64% are unaware that the price they pay is determined by the reseller rather than set by the event organisers.",
  "https_emmafoody_com/https_emmafoody_com_author_emma_page_4/content_17.html": "Meeting Nexus Transport Meeting Nexus Advocating for Cramlington & Killingworth public transport Recently I spent some time with Nexus to…emmaSeptember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_category_public-interest/content_5.html": "Volunteers Making Seaton Sluice ‘Heart Safe’ Public Interest Volunteers Making Seaton Sluice ‘Heart Safe’ Emma congratulates volunteers working to make Seaton Sluice ‘Heart Safe’ This week Emma Foody, Labour…emmaApril 15, 2025\nTime for more checks and balances for social media giants Public Interest Time for more checks and balances for social media giants Time for more checks and balances for social media giants – Emma Foody MP Cramlington…emmaApril 3, 2025\n2025 Survey Public Interest 2025 Survey Thank you to the hundreds of people who completed my 2025 Cramlington and Killingworth constituency…emmaMarch 7, 2025\nStatement on Terminally Ill Adults (End of Life) Bill Public Interest Statement on Terminally Ill Adults (End of Life) Bill Thank you to the many constituents who have contacted me in relation to the vote…emmaNovember 29, 2024\nTourism in Northumberland Public Interest Tourism in Northumberland Championing tourism in Northumberland In a debate on Tourism in Northumberland I had the opportunity…emmaNovember 20, 2024\nInfected Blood Scandal Public Interest Infected Blood Scandal Cramlington and Killingworth MP welcomes action on infected blood scandal Emma Foody, Member of Parliament…emmaNovember 1, 2024",
  "https_emmafoody_com/https_emmafoody_com_2025_04_15_volunteers-making-seaton-sluice-heart-safe/content_22.html": "Emma congratulates volunteers working to make Seaton Sluice ‘Heart Safe’\nThis week Emma Foody, Labour and Co-operative MP for Cramlington and Killingworth met with the dedicated team of volunteers in Seaton Sluice working to make it ‘Heart Safe’.\nLocal charity, Seaton Sluice Defibrillator Group, works in Seaton Sluice to purchase, install and maintain public access defibrillators. The group has now secured 16 defibrillators across Seaton Sluice, with the volunteers maintaining and servicing the defibrillators.\nAs well as working to provide access to defibrillators, the charity has provided free CPR and Defibrillator Awareness training to residents across Seaton Sluice and across Northumberland, with the training covering ‘what to do in an emergency’ and the difference between a ‘heart attack and a cardiac arrest’. The training has been provided to local schools, community groups and businesses.\nIn addition to providing advice to other groups on how they can fundraise to install defibrillators in their local community.\nFollowing her meeting with the Chair of the Group, Chris and other volunteers, Emma Foody MP said:\n“It was amazing to hear how the group of residents have done something so amazing in their local community, that has made a real difference and will help to keep their community safe.\n“I was so inspired by their passion and dedication to getting defibrillators installed across Seaton Sluice, how they have support training for hundreds of people to ensure they know how they can help in an emergency and their support to other organisation across Northumberland and the North East to set up similar groups in their community.\n“I would encourage anyone to reach out to Seaton Sluice Defibrillator Group if they can help support their work, or to see how the group could support similar groups in their area”.",
  "https_emmafoody_com/https_emmafoody_com_author_emma_page_1/content_57.html": "Volunteers Making Seaton Sluice ‘Heart Safe’ Public Interest Volunteers Making Seaton Sluice ‘Heart Safe’ Emma congratulates volunteers working to make Seaton Sluice ‘Heart Safe’ This week Emma Foody, Labour…emmaApril 15, 2025\nBig Bus Survey Transport Big Bus Survey Have your say on buses in Cramlington and Killingworth In my recent priorities survey for…emmaApril 10, 2025\nMoor Farm and Seaton Burn Roundabouts Roads Moor Farm and Seaton Burn Roundabouts Moor Farm and Seaton Burn Roundabouts holding back growth, investment and opportunity Cramlington and Killingworth…emmaApril 9, 2025\nPotholes in Northumberland Roads Potholes in Northumberland Conservative-run Northumberland shows “staggering levels of negligence” on potholes. Cramlington and Killingworth MP Emma Foody…emmaApril 8, 2025\nVoid Properties in Northumberland Housing Void Properties in Northumberland Void properties worsen the housing crisis warns MP Cramlington and Killingworth MP, Emma Foody, today…emmaApril 4, 2025\nTime for more checks and balances for social media giants Public Interest Time for more checks and balances for social media giants Time for more checks and balances for social media giants – Emma Foody MP Cramlington…emmaApril 3, 2025\nUnlock North East’s potential through Green Book Review Local Investment Unlock North East’s potential through Green Book Review Unlock North East’s potential through Green Book Review Cramlington and Killingworth MP, Emma Foody, today…emmaApril 3, 2025\nWelcome action on NHS backlogs Health Welcome action on NHS backlogs Welcome action on NHS backlogs Emma Foody, Labour and Co-operative MP for Cramlington and Killingworth,…emmaMarch 21, 2025\nFleeceholds are hampering new housing targets Housing Fleeceholds are hampering new housing targets Fleeceholds are hampering new housing targets The government has set out ambitious housing targets to…emmaMarch 18, 2025\nAnti Social Behaviour and Off-Road Bikes Crime and Policing Anti Social Behaviour and Off-Road Bikes Emma Foody MP Welcomes Government Commitment to Tackle Menacing Off-Road Bikes in Cramlington and Killingworth…emmaMarch 13, 2025",
  "https_emmafoody_com/https_emmafoody_com_2025_03_18_fleeceholds-are-hampering-new-housing-targets/content_54.html": "Fleeceholds are hampering new housing targets\nThe government has set out ambitious housing targets to get Britain building, deliver the homes that we need in the North East, and tackle the housing crisis.\nDelivering homes will provide security and opportunity to families, create good local jobs and deliver the growth that we need.\nMy constituency of Cramlington and Killingworth, by its nature on the North West of North Tyneside, South East of Northumberland and North of Newcastle has already seen lots of development over the past decade in areas like Dinnington, Cramlington and Shiremoor, and continues to grow.\nNew estates have helped to deliver homes that families desperately need, but it’s also shone a light on how the current system for managing new estates simply isn’t fit for purpose.\nResidents on new estates are left, often for many years, with unfinished roads and pavements, a lack of community facilities, unkept green spaces and basics such as streetlights not working.\nMany are left paying ‘estate management fees’ and ‘service charges’ on top of their Council Tax, for the ‘upkeep’ of their estates to unaccountable management companies. Fees that are opaque, open-ended, and impossible to challenge.\nLeft years on end without completion timeframes or any ability to compel developers to finish even the most basic works, residents are left frustrated. Developers move off their estates to their next developments without the basics in place, with little engagement or accountability.\nThis isn’t just the experience in my constituency, but across the country, people left in limbo, works uncompleted, councils unable to adopt estates, and residents paying the price – twice – through their Council Tax and additional fees.\nThat’s why I am co-sponsoring the Housing Estates Bill, which seeks to address these issues, giving greater protections and assurances to residents on new estates.\nThe Bill, if supported in Parliament, would give residents the right to manage estates, secure minimum standards for public amenities with enforcement, as well as a pathway towards adoption by local councils.\nWe rightly need to be building homes across the country and the government has a mandate to do that, but we must ensure that those living on new estates, and the new estates of the future, have the protections that they need.\nOnly by doing this can we provide confidence for future developments and meet the ambitious housing targets.\nThe Housing Estates Bill is a step in this direction. Let’s tackle the fleecehold scandal and hold developers and management companies to account, bringing the estates to the point that they can be adopted by councils swiftly, and ending the misery of those living on new estates.\nEmma Foody: Labour and Co-operative Member of Parliament for Cramlington and Killingworth.\nOriginally published in the Journal 17 March 2025",
  "https_emmafoody_com/https_emmafoody_com_2025_04_09_moor-farm-and-seaton-burn-roundabouts/content_2.html": "Moor Farm and Seaton Burn Roundabouts holding back growth, investment and opportunity\nCramlington and Killingworth MP Emma Foody has again made the case for investment in Moor Farm and Seaton Burn Roundabouts in Parliament.\nSpeaking in Parliament during Treasury Questions on the steps the Government is taking to increase economic growth in the North East, Ms Foody said:\n“The Combined Authority has identified a key growth corridor sweeping across my constituency, but a historic lack of investment to upgrade the Moor Farm and Seaton Burn Roundabouts causes relentless disruption. It holds back growth, investment and opportunity.\n“There is a business plan, it’s in the North East Growth Plan and Road Investment Strategy. Does the Minister agree this is exactly the sort of scheme this Labour government should support to boost economic growth in every region?”.\nIn response, the Economic Secretary to the Treasury stated “The government is committed to improving roads, we agreed a £4.8bn settlement for National Highways and funded a £500m uplift for local roads in this financial year. Funding for RIS3 programme that she mentioned will be considered in Phase 2 of the Spending Review”.\nSince being elected in July, Ms Foody has campaigned for investment in Moor Farm and Seaton Burn Roundabouts, speaking during Treasury Questions, Transport Questions, in a debate on the Green Book review to unlock infrastructure investment, and has met with the Minister for the Future of Roads, Highways England and the North East Combined Authority.\nFollowing her question, Ms Foody added:\n“Moor Farm and Seaton Burn Roundabouts form part of a key growth corridor for the North East. Their current condition holds back investment, growth and opportunity for residents in South East Northumberland and the North West of North Tyneside.\n“Improvements would help to unlock investment and boost growth for our region, and I will continue to make the case ahead of the Spending Review for investment in these key pieces of regional infrastructure”.",
  "https_emmafoody_com/https_emmafoody_com_2024_10_17_adoptedestates/content_62.html": "Cramlington and Killingworth MP holds debate in Parliament on estate adoption in the North East\nCramlington and Killingworth MP holds debate in Parliament on estate adoption in the North East\nThe new Labour government have rightly placed addressing the housing crisis central to our programme for government, delivering security and opportunity for hundreds of thousands of families.\nTo meet this ambition, we must ensure that we’re building not just houses, but communities.\nMy constituency, spanning the edges of three local authorities, that has seen lots of development over the past ten to fifteen years, I have seen how the current system for managing new estates isn’t fit for purpose.\nThe system of adoption, or lack thereof on new estates, and the subsequent estate management fees, has left residents who have worked hard and saved up for their first or new home living without the very basics: roads, pavements, and communal facilities.\nI recently led a debate in Parliament to highlight the problems, calling for action to protect those living on new built estates.\nI’ve seen people left for years without a tarmacked road, finished pavements, unkept landscaping or in one case even streetlights switched on.\nResidents are left without timeframes or any ability to compel developers to complete even the most basic works after five, ten or fifteen years, with local authorities having little power to support. My constituents expressed their frustration at a lack of engagement or accountability from developers who too often move onto their next development before the basics are in place.\nA Council’s Senior Planning Officer expressed that the current system is too skewed towards developers, where they pick their own contractors and timeframes, and too frequently these aren’t meeting the standards where they can be adopted by local authorities.\nResidents on these estates are paying Council Tax and being made to pay an additional estate management fee, yet despite paying additional fees, there estates aren’t up to the standards of those who don’t pay the additional charge.\nThe estate management fees are too frequently opaque, with little residents can do to challenge. I set out in the debate that the current system provides little access to justice for residents. It simply doesn’t seem right that a developer that has not met its promises to homeowners can profiteer from those same homeowners for years without delivering basic infrastructure.\nThe Minister recognised the importance of addressing this issue to provide confidence for those on new estates and I look forward to proposals that will come forward to end the injustice of fleecehold and better protect residential freeholders.\nThe new Labour government is already taking steps to tackle our housing crisis with the target of 1.5million new homes, reforming the leasehold system, ending section 21; and reform of the rental market.\nAddressing the issues linked to estate management fees and adoption are another key step in addressing this if we are to provide confidence in delivering our housing targets. I am pleased that the new government is committed to tackling this.\nYou can read the full debate here",
  "https_emmafoody_com/https_emmafoody_com_2024_11_20_24-million-funding-for-ne-buses/content_8.html": "£24 million secured for better buses across the North East\nEmma Foody MP welcomed the Labour Government’s transformative plans to deliver better buses across the North East by providing £23.7 million in funding in the North East Combined Authority transport area.\nOne of Emma’s key election pledges was improving public transport and this investment from the Labour government will help residents across Cramlington and Killingworth get around through enhancing popular routes, protecting rural services and support people accessing local services, shopping, socialising and commuting. This is especially important in areas places like Seaton Valley and the villages in the North West of North Tyneside and North of Newcastle where buses are often the only option for residents to travel.\nThe Labour government have said the funding will help prevent service reductions on at-risk routes and improve punctuality, to bring an end to the current postcode lottery of unreliable services.\nSpeaking in the House of Commons, Emma Foody MP said “For 14 years, the last Government failed communities with a lack of investment in our bus services, leading to fewer services, reduced timetables, increasing unreliability and, ultimately, less control. In 2023, in my area alone, tens of millions fewer bus miles were travelled than in 2010” adding that “our towns, villages and rural areas depend on our buses, and that the almost £24 million announced for the North East combined authority will turn the page for my community, which was let down so badly by the previous Government”",
  "https_emmafoody_com/https_emmafoody_com_category_local-services/content_64.html": "Supporting the Fire Service Local Services Supporting the Fire Service Recent engagement with our fire service and supporting local firefighters Policy Area Local ServicesSince being…Emma Foody CommsOctober 10, 2024",
  "https_emmafoody_com/https_emmafoody_com_2025_03_06_calls-to-end-the-feudal-leasehold-system/content_38.html": "MP Calls for Government debate to End the Feudal Leasehold System\nEmma Foody, Labour and Co-operative Party MP for Cramlington and Killingworth, has raised the urgent need to reform the leasehold system, which is trapping homeowners in costly and restrictive agreements today in Parliament.\nSpeaking in the House of Commons, Emma Foody MP said:\n“Last week I held a meeting with local residents impacted by leaseholds—an acute problem in my constituency, compounded by at times pretty unscrupulous behaviour by developers. Trapped by short leases with unaffordable buyouts, eyewatering extension costs, and mortgage lenders unwilling to lend. Can we have a debate on government time to update the House on the action that this government is taking to end the feudal leasehold system?”\nResponding to her question, Lucy Powell MP, Leader of the House of Commons, acknowledged the severity of the issue, stating:\n“Well, absolutely. This also gets raised with me a lot in business questions, but also by my own constituents. She’s absolutely right. We do need to end the feudal leasehold system. It is trapping homeowners—innocent homeowners—in properties that they’re unable to get mortgages on or to sell, and it is a shocking fleecehold system, I think we’ve called it many times before. We are taking a number of steps, including implementing last year’s Leasehold Reform Act. We are moving forward on commonhold with the White Paper. We’re bringing forward draft legislation later this year for a fundamental root and branch reform of leasehold, but I will ensure that the Minister comes to this House regularly to update us.”\nEmma Foody MP welcomes the government’s recognition of the issue and the need for decisive action.\nSpeaking after the debate, Emma Foody MP said:\n“The leasehold scandal that has gone on for too long, leaving too many homeowners in my constituency and across the country trapped in unfair agreements. I welcome the government’s commitment to reform and the progress being made through the White Paper. This is a vital opportunity to make real, lasting change for leaseholders, and I will work with ministers to ensure the legislation delivers the strongest possible protections for homeowners.”",
  "https_emmafoody_com/https_emmafoody_com_our-constituency/content_14.html": "The Cramlington and Killingworth constituency was formed, and named, by the independent Boundary Commission. Despite the name, the constituency covers not only the areas of Cramlington and Killingworth, but many surrounding villages and communities within Newcastle, Northumberland and North Tyneside.\nThe Cramlington and Killingworth constituency is made up of:\nBrunswick, Dinnington and Hazlerigg within Newcastle.\nAnnitsford, Backworth, Brunswick Green, Burradon , Camperdown, Dudley, Fordley, Holystone, Killingworth, Killingworth Village, Lakeside View, Northumberland Park, Seaton Burn, Shiremoor, West Allotment, Weetslade, Wideopen and part of Forest Hall and Palmersville within North Tyneside.\nCramlington, East Hartford, Hartley, Holywell. New Hartley, Nelson Village, Seghill, Seaton Sluice and Seaton Delaval within Northumberland.\nOur Home\nI spoke about our newly formed constituency during my maiden speech which you can read below;\nDon’t live in this area?\nAs MP for Cramlington and Killingworth, unfortunately I am unable to make representations for anyone who is not a resident in our constituency. If you are unsure which constituency you live in, please search ‘Find my MP’ using the link below to check I am the person you need.",
  "https_emmafoody_com/https_emmafoody_com_2025_04_03_time-for-more-checks-and-balances-for-social-media-giants/content_10.html": "Time for more checks and balances for social media giants – Emma Foody MP\nCramlington and Killingworth’s MP Emma Foody has called for more action against social media companies during a debate on the impact of digital platforms on UK democracy.\nSpeaking in Parliament, the Labour and Co-operative MP raised her concerns with the activities of social media giants and their online algorithms.\nDiscussing social media platforms, Ms Foody stated that social media companies too often “have all of the agency, but none of the accountability for what we see on their platforms” before adding that “when we see these platforms…pushing people to more and more extreme versions of content through the very algorisms which they use, it is time that we see more check and balances in place for these social media giants”\nFollowing the debate, Ms Foody added:\n“Social media companies must take responsibility for ensuring that their platforms are safe for users, whether this is keeping children safe from harmful content, or preventing algorisms promoting harmful, extreme and illegal content.\n“I welcome that the Government is building further on the Online Safety Act, and that Ofcom is able to use enforcement powers to make sure the protections promised by the Act are being delivered.\n“We need to ensure that these large companies are held to account, and their responsibilities through greater check and balances”.",
  "https_emmafoody_com/https_emmafoody_com_author_emma_page_3/content_21.html": "NHS Winter Pressures Health NHS Winter Pressures Emma Foody MP raises NHS winter pressures and importance of vaccinations. Cramlington and Killingworth MP…emmaDecember 19, 2024\nProvisional Local Government Settlement Local Government Provisional Local Government Settlement Cramlington and Killingworth MP welcomes provisional Local Government Settlement as first-step to fixing council funding.…emmaDecember 19, 2024\nStatement on Terminally Ill Adults (End of Life) Bill Public Interest Statement on Terminally Ill Adults (End of Life) Bill Thank you to the many constituents who have contacted me in relation to the vote…emmaNovember 29, 2024\nTourism in Northumberland Public Interest Tourism in Northumberland Championing tourism in Northumberland In a debate on Tourism in Northumberland I had the opportunity…emmaNovember 20, 2024\n£24 Million Funding for NE Buses Transport £24 Million Funding for NE Buses £24 million secured for better buses across the North East Emma Foody MP welcomed the…emmaNovember 20, 2024\nThe Autumn Budget 2024 The Economy The Autumn Budget 2024 The Budget: A Fresh Start for a Brighter Future My question to the Chancellor of…emmaNovember 8, 2024\nInfected Blood Scandal Public Interest Infected Blood Scandal Cramlington and Killingworth MP welcomes action on infected blood scandal Emma Foody, Member of Parliament…emmaNovember 1, 2024\nSecondary Ticketing Market Debate Arts and Culture Secondary Ticketing Market Debate Westminster Hall Debate on Secondary Ticket Market Emma Foody MP takes on the secondary ticketing market to protect fans…emmaNovember 1, 2024\nDefence Questions Defence Defence Questions Addressing Military Sexual Trauma and its impact Seeking commitment from the Minister of State for…emmaOctober 18, 2024\nBroadband Access Telecommunications Broadband Access Access outside commercial full-fibre broadband deployment areas Emma Foody, Member of Parliament for Cramlington and…emmaOctober 18, 2024",
  "https_emmafoody_com/https_emmafoody_com_2025_04_03_unlock-north-easts-potential-through-green-book-review/content_34.html": "Unlock North East’s potential through Green Book Review\nCramlington and Killingworth MP, Emma Foody, today (2nd of April) supported a review of how infrastructure funding is assessed during a debate in Parliament.\nThe Westminster Hall Debate on the Green Book saw MPs from across the North calling for the Government’s review to power up investment in their communities, with the Green Book often been criticised for favouring projects that return the largest economic impact, typically found in London in the South East.\nSpeaking about the debate, the Cramlington and Killingworth MP said, “The Green Book review is a fantastic opportunity to show the country that this Government is all about Change.”\n“Under the Conservatives we saw fourteen years of empty and then broken promises to the North East.”\n“That is why I welcome this Government’s commitment to responsible, properly funded investment. I am pleased to see the Department for Transport continue to assess critical projects like the Moor Farm Roundabout and the A19 junctions north of Newcastle. As the only North East project in the RIS3 Pipeline’s delivery plan, it has the potential to unlock enormous growth for the North of Tyne area.”\n“Improvements in the road network are crucial in unlocking growth in South East of Northumberland. If we are to meet our ambitions for growth and development, upgrades in these roundabouts are critical.”\n“The North East deserves its fair share, and with the right investment, it can drive growth not just for our region but for the whole country”\nFollowing the debate, Emma Foody MP said:\n“For too long decisions on infrastructure have favoured London and the South East, with the Green Book embedding this inequality.\n“This government is committed to changing that and delivering for regions like the North East.\n“I want to see the review allow for investment in our infrastructure here such as Moor Farm and Seaton Burn – recognised in the Local Growth Plan from the North East Mayor Kim McGuinness. Investment here can drive the development and job creation the North East urgently needs, unlocking its potential.”",
  "https_emmafoody_com/https_emmafoody_com_public-transport-survey/content_41.html": "Skip to main content\nHit enter to search or ESC to close\nClose Search\nMenu\nHome\nAbout Me\nMy Work\nOur Constituency\nLatest News\nResources\nSurgeries\nContact\nPublic Transport Survey\nPlease enable JavaScript in your browser to complete this form.\nPlease enable JavaScript in your browser to complete this form.\nName\nFirst\nLast\nPostcode\n*\nThis is required so we can confirm you are a constituent\nEmail\nshare would raising\nHow frequently do you travel by bus?\nDaily\nWeekly\nMonthly\nOccasionally\nNever\nWhat service do you use?\nWhich route or bus number(s)?\nHow would you rate the reliability of the service?\nVery good\nGood\nNeutral\nPoor\nVery poor\nHow much do you spend on buses per month on average?\nAre the bus routes appropriate or sufficient for your area?\nYes\nNo\nNot sure\nHave you had any issues with access?\nYes\nNo\nNot sure\nie. wheelchair or mobility access, or prams/pushchairs\nWould you like to share a specific experience or difficulty you have encountered when using a local bus service?\nWould you be happy for me to anonymously share your story for publicly/awareness raising as part of my campaign for better buses?\nYes\nNo\nIf you don’t use bus services, is there anything that would encourage you to?\nCan I keep you updated on developments and responses that I receive?\nYes\nNo\nIf ‘yes’, please ensure you have filled in the email address box above\nSubmit\nPlease read my Privacy Policy to understand how I use and protect your data.\nPrivacy Policy\nClose Menu\nHome\nAbout Me\nMy Work\nOur Constituency\nLatest News\nResources\nSurgeries\nContact",
  "https_emmafoody_com/https_emmafoody_com_2025_01_10_potholes-in-cramlington-and-killingworth/content_15.html": "Emma Foody MP raises action on potholes in Commons\nEmma Foody, MP for Cramlington and Killingworth, has asked the Secretary of State for Transport about the funding gap faced by local authorities as they try to tackle pothole backlogs on local roads.\nSpeaking in the House of Commons the Labour and Co-op MP said “Local residents tell me of their frustration at the epidemic levels of potholes that exist across the constituency, after 14 years of failure to grasp with the problem. Motorists, all too often are the ones who will pay the price. Does the Secretary of State agree with me that local councils like Northumberland, North Tyneside, and Newcastle, in my constituency, will benefit from proper long term funding to allow them to plan works and carry out repairs?”\nResponding Heidi Alexander, Secretary of State for Transport, said “I totally agree with my honourable friend. We need to get the basics right as a country and fixing our roads are the first step to getting our economy firing on all cylinders. We did see a decade of decline and under investment under the previous Conservative government. The additional £500 million that we have allocated, if it were to all be used to fill potholes, would fill another 7 million potholes every year, smashing our manifesto commitment to provide funding for an extra million.”\nSpeaking after the debate, Emma Foody MP said “For over a decade now local authorities in the North East have faced huge backlogs in road maintenance. Cuts by successive Conservative governments have left roads across our country in a poor state. We have seen vehicle damage claims rise in that time and a growing number of injuries for road users, particularly cyclists. I am glad to see that the Government is investing another £500 million into our roads to help meet and exceed our commitment to fix one million potholes each year.”",
  "https_emmafoody_com/https_emmafoody_com_2025_01_15_government-consultation-on-the-ticket-market/content_43.html": "Cramlington and Killingworth MP welcomes government consultation on the ticket market\nEmma Foody, MP for Cramlington and Killingworth, has welcomed the Government’s new consultation into the ticket market following her campaign in conjunction with the Co-operative party to demand better for fans.\nEmma Foody MP said about the consultation “I am pleased that the Government has brought forwards a consultation on the ticketing market. Having raised this issue at PMQs in September after the Oasis tour ticketing disaster and then again while leading a debate in Parliament on the issue I am glad that the Government are able to act to end a practice that limits access to culture for so many people across the country.”\nThe Labour and Co-operative MP added “I am glad that the measures that the Government has set out were some of the solutions that were discussed during the Westminster Hall Debate in October. Action to cap resale amounts up to 30% above face value will allow real fans no longer able to attend to get their money back and prevent the scandal we have seen so many times where tickets cost thousands more than originally sold for, all while none of it goes to the artist whose performance makes it possible. I additionally welcome new powers to enforce this, against both platforms that allow bots to scalp 1000s of tickets, and against the touts themselves who often sell tickets they don’t even have for extortionate prices.”\nJoe Fortune, General Secretary of the Co-operative Party, said “This consultation is welcome news for campaigners but also for live music fans everywhere. Ticket touts chasing profit have been allowed to rip-off fans and undermine the live music scene for too long, and the government has taken an important step today to crack down on their reckless trade.\n“The Co-operative Party has been clear throughout our history – consumers deserve to be championed at every level of politics, and music fans are no exception. We will continue campaigning to ensure everyone has good access to music and culture.”\nImage attribution – Abigail Lynn",
  "https_emmafoody_com/https_emmafoody_com_category_crime-and-policing/content_31.html": "Anti Social Behaviour and Off-Road Bikes Crime and Policing Anti Social Behaviour and Off-Road Bikes Emma Foody MP Welcomes Government Commitment to Tackle Menacing Off-Road Bikes in Cramlington and Killingworth…emmaMarch 13, 2025",
  "https_emmafoody_com/https_emmafoody_com_2025_01_30_newcastle-airport-heathrow-expansion/content_32.html": "MP for Cramlington and Killingworth advocates for regional benefits to Heathrow Airport expansion\nEmma Foody MP has raised the vital role of Newcastle Airport in the North East’s regional economy, following the Chancellor’s speech on Growth. The Chancellor made a number of key announcements, one of which was the expansion of Heathrow Airport.\nNewcastle International Airport campaigned for a third runway at Heathrow, advocating for increased capacity that would provide our region with greater connection opportunities for business, investment, supporting and sustaining jobs in the North East and the country.\nIn the House of Common’s debate, Ms Foody, speaking to the Chief Secretary of the Treasury, said “Newcastle International Airport is crucial for connecting businesses and people in the North East to the rest of the world, often through flying via other hub airports.”\nMs Foody asked; “Does the Minister agree with me that increased capacity at Heathrow will provide vital opportunities for the North East, boosting economic growth for the entire country?”\nThe Government states a third runway at Heathrow would unlock growth – boost investment, increase exports, and could create over 100,000 jobs. A recent study from Frontier Economics, showed over half of the boost will go to areas outside London and the South East.\nChief Secretary of the Treasury Darren Jones MP replied; ‘Look, she’s absolutely right in the premise of her question. For businesses to export, they need to be able to send their goods, and if they can’t get slots at Heathrow in order to get these goods distributed around the world, they just won’t be able to do business.’\nMr Jones continued, ‘This Government will unlock that opportunity for them, and I look forward to the potential it will bring to her constituency and the region.’\nAfter the debate Ms Foody commented; ‘Long term infrastructure decisions can help to unlock economic growth across the country and I will continue pushing for policies that ensure really opportunities can take off in our region and our constituency’\nImage attribution: Tomek Baginski",
  "https_emmafoody_com/https_emmafoody_com_2025_04_04_void-properties-in-northumberland/content_26.html": "Void properties worsen the housing crisis warns MP\nCramlington and Killingworth MP, Emma Foody, today (3 April) raised the issue of council properties standing empty, and the impact on the wider housing crisis. The issue was raised following reports in light of a Freedom of Information request last month showing hundreds of council homes standing empty in South East Northumberland.\nSpeaking in the House of Commons, Emma Foody MP said:\n“One of the biggest issues raised with me is the availability of council and social housing. In Conservative-led Northumberland, a recent FOI found that there were over 300 void council properties in South East Northumberland, with over £750,000 lost in rental income. This failure not only wastes public money but worsens the housing crisis.\n“Can we have a debate on how we ensure that Council properties aren’t left standing empty for months on end, costing local taxpayers, limiting income that could be spent on repairs and maintenance, and exacerbating the housing crisis?”\nResponding to her question, Lucy Powell MP, Leader of the House of Commons, agreed with the urgency of the issue, stating.\n“Well she’s absolute right to raise the issue of void council homes in her constituency. As she said, these are homes that could be housing those desperately in need of a social home, and the loss of income that that involves as well.\n“We are putting extra money into local government, so they’ve got the capital and revenue to bring these homes back into use, and we are also committed to ensuring we have more affordable social housing for all her constituents.”\nFollowing the exchange, the Cramlington and Killingworth MP said,\n“Constituents contact me on a regular basis about the lack of council housing in Northumberland and properties that are standing empty.\n“It is hugely disappointing that there are so many properties standing empty and with the lack of action from Conservative-led Northumberland Council. Void properties stop people having the security of a home, costs council taxpayers through lost rent, and exacerbates the housing crisis.\n“Whilst this government is taking action to address the housing crisis, residents in Northumberland will be disappointed that the Conservative-led Council is losing vital rental income and leaving more people without the houses properties they deserve”.",
  "https_emmafoody_com/https_emmafoody_com_about-me/content_18.html": "I’m proud to be from Cramlington and Killingworth constituency.\nThis is where I grew up – where my family have lived for generations, it is a tremendous privilege to represent our communities now in Parliament.\nGrowing up my Dad worked for the NHS, whilst my Mum worked in factories and pubs to put herself through night school, before working at Northern Rock. They taught me the value of hard work, along with compassion and commitment to giving back to our community.\nAfter university, I worked as a 999 call taker for the ambulance service, and I now volunteer locally as a NHS First Responder.\nI stood to be our Member of Parliament because I know the huge potential that our communities and region have. I am working with a government that I believe can unlock the potential that we know is in our communities, and ensure that they are a fantastic place to work, live and grow up in.\nIn Parliament, I regularly raise issues that are important here, speaking in debates and Questions, meeting with Ministers and organisations to ensure that I raise the issues that matter to you. My office and team are based in the constituency, and I hold regular online and in person advice surgeries to help local constituents.\nI live in Wideopen, as an MP I am required to be in Westminster for several days of the week – happily, my border collie sidekick joins me travelling down to London. It is the highlight of my week coming home, and spending time with people across our communities. So many people and organisations do amazing things here every day, and I’ll work hard to support them.\nI’d love to hear your views on how we can improve our area together!\nI don’t take a single second of this role for granted and am mindful of every week that passes. I am committed to making them count.",
  "https_emmafoody_com/https_emmafoody_com_latestnews/content_11.html": "Big Bus Survey Transport Big Bus Survey Have your say on buses in Cramlington and Killingworth In my recent priorities survey for…emmaApril 10, 2025\nVolunteers Making Seaton Sluice ‘Heart Safe’ Public Interest Volunteers Making Seaton Sluice ‘Heart Safe’ Emma congratulates volunteers working to make Seaton Sluice ‘Heart Safe’ This week Emma Foody, Labour…emmaApril 15, 2025\nMoor Farm and Seaton Burn Roundabouts Roads Moor Farm and Seaton Burn Roundabouts Moor Farm and Seaton Burn Roundabouts holding back growth, investment and opportunity Cramlington and Killingworth…emmaApril 9, 2025\nPotholes in Northumberland Roads Potholes in Northumberland Conservative-run Northumberland shows “staggering levels of negligence” on potholes. Cramlington and Killingworth MP Emma Foody…emmaApril 8, 2025\nVoid Properties in Northumberland Housing Void Properties in Northumberland Void properties worsen the housing crisis warns MP Cramlington and Killingworth MP, Emma Foody, today…emmaApril 4, 2025\nTime for more checks and balances for social media giants Public Interest Time for more checks and balances for social media giants Time for more checks and balances for social media giants – Emma Foody MP Cramlington…emmaApril 3, 2025\nUnlock North East’s potential through Green Book Review Local Investment Unlock North East’s potential through Green Book Review Unlock North East’s potential through Green Book Review Cramlington and Killingworth MP, Emma Foody, today…emmaApril 3, 2025\nWelcome action on NHS backlogs Health Welcome action on NHS backlogs Welcome action on NHS backlogs Emma Foody, Labour and Co-operative MP for Cramlington and Killingworth,…emmaMarch 21, 2025\nFleeceholds are hampering new housing targets Housing Fleeceholds are hampering new housing targets Fleeceholds are hampering new housing targets The government has set out ambitious housing targets to…emmaMarch 18, 2025\nAnti Social Behaviour and Off-Road Bikes Crime and Policing Anti Social Behaviour and Off-Road Bikes Emma Foody MP Welcomes Government Commitment to Tackle Menacing Off-Road Bikes in Cramlington and Killingworth…emmaMarch 13, 2025\n2025 Survey Public Interest 2025 Survey Thank you to the hundreds of people who completed my 2025 Cramlington and Killingworth constituency…emmaMarch 7, 2025\nCalls to End the Feudal Leasehold System Housing Calls to End the Feudal Leasehold System MP Calls for Government debate to End the Feudal Leasehold System Emma Foody, Labour and…emmaMarch 6, 2025\nBill Tackling ‘Fleecehold’ Housing Bill Tackling ‘Fleecehold’ Cramlington and Killingworth MP backing for Bill to tackle ‘Fleecehold’ Emma Foody, Labour and Co-Operative…emmaMarch 4, 2025\nChampioning Better Broadband for Small Businesses Telecommunications Championing Better Broadband for Small Businesses Championing Better Broadband for Small Businesses Small businesses in Cramlington and Killingworth rely on fast,…emmaFebruary 13, 2025\nNewcastle Airport & Heathrow Expansion Transport Newcastle Airport & Heathrow Expansion MP for Cramlington and Killingworth advocates for regional benefits to Heathrow Airport expansion Emma Foody…emmaJanuary 30, 2025\nMoor Farm Update Transport Moor Farm Update Moor Farm Update Moor Farm and Seaton Burn Roundabouts are critical pieces of local infrastructure,…emmaJanuary 24, 2025\nPublic Services in Rural Areas Transport Public Services in Rural Areas Unreliable public transport in rural Northumberland Emma Foody MP for Cramlington and Killingworth has raised…emmaJanuary 24, 2025\nGovernment Consultation on the Ticket Market Arts and Culture Government Consultation on the Ticket Market Cramlington and Killingworth MP welcomes government consultation on the ticket market Emma Foody, MP for…emmaJanuary 15, 2025\nPotholes in Cramlington and Killingworth Transport Potholes in Cramlington and Killingworth Emma Foody MP raises action on potholes in Commons Emma Foody, MP for Cramlington and…emmaJanuary 10, 2025\nChristmas Card Winner! Seasonal Christmas Card Winner! Delight as Shiremoor Primary School’s Skye’s Christmas Card sent to King and Prime Minister! Year…emmaDecember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_latestnews_page_1/content_63.html": "Big Bus Survey Transport Big Bus Survey Have your say on buses in Cramlington and Killingworth In my recent priorities survey for…emmaApril 10, 2025\nVolunteers Making Seaton Sluice ‘Heart Safe’ Public Interest Volunteers Making Seaton Sluice ‘Heart Safe’ Emma congratulates volunteers working to make Seaton Sluice ‘Heart Safe’ This week Emma Foody, Labour…emmaApril 15, 2025\nMoor Farm and Seaton Burn Roundabouts Roads Moor Farm and Seaton Burn Roundabouts Moor Farm and Seaton Burn Roundabouts holding back growth, investment and opportunity Cramlington and Killingworth…emmaApril 9, 2025\nPotholes in Northumberland Roads Potholes in Northumberland Conservative-run Northumberland shows “staggering levels of negligence” on potholes. Cramlington and Killingworth MP Emma Foody…emmaApril 8, 2025\nVoid Properties in Northumberland Housing Void Properties in Northumberland Void properties worsen the housing crisis warns MP Cramlington and Killingworth MP, Emma Foody, today…emmaApril 4, 2025\nTime for more checks and balances for social media giants Public Interest Time for more checks and balances for social media giants Time for more checks and balances for social media giants – Emma Foody MP Cramlington…emmaApril 3, 2025\nUnlock North East’s potential through Green Book Review Local Investment Unlock North East’s potential through Green Book Review Unlock North East’s potential through Green Book Review Cramlington and Killingworth MP, Emma Foody, today…emmaApril 3, 2025\nWelcome action on NHS backlogs Health Welcome action on NHS backlogs Welcome action on NHS backlogs Emma Foody, Labour and Co-operative MP for Cramlington and Killingworth,…emmaMarch 21, 2025\nFleeceholds are hampering new housing targets Housing Fleeceholds are hampering new housing targets Fleeceholds are hampering new housing targets The government has set out ambitious housing targets to…emmaMarch 18, 2025\nAnti Social Behaviour and Off-Road Bikes Crime and Policing Anti Social Behaviour and Off-Road Bikes Emma Foody MP Welcomes Government Commitment to Tackle Menacing Off-Road Bikes in Cramlington and Killingworth…emmaMarch 13, 2025\n2025 Survey Public Interest 2025 Survey Thank you to the hundreds of people who completed my 2025 Cramlington and Killingworth constituency…emmaMarch 7, 2025\nCalls to End the Feudal Leasehold System Housing Calls to End the Feudal Leasehold System MP Calls for Government debate to End the Feudal Leasehold System Emma Foody, Labour and…emmaMarch 6, 2025\nBill Tackling ‘Fleecehold’ Housing Bill Tackling ‘Fleecehold’ Cramlington and Killingworth MP backing for Bill to tackle ‘Fleecehold’ Emma Foody, Labour and Co-Operative…emmaMarch 4, 2025\nChampioning Better Broadband for Small Businesses Telecommunications Championing Better Broadband for Small Businesses Championing Better Broadband for Small Businesses Small businesses in Cramlington and Killingworth rely on fast,…emmaFebruary 13, 2025\nNewcastle Airport & Heathrow Expansion Transport Newcastle Airport & Heathrow Expansion MP for Cramlington and Killingworth advocates for regional benefits to Heathrow Airport expansion Emma Foody…emmaJanuary 30, 2025\nMoor Farm Update Transport Moor Farm Update Moor Farm Update Moor Farm and Seaton Burn Roundabouts are critical pieces of local infrastructure,…emmaJanuary 24, 2025\nPublic Services in Rural Areas Transport Public Services in Rural Areas Unreliable public transport in rural Northumberland Emma Foody MP for Cramlington and Killingworth has raised…emmaJanuary 24, 2025\nGovernment Consultation on the Ticket Market Arts and Culture Government Consultation on the Ticket Market Cramlington and Killingworth MP welcomes government consultation on the ticket market Emma Foody, MP for…emmaJanuary 15, 2025\nPotholes in Cramlington and Killingworth Transport Potholes in Cramlington and Killingworth Emma Foody MP raises action on potholes in Commons Emma Foody, MP for Cramlington and…emmaJanuary 10, 2025\nChristmas Card Winner! Seasonal Christmas Card Winner! Delight as Shiremoor Primary School’s Skye’s Christmas Card sent to King and Prime Minister! Year…emmaDecember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_2024_11_20_tourism-in-northumberland/content_40.html": "Championing tourism in Northumberland\nIn a debate on Tourism in Northumberland I had the opportunity to highlight some of the brilliant places that make people want to visit Cramlington and Killingworth. We are lucky to live so close to beautiful beaches, incredible local art and fantastic nature reserves all so close to one another.\nBut the reason that so many come to Northumberland and want to keep coming back is the friendly and warm embrace of us locals. I know many of us are always excited to share the fantastic things we have to offer in Northumberland.\nHowever, the tourism industry in the UK faces significant challenges, especially in areas outside London and the immediate South East of England. I am glad that the Government recognises that tourism must be part of our nations industrial strategy and that improving the working relationship with the hospitality sector is a priority for them.\nI welcome the support offered by the Government to work with our New North East Mayor, Kim McGuinness, to put Northumberland and the wider North East at the heart of the UK’s future tourism. I was glad that Joe Morris MP, the Member of Parliament for Hexham, was able to secure this debate. Getting important debates like this parliamentary time means that we can raise the need for more to be done to support tourism to Northumberland.\nWatch the full debate here\nFeatured Image: Seaton Sluice Watch House by Duncan Kidd",
  "https_emmafoody_com/https_emmafoody_com_2024_10_18_defence-questions/content_56.html": "Addressing Military Sexual Trauma and its impact\nSeeking commitment from the Minister of State for Veteran Affairs\nLast month I met with Dudley based charity, Forward Assist. One of the topics discussed during the visit was the impact of Military Sexual Trauma (MST) on veterans and serving personnel. Forward Assist explained the scale of the issue, and what they are doing locally to support individuals who have experienced this and are working through this trauma.\nI raised this issue at Defence Questions, and the Minister of State for Veteran Affairs agreed to meet with Forward Assist and myself to discuss it further. The impact on those who face MST is immense, and it is an issue that is often under-discussed. I am pleased the Government is open to discussing this issue, and I hope this will lead to greater recognition of the challenges faced by those who have experienced MST.\nRead the full transcript here.",
  "https_emmafoody_com/https_emmafoody_com_2025_02_13_championing-better-broadband-for-small-businesses/content_47.html": "Championing Better Broadband for Small Businesses\nSmall businesses in Cramlington and Killingworth rely on fast, reliable digital connections to operate smoothly and grow. However, many still face challenges due to poor broadband infrastructure.\nEmma Foody, Member of Parliament for Cramlington and Killingworth, recently raised these concerns in the House of Commons, urging the government to take further action to support digital connectivity in the North East.\nDuring a parliamentary question, Emma Foody MP highlighted the issues small businesses face, saying:\n“Recently, I attended a roundtable of small businesses in the North East, held at Sage, and a key theme was the need for good connections and digital services to help their businesses grow. Digital connectivity often holds them back. Can the minister tell me what the government is doing to ensure that digital infrastructure is strong enough to support local businesses and constituencies like mine?”\nIn response, Feryal Clark MP, Parliamentary Under-Secretary of State for AI and Digital Government, reaffirmed the government’s commitment to improving broadband services:\n“It is right that not only do we need to have good online accessible services, but businesses need to be able to connect to those services. That’s why the government is committed to delivering nationwide gigabit connectivity coverage by 2030. I’m glad to say that over 94% of premises in my honourable friend’s constituency can access gigabit broadband, including the businesses she refers to. But of course, I’m happy to meet with my honourable friend to talk about what more we can do in this important area.”\nFollowing the exchange, Emma Foody MP welcomed the government’s commitment to improving connectivity but emphasized the importance of ongoing action:\n“It is great to hear that the government is taking proactive steps to address the concerns of small businesses in the North East. When I attended the roundtable with local businesses and North East Mayor Kim McGuinness, I heard firsthand about the barriers to trade they face.\n“From ordering stock and managing employees to simply getting a card machine to connect, poor broadband can create significant challenges for small businesses. These are unnecessary frictions that can be resolved with better digital infrastructure. I am glad that the government is committed to Project Gigabit and reducing these barriers for businesses.”",
  "https_emmafoody_com/https_emmafoody_com_category_local-investment/content_37.html": "Unlock North East’s potential through Green Book Review\nUnlock North East’s potential through Green Book Review Cramlington and Killingworth MP, Emma Foody, today…\nemmaApril 3, 2025",
  "https_emmafoody_com/https_emmafoody_com_2024_12_19_nhswinterpressures/content_60.html": "Emma Foody MP raises NHS winter pressures and importance of vaccinations.\nCramlington and Killingworth MP Emma Foody raised the importance of vaccinations in the House of Commons following her recent visit to the Northumbria Specialist Emergency Care Hospital in Cramlington.\nSpeaking during a statement on NHS winter pressures, the MP stated “Recently I visited Northumbria Specialist Emergency Care Hospital in my constituency in Cramlington. I met with staff where they shared their concerns with winter pressures.\n“Every year they closely track the flu seasons in Australia given that the patterns that emerge there are often what follows here, and they are extremely concerned about what we are going into this winter.\n“What steps have the Department taken, or are taking, to ensure that as many people as possible are vaccinated ahead of this winter?”\nIn response the Minister of State for Health commented “We are working very closely with the UK Health Security Agency to do exactly that to make sure we are aware week on week on the movement of different diseases and viruses through the system.\n“We will continue to publicise that campaign and anything that Hon Members can do to support the campaign to get people vaccinated and make sure they support themselves and their loved ones will be greatly received by the entire system and is something everyone can be part of”.\nFollowing the question, Ms Foody commented:\n“Vaccinations can be lifesaving, are the best defence against viruses, and keep people out of hospital during the winter months, when the NHS comes under additional winter pressure. They really are the best defence again things like flu and Covid-19.\n“I want everyone to try and keep safe this winter. To help protect yourself, your loved ones and the NHS, I would encourage anyone to check if they’re eligible for a vaccine. Information can be found on the NHS website: https://www.nhs.uk/vaccinations/”.",
  "https_emmafoody_com/https_emmafoody_com_2024_12_19_christmas-card-winner/content_51.html": "Delight as Shiremoor Primary School’s Skye’s Christmas Card sent to King and Prime Minister!\nYear 6 pupil Sky from Shiremoor Primary School has seen her Christmas card design sent to the King and the Prime Minister after being chosen as the winner of Emma Foody MP’s Cramlington and Killingworth Christmas Card competition.\nSkye’s design, highlighting the iconic ‘Eat For England’ (Cramlington) Spoon in a winter Christmas scene was chosen as the winner out of hundreds of entries from across the constituency. The card, kindly printed by Potts Prints in Cramlington, has been sent to the King, Prime Minister, North East Mayor, Ministers and stakeholders across the North East.\nOn Thursday 19 December Emma Foody MP attended a Christmas assembly at Shiremoor Primary School to surprise Skye with a copy of the card, a certificate and a House of Commons Barry the Bear teddy.\nEmma commented “I was delighted to be able to join Shiremoor Primary School for their Christmas assembly and to present Skye with her certificate for winning the Christmas card competition and a small prize.\n“I had hundreds of entries from schools across the Cramlington and Killingworth constituency so it was really hard to pick a winner. But Skye’s design of the iconic Cramlington Spoon at Christmas was really fantastic. Thanks to Skye for her brilliant design which has been sent to the King, Prime Minister and across the region and to the support from Potts Print with printing the card”",
  "https_emmafoody_com/https_emmafoody_com_category_the-economy/content_52.html": "The Autumn Budget 2024 The Economy The Autumn Budget 2024 The Budget: A Fresh Start for a Brighter Future My question to the Chancellor of…emmaNovember 8, 2024",
  "https_emmafoody_com/https_emmafoody_com_category_local-government/content_36.html": "Provisional Local Government Settlement\nCramlington and Killingworth MP welcomes provisional Local Government Settlement as first-step to fixing council funding.…\nemmaDecember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_category_seasonal/content_48.html": "Christmas Card Winner! Seasonal Christmas Card Winner! Delight as Shiremoor Primary School’s Skye’s Christmas Card sent to King and Prime Minister! Year…emmaDecember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_2025_03_04_bill-tackling-fleecehold/content_49.html": "Cramlington and Killingworth MP backing for Bill to tackle ‘Fleecehold’\nEmma Foody, Labour and Co-Operative MP for Cramlington and Killingworth is to co-sponsor a Ten Minute Rule Bill brought forward by Alistair Strathern, the Member of Parliament for Hitchin.\nThe Housing Estates Bill will seek to make a number of changes to benefit residents on new build/unadopted estates including the right to manage for freeholders, minimum standards for public amenities on new housing estates and the enforcement of the standards, as well as provisions to work towards adoption by local councils of new housing estates.\nIn October, Emma Foody MP held a debate on the adoption of new housing estates in the North East and has asked the Deputy Prime Minister about the delivery of infrastructure alongside new housing estates.\nFollowing the introduction of the Housing Estates Bill, Ms Foody commented:\n“Residents on new housing estate estates are frequently left for years without the delivery of basic infrastructure including roads, pavements and communal areas, whilst at the same time, too often they are paying excessive and opaque estate management or service fees, and there is little residents can do to challenge\n“It simply doesn’t seem right that a developer that has not met its promises to homeowners can profiteer from those same homeowners for years without delivering basic infrastructure.\n“I want to see stronger protections for residents over these charges, and stronger guarantees on when and how estates will be adopted, with the appropriate delivery of infrastructure alongside this.\n“I’ve written to residents across my constituent on new and unadopted estates and this is a matter that they care deeply about, and the Housing Estates Bill is another step in addressing this issue and seeks to address the issue”.",
  "https_emmafoody_com/https_emmafoody_com_2025_03_21_welcome-action-on-nhs-backlogs/content_39.html": "Welcome action on NHS backlogs\nEmma Foody, Labour and Co-operative MP for Cramlington and Killingworth, has welcomed progress on tackling backlogs in Newcastle thanks to additional targeted support.\nThe new government initiative to send top doctors to support hospital trusts including Newcastle Hospitals Trust, where more people are out of work and waiting for treatment, is cutting waiting lists faster, new data shows.\nIn September, crack teams spearheaded by top clinicians were sent to NHS hospitals serving communities with high levels of economic inactivity. The teams support NHS trusts to go further and faster to improve care in these areas.\nThis has led to Newcastle Hospitals Trust slashing waiting lists by 3,372 since October.\nFollowing the success of the programme, the government has confirmed similar crack teams will be rolled out to additional providers this year to boost NHS productivity and cut waiting times further.\nEmma Foody, Member of Parliament for Cramlington and Killingworth commented:\n“Too many people have been left waiting months on end due to ever increasing waiting lists and delays with treatment. This is bad for people’s health and bad for the economy.\n“Waiting lists are still far too high and behind every waiting list statistic, there are people who have been stuck in pain and waiting for treatment.\n“Thanks to the targeted action of this Labour government we’re seeing waiting lists fall month and month”.",
  "https_emmafoody_com/https_emmafoody_com_2024_11_29_terminally-ill-adults-end-of-life-bill/content_30.html": "Thank you to the many constituents who have contacted me in relation to the vote on the Terminally Ill Adults (End of Life) Bill, which is due to be debated in Parliament today. I am truly grateful for everyone who has got in touch to share their views; their personal stories; and their position on this issue and the reasons for this. Please be assured I have read every single email and letter on this matter.\nThis has been an exceptionally difficult decision to reach.\nMy views\nI appreciate that this is an issue where there are strongly held ethical and moral views. It is right that this matter is to be discussed, and that this has led to an important debate being held across the country. I have received a great number of representations on this issue, and these have been fairly balanced between those who wish to see this change, and those who do not. I have listened carefully to the views that have been expressed, and am grateful that the majority of those sharing their thoughts do so in good faith, recognising that all viewpoints are motivated by love and compassion, rather than anything else. My views, like many, are inevitably shaped in part by my own experiences of loss and grief. There is nothing so certain in life as death, and all of us deserve to die with dignity.\nI believe that people have the right to personal freedom and liberty over their own bodies and that, provided that they are given adequate information and support, they should be able to make informed decisions on matters impacting their own body and life.\nEnd of life decisions should be taken in full light of all information, with access to adequate care and support and without coercion from others. This should be an individual decision, and what is right for one person in one situation will not be the same for another person. Each person has the individual right to take their own decisions on what is right for them.\nAdditionally, I am concerned that currently it is the burden of the Criminal Prosecution Service to decide those cases that are murder or manslaughter, those that do represent the criminal offence of assisted suicide, and those where there should be no criminal charge at all without the proper legislative framework in doing so. It means currently decisions are shaped with the fear of exposing loved ones to legal risk. That, it strikes me, is not acceptable.\nIt is imperative however that there are proper safeguards in place to ensure that people have adequate information, are free from any real or perceived coercion and that assisted dying is not a substitute for high-quality palliative and end of life care. Each person nearing the end of their life should feel reassured and safe in the knowledge they will receive the very best care, and that this is a genuine choice.\nThe process\nThis Bill is not a Government Bill, this vote has been brought as a Private Members’ Bill. It has been brought by a backbench MP and is being voted on as a free vote, i.e. political parties are not taking a particular position, and MPs of the same party may well take differing positions.\nToday will see the Second Reading of the Bill. This means there will be a debate and a vote on the principle of the Bill and whether the Bill should proceed to the next stage. If at this point a majority of MPs vote against, the Bill falls.\nIf a majority vote for it to proceed, it moves on to the ‘Committee Stage’. At this stage the Bill would be scrutinised and debated line by line before coming back for MPs to vote on the substantive legislation – the Third Reading.\nAfter which, if a majority vote for the Bill, it goes to the House of Lords to consider further amendments and for their own votes, and would then come back to the House of Commons for a final vote of MPs.\nMy position for Second Reading\nI will be supporting the Bill at Second Reading today as I believe that this should allow for further discussion and public debate on this issue, including whether the safeguards that are in place are adequate. This will enable the discussions to continue and additional scrutiny of the proposals, before a final decision and vote would be taken on Third Reading (should the Bill pass Second Reading) at which point I would consider the final legislation brought to the House.\nThank you again to residents who have contacted me on this issue and please be reassured that I appreciate and respect that there are very strongly held views on this issue.",
  "https_emmafoody_com/https_emmafoody_com_author_emma/content_12.html": "Volunteers Making Seaton Sluice ‘Heart Safe’ Public Interest Volunteers Making Seaton Sluice ‘Heart Safe’ Emma congratulates volunteers working to make Seaton Sluice ‘Heart Safe’ This week Emma Foody, Labour…emmaApril 15, 2025\nBig Bus Survey Transport Big Bus Survey Have your say on buses in Cramlington and Killingworth In my recent priorities survey for…emmaApril 10, 2025\nMoor Farm and Seaton Burn Roundabouts Roads Moor Farm and Seaton Burn Roundabouts Moor Farm and Seaton Burn Roundabouts holding back growth, investment and opportunity Cramlington and Killingworth…emmaApril 9, 2025\nPotholes in Northumberland Roads Potholes in Northumberland Conservative-run Northumberland shows “staggering levels of negligence” on potholes. Cramlington and Killingworth MP Emma Foody…emmaApril 8, 2025\nVoid Properties in Northumberland Housing Void Properties in Northumberland Void properties worsen the housing crisis warns MP Cramlington and Killingworth MP, Emma Foody, today…emmaApril 4, 2025\nTime for more checks and balances for social media giants Public Interest Time for more checks and balances for social media giants Time for more checks and balances for social media giants – Emma Foody MP Cramlington…emmaApril 3, 2025\nUnlock North East’s potential through Green Book Review Local Investment Unlock North East’s potential through Green Book Review Unlock North East’s potential through Green Book Review Cramlington and Killingworth MP, Emma Foody, today…emmaApril 3, 2025\nWelcome action on NHS backlogs Health Welcome action on NHS backlogs Welcome action on NHS backlogs Emma Foody, Labour and Co-operative MP for Cramlington and Killingworth,…emmaMarch 21, 2025\nFleeceholds are hampering new housing targets Housing Fleeceholds are hampering new housing targets Fleeceholds are hampering new housing targets The government has set out ambitious housing targets to…emmaMarch 18, 2025\nAnti Social Behaviour and Off-Road Bikes Crime and Policing Anti Social Behaviour and Off-Road Bikes Emma Foody MP Welcomes Government Commitment to Tackle Menacing Off-Road Bikes in Cramlington and Killingworth…emmaMarch 13, 2025",
  "https_emmafoody_com/https_emmafoody_com_resources/content_6.html": "Please do get in touch with me if I can help in any way by raising issues on your behalf with a government department, local organisation, or your local council.\nYou can contact me by emailing emma.foody.mp@parliament.uk or by calling 0191 429 8750, or you can book an appointment at one of my virtual or in person surgeries.\nThough you are more than welcome to contact me any time, below are some links and contacts that might be helpful.",
  "https_emmafoody_com/https_emmafoody_com_2024_12_19_provisional-local-government-settlement/content_50.html": "Cramlington and Killingworth MP welcomes provisional Local Government Settlement as first-step to fixing council funding.\nEmma Foody, Member of Parliament for Cramlington and Killingworth, has welcomed the Labour Government’s provisional Local Government Settlement, which will provide £69billion to councils across England.\nUnder the provisional Local Government Settlement, Core Spending Power will increase for each of the local authorities within Cramlington and Killingworth by over 5%. Newcastle will see an increase of 8.3%, North Tyneside of 6.2% and Northumberland of 5.1%.\nSpeaking in Parliament in response to the provisional Local Government Settlement, Emma Foody MP stated “I welcome the Minister’s Statement and that this government is starting to fix the damage done by more than a decade of disastrous settlements for local government.\n“In my constituency that means more than 5% increases for each local authority in Core Spending Power.\n“But does the Minister agree that as, if not more important, is the consultation on long term proposals to fundamentally improve the way the local government is funded through a fairer system.\nIn response to the question, the Minister for Local Government and English Devolution responded stating that “We have approached this year very much as a recovery operation, we saw that councils were in a ditch and needed to be pulled out and taken home. That’s exactly what this one year settlement will do.\nBut what they need and deserve is a multiyear settlement that gives long term security and stability and for that long term settlement not to be the continuation of a broken system but a system that has been rewired and put right”.\nFollowing the exchange, Ms Foody stated:\n“The previous Conservative government oversaw a decade of disastrous settlements for councils in the North East and residents have paid the price in the services that they receive.\n“I welcome this first step to putting this right, fixing the foundations of local council funding. I welcome the Minister’s commitment to multiyear settlements that will ensure that our councils have the long term security and stability they deserve, alongside further powers devolved to our region and the North East Mayor”.",
  "https_emmafoody_com/https_emmafoody_com_author_emma_page_2/content_42.html": "2025 Survey Public Interest 2025 Survey Thank you to the hundreds of people who completed my 2025 Cramlington and Killingworth constituency…emmaMarch 7, 2025\nCalls to End the Feudal Leasehold System Housing Calls to End the Feudal Leasehold System MP Calls for Government debate to End the Feudal Leasehold System Emma Foody, Labour and…emmaMarch 6, 2025\nBill Tackling ‘Fleecehold’ Housing Bill Tackling ‘Fleecehold’ Cramlington and Killingworth MP backing for Bill to tackle ‘Fleecehold’ Emma Foody, Labour and Co-Operative…emmaMarch 4, 2025\nChampioning Better Broadband for Small Businesses Telecommunications Championing Better Broadband for Small Businesses Championing Better Broadband for Small Businesses Small businesses in Cramlington and Killingworth rely on fast,…emmaFebruary 13, 2025\nNewcastle Airport & Heathrow Expansion Transport Newcastle Airport & Heathrow Expansion MP for Cramlington and Killingworth advocates for regional benefits to Heathrow Airport expansion Emma Foody…emmaJanuary 30, 2025\nMoor Farm Update Transport Moor Farm Update Moor Farm Update Moor Farm and Seaton Burn Roundabouts are critical pieces of local infrastructure,…emmaJanuary 24, 2025\nPublic Services in Rural Areas Transport Public Services in Rural Areas Unreliable public transport in rural Northumberland Emma Foody MP for Cramlington and Killingworth has raised…emmaJanuary 24, 2025\nGovernment Consultation on the Ticket Market Arts and Culture Government Consultation on the Ticket Market Cramlington and Killingworth MP welcomes government consultation on the ticket market Emma Foody, MP for…emmaJanuary 15, 2025\nPotholes in Cramlington and Killingworth Transport Potholes in Cramlington and Killingworth Emma Foody MP raises action on potholes in Commons Emma Foody, MP for Cramlington and…emmaJanuary 10, 2025\nChristmas Card Winner! Seasonal Christmas Card Winner! Delight as Shiremoor Primary School’s Skye’s Christmas Card sent to King and Prime Minister! Year…emmaDecember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_my-work/content_24.html": "It is such an immense privilege to have the opportunity to represent our area. As Cramlington and Killingworth’s Member of Parliament, my week is varied and fast paced.\nThe work ranges from championing the issues important to our area in Parliament, meeting with Ministers, casework and supporting individual constituents, community events, and hearing directly from residents.",
  "https_emmafoody_com/https_emmafoody_com_2025_04_08_potholes-in-northumberland/content_25.html": "Conservative-run Northumberland shows “staggering levels of negligence” on potholes.\nCramlington and Killingworth MP Emma Foody has slammed Conservative-run Northumberland’s record on potholes during a debate in Parliament on road maintenance.\nThe MP who represents the Cramlington and Seaton Valley areas of Northumberland highlighted research published by the RAC during her speech which showed that Northumberland County Council had the third highest level of potholes in the country, following years of Conservative leadership locally, and over £250,0000 paid out in nearly 450 compensation claims against the Council. The number of claims and level of payout is higher than all the other authorities in the North East Combined Authority combined.\nDuring the debate, the Labour and Co-operative MP stated:\n“Under the Conservatives in Northumberland we have seen staggering levels of negligence. We are now the county with the third-highest number of potholes in the entire country.”\n“There has been more than £250,000 in payouts. That is a quarter of a million pounds of taxpayer money that could have been far better spent. That is truly staggering given that the Council could have avoided all that by adequately maintaining our roads.\n“The Conservatives had their chance to fix the situation, and they failed. The roads are broken, and so is their credibility, both locally and nationally”.\nSpeaking after the debate, the Emma Foody MP said:\n“There is a deep frustration among my constituents who are sick and tired of unsafe roads, damaged vehicles, and empty promises. For too long, Northumberland, under the Conservatives, have neglected the basics in road maintenance.\n“Labour is stepping up to change that, with £1.6 billion in new funding and real accountability measures. Our communities have waited long enough, enough of the photo opportunities of the previous government, now it’s time to deliver.”",
  "https_emmafoody_com/https_emmafoody_com_category_roads/content_13.html": "Moor Farm and Seaton Burn Roundabouts Roads Moor Farm and Seaton Burn Roundabouts Moor Farm and Seaton Burn Roundabouts holding back growth, investment and opportunity Cramlington and Killingworth…emmaApril 9, 2025\nPotholes in Northumberland Roads Potholes in Northumberland Conservative-run Northumberland shows “staggering levels of negligence” on potholes. Cramlington and Killingworth MP Emma Foody…emmaApril 8, 2025",
  "https_emmafoody_com/https_emmafoody_com_category_transport/content_3.html": "Big Bus Survey Transport Big Bus Survey Have your say on buses in Cramlington and Killingworth In my recent priorities survey for…emmaApril 10, 2025\nNewcastle Airport & Heathrow Expansion Transport Newcastle Airport & Heathrow Expansion MP for Cramlington and Killingworth advocates for regional benefits to Heathrow Airport expansion Emma Foody…emmaJanuary 30, 2025\nMoor Farm Update Transport Moor Farm Update Moor Farm Update Moor Farm and Seaton Burn Roundabouts are critical pieces of local infrastructure,…emmaJanuary 24, 2025\nPublic Services in Rural Areas Transport Public Services in Rural Areas Unreliable public transport in rural Northumberland Emma Foody MP for Cramlington and Killingworth has raised…emmaJanuary 24, 2025\nPotholes in Cramlington and Killingworth Transport Potholes in Cramlington and Killingworth Emma Foody MP raises action on potholes in Commons Emma Foody, MP for Cramlington and…emmaJanuary 10, 2025\n£24 Million Funding for NE Buses Transport £24 Million Funding for NE Buses £24 million secured for better buses across the North East Emma Foody MP welcomed the…emmaNovember 20, 2024\nMeeting Nexus Transport Meeting Nexus Advocating for Cramlington & Killingworth public transport Recently I spent some time with Nexus to…emmaSeptember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_category_defence/content_61.html": "Defence Questions Defence Defence Questions Addressing Military Sexual Trauma and its impact Seeking commitment from the Minister of State for…emmaOctober 18, 2024",
  "https_emmafoody_com/https_emmafoody_com_2025_04_10_big-bus-survey/content_28.html": "Have your say on buses in Cramlington and Killingworth\nIn my recent priorities survey for Cramlington and Killingworth, one of the biggest issues raised was the accessibility of public transport and especially buses.\nI know that buses are vital for so many people in our area to access employment, education and training, visiting friends and family, or for leisure. However too often I have heard how bus services are inaccessible and expensive, with services cancelled, delayed or simply not turning up or going where people need them to.\nThe Government have recently introduced the Bus Services Bill into Parliament and the North East Mayor has also pledged action in this area.\nI want to hear from you about your experiences of bus services to ensure that I can feed into both of these discussions and ensure that our area is heard.\nYou can complete my survey whether you’re a regular bus user, occasionally use the bus or don’t use it at all – this will help understand what we want to see from our bus services. I will use your feedback to contact the bus operators, the North East Mayor and feed into the Government as part of discussions around the Bus Services Bill.\nYou can fill in the survey here: Big Bus Survey\nI look forward to hearing from you and your views.",
  "https_emmafoody_com/https_emmafoody_com_2024_10_10_supporting-the-fire-service/content_65.html": "Recent engagement with our fire service and supporting local firefighters\nPolicy Area\nLocal Services\nSince being elected I have by engaging with fire service to really get a handle on how we can best support them.\nWe kicked off with the electric atmosphere at the Northumberland Fire and Rescue Service West Hartford Fire Station Open Day. It was lovely to see it so packed with families along supporting the event, raising money for The Firefighters Charity and learning about being safe with some really interesting demonstrations.\nI then met with the incredible Tyne and Wear Fire and Rescue Service – I’m so grateful for the commitment and courage of the team who work tirelessly to keep our communities in Newcastle and North Tyneside safe. We had some really interesting discussions about both current and future challenges facing the fire service, which gave much food for thought.\nIt is really great when talks culminate in productive action and momentum. It was great to have John in Parliament, joining the Fire Brigades Union lobby and speaking to me about Northumberland Fire and Rescue Service & Tyne and Wear Fire and Rescue Service and the challenges facing the fire service and firefighters across our region.\nI am delighted to support such an essential service, and will continue to do so in pride and admiration of our local firefighters.",
  "https_emmafoody_com/https_emmafoody_com_latestnews_page_2/content_44.html": "NHS Winter Pressures Health NHS Winter Pressures Emma Foody MP raises NHS winter pressures and importance of vaccinations. Cramlington and Killingworth MP…emmaDecember 19, 2024\nProvisional Local Government Settlement Local Government Provisional Local Government Settlement Cramlington and Killingworth MP welcomes provisional Local Government Settlement as first-step to fixing council funding.…emmaDecember 19, 2024\nStatement on Terminally Ill Adults (End of Life) Bill Public Interest Statement on Terminally Ill Adults (End of Life) Bill Thank you to the many constituents who have contacted me in relation to the vote…emmaNovember 29, 2024\nTourism in Northumberland Public Interest Tourism in Northumberland Championing tourism in Northumberland In a debate on Tourism in Northumberland I had the opportunity…emmaNovember 20, 2024\n£24 Million Funding for NE Buses Transport £24 Million Funding for NE Buses £24 million secured for better buses across the North East Emma Foody MP welcomed the…emmaNovember 20, 2024\nThe Autumn Budget 2024 The Economy The Autumn Budget 2024 The Budget: A Fresh Start for a Brighter Future My question to the Chancellor of…emmaNovember 8, 2024\nInfected Blood Scandal Public Interest Infected Blood Scandal Cramlington and Killingworth MP welcomes action on infected blood scandal Emma Foody, Member of Parliament…emmaNovember 1, 2024\nSecondary Ticketing Market Debate Arts and Culture Secondary Ticketing Market Debate Westminster Hall Debate on Secondary Ticket Market Emma Foody MP takes on the secondary ticketing market to protect fans…emmaNovember 1, 2024\nDefence Questions Defence Defence Questions Addressing Military Sexual Trauma and its impact Seeking commitment from the Minister of State for…emmaOctober 18, 2024\nBroadband Access Telecommunications Broadband Access Access outside commercial full-fibre broadband deployment areas Emma Foody, Member of Parliament for Cramlington and…emmaOctober 18, 2024\nAdopted Estates Housing Adopted Estates Cramlington and Killingworth MP holds debate in Parliament on estate adoption in the North East Cramlington…Emma Foody CommsOctober 17, 2024\nSupporting the Fire Service Local Services Supporting the Fire Service Recent engagement with our fire service and supporting local firefighters Policy Area Local ServicesSince being…Emma Foody CommsOctober 10, 2024\nMeeting Nexus Transport Meeting Nexus Advocating for Cramlington & Killingworth public transport Recently I spent some time with Nexus to…emmaSeptember 19, 2024",
  "https_emmafoody_com/https_emmafoody_com_category_telecommunications/content_20.html": "Championing Better Broadband for Small Businesses\nChampioning Better Broadband for Small Businesses Small businesses in Cramlington and Killingworth rely on fast,…\nemmaFebruary 13, 2025",
  "https_emmafoody_com/https_emmafoody_com_surgeries/content_35.html": "March\nTuesday 11 March: 4.30-6pm: Virtual\nFriday 21 March: 2-4pm: Killingworth\nApril\nFriday 11 April: 2-4pm: Seaton Valley\nTuesday 22 April: 4.30-6pm: Virtual\nMay\nFriday 9 May: 2-4pm: Cramlington\nTuesday 20 May: 4.30-6pm: Virtual\nWhere and When\nMarch\nTuesday 11 March: 4.30-6pm: Virtual\nFriday 21 March: 2-4pm: Killingworth\nApril\nFriday 11 April: 2-4pm: Seaton Valley\nTuesday 22 April: 4.30-6pm: Virtual\nMay\nFriday 9 May: 2-4pm: Cramlington\nTuesday 20 May: 4.30-6pm: Virtual\nTo Book\nSurgeries are held on an appointment basis, so please do get in touch to organise a meeting."
}