{
  "https_www_paulathans_uk_/https_www_paulathans_uk_accessibility/content_12.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_hazel-grove-could-be-hit-labour-plans-concrete-over-green-belt/content_5.html": "- Paul Athans warns against giving Labour a blank cheque to carry out their plans to concrete over the Green Belt in Hazel Grove Constituency – ruining precious green spaces.\n- This warning comes as Labour briefed The Sunday Times that their assault on the Green Belt will happen ‘within days’ of a Labour government – forcing councils to reclassify land and build on green spaces, irrespective of local objections.\n- Paul Athans stresses that only Conservatives will build the right homes in the right places and help families onto the housing ladder with tax cuts on your first home.\nHazel Grove is one of several places which could be hit by Labour plans to build over the green belt.\nIn a briefing to The Sunday Times, Labour have announced that from ‘day one’ they would begin an all-out assault on the green belt.\nLabour have pledged to publish a draft national planning policy framework; this would likely involve imposing ‘top down’ targets to ensure that councils are required to build a certain number of homes, irrespective of local support for them. Labour’s briefing also confirmed they would ‘review the green belt’.\nKeir Starmer is already committed to ‘bulldoze’ national planning law and is expected to reclassify land protected as ‘green belt’ land – opening the door to concreting over the green belt without giving communities a say. These comments come just weeks after a Labour official claimed Labour would ‘flatten the whole green belt’.\nLabour’s housebuilding assault is twofold. Not only have Labour promised to rip up the green belt, but they have also admitted first-time buyers will pay more Stamp Duty under Labour’s First-Time Buyers Tax. This means Labour will not only be building homes without local support, but they would be taxing families more who want to buy them.\nThe Conservatives have delivered 2.5 million homes since 2010 and are committed to building another 1.6 million over the next Parliament. These homes will be built in the right places, unlocking brownfield sites first to protect the green belt.\nCommenting, Paul Athans, the Conservative candidate for Hazel Grove, said:\n“Your vote on 4 July will determine if the Green Belt across our area is protected by the Conservatives or concreted over by Labour.\n“If Labour are given a blank cheque, Keir Starmer has made clear his assault on the Green Belt will happen within days of their election – stripping local people in Hazel Grove Constituency their say over where houses are built in our area.\n“We must not surrender our Green Belt to Labour, only the Conservatives will build the right homes in the right places and help families onto the housing ladder with tax cuts on your first home.\n“A vote for anyone other than the Conservatives here in Hazel Grove Constituency will risk giving Keir Starmer a supermajority.\n“The only way to protect our green spaces is to vote Paul Athans on 4th July.”",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_my-plan-update-tackling-crime-and-anti-social-behaviour/content_18.html": "Hazel Grove residents will benefit from a multi-million-pound funding boost for the police.\nIn total Greater Manchester is set to get £813.3 million, an increase of £54.1 million on last year.\nThe funding is part of a total of £843 million to better protect the public. Additional funding will help make sure that crime is effectively tackled by the police and people are kept safe in Hazel Grove Constituency.\nWelcoming the news, Paul Athans, the Conservative Prospective Parliamentary Candidate for Hazel Grove, said:\n“This additional funding for our police is excellent news for Hazel Grove and alongside the 1,280 new police officers in Greater Manchester, will make our streets safer and help cut crime.\n“The Conservatives are taking a tough stance on all crime and delivering the long-term decisions needed for a brighter future.”\nCommenting, Home Secretary James Cleverly said:\n“Our communities deserve a well-funded and equipped force, dedicated to making our country safer.\n“Progress has been made, with overall crime down and 136,000 violent offences prevented since 2019, but we will continue to invest in policing.\n“That is why we are putting up to £843 million more into keeping our streets safe, so that every officer and community has what they need to cut crime, protect the public and build confidence in policing.”",
  "https_www_paulathans_uk_/https_www_paulathans_uk_events_feed/content_22.html": null,
  "https_www_paulathans_uk_/https_www_paulathans_uk/content_1.html": "More money for district centres More affordable homes Latest News Introducing Paul Athans Dear Resident, I am honoured and delighted to be selected as the… Paul Athans calls for full investigation into Lib Dem opponent's 'derogatory slur' Conservative Parliamentary Candidate Paul Athans has called for a full… Hazel Grove could be hit by Labour plans to concrete over the Green Belt Paul Athans warns against giving Labour a blank cheque to carry out their… Improving local transport Tackling crime and antisocial behaviour Find me on Facebook Better access to healthcare Protecting our environment Find me on X\nPaul Athans calls for full investigation into Lib Dem opponent's 'derogatory slur' Conservative Parliamentary Candidate Paul Athans has called for a full…\nHazel Grove could be hit by Labour plans to concrete over the Green Belt Paul Athans warns against giving Labour a blank cheque to carry out their…",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_marple-leisure-hub-success-update/content_19.html": "Paul Athans says \"I am really pleased the council has taken onboard the responses from local people and community groups. The proposed new layout is a great improvement.\"\n\"I want to once again thank the government for the £20 million investment for this hub. I believe passionately in levelling up and this project is exactly the sort of district centre investment that we need.\"\nAs part of this process between 29 February to 3 March 2024 Marple Library will be temporarily closed to the public to allow for a ground investigation survey to take place. The library will re-open as usual on the 4 March 2024.\nFurther information Council News page\nFurther Information Council Consultation update",
  "https_www_paulathans_uk_/https_www_paulathans_uk_campaigns_more-affordable-homes/content_6.html": "Our area needs more affordable homes. We need to maximise the use of brownfield sites and prioritise building in empty commercial units.\nAs your MP, I will work with Stockport Council to put rocket boosters under schemes like that at Melford Road in Hazel Grove and conversion of disused mills such as the one in Compstall.\nI want to help our young people onto the housing ladder locally whilst preserving the green spaces that define our community.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_about-rss/content_20.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_campaigns_improving-local-transport/content_3.html": "I will fight to deliver the A6-M60 Bypass to relieve congestion in our constituency.\nMany Hazel Grove constituency residents have to live with stationary traffic outside their homes in the rush hour. For decades the council has allowed the building of large housing estates without the associated necessary transport infrastructure and, what is worse, is no longer pursuing the by-pass despite the strong business case. I want people to spend less time sitting in traffic and reduce the pollution this causes for local residents.\nI will also work to secure better public transport links including the metrolink to Rose Hill, Marple, and Romiley and improved bus services across our area.\nImproved transport links will boost the local economy and speed up the commute to work for many residents.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_campaigns_better-access-healthcare/content_16.html": "We are delivering our fantastic new Emergency Care Campus at Stepping Hill Hospital but need to do much more.\nI will work hard to improve access to GPs and NHS Dentists and to make more treatments available from pharmacists.\nI want to get patients with urgent needs same-day access and end the 8am rush for appointments with ring back and online booking.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_paul-athans-welcomes-conservatives-clear-plan-and-bold-action-end-labours-war-motorists/content_9.html": "-\nSince 2010 the Conservative Government has backed drivers by freezing fuel duty and spending billions improving roads – but Labour politicians’ imposition of 20mph speed limits and ULEZ expansion highlights the threats motorists face.\n-\nThat is why the Conservatives will introduce a Backing Drivers Bill – enshrining in law that a Conservative government will not introduce pay per mile road taxes and will ban mayors and local councils from doing so, reversing Labour’s punitive ULEZ expansion in London and ensuring low traffic neighbourhoods and 20mph zones have local support.\n-\nThe choice at this election is clear: the Conservatives who have a clear plan and will take bold action to back drivers – or Labour, who would penalise motorists and take us back to square one.\nPaul Athans has welcomed bold action from the Conservatives to stop pay-per-mile road taxes, rule out blanket Low Traffic Neighbourhoods and 20mph zones and reverse Labour’s unfair ULEZ expansion in London as part of their clear plan to back drivers in Hazel Grove Constituency.\nThrough a ‘Backing Drivers Bill’ to be introduced in the first parliamentary session, the Conservatives will build on last autumn’s Plan for Drivers with a package of bold action which will protect drivers from the draconian policies of local Labour politicians.\nMeasures include preventing Labour introducing their punitive Clean Air Zone around Greater Manchester, which would hit hard working people’s pockets.\nThe Conservatives will rule out blanket Low Traffic Neighbourhoods and 20mph zones which have been so damaging to businesses. Under these plans, local people will be newly empowered with any new schemes subject to a local referendum and a right to challenge existing schemes.\nThe Bill will also make sure that pay-per-mile road taxes, which are currently being explored by local Labour politicians, can never be introduced.\nThis builds on the Conservatives’ strong track record of backing drivers, including freezing fuel duty for 14 years in a row, publishing the milestone Plan for Drivers last year, and committing to invest £8.3 billion of HS2 savings to repair roads and fix potholes.\nOnly the Conservatives will take the bold action needed to end Labour’s war on motorists, delivering a clear plan to support people’s every day journeys and build a brighter future.\nPaul Athans said:\nThe Conservatives have a strong track record of backing motorists, but Labour are desperate to tax people off the roads, from the unfair ULEZ expansion in London to blanket 20mph zones in Wales, and the flip-flopping over the Greater Manchester Clean Air Zone.\nFor many people in Hazel Grove Constituency the car is an essential mode of transport, which is why I welcome the Backing Drivers Bill from the Conservatives which will reverse Labour’s anti-motorist trend to support people with their every day journeys.\nThe choice is clear: Rishi Sunak and the Conservatives, who are on the side of motorists, or Labour who will continue their war on drivers if elected, taking us back to square one.”\nRishi Sunak, Prime Minister, said:\nWe are the party on the side of drivers. That’s why we have a clear plan to keep motoring costs under control and ensure people have the freedom to drive as they need to lead their daily lives.\nWe will empower drivers and local residents to challenge aggressive and punitive traffic-inducing measures, like low traffic neighbourhoods that were imposed without local consent.\nThat’s the clear choice in this election – between Labour who have launched a war on drivers in London and Wales, and our clear plan to give drivers the freedom they need to build a secure future for themselves and their children.”\nMark Harper, Transport Secretary, said:\nWe will continue to build on our clear plan for drivers and make sure they are supported in the face of Labour politicians desperate to tax them off the roads.\nWe will reverse Sadiq Khan’s unfair ULEZ expansion and rule out any blanket 20 mile an hour zones because we are on drivers’ side. And we will rule out any pay-per-mile road tax to keep costs for drivers down.\nThere’s a clear choice at this election – Labour who will continue to penalise drivers or the Conservatives who will back drivers.”",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_paul-athans-calls-full-investigation-lib-dem-opponents-derogatory-slur/content_8.html": "Conservative Parliamentary Candidate Paul Athans has called for a full investigation by Stockport Metropolitan Borough Council into his Liberal Democrat opponent's use of a derogatory slur.\nPaul said:\nCllr. Smart was caught on a doorbell camera by a resident of Hazel Grove Constituency, making a derogatory ‘joke’ about Liverpool to a Liverpudlian voter whilst out canvassing. The full details of the incident can be found in numerous news outlet reports\nI have been contacted by outraged residents who, like me, feel that Cllr. Smart’s comments were totally unacceptable. One Romiley resident described her comments as “grossly offensive”.\nThese comments came to light at the same time as a leaflet was being distributed by Cllr. Smart attacking me for being from Liverpool. Not only is this hypocritical (her website suggests she is from London[1]) but it also demonstrates a very negative and nasty pattern of behaviour.\nIt is public knowledge that you are from Liverpool, and I am sure there are many employees of SMBC that are also from Liverpool. I am concerned how Cllr. Smart expects to have a working relationship with the Chief Executive of the Council when she holds such anti-Liverpool views.\nI believe that Cllr. Smart’s actions are a clear breach of the SMBC Code of Conduct for Councillors, specifically CP1 – 2.8 Respect for Others, and formally request that this incident is investigated and / or referred to the Standards Committee.\nJust over eight years ago, Jo Cox MP was tragically murdered. The Jo Cox Foundation produced the Civility Pledge (Use a civil and constructive tone in debate. Act with integrity, honesty and compassion. Behave respectfully towards others, including those I disagree with). It is a shame that Cllr. Smart does not extend that civility towards me or the people of Liverpool.\"\n[1] https://web.archive.org/web/20110929165109/http://lisasmart.org.uk/\nThe incident has been reported by numerous news outlets including:\n- The Daily Mail[1]\n- The Daily Telegraph[2]\n- The Manchester Evening News[3]\n- The Liverpool Echo[4]\n- BBC News[5]\n- Stockport Nub News[6]\nThe full letter can be found below.\n[1] https://www.dailymail.co.uk/news/article-13568491/Fury-Liberal-Democrat-hopeful-MP-caught-doorbell-camera-making-anti-Liverpool-slur-canvassing.html\n[2] https://www.telegraph.co.uk/politics/2024/06/26/lib-dem-jokes-with-liverpudlian-about-nicking-stuff/\n[3] https://www.manchestereveningnews.co.uk/news/greater-manchester-news/lib-dems-hazel-grove-candidate-29427176\n[4] https://www.liverpoolecho.co.uk/news/liverpool-news/candidate-accused-making-derogatory-jokes-29426402\n[5] https://www.bbc.co.uk/news/articles/cd11xprd6ryo?xtor=AL-73-%5Bpartner%5D-%5BBBC+England%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-\n[6] https://stockport.nub.news/news/general-election-2024/lib-dems-hazel-grove-candidate-offers-fulsome-apology-after-anti-liverpool-comments-233517",
  "https_www_paulathans_uk_/https_www_paulathans_uk_campaigns_more-money-district-centres/content_17.html": "Your local Conservatives were instrumental in securing the new Marple Leisure Hub and I want to work with the Government to ensure Hazel Grove is at the front of the queue for the next round of Levelling Up Funding.\nI want to improve our district centres and empower local businesses to grow and thrive.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_contact/content_2.html": "Skip to main content\nMain navigation\nHome\nAbout Paul\nNews\nMy Plan\nCampaigns\nGet Involved\nContact\nContact\nLeave this field blank\nCampaign Office\n119b Church Lane, Marple, Stockport SK6 7AY\n0161 427 6932\n[email protected]\nPaul on Facebook\nPaul on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_boost-pharmacy-first-scheme-plans-deliver-more-health-services-across-hazel-grove-speed-access/content_14.html": "Boost for Pharmacy First scheme with plans to deliver more health services across Hazel Grove constituency to speed up access to care.\nPatients across Hazel Grove Constituency will be able to access vital care when they need it more quickly under new plans unveiled by the Conservatives.\nThe plans will see more out-of-hospital GP, pharmacy, and community diagnostic centres with a pledge to build 100 new GP surgeries and modernise 150 more, focusing on the areas of greatest need, particularly those with plans in place for new housing developments.\nSo far, the existing Pharmacy First scheme, which allows patients to get treatment from their local pharmacy without needing to visit a GP, has been a great success with 98 per cent of pharmacies signed up. Building on this success, the Conservatives have pledged to expand Pharmacy First to allow for treatment of other conditions, including offering women more contraceptive options and menopause support, and providing treatment for acne and chest infections – freeing up around 20 million GP appointments in total.\nThere are also plans in place to build 50 new community diagnostic centres, on top of the 160 already built this Parliament, to deliver a further 2.5 million checks and diagnostic tests a year once scaled.\nWelcoming the news, Paul Athans, the Conservative General Election candidate for Hazel Grove said:\nThe NHS is precious to me and to everyone in our area. The pandemic put huge pressure on our NHS services here in Hazel Grove and as we continue with recovery, it is essential that patients receive the care they need, quickly and easily, which is why I was delighted about Pharmacy First.\nBuilding on this great success, the Conservatives have announced a clear plan to deliver even more out-of-hospital services across the country by expanding Pharmacy First, build or modernise GP surgeries and invest in new Community Diagnostic Centres.\nWe are sticking with the plan to improve access to care and cut NHS waiting lists so that everyone can access the treatment they need, when they need it.”\nHealth Secretary, Victoria Atkins, said:\nPharmacies, GPs and Community Diagnostic Centres are the backbone of our NHS. Because of bold action we have taken, they are more accessible in more places for more people.\nI know just how important it is for people to have access to health services and treatment close to home - and Pharmacy First and our hundreds of new Community Diagnostic Centres have been a real success story so far. But we must do more.\nOur clear plan will continue to enable our brilliant pharmacists, GPs and CDCs to do what they do best: serving their local community and boosting capacity in our NHS. We will make the NHS faster, simpler and fairer for all.”",
  "https_www_paulathans_uk_/https_www_paulathans_uk_campaigns_tackling-crime-and-antisocial-behaviour/content_23.html": "Together we have delivered 1,280 new police officers on the streets of Greater Manchester.\nI want to make sure we see our fair share of these new officers on the streets in our constituency, in Hazel Grove, Marple, Offerton, Romiley, Manor and Bredbury\nAs your MP, I will work with Greater Manchester Police to tackle burglary and clamp down on anti-social behaviour so that local residents feel safe in their communities.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_category_Newsletters/content_21.html": "Merry Christmas and Happy New Year from Paul Athans 24th December 2023 I just wanted to take a moment of your time to thank you for all we have achieved together in 2023. Government funding for the Marple Community Hub was secured... Newsletters",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news/content_7.html": "Introducing Paul Athans Monday, 18 September, 2023 Dear Resident, I am honoured and delighted to be selected as the Conservative candidate for Hazel Grove. I know people living and working here want an MP to get on with the job and deliver for them on the Government’s plans. The people’s priorities in Hazel Grove are the Government’s priorities, and Rishi Sunak has my support as he strives to halve inflation, grow the economy, reduce debt, cut... Local News\nPaul Athans calls for full investigation into Lib Dem opponent's 'derogatory slur' 3rd July 2024 Conservative Parliamentary Candidate Paul Athans has called for a full investigation by Stockport Metropolitan Borough Council into his Liberal Democrat... Local News\nHazel Grove could be hit by Labour plans to concrete over the Green Belt 2nd July 2024 Paul Athans warns against giving Labour a blank cheque to carry out their plans to concrete over the Green Belt in Hazel Grove Constituency – ruining precious... Local News\nUse your postal vote to vote for Paul Athans 21st June 2024 Use your postal vote to vote for Paul Athans Today Postal Votes are starting to land on doormats, if you want an MP who's local, who puts integrity above... Local News\nIt was an honour to be invited onto BBC Politics North West this morning. 16th June 2024 It was an honour to be invited onto BBC Politics North West this morning. I welcomed the opportunity to talk about what Conservatives are delivering for our... Local News\nConservative Party Manifesto: a clear plan taking bold action to deliver a secure future for Hazel Grove Constituency 11th June 2024 The UK has faced unprecedented challenges in recent years caused by the pandemic and Putin’s illegal invasion of Ukraine. By sticking with the plan, the... Local News\nConservatives to boost local policing with 8,000 new fully warranted officers 10th June 2024 Conservatives to boost local policing with 8,000 new fully warranted officers Conservatives will recruit 8,000 new fully warranted police officers as part of a... Local News\nPaul Athans welcomes Conservatives’ clear plan and bold action to end Labour’s war on motorists 8th June 2024 Since 2010 the Conservative Government has backed drivers by freezing fuel duty and spending billions improving roads – but Labour politicians’ imposition of... Local News\nNew plan for veterans under the Conservatives 6th June 2024 New plan for veterans under the Conservatives New Veterans Bill to enshrine rights Veterans’ railcard cost cut by almost a third in line with armed forces’... Local News\nBoost for Pharmacy First scheme with plans to deliver more health services across Hazel Grove to speed up access to care. 4th June 2024 Boost for Pharmacy First scheme with plans to deliver more health services across Hazel Grove constituency to speed up access to care. Patients across Hazel... Local News",
  "https_www_paulathans_uk_/https_www_paulathans_uk_privacy/content_13.html": "This document outlines how Paul Athans processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Paul Athans\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Paul Athans.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Paul Athans, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Paul Athans via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_paulathans_uk_/https_www_paulathans_uk_myplan/content_15.html": "Hazel Grove residents will benefit from a multi-million-pound funding boost for the police.\nIn total Greater Manchester is set to get £813.3 million, an increase of £54.1 million on last year.\nThe funding is part of a total of £843 million to better protect the public.\nPeople in Hazel Grove constituency are set to benefit from a national £20m Government funding boost for swimming pools, with £165,324 set to improve the facilities at Life Leisure Romiley.\nThe investment in swimming pools and leisure facilities across England means that 196 centres in 1\nYour local Conservatives were instrumental in securing the new Marple Leisure Hub and I want to work with the Government to ensure Hazel Grove is at the front of the queue for the next round of Levelling Up Funding.\nI want to improve our district centres and empower local businesses to grow a\nI will fight to deliver the A6-M60 Bypass to relieve congestion in our constituency.\nMany Hazel Grove constituency residents have to live with stationary traffic outside their homes in the rush hour.\nWe are delivering our fantastic new Emergency Care Campus at Stepping Hill Hospital but need to do much more.\nI will work hard to improve access to GPs and NHS Dentists and to make more treatments available from pharmacists.\nI want to get patients with urgent needs same-day access and end the 8am\nTogether we have delivered 1,280 new police officers on the streets of Greater Manchester.\nI want to make sure we see our fair share of these new officers on the streets in our constituency, in Hazel Grove, Marple, Offerton, Romiley, Manor and Bredbury\nAs your MP, I will work with Greater Manchest",
  "https_www_paulathans_uk_/https_www_paulathans_uk_campaigns_help-cut-crime-across-hazel-grove-constituency/content_24.html": "We’ve recruited 1,280 new police for Greater Manchester. What do you want them to focus on?\nWhen this government was elected, we promised to recruit 20,000 extra police officers for the country.\nThanks to the support of people like you, we’ve now recruited every single one — including an extra 1,280 new police for Greater Manchester. And we’re working with the police to make sure that every burglary and theft is investigated.\nSo we’re making progress. But there’s more to do. And it’s important that your next MP is ready to get to work on day one.\nI’ll be standing to be your next Conservative MP. And I’m keen to work with you so that we can hit the ground running in tackling your priorities.\nThat’s why I’m asking you to share your priorities for our new police officers.\nWhile you should still contact the current MP for official matters, I want to start working with you now on your priorities.\nOur area has been let down by the Liberal Democrat council. So the sooner we get to work, the bigger an impact we’ll have.\nI’ll go through every survey response with my team — and I’ll discuss your answers at my next meeting with the Chief Superintendent.\nIt takes just sixty seconds to fill in the survey below.\nSo why not take a moment to help cut crime in Hazel Grove constituency.\nShare your priorities for our new police officers today.\nYours sincerely,",
  "https_www_paulathans_uk_/https_www_paulathans_uk_campaigns_protecting-our-environment/content_4.html": "Sewage discharges should only happen in truly exceptional weather events. I will fight for tougher fines for rule breaking water companies which will be invested in the ground improvements to pollution sources such as storm overflows and increased permit charges to fund more Environment Agency inspections of Water Companies.\nAs your MP, I want to secure further funding to reduce the risk of flooding which has blighted the lives of residents in Hazel Grove in recent years.\nI am also passionately committed to investing more in renewable and nuclear energy sources to reduce CO2 and NOx emissions and provide energy security.",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_merry-christmas-and-happy-new-year-paul-athans/content_25.html": "I just wanted to take a moment of your time to thank you for all we have achieved together in 2023.\nGovernment funding for the Marple Community Hub was secured, the construction of Stepping Hill’s new Urgent Care Unit is well under way, and we will soon all feel the benefits of the huge reduction in inflation that has been achieved. I am working tirelessly with our council candidates to ensure that your concerns are heard and I am liaising closely with William Wragg MP to keep Hazel Grove’s voice raised nationally. Your concerns are my concerns and I will continue to champion our constituency wherever I can.\nMerry Christmas and a Happy New Year to you all. I look forward to working for you in 2024.\nPaul Athans\nProspective Parliamentary Candidate",
  "https_www_paulathans_uk_/https_www_paulathans_uk_news_category_Opinions/content_10.html": "Paul Athans objects to the felling of trees at Poynton Pool 10th January 2024 Numerous Hazel Grove residents contacted Paul voicing their opposition to the Cheshire East Council Planning Application 23/4252M, which relates to the Spillway... Opinions"
}