{
  "https_www_mayaellis_co_uk/https_www_mayaellis_co_uk/content_1.html": "My Story\nHi, I’m Maya Ellis and I’m your Ribble Valley MP.\nI believe Ribble Valley, just like our country, is ready for change and a fresh start, with a local MP focussed on helping young people, families, and all our varied communities to feel safe and supported, and to live your best life.\nI have grown up in the Ribble Valley and now live here with my husband and two small children, so I know our communities inside out.\nMy recent career has been working in local government, speaking regularly with civil servants in Westminster to ensure much needed funding lands in this area, so I understand how our government works and how to make them work better for us locally.\nI love our area, from my gym in Walton-le-Dale to family days across the Ribble Valley, and I will fight to ensure that all our residents from Fulwood to Mellor, and from Bamber Bridge to West Bradford, all feel represented in a future Labour government.\nI care deeply for the people here and I know we can do far better for this area with me as the present and determined Labour MP, Ribble Valley so desperately needs.\nAbout Me\nI Understand Public Services\nI’ve spent 8 years working in local government, working with central government and private business to secure investment for our area. I make sure that local people benefit through increased jobs, funding and improvement in local services.\nI understand this place\nI grew up in Ribchester among farming communities, and went to Ribchester Primary School, and Longridge High School. I live and work here now with my family, and I’m on the Parish Council. Royal Preston Hospital has seen my family through births, deaths and many things between.\nI understand working families\nI am a working mum to two young children. Like many of us I have to juggle long working days with a school day finishing at 3pm. I love my job but come home to a second shift of making a good home life for my family. I feel the pressures of finding affordable and available childcare.\nI understand business\nI started my career in commercial roles in the media in London. Much of my day job has been supporting local companies across the area to innovate and grow. My husband runs a manufacturing technology small business. I see the work that goes into supporting staff through the lack of consistency from this government during Brexit and Covid.\nI understand communities\nMy parents were community activists and tirelessly supported and raised money for community groups. I believe society is better if we all contribute to where we live. Church is a special part of my life and I’m also a life-long volunteer with the Girl Guides. I sat on their national board for 6 years, as one of their youngest national trustees.\nI understand commitment\nThe Ribble Valley deserves someone who lives here, who knows the area, and who is committed to being here long term, to deliver for our residents. I have a vision for this place because I have been dreaming up opportunities for this area since I was little, and I plan to be here long term to see them out.\nMy Vision for Ribble Valley\nFor working people\nWe will deliver Labour’s New Deal for Working People to ensure those in work are truly valued as the engine of this country. I will work hard with government, our unions and employers big and small, to ensure work pays, people are treated well, and that your job is a place you go to, to thrive, not just survive.\nFor families and Health\nWe need affordable childcare and Sure Start type networks to help families manage through the cost of living crisis. I will also work to get the NHS back on its feet to ensure reliable care for both young and old, so the burden isn’t constantly left to families to pick up the devastating pieces.\nFor young people\nOur once brilliant youth provision in this area has been decimated by ongoing funding cuts. I’ll fight to bring back safe, inspiring places for young people to meet, be active, and be creative. I’ll also promote more community cohesion though volunteering to encourage more intergenerational friendships.\nFor housing\nWe must invest in affordable housing to ensure everyone has a safe place to sleep at night. I will argue for adequate roads, schools and health services to support the growing populations in our area. I will ensure that Ribble Valley always has a seat at the table to make sensible plans for long-term development.\nFor investment\nLancashire is getting a new devolutionon deal and we must ensure Ribble Valley benefits from that. Our businesses have huge potential here, but we need to attract more young talent to stay in the area. That also means improving our community and cultural offers in our vibrant towns.\nFor our planet\nFlooding and potholes are increasingly damaging our communities, and globally, world temperatures are rising. To tackle our climate emergency I will hold big business to account for more sustainable operations, improve environmental education so that every person plays their part, and ensure we support our farming communities in their efforts to become more sustainable.\nProud to be Endorsed by\nContact Maya\nWant to get in touch with your Ribble Valley MP? Please drop me an email me directly at: maya.ellis.casework@parliament.uk"
}