{
  "https_www_alangemmell_co_uk_/https_www_alangemmell_co_uk_who-i-am-intro/content_2.html": "I was born and brought up here, my family live here and I live in the constituency too. I did my public service overseas. It’s the privilege of my life to represent the people of Central Ayrshire in Parliament.\nComing from an ordinary working family in Irvine, thanks to great teachers, support from the council and the 1997 Labour Government, I’ve had extraordinary opportunities.\nLike many people in our community, my dad lost his job in the 80s. He then became a council bin-man. My mum started working in factories and ended up joining a local charity advocating for people with mental health issues. Now she has early-onset dementia.\nDamien, my husband, and I married in Ayrshire in 2015. Although we’ve lived in India for much of the time since then, Ayrshire has always been a home for us.\nPromoted by June Neilson on behalf of Alan Gemmell both at Nelson Mandela Cottages, 17 Townhead, Irvine, KA12 0BL.\n© Copyright. All rights reserved.\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations.",
  "https_www_alangemmell_co_uk_/https_www_alangemmell_co_uk/content_1.html": "Thank you to the voters of Central Ayrshire for putting their trust in me and the Scottish Labour Party. We will not let you down.\nI thought representing Britain around the world was the best job I could have had. But representing the families of Central Ayrshire will be the privilege of my life.\nPlease email alan.gemmell.mp@parliament.uk for all constituency matters.\nI was born and brought up in Girdle Toll and Irvine. I did my public service overseas and represented the UK around the world.\nPromoted by June Neilson on behalf of Alan Gemmell both at Nelson Mandela Cottages, 17 Townhead, Irvine, KA12 0BL.\n© Copyright. All rights reserved.\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations."
}