{
  "https_tanushkamarah_com_/https_tanushkamarah_com_events_talkin-bout-a-revolution/content_12.html": "Skip to content\nTanushka Marah\nIndependent Parliamentary candidate for Hove Portslade\nDonate\nHome\nNews\nEvents\nOur People’s Manifesto\nContact Us\nTalkin’ ’bout a Revolution\nPost navigation\nNext:\nFree Community Get Together",
  "https_tanushkamarah_com_/https_tanushkamarah_com_2024_06_06_newsletter-2/content_4.html": "Skip to content\nTanushka Marah\nIndependent Parliamentary candidate for Hove Portslade\nDonate\nHome\nNews\nEvents\nOur People’s Manifesto\nContact Us\nTanushka Marah launches campaign\nPosted on\nJune 6, 2024\nJune 20, 2024\nPost navigation\nPrevious:\nHow you can help Tanushka’s campaign\nNext:\nLet’s mobilise to elect Tanushka Marah In Hove and Portslade",
  "https_tanushkamarah_com_/https_tanushkamarah_com_manifesto/content_3.html": "Help shape the detail of Tanushka’s manifesto\nI am running a community-backed, grassroots-based election campaign, opposing cuts and the privatisation of public services, and advocating for action on the climate emergency. Powered by local people, the campaign supports improved youth services, a fully public NHS, and affordable, secure homes for all to tackle the housing crisis.\nOur campaign stands for common sense policies, supported by the majority of British people but are rejected by the corporate parties. Please see them all here https://tanushkamarah.com/\nThis campaign is an exercise in grassroots democracy. We craft the detail of policies with people in workshops, and with the input and support for the network of campaigns established, to ensure that I am representing residents ideas for a better future for all people in Hove and Portslade.\nThe details are alive and growing, we want to hear YOUR VOICE on how we can campaign for a fairer country. Please come to our community gatherings where we can build this movement from the ground up.\nCollectively I believe the constituents of Hove and Portslade have all the ideas that inform my approach. I hope this continues after the election in a process of continuous conversation and building consensus, listening and formulating solutions together.\nI have committed to 5 pledges described on the first page of the website. As the movement grows, and we hold more assemblies, the detail of the pledges will grow. The following are policies I am standing on that have grown out of the movements for peace, for public services, and real democracy.\nPalestine\nMy recent activism and leadership for Palestine locally is the first reason why I am standing as an Independent Candidate for Parliament.\nI stand for a Free Palestine. Both main parties, Conservative and Labour, refuse to back sanctions and stop selling UK arms to Israel during its genocide in Gaza. The UK’s involvement in Middle East wars, and ever rising military spending, is not making us safer. We need a new foreign policy based on peace and justice.\nAs a British Palestinian, I feel duty bound to demand a ceasefire in Gaza, an end to UK support for Israel’s genocide, ending arms sales to Israel, and an end to the occupation of Palestinian lands. The UK must impose an arms embargo and economic sanctions on Israel until it ceases human rights violations and the illegal occupation. We must also comply with the rulings of the ICC and the ICJ, including enforcing arrest warrants for Israeli leaders. I will continue to campaign and speak up on Israeli apartheid and US-UK complicity until Palestine achieves self determination and freedom.\nThe NHS and health care – watch our manifesto conversation here https://www.youtube.com/watch?v=QQ_JET8RstQ&t=7s\nHealth care, including mental health care, is by far the most popular subject that constituents have written to me about. It is very clear that GP services, the NHS, mental health services and the social care system need a huge amount of investment. Healthcare workers and social care workers are the bedrock of the system and need a substantial pay rise.\nWe are losing thousands of skilled medical staff to other countries and this must be reversed by a recruitment drive and pay uplift.\nI support a National Care Service to replace our privatised, profit based social care system which is failing our old people, vulnerable and those with special needs.\nOne of my 5 pledges is that I stand for taxing the super wealthy and corporations, which involves cracking down on tax avoidance and offshore accounts, and putting an end to privatisation, to save our public services.\nThe NHS is being sold off by the Conservatives, and Labour supports this disastrous policy which has caused the worst ever crisis in our healthcare system. We need to end privatisation, end offshore tax avoidance, introduce a wealth tax, and restore pay levels for all our public sector workers.\nRestore NHS funding through taxing the super rich and offshore billions\n• Catch up funding to make up for Tory underfunding and put it in line with other European countries.\n• Fair and improved pay for all NHS staff\n• Invest urgently in mental health services and work to end the stigma of mental illness\nEnd privatisation of NHS\n• Bring outsourced contracts back in house\n• End the massive profiteering of private health care companies.\nIntegrating Health and Social Care\n• Overhaul the privatised social care system and create a non-profit National Care Service.\n• Refocus our NHS on clinical, heath and care needs rather profit.\nInvest more in Public Health and reduce health inequalities.\n• Stop individualising and victim blaming, acknowledging the social causes of ill health, such as poor housing, poverty, food insecurity.\nOn Tuesday 18th June we held a public meeting about the NHS and heard from a retired nurse, GP, a midwife and a psychiatrist, sharing hard data about the degradation of our NHS, and then personal stories of patients in their care, and the impact on workers. Here is that meeting: . https://www.youtube.com/watch?v=QQ_JET8RstQ&t=7s\nClimate Justice – Biodiversity – Access to our land and rivers\nWe are watching in real time as heatwaves cause heat stress deaths in Greece (Michael Moseley, other tourists out on hikes) and hundreds dying during the Islamic Haj in Saudi Arabia. This is the new reality that is creeping up on us, along with deadly floods and fires. Floods across the world have made millions homeless, and crops are failing due to drought and flood combined. This is the hard evidence that scientists and meteorologists show is made many times more likely by accumulated carbon emissions, which are still rising as global fossil fuel output increases each year.\nAs a country we must act decisively to reduce emissions with practical policies such as insulating all homes and investing in an affordable renewable energy sector through publicly owned energy companies, investing in public transport, creating new industries that will bring thousands of well paid jobs across the country.\nVAT should be completely abolished on renewable energy and the manufacture, installation and maintenance of renewable energy equipment. Fuel duty should be abolished on bio-diesel and other green internal combustion engine fuels.\nWe need our water back in public hands, and to end the sewage and chemical scandal polluting our rivers and seas. In this constituency, shocking figures from Surfers Against Sewage reported in Feb-Mar 2024 safe to swim days in Hove / Southwick were as low as 3.6 days in 30 days.\nWe must work to prevent overfishing whilst supporting local fishing communities. We need increased support and better laws to protect our ancient trees and woodlands.\nI stand with the environmental movement calling to stop the loss of biodiversity, to work towards the goal of rewilding 30% of our land, for nature friendly farming, support to expand sustainable and nature-based jobs and businesses, empower communities to lead on initiatives and ending all new gas and oil contracts for the North Sea.\nClimate Justice means cancelling debts in the poorest countries, challenging destructive mining in the Global South, and restoring land, air, water and people’s livelihoods around the world. Real zero is the only way to prevent a global catastrophe, rather than a corporate-led net zero.\nThis land is our land\nThe UK’s land ownership system remains feudal with ownership of huge estates dating back to the time of William the Conqueror and Henry VIII. We need to open up our land and rivers for people to enjoy our natural environment, with right to roam across the country. I support the proposed Access to Nature Bill, and the Right to Roam.\nElectoral reform\nOnly via Proportional Representation (PR) can independent voices be heard in Parliament, and all votes given equal weight. The current first past the post system gives rise to a two party state – Tory or Labour – but most of our votes are not represented in parliament. The UK is the only country – apart from authoritarian Belarus – still using this antidemocratic voting system\nThere is no place for hereditary peers in the 21st Century, or the stuffing of the House of Lords with political appointees. We need a second house entirely independent of Government – and which represents the British people by gender, income, region, ethnicity and age. I believe that a People’s House made up of normal people chosen like a jury, rather than the House of Lords, is the best second house for a truly democratic society.\nHousing for all\nI support building more secure, affordable council homes, secure long-term tenancies for renters, taxes on empty homes, and a cap on holiday lets, including Airbnb. The Tories’ right to buy policy must be abolished, so social housing stock is not sold to landlords. I also support rent controls – including a freeze on most rents – to stop excessive rent rises. No-fault evictions must be banned and notice periods extended for end of tenancies. First time buyers and families must be given priority in all new housing developments, sales for second homes restricted, and overseas sales of private homes or flats for investment should be banned.\nPublic ownership\nPrivatisation – including mail, water, railways and energy – has failed. We need to bring all these essential services back into democratic public ownership. We need affordable rail fares to encourage more use of the train network and get people out of their cars. The privatisation of Royal Mail has been a disaster with the private management seeking to undermine the universal service, and hike prices. The water companies have taken £72bn plus in profits, failed to invest, and now want to hike water prices to solve the sewage crisis they caused. We need to create publicly owned energy suppliers to drive the transition from fossil fuels to renewable energy.\nTransport and rail\nWe face a climate emergency, but most UK journeys are still by car. Our railway system is inefficient and unreliable, the fares are the dearest in Europe. We need a unified rail system under public ownership that runs well, and is a cheaper, more reliable option than the car. This is the way to get people out of their cars and onto trains. Fairs must be simplified and reduced, with free travel for all children under 18. A £50 off-peak monthly ticket for all normal rail services should be introduced, as successfully piloted in Germany. Off-peak UK return fairs should be capped at £100 for any journey.\nChild poverty\n4.3 million children (30% of all UK children) were in poverty in 2023, up from 3.6m in 2011. 69% of poor children live in working families. Nearly half of children in families with 3 or more children are in poverty. This can be solved. Lifting the 2-child benefit cap would take 250,000 children out of poverty a year. Perversely, Labour is refusing to do this. Tory cuts closed 1,243 youth clubs since 2010. Just 581 centres were left by March 2023. These youth clubs must be reopened. The Tories also slashed youth mental health services to almost nothing. They must be rebuilt across the country. And by building and purchasing more social housing, we can give children a secure start in life.\nDisability benefits, and food banks\nHundreds – “probably thousands” – of disabled people have died avoidable deaths because of failures of the disability benefits system, according to an investigation by the Disability News Service. I am committed to tackling hardship and will help work to ensure our social security system protects people from needing a food bank to survive – with an end to punitive PIP, and Universal Credit requirements. Our social security system should prevent people from needing to use a food bank when times get tough. Instead, it is imposing harsh conditions, and food banks are being stretched to breaking point due to unprecedented levels of need.\nArts and culture\nThese are the proposals that came out of our people’s assembly on culture held on 22 June in Hove. This is our Arts & Culture draft policy; it is more than that, it is a vision of different kind of society focussed on flourishing instead of economic growth\nARTS\n- Fund holiday activities for all children – youth sailing trusts, theatre, music – 3 weeks each summer.\n- Support community theatre groups.\n- Create community spaces in all neighbourhoods as spaces for non-commercial, grassroots culture.\n- Reduce working week to 4 days so people have time and energy to engage in culture\n- Universal basic income to replace many means-tested benefits – much cheaper to administer and far less demeaning\n- Create funded arts apprentices for low income young people\n- Treat the arts as an essential part of British economy and national life\n- Make high arts and culture accessible through compulsory affordable ticketing for all events, eg ballet, opera, theatre.\nEDUCATION\n- Include music as part of compulsory school curriculum. Fund music, art and drama in school timetable, not as extracurriculars. Ensure working class students have access to high quality arts and creative subjects in schools.\n- Make creative GCSEs compulsory as well as STEM. Arts and sciences to have parity in education\n- Decolonise the curriculum and education system. Teach the British Empire and colonialism objectively and critically.\n- Teach politics from the age of 10 – understanding key political movements and history eg socialism, birth of democracy, feminism, gay rights, black power movements, anti-colonial movements, slavery.\n- Teach critical thinking and philosophy to all students\n- Libraries – offer free music lessons, drama, art.\n- Arts – diversity within literature, arts and humanities, with teaching of global cultures.\n- Stop measure based targets for success\n- Adult education with everyone allowed to take one-year, and short term funded sabbaticals during working life.\n- End academisation – bring schools back into local authority control\n- Universities – abolish fees and restore direct funding of universities and education grants. Cap student rents. End private control of universities.\n- Ensure full access to education for people with special educational needs, neurodiversity, and disabilities\n- Recognition of play as a necessary means for learning\n- Match UK budget for the British Council and the Arts to the defence budget (2.5% of GDP)\nSupport Refugees & Asylum Seekers\nThe asylum and immigration system in the UK is systemically hostile and racist. If i become the MP for Portslade & Hove, I will challenge the politics of hate and fear that is being stoked in our country and as I believe ‘the true measure of any society can be found in how it treats its most vulnerable members’. We have a lot of work to do to change the current hostile narratives and culture that permeates our society.\nIf elected, I would work closely with UK refugee agencies to end the discriminatory culture vulnerable refugees and asylum people face. I support the work of refugee agencies such as Refugee Action, the Joint Council for the Welfare of Immigrants and The Refugee Council ‘to give\nrefugees and people seeking asylum a fair hearing in the UK, no matter how they arrive, in keeping with commitments to international law’.\nAs such, I support the Refugee Council in its call for a fair and humane asylum system in the UK A Fair and Humane Asylum System – Refugee Council.\nI say No Rwanda, no offshoring – the Rwanda plan won’t work – it is inflicting misery on refugees affected by it.\nSafe routes – the only way to save lives and stop Channel crossings is to offer safe routes for refugees to claim asylum in the UK. Safe passage worked for Ukrainians fleeing war – I support offering safe routes to other refugees fleeing similar horrors from countries such as Afghanistan, Sudan and Eritrea.\nProcess the claims – not processing asylum claims resulted in a record backlog and saw the cost of asylum accommodation soar to £8 million per day. I support investing in asylum decision-making, reduce accommodation costs and give refugees their lives back\nCommunities not camps and barges – refugees should be housed in communities, not camps and barges like the Bibby Stockholm. I pledge to close down military camps and barges.\nRight to work and move-on support, not homelessness – the ban on people seeking asylum being allowed to work has been counterproductive. The ban, coupled with a 28 day move-on / eviction period that is out of sync with the rights of every other citizen set out in the Homelessness Act, has led to a sharp rise in homelessness amongst people granted refugee status. I want the UK to offer support, not homelessness, to new refugees in the UK.\nI support the idea to pilot refugee visas which people seeking asylum could apply for at embassies and other official sites around the world, to enable safe routes to the UK\nWe should make it easier for families separated by war and violence to reunite by expanding existing schemes, including by letting separated refugee children be joined by their closest family members.\nWe need to expand the UK’s resettlement schemes, establishing a target for those resettled under a single scheme and ensuring people are appropriately housed in the community with support to integrate. The UK should also flexibly respond to global emergencies and provide protection through emergency visa schemes and expanded family reunion routes.\nWe should collaborate with the French Government and other EU countries to make it safer for people to seek protection across the continent and to further crack down on people smugglers.",
  "https_tanushkamarah_com_/https_tanushkamarah_com_2024_05_29_newsletter-1/content_8.html": "Skip to content\nTanushka Marah\nIndependent Parliamentary candidate for Hove Portslade\nDonate\nHome\nNews\nEvents\nOur People’s Manifesto\nContact Us\nHow you can help Tanushka’s campaign\nPosted on\nMay 29, 2024\nJune 20, 2024\nPost navigation\nNext:\nTanushka Marah launches campaign",
  "https_tanushkamarah_com_/https_tanushkamarah_com_2024_06_13_newsletter-3/content_10.html": "Skip to content\nTanushka Marah\nIndependent Parliamentary candidate for Hove Portslade\nDonate\nHome\nNews\nEvents\nOur People’s Manifesto\nContact Us\nLet’s mobilise to elect Tanushka Marah In Hove and Portslade\nPosted on\nJune 13, 2024\nJune 20, 2024\nPost navigation\nPrevious:\nTanushka Marah launches campaign\nNext:\nHelp to Build Tanushka’s Manifesto",
  "https_tanushkamarah_com_/https_tanushkamarah_com_2024_06_20_newsletter-3-2/content_7.html": "Arts and culture\nThese are the proposals that came out of our people’s assembly on culture held on 22 one in Hove\nARTS\nFund holiday activities for all children – youth sailing trusts, theatre, music – 3 weeks each summer\nSupport community theatre groups\nCreate community spaces in all neighbourhoods as spaces for non-commercial, grassroots culture\nReduce working week to 4 days so people have time and energy to engage in culture\nUniversal basic income to replace many means tested benefits – much cheaper to administer and far less demeaning\nCreate funded arts apprentices for low income young people\nTreat the arts as an essential part of British economy and national life\nMake high arts and culture accessible through compulsory affordable ticketing for all events, eg ballet, opera, theatre.\nEDUCATION\nInclude music as part of compulsory school curriculum. Fund music, art and drama in school timetable, not as extracurricula.\nMake creative GCSEs compulsory as well as STEM. Arts and sciences to have parity in education\nDecolonise the curriculum and education system. Teach the British Empire and colonialism objectively and critically.\nTeach politics from the age of 10 – understanding key political movements and history eg socialism, birth of democracy, feminism, gay rights, black power movements, anti-colonial movements, slavery.\nTeach critical thinking and philosophy to all students\nLibraries – offer free music lessons, drama, art.\nArts – diversity within literature, arts and humanities, with teaching of global cultures.\nStop measure based targets for success\nAdult education with everyone allowed to take one-year, and short term funded sabbaticals during working life.\nEnd academisation – bring schools back into local authority control\nUniversities – abolish fees and restore direct funding of universities and education grants. Cap student rents. End private control of universities.\nEnsure full access to education for people with special educational needs, neurodiversity, and disabilities\nRecognition of play as a necessary means for learning\nMatch UK budget for the British Council and the Arts to the defence budget (2.5% of GDP)",
  "https_tanushkamarah_com_/https_tanushkamarah_com_events_free-community-get-together/content_9.html": "Skip to content\nTanushka Marah\nIndependent Parliamentary candidate for Hove Portslade\nDonate\nHome\nNews\nEvents\nOur People’s Manifesto\nContact Us\nFree Community Get Together\nPost navigation\nPrevious:\nTalkin’ ’bout a Revolution",
  "https_tanushkamarah_com_/https_tanushkamarah_com_news/content_2.html": "-\nLet’s make history with Tanushka Marah in Hove and Portslade\nIt’s time to say NO to career politicians. It’s time to say NO to the two-party system, with the Tories and Labour mirroring each other. It’s time to say NO to complicity with the genocide in Gaza.\n-\nHelp to Build Tanushka’s Manifesto\nLegendary comedian Alexei Sayle will host the manifesto launch for Tanushka Marah, in what promises to be a thrilling night of comedy, poetry, theatre and people’s assembly. The event, at Brighton, Hove & Sussex sixth form college Bhasvic, on 22 June will feature climate justice activist and author Mikaela Loach, The White Kite Theatre Collection…\n-\nLet’s mobilise to elect Tanushka Marah In Hove and Portslade\n“We don’t need another five years of cuts and privatisation and billions wasted on military spending”, says Tanushka Marah as she spells out the 5 key points her campaign stands on and the reasons why she represents a real alternative for voters in Hove and Portslade.\n-\nTanushka Marah launches campaign\nIn her speech, on Sunday 2nd June, she criticised the incumbent Hove MP Peter Kyle for failing to condemn Israeli war crimes and not backing an end to arms sales to Israel. She explained that the main parties’ support for Israel during its ongoing genocide had led her to stand for the general election…\n-\nHow you can help Tanushka’s campaign\nWant to help build a grassroots movement in Portslade and Hove to bring real change? Feel like there’s no one to vote for? Tanushka Marah is standing as an independent candidate in the next UK General Election to stand up for justice, peace and hope.",
  "https_tanushkamarah_com_/https_tanushkamarah_com_2024_06_27_lets-make-history-with-tanushka-marah-in-hove-and-portslade/content_11.html": "Skip to content\nTanushka Marah\nIndependent Parliamentary candidate for Hove Portslade\nDonate\nHome\nNews\nEvents\nOur People’s Manifesto\nContact Us\nLet’s make history with Tanushka Marah in Hove and Portslade\nPosted on\nJune 27, 2024\nJune 27, 2024\nPost navigation\nPrevious:\nHelp to Build Tanushka’s Manifesto",
  "https_tanushkamarah_com_/https_tanushkamarah_com/content_1.html": "Hello!\nI’m Tanushka Marah and I’m running a grassroots election campaign as an Independent.\nI’m offering a voice against cuts, privatisation and the funding of wars which both Tory and Labour parties support.\nYou don’t have to vote for the corporate parties. There is an alternative!\nI’m here to fight for our public services, for housing justice, climate justice and to stop funding wars\nWhat I stand for – principles and policies\nWhy vote independent? Because we need a real alternative to the two-horse race between Labour and Tory. Because as an independent I am not influenced by big business groups or under a party leader’s control.\nI stand for:\n- A Free Palestine and an End to Funding for Wars Both main parties, Conservative and Labour, refuse to back sanctions and stop selling UK arms to Israel during its genocide in Gaza. The UK’s involvement in Middle East wars, and ever rising military spending, is not making us safer. We need a new foreign policy based on peace and justice.\n- Taxing The Rich to Save Our Public Services The NHS is being sold off by the Conservatives, and Labour supports this disastrous policy which has caused the worst ever crisis in our healthcare system. We need to end privatisation, end corporate tax avoidance, and restore pay levels for all our public sector workers.\n- Housing for Everyone Many in Brighton are paying more in rent or mortgages than they can afford. I stand for secure, affordable council homes, taxes on empty homes, caps on holiday lets, and rent controls.\n- Climate Action We must redirect money away from polluting activities and into public services and action on the climate emergency. We must save our rivers from greedy water companies and renationalise Southern Water.\n- Real Pay Rise For All We are living through a cost of greed crisis. I stand for a repeal of all Tory anti-strike laws, for a £15 minimum wage, repealing hire and fire laws, and workers’ rights from day one of contract.\nThese common sense policies are supported by the majority of British people but are rejected by the corporate parties.\nThe details of our policies are alive and growing, we want to hear YOUR VOICE on how we can campaign for a fairer country. Please come to our community gatherings where we can build this movement from the ground up.",
  "https_tanushkamarah_com_/https_tanushkamarah_com_contact/content_6.html": "Skip to content\nTanushka Marah\nIndependent Parliamentary candidate for Hove Portslade\nDonate\nHome\nNews\nEvents\nOur People’s Manifesto\nContact Us\nFor press and media enquiries email\n:\npress@tanushkamarah.com\nor call 0333 880 1865\nContact Us\nJoin Our Mailing List\nLeave this field empty if you're human:\nTo be kept up to date with Tanushka Marah’s campaign for the 2024 UK General Election, please sign up via this link\nSign Up",
  "https_tanushkamarah_com_/https_tanushkamarah_com_events/content_5.html": "See below for full events listing\n-\nFree Community Get Together\nArts and Crafts including poster making & face painting, food to share, music to dance to, and live performances!…\n-\nTalkin’ ’bout a Revolution\n28th June 2024 Fundraiser Spoken Word Literary Join us for an inpiring evening of verse, prose and music…\nEvents & Meetings – Tanushka Marah Campaign\n| Thurs 27th June 7.30 – 9.30 pm | Stop The War Election Question Time – Community Base – Tanushka speaking – South Wing Conference Room, Community Base, 113 Queens Road, Brighton BN1 3XG https://www.facebook.com/share/p/W5Rs5FSad7s8NVCp/ | ||||||\n| Fri 28th June 7pm-10pm | Talkin’ ’bout a Revolution – Spoken Word Literary – Fundraiser ! Come join us for an inspiring evening of verse, prose and music.The tables are turning in Hove and Portslade as Tanushka Marah brings a new story. We’ve had enough of the same old tales from Labour and Conservative. It’s time to turn the page! Listen to fabulous authors and poets ! PLUS a special video message from Maxine Peake At: The Circle Studios – 55 North Street Hove BN41 1DH Live and Streamed Online https://www.eventbrite.com/e/talkin-bout-a-revolution-tickets-930128698977 | BOOK TICKETS | |||||\n| Sat 29th June 11.30am | NHS Flashmob! George Street Hove | ||||||\n| Sat 29th June 2pm – 4.30pm | COMMUNITY GET TOGETHER – Portslade village green – | ||||||\n| Thur 4th July | GET THE VOTE OUT – meet Dave H & Anne P | ||||||\n| Thur 4th July | ELECTION NIGHT Hove Town Hall 11pm-4am – Tanushka + team | ||||||\n| Fri 5th JULY | Post election party |"
}