{
  "https_reformwestwight_co_uk_/https_reformwestwight_co_uk_contact/content_2.html": "Copyright © 2024 Reformwestwight.co.uk - All Rights Reserved.\nPromoted by Paul Oakden - Copyright © 2024 Reform UK\nCompany number 11694875 | Registered in England & Wales\n83 Victoria Street, London SW1H 0HW, United Kingdom0800 414 8525\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_reformwestwight_co_uk_/https_reformwestwight_co_uk/content_1.html": "Meet me at the Boathouse Cafe Fort Victoria\nMeet me at the Boathouse Cafe Fort Victoria Yarmouth\nWednesday 3rd July 10 am til 12 midday\nMy name is Ian Pickering and I am the Reform Party Candidate for Isle of Wight West. I am a retired teacher and resident of Freshwater. I am working closely with Sarah Morris who is our Candidate for Isle of Wight East. We want the best for the Island and believe that if you want change you have to vote for it.\nAs a Prospective Parliamentary Candidate I am self funding and you can help my campaign by visiting this site. https://gofund.me/84577b15\nWatch my speech at the Riverside Centre in Newport on YouTube here\nVisit my Facebook page here\nWe need change - My core aims are:\nYou can read more about my views at www.reformhampshire.org.uk\nMy name is Ian Pickering and I am the Reform Party Candidate for Isle of Wight West. I am a retired teacher and resident of Freshwater. I am working closely with Sarah Morris who is our Candidate for Isle of Wight East. We want the best for the Island and believe that if you want change you have to vote for it.\nAs a Prospective Parliamentary Candidate I am self funding and you can help my campaign by visiting this site. https://gofund.me/84577b15\nWatch my speech at the Riverside Centre in Newport on YouTube here\nVisit my Facebook page here\nWe need change - My core aims are:\nYou can read more about my views at www.reformhampshire.org.uk\nDo you believe that the Conservative government has done a lot for Isle of Wight residents since 2010, especially over the last seven years?\nIf not, imagine what would happen if our Island had two Tory MPs after the General Election, sitting on the opposition benches (which we all know is where they would be).\nThere is now a real chance to change how the country is run for the better: vote Reform UK.\nTo learn more about the Reform Party vision for the UK\nplease go to \"Our contract with You\" a working draft document for you to comment upon and challenge. We value your views. https://www.reformparty.uk/policies\nYou can email me isleofwightwest@reformuk.com\nor call 07553 011606 for more information and to volunteer to distribute leaflets in your area.\nDo you live in West or East Wight? Check here if you are not sure.\nReform will lower your income tax by raising the tax threshold to £20,000.\nThis will put an an extra £30 or so in each earner's pocket every week.\nThe more you earn the more you can spend and the economy will grow.\nWe all know that without the skilled and dedicated staff from overseas, our hospitals, surgeries and all of our other health services would collapse. Similarly our building sites would not function, our hospitality industry would fail and much of our agricultural produce would not be harvested. A proper points system would allow us to control who comes into the country, where they are and what they are doing. The Government is currently spending £8 million per day housing illegal economic immigrants, whilst some of our own people are searching in vain for adequate accommodation. The boats must stop and those who are here illegally must be returned.\nOur young people are our future. We need to secure their future for them by building an economy that will support and encourage them to succeed in whatever role they decide to play. They need to be able to train and develop skills relevant to the country's needs. We must invest in their future and not rely on importing a workforce from overseas.\nLong-term planning and policies for the next five to twenty years will see our young people thrive in a country able to value and support them within a society proud of its history, culture and traditions.\nCopyright © 2024 Reformwestwight.co.uk - All Rights Reserved.\nPromoted by Paul Oakden - Copyright © 2024 Reform UK\nCompany number 11694875 | Registered in England & Wales\n83 Victoria Street, London SW1H 0HW, United Kingdom0800 414 8525\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
}