{
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-deeply-frustrated-as-labour-government-delivers-another-blow-to-somerset/content_22.html": "Anna Sabine MP “deeply frustrated” as Labour Government delivers another blow to Somerset\nAnna Sabine MP “deeply frustrated” as Labour Government delivers another blow to Somerset\nThe Government’s recent decision to withdraw the levelling up funding for culture projects, previously promised to Somerset Council to then be distributed to Frome’s Cheese and Grain, has been met with disappointment from Frome and East Somerset MP Anna Sabine and Somerset Council leader Bill Revans.\nThe £1.7 million that had been provisionally awarded by the previous Conservative Government towards the Cheese and Grain’s rehearsal expansion and training plan, as part of the Levelling Up capital funding, has, under the current Labour Government, been withdrawn. This final news comes after a consultation had been announced at the Autumn Budget 2024 which suggested the funding for projects across Somerset might be at risk, but the confirmation now comes as a blow to the area.\n“I am deeply frustrated and saddened that this opportunity has been lost for Frome and East Somerset and that the Labour Government have once again chosen to redirect crucial funds to build growth in other areas of the country, to the detriment of the South West” said MP for Frome and East Somerset, Anna Sabine following the news.\n“Time and again this Government has shown a neglect for Somerset and this comes as another blow for our community. There is so much potential for economic growth around the arts and we are a hub of creativity in Frome, it’s discouraging to see such a lack of support from the Government but I have every belief in the Cheese and Grain that they will persevere and continue to grow the local economy via alternative means”.\nSomerset Council which had been in talks with the Department of Housing, Communities and Local Government around the bid for several projects in Somerset have also expressed their disappointment with the news, with Councillor Bill Revans saying “It’s disheartening that funds seem to have been diverted to other areas of the country. Somerset Council remains committed to providing support to the cultural sector of the economy of which the Cheese & Grain and other projects involved are such a vital part.”\nThe Cheese and Grain has already been pursuing alternative methods of funding in anticipation of a possible withdrawal, and both Anna and Somerset Council will continue to try to facilitate this wherever possible.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_campaigns_frome-leisure-centre/content_5.html": "Tell Anna Sabine about your experiences of Frome Leisure Centre\nAnna's campaign to find out from local residents what they think about Frome Leisure centre\nI'm hearing about consistent and ongoing problems at the Frome Leisure Centre, run by Fusion.\nIn order to get a better understanding of the issues users are facing, I’d love Frome residents to get in touch and tell me what's happening, while I try to get a meeting with Fusion's owners.\nYou can do this via this form https://digitallibdems.typeform.com/to/ara3vnfF\nSign up for updates from Anna Sabine MP\nJoin Anna's mailing list for the latest updates on her campaign on this important issue.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-speaks-out-over-bank-closure/content_27.html": "Anna Sabine speaks out over bank closure\nAnna Sabine speaks out over bank closure\nFrome residents have been shocked and angered by the news that the town’s only remaining bank will close later this year.\nTSB on Cheap Street will close in September, meaning that Frome customers will need to travel to Midsomer Norton, at the opposite end of the new Frome and East Somerset constituency, in order to do any in-person banking.\nAnna Sabine, Liberal Democrat Parliamentary Candidate for Frome and East Somerset, said:\n“This is an incredibly short-sighted decision by TSB and potentially worrying news for businesses in Frome, many of whom still rely on local banks. I know from my conversations with local residents how worried they are about the future of our high streets. It is clear that the Conservatives have no plan to support our high streets to thrive.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-says-constituents-have-been-left-in-the-dark-calling-old-oak-common-disruption-unacceptable/content_33.html": "Anna Sabine MP says constituents have been “left in the dark”, calling Old Oak Common disruption “unacceptable”\nSpeaking in a Westminster Hall debate today, Anna Sabine MP for Frome and East Somerset called the “hugely impactful” planned works for Old Oak Common station “totally unacceptable”. Addressing the works which are due to start in just a months time, she criticised the Government for the egregious lack of public consultation with councils, MPs, businesses and other interest groups only just being notified of the potential impact the works will have.\n“This work is supposed to last for seven or more years which for us in Frome and East Somerset follows on from ten years of disruption to our rail services due to the electrification of the main line and the construction of the Elizabeth line.”\nSpeaking of the disruption which will be caused by the works and the inability for other existing lines like the South West railway, to cope with the huge added pressure that it will face Anna cited the massive impact this will have on people and businesses in the area.\n“Furthermore many people and businesses relocated to places like Frome and East Somerset during Covid, partly based on that time of service and the regularity of service and they won’t have been made aware of these plans when they were making those decisions.”\n“This will be a direct hit on the South West and Welsh economies, and will affect not only people now but far into the future as people adapt their investment and business decisions accordingly. We already have unreliable services with frankly rubbish wifi and mobile signal which hampers the ability to work on the train. “\nAnna called out the Prime Minister’s for his lack of knowledge of the area when suggesting the Exeter line would be unaffected and urged the Government to implement measures to mitigate what will otherwise be a hugely impactful and potentially damaging effect these plans will have on the South West and it’s economy.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk/content_1.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nAnna Sabine is Member of Parliament for Frome and East Somerset. The constituency includes the towns of Frome, Radstock and Midsomer Norton as well as many villages all the way from Bath to Shepton Mallet. On this website you can find out about Anna’s campaigns and activities in Parliament as well as get in touch or offer your support.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-secures-meeting-with-minister-on-hospice-care-in-first-pmqs/content_36.html": "Anna Sabine MP secures meeting with minister on hospice care in first PMQs\nThe Prime Minister Keir Starmer today promised local MP Anna Sabine a meeting with the relevant minister to discuss her concerns about hospice funding. At today’s PMQs – Anna's first - she spoke on behalf of local hospice Dorothy House and asked the Prime Minister to assist them in continuing their crucial work in her first PMQ.\nSpeaking of the local hospice which supports terminally ill people and their families throughout her constituency of Frome and East Somerset, Anna spoke of the damage the rise in the Employer’s National Insurance Contributions could do to the organisation.\nSupporting over 3000 people with end-of-life care last year alone, Dorothy House has said the rise in NICs will add an additional cost of £422,000 to their financial overheads and could potentially affect their ability to provide services moving forward.\n“Next year Dorothy House will be looking forward to celebrating 50 years of service” Anna told Prime Minister Kier Starmer in the chamber, “but they will also be facing an additional cost of £422,000 thanks to increases in employer’s national insurance. Will the Prime Minister commit to meeting with representatives of the hospice sector hear the first-hand impact of the NICs and work with them to find a solution?”.\nHaving visited with Dorothy House CEO Wayne de Leeuw last week and toured the facilities of their in-house care, Anna heard about the further service the hospice provides with 90% of their services happening in the homes of those who are terminally ill and their families. The hospice is predominantly funded by charitable donations; the south west receives the lowest percentage of funding for hospice care across England at just 24%, and the need for end of life care predicted to rise by 25% by 2048.\nAnna has personal experience of the amazing work Dorothy House does when a close friend and her family were looked after during the end of her life last year, and Anna feels strongly that charities and organisations that are already picking up the shortfall of care left by lack of Government funding, shouldn’t be further hindered from their work through additional costs.\nTony De Jaeger, Deputy CEO & Director of Finance - Dorothy House Hospice Care, said,\n“We urgently need the support of our community and the government to ensure we continue offering the specialist care and support that our patients and their families deserve. No one should face death alone and yet this additional £422,000 annual National Insurance cost places huge pressure on our workforce to make impossible decisions about our services.”\nIn response to Anna’s question, the Prime Minister recognised “the pressure that hospices are facing” and further committed to “make sure that [Anna] gets a meeting with the relevant minister”. Citing the £100 million the Government has promised to hospices, Anna will be seeking a meeting to ensure more of that funding is fairly distributed to the south west.\nSpeaking after PMQs Anna said “I'm glad the PM has listened and promised a ministerial meeting on this. It’s shocking that the south west lags so far behind other areas when it comes to hospice funding, and I want to do all I can to support the excellent Dorothy House in everything they do.”\nEND.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-fights-for-better-dental-care/content_15.html": "Anna Sabine MP fights for better dental care\nAnna Sabine MP fights for better dental care\nAnna Sabine MP for Frome and East Somerset today convened a Parliamentary debate on the important issue of Dentistry in Somerset. Speaking in Westminster Hall, Anna spoke of how Somerset is “particularly neglected” as a region when it comes to access to dentists with the South West suffering “the worst access problems of all regions in England” according to the latest ONS data.\nWith only 32% of adults seeing an NHS dentist in the 2 years up to June 2024, Somerset has a much lower average than the national average of 40%, with children sitting at well below the national average of 55%, at only 42%, having significantly dropped since pre Covid. The data shows that 1 in 5 children in Somerset have tooth decay by the time they are 5, and the numbers have seriously deteriorated in recent years.\n“It’s symptomatic of the lack of investment in the region, not only in health and social care, but withdrawn Levelling Up Funding for the area”. Anna said opening the debate.\n“I am concerned that not enough is happening, fast enough. The Health Secretary made a point of meeting the British Dental Association on his first day in office, but the BDA tell me that there has been little follow up.”\nAsking the Minister whether the Government has yet entered into formal negotiations to reform the dental contract, Anna spoke of the breadth of pressure poor oral care puts on the rest of the NHS as well. Whilst the Government have committed to a roll out of 700 thousand extra urgent care appointments in April, this is less than a third than what is needed. A neglect of primary care in dentistry leads to this avalanche of need for urgent care and hospitals are struggling to provide either the urgent appointments nor the aftercare that many require, including as Anna noted, one of her constituents who needed supplementary dental care after a fall and remains waiting and another who, unable to afford private care, is needing to call 111 for urgent tooth removal, one at a time.\n“a failure to invest in dentistry now, not only causes more and more pain but also gets more and more expensive and adds pressure onto the NHS in the long term: cancers get undiagnosed, people are forced to use 111 or A&E. People simply get pushed around the system, instead of being treated or even preventing illness.”\nThe Liberal Democrats are calling for proper investment in dental services and the ring fencing of the necessary funding to allow NHS dentistry to prevail long term. “NHS dental practices must be offered relief from the NICs rise” Anna said, adding that this should “be extended to the wider health and social care sector including GP surgeries, care homes, hospices and pharmacies”.\nUrging the Minister to take action now to invest in the training and retention of NHS dentists, Anna said parents and families need more support in accessing dentistry, insisting “we cannot let Somerset slip further and further down the national average, which is already a low bar, and create more pain, misery and costs for generations to come”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_ldvscon/content_8.html": "ELECTION LATEST: It's so close\nElections in Frome and East Somerset are a close fight between the Liberal Democrats and Conservatives\nYour vote WILL make the difference between whether our next MP is Lib Dem Anna Sabine or a Conservative MP.\nHow people vote in closely fought constituencies like here in Frome and East Somerset will decide the result of the upcoming General Election.\nEvery vote will make a difference between a Conservative or Lib Dem win here.\nLabour and the Green Party can't beat the Tories in Frome and East Somerset.\nLib Dem or Conservative here\nThere are two choices. Either we will get a Conservative MP - and the out of touch government will continue to take Frome and East Somerset for granted, or we will get a Lib Dem MP in Anna Sabine and Frome and East Somerset will have helped bring down this government.\nNo other result is possible here.\nIn last year's by-election the Lib Dems beat the Conservatives in Frome. Labour and the Greens have never elected an MP there. Control of the councils across Somerset and North East Somerset are always between the Lib Dems and Conservatives.\nThe only way to beat the Conservatives in rural Somerset is to back Lib Dem Anna.\nA Labour vote will help the Conservatives win\nA vote for third-place Labour here risks letting a Conservative candidate sneak a win and help this government cling to power.\nThis part of Somerset is an area of strength for the Lib Dems. They’ve won big in recent local elections and elected a Lib Dem MP in the Frome parliamentary by-election last year.\nThis new Frome and East Somerset constituency covers a large area of East Somerset - and as well as Frome, it includes Evercreech, Midsomer Norton, Radstock and Peasedown.\nWhilst both Labour and the Green Party have small pockets of support locally, neither have ever come close to winning big in this part of Somerset.\nLabour just can't beat the Conservatives here.\nEven Labour HQ have admitted they are not fighting to win in Frome and East Somerset.\nThe Labour Party’s national HQ call Frome and East Somerset a ‘non-battleground’ seat.\nThe Labour Party’s national volunteering website tells their supporters in Frome and East Somerset to campaign in Swindon instead.\nSupport grows for Anna\nMore and more people right across Frome and East Somerset are backing Lib Dem Anna Sabine at the upcoming General Election.\nLib Dem Anna can beat the Conservatives here.\nI'm backing Anna\nMore and more people are backing local Liberal Democrat Anna Sabine to win in Frome and East Somerset at the General Election.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_page-2/content_13.html": "Taking on Trump & Farage – and fixing church roofs\nLeader's Speech to Spring Conference 2025\nAnna Sabine is Member of Parliament for Frome and East Somerset. The constituency includes the towns of Frome, Radstock and Midsomer Norton as well as many villages all the way from Bath to Shepton Mallet. On this website you can find out about Anna’s campaigns and activities in Parliament as well as get in touch or offer your support.\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_lib-dems-announce-plans-for-free-school-meals-for-9105-more-primary-school-children-in-somerset/content_32.html": "Lib Dems announce plans for free school meals for 9105 more primary school children in Somerset\nThe Liberal Democrats have announced their ambition to extend free school meals to all primary school children, beginning with all children in poverty across both primary and secondary schools.\nThis would mean an extra 9105 primary school children in Somerset receiving free school meals. Currently in Somerset, just 5760 (20.5%) of primary school children in year 3 and above receive free school meals.\nIn government, the Liberal Democrats would ensure 100% of primary school children receive free school meals. The party’s plan also includes an immediate extension of free school meals to all 900,000 children living in poverty who currently miss out across both primary and secondary school.\nThis is estimated to be 70,000 in the South-West, who would all be covered under the Liberal Democrats’ plan. The new policy will make the Liberal Democrats the most ambitious party on free school meals.\nLiberal Democrat Parliamentary Candidate for Frome and East Somerset, Anna Sabine, said: “I am proud the Liberal Democrats have the most ambitious plan for free school meals of any party. Across Somerset, there are too many children expected to learn on empty stomachs with no guarantee of a hot meal when they get home. It is about time that changed”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-asks-why-somerset-is-seeing-largest-decrease-in-community-policing-nationwide/content_49.html": "Anna Sabine MP asks why Somerset is seeing largest decrease in community policing, nationwide\nAnna Sabine, MP for Frome & East Somerset, is challenging the Government to explain why new figures released by the Home Office show that as many as 60 PCSOs have been taken off the streets of Avon and Somerset in the past year – the highest cut in any police force in England. The figures show the numbers of PCSOs in the area have plummeted from 315 to 255 since September 2023, a loss of almost 20% of the community police officers on the streets.\nWith a total net loss of 235 PCSOs in the past 12 months, Avon and Somerset’s 60 amounts to over a quarter of the total loss of PCSOs across England and Wales. These statistics come less than two months after the Government announced its new Neighbourhood Policing Guarantee, which included a pledge to recruit additional PCSOs.\n“The new statistics show once again that rural areas are not being taken seriously by the Government and are not being given the resources they need to thrive. I hear time and again about anti-social behaviour, shoplifting and rural crime and PCSOs are absolutely key in fighting these issues.” said Anna Sabine MP for Frome and East Somerset.\nPCSO numbers were ruthlessly slashed under the previous Conservative government - taking over 4,500 PCSOs off the streets since 2015. The new Government have promised to fix this and in light of the recent figures, the Liberal Democrats are highlighting the need for a return to proper community policing with visible and trusted local officers focusing on their local neighbourhoods.\n“I welcome the Government’s pledge to ensure more PCSOs but it has to ensure that proper funding is given to community policing in rural areas and not just metropolitans. Radstock in my constituency is currently facing an issue with anti-social behaviour, but they have seen their number of PCSOs drop from 13 to 6 in the last 18 months. A visible community police force is vital to ensure our communities feel safe and protected too.”\nAnna Sabine MP has previously contacted the Minister for Policing Diana Johnson about issues with Rural Crime in the wake of the budget and has recently met with Avon and Somerset Police and Crime Commissioner Clare Moody and toured Frome with a local PCSO to hear from them in light of concerns raised about the rise of rural crime.\nENDS\nNotes to Editors:\nSource: Home Office, ‘Police workforce, England and Wales, 30 September 2024: data tables’, Table 3.\nPlease use the online version of the police data, accessible here.\nHistorical data on PCSOs can be found here.\nThe College of Policing defines PCSOs as a “key liaison point between local communities and policing. Publicly facing, they provide a visible, accessible and approachable uniformed presence in the community to offer reassurance, defuse situations with threats of conflict, improve confidence and trust, gather information and foster good community relations.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_page-3/content_24.html": "Local MPs condemn Badenoch’s plans to cut state pension\nLocal MPs, Anna Sabine and Wera Hobhouse have criticised plans announced yesterday by Conservative Leader Kemi Badenoch suggesting she would look at means testing the triple lock of pensions which currently ensures it increases each year in line with aver",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_childcare-desert-somerset-sees-755-childcare-places-lost-since-2019/content_46.html": "Childcare desert: Somerset sees 755 childcare places lost since 2019\nChildcare desert: Somerset sees 755 childcare places lost since 2019\nThere has been a 755 fall in the number of childcare places in Somerset since 2019, House of Commons Library research commissioned by the Liberal Democrats has revealed.\nIt comes as applications opened on the 13th May for parents to register for 15 hours of free childcare from September for children from 9 months old. The Liberal Democrats said the fall in providers was putting the deliverability of the government’s plans into doubt and leaving parents in Somerset “without options.” The party has been calling on the Government to review the rates paid to providers for free hours to ensure they cover the actual costs of delivering high-quality childcare.\nIn Somerset, 755 childcare places have been lost since 2019, falling from 9680 to 8925. It equates to a 7.80% fall in the number of places. The number of childcare providers in Somerset has also seen a decline, with there now being 133 fewer than in 2019, a 26.55% fall.\nNationally, the number of childcare providers, including nurseries and childminders, has dropped by a fifth since 2019, from 61,162 to 48,143. Every area in the country but one has seen a fall in the number of childcare providers since 2019, leaving parents with less choice as to where they can get childcare.\nLiberal Democrat Parliamentary Candidate, Anna Sabine, said:\n“Childcare in Somerset has been driven to the brink by years of neglect from this Conservative Government. Local parents have been left completely without options.\n“Free hours are no good if parents can’t find a nursery or childminder for their child – and thanks to this Conservative government's underfunding, many parents in Somerset now face a near impossible task of finding childcare.\n“I will continue to fight for a fair deal for families across Frome and East Somerset, that pays providers properly instead of doing childcare on the cheap by underfunding nurseries”.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-called-on-government-to-support-local-councils-in-providing-care-for-children-with-additional-needs/content_42.html": "Anna Sabine MP called on Government to support local councils in providing care for children with additional needs\nAnna Sabine MP called on Government to support local councils in providing care for children with additional needs\nSpeaking in today’s Westminster Hall debate on Government Support for Education, Health and Care Plans, Anna Sabine MP for Frome and East Somerset said the Government must “provide local authorities with extra funding” to manage the care needed for students and children with additional needs.\nCiting a constituent, who has found that despite a diagnosis and medical recognition of need for an Education, Health and Care Plan, her child has slipped through the cracks of the system, Anna called for a clearer and more “straightforward” path for parents to access the support needed.\nSpeaking of the “immense financial strain” councils across the country are currently facing, Anna lamented the “woefully under-resourced” system as failing to help support children to thrive and said the Government must begin to properly support councils who are trying to administer the plans for children and families in the region.\nWhilst medical assessors and authorities have become better in recent times at diagnosing and recognising additional needs, particularly in children, the financial and systemic provisions to deliver the care needed is lacking.\nSpeaking after the debate, Anna also said “As a society, we are becoming better at recognising additional needs and the provisions required, but without the proper funding for our councils, too many children and adults in need of support are unable to access it. The Government needs to properly invest in supporting the systems that provide care so that help can be available to those who need it now”.\nThe full speech is below:\nWith limited time, I’d like to raise a very specific issue. My constituency of Frome and East Somerset falls under both Bath and North East Somerset and Somerset Councils meaning that there have been instances where children’s specific cases, claims and tribunals fall between two different systems.\nOne of my constituents wrote to me about their child, who is 14 and has central nervous system lupus, epilepsy, ADHD and visual and sensory processing disorders. All their needs were documented by an educational psychologist who recommended that their needs be drawn up into an EHCP.\nDespite this medical recognition of an EHCP, as well as the diagnosis, for over a year Bath & North East Somerset and Somerset Council went back and forth over which local authority should take responsibility for the EHCP, because the child’s parents were separated with one in each authority, and the child split their time evenly between the two. This cannot be an uncommon occurrence, and yet there were delays and stress for the family while they waited for their case to come to a tribunal. In the 15 months it has taken to resolve this issue, the child’s mother estimates he has missed 1100 lessons.\nMany local authorities are of course under immense financial strain and I can’t see how this situation can be resolved until the Government relieves councils by providing local authorities with extra funding and by making EHCP applications as simple and straightforward as possible. We are better than ever at diagnosing additional needs, but the system is woefully under-resourced to support children to thrive.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_jacob-rees-mogg-votes-against-law-to-criminalise-water-companies-for-sewage-spills/content_34.html": "Jacob Rees-Mogg votes against law to criminalise water companies for sewage spills\n- Liberal Democrat amendment in Parliament would have seen water companies in court for worst sewage offences\n- Environment Agency backs calls for water company bosses to face criminal action\n- Conservative MPs vote down “justice for swimmers, wildlife and our natural environment.”\nOn Wednesday 15th May, Conservative MPs including Jacob Rees-Mogg voted against a new law which would have seen water companies in court for sewage spills.\nThe vote in Parliament took place on the same day a BBC report found sewage had been illegally dumped in the UNESCO protected Lake Windermere in the Lake District.\nThe new law, opposed by Conservative MPs, would have created criminal offences for failing to meet pollution performance commitment levels, ensuring the polluting firms would go to court and face punishments including fines.\nThe Environment Agency has previously called on water company Chief Executives and board members to face criminal charges, including court-imposed fines.\nDespite cross-party support for the amendment, over 250 Conservative MPs voted against it.\nLiberal Democrat parliamentary candidate for Frome & East Somerset, Anna Sabine, said:\n“It is shocking that Conservative MPs in our area have voted against this tough action on polluting water firms.\n“This is a national scandal which has blighted our own community. Water companies should have their day in court for environmental vandalism.\n“This law would have delivered justice for swimmers, wildlife and local rivers. Yet Conservative MPs shamelessly opposed it. They simply don’t care about our environment and protecting swimmers.\n“Our community needs a new MP who will actually get tough on water firms. At the next General Election, I will pledge to stand up for our environment and vote to get a grip on polluting companies.”\nENDS\nNotes to Editor\nFull list of how MPs voted:\nhttps://votes.parliament.uk/votes/commons/division/1817#noes\nAmendment from Liberal Democrat MP Tim Farron\n“Offence of failing to meet pollution performance commitment levels\n- A water or water and sewerage company “C” commits an offence where C has –\n- failed to meet its pollution performance commitment level for three consecutive years; or\n- experienced an increase in –\ni. total pollution incidents per 10,000km2, or\nii. serious pollution incidents\nfor three consecutive years.\n- For the purposes of this section –\n“water or water and sewerage company” means companies which are responsible for the provision of water, or water and sewerage, services and which are regulated by Ofwat and the Environment Agency;\n“pollution performance commitment level” means the level of performance on pollution that the company has committed to deliver, and which is reported against by Ofwat in its annual water company performance report;\n“total pollution incidents per 10,000km2” and “serious pollution incidents” mean the relevant figures under those headings reported by the Environment Agency in its annual environmental performance report.\n- If guilty of an offence under this section, C is liable –\n- on summary conviction, to a fine;\n- on conviction on indictment, to a fine.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_campaigns/content_17.html": "Campaigns\nAnna runs regular campaigns on a range of issues that matter to her constituents in Frome & East Somerset. You can find out more on the drop down menu above\nAnna runs regular campaigns on a range of issues that matter to her constituents in Frome & East Somerset. You can find out more on the drop down menu above",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-is-new-mp-for-frome-and-east-somerset/content_38.html": "Anna Sabine is new MP for Frome and East Somerset\nLiberal Democrat, Anna Sabine, has been elected Member of Parliament for Frome and East Somerset.\nAnna was elected with 16,580 votes, a 5415 majority. At the time of writing, Anna joins 69 other new and returning Liberal Democrat MPs across the country.\nAnna said:\n“It is the privilege of my life to represent Frome and East Somerset. Over the last few months, it has been the greatest joy to meet with people across the constituency and to be welcomed with such warmth into homes, businesses and schools. I cannot wait to get to work and make sure that this beautiful place is properly represented in Parliament.\n“I want to thank everyone who has voted for me, including those who have lent me their vote. I will work hard every day to honour that decision”.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_local-mp-anna-sabine-convenes-cost-of-living-surgery/content_37.html": "Local MP Anna Sabine convenes cost of living surgery\nFrome and East Somerset MP Anna Sabine has announced a Cost of Living surgery which will bring together local experts who can advise attendees on any concerns they might have around heating, housing and wellbeing going into the new year.\nTaking place in Midsomer Norton on Saturday 18th January, Anna will be joined by a range of specialists including confirmed attendees from Bath Mind, Age UK, Wessex Water and various village agents and representatives of the community.\nThe surgery will be operating as a drop-in service where locals are welcome to turn up on the day between 1.30pm and 3.30pm at The Somer Centre and speak with Anna or any of the other experts who may be able to advise or assist with specific worries around the cost of living going into 2025.\nThe attendees have a wealth of knowledge and as recent price hikes are increasingly causing a burden, Anna is happy to help facilitate a sharing of help within the community.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_contact-1/content_6.html": "Contact\nAnna Sabine is your MP for Frome and East Somerset. Working for you all year round, not just at election times.\nHelpful contacts\nOther sources of help and support.\nAnna Sabine is your MP for Frome and East Somerset. Working for you all year round, not just at election times.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-demands-the-government-recognise-the-huge-impact-old-oak-common-will-have-on-the-south-west/content_30.html": "ANNA SABINE MP DEMANDS THE GOVERNMENT RECOGNISE THE “HUGE IMPACT” OLD OAK COMMON WILL HAVE ON THE SOUTH WEST\nANNA SABINE MP DEMANDS THE GOVERNMENT RECOGNISE THE “HUGE IMPACT” OLD OAK COMMON WILL HAVE ON THE SOUTH WEST\nSpeaking in today’s Westminster Hall debate on Railway Services in the South West, Anna Sabine MP for Frome and East Somerset, told the Government that the consultation on this “huge change” was “insufficient” and that more needs to be done.\nRecognising the massive impact the proposed works on Old Oak Common station will have, and the unrelenting strain being put on remaining train routes, Anna once again asked the Government to take a deeper look at the potential consequences for areas such as Frome and East Somerset.\nAddressing Simon Lightwood, Minister for Local Transport, she asked “Would my honourable friend agree….that we still need to have some kind of impact survey or study into the potential impacts on tourism, business and the other effects on the South West of these works at Old Oak Common?”\nAnna has previously spoken of the shocking lack of consultation with the businesses and residents of the region and the seeming disregard of the effect this will have on the people of the South-West and Wales. Alongside other Liberal Democrat MPs representing the areas of Devon and Cornwall, Anna is determined to make the Government listen to the concerns of residents who will be hugely affected by this change and will continue to demand they take account of the shocking implications these decisions will have.\nFull Intervention below:\nMy constituents in Frome and East Somerset are still shocked to learn about the implications in Old Oak Common, would my honourable friend agree that the consultation on this huge change and huge impact on the south west, was insufficient and that we still need to have some kind of impact survey or study into the potential impacts on tourism, business and the other effects on the South West of these works at Old Oak Common?",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_page-5/content_26.html": "Jacob Rees-Mogg votes against law to criminalise water companies for sewage spills\nOn Wednesday 15th May, Conservative MPs including Jacob Rees-Mogg voted against a new law which would have seen water companies in court for sewage spills.\nOn Wednesday 15th May, Conservative MPs including Jacob Rees-Mogg voted against a new law which would have seen water companies in court for sewage spills.\nNew figures released by the Environment Agency have shown that Wessex Water, which covers Somerset, discharged sewage a staggering 41,453 times last year, an 89% rise compared to 2022.\nPolice in Avon and Somerset are taking an average of 5 hours and 21 minutes to respond to burglary calls, damning new figures uncovered by the Liberal Democrats have revealed.\nThe subject of cancer treatment reform is close to Anna's heart. At conference, she called for badly-needed reform. Watch her speech in full.\nLocal party members have selected local businesswoman and campaigner Anna Sabine as Parliamentary candidate for the new marginal Frome & East Somerset constituency.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_page-4/content_25.html": "Anna Sabine is new MP for Frome and East Somerset\nLiberal Democrat, Anna Sabine, has been elected Member of Parliament for Frome and East Somerset.\nLiberal Democrat, Anna Sabine, has been elected Member of Parliament for Frome and East Somerset.\nThe Liberal Democrats have announced their ambition to extend free school meals to all primary school children, beginning with all children in poverty across both primary and secondary schools.\nAnna Sabine is the Liberal Democrat Parliamentary Candidate for Frome and East Somerset in the July 2024 General Election, as announced earlier today by Prime Minister Rishi Sunak.\nFrome residents have been shocked and angered by the news that the town’s only remaining bank will close later this year.\nThere has been a 755 fall in the number of childcare places in Somerset since 2019, House of Commons Library research commissioned by the Liberal Democrats has revealed.\nLiberal Democrat Parliamentary Candidate, Anna Sabine, has been working with local residents to protect a 300-year-old English oak tree from being cut down in Westwood Drive, Frome.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-asks-for-travel-restrictions-to-be-lifted-on-diamond-travel-pass/content_48.html": "Anna Sabine MP asks for travel restrictions to be lifted on Diamond Travel Pass\nAnna Sabine MP asks for travel restrictions to be lifted on Diamond Travel Pass\nWriting to the Minister for Transport this week, Anna Sabine MP has asked for a reconsideration of bus pass accessibility to allow disabled users to get to and from their jobs. As it stands, users of the Diamond Bus Pass, which allows free travel on buses for senior citizens and those with disabilities, are restricted to ‘off peak’ use between 9am and 4am which means they cannot use it to get to jobs which start any earlier than 9am.\nThe letter comes after Anna’s recent visit to Swallow in Radstock who work with over 170 teenagers and adults with learning difficulties, teaching them a range of skills for everyday life. Two young women who live in assisted living homes told Anna about their difficulty using their pass to commute.\nThe restrictions on use during typical commuter hours, Anna said in her letter, “implies that those who are disabled don’t have jobs or need to travel before 9am”. The off-peak nature of the travelcard which is provided under the English National Concessionary Travel Scheme but is run by local authorities, currently allows for travel during the day and the evening but Anna suggests councils “should look to make these travelcards 24 hours, or at least make the time in the morning earlier, as it would allow people to access their workplace”.\nThe aim of travelcards is to support those disabled holders in living their lives as independently as possible but the restrictions on time can have a significant impact on the choices they can make in terms of jobs and and potentially impede their ability to thrive.\nAnna’s letter has been sent to Simon Lightwood, Minister for Local Transport and looks forward to a response.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news/content_14.html": "Anna Sabine MP fights for better dental care\nAnna Sabine MP for Frome and East Somerset convened a Parliamentary debate on the important issue of Dentistry in Somerset. Anna spoke of how Somerset is “particularly neglected” as a region when it comes to access to dentists.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_local-residents-campaign-to-save-oak-tree/content_35.html": "Local Residents Campaign to Save Oak Tree\nLocal Residents Campaign to Save Oak Tree\nLiberal Democrat Parliamentary Candidate, Anna Sabine, has been working with local residents to protect a 300-year-old English oak tree from being cut down in Westwood Drive, Frome.\nAn application has been submitted to Somerset Council to remove the tree after an insurance claim was made regarding damage to a nearby house.\nAnna said: “It is shocking that anyone would want to destroy this beautiful tree. The local residents I’ve spoken to really care about the tree and would be absolutely devastated if it was cut down. I will continue to do what I can to help local residents protect this tree and ensure that it continues to thrive for centuries to come”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_local-mps-condemn-badenochs-plans-to-cut-state-pension/content_44.html": "Local MPs condemn Badenoch’s plans to cut state pension\nLocal MPs condemn Badenoch’s plans to cut state pension\nLocal MPs, Anna Sabine and Wera Hobhouse have criticised plans announced yesterday by Conservative Leader Kemi Badenoch suggesting she would look at means testing the triple lock of pensions which currently ensures it increases each year in line with average wage increases and inflation.\nCalling the proposal “callous” and “frightening” for pensioners of Somerset and Banes, the Lib Dem Members of Parliament for Frome and East Somerset, and Bath have stridently objected to Badenoch’s intention to potentially halt the automatic increase on the state pension.\n“The comments made by Kemi Badenoch this week show a callous disregard for pensioners across the country who are already facing a huge hike in winter fuel costs and rising inflation.” Said MP for Frome and East Somerset, Anna Sabine.\n“The triple lock was brought in by Lib Dems to help protect the pension that so many in Frome and East Somerset rely on and this announcement is a frightening indication of her intentions and I urge Conservative MPs to distance themselves from this sort of rhetoric”.\nBadenoch’s remarks follow on comments from the Shadow Chancellor, Mel Stride, made in December in which he said that maintaining the triple lock was “unsustainable”, showing a pattern amongst the Opposition party that looks to ignore pensioners and their needs.\nWera Hobhouse MP for Bath said “Pensioners in our community have already put up with years of economic vandalism under the Conservatives, before being hit by Labour’s recent decision to cut the Winter Fuel Payment. The last thing they need now is uncertainty over the triple lock.”\nI’m extremely proud of my party’s legacy to introduce this vital support for pensioners and rest assured, I will fight tooth and nail against the Conservatives’ attempts to weaken it.”\nThe Liberal Democrats introduced the triple lock to allow for it to automatically increase in line with the economy and will fight to ensure it and pensioners are protected from successive governments that seem prepared to neglect retirees across the country.\nENDS",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_search/content_2.html": "Campaigns\nCampaigns Anna runs regular campaigns on a range of issues that matter to her constituents in Frome & East Somerset. You can find out more on the drop down menu above\nCampaigns Anna runs regular campaigns on a range of issues that matter to her constituents in Frome & East Somerset. You can find out more on the drop down menu above\nTell Anna Sabine about your experiences of Frome Leisure Centre Anna Sabine's campaign for better broadband I'm hearing about consistent and ongoing problems at the Frome Leisure Centre, run by…\nAnna Sabine's safe contacts policy SAFE CONTACTS POLICY Anna and her team have already been contacted by thousands of local residents asking for help with different issues. The overwhelming…\nContact Contact Anna Sabine ✉️ House of Commons, London, SW1A 0AA 💻 anna.sabine.mp@parliament.uk ☎️ 01373 476267 📱Instagram 🖥️ Facebook Helpful contacts Other sources of help and…\nAnna Sabine Anna was elected in 2024 to the newly formed constituency of Frome and East Somerset after a career in business and the charity sector. As Frome & East Somerset's…\nLiberal Democrat MP for Frome and East Somerset. Liberal Democrat MP for Frome and East Somerset. Anna Sabine is Member of Parliament for Frome and East Somerset. The constituency…\nYour vote WILL make the difference between whether our next MP is a Lib Dem or a Conservative MP.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-warns-new-nhs-figures-show-direct-link-between-lack-of-dentists-and-need-for-emergency-care/content_50.html": "Anna Sabine MP warns new NHS figures show direct link between lack of dentists and need for emergency care\nAnna Sabine MP warns new NHS figures show direct link between lack of dentists and need for emergency care\nNew figures released by the NHS show that the south west remains among the most poorly served areas for affordable dentistry. Whilst the south west has been previously flagged as having minimal access to NHS dentists, new figures released by the NHS show the seemingly direct effect this has on the high rate of dental and oral related injury admitted into emergency care.\nHaving spoken previously in the Lib Dem’s Opposition Day debate on dentistry about the “dental desert” of Somerset, Anna Sabine MP for Frome and East Somerset has warned of the cumulative effect poor oral health can have in contributing to larger health problems. Warning that access to dentistry for those in the Somerset must be assured “before they reach crisis point”.\nThe recently released figures, however, show that in places like Somerset where the dental activity delivery rate is less than 70%, the number of people visiting A&E for dental related issues can be as many as 500 per 100 000 people. This is comparative to areas with a higher percentage of dentist availability who have less than 80 people admitted to A&E with dental related injury.\nThe extra strain put on A&E staff who are already working to their limit is directly linked to poor primary care and Somerset is suffering as a result. Anna said of the situation,\n“The lack of access to primary care and NHS dentists not only undermines Somerset healthcare, but also shows a complete mismanagement of financing of the system. We need to start front-loading our NHS so that people can access healthcare when they need it and prevent illnesses from deteriorating further. This not only fails the suffering, but also fails the taxpayer and the emergency healthcare staff who have to deal with the consequences”.\nOral care for adults and children is crucial to ensuring overall health and needs to be addressed in order to help prevent further issues developing in an already overworked system.\nEnd.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_local-mp-anna-sabine-challenges-minister-on-sanctions-of-west-banks-illegal-settlements/content_23.html": "Local MP Anna Sabine challenges Minister on sanctions of West Bank’s illegal settlements\nLocal MP Anna Sabine challenges Minister on sanctions of West Bank’s illegal settlements\nSpeaking in today’s Foreign, Commonwealth and Development Office oral questions, Frome and East Somerset MP Anna Sabine asked the Government to sanction settlements in the West Bank as violence increases in the area.\nAmid the ongoing conflict which has seen tens of thousands of Palestinians displaced in Gaza, Anna drew attention to continued expansion of illegal settlements in the West Bank and the escalating violence operating within them.\n“In my constituency of Frome and East Somerset” she began “many people are very passionate about resolving the situation between Israel and Palestine, and there are concerns that violence in the West Bank has increased and that illegal settlements have continued to expand”.\nSince the ceasefire was agreed, the West Bank settlements have been declared illegal by the International Court of Justice, however the Government is yet to sanction them, which many see as a failure to uphold international law.\nDirecting her question at the Minister for Foreign, Commonwealth and Development Affairs, Anna persisted “Does the Minister not agree with me, that if he also wants to see a reduction in settler violence, we should consider sanctioning these settlements?”\nResponding to Anna, Minister Hamish Falconer MP agreed he was “concerned by the expansion of Israel’s operations” and upheld the belief that “Palestinians must be allowed home” and civilians protected. Whilst recognising Israel’s security concerns, he said Israel must “ensure its operations are commensurate to the threat posed”.\nFollowing the debate, Anna has said “like other MPs in the Chamber today, including Bath’s MP Wera Hobhouse, I am frustrated that the Government won’t move on sanctions. They are a tool that is available to them, and we need to put some actual pressure on those who support these illegal settlements.”\nAnna Sabine MP and the Liberal Democrats will continue to speak up to secure peace and freedom from violence for those vulnerable in Palestine, and this must begin with upholding declarations of international law and ensuring these laws are abided by.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_mp-tackles-road-safety-around-frome/content_29.html": "MP TACKLES ROAD SAFETY AROUND FROME\nNew MP for Frome & East Somerset, Anna Sabine, has taken action to improve road safety on the roads around Frome.\nIn her first week as a Member of Parliament, Anna convened an urgent meeting between Somerset Council and Avon Somerset Police, to see what could be done to reduce the number of collisions and near misses on the A361.\nAnna said “The meeting was very positive. I understand that there are a range of different causes for different accidents, and that any changes to the roads need to be based on evidence. But at the same time it is clear to most drivers that some junctions, particularly the A361/A362, could be improved.\nI was very pleased that Somerset Council have agreed to go away and see if any short term measures could be taken to improve safety in that location, in addition to their longer term review. Too many people are dying on the roads around Frome and it is an absolute priority for me that we reduce the number of collisions.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_liberal-democrat-candidate-anna-sabine-to-fight-for-frome-and-east-somerset-at-general-election/content_31.html": "Liberal Democrat candidate Anna Sabine to fight for Frome and East Somerset at General Election\nLiberal Democrat candidate Anna Sabine to fight for Frome and East Somerset at General Election\nAnna Sabine is the Liberal Democrat Parliamentary Candidate for Frome and East Somerset in the July 2024 General Election, as announced earlier today by Prime Minister Rishi Sunak.\nLiberal Democrat candidate Anna Sabine will be campaigning for action to tackle the cost of living crisis, the NHS crisis and the sewage scandal. As a business owner, Anna also wants to use her business experience to campaign for support to protect the local economy in difficult times.\nFor months now, Anna has been meeting with local residents up and down the constituency, campaigning to stop sewage being dumped into our beautiful local rivers, working with local campaigners to protect a 300-year old oak tree and speaking with business owners from Frome to Midsomer Norton.\nThe Liberal Democrats are on the up after beating the Conservatives at the May local elections and winning four stunning parliamentary by-election victories since\nthe last General Election, including in Somerton and Frome. Responding to Rishi Sunak calling a General Election, Anna Sabine said: “I am proud to stand for Parliament for my local area and am determined to give this constituency a strong voice in Westminster. The towns and villages in this new constituency have historically been taken for granted by their Conservative MPs.\n“I will be a local champion who will fight to protect our waterways, save our health services and support local businesses. I want to continue the work of Sarah Dyke, until now MP in part of the constituency, who has been delivering every day for local communities.\n“Every vote for the Liberal Democrats is a vote for a fair deal. It’s a vote for a party that will stand up for our community and our health services.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_89-increase-in-sewage-dumps-by-wessex-water-last-year/content_45.html": "89% increase in sewage dumps by Wessex Water last year\nNew figures released by the Environment Agency have shown that Wessex Water, which covers Somerset, discharged sewage a staggering 41,453 times last year, an 89% rise compared to 2022.\nFrome and East Somerset’s Liberal Democrats are calling for tougher action against sewage dumping in local rivers, including replacing Ofwat with a stricter regulator. The party has also called for a ban on bonuses for water company bosses whose firms have dumped sewage into waterways.\nConservative MPs have consistently voted against measures which would have helped to tackle the crisis.\nAccording to the Environment Agency figures, in the Radstock area, sewage was spilt into Wellow Brook 118 times, totalling 1487 hours.\nAnna Sabine, Liberal Democrat candidate for Frome and East Somerset, said:\n“It is a complete scandal that filthy sewage is being pumped into Somerset’s rivers and waterways.\n“Our community should not be forced to put up with this any longer yet time and again this Conservative government has voted against tougher action on sewage dumping.\n\"The Liberal Democrats have been leading the way in holding water companies to account and have called for tougher action to stop sewage being dumped in local rivers. We need to see a ban on bonuses for water company bosses whose firms have pumped filth into our waterways.\"",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_page-1/content_21.html": "Anna Sabine MP fights for better dental care\nAnna Sabine MP for Frome and East Somerset convened a Parliamentary debate on the important issue of Dentistry in Somerset. Anna spoke of how Somerset is “particularly neglected” as a region when it comes to access to dentists.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_about/content_7.html": "Anna Sabine\nfor Frome and East Somerset\nAnna was elected in 2024 to the newly formed constituency of Frome and East Somerset after a career in business and the charity sector.\nAs Frome & East Somerset's first ever MP, Anna is leading campaigns to improve road safety locally and at a national level as well as championing improvements for access to rural services like buses, pharmacies and dependable broadband. Anna continues to meet and work with local groups on improving environmental matters like the health of our rivers, as well as working to support constituents struggling with the cost of living.\nIn Parliament, she sits on a range of All Party Parliamentary Groups on issues ranging from suicide and self-harm prevention, to radiotherapy, and music education.\nAnna lives in Frome with her family and their dog, Buddy.\nJoin Anna's Team\nJoin the team of volunteers campaigning to make Anna the next MP for Frome & East Somerset\nAnna's campaign for Frome & East Somerset\nSign up for updates from Anna Sabine MP\nJoin Anna's mailing list for the latest updates on her campaign on this important issue.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-asks-for-constituent-feedback-ahead-of-meeting-with-broadband-minister/content_47.html": "ANNA SABINE MP ASKS FOR CONSTITUENT FEEDBACK AHEAD OF MEETING WITH BROADBAND MINISTER\nANNA SABINE MP ASKS FOR CONSTITUENT FEEDBACK AHEAD OF MEETING WITH BROADBAND MINISTER\nLater this month, Anna Sabine MP for Frome and East Somerset will be meeting with the Minister for Science, Innovation and Technology Chris Bryant to speak about broadband and mobile phone signal in rural areas.\nThis follows last year’s debate on financial inclusion where Anna spoke on many issues including the lack of useable broadband and the problems this can cause individuals and small businesses in rural areas. Anna has previously spoken about the crucial need for adequate connectivity to allow people in rural areas to access the increasingly digital world pointing out that “Financial inclusion and digital inclusion are critically linked”.\nIn the run up to this meeting Anna has reached out to residents in a number of villages around Frome and East Somerset to ask for their input and experiences with broadband and connectivity. A letter has this week been sent out to constituents who might be facing such issues. Anna has asked about experiences with broadband and mobile phone signal as well as encounters with Openreach who she is aware have quoted extremely high costings to extend broadband to some homes.\nIn light of the Government’s recent contract with Openreach to deliver gigabit- capable broadband across Mid Devon, North Somerset and South Devon as part of their Project Gigabit, Anna wants to ensure they take steps towards ensuring the entirety of the south-west has the coverage and connectivity required.\nAnna has previously spoken on the issues specifically facing small businesses and farmers in the area who are often unable to get broadband beyond the end of their farm track, sometimes a mile from their home. Without decent broadband, businesses can struggle to function and in a modern world of home working, this can cause issues beyond businesses, to individual workers as well.\n“In today’s world, decent broadband and mobile phone signal should be available to everyone. Money management, connecting to family and friends, and the ability to work are all crucially interlinked with digital connectivity and I want to ensure that residents in the villages of Somerset are heard by the Minister and importantly, listened to. It’s simply not acceptable that rural areas are left behind”.\nAnna looks forward to meeting with the Minister whom she has previously written to with regards to rural broadband, but has yet to have a response from.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_page-3/content_11.html": "Free To Be Who You Are\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nAnna Sabine is Member of Parliament for Frome and East Somerset. The constituency includes the towns of Frome, Radstock and Midsomer Norton as well as many villages all the way from Bath to Shepton Mallet. On this website you can find out about Anna’s campaigns and activities in Parliament as well as get in touch or offer your support.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_page-4/content_3.html": "Britain must lead on defence and aid\nThe UK needs to strengthen both our Armed Forces and our soft power.\nAnna Sabine is Member of Parliament for Frome and East Somerset. The constituency includes the towns of Frome, Radstock and Midsomer Norton as well as many villages all the way from Bath to Shepton Mallet. On this website you can find out about Anna’s campaigns and activities in Parliament as well as get in touch or offer your support.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-selected-as-parliamentary-candidate-for-frome-east-somerset/content_41.html": "Anna Sabine selected as Parliamentary candidate for Frome & East Somerset\nLocal party members have selected local businesswoman and campaigner Anna Sabine as Parliamentary candidate for the new marginal Frome & East Somerset constituency.\nOur expanded local party’s new constituency is positioned in an area of Lib Dem strength - straddling the two council areas of BANES and Somerset which we dominate. In the last local elections, we enjoyed massive successes and inflicted a heavy defeat upon the Conservatives.\nThe new constituency also includes a significant part of the current Somerton & Frome constituency where, last summer, Sarah Dyke won the by-election with a resounding 29% swing from the Conservative party.\nAnna Sabine lives in the constituency where she is raising her family. She is an entrepreneur who has run award-winning businesses.\nAnna’s top three priorities for the constituency are:\n-\nSaving our streams and rivers from sewage discharges: In 2022, there were 110 pollution incidents by Wessex Water and several hundred more in the past five years. Liberal Democrats are calling on water companies to be taxed and for an end to sewage dumping in our waterways.\n-\nCutting ambulance waiting times: Local people have been left waiting hours for an ambulance in an emergency; the Liberal Democrats are calling for a 5-point plan to tackle the ambulance wait time crisis including higher recruitment and retention alongside more investment into social care.\n-\nTackling the cost of living and supporting local businesses: Anna wants to use her business experience to campaign for support to protect the local economy in difficult times.\nAnna Sabine said:\n“I am proud to stand for Parliament for my local area and am determined to give this constituency a strong voice in Westminster. The towns and villages in this new constituency have historically been taken for granted by their Conservative MPs.\n“I will be a local champion who will fight to protect our waterways, save our health services and support local businesses. We have our Lib Dem MP, Sarah Dyke, in part of the constituency who is delivering every day for local communities, and I want to follow in her footsteps.\n“At the next election, it will be a two-horse race between four more years of a tired and out of touch Conservative party, or a fresh start with a Liberal Democrat MP.”\nLiberal Democrat Leader Ed Davey said:\n\"It is fantastic to see Anna selected for her local area. Anna's expertise in running a local business and her passion to deliver change is exactly what Frome and East Somerset needs after years of Conservative neglect.\n\"Somerset has been taken for granted by the Conservative party for far too long. At this year's election, it will be a two-horse race between a committed local campaigner in Anna, or four more years of a tired and out of touch Conservative party. I can't wait to visit to campaign for Anna.\"\nSomerton & Frome Lib Dem MP Sarah Dyke added:\n“Relinquishing part of the existing constituency was never going to be easy, but I am thrilled that Anna is our candidate for Frome & East Somerset. She shares my passion for our communities and has the strength and determination to be an excellent MP. I will continue to work hard for Frome and will ensure that Anna is ready to hit the ground running.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_back-anna/content_16.html": "Support grows for Anna Sabine\nElections in Frome and East Somerset are a close fight between the Liberal Democrats and Conservatives\nPeople feel let down and betrayed by this Conservative Government.\nLib Dem Anna Sabine is leading the fight to get a fair deal for our communities.\nThis new Frome and East Somerset constituency covers a large area of East Somerset - and as well as Frome, it includes Evercreech, Midsomer Norton, Radstock and Peasedown.\nIt's Lib Dem Anna vs the Conservatives here - Labour and the Green Party are out of the race.\nBack Anna to stop the Conservatives taking Somerset for granted.\nI'm backing Anna\nMore and more people are backing local Liberal Democrat Anna Sabine to win in Frome and East Somerset at the General Election.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_local-mp-anna-sabine-calls-on-chancellor-to-save-frome-and-east-somersets-high-streets-at-the-spring-statement/content_19.html": "Local MP Anna Sabine calls on Chancellor to “save Frome and East Somerset’s high streets” at the Spring Statement\nLocal MP Anna Sabine calls on Chancellor to “save Frome and East Somerset’s high streets” at the Spring Statement\nAhead of the Spring Statement on Wednesday, Anna Sabine MP for Frome and East Somerset has urged the Chancellor to save the small businesses.\nWith the impending hike in employers’ national insurance, set to come into effect on 6th April, businesses in Frome and East Somerset are fearful for their future.\n“I meet business owners every day who are worried about how they will survive. The rise in NICs means that many employers will be forced to let staff go, if not close completely. Not only is this a terrifying possibility for those directly involved but it will also lead to a larger strain on society with more people out of work, and less money moving through local economies.” Anna said.\n“We don’t want to see more boarded up high streets, we want to make sure small businesses are given the circumstances and opportunities to flourish and succeed. The Chancellor must abandon this tax plan and start to address a system which rewards larger companies and abandons small enterprises”\nAnna Sabine MP is committed to supporting small businesses locally. She is hosting a Business Breakfast this week which will bring together many people from across the constituency to discuss and support each other going forward, and will continue to call on the Government to make drastic changes to business rates to allow growth in the local economies.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_page-1/content_4.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nAnna Sabine is Member of Parliament for Frome and East Somerset. The constituency includes the towns of Frome, Radstock and Midsomer Norton as well as many villages all the way from Bath to Shepton Mallet. On this website you can find out about Anna’s campaigns and activities in Parliament as well as get in touch or offer your support.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_https__vimeocom_924633156sharecopy/content_39.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-wins-concessions-on-bus-passes-for-disabled-people/content_18.html": "Anna Sabine MP wins concessions on bus passes for disabled people\nAnna Sabine MP wins concessions on bus passes for disabled people\nAnna Sabine MP for Frome and East Somerset appeared on BBC Radio Somerset this morning speaking of her delight at the proposed changes to Diamond Bus Pass use in the WECA area.\nSpeaking to Charlie Taylor live this morning, she spoke about the women she met with at SWALLOW in Radstock who were “really the inspiration for the whole campaign” when they told her how they couldn’t use their pass to get to jobs in Bath. “I’m really pleased to hear her on that clip, that’s really lovely. I’m glad she’s so happy” Anna said about Hetty, who was also interviewed on the BBC show about her feelings on the new rules.\nThe change has come following an announcement made last week by WECA who have said they are relaxing the rules of the Diamond Bus Pass use which had been restricted to use after 9.30am, meaning disabled bus users and those with learning difficulties such as Hetty, were unable to use it for their morning commute. Anna Sabine MP has previously raised the issue in the press and with councils, as well as writing to the Minister for Local Transport, Simon Lightwood, in the hope of getting what she sees as a simple change which will help users pursuing their independence.\nWhen asked whether this was an unfair allowance given that in this case, the bus pass users have paid jobs, Anna said:\n“...I totally get that, I get the argument, but the thing is here is that people with learning and other disabilities are being given bus passes because it’s recognised that they don’t necessarily have an option to drive. They have other challenges they’re facing in life that might cost them money and I really think anything we can do to support people like Hetty to live independently and work and contribute to society is absolutely fantastic.\"\nWhilst the changes in WECA mark a positive move for those in the region, others in Somerset will not currently be able to enjoy the change, but Anna intends to continue raising awareness on the issue in the hope that such measures can be extended to other areas as well.\n“I’ll just have to keep campaigning in Somerset, I really understand that councils are under a large amount of pressure [----] I’m going to work really hard with Somerset to see if we can make some tweaks and changes around the current system.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_volunteer/content_12.html": "Help Us Build a Better Frome and East Somerset\nVolunteer to help the Liberal Democrats\nBecome a volunteer today\nJoin our team of volunteers today and make a difference. Thousands of Liberal Democrat volunteers up and down the country are helping to elect community champions, get a fair deal for people in Britain, and change the world for the better. Join the team and become a volunteer today.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-slams-government-announcement-on-sustainable-farming-incentive/content_20.html": "Anna Sabine MP slams Government announcement on Sustainable Farming Incentive\nAnna Sabine MP slams Government announcement on Sustainable Farming Incentive\nAnna Sabine MP for Frome and East Somerset has slammed the Government’s announcement to abruptly end applications for the Sustainable Farming Incentive.\nThe announcement made yesterday evening was given with just 30 minutes notice to the NFU before closing the window during which farmers could access the fund. It had previously been promised that the NFU and farmers would be told six months in advance of any closure of the fund and the sudden end shows a “callous disrespect” to the community says Anna.\n“The sudden closure of the SFI fund is nothing short of a cowardly move by the Government showing a complete disregard to farmers and their welfare. The lack of notice period before the closure shows a callous disrespect for a community who have faced blow after blow from the Labour Government and are struggling to survive.”\nThe news follows other attacks on farmers which make it harder and harder for them to sustain a business up against increasing costs and will hit smallhold farms who previously invested in new technologies to become more environmentally sustainable under the Sustainable Farming Incentive.\n“The Government continues to compound damage done and a disregard shown to farmers and rural communities from previous Conservative administrations and this decision without proper consultation with the NFU, again shows a short-sighted attitude from Labour that makes it impossible for farmers to survive in the current climate.\nIn a time of international unrest, it is more important than ever to ensure we are self-sustaining, and farmers need to be respected for what they do and can offer in the future.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_anna-sabine-mp-speaks-in-emotional-debate-on-road-safety-and-young-people/content_40.html": "Anna Sabine MP speaks in “emotional” debate on Road Safety and Young People\nSpeaking in a Westminster Hall debate today on Young People and Road Safety, Anna Sabine MP for Frome and East Somerset made an emotional speech calling for “serious consideration” to be given to new measures around road safety for young drivers.\nReferencing the dangerous roads around Frome and East Somerset and the spate of recent accidents, Anna spoke of the need for more preventative measures to be introduced. Recognising the necessity of cars and driving in rural areas, and the crucial access driving gives to young people in villages to access jobs and education, she spoke of her “really serious concerns” regarding the safety of young drivers.\n“I have some really serious concerns about [her teenage son’s] safety when he does start to drive. My constituency has a lot of A-roads, which are windy and fast, and often have junctions off to the side where drivers are trying to pull out onto the main road. We have a history of accidents in the local area, including a horrendous one in 2023 where two young sisters were killed by an oncoming vehicle.”\nSpeaking of her campaign for new road safety measures, some of which have recently been introduced to a dangerous junction outside Frome, Anna criticised the lack of council or government funding available to take further preventative action such as the installation of traffic lights. “We can’t put in the kind of preventative measures [-]mentioned if we can’t fund them”\nAnna spoke of recent figures from road safety charity Brake that suggest 1 in 5 drivers crash within a year of passing their test. She suggested serious consideration needs to be given to restrictive driving schemes such as Graduate Drivers Licenses, levels of which are already in place in Northern Ireland, and in the UK for motorcyclists with some success. Such schemes could potentially limit the amount of passengers in a car or the speed allowance for new drivers and would hope to lessen the amount of accidents in those critical first 12 months.\nWhilst such a scheme would need to be carefully considered so as not to restrict the access and independence a license gives to a young person in rural areas, Anna strongly believes “it warrants a conversation, because it’s young people who have the most to lose if we can’t get this right.”",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_page-2/content_28.html": "Anna Sabine MP secures meeting with minister on hospice care in first PMQs\nThe Prime Minister Keir Starmer today promised local MP Anna Sabine a meeting with the relevant minister to discuss her concerns about hospice funding. At today’s PMQs she spoke on behalf of local hospice Dorothy House.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_donate/content_9.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowAs a party we rely on our members and supporters to fund our local campaigning, unlike the Conservatives or Labour we can’t rely on big business or Trade Unions. Please donate today to support Liberal Democrat campaigns in Bath, Frome and East Somerset, and North East Somerset and Hanham. Thank you!\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_contact/content_10.html": "SAFE CONTACTS POLICY\nAnna and her team have already been contacted by thousands of local residents asking for help with different issues. The overwhelming majority of contacts have been appropriate and polite. However, sadly, we have already had a few instances of unacceptable or threatening behaviour.\nFollowing the murder of two MPs in recent years, Anna Sabine and her team will be working within the following safe contacts policy:\n- Threats, abuse, harassment, swearing, intimidation, aggression and shouting will not be tolerated.\n- If your contact with Anna or a member of her team includes any such content, we will end our communication with you and we may report you to the appropriate authorities.\n- This policy applies to all forms of contact, including email, social media, phone calls and in-person events and meetings.\nWe appreciate that you may be contacting Anna about a situation that is causing you great frustration or distress, but it is not appropriate for Anna or her team to be subjected to any form of abusive behaviour.\nThank you for your understanding and co-operation.",
  "https_www_anna4fes_uk_/https_www_anna4fes_uk_news_article_police-taking-over-five-hours-to-respond-to-burglary-calls-in-avon-and-somerset/content_43.html": "Police taking over five hours to respond to burglary calls in Avon and Somerset\nPolice in Avon and Somerset are taking an average of 5 hours and 21 minutes to respond to burglary calls, damning new figures uncovered by the Liberal Democrats have revealed.\nThis is a dramatic 68% increase on response times compared to figures from 2021/22, where it took an average 3 hours and 10 minutes to respond to burglaries.\nAcross England, police are taking an average of 9 hours and 8 minutes to show up at the scene when a burglary was reported. This is a 25% increase when compared to the previous year and an 87% increase on burglary response times in 2020/21.\nFrome and East Somerset’s Liberal Democrats have slammed the Conservative Government for these figures, arguing that years of ineffective resourcing have left local police forces overstretched, under-resourced and unable to effectively respond to local crime.\nThis includes taking more than 4,500 Police Community Support Officers (PCSOs) off the streets since 2015.\nThe party is calling for a return to proper community policing, where officers are visible, trusted and able to focus on responding to neighbourhood crime like burglaries.\nCommenting, Liberal Democrat Parliamentary Candidate for Frome and East Somerset, Anna Sabine said:\n“People in Frome and East Somerset deserve to feel safe in their own homes. The fact that traumatised burglary victims are being left waiting for hours, wondering if the police will even arrive, is unacceptable. It is unforgivable that crucial evidence may be lost in the process too.\n“I will continue to call for proper community policing to be restored, so people in our area can be confident that if they do fall victim to crime, the police will turn up and investigate properly”."
}