{
  "https_www_gordonscott_org_uk_/https_www_gordonscott_org_uk_aboutgordon/content_2.html": "Hi, I'm Gordon Scott and I am the Reform UK constituency spokesman for Torbay. I am a discretionary investment manager at present, but I have formerly worked as an accountant, yacht mate, captain, steward and chef. By education I am an historian and personally I am a Christian and follower of Jesus Christ.\nThis truth is preserved in several of our constitutional laws such as the Bill of Rights which asserts that no declarations, judgements, doings or proceedings (shall be done) to the prejudice of the people. It seems to me that government has forgotten where it stands in this relationship which is beneath the people and needs to understand that it is appointed by the people and answerable to them.\nFundamentally, I believe in people, their ability to do good to one another and their desire to live in peace with their neighbours. However, government evidently does not and proceeds to write and vote through legislation that inhibits more and more aspects of our lives. This process now seems never ending and is only likely to stop if we stand up and say no to government technocrats.\nIn standing for you, I shall endeavour to fight against all legislation that is being written to the detriment of the population and fight to remove existing legislation as far as I can. I am convinced that, with the administrative state restricted, the country will begin to find its soul again and we can work together to restore trust in our institutions and Make Britain Great Again!",
  "https_www_gordonscott_org_uk_/https_www_gordonscott_org_uk_thereformparty/content_4.html": "As a nation we have so much potential, so much that we should be optimistic about. We can make Britain great again.\nI have chosen to stand for Reform UK as they align best with my principles and are the only political party that are listening to people and endeavouring to provide solutions to our problems. I believe that the inability of incumbent political parties to address the issues that affect normal people requires that we form a new party, Reform UK, to resolve this. The party have agreed upon a set of principles that they wish to govern by that I have set out below.\nGovernments must recognise they may only govern by consent, that the people hold the power over them.\nCertain freedoms, rights and liberties should always be guaranteed, regardless of circumstance. Governments must demonstrate beyond reasonable doubt when limiting freedoms that it is to conducive to the common good. Freedom of speech, faith, expression and conscience should always be guaranteed.\nGovernments should reduce taxes to a minimum and demonstrate value for money for every pound spent.\nPeople should have the right to ownership of property and goods without the burden of undue taxation or predatory practices by larger entities. Cash must also be preserved as a way of limiting the power of the state and other bodies.\nThe Government's first duty is to defend the people from foreign and domestic threats to life, property and liberty.\nRegulations should not benefit larger organisations over smaller entities. The focus of regulation should be on protecting the rights of the consumer and employees from harm.\n0nly the state should provide defence, policing, judicial functions, border security and prisons.\nThe Government should protect at all times our institutions, democratic process, culture and national discourse from undue foreign, supranational or corporate influence.",
  "https_www_gordonscott_org_uk_/https_www_gordonscott_org_uk/content_1.html": "FIND OUT MORE ABOUT WHAT THE REFORM PARTY CAN DO FOR YOU\nGordon is passionate about serving you and delivering a better way for Torbay. Click below to get to know Gordon more.\nLEARN MOREReform is essential for delivering a better way for Torbay. Click to see what The Reform Party can do for you.\nsHOW MEWe would love to hear from you...",
  "https_www_gordonscott_org_uk_/https_www_gordonscott_org_uk_getinvolved/content_3.html": "I would like to encourage you to get involved in standing up for our futures by joining the party.\nThe best way is to make a small donation using the link below from which you will be added to our mailing list. Please feel free to contact me directly at Torbay@reformuk.com too.\nWe do not receive monetary support from the central party. Our campaign is only as effective as you make it. Help deliver for Torbay.\nWith the elections coming, make sure you register to vote and make your voice count."
}