{
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_22_tanning-lounge-thurcroft-maltby-england-business-awards-winners-2024/content_100.html": "They won!\nMany congratulations to Tanning Lounge Thurcroft and Tanning Lounge Maltby! Two local businesses working hard.\nAfter getting so close in recent years, the team there have now won the top prize.\nOnly goes to show, we only win the Best Tanning Salon award under a Labour government!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_33/content_343.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 8, 2024\nWoodsetts Christmas Fair\nDecember 7, 2024\nThe Squirrel Now Open at Dinnington\nDecember 7, 2024\nSmall Business Saturday\nPrevious Page\n1\n…\n31\n32\n33\n34\n35\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_campaigns/content_36.html": "Campaigns\nSpeeding on the A57\nI met with concerned residents living just off the A57. I have seen footage of the racing that occur…\nCampaigns\nSouth Anston High St/Sheffield Rd Proposal\nThank you to everyone who came to the South Anston street surgery – turned impromptu public me…\nCampaigns\nPublic Meeting: Speeding & Traffic Concerns in Sitwell, Whiston and Wickersley\nPUBLIC MEETING: SPEEDING and TRAFFIC CONCERNS IN SITWELL, WHISTON and WICKERSLEY Since b…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_25/content_217.html": "Poppies Tea Room\nGreat to pop into Poppies Tea Room for their Christmas event – they have hot pork rolls, mulle…\nStreet Surgery in North Anston\nWinter sun for my street surgery in North Anston yesterday, which focused on how we can tackle car t…\nUK Parliament Week\n🗳️UK PARLIAMENT WEEK🗳️ This week has been UK Parliament Week, which is…\nWales High School Visit\nLast week, I visited Wales High School and met with the headteacher, Lisa McCall. We discussed a wid…\nTodwick Public Meeting\nThank you to all the residents in Todwick who attended the public meeting last Friday, with discussi…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_11_sworn-my-allegiance-to-his-majesty-the-king/content_88.html": "I have sworn my allegiance to his majesty the King, and formally affirmed my commitment to everyone here in Rother Valley.\nAs your MP, you may not always agree with me, but you will always know where I stand, how to contact me, and I will do everything within my power to help you, your family and our communities.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_31_visit-to-mixamate/content_212.html": "Last week, I visited Mixamate‘s site in Dinnington to see the manufacturing of volumetric concrete mixers (VCMs) for myself.\nVCMs can make and pour any combination of concrete and produce no waste water or waste concrete, making them incredibly efficient. The success of VCMs sees Mixamate, who distribute for IHS, currently exporting to three different continents.\nMore recently, the site have just accepted an export order to Denmark worth half a million pound, which is brilliant news for Mixamate, manufacturing and employment in the local area.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_30_ending-the-injustice-of-the-mineworkers-pension-scheme/content_102.html": "It is a national scandal that former miners across Rother Valley, from Maltby to Dinnington to Thurcroft to Brookhouse to Kiveton Park, have had to fight for so long for the pension settlement they deserve. Today, I am proud that Labour ends this injustice and delivers what is rightfully owed back to mining families.\nAlmost 2000 former mineworkers in Rother Valley will receive an immediate uplift in their weekly pension, overturning an historic injustice and ensuring fair payouts for years to come.\nOnce and for all, the Investment Reserve from the Miners’ Pension Scheme will be transferred back to miners, boosting pensions by an average of 32 per cent.\nThis is a victory for the relentless campaigning of the trustees, members, and coalfield communities here in Rother Valley.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_04_brampton-en-le-morthen-whitestone-meeting/content_93.html": "Thank you to all residents who came to speak with me about Whitestone Solar Farm at The Rising Deer in Brampton en le Morthen. Meetings like these are important as they allow residents to share their opinions and ask me questions.\nI hold public meetings regularly, alongside being out and about across Rother Valley every single week, talking to residents and answering questions about a wide range of topics. We might not always agree, but I will always be accessible to my constituents.\nIf you would like to share you thoughts on Whitestone or raise an issue with me, please email jake.richards.mp@parliament.uk.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_10/content_95.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nSeptember 19, 2024\nRaising Speeding issue in Parliament\nSeptember 11, 2024\nAndy’s Man Club Came to Parliament\nSeptember 3, 2024\nScenes of Violence and Thuggery\nPrevious Page\n1\n…\n8\n9\n10\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_26_maltby-academy-visit/content_248.html": "It was a privilege to speak with students at Maltby Academy for UK Parliament Week.\nThank you to all the students who asked a wide range of questions – you all put me through my paces\nIt was a privilege to speak with students at Maltby Academy for UK Parliament Week.\nThank you to all the students who asked a wide range of questions – you all put me through my paces",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_41/content_31.html": "Public Meeting: Speeding & Traffic Concerns in Sitwell, Whiston and Wickersley\nPUBLIC MEETING: SPEEDING and TRAFFIC CONCERNS IN SITWELL, WHISTON and WICKERSLEY Since b…\nA57 Crossing: Update\nWhen I was elected as our MP, I urgently requested an update from the council as to when the crossin…\nMale Suicide Support for Andys Man Club Maltby, Better Today, The Learning Community Ltd and others\nMALE SUICIDE – support for Andys Man Club Maltby, Better Today, The Learning Community Ltd and…\nDinnington High Street Update Letter – July 2024\nI have received a response to my letter, sent last week, seeking an urgent update as to the high str…\nTanning Lounge Thurcroft & Maltby – England Business Awards Winners 2024\nThey won! Many congratulations to Tanning Lounge Thurcroft and Tanning Lounge Maltby! Two local busi…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_17_street-surgeries/content_227.html": "Two brilliant street surgeries in Brookhouse and Letwell this evening. Thank you to everyone who came, it really is one of the best parts of the job meeting residents and answering your questions. It’s always fun whilst juggling parenting too!\nNeed my help? Please email jake.richards.m[email protected]\nSubscribe to my monthly newsletter here: https://mailchi.mp/…/sign-up-for-jake-richards-newsletter",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_28/content_223.html": "Remembrance Sunday\nGreat to be with the Dinnington Cadets this morning, as we prepare for services of Remembrance acros…\nRemembrance Service in Brampton en le Morthen\nIt was an honour to lay a wreath at this morning’s remembrance service in Brampton en le Morth…\nDoncaster Sheffield Airport Update\nExciting news! Really pleased to hear that Doncaster Sheffield Airport will be reopening, with passe…\nConstituency Garden of Remembrance\nRemembrance is a time to reflect and remember those who gave their lives for our freedoms and to exp…\nDinnington Remembrance Festival\nI had a wonderful time at the Dinnington Remembrance Festival on Sunday. It was a well-attended even…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_05_dinnington-remembrance-festival/content_272.html": "I had a wonderful time at the Dinnington Remembrance Festival on Sunday. It was a well-attended evening, with the Dinnington Colliery Band putting on a fantastic performance. They even let me join them at the interval!\nIt was a great spectacle watching the standards paraded into the Lyric and to see local cadet groups in attendance.\nThough sombre in parts, it was also a very enjoyable evening – and great to see so many friends.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_20_todwick-public-meeting/content_287.html": "Thank you to all the residents in Todwick who attended the public meeting last Friday, with discussion centred around the state of the roads and pavements, speeding on the A57, the solar farm proposal and questions about national policy.\nAs promised, I am working with the police to hold a meeting about speeding on the A57 and will communicate with residents when we have a date, time and venue confirmed.\nIf you need my assistance, do email jake.richards.mp@parliament.uk and my team and I are always happy to help",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_37/content_61.html": "Macmillan Annual Coffee Morning 2024\nToday is Macmillan Cancer Support’s annual Coffee Morning. I am down at Kiveton Park Medical P…\nGuide Dogs Campaign\nGreat to meet Jamie this week. I’m supporting the Guide Dogs campaign to ensure access for bli…\nHarrycroft Quarry Blast\nOver the weekend, I have had numerous residents reach out to me about the blast from the Harrycroft …\nMaltby and Dinnington Business Meetings\nOur high streets are the beating heart of our communities. For too long they have been underfunded, …\nDinnington Community Boxing launches new gym\nI had a great time at the launch of Dinnington Community Boxing club’s new gym at Dinnington High Sc…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_13_dinnington-banking-hub-open/content_322.html": "31-33, Laughton Road, Dinnington, Sheffield, S25 2PN\nHead down to the Banking Hub for all of your banking needs, open Monday to Friday from 9-5pm. Dinnington and the surrounding areas are in safe hands, with the staff having over 35 years of experience.\nYou can organise face to face meetings with Natwest on a Monday, Halifax on a Tuesday, Santander on a Wednesday, HSBC on a Thursday and Barclays on a Friday.\nThank you to all of the local councillors and my predecessor who helped to make this happen.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_01_public-debate-assisted-dying/content_241.html": "Last night, I held a meeting with residents from across the constituency on the issue of assisted dying. This is clearly a complex and very sensitive issue. People came and offered opposing views – and raised some really important points on both sides which made me think again about my position. Thank you to everyone who attended.\nBut I also wanted to comment about the nature of the debate. Although people disagreed, the meeting was really encouraging because it was undertaken with complete respect, sensitivity, empathy and friendship. People disagreed agreeably.\nSometimes in politics, and public life, we too often ‘hate’ our opponents, or obsess about the personalities, rather than the issues. Some of the debate and posts about politicians (of all political parties) can be horrible – I have had numerous threats and abuse over the last few months, and the police have reached out to me to support.\nBut it doesn’t have to be like that. And actually the vast majority of people, of whatever political persuasion, respect one another and can debate calmly. I really welcome that.\nI will be holding further such meetings, in person and online, for constituents to raise issues and debate with me.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_05_rotherham-hospice/content_139.html": "I was grateful to be invited to Rotherham Hospice to take a look around and meet the CEO, Mat Cottle-Shaw.\nWe discussed the future of hospice care in Rotherham and the importance of hospice services in our communities for those who may sadly need end of life care.\nI was blown away by both the staff and facilities. Rotherham Hospice provide invaluable care 24 hours a day, 7 days a week with compassion and warmth every step of the way.\nThank you for everything you do.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_24_david-tomlinson-book-launch-at-maltby-manor/content_245.html": "What a brilliant night at the Manor in Maltby – celebrating David Tomo Tomlinson’s book launch. It was great to see so many people support Tomo, and I am half way through the book which is well worth buying for Christmas. Copies still available at the Manor and all proceeds go to Rotherham Rise – a charity that tackles violence against women and girls.\nThe book is set in 1984 during the strike and is both hilarious and poignant! Do go and get it when you have a moment.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_03_police-meeting-with-residents-in-todwick-regarding-a57/content_299.html": "Following my request, I am really pleased to see that the police have organised a public meeting with residents about the A57.\nMany issues to discuss, including speeding and car meets. Will be a great opportunity to ask the police questions about their ongoing work.\nEveryone welcome – do share far and wide.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_17_big-power-for-little-london-update-july-2024/content_39.html": "For many months, Big Power For Little London have been campaigning for changes to the law to end no-fault evictions.\nI’ve just come out of the King’s Speech, where his Majesty King Charles announced that the Labour government will be legislating to do just that in the coming weeks.\nA great start. More to do.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_12_training-for-the-wickersley-10k/content_258.html": "Wickersley’s first ever 10km race, Wickersley 10, is in March this year and I was out along Chesterfield Canal getting the miles in today.\nThe race will be raising money for Sheffield Children’s Hospital, in memory of Nick Walker.\nI’ll see you on the start line!\nYou can enter here: https://www.eventbrite.co.uk/…/wickersley-10k-tickets….",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_14_wickersley-street-surgery/content_4.html": "Thank you to all the residents who came to my street surgery in Wickersley, with many residents raising their concerns about the proposed Exagen Solar Farm.\nMany of you will have seen the plans to build a 49.9MW solar farm to the south-west of Wickersley, east of Whiston and north-west of Thurcroft, with a planning application due imminently.\nDue to the sheer volume of solar farm applications in our local area, Rother Valley would be taking on a disproportionate amount of solar. Therefore, I cannot support the Exagen Solar Farm application when it comes.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_10_world-mental-health-day-2024/content_174.html": "Mental health is just as important as our physical health and it is so important to talk about our thoughts, feelings and worries openly to our friends and family, or to other people anonymously.\nI recently spoke to Andy’s Man Club about the importance of talking groups to help with men’s mental health. Women A.S.K are a group for women to go to in Rotherham to speak about their mental health in a safe space, or to simply go and listen. Both talking groups are amazing and I would encourage anyone who needs support to take that leap of faith and go along.\n#ITSOKAYTOTALK#itsokaytonotbeokay\nPlease find a list of helplines and groups below if you need help.\nSamaritans: 116 123\nIf you need someone to talk to 24/7.\nMIND: 0300 102 1234\nIf you need someone to talk to from 9am to 6pm, Monday to Friday.\nPapyrus: 0800 068 41 41\nA 24/7 helpline to support under-35s at risk of suicide and others who are concerned about them.\nAnxiety UK: 03444 775 774\nSupport and advice for those living with anxiety.\nBeat: 0808 801 0677\nOffers information and advice on eating disorders.\nCampaign Against Living Miserably (CALM): 0800 58 58 58\nFor anyone affected by suicide or suicidal thoughts.\nAndy’s Man Club: Meet at Brooklands Club, Maltby every Monday at 7pm\nhttps://andysmanclub.co.uk/find-your-nearest-group\nWomen A.S.K Rotherham: Meet every Wednesday 7-9pm at Rawmarsh Health Centre, Rotherham https://womenask.co.uk/",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_20_leger-lakes-tearoom/content_232.html": "Brilliant to pop into Leger lakes Tearoom for a spot of lunch last week and to catch up with Mick.\nThe food is wonderful and you can even enjoy a bite to eat outside surrounded by some of their animals. 🐓 🐐\nWhere is your favourite place to eat in Rother Valley? Do let me know below!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_36/content_344.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 30, 2024\nWhite Ribbon Day\nNovember 30, 2024\nPublic Meeting on Fireworks\nNovember 29, 2024\nTerminally Ill Adults (End of Life) Bill – Second Reading\nPrevious Page\n1\n…\n34\n35\n36\n37\n38\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_12_dinnington-christmas-festival/content_285.html": "I had a wonderful time at the Dinnington Christmas Festival on Saturday. The Lyric Dinnington looked spectacular, with stalls selling a range of Christmas gifts and sweet treats. Dinnington Methodist Church had a wonderful offering too and I know that Dinnington Salvation Army did a brilliant job all day.\nIt was great to catch up with Cllr Amanda Clarke, Dinnington Labour. Amanda helped raise £174 for the fabulous Dinnington Colliery Band and rounded it up to £200 herself.\nThank you to Dinnington St John’s Town Council for working really hard to pull the whole festival together. Some of the Town Councillors dressed up as Santa’s elves and put on a very festive experience in Santa’s Grotto.\nThis was Dinnington at its best – thank you.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_48/content_275.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 23, 2024\nBus Franchising Consultation Now Open\nOctober 22, 2024\nRoyal Mail Survey\nOctober 22, 2024\nDinnington Banking Hub Information Event\nPrevious Page\n1\n…\n46\n47\n48\n49\n50\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_28_whiston-power-station-update/content_72.html": "I met with National Grid regarding the ‘Brinsworth’ project, also known as the Whiston project. Due to current limitations at the Brinsworth substation, a new 400kV substation is required to upgrade the energy capacity from 275kV to 400kV. This upgrade is essential to ensure we can meet the increased energy demands in our area. The planning application will be submitted in early 2025 and if approved, construction is set to begin in the summer of 2026, with the project becoming fully operational by winter 2029. During the meeting, I asked about the impact of the project on our local environment, and the possible increase in noise pollution and disruption to the village during the construction. I will be keeping a close eye on the application and continue to meet with National Grid.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_23_poppies-tea-room/content_254.html": "Great to pop into Poppies Tea Room for their Christmas event – they have hot pork rolls, mulled wine, cakes, and Santa Claus!\nOpen till 4 PM today, and raising money for good causes. It’s brilliant in there so do pop in on this rainy day.\nGreat to pop into Poppies Tea Room for their Christmas event – they have hot pork rolls, mulled wine, cakes, and Santa Claus!\nOpen till 4 PM today, and raising money for good causes. It’s brilliant in there so do pop in on this rainy day.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_57/content_173.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nSeptember 23, 2024\nHarrycroft Quarry Blast\nSeptember 20, 2024\nMaltby and Dinnington Business Meetings\nSeptember 20, 2024\nDinnington Community Boxing launches new gym\nPrevious Page\n1\n…\n55\n56\n57\n58\n59\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_61/content_85.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nAugust 11, 2024\nScarecrow Trail in Firbeck 2024\nAugust 7, 2024\nPublic meeting in Whiston – August 2024\nAugust 3, 2024\nAston Summer Carnival 2024\nPrevious Page\n1\n…\n59\n60\n61\n62\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_07_doncaster-sheffield-airport-update/content_278.html": "Exciting news! Really pleased to hear that Doncaster Sheffield Airport will be reopening, with passenger flights expected to take off in April 2026. This is great news for jobs, the economy and holiday makers.\nWell done to everyone involved in making this happen.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_09_christmas-card-competition-winner/content_282.html": "I had the absolute pleasure of surprising Harvey Goodrich, a pupil in Year 1 at Anston Park Infant School, with his winning Christmas card design on Friday in front of his whole class! I was really impressed with Harvey’s spectacular Christmas tree and his use of colour on his entry.\nThis is my first Christmas card as the Member of Parliament for Rother Valley and it will be distributed to 1500 residents, businesses and public services across the constituency.\nThank you to all the school children across the constituency who entered my Christmas card competition. I was blown away by all the festive designs I received.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_30_white-ribbon-day/content_312.html": "Monday 25th November was White Ribbon Day, where men showed their commitment to preventing violence against women and girls.\nSuch violence starts with men and we must address the attitudes and behaviours that contribute to a fear of violence for women in their day-to-day lives. We must also ensure that the system does all it can to protect women and girls from their abusers.\nOn White Ribbon Day, I highlighted the need for stronger enforcement of court orders after hearing from two brave women in Maltby. Both had suffered abuse and found that the system failed to protect them when their ex-partners violated court orders. This must change.\nYou can watch my question below.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_2/content_7.html": "Yorkshire Water £47 RIP Off Petition in Parliament\nThis week, I presented Rother Valley’s petition, signed by over 1000 residents, to the House of Comm…\nNew School Based Nursery in Rother Valley\nI am delighted that Todwick Primary School is one of the first 300 schools to be part of a new gover…\nVisit to Coffee Hut at Oh My Sweet Baby\nGreat to have Beth from Wales High School who is shadowing me today. We popped into the new Coffee H…\nVisit to Rotherham Hospice\nI found about the recent issues with the Hospice on social media – just like many people – and was i…\nBattery Energy Storage System at Hard Lane, Kiveton Park – Jake Richards MP Response\nI have formally submitted a response to the planning application for a Battery Energy Storage System…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_08_harvest-soup-lunch/content_161.html": "I was delighted to be invited to join the Harvest Soup Lunch at St Alban’s Barn in Wickersley. It was great to meet and speak to local churchgoers about a range of issues, including poverty, whilst raising money for Christian Aid. The event raised £129 and the soup was delicious! Thank you again.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_18_jake-richards-mp-introduces-private-members-bill/content_128.html": "I have introduced my Private Members Bill to Parliament today to help keep children in care close to people and places that matter to them. Second Reading on the Friday 28th March 2025.\nI have introduced my Private Members Bill to Parliament today to help keep children in care close to people and places that matter to them. Second Reading on the Friday 28th March 2025.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_19_preformed-windings-opening/content_302.html": "I had the huge privilege of opening Preformed Windings new unit in Wales on Friday 6th December.\nDue to consistent high growth, Preformed Windings have opened a second facility within 200 yards of their existing premises on the Vector 31 Industrial Estate. This new unit comes as part of a £3m capital investment programme and is a brilliant addition to Rother Valley.\nCongratulations – I wish Preformed Windings continued growth and success.\nRead more here – Preformed Windings Unveils State-of-the-Art Facility at Grand Opening Event – The Story – Preformed Windings",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_30_public-meeting-on-fireworks/content_283.html": "Fireworks are a great spectacle that many of us enjoy. I have received hundreds of comments and emails about the use of fireworks, with a variety of opinions shared. I am keen to hear your views on the future of firework usage and the possible considerations Parliament could take to bring around stronger legislation and regulation around the sale and usage of fireworks.\nI am holding an online public meeting to hear a range of views on Tuesday 3rd December at 19:30. You can sign up using the link below. 👇",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_20_dinnington-community-boxing-launches-new-gym/content_108.html": "I had a great time at the launch of Dinnington Community Boxing club’s new gym at Dinnington High School. The facilities are incredible and they will be an invaluable asset to Dinnington and the wider community. Everyone involved in the new gym should be really proud. The facilities will provide a much needed community hub for young people in Dinnington, as well as adult classes too – which will definitely be quite the workout!\nDC Boxing also played a huge role after the horrendous scenes in Wath over the summer. They organised events to show unity and solidarity in the face of division. Well done Ian and the whole team.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_24_woodsetts-public-meeting/content_157.html": "On Friday, I held a village meeting in Woodsetts and I want to say a huge thank you to all those who came. We had a great discussion about improving telecommunications in the area, as so many in Woodsetts have to put up with terrible mobile phone signal.\nThank you to those who raised local issues too. There were some actions for the village that I will look into urgently.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_24_male-suicide-in-rotherham/content_130.html": "Across the UK around 100 men take their own lives each week. And here in Rotherham, we have more male suicide than other areas of the country. I’m determined to take action.\nHear about some of the amazing services we have in our area for men dealing with difficult times.\nOver the next 12 months, I’m going to be fighting a public campaign to raise awareness of male mental health and suicide.\nThat starts tonight. I’m holding a debate in the House of Commons on male suicide in Rotherham. I’m going to be shouting from the rooftops about this important issue. More to come.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_6/content_98.html": "Wickerlsey 10k\nYesterday saw the inaugural Wickersley 10 hit the streets of Wickersley and Thurcroft and what a fan…\nConstituency Assistant\nAn opportunity has arisen to join my dedicated constituency team. This position is based at our Dinn…\nNational Tremor Foundation\nGreat to meet Kitty from Maltby in Parliament! As Chair of the National Tremor Foundation, Kitty and…\nHomemade Pie Company – Dinnington\nAward for local business! The Handmade Pie Company is a brilliant local business in Dinnington! And …\nDinnington Community Boxing club\nHuge shoutout to Dinnington Community Boxing club who are doing fantastic work in the community. Had…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_02_reminder-whitestone-solar-farm-public-meeting/content_306.html": "Following the local consultation events held by the developers behind Whitestone Solar Farm, I would like to hear from you.\nI will be holding an online public meeting to discuss the proposal on Monday 6th January at 18:30. You can sign up below\nhttps://www.eventbrite.co.uk/e/public-meeting-on-the-whitestone-solar-farm-tickets-1111264635439",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_02_road-safety-on-b6059-ryton-road/content_137.html": "ROAD SAFETY\nMany constituents have been in touch with me about the absence of safe crossing points for school children, as well as pedestrians, within the vicinity of Wales High School (B6059) and Ryton Road, North Anston around the Bulkhead Bus Stop.\nI have written to Sharon Kemp, Chief Executive of Rotherham Council, following two reported incidents of pupils at Wales High School being struck by vehicles. Thankfully both pupils are ok, however one did sustain injuries.\nI am pressing the council to ensure there are adequate safety measures in both of these areas, to guarantee the safety of school children. This is an urgent matter given mornings and nights are beginning to darken.\nI will provide an update once I receive a response.\nIf you need help with a road safety issue or another matter, please do get in touch by emailing jake.richards.mp@parliament.uk",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_10/content_207.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nMarch 9, 2025\nHomemade Pie Company – Dinnington\nMarch 8, 2025\nDinnington Community Boxing club\nMarch 7, 2025\nRaising Money for Heroes\nPrevious Page\n1\n…\n8\n9\n10\n11\n12\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_27_harthill-public-meeting/content_289.html": "I was pleased to hold a public meeting in Harthill last week. Thank you to all the residents who braved the cold and icy paths to attend!\nThe main topic of discussion was Harthill Reservoir, with questions from residents about the overall cost of the project, the path around the reservoir, parking arrangements, biodiversity and fish stocks, and the source of funding for the fishing platforms (which have been granted planning permission). Please be assured that I have passed on all the issues raised to the Canal and River Trust and will update residents as soon as I have any further information.\nOther topics included Active Travel plans to improve connectivity for walking and cycling between Harthill, Woodall, Wales and Kiveton Park, as well as the proposed Whitestone Solar Project around Harthill, Woodall and beyond. I am aware that residents are concerned about the extent of the proposal and are awaiting further details about the plans.\nNext week, I have a meeting with the company behind the project, Whitestone, to find out more information about the proposal. At this stage, I am as informed as everyone else who has had the flyer through their doors! I will update residents with any further information I receive about the proposal.\nThere will be a consultation event for the solar farm in the village on Tuesday 3rd December from 2 to 6pm at Harthill Village Hall.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_13_anston-brook-primary-school-visit/content_320.html": "It was great to meet with Sally Armstrong, Headteacher, and Emma Wilkinson, Deputy Headteacher, at Anston Brook Primary School. We had a really useful discussion on a wide range of topics and I look forward to coming back to Anston Brook to meet with pupils next year.\nThank you for meeting with me",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_42/content_29.html": "Big Power For Little London Update July 2024\nFor many months, Big Power For Little London have been campaigning for changes to the law to end no-…\nBig Power for Little London\nI promised Big Power For Little London that if elected one of the first things I would do is write t…\nSworn my allegiance to his majesty the King\nI have sworn my allegiance to his majesty the King, and formally affirmed my commitment to everyone …\nJake Richards MP for Rother Valley Speech\nI’m honoured to serve as the Member of Parliament for Rother Valley. I’d like to thank all my team, …",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_7/content_65.html": "Raising Money for Heroes\nIt was an absolute pleasure to speak with Dale who is doing the Tommy Sleepout this weekend to raise…\nBrampton en le Morthen Whitestone Meeting\nThank you to all residents who came to speak with me about Whitestone Solar Farm at The Rising Deer …\nMeeting with Leader of Rotherham Council, Cllr Chris Read\nGreat to catch up with Chris Read, Leader of Rotherham Council, to discuss various topics and issues…\nSwallownest Street Surgery\nThank you to everyone who came to my street surgery in the beautiful sunshine in Swallownest. Follow…\nDinnington Colliery Sign\nIt is absolutely wonderful to see the Dinnington Colliery sign back up, thanks to the work of the Di…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_22_wales-primary-school-visit/content_106.html": "Last week I visited Wales Primary School following the damage caused by the winter storm. I’m pleased to see the work to remediate the building has started – but there is still some way to go. This has been a really unfortunate situation and the pupils, governors and staff at Wales Primary have been exceptional throughout. They deserve great credit!\nIt makes me so proud to see the amazing people in our community come together in times like these and I will do everything to support the school more generally. The estate and their buildings needs investment and attention. I am urgently speaking to RMBC and the Department for Education to see what more can be done!\nDo show some support for Wales Primary School!!!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_28_jake-richards-mp-assisting-dying-bill-second-reading/content_76.html": "Tomorrow, Parliament will debate a Bill that will seek to change the law in regards to assisted dying.\nMany constituents have asked how I will be voting at Second Reading. I will be voting in favour of the Bill and have set out my position in detail below:",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_52/content_236.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 11, 2024\nOpen Arms Community Support Hubs\nOctober 10, 2024\nWorld Mental Health Day 2024\nOctober 10, 2024\nYorkshire Water Site Visit\nPrevious Page\n1\n…\n50\n51\n52\n53\n54\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_28_visit-to-jobsplus-in-maltby/content_35.html": "It was great to visit the JobsPlus team in Maltby to see how the programme is progressing and supporting local residents.\nSpeaking to customers and community champions highlighted how important the community-led employment scheme is to Maltby. The scheme has been successful in providing free employment help to many of its customers.\nThe team are based at Full Life Church in Maltby and you can get in touch to access free employment support if you are looking for a new role.\n0114 2900 218",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_27/content_200.html": "Introduction to Parliament Week at Thurcroft Junior Academy\nIt was wonderful to join a whole school assembly at Thurcroft Junior Academy to talk about the upcom…\nAll Party Parliamentary Group (APPG) for Children Who Need Palliative Care\nIn Parliament I attended a drop-in event hosted by the All Party Parliamentary Group (APPG) for Chil…\nWhite Woods Primary Academy Trust\nIt was great to meet with Kate Davies, Chief Executive Officer, and John Dean, Chief Operation Offic…\nDinnington Public Meeting – Regeneration Project\nOn Friday, I held a public meeting at The Lyric Dinnington, alongside Chris Read, Leader of Rotherha…\nRemembrance 2024\nRemembrance Sunday is a special time. Thank you to all those who organised the many events across th…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_16_visiting-anston-brook/content_163.html": "I had a wonderful time speaking to pupils at Anston Brook on Friday. We discussed what they liked about living in North Anston and what they would like to see improved.\nThe pupils love how close green space is to where they live and how friendly people are. Sadly, they told me they were disappointed with how much litter they see in their local area. We also spoke about parking and building houses nearby.\nWe also discussed what it means to be a Member of Parliament and what the role of an MP involves. Joel told me he would like to be an MP one day!\nThank you for welcoming me back to Anston Brook. It is always a pleasure to visit your school.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_12_outgang-lane-and-monksbridge-roundabout-works/content_181.html": "I am pleased to hear that the Council have designed a scheme to deliver extensive repairs along Outgang Lane and Monksbridge Roundabout, totalling £879,190.\nOnce a date has been secured for works to begin, signage will be put in place informing road users of upcoming works.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_27_harthill-workbench/content_206.html": "I had a brilliant time seeing the Harthill Workbench in action. It is an amazing space for members and residents to pop along to and build anything they’d like. With the help of talented woodworkers (not me), you can be sure to bring your visions to life.\nSearch ‘Harthill Workbench’ on Facebook to find out more or join their group here: https://www.facebook.com/share/g/15byagfKEL/?mibextid=wwXIfr",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_31/content_336.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 13, 2024\nDinnington Banking Hub Open\nDecember 13, 2024\nAnston Brook Primary School Visit\nDecember 12, 2024\nDinnington Christmas Festival\nPrevious Page\n1\n…\n29\n30\n31\n32\n33\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_05_visit-royal-mail/content_204.html": "Following concerns over the standard of service and irregular Royal Mail deliveries across Aston, Kiveton Park and other pockets of the constituency served by Dinnington Delivery Office, I visited Royal Mail to ask questions.\nThey apologised for the service provided and admitted that the previous standard of service on the run up to Christmas fell below expectations. Royal Mail told me their service at Christmas was very stretched, due to increasing parcel deliveries and the period of extreme weather following into January.\nRoyal Mail assured me that routes have been revised and residents should notice an improvement in the service they receive moving forward. If you continue to notice problems with deliveries, please do get in touch by emailing jake.richards.mp@parliament.uk.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_10_big-power-for-little-london-2/content_91.html": "Yesterday, I raised the brilliant campaign of Big Power For Little London in Parliament. One of the organisation’s key asks of government is the end of ‘no-fault’ evictions – and I’m pleased that this will be delivered before Christmas. I also made a personal commitment to the group to organise a meeting with the Housing Minister to discuss their campaign and how we can make improvements in Little London. I’m pleased to confirm that this is being organised.\nYou can watch my question in the Commons below.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_22_dinnington-banking-hub-information-event/content_196.html": "Cash Access UK will be holding an information event about the new Banking Hub. It will be located at 31-33 Laughton Road and works are well underway to see it completed by February.\nYou can find out more by joining Cash Access UK on Friday 1 November, 9am-3pm at Aroma Coffee Shop, 28 Laughton Road, Dinnington, S25 2PS.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_26/content_202.html": "Christmas Light switch-on in Wickersley\nBrilliant time at the Christmas light switch-on in Wickersley with John Healey. Well done to Maddie …\nA Conversation on Assisted Dying\nAs many of you know, a Private Members’ Bill has been introduced, and will begin its journey t…\nThurcroft Junior Academy – School Council\nIt was a pleasure to meet with Thurcroft Junior Academy‘s school council. We discussed what it…\nMaltby Christmas Light Switch on\nBrilliant to see the Maltby and Rother Valley Lions at the Christmas light switch on event…\nIntroduction to Parliament Week at Willows School\nYesterday, I visited the Willows School in Thurcroft to speak with their pupils about UK Parliament …",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_26_yorkshire-water-47-rip-off-petition-for-parliament/content_42.html": "Hundreds of residents have been in touch about a letter they received from Yorkshire Water outlining a retrospective sewerage charge from the previous financial year. I want to bring this to the attention of those in power.\nI have spoken to Yorkshire Water about this billing mistake, and their failure to invest in our infrastructure more broadly – and I will continue to raise local frustrations at every opportunity.\nPlease sign this petition urging the government to stop this retrospective charge, which I will present in Parliament on Monday on behalf of all my residents.\nSIGN ROTHER VALLEY’S PETITION BELOW",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_27_macmillan-annual-coffee-morning-2024/content_134.html": "Today is Macmillan Cancer Support’s annual Coffee Morning. I am down at Kiveton Park Medical Practice, who are running a Coffee Morning until 12pm. Do pop on down and support a great cause. #MacmillanCoffeeMorning ☕💚\nToday is Macmillan Cancer Support’s annual Coffee Morning. I am down at Kiveton Park Medical Practice, who are running a Coffee Morning until 12pm. Do pop on down and support a great cause. #MacmillanCoffeeMorning ☕💚",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_09_baby-loss-awareness-week-2024/content_175.html": "This year Baby Loss Awareness Week will take place between Wednesday 9th October and Tuesday 15th October. Baby Loss Awareness Week, now in its 22nd year, helps to unite the pregnancy and baby loss community, who come together and speak out across the week to increase understanding of the impact of loss and remember all babies.\nThe week also provides an opportunity to raise awareness of the impact of pregnancy and baby loss; the importance that bereavement support plays in the ongoing bereavement journey; and of the vital work that is needed to improve pregnancy outcomes and to save babies’ lives. Sadly, 1 in 2 people are affected by baby loss.\nOn Saturday 12th October, Rotherham Hospital Chapel will be hosting a Baby Memorial Service from 10:30am to 11:30am. If there are any other Baby Loss Awareness Week events going on in the local community, please advertise them in the comments.\nYou can light a candle on Tuesday 15th October at 7pm to remember all those babies that have been lost too soon #WaveOfLight.\nIf you, or someone you know, has been impacted by baby loss, you can access support here: https://www.tommys.org/baby-loss-support",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_19_jake-richards-mp-speech-about-bcsss/content_17.html": "Yesterday, I spoke in the House of Commons to ask the government what they are doing to reassure and update members of the British Coal Staff Superannuation Scheme (BCSSS).\nAlong with other coalfield MPs, I will continue to put pressure on the government to return the reserve fund to its members, 600 of which are in Rother Valley.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_in-parliament_page_3/content_26.html": "Latest News in Parliament\nParliament\nAmbitious About Autism\nIt was a privilege to attend the drop-in session held by Ambitious About Autism in Parliament last w…\nParliament\nNovember 2024 Newsletter\nYou can take a read at what I’ve been up to in Rother Valley and Parliament here: https://mail…\nParliament\nTerminally Ill Adults (End of Life) Bill – Second Reading\nToday, the House of Commons voted in favour of the Terminally Ill Adults (End of Life) Bill, as it p…\nParliament\nJake Richards MP – Assisting Dying Bill Second Reading\nTomorrow, Parliament will debate a Bill that will seek to change the law in regards to assisted dyin…\nParliament\nCommunity Policing\nI held a public meeting at The Lyric Dinnington about the regeneration project on Dinnington High St…\nParliament\nAll Party Parliamentary Group (APPG) for Children Who Need Palliative Care\nIn Parliament I attended a drop-in event hosted by the All Party Parliamentary Group (APPG) for Chil…\nRSS Feed in Parliament\nYou can see Jake Richards’s latest appearances and speeches in Parliament (thanks to theyworkforyou):\nLoading RSS feed…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_46/content_319.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 1, 2024\nPublic Debate: Assisted Dying\nOctober 30, 2024\nEnding the Injustice of the Mineworkers Pension Scheme\nOctober 28, 2024\nRoyal Mail Delivery Office Visit\nPrevious Page\n1\n…\n44\n45\n46\n47\n48\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_letters/content_107.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nLetters\nOctober 18, 2024\nMaltby Sports Ground: Investigation\nOctober 2, 2024\nRoad Safety on B6059 & Ryton Road\nSeptember 23, 2024\nHarrycroft Quarry Blast\n1\n2\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_15_ulley-public-meeting/content_315.html": "I met with residents in Ulley yesterday to discuss issues affecting the village.\nWe had a constructive discussion about speeding, with residents raising their severe concerns about how unsafe Ulley’s roads have become. I will be working with residents to fight for concrete measures to make the whole village safer for everyone.\nWe also spoke in depth about the proposed Whitestone Solar Farm, with a range of concerns and opinions shared. I am committed to representing your views and championing the needs of our community and will ensure all views are taken into consideration at every step.\nThank you to everyone who came – it was a pleasure to speak with you all.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_27_veterans-voice-event-at-dinnington/content_20.html": "Last week, I hosted a veterans voice event in Dinnington alongside John Healey, Defence Secretary, and Al Carns for Labour, Veterans Minister.\nThis was a really important event bringing together local veterans from Dinnington & District Branch of The Royal British Legion, Wath upon Dearne RBL, Rotherham, Rawmarsh & Parkgate RBL, Conisbrough and Denaby RBL, Rotherham MCVC, SSAFA, the Armed Forces charity and Help 4 Homeless Veterans.\nThe discussions had were really important and covered the transition to civilian life, finding employment after serving in the armed forces, accessing support services, housing and the HM Armed Forces Veteran Card.\nRawmarsh and Conisbrough MP and Defence Secretary, John Healey, said, “What came through clearly at the event was the sense that for too long veterans haven’t had the respect they deserve, they’ve suffered a post code lottery of services, and they haven’t had a government that takes what they need seriously.”\n“This Government will stand side-by-side with veterans and their families. The conversations we’ve had continue to help us to get a good idea of what is happening on the ground.”\n“Veterans and organisations that support them are the best advisors you can have when it comes to making the changes that are needed for the future.”\nVeterans Minister Al Carns added, “‘It was a pleasure to be with John Healey and local MP Jake Richards to meet such an amazing group of Veterans. With over 600 years of military experience in the room, it was an impressive crowd and so valuable to get the issues facing Veterans first hand.”\n“Huge thanks to Jake for pulling this together and all those that attended. Thank you for your service!”\nThank you to everyone who came to Dinnington for the event.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_10_remembrance-sunday/content_230.html": "Great to be with the Dinnington Cadets this morning, as we prepare for services of Remembrance across the Rother Valley.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news/content_3.html": "Wickersley Street Surgery\nThank you to all the residents who came to my street surgery in Wickersley, with many residents rais…\nThorpe Salvin Street Surgery\nReally enjoyed speaking to residents in Thorpe Salvin in the beautiful sunshine. Need help with anyt…\nFree family Easter Event – The Slip in Maltby\nFree family Easter event on Monday 21st April from 2-5pm at The Slip in Maltby. Do pop along! Thank …\nTreeton / Ulley Junction Meeting\nI am very aware of the long-standing and incredibly frustrating issues at this junction. The traffic…\n3 Street Surgeries in Laughton en le Morthen\nBrilliant to be out in the beautiful sunshine in Laughton en le Morthen this morning. Thank you to a…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_8/content_114.html": "Woodsetts Public Meeting\nOn Friday, I held a village meeting in Woodsetts and I want to say a huge thank you to all those who…\nLetwell Surgery\nThank you to all residents who came to the surgery I held in Letwell (Buster the dog can come more o…\nVibe Dance – Rotherham’s Got Talent\nHuge congratulations to Vibe Dance who came 3rd at Rotherham’s Got Talent last month. They are a tal…\nVisit to Todwick’s Luncheon Club\nIt was an absolute pleasure to drop into Todwick’s Luncheon Club yesterday. Whilst going door …\nAston-Cum-Aughton Public Meeting\nThank you to everyone who came to my public meeting at Aston-Cum-Aughton Parish Hall last week. I wa…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_09_thorpe-salvin-street-surgery/content_37.html": "Really enjoyed speaking to residents in Thorpe Salvin in the beautiful sunshine.\nNeed help with anything? Please email jake.richards.mp@parliament.uk.\nReally enjoyed speaking to residents in Thorpe Salvin in the beautiful sunshine.\nNeed help with anything? Please email jake.richards.mp@parliament.uk.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_02_anston-parish-councils-firework-display/content_194.html": "Brilliant time at Anston Parish Council’s firework display.\nA well organised event, with lots going on. The display was magnificent and the bonfire was impressive.\nWell done to everyone involved.\nBrilliant time at Anston Parish Council’s firework display.\nA well organised event, with lots going on. The display was magnificent and the bonfire was impressive.\nWell done to everyone involved.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_27_holocaust-memorial-day/content_115.html": "It is 80 years since the liberation of Auschwitz-Birkenau, the largest Nazi concentration camp. These horrors are still in living memory for some and must remind us of our collective responsibility to ensure the atrocities of the Holocaust are never forgotten.\nI was honoured to sign the Holocaust Educational Trust’s Book of Commitment and pledged my commitment to marking Holocaust Memorial Day.\nOn this day we also honour the victims of genocide in Cambodia, Rwanda, Bosnia and Darfur. As we reflect and remember the past, we reaffirm our commitment to challenging antisemitism and all forms of prejudice.\nToday, we reflect and stand together for a better future.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament/content_21.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nApril 3, 2025\nRotherham United’s EFL Awards\nMarch 21, 2025\nCrags Community School at the Houses of Parliament\nMarch 20, 2025\nConstituents at Downing Street\n1\n2\n3\n…\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_19_increased-hospice-funding-announced/content_314.html": "Today, the government announced the biggest investment in hospices in a generation, including £26 million of dedicated funding for children and young people’s hospices.\nBluebell Wood Children’s Hospice will benefit from this increased investment, which will further support their vital services in our community.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_19_meeting-with-harthill-active-travel/content_188.html": "I was pleased to meet with Harthill Active Travel, along with Olympic cyclist Ed Clancy, Nicola Marshall from SYMCA and Cllr Marnie Havard.\nThe Active Travel plans are exciting and something I believe will create a healthier and more sustainable community. Benefits include reduced car journeys, safer walking and cycling routes for school children getting to and from Wales High School and improved safety along Woodall Lane for residents walking between Harthill and Woodall.\nI would like to thank Ruth Sutherland for the work she has done in moving this project forward.\nFriday’s meeting was an exciting and positive step forward to making these plans a reality between Harthill, Woodall, Wales and Kiveton.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_47/content_290.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 26, 2024\nWales Primary Eco-School Visit\nOctober 25, 2024\nA Conversation on Assisted Dying\nOctober 24, 2024\nOur Places Fund Consultation\nPrevious Page\n1\n…\n45\n46\n47\n48\n49\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_21_opening-of-the-dinnington-banking-hub/content_311.html": "I was thrilled to officially open the Banking Hub in Dinnington yesterday, delivered by Cash Access UK in partnership with the Post Office.\nIt is already proving to be a brilliant and busy community asset, with residents in Dinnington and beyond banking on the high street once again. You can organise face to face meetings with Natwest on a Monday, Halifax on a Tuesday, Santander on a Wednesday, HSBC on a Thursday and Barclays on a Friday.\nThank you to everyone who made this happen, especially Cllr Julz Hall.\nShare the news with your family, friends and neighbours and let them know that they can bank in Dinnington, Monday to Friday, 9-5pm.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_03_whitestone-solar-farm-proposal-your-voice/content_310.html": "As many of you are aware, there is a recent proposal for a solar farm development that will cover parts of Rother Valley’s countryside. This week, I met with the developers to find out more about the proposal, which is still at a very early stage. The proposal is not finalised and there has been no application to the Secretary of State.\nHowever, even at this early juncture I’m really concerned about this project. Whilst we need local energy infrastructure, the sheer scale of what is currently being proposed and the location of some of the sites is worrying. The application is not for me to allow or refuse, but I want to shape it and put pressure on the company to ensure it is done right, if it has to be done. This means we need to protect local green spaces, minimise disruption and invest in the local area.\nA bit more about what I learnt:\nWho are the developers?\nGreen Nation are one of the largest developers of rooftop solar installations and operate ground-mounted solar farms, with 75 solar farms nationally. Net Zero One Ltd are a specialist development business to allow the funding of larger projects, like Whitestone Solar Farm.\nConsultation:\nAs of now, Whitestone tell me they have distributed 30,000 leaflets and have visited 27 households within close perimeter of the proposal to speak with them individually. They are running a range of consultation events, with a second consultation next year. I would encourage as many residents as possible to attend the initial consultation events:\n• Tuesday 3rd December (NOW), 2-6pm, Harthill Village Hall\n• Wednesday 4th December, 2-6pm, Consort Hotel, Thurcroft\n• Thursday 5th December, 10am-2pm, Ulley Village Hall\n• Tuesday 14th January, 2-6pm, Consort Hotel, Thurcroft\nIn addition to this, I will be reaching out to residents whose property is in close proximity to the proposal in the New Year. Alternatively, you can get in touch with me if you would like to discuss the proposal by emailing jake.richards.mp@parliament.uk\nWhy Rother Valley’s countryside?\nThe solar farm would produce 750mw of energy and connect to National Grid’s Brinsworth Substation with underground cables. Given the proximity of the substation to open space in Rother Valley, Whitestone has identified this area as suitable for a project of this scale. They also stated that the land identified within the initial proposal is low-yielding farmland.\nAt this stage, the level of any disruption to our villages and towns they say is not known. Further assessments and plans will be required.\nThe application process:\nThe plan would be submitted through a Development Consent Order to the Planning Inspectorate, who will review the application on behalf of the Secretary of State. The proposal will eventually include Battery Energy Storage Systems (BESS) to store extra energy until it is needed. Locations for BESS units will be determined by noise and technical assessments and have not been decided yet.\nTimescale:\nThe developers will be conducting a second round of consultation in Autumn 2025, with a Development Consent Order submitted in Spring 2026, awaiting approval by the Secretary of State in the Summer of 2027. Construction would begin in 2027 and Whitestone Solar Farm would be connected to the National Grid in 2029.\nI am keen to hear from as many residents about this, so please do complete the survey below. I know that this will be a worry for some. I get it. It’s my job to make sure your voice is heard: by the developer and the Secretary of State as and when any decision is made.\nWe have time. The process remains lengthy – so I will be working with residents and others on this over coming weeks, months and years.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_16_restart-a-heart-day/content_249.html": "Today is Restart a Heart Day, which aims to increase cardiac arrest survival rates across the UK. The aim is for as many people to learn the steps of CPR and how to use a defib. You can learn how to do CPR using the attached image or you can watch the following video from Yorkshire Ambulance Service: https://www.youtube.com/watch?v=YgQdVkFbQkk\nWhy is learning CPR important?\n– Each year, roughly 100,000 people suffer an out-of-hospital cardiac arrest – that’s around 250 people every day.\n– 80% of out-of-hospital cardiac arrests happen at home.\n– Every minute without CPR and defibrillation reduces the chance of survival by 10%.\n– 1 in 10 people survive an out-of-hospital cardiac arrest.\nBecome Resus Ready:\nIt only takes a few simple steps to become ResusReady. Individuals who sign up must have completed CPR training within the last 12 months. As a business or organisation, you can let people in your area know you are ResusReady by registering and showing on the map.\nSign up for free CPR training today and help boost survival rates! Learn more: resus.org.uk/resusready#RestartAHeart",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_15/content_235.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nFebruary 15, 2025\nHooton Levitt Street Surgery\nFebruary 14, 2025\nWales High School in Parliament\nFebruary 12, 2025\nOutgang Lane and Monksbridge Roundabout Works\nPrevious Page\n1\n…\n13\n14\n15\n16\n17\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_19_visit-to-todwick-primary-school/content_119.html": "Great to visit Todwick Primary School and meet with Mrs Deeley, headteacher, and Mrs Perry, deputy headteacher. They and their team do a fantastic job for the village.\nWe discussed a number of issues, and will be following up with her over the coming weeks and months. I’m determined to work with our schools to get the best deal for our children.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_14_rmbc-announce-rotherham-baby-packs/content_243.html": "This is brilliant news – do sign up for your Rotherham Baby Pack if you are due after Monday 7th April.\nRotherham Council are investing £360,000 so that every baby gets the best start in life:\nThis is brilliant news – do sign up for your Rotherham Baby Pack if you are due after Monday 7th April.\nRotherham Council are investing £360,000 so that every baby gets the best start in life:",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_30_south-anston-high-st-sheffield-rd-proposal/content_84.html": "Thank you to everyone who came to the South Anston street surgery – turned impromptu public meeting. I’m really grateful to everyone who expressed their views about the proposed changes to the road system around High Street and Sheffield Road. There was a consensus that speeding and inconsiderate parking are the bigger issues affecting South Anston, rather than the need for a rerouting of the road system. If you are local, and would like to express your views, please complete the survey below.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_newsletter/content_9.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nNewsletter\nTo see previous newsletter editions, click the buttons below:\nSept 2024\nOct\n2024\nNov 2024\nDec 2024 & Jan 2025\nFeb 2025\nMar\n2025",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_30_nuclear-week-in-parliament/content_81.html": "This week is Nuclear Week in Parliament.\nDid you know that the civil nuclear industry employs nearly 80,000 people across the UK? The industry provides skilled, well-paid work and transformational opportunities to young people in every part of the country.\nThis includes one of my constituents, Renee, and her colleague Harley, who I met at the nuclear industry’s Skills and Apprenticeship fair in Parliament. It was fascinating to hear about how Sheffield Forgemasters is supporting apprentices like Renee and Harley in the nuclear industry.\nKeep up the good work.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_25/content_329.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 4, 2025\nAmber weather warning in place for South Yorkshire tonight through to 05/01 23:59\nJanuary 4, 2025\nHarthill and Kiveton Active Travel Update\nJanuary 3, 2025\nPolice Meeting with Residents in Todwick regarding A57\nPrevious Page\n1\n…\n23\n24\n25\n26\n27\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_05_ambitious-about-autism/content_55.html": "It was a privilege to attend the drop-in session held by Ambitious About Autism in Parliament last week. They are a wonderful charity dedicated to championing and empowering young autistic people so that they can fully realise their futures. It was a moving opportunity to hear about the work they do.\nIn Rother Valley, 28.8% of autistic pupils were persistently absent (missing 10% or more of school), which can significantly impact their learning, development, and future prospects.\nLet’s continue to champion inclusion and make sure every young person, regardless of their needs, can achieve their full potential.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_07_the-squirrel-now-open-at-dinnington/content_304.html": "THE SQUIRREL IS NOW OPEN! 🐿️🍺\nStorm Darragh didn’t stop me from getting the first pint of Guinness!\nBrilliant work Jaz Khela.\nTHE SQUIRREL IS NOW OPEN! 🐿️🍺\nStorm Darragh didn’t stop me from getting the first pint of Guinness!\nBrilliant work Jaz Khela.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_10/content_145.html": "Outgang Lane and Monksbridge Roundabout Works\nI am pleased to hear that the Council have designed a scheme to deliver extensive repairs along Outg…\nSafer Internet Day\nToday is Safer Internet Day and is the UK’s largest celebration of online safety, empowering young p…\nA57 Public Meeting in Todwick & Update\nThank you to everyone who came to the public meeting I organised with South Yorkshire Police in Todw…\nGP Surgery Capacity Increasing in Rother Valley\nI am thrilled to hear that capacity at two GP practices in Rother Valley will be increasing. Thanks …\nVisit Royal Mail\nFollowing concerns over the standard of service and irregular Royal Mail deliveries across Aston, Ki…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_11/content_67.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nJuly 26, 2024\nMale Suicide Support for Andys Man Club Maltby, Better Today, The Learning Community Ltd and others\nJuly 17, 2024\nBig Power For Little London Update July 2024\nJuly 11, 2024\nSworn my allegiance to his majesty the King\nPrevious Page\n1\n…\n9\n10\n11\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_08_great-north-run-2024/content_50.html": "Blimey – that was wet and difficult! But I got round the Great North Run – and raised some money for the brilliant Bluebell Wood Children’s Hospice.\nThank you to everyone who sponsored and supported me!\nBlimey – that was wet and difficult! But I got round the Great North Run – and raised some money for the brilliant Bluebell Wood Children’s Hospice.\nThank you to everyone who sponsored and supported me!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_contact/content_129.html": "You can email me at [email protected]k, and your email will be processed as soon as possible. You can alternatively fill out the form below.\nBefore we can can process your enquiry, please check that you are one of my constituents.\nYou should also ensure that you have:\n- Provided your full name.\n- Provided your full postal address including post code.\n- Provided a contact telephone number and an email address if you have one.\nIMPORTANT: If you have not included this information, please re-send your email as I am unable to process your enquiry without it.\nTelephone\n01909 384605\nPostal Address\n39 Laughton Road, Dinnington, S25 2PN\nPlease note: The office is appointment only. If you require an appointment, please fill out the form above or email the office directly using [email protected]",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_45/content_323.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 5, 2024\nDinnington Remembrance Festival\nNovember 3, 2024\nDinnington & District Branch of The Royal British Legion at Tescos\nNovember 2, 2024\nAnston Parish Council’s Firework Display\nPrevious Page\n1\n…\n43\n44\n45\n46\n47\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_53/content_269.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 9, 2024\nDinnington Regeneration Project Update – October 2024\nOctober 9, 2024\nBaby Loss Awareness Week 2024\nOctober 8, 2024\nHarvest Soup Lunch\nPrevious Page\n1\n…\n51\n52\n53\n54\n55\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_7/content_113.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nMarch 22, 2025\nWales Primary School Visit\nMarch 22, 2025\nChris Jepson doing the Great Tommy Sleepout\nMarch 20, 2025\nConstituents at Downing Street\nPrevious Page\n1\n…\n5\n6\n7\n8\n9\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_21_crags-community-school-at-the-houses-of-parliament/content_49.html": "It has been brilliant to welcome Crags Community School to the Houses of Parliament this week.\nThe pupils were wonderful and asked some brilliant questions about my role as an MP. They even sat in the public gallery and watched the Prime Minister in the House of Commons!\nThank you to all of the pupils and teachers who made the trip to Westminster",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_04_visit-to-rotherham-hospice/content_40.html": "I found about the recent issues with the Hospice on social media – just like many people – and was incredibly alarmed. I immediately spoke with the Hospice Chief Executive, Mat Cottle-Shaw, to understand the challenges first hand. I’ve since met with Mat again to explore in more detail how I can help ensure the Hospice is supported now and into the future.\nI’m pleased to share that the South Yorkshire Integrated Care Board (ICB) has now confirmed it will continue its core funding for Rotherham Hospice for the next three years, with inflationary uplifts expected where appropriate. This longer-term reassurance is welcome, it offers the Hospice a degree of stability and the ability to plan ahead, and I’m grateful to the ICB for that commitment.\nBut there are still challenges for the hospice. To continue offering the same standard of care to people in Rotherham, the Hospice now needs to raise over £5.8 million through voluntary income, donations, fundraising, and retail activity. This is a significant challenge – and I want to play my part in supporting their efforts.\nHospices like Rotherham’s don’t just deliver compassionate care, they also provide real value to the NHS. The cost of a day in hospice care is around £500, far less than the equivalent in a hospital setting, where costs can exceed £1,500 per day. By supporting patients in the community, hospices ease pressure on hospital beds, emergency services, and GPs.\nThat is why I will continue to call on the government to offer as much support to our hospice sector, and hospices in Rotherham, as is possible. They offer an invaluable service. I regularly meet with Bluebell Wood in Anston too, and will be supporting their fundraising efforts too.\nLooking ahead, the Hospice also has exciting and ambitious plans to dramatically expand services by 2030. This move would allow it to double capacity to 30 beds and expand home-based services for families, people with dementia, and those with increasingly complex health needs. With Rotherham’s population set to grow by 25% by 2054, this is a forward-thinking project that anticipates rising demand. It would also help generate NHS savings estimated at over £65 million across 30 years.\nI am holding further meetings with Mat and his team to discuss how I can help with this agenda.\nAs your MP, I will continue to:\n– Press for a fairer, more transparent national funding model for hospices\n– Support Rotherham Hospice’s vision for expansion and long-term sustainability\n– Campaign for multi-year contracts that give hospices the certainty they need\n– Keep raising the importance of palliative care in Parliament\nFinally, I have told Mat that I will do a fundraising run for the Hospice to raise as much money as possible. Please do keep an eye on my Facebook page for updates on this, and the hospice more generally.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_18_yorkshire-water-letting-down-kiveton/content_160.html": "| YORKSHIRE WATER LET DOWN KIVETON AGAIN There was another burst water main in Kiveton earlier today on Hard Lane. This is just over two weeks after the burst on Station Road, which caused severe damage to several properties in the area. I am becoming increasingly frustrated and angry with Yorkshire Water, as residents are being let down time and time again. I have spoken to Yorkshire Water many times since being elected and I will not let up in ensuring they are held accountable for the damage and disruption they cause. I will be relentless in my push to ensure improvement works take place at the earliest opportunity. |",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_9/content_87.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nOctober 13, 2024\nStudent from Wales High School – Work Experience at Westminster\nOctober 10, 2024\nBig Power for Little London\nOctober 1, 2024\nMaiden Speech\nPrevious Page\n1\n…\n7\n8\n9\n10\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_08_discussing-the-jay-inquiry-on-politics-live/content_240.html": "Before being elected, I often represented victims of child sexual abuse and rape in court in my role as a barrister. I know that the system too often fails vulnerable children and victims. I know that because I saw it in my work trying to protect children over the best part of a decade. It’s one of the reasons I stood for Parliament.\nIn 2022, the Jay Inquiry into child sexual abuse concluded. This inquiry took 7 years. It cost £200 million. It considered (literally) millions of pieces of evidence and heard from hundreds of victims.\nThe report made 20 recommendations. The last government did not take any action to implement any of these recommendations. Nothing happened.\nMy view is that the absolute priority for this government should be the implementation of those recommendations. I’ll spend my time in Parliament urging them to do so, and calling them out if they do not.\nThere are legitimate arguments for a further inquiry. They have weight – and the option must be kept under review. But ultimately now is the time for action. Another 7 years of delay, requiring victims to give evidence once more, requiring public bodies to prepare representation, is, in my view, not the best option for justice to prevail and children to be protected.\nIt’s not just me who says this.\nThe independent chair of the review, Professor Alexis Jay, has urged politicians to get on with it – not commission yet another inquiry. Andrew Norfolk, the journalist whose work uncovered the grooming scandal here in Rotherham, has also made clear that another inquiry is not the answer at this point.\nIn Rotherham, we have had important inquiries into these heinous crimes, and the recommendations have been implemented, and improvements seen.\nBut we do not rest on our laurels. We must all stay aware and alert, and hold public bodies to account. Those guilty of these horrendous crimes must be punished.\nAnd the irony is the bill before Parliament put in place the strongest set of child protection measures in a generation. The Tories voted to stop that. Why? Political games.\nThis is an important issue. I’m a Father. I’ve worked with victims of child abuse. I take these issues seriously.\nAs ever, if you want to get in touch with me to discuss this issue, please do email.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_29/content_332.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 18, 2024\nLitter Picking Stars at Anston Park Junior School\nDecember 17, 2024\nChristmas Royal Mail Local Service\nDecember 17, 2024\nFirbeck Christmas Fair\nPrevious Page\n1\n…\n27\n28\n29\n30\n31\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_18_litter-picking-stars-at-anston-park-junior-school/content_318.html": "Leonora and her friends from Anston Park Junior School arranged a litter pick around Kendal Park and the nearby woods at the end of November. They picked a total of 17 bags of rubbish and raised money for the Bereavement Team at Sheffield Children’s Hospital.\nI was thrilled to pop into to see Leonora to donate some money and pass on a letter of thanks.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_38/content_342.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 27, 2024\nChristmas Fair at St Cuthbert’s Church\nNovember 26, 2024\nStudent from Wales High School – Work Experience at Westminster\nNovember 26, 2024\nMaltby Academy Visit\nPrevious Page\n1\n…\n36\n37\n38\n39\n40\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_08_free-family-easter-event-the-slip-in-maltby/content_44.html": "Free family Easter event on Monday 21st April from 2-5pm at The Slip in Maltby. Do pop along!\nThank you to Maltby & Hellaby Labour Party councillor Donna Sutton for her amazing donation of over 100 Easter eggs.\nFree family Easter event on Monday 21st April from 2-5pm at The Slip in Maltby. Do pop along!\nThank you to Maltby & Hellaby Labour Party councillor Donna Sutton for her amazing donation of over 100 Easter eggs.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_30_holding-royal-mail-to-account/content_136.html": "A number of residents reached out to me, including at one of my street surgeries, about the lack of mail being delivered by Royal Mail, with some residents going days without mail in S25 and S26.\nDue to restructuring at the Dinnington Delivery Office, some of the rounds were being delivered less frequently, meaning residents were missing out on their post. After contacting Royal Mail, I have been assured that the Dinnington Delivery Office will be recruiting more postmen and women to join the team. They have also apologised for the service they have provided to residents recently.\nYou can apply here: https://jobs.royalmailgroup.com/\nIf you need help with an issue, please email jake.richards.mp@parliament.uk and my team and I will always be happy to help.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_23_street-surgery-in-hellaby/content_75.html": "Yesterday I held a street surgery with residents in Hellaby to discuss early proposals for a new housing development near Bateman Road.\nResidents raised concerns about overdevelopment, increased traffic, pressure on local roads, loss of green space, impact on wildlife, light pollution from past developments, and a lack of transparency from developers.\nI want to be clear: I do not support these plans and will try my utmost to protect Hellaby from this particular application. Whilst I believe we need new housing in our country, Hellaby has had extraordinary development before my time as our MP and, amongst other concerns, the amount of traffic and noise it would cause is not acceptable. I also want to protect green areas wherever possible.\nI will be seeking a meeting with the developers to get answers and ensure residents are kept fully informed. Planning decisions are not mine to take but I want to make my views clear.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_11_open-arms-community-support-hubs/content_214.html": "Open Arms Community Support Hubs in Rotherham provide cost of living advice and support. This is a partnership project with Rotherham Federation, Citizens Advice Rotherham & District, LASER Credit Union and Voluntary Action Rotherham.\nThe next sessions in Rother Valley are:\nWednesday 16th October at Dinnington Community Library from 9:30am to 15:30pm\nFriday 18th October at Maltby Community Library from 9:30am to 15:30pm\nDo head along for free advice and support.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_20_visit-to-todwick-early-years/content_154.html": "It was brilliant to meet the team at Todwick Early Years, who provide care for children aged 2, 3 and 4 during term time. They have a wonderful space and are a very committed and hard working team – thank you for showing me around.\nYou can find out more here: http://todwickearlyyears.co.uk/",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_08_dinnington-community-boxing-club/content_152.html": "Huge shoutout to Dinnington Community Boxing club who are doing fantastic work in the community.\nHad an absolute blast visiting their brand-new gym in Maltby – the energy, passion, and dedication there is next level!\nBig respect to the coaches, the boxers, and everyone involved in making this club such a positive force. Keep smashing it!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_36/content_103.html": "Christmas Card Competition 2024\nCHRISTMAS CARD COMPETITION I am inviting primary school children across Rother Valley to design the …\nRoad Safety on B6059 & Ryton Road\nROAD SAFETY Many constituents have been in touch with me about the absence of safe crossing points f…\nMaiden Speech\nLast month, I made my maiden speech in Parliament. It was one of the greatest honours of my life and…\nDinnington Banking Hub Update – September 2024\nDINNINGTON BANKING HUB I recently visited the site for the new banking hub on Dinnington High Street…\nHolding Royal Mail to Account\nA number of residents reached out to me, including at one of my street surgeries, about the lack of …",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_24/content_234.html": "Christmas Fair at St Cuthbert’s Church\nI had a wonderful time at the Christmas fair at St Cuthbert’s Church in aid of Rotherham Cance…\nCommunity Policing\nI held a public meeting at The Lyric Dinnington about the regeneration project on Dinnington High St…\nStudent from Wales High School – Work Experience at Westminster\nFantastic to have Jake (great name!) join me for Work Experience down in Parliament. Jake is a Harth…\nMaltby Academy Visit\nIt was a privilege to speak with students at Maltby Academy for UK Parliament Week. Thank you to all…\nStrike It Lucky Book Launch at Maltby Manor\nWhat a brilliant night at the Manor in Maltby – celebrating David Tomo Tomlinson’s book launch…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_18_thurcroft-junior-academy-school-council/content_271.html": "It was a pleasure to meet with Thurcroft Junior Academy‘s school council. We discussed what it means to be a school councillor, how it links to democracy and how we can debate with kindness and respect.\nTheir Eco Warriors were in attendance and raised the importance of walking to school and recycling. I was impressed to learn that the school has the third highest rate of walking to school in the local authority!\nWell done to all of you on your election to the school council, you should all be proud of yourselves.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_29/content_185.html": "Wales Primary School Eco-School success in the House of Commons\nI was so impressed with the Y6 class at Wales Primary School, that I shared their Eco-School success…\nDinnington & District Branch of The Royal British Legion at Tescos\nReally enjoyed selling poppies with the Dinnington & District Branch of The Royal British Legion…\nAnston Parish Council’s Firework Display\nBrilliant time at Anston Parish Council’s firework display. A well organised event, with lots going …\nPublic Debate: Assisted Dying\nLast night, I held a meeting with residents from across the constituency on the issue of assisted dy…\nEnding the Injustice of the Mineworkers Pension Scheme\nIt is a national scandal that former miners across Rother Valley, from Maltby to Dinnington to Thurc…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_28_royal-mails-delivery-office-visit/content_219.html": "It was great to visit the Dinnington Delivery Office on Friday, and speak to the managers and some of the posties there.\nThey are very aware of the problems that many have experienced, and shared with me. There are two explanations. Firstly, they have changed their systems in recent weeks which will hopefully lead to efficiencies and making the service better, but in the short term led to some issues. Secondly, they are also recruiting for more staff to help out.\nI was very impressed with their new design and they said they were always willing to pick up the phone if constituents had an issue – so please do keep me informed as to your service.\nI’ll be going back during Christmas busy period to help out(!), but in mean time please do keep in touch on this issue and working with the Royal Mail we can deliver a better service for everyone.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_27/content_331.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 23, 2024\nOffice Christmas Closure 2024\nDecember 22, 2024\nStop The Maltby Pit Tip Plan\nDecember 21, 2024\nOpening of the Dinnington Banking Hub\nPrevious Page\n1\n…\n25\n26\n27\n28\n29\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_63/content_82.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJuly 22, 2024\nTanning Lounge Thurcroft & Maltby – England Business Awards Winners 2024\nJuly 12, 2024\nBig Power for Little London\nJuly 6, 2024\nJake Richards MP for Rother Valley Speech\nPrevious Page\n1\n…\n61\n62\n63\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_22/content_321.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 14, 2025\nRMBC announce Rotherham Baby Packs\nJanuary 14, 2025\nWales Community Theatre Players: Cinderella\nJanuary 12, 2025\nTraining for the Wickersley 10k!\nPrevious Page\n1\n…\n20\n21\n22\n23\n24\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_14_wales-community-theatre-players-cinderella/content_291.html": "It was great to pop into one of the last rehearsals before this week’s opening of Cinderalla. The sheer hard work and commitment was clear to see – it’s going to be a great show.\nPlease do get a ticket for you and the family. Dates and times are:\n18 January • 14:15\n18 January • 18:15\n19 January • 12:15\n19 January • 16:15\n24 January • 19:15\n25 January • 14:15\n25 January • 18:15\nTickets can be booked online at https://themontgomery.org.uk/event/cinderella/ or by calling 0114 327 3456.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley/content_16.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nApril 14, 2025\nWickersley Street Surgery\nApril 9, 2025\nThorpe Salvin Street Surgery\nApril 8, 2025\nFree family Easter Event – The Slip in Maltby\n1\n2\n3\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_31_skoopz-desserts/content_305.html": "Fancying a sweet treat?\nIt was great to go and meet the team at Skoopz desserts in Thurcroft, who opened their doors earlier this month. A huge selection of cakes, shakes, crepes, waffles and more are on offer. I can confirm the cakes are delicious!!!\nHead on down and #supportlocal.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_07_raising-money-for-heroes/content_86.html": "It was an absolute pleasure to speak with Dale who is doing the Tommy Sleepout this weekend to raise funds for veterans. Dale is sleeping out on Dinnington High Street before playing rugby for Dinnington Rugby Union Football Club the next day. Dale is a hero himself – and a top man.\nIf you are able to contribute the link is in the comment below.\nThank you Dale – and thank to Cllr Amanda Clarke, Dinnington Labour for joining me and contributing to the donation. Amanda is a real who does so much for our community.\nDale Young is fundraising for Royal British Legion Industries",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_04_send-provision-online-meeting/content_167.html": "Special education needs and disability (SEND) provision is one of the biggest issues impacting parents and education staff across Rother Valley, and the country. When I speak to parents and teaching staff, they tell me of their worry that the needs of children are not being met in schools.\nI am keen to hear from residents about this, whether you are a parent, carer, teacher, teaching assistant, SENCo, or someone who is interested in the future of SEND provision.\nYou can join the online public meeting I am holding on Monday 24th February at 19:30 by signing up through this link:",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_19/content_309.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 27, 2025\nHarthill Workbench\nJanuary 26, 2025\nThe Handmade Pie Company in Dinnington\nJanuary 22, 2025\nSubmission to RMBC on proposed reclamation of Maltby Colliery tip\nPrevious Page\n1\n…\n17\n18\n19\n20\n21\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_13_student-from-wales-high-school-work-experience/content_116.html": "Simon is a student at Wales High School and it was fantastic to have him do work experience with me down in Westminster this week. He’s a bright lad and will do very well.\nSimon is a student at Wales High School and it was fantastic to have him do work experience with me down in Westminster this week. He’s a bright lad and will do very well.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_15_hooton-levitt-street-surgery/content_155.html": "Really enjoyed speaking to residents in Hooton Levitt yesterday at one of my street surgeries.\nNeed help with something? Do email jake.richards.mp@parliament.uk and my team and I are happy to help.\nReally enjoyed speaking to residents in Hooton Levitt yesterday at one of my street surgeries.\nNeed help with something? Do email jake.richards.mp@parliament.uk and my team and I are happy to help.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_51/content_264.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 14, 2024\nMaltby Redwood Primary School Visit\nOctober 14, 2024\nVisit to Roche Abbey\nOctober 12, 2024\nSpeeding on the A57 Update October 2024\nPrevious Page\n1\n…\n49\n50\n51\n52\n53\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_21_maltby-to-rotherham-bus-service/content_177.html": "I have written to Oliver Coppard, the Mayor of South Yorkshire, about the continued loss of the direct bus service between Maltby and Rotherham Hospital.\nIt is simply unacceptable that there is no direct bus service taking NHS staff to work, residents to their hospital appointments and visitors to see their family and friends.\nI’m hoping to get Oliver’s support to put pressure on the bus operating companies to see if this can be delivered.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_whitestone/content_24.html": "Whitestone: UPDATE\nMany residents will be receiving updated plans from the proposed Whitestone solar development in our area.\nI want to be clear: I cannot support these plans. I have been holding regular meetings with residents and the developer. I am pleased that this has resulted in some significant changes and a 25% reduction in the scale of the plan. It is welcome that particular areas which local residents sought to be protected have been.\nBut nonetheless, the revised plan is not good enough. Whilst I support the government’s plans for more renewable energy to cut bills and end our reliance on foreign supplies, my priority is always my constituents. Residents in the affected areas – Harthill, Woodall, Aston, Brampton-en-le-Morthen and Ulley – are rightly worried about this and I will stand with them.\nI will continue to work with the developer, urging them to make further changes. And over the coming months, I will be holding further public meetings for residents. Please do keep an eye out for these on Facebook and elsewhere.\nThe formal application still has not been made. This is likely to occur in the summer of 2026. I hope that further changes will be made before then. In the meantime, if you have any questions, or want to raise any issues with me, please do let me know: [email protected]\nFor the attention of Whitestone\nWHITESTONE SOLAR FARM DEVELOPMENT – FIRST CONSULTATION\nFeedback from Jake Richards, Member of Parliament for Rother Valley –\nJanuary 2025\nAs the Member of Parliament for the Rother Valley constituency I have received a lot of\ncomment and concern from my constituents about this proposal. I have held numerous\nmeetings across the constituency and published an online survey. This is an ongoing\nprocess and I am determined to represent the views of my constituents to the developer and, as and when the application is made, to the decision-maker.\nThe main concern is the sheer scale of this proposal, covering some 3,500 acres of\nagricultural land in the Green Belt. The development of a 750 MW solar farm will be by far the largest in the country and its impact on the rural parts of my constituency will be vast. It will fundamentally change the character of this largely arable farmland – land which is required, by planning policy, to be kept permanently open, to one of an industrial nature. It is my view that, before the next formal stage of this planning process the following is necessary:\n- It should be significantly scaled back especially in the more sensitive areas close to the village boundaries of Brampton, Ulley, Upper Whiston, Harthill and Woodall and around individual houses that are currently proposed to be surrounded by solar panels.\n- Access for construction vehicles needs to be carefully considered and away from any routes regularly used by walkers and cyclists.\n- Visual impact must be mitigated by significant boundary tree buffers around each site.\n- Battery storage systems and transformers must be sited well away from residential areas and ensure the visual and noise impact is minimised – and health and safety concerns are taken into account.\n- All public footpaths must be maintained and not confined to narrow corridors between rows of solar panels. Additional permissive footpaths should also be provided where there are existing paths used by walkers which are not defined as public rights of way.\n- The Government’s Action Plan for Clean Energy recognises the vital importance of restoring our nature depleted country and states that we should therefore ensure delivery of our climate and nature targets wherever possible in an integrated and joined up way. It is recognised that solar farms can bring significant biodiversity net gains way above the 10% statutory minimum. All of the sites must therefore be developed in such a way that new and diverse habitats are created including new woodland, retention and enhancement of all hedgerows, and wildflower meadows created. There will also be opportunities for areas with poor drainage to create ponds and wetland areas as well as drainage from the solar panels to be via open water swales and balancing ponds, all of which can provide habitats for wildlife.\n- A large part of the site south of Brampton is designated in the Rotherham Local Plan as a non Statutorily Protected Site for nature conservation where it is the policy not normally to permit development. An exception should only be made where the need for the development in that location outweighs both the impact on the site’s intrinsic interest and any broader impacts on the national network of protected sites, and that adequate mitigation and/or compensation measures can be delivered. In view of this the land should be excluded from this development unless the mitigation and compensation measures proposed can ensure its nature conservation value is maintained and enhanced.\n- The Government’s Action Plan makes it clear that those communities that are asked to host energy infrastructure should feel tangible benefits from the role their areas play in building a low cost, clean energy system. It says that ‘Whilst we want to accelerate infrastructure delivery, project developers must be clear that government expects them to continue developing for communities and nature. We are not writing a blank cheque for low quality applications that fail to consider these outcomes’.\n- The Government plans to publish new guidance on voluntary community funds so that communities benefit in a fair way that compensates them for hosting this energy infrastructure. It is therefore clear that, as part of the DCO process, the Planning Inspectorate and the Secretary of State will want evidence of the community gain from this development with information on the mechanism for delivery. It is therefore incumbent on Green Nation to seek views from each community affected by this development of local schemes that can be funded by the developer. This might also include cheaper electricity to those households most directly affected. I hope I can play my role in that consultation process.\n- This development should use local contractors and labour during the construction stage and to train up local people to service this development once operational. Local job creation must be at the heart of this development.\n- In conclusion, I would expect ongoing discussions with myself as a representative of residents’ interests within Rother Valley and trust that the feedback provided above will be fully incorporated into the next formal stage of this development proposal.\nYours sincerely\nJake Richards MP",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_34/content_345.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 6, 2024\nDinnington Banking Hub Update\nDecember 4, 2024\nNovember 2024 Newsletter\nDecember 3, 2024\nWhitestone: Solar Farm Proposal – Your Voice\nPrevious Page\n1\n…\n32\n33\n34\n35\n36\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_01_dc-boxing-secures-further-lottery-funding/content_277.html": "I am thrilled to hear Dinnington Community Boxing club have secured further Lottery funding until April 2027. This is fantastic news for the local community and means the club can continue their work with young people at Dinnington High School and Maltby Academy. The Club also do valuable work providing alternative provision to young people and supporting children’s physical and mental well-being.\nAs well as the Club’s community work, DC Boxing are continuing to grow as an amateur boxing club, which residents can get involved with by joining one of their classes. You can find out more here: https://dcboxing.co.uk/dc-boxing-training/\nKeep up the good work Ian and everyone at DC Boxing!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_28/content_339.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 20, 2024\nStuart Saunders Traditional Butchers #ShopLocalThisChristmas\nDecember 19, 2024\nIncreased Hospice Funding Announced\nDecember 19, 2024\nPreformed Windings Opening\nPrevious Page\n1\n…\n26\n27\n28\n29\n30\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_18_maltby-sports-ground-investigation/content_176.html": "I’m absolutely shocked and concerned about what is happening at Maltby Sports Ground. Last week, a number of concerned constituents raised the issue that the charity which operates the sports ground had closed down, and on the same day, transferred funds to other sports grounds and charities outside of Maltby. As far as I know, nobody in the local community was consulted about this.\nI immediately wrote to the Chief Executive of CISWO – who oversee the relevant charity. Remarkably, it emerged that they were unaware.\nThey have reassured me that the sports ground remains secure and looked after for the benefit of Maltby and the community.\nHowever, we know that the ground needs investment urgently. And the notion that we can afford for money raised at the sports ground to be transferred out of Maltby is for the birds.\nI’m genuinely shocked and angry about what has happened.\nToday, I’ve written to the Sports Minister and the Charity Commission – and will be raising this issue in Parliament.\nWe don’t, at this stage, know how much money has been transferred and the full details – but I’m determined to get to the truth and find out what on earth has been happening.\nWhilst I will be looking into this matter my main focus at this time is assisting the effort to find funds to do up the pavilion at the ground – securing its long term future. I’m really pleased to hear Maltby Town Council and CISWO are making progress in this area.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_35/content_346.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 3, 2024\nWhiston Public Meeting\nDecember 1, 2024\nDC Boxing Secures Further Lottery Funding\nDecember 1, 2024\nRotherham Council Consultation on Broom Road and Wickersley Road Sustainable Transport Corridor\nPrevious Page\n1\n…\n33\n34\n35\n36\n37\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_20_constituents-at-downing-street/content_32.html": "Great to bring David Tomlinson, Sascha Biggin and Andy Tupholm to Downing Street yesterday.\nTomo wrote a fictional book about a group of miners trying to make it through the miners strike. Through the sale of his book and charity night he raised over £4,000 for Hopian. Hopian are a charity dedicated to supporting survivors of domestic abuse and sexual exploitation in Rotherham.\nIt was brilliant to see them and bring Maltby to the heart of government.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_privacy-policy/content_48.html": "Introduction\nThis Privacy Policy explains how Jake Richards MP, the Member of Parliament for Rother Valley, collects, uses, and protects your personal data. Jake Richards MP is committed to protecting and respecting your privacy in compliance with the General Data Protection Regulation (GDPR).\nData Controller\nJake Richards MP is the Data Controller for the purposes of data protection law.\nHow We Collect Your Information\nWe may collect and process the following personal data about you:\n- Information you provide by filling in forms or contacting us (e.g., via email, social media, or in person) including but not limited to your name, address, contact details and enquiry details.\n- Records of correspondence and communications.\n- Information you provide when you subscribe to newsletters or other forms of communication.\n- Information from publicly available sources, if relevant to your contact or issues.\nLegal Basis for Processing\nWe process your personal data based on the following legal bases:\n- Consent: Where you have given clear consent for us to process your personal data for specific purposes.\n- Public Task: Processing is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the Data Controller.\n- Legal Obligation: Processing is necessary for compliance with a legal obligation.\n- Legitimate Interests: Processing is necessary for our legitimate interests or the legitimate interests of a third party, except where such interests are overridden by your interests or fundamental rights. Here are some examples of how we rely on legitimate interests:\n- Constituent Service: We may process your data to understand your concerns and provide you with the best possible service as your Member of Parliament. This may involve using your contact details to respond to enquiries, keep you informed about relevant news and events, or perform casework on your behalf.\n- Campaigning (if applicable): We may share your contact information, with your consent, with the Labour Party for campaigning purposes that align with our values and your interests. You can always opt-out of such communication.\nHow We Use Your Information\nWe use your personal data for the following purposes:\n- To respond to your queries, complaints, or issues.\n- To keep you informed about news, campaigns, and events.\n- To perform casework and advocate on your behalf.\n- To engage with you in your role as a constituent.\n- Where consent is given, to share information with the Labour Party for campaigning purposes.\nSharing Your Information\nWe may share your personal data with:\n- The Labour Party, in line with their privacy policy, for campaigning purposes where you have given your consent.\n- Relevant government departments and agencies, if necessary to address your concerns.\n- Third-party service providers who perform functions on our behalf, such as IT and communication services, ensuring they comply with data protection laws.\n- Other Members of Parliament or officials if your case requires their involvement.\n- Law enforcement or other authorities if required by applicable laws.\nLabour Party Privacy Policy\nFor information on how the Labour Party collects, holds, and processes personal information, you can refer to their privacy policy.\nData Retention\nWe retain your personal data only for as long as necessary to fulfill the purposes we collected it for, including satisfying any legal, accounting, or reporting requirements. The Data Retention Protocol for Members of Parliament outlines specific retention periods based on different categories of data.\nYour Rights\nUnder the GDPR, you have the following rights:\n- Right to Access: You can request access to your personal data.\n- Right to Rectification: You can request correction of your personal data if it is incomplete or inaccurate.\n- Right to Erasure: You can request the deletion of your personal data, under certain conditions.\n- Right to Restriction of Processing: You can request the restriction of processing of your personal data, under certain conditions.\n- Right to Data Portability: You can request to transfer your personal data to another organization, or to you, under certain conditions.\n- Right to Object: You can object to the processing of your personal data, under certain conditions.\nTo exercise any of these rights, please contact us using the details below.\nSecurity of Your Data\nWe take appropriate security measures to protect your personal data from unauthorized access, use, alteration, and destruction. We implement technical and organizational measures to ensure a level of security appropriate to the risks.\nContact Information\nIf you have any questions or concerns about this privacy policy or our data protection practices, or if you wish to exercise your rights, please contact:\nJake Richards MP\nMember of Parliament for Rother Valley\nEmail: [email protected]\nAddress: House of Commons, London, SW1A 0AA\nFor more information about your data protection rights, you can also contact the Information Commissioner’s Office (ICO):\nInformation Commissioner’s Office\nWycliffe House, Water Lane, Wilmslow, Cheshire, SK9 5AF\nTelephone: 0303 123 1113\nWebsite: ICO Concerns\nChanges to This Privacy Policy\nWe may update this privacy policy from time to time. Any changes will be posted on this page, and where appropriate, notified to you by email or other means. Please check back frequently to see any updates or changes to our privacy policy.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_26_community-policing/content_60.html": "I held a public meeting at The Lyric Dinnington about the regeneration project on Dinnington High Street.\nIt was a positive and constructive meeting – but I was struck about how many times the lack of police and the prevalence of anti social behaviour was raised.\nSo, yesterday I asked the Home Secretary about her plans to rebuild community policing in Dinnington, and across the country.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_17_wickerlsey-10k/content_125.html": "Yesterday saw the inaugural Wickersley 10 hit the streets of Wickersley and Thurcroft and what a fantastic event it was! I think everyone can agree we saw the very best of Wickersley on display\nA huge shoutout and admiration goes to the organisers, Team Nick, sponsors, race marshals, local businesses, supporters and everyone else in between who made yesterday a resounding success! I’m already looking forward to Wickersley 10k 2026 (!!)\nIf you would like to donate to Sheffield Children’s Hospital NHS and Charity, to support the amazing work and care they give, you can do so here:",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_03_aston-summer-carnival-2024/content_149.html": "I had a great time at the Aston Summer Carnival. It was a brilliant atmosphere, and a huge success after last year’s event had to be cancelled due to the weather.\nI had a great time at the Aston Summer Carnival. It was a brilliant atmosphere, and a huge success after last year’s event had to be cancelled due to the weather.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_15_anston-cricket-club-charity-day/content_148.html": "It was great to be invited to Anston Cricket Club for their charity day, in very British weather, which raised money for the Willows School in Thurcroft. And the tea was delicious!\nIt was great to be invited to Anston Cricket Club for their charity day, in very British weather, which raised money for the Willows School in Thurcroft. And the tea was delicious!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_9/content_147.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nMarch 17, 2025\nWickerlsey 10k\nMarch 11, 2025\nConstituency Assistant\nMarch 10, 2025\nNational Tremor Foundation\nPrevious Page\n1\n…\n7\n8\n9\n10\n11\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_09_david-tomlinsons-strike-it-lucky-raises-thousands-for-hopian/content_221.html": "Congratulations to David Tomlinson who has raised £4428.50 for Hopian (formerly Rotherham Rise) through the sale of his book, Strike It Lucky. The book is set in 1984 during the miners strike and is both hilarious and poignant!\nThe money will help survivors of domestic abuse and sexual exploitation in Rotherham.\nYou are a legend, Tomo.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_03_dinnington-district-branch-of-the-royal-british-legion-at-tescos/content_210.html": "Really enjoyed selling poppies with the Dinnington & District Branch of The Royal British Legion at Tescos.\nThe Dinnington District Branch covers a large area, including Thurcroft, Kiveton Park, Aston, Swallownest and Anston.\nThis week we will all be remembering those who made the ultimate sacrifice for us.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_29_dinnington-regeneration-project-the-truth/content_179.html": "Despite what some post on Facebook, the Dinnington Regeneration project is progressing. Yes, this project will take time – but I am holding regular meetings with the project managers, and speak regularly with local councillors – and progress is being made.\nThis month, RMBC have made an application for a compulsory purchase order – to force landowners on the high street to sell their properties. This is the only option for the scheme to progress. This will mean some delay – as there is a legal process that needs to be undertaken, but there really is no alternative to delivering. It’s good news this application has been made and I am urging them to act expeditiously, and consider all alternative routes for the project to be delivered as quickly as possible.\nIn the meantime, the plans for the scheme are ready. I held a public meeting in Dinnington recently where a presentation of the plans was given to those who attended. It’s an exciting project, and I hope Dinnington can get behind it. Of course, not everyone will agree with every aspect, and yes, the works will cause some nuisance to residents at times.\nBut I am determined to help deliver this project – working with the council, holding them to account, and working with councillors – of whatever party – to achieve what is best for Dinnington and the wider area. This project is a key part of turning the area around.\nDon’t believe all the bluff from those only eager to promote themselves. Look into the detail, and let me know if you have any questions.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_23_street-surgery-in-north-anston/content_255.html": "Winter sun for my street surgery in North Anston yesterday, which focused on how we can tackle car theft after a spate of burglaries in the area. Looks like ☔️ for my events today!\nAm speaking with the police regularly about this – urging patrols, but also door-to-door conversations with residents about protective equipment.\nI’m also discussing setting up a neighbourhood watch group with residents in the area.\nThank you to the many people who came to see me about this important issue.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_12_speeding-on-the-a57-update-october-2024/content_146.html": "On Friday 4th October, I met with Laura Koscikiewicz, District Commander for Rotherham and raised the issue of boy racers and dangerous driving on the A57. They are aware of the issue, but I remain concerned that the appropriate action is not being taken.\nI have asked them, and they have agreed, to hold a community meeting so they can fully appreciate the scale of the problem and listen to the effect it has on residents’ lives. I’m grateful for them agreeing to this request – and expect it to be a catalyst for further meaningful action. Details will be published here and in the local community in due course.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_22_big-power-for-little-london-meeting/content_186.html": "On Friday, I again met with Big Power For Little London to discuss their campaign to improve the disgraceful housing conditions on the estate. It is one of my priorities to secure justice for the residents. I am pleased to say that I have secured a meeting with the Housing Minister to raise the appalling conditions within the Little London estate in the coming months.\nI am proud of voting to ban no-fault evictions and to better protect renters, who are often mistreated by rogue landlords. This was one of the campaign groups key demands. I will keep supporting Big Power for Little London in their efforts to improve their community",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_2/content_22.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nApril 7, 2025\nTreeton / Ulley Junction Meeting\nApril 5, 2025\n3 Street Surgeries in Laughton en le Morthen\nApril 5, 2025\nYorkshire Water £47 RIP Off Petition in Parliament\nPrevious Page\n1\n2\n3\n4\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_01_swallownest-street-surgery/content_138.html": "Thank you to everyone who came to my street surgery in the beautiful sunshine in Swallownest.\nFollowing the aggravated burglary that took place on Mason Avenue recently, I went to speak with residents to see what I can do to help the local community. Please be assured that I will raise the concerns about policing in the area with the Police and Crime Commissioner and that I am in regular communication with South Yorkshire Police.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_29_visit-to-bluebell-wood-childrens-hospice/content_198.html": "Last week, I visited Bluebell Wood Children’s Hospice and had the pleasure of meeting with Heidi Hawkins, CEO; Eve Holroyd, Care Service Director; and Sam Wood, Income Generation and Communications Director.\nIt was invaluable to catch up with the team at Bluebell Wood and to discuss the children’s hospice sector, as well as what other support and provision can be given to hospices supporting children with life-limiting illnesses.\nThank you for all you do for children and families in our local community – your care, service and support is outstanding.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_in-parliament_page_1/content_28.html": "Latest News in Parliament\nParliament\nRotherham United’s EFL Awards\nRotherham United win a trophy! Brilliant to celebrate Rotherham United’s victory – League One …\nParliament\nCrags Community School at the Houses of Parliament\nIt has been brilliant to welcome Crags Community School to the Houses of Parliament this week. The p…\nParliament\nConstituents at Downing Street\nGreat to bring David Tomlinson, Sascha Biggin and Andy Tupholm to Downing Street yesterday. Tomo wro…\nParliament\nMeeting with Wes Streeting, Secretary of State for Health and Social Care\nYesterday, I met with Wes Streeting, Secretary of State for Health and Social Care. I am absolutely …\nParliament\nJake Richards MP Speech about BCSSS\nYesterday, I spoke in the House of Commons to ask the government what they are doing to reassure and…\nParliament\nNational Tremor Foundation\nGreat to meet Kitty from Maltby in Parliament! As Chair of the National Tremor Foundation, Kitty and…\nRSS Feed in Parliament\nYou can see Jake Richards’s latest appearances and speeches in Parliament (thanks to theyworkforyou):\nLoading RSS feed…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_14_maltby-redwood-primary-school-visit/content_178.html": "I was delighted to visit Maltby Redwood Academy last week. It was great to take a tour of the wonderful facilities at the school, meet their hardworking staff and very polite pupils and ‘school leaders’.\nIt was really useful to speak with the principal, Ruth Berry, and David Horrigan, Executive Director of Primary Education for Maltby Learning Trust.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_05_yorkshire-water-47-rip-off-petition-in-parliament/content_13.html": "This week, I presented Rother Valley’s petition, signed by over 1000 residents, to the House of Commons urging the government to take action to stop Yorkshire Water retrospectively charging residents £46.65.\n‘The petition of residents of the constituency of Rother Valley in South Yorkshire,\nDeclares that Yorkshire Water should cancel their retrospective charge to residents of £46.65 which was not included in their last Annual Bill for April 2024 – March 2025; further that in mistakenly not including this charge, Yorkshire Water has put residents under further stress during a cost-of-living crisis; further that such a mistake is particularly frustrating for residents given Yorkshire Water’s failure to properly invest in upgrading infrastructure.\nThe petitioners therefore request that the House of Commons urge the Government take immediate action to stop Yorkshire Water retrospectively charging residents £46.65.’\nI will keep residents up to date with any further information on this matter.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_49/content_274.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 22, 2024\nBig Power for Little London Meeting\nOctober 20, 2024\nLeger Lakes Tearoom\nOctober 18, 2024\nAston Academy Visit\nPrevious Page\n1\n…\n47\n48\n49\n50\n51\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_23_harrycroft-quarry-blast/content_123.html": "Over the weekend, I have had numerous residents reach out to me about the blast from the Harrycroft Quarry in South Anston. The most recent blast shook homes and caused windows to rattle and residents report this is the most severe blast they have experienced since living there.\nI have written to the council to seek answers about whether they are continuing to monitor the Quarry’s activities and to find out more information about the current regulations the Quarry is following to ensure that its activities remain compliant.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_19_a-conversation-on-assisted-dying-2/content_267.html": "As many of you know, a Private Members’ Bill has been introduced, and will begin its journey through Parliament next week. The Bill proposes to legislate to ‘allow adults who are terminally ill, subject to safeguards and protections, to request and be provided with assistance to end their own life; and for connected purposes’.\nThe last online meeting I held on this was really powerful and allowed for both sides of the discussion to be explored. Many voiced their opinions, asked questions, and engaged in a meaningful conversation. To give as many people the opportunity to share their views, and to listen to others, I will be holding another online public meeting on Monday 25th November at 7pm.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_35/content_127.html": "Baby Loss Awareness Week 2024\nThis year Baby Loss Awareness Week will take place between Wednesday 9th October and Tuesday 15th Oc…\nHarvest Soup Lunch\nI was delighted to be invited to join the Harvest Soup Lunch at St Alban’s Barn in Wickersley. It wa…\nHarthill Reservoir\nI was very excited to see the progress towards the completion of the upgrades to Harthill Reservoir …\nRotherham Hospice\nI was grateful to be invited to Rotherham Hospice to take a look around and meet the CEO, Mat Cottle…\nSupporting Sense\nThere are 1961 people living with complex disabilities in Rother Valley and it is imperative that we…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_25_whitestone-march-2025-update/content_122.html": "Many residents will be receiving updated plans from the proposed Whitestone solar development in our area.\nI want to be clear: I cannot support these plans. I have been holding regular meetings with residents and the developer. I am pleased that this has resulted in some significant changes and a 25% reduction in the scale of the plan. It is welcome that particular areas which local residents sought to be protected have been.\nBut nonetheless, the revised plan is not good enough. Whilst I support the government’s plans for more renewable energy to cut bills and end our reliance on foreign supplies, my priority is always my constituents. Residents in the affected areas – Harthill, Woodall, Aston, Brampton-en-le-Morthen and Ulley – are rightly worried about this and I will stand with them.\nI will continue to work with the developer, urging them to make further changes. And over the coming months, I will be holding further public meetings for residents. Please do keep an eye out for these on Facebook and elsewhere.\nThe formal application still has not been made. This is likely to occur in the summer of 2026. I hope that further changes will be made before then. In the meantime, if you have any questions, or want to raise any issues with me, please do let me know: [email protected]",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_24/content_328.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 8, 2025\nDiscussing the Jay Inquiry on Politics Live\nJanuary 8, 2025\nYoga and Mindfullness\nJanuary 6, 2025\nDisruption across Rother Valley\nPrevious Page\n1\n…\n22\n23\n24\n25\n26\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_4/content_47.html": "Whitestone – March 2025 Update\nMany residents will be receiving updated plans from the proposed Whitestone solar development in our…\nMale Suicide in Rotherham\nAcross the UK around 100 men take their own lives each week. And here in Rotherham, we have more&nbs…\nStreet Surgery in Hellaby\nYesterday I held a street surgery with residents in Hellaby to discuss early proposals for a new hou…\nWales Primary School Visit\nLast week I visited Wales Primary School following the damage caused by the winter storm. I’m please…\nChris Jepson doing the Great Tommy Sleepout\nGreat to pop over to Wickersley to see Wickersley veteran Chris Jepson doing the Great Tommy Sleepou…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_10_national-tremor-foundation/content_15.html": "Great to meet Kitty from Maltby in Parliament!\nAs Chair of the National Tremor Foundation, Kitty and her team are doing incredible work to raise awareness of essential tremor—a neurological condition affecting at least 1.5 million people in the UK, including many children. Their dedication is making a real difference!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_23_office-christmas-closure-2024/content_300.html": "My office will be closed over the Christmas period and up to New Year.\nUseful Contacts information can be found here -> Useful Contacts\nIf you need anything over this time, please do get in touch by emailing jake.richards.mp@parliament.uk or drop a message on Facebook and my team and I will still be here to help if you need it.\nHave a wonderful festive period everyone and Merry Christmas!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_in-parliament_page_6/content_63.html": "Latest News in Parliament\nParliament\nMale Suicide Support for Andys Man Club Maltby, Better Today, The Learning Community Ltd and others\nMALE SUICIDE – support for Andys Man Club Maltby, Better Today, The Learning Community Ltd and…\nParliament\nBig Power For Little London Update July 2024\nFor many months, Big Power For Little London have been campaigning for changes to the law to end no-…\nParliament\nSworn my allegiance to his majesty the King\nI have sworn my allegiance to his majesty the King, and formally affirmed my commitment to everyone …\nRSS Feed in Parliament\nYou can see Jake Richards’s latest appearances and speeches in Parliament (thanks to theyworkforyou):\nLoading RSS feed…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_30/content_341.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 16, 2024\nWhitestone Solar Farm Proposal: Online Public Meeting\nDecember 15, 2024\nUlley Public Meeting\nDecember 14, 2024\nSanta Sleigh Run – Maltby and Rother Valley Lions\nPrevious Page\n1\n…\n28\n29\n30\n31\n32\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_in-parliament_page_2/content_41.html": "Latest News in Parliament\nParliament\nWales High School in Parliament\nIt was great to be joined by sixth formers from Wales High School in Parliament this week. They aske…\nParliament\nSafer Internet Day\nToday is Safer Internet Day and is the UK’s largest celebration of online safety, empowering young p…\nParliament\nNuclear Week in Parliament\nThis week is Nuclear Week in Parliament. Did you know that the civil nuclear industry employs nearly…\nParliament\nHolocaust Memorial Day\nIt is 80 years since the liberation of Auschwitz-Birkenau, the largest Nazi concentration camp. Thes…\nParliament\nBig Power for Little London in Parliament\nBig Power For Little London came to Parliament last month and met with the Housing Minister, and beg…\nParliament\nLittle London in Parliament\nI meet with the campaign group Big Power For Little London regularly. They are an amazing group of r…\nRSS Feed in Parliament\nYou can see Jake Richards’s latest appearances and speeches in Parliament (thanks to theyworkforyou):\nLoading RSS feed…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_26/content_334.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 2, 2025\nReminder: Whitestone Solar Farm Public Meeting\nJanuary 2, 2025\nMeeting with SharkEye Wheel Aligners\nDecember 31, 2024\nSkoopz Desserts\nPrevious Page\n1\n…\n24\n25\n26\n27\n28\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_04_christmas-card-competition-2024/content_144.html": "CHRISTMAS CARD COMPETITION\nI am inviting primary school children across Rother Valley to design the front cover of my first Christmas Card.\nEntrants must be aged 11 or below and can use anything they like to design the card, as long as the background is A4 plain paper.\nEntries can be sent by scanning an image of the design or taking a photograph of it (a scan is preferable!)\nDeadline to enter is 31st October 2024.\nAll rules can be read above.\nI look forward to seeing the designs!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_07_treeton-ulley-junction-meeting/content_2.html": "I am very aware of the long-standing and incredibly frustrating issues at this junction. The traffic, especially at rush hour, is horrendous but perhaps more importantly is the number of accidents that occur here. That is why I arranged for representatives of the council, and local councillors from Treeton and Swallownest, to attend a meeting at the site. I have demanded that the council’s road management team set out to residents what the realistic options are for this stretch of road. Once I have been informed as to these, we can begin to see what steps we can take. I will be holding a meeting with residents to discuss these options and how we can take them forward.\nI am aware that money is tight for local authorities and I know they have lots of priorities, but when so many residents raise this issue with me, I will do everything I can to act. I am happy to work with anyone on this, so please do get in touch if you have any suggestions or specific concerns, and look out for the public meeting in due course.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_7/content_164.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nNovember 6, 2024\nConstituency Garden of Remembrance\nNovember 4, 2024\nWales Primary School Eco-School success in the House of Commons\nOctober 30, 2024\nEnding the Injustice of the Mineworkers Pension Scheme\nPrevious Page\n1\n…\n5\n6\n7\n8\n9\n…\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_22/content_263.html": "Whitestone: Solar Farm Proposal – Your Voice\nAs many of you are aware, there is a recent proposal for a solar farm development that will cover pa…\nWhiston Public Meeting\nThank you to everyone who came to my public meeting in Whiston, I really did appreciate residents ta…\nDC Boxing Secures Further Lottery Funding\nI am thrilled to hear Dinnington Community Boxing club have secured further Lottery funding until Ap…\nRotherham Council Consultation on Broom Road and Wickersley Road Sustainable Transport Corridor\nRotherham Council currently have a consultation open to gather your thoughts on the proposed Broom R…\nWhite Ribbon Day\nMonday 25th November was White Ribbon Day, where men showed their commitment to preventing violence …",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_26_wales-primary-eco-school-visit/content_252.html": "It was wonderful to meet Y6 yesterday to speak to them about their Eco-School success. The class have formed an Eco-Committee and have worked through the seven steps to achieve Eco-School accreditation, which is a wonderful achievement. The class were really keen for other schools to work towards becoming an Eco-School.\nThe Eco-Committee have organised litter picks in their school grounds and around the community in Kiveton Park. During one of their litter picks they collected three bags of litter! They have also placed recycling bins in every classroom and have big plans to rewild parts of their school grounds to encourage biodiversity.\nI was really impressed with the questions they asked about the environment and my role as an MP. They were a credit to the school.\nWe also discussed the jobs they would like to do when they’re older. Lots of footballers, an astronaut, a vet, a doctor and even a blacksmith!\nThank you for having me and keep up the hard work!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_22_uk-parliament-week/content_220.html": "🗳️UK PARLIAMENT WEEK🗳️\nThis week has been UK Parliament Week, which is a where schools and organisations come together to learn about the role of Parliament. It is an opportunity to learn about democracy, the role of elected representatives and to find out how Parliament works for you.\nI have had the pleasure of visiting Thurcroft Junior Academy, The Willows School and Maltby Academy to discuss my job as an MP and to answer questions. I’ve also had the privilege of participating in a Q&A at Wales Primary School a few weeks ago.\nIt has been wonderful to meet students from across the constituency and to meet some budding politicians!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_17_visit-to-shiloh-rotherham/content_126.html": "Shiloh Rotherham – Homeless Support are an amazing charity providing support to anyone who is homeless in Rotherham. I went along to have a tour of Shiloh and met with the CEO, Sarah Smart.\nThey assist people who are rough sleeping, sofa surfing or living in temporary accommodation across Rotherham and provide a range of facilities for guests of the service. These facilities include hot showers, food, laundry services, toiletries, clothing, bedding and internet access. Shiloh also offer housing advice, education & training, creative activities and support for health and addictions.\nInterested in volunteering at Shiloh? Email [email protected].",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_06_jake-richards-mp-for-rother-valley-speech/content_51.html": "I’m honoured to serve as the Member of Parliament for Rother Valley.\nI’d like to thank all my team, who have worked so tirelessly in a long and tough general election campaign.\nBut thank you most of all to the voters of Rother Valley. I have had thousands of conversations over the campaign. To all those who supported me, and those who did not, I thank you for taking the time to talk. It is an enormous privilege – the privilege of my life – to serve as your Member of Parliament. I hope to do so in the spirit of service, bringing people together for the common good, and representing our interests in Parliament.\nI want to pay tribute to all the candidates in this election. It is never easy to put your head above the parapet and stand for public office. Each has done so with great spirit – and I thank them.\nI also want to pay tribute to Alexander Stafford. We may disagree on many issues, but Alexander worked tirelessly and I have no doubt believed passionately in the causes he supported. I thank him, on behalf of so many.\nAs I said during the campaign, I look forward to working with everyone across the community – of whatever political colour – to make the improvements we so desperately need.\nIt will take me some time to set up my Parliamentary office, with staff and the ability to take up casework. Please do bear with me. But I look forward to getting to work.\nThank you.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_18/content_308.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 30, 2025\nWhitestone Solar Farm Development – First Consultation\nJanuary 29, 2025\nDinnington Regeneration Project: The Truth\nJanuary 29, 2025\nVisit to Bluebell Wood Children’s Hospice\nPrevious Page\n1\n…\n16\n17\n18\n19\n20\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_15_introduction-to-parliament-week-at-thurcroft-junior-academy/content_208.html": "It was wonderful to join a whole school assembly at Thurcroft Junior Academy to talk about the upcoming UK Parliament Week and to answer their questions about my role as an MP.\nTheir questions were brilliant and they were so polite and well behaved. Thank you for having me.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_02_meeting-with-sharkeye-wheel-aligners/content_297.html": "I was thrilled to meet with the SharkEye Wheel Aligners UK Ltd team in Hellaby to discuss the benefit wheel alignment has on vehicles. Benefits include reduced emissions, lower fuel consumption and tyre wear.\nThe team were really knowledgeable and passionate about their work, with SharkEye manufacturing here in Rother Valley and supplying equipment around the world.\nThank you for inviting me to meet with your team and see your Hellaby factory",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_20_battling-on-with-big-power-for-little-london/content_213.html": "Continuing the fight for Little London, I met with Big Power For Little London and Sharon Kemp, Chief Executive of RMBC, to discuss next steps that can be taken for the residents of Little London.\nDiscussion centred around enforcement and licencing of the site, with planning officers reviewing decisions taken so far.\nWe keep going – I will always support the residents of Little London.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_38/content_99.html": "Raising Speeding issue in Parliament\nI raised the issue of speeding and boy racers across the constituency in Parliament last week. This …\nYorkshire Water Letting Down Kiveton\nYORKSHIRE WATER LET DOWN KIVETON AGAIN There was another burst water main in Kiveton earlier today o…\nSpeeding on the A57\nI met with concerned residents living just off the A57. I have seen footage of the racing that occur…\nAnston Cricket Club Charity Day 2024\nIt was great to be invited to Anston Cricket Club for their charity day, in very British weather, wh…\nAndy’s Man Club Came to Parliament\nI was thrilled to host Andy’s Man Club on World Suicide Prevention Day in Parliament. The group from…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_8/content_117.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nOctober 18, 2024\nJake Richards MP introduces Private Members’ Bill\nOctober 16, 2024\nConstituents Visit Parliament\nOctober 16, 2024\nJake Richards MP Question to Prime Minister\nPrevious Page\n1\n…\n6\n7\n8\n9\n10\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_11_remembrance-2024/content_228.html": "Remembrance Sunday is a special time.\nThank you to all those who organised the many events across the constituency. I was able to get to some of them, but not all – but each is important to remember fallen heroes, and to show our appreciation to the work our armed forces undertake every day for us all.\nAt 11 this morning, we shall fall silent once again for a minute to remember. I will be in Maltby with the Royal British Legion Maltby Branch – and hope to see you there.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_40/content_101.html": "Dinnington High Street Project Update – July 2024\nThere have been a lot of rumours and, frankly, lies spread about the Dinnington regeneration project…\nMaltby to Rotherham Bus Service\nI have written to Oliver Coppard, the Mayor of South Yorkshire, about the continued loss of the dire…\nScarecrow Trail in Firbeck 2024\nWhat a brilliant day at the Scarecrow Trail in Firbeck! Firbeck Village Community Forum Thank you to…\nPublic meeting in Whiston – August 2024\nThank you to everyone who came to the public meeting in Whiston yesterday to tell me about their exp…\nAston Summer Carnival 2024\nI had a great time at the Aston Summer Carnival. It was a brilliant atmosphere, and a huge success a…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_08_woodsetts-christmas-fair/content_276.html": "Thank you to everyone who braved the weather to come to Woodsetts Christmas fair.\nLovely to see everyone! Just a few weeks to Christmas. 🤶 🎄\nThank you to everyone who braved the weather to come to Woodsetts Christmas fair.\nLovely to see everyone! Just a few weeks to Christmas. 🤶 🎄",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_3/content_27.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nApril 4, 2025\nNew School Based Nursery in Rother Valley\nApril 4, 2025\nVisit to Coffee Hut at Oh My Sweet Baby\nApril 4, 2025\nVisit to Rotherham Hospice\nPrevious Page\n1\n2\n3\n4\n5\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_10_meeting-with-the-manager-of-the-queens-hotel-in-maltby/content_262.html": "It was a pleasure to meet with Beth, the manager of the Queens Hotel in Maltby, and Wetherspoons’s area team to discuss how anti-social behaviour has been impacting the pub.\nBeth has done an incredible job since being manager. Under her leadership the Queens is now a community hub, with a range of events taking place to benefit families, elderly residents, and young people.\nWe had a productive discussion about how I can help support the Queens in dealing with anti-social behaviour moving forward.\nHave a great weekend everyone!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_6/content_104.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nMarch 25, 2025\nWhitestone – March 2025 Update\nMarch 24, 2025\nMale Suicide in Rotherham\nMarch 23, 2025\nStreet Surgery in Hellaby\nPrevious Page\n1\n…\n4\n5\n6\n7\n8\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_03_scenes-of-violence-and-thuggery/content_89.html": "Yesterday, I spoke in the House of Commons about the scenes we saw in Wath last month.\nViolence and thuggery does not represent us. It is our community pulling together to show unity and solidarity which does.\nWatch the full video below, and the Home Secretary’s response.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_19_raising-speeding-issue-in-parliament/content_110.html": "I raised the issue of speeding and boy racers across the constituency in Parliament last week.\nThis is an issue that I am hearing from residents time and time again, with too many tragic accidents happening in Rother Valley. Enough is enough.\nI raised the issue of speeding and boy racers across the constituency in Parliament last week.\nThis is an issue that I am hearing from residents time and time again, with too many tragic accidents happening in Rother Valley. Enough is enough.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_14_santa-sleigh-run-maltby-and-rother-valley-lions/content_313.html": "Had a brilliant time joining the Maltby and Rother Valley Lions in Aston last night.\nAn amazing team spreading festive cheer on the run up to Christmas, whilst raising money for the Lions who do so much for our community.\nHad a brilliant time joining the Maltby and Rother Valley Lions in Aston last night.\nAn amazing team spreading festive cheer on the run up to Christmas, whilst raising money for the Lions who do so much for our community.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_30_dinnington-banking-hub-update-september-2024/content_170.html": "DINNINGTON BANKING HUB\nI recently visited the site for the new banking hub on Dinnington High Street.\nThis is going to be a fantastic local resource for residents. Many people were forced to travel to Sheffield just to do their banking which was not good enough. Each week, different high street banks will be operating from the hub ensuring people can now sort out their money closer to home. The location is superb and the works are ongoing, and expected to be completed by the end of the year, with an opening in January or February.\nThe hub will be holding a community event this autumn to explain how it works, and when each bank will be available for use in any given week. I am helping them organise this and will advertise it widely when we have a date and location.\nThis is a really exciting development for the high street – and will hopefully give a boost to local businesses. Thank you to all those who helped make it happen – including local councillors and my predecessor.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_01_rotherham-council-consultation-on-broom-road-and-wickersley-road-sustainable-transport-corridor/content_266.html": "Rotherham Council currently have a consultation open to gather your thoughts on the proposed Broom Road and Wickersley Road Sustainable Transport Corridor.\nThe proposal is in response to residents reporting unsafe parking in the area, speeding and non-local traffic cutting through the area, which poses a risk to local residents.\nI encourage as many residents as possible to give their feedback on the proposal. I have attached the plans for Stag Roundabout and Broom Road/Wickersley Road.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_14/content_270.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nFebruary 20, 2025\nVisit to Todwick Early Years\nFebruary 17, 2025\nVisit to Shiloh Rotherham\nFebruary 16, 2025\nVisit to Anston Brook Primary School\nPrevious Page\n1\n…\n12\n13\n14\n15\n16\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_22_1509/content_132.html": "Thank you to all residents who came to the surgery I held in Letwell (Buster the dog can come more often!!!). It is really important to hear the different challenges faced in more rural parts of Rother Valley. Thank you to Cllr Amanda Clarke, Dinnington Labour for joining too.\nNeed help with something? Please email jake.richards.mp@parliament.uk",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_15_all-party-parliamentary-group-appg-for-children-who-need-palliative-care/content_78.html": "In Parliament I attended a drop-in event hosted by the All Party Parliamentary Group (APPG) for Children Who Need Palliative Care, where I met with Ben Dellow, Policy and Public Affairs Officer at Together for Short Lives.\nChildren’s hospices like Bluebell Wood Children’s Hospice provide vital support to families during unimaginably difficult times. It is crucial that we ensure these services are adequately funded now and in the future. I am therefore pleased by the announcement earlier today that the Children’s Hospice Grant will continue.\nI am committed to supporting Bluebell Wood in anyway I can and will continue to raise money for them in the future.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_useful-contacts/content_10.html": "| Name | Contact Details |\n| Rotherham Council | 01709 382121 www.rotherham.gov.uk/contact-us |\n| Money Matters and help with energy bills | www.rotherham.gov.uk/money-matters |\n| Citizens Advice Bureau | 0800 1448848 |\n| Open Arms cost of living help | 01709 368515 |\n| RMBC out of hours noise nuisance line (6pm to midnight) | 01709 823140 |\n| Concerned about a child or young person? | 01709 336080 |\n| Concerned about an older person? | 01709 822330 |\n| Don’t miss a bin collection | www.rotherham.gov.uk/bins |\n| Police non-emergency | 101 www.southyorks.police.uk/contact-us/report-something/ |\n| Domestic abuse helpline | 0808 2000 247 |\n| NHS Advice line | 111 |\n| Public transport information | 0800 952 0002 www.travelsouthyorkshire.com |\n| Samaritans | 116 123 |\n| NHS Talking Therapies for anxiety and depression | 03000 215108 https://talkingtherapies.rdash.nhs.uk/ |\n| Gas emergency | 0800 111 999 |\n| Power Cut | 105 |\n| Yorkshire Water | 0800 573553 |",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_4/content_97.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nApril 3, 2025\nBattery Energy Storage System at Hard Lane, Kiveton Park – Jake Richards MP Response\nApril 3, 2025\nRotherham United’s EFL Awards\nMarch 29, 2025\nCoffee Morning Whiston Methodist Church\nPrevious Page\n1\n2\n3\n4\n5\n6\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_17/content_250.html": "Skoopz Desserts\nFancying a sweet treat? It was great to go and meet the team at Skoopz desserts in Thurcroft, who op…\nOffice Christmas Closure 2024\nMy office will be closed over the Christmas period and up to New Year. Useful Contacts information c…\nStop The Maltby Pit Tip Plan\nI spoke in Parliament about the destructive plans at Maltby Pit Tip. I am against this plan – and wi…\nOpening of the Dinnington Banking Hub\nI was thrilled to officially open the Banking Hub in Dinnington yesterday, delivered by Cash Access …\nStuart Saunders Traditional Butchers #ShopLocalThisChristmas\nPopped into Stuart Saunders Traditional Butchers to grab a joint of gammon for Christmas. They provi…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_07_small-business-saturday/content_303.html": "🛍️TODAY IS SMALL BUSINESS SATURDAY🛍️\nA campaign that shines a spotlight on small businesses. Every purchase, positive review, like and share you make today supports local businesses, but also the wider local community.\n🔎LOCAL BUSINESS SPOTLIGHT🔎\nLikkle More Seasonings, which is run by Raegan, is a local business in Maltby seasoning up a storm with her Jamaican roots. Raegan sells a range of seasonings and spices for all of your cooking needs, with a focus on creating delicious Jamaican dishes. Raegan’s seasonings would make a brilliant Christmas present, so do check Likkle More Seasonings out. 🧂🍽️👇",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_22_dinnington-high-street-project-update-july-2024/content_141.html": "There have been a lot of rumours and, frankly, lies spread about the Dinnington regeneration project. This is a great shame and doesn’t help anyone. Here are the facts.\nOne of the first things I did when I was elected was write to the Chief Executive of the Council for an update as to the project. She replied. I have shared her reply previously but she confirmed that work was currently planned to start in 2025 and be completed by the next year. The project had been delayed because it required purchasing of several private properties as well as moving shop-keepers to other locations whilst the work took place. This may involve the need to apply to the High Court for a compulsory purchase order.\nThis is still the case. The money remains allocated to this project.\nI am determined to deliver the project, and am working with local councillors – Conservative and Labour – to try and do this. I’m also in contact with the Dinnington Town Council, and am involving them in the discussions.\nI was on BBC Sheffield recently discussing just this, you can listen to the interview",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_13_white-woods-primary-academy-trust/content_256.html": "It was great to meet with Kate Davies, Chief Executive Officer, and John Dean, Chief Operation Officer, of White Woods Primary Academy Trust, who oversee six primary schools in Rother Valley – Anston Brook Primary School, Anston Park Junior School, Dinnington Community Primary School, Whiston Junior & Infant School, Whiston Worrygoose J&I School and Woodsetts Primary School.\nWe had a great discussion about the Trust and their primary schools. Thank you for inviting me in to meet you both.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_20_meeting-with-wes-streeting-secretary-of-state-for-health-and-social-care/content_59.html": "Yesterday, I met with Wes Streeting, Secretary of State for Health and Social Care.\nI am absolutely delighted to see waiting lists falling in Rotherham, with waiting lists down by 868 between October 2024 and January of this year.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_3/content_43.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nFebruary 14, 2025\nWales High School in Parliament\nFebruary 11, 2025\nSafer Internet Day\nJanuary 30, 2025\nNuclear Week in Parliament\nPrevious Page\n1\n2\n3\n4\n5\n…\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_22_wales-high-school-visit/content_280.html": "Last week, I visited Wales High School and met with the headteacher, Lisa McCall. We discussed a wide range of matters, including the building work that is due to take place next year, which will see a brand new school building built. This is an exciting opportunity for the school and the wider community, and I look forward to seeing the project progress.\nThank you for having me",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_23/content_325.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 12, 2025\nRotherham to receive £1.3m for early years support\nJanuary 10, 2025\nMeeting with the manager of the Queens Hotel in Maltby\nJanuary 9, 2025\nDavid Tomlinson’s ‘Strike It Lucky’ raises thousands for Hopian\nPrevious Page\n1\n…\n21\n22\n23\n24\n25\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_1/content_23.html": "Wickersley Street Surgery\nThank you to all the residents who came to my street surgery in Wickersley, with many residents rais…\nThorpe Salvin Street Surgery\nReally enjoyed speaking to residents in Thorpe Salvin in the beautiful sunshine. Need help with anyt…\nFree family Easter Event – The Slip in Maltby\nFree family Easter event on Monday 21st April from 2-5pm at The Slip in Maltby. Do pop along! Thank …\nTreeton / Ulley Junction Meeting\nI am very aware of the long-standing and incredibly frustrating issues at this junction. The traffic…\n3 Street Surgeries in Laughton en le Morthen\nBrilliant to be out in the beautiful sunshine in Laughton en le Morthen this morning. Thank you to a…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_surgeries/content_25.html": "I hold regular appointment advice surgeries at my office or online. If you would like to make an appointment please email me by clicking here.\nStreet Surgeries\nI regularly have street surgeries across the constituency, where you can come and speak to me about your concerns.\nUpcoming Street Surgeries:\n- Please get in touch to ask when our next street surgery will be near you\nWhat has Jake been up to in Rother Valley?\nYou can see where Jake has done public events and street surgeries so far since being elected below:\nMap Key\nSurgery\nEvent / Visit",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_62/content_135.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nAugust 2, 2024\nPublic Meeting: Speeding & Traffic Concerns in Sitwell, Whiston and Wickersley\nJuly 27, 2024\nA57 Crossing: Update\nJuly 24, 2024\nDinnington High Street Update Letter – July 2024\nPrevious Page\n1\n…\n60\n61\n62\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_12_rotherham-to-receive-1-3m-for-early-years-support/content_244.html": "I am delighted to learn that Rotherham is expected to receive at least £1,322,100 through family hubs and the Start for Life programme.\nThis funding is part of a £126 million boost for families to give every child the best start in life.\nFamilies and children across Rotherham will be able to access early years support such as pregnancy support, infant feeding advice, parenting classes, and other support.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_11_safer-internet-day/content_70.html": "Today is Safer Internet Day and is the UK’s largest celebration of online safety, empowering young people to navigate the internet securely and confidently.\nEach year, the campaign highlights critical issues young people face online, and this year’s focus is scams. It was really important to hear from young people directly about their experience with scams online and to discuss how we can better protect young people online now and in the future.\nFor more information on how to protect yourself from scams, you can visit https://saferinternet.org.uk/safer-internet-day-2025-top….",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_17_firbeck-christmas-fair/content_307.html": "Firbeck really does know how to put on a Christmas Fair!\nThere was a fabulous range of stalls selling homemade items, as well as very tasty turkey and stuffing sandwiches coming from the kitchen! There really was a wonderful festive atmosphere in the village hall, which is testament to Firbeck Village Community Forum efforts.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_24_dinnington-high-street-update-letter-july-2024/content_45.html": "I have received a response to my letter, sent last week, seeking an urgent update as to the high street regeneration project. See the response\nI’m grateful to Ms Kemp for responding.\nThe letter confirms that the project is still very much going ahead, despite rumours to the contrary, and it’s welcome that we have some clarity as to the timeframes.\nWhilst I’d like the works to happen more quickly – and will continue pushing for urgency – it’s clear that the project requires complex purchasing of private land, and negotiation with landlords and shopkeepers for arrangements for their businesses during the building work. This does take time. But we must also keep the council’s feet to the fire to ensure these latest timeframes, at the very least, are kept to.\nI still want the council to commit to further communications and updates with the public. At the moment, this is not good enough.\nThat’s why I am going to organise a meeting in the autumn, for everyone, to ensure the Dinnington community is aware of the progress and can ask any questions and raise any issues.\nI will be keeping everyone up to date.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_08_rotherham-show-2024/content_74.html": "I had a wonderful time at Rotherham Show yesterday. Well done to the organisers and to everyone who is running a stall this year.\nHead down between 11am and 5pm today to see for yourself – it’s a great day out!\nI had a wonderful time at Rotherham Show yesterday. Well done to the organisers and to everyone who is running a stall this year.\nHead down between 11am and 5pm today to see for yourself – it’s a great day out!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_17_big-power-for-little-london-in-parliament/content_94.html": "Big Power For Little London came to Parliament last month and met with the Housing Minister, and begun work to set out plans to transform the community in Maltby.\nTake a watch to find out more:\nBig Power For Little London came to Parliament last month and met with the Housing Minister, and begun work to set out plans to transform the community in Maltby.\nTake a watch to find out more:",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_27_a57-crossing-update/content_121.html": "When I was elected as our MP, I urgently requested an update from the council as to when the crossing near Elmwood Farm would be completed. I know how important this is to the community and is the result of a long campaign from many.\nBelow is the plan of the crossing. I’m told work will begin in the autumn and will be completed in weeks.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_5/content_111.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nDecember 5, 2024\nAmbitious About Autism\nDecember 4, 2024\nNovember 2024 Newsletter\nNovember 29, 2024\nTerminally Ill Adults (End of Life) Bill – Second Reading\nPrevious Page\n1\n…\n3\n4\n5\n6\n7\n…\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_16_maltby-christmas-light-switch-on/content_224.html": "Brilliant to see the Maltby and Rother Valley Lions at the Christmas light switch on event today.\nReally looking forward to joining their sleigh rides in December!\nBrilliant to see the Maltby and Rother Valley Lions at the Christmas light switch on event today.\nReally looking forward to joining their sleigh rides in December!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_02_meeting-with-leader-of-rotherham-council-cllr-chris-read/content_69.html": "Great to catch up with Chris Read, Leader of Rotherham Council, to discuss various topics and issues across Rother Valley. It was a very productive meeting, with a focus on the issues raised with me by residents across the constituency.\nGreat to catch up with Chris Read, Leader of Rotherham Council, to discuss various topics and issues across Rother Valley. It was a very productive meeting, with a focus on the issues raised with me by residents across the constituency.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_29_coffee-morning-whiston-methodist-church/content_34.html": "What a lovely coffee morning!!!\nThank you for inviting me to the Whiston Methodist church – it was great to chat. The church is also raising funds for renovations and are holding a special service next Sunday, which I look forward to!\nI also picked up some casework about traffic issues directly outside the church, which I am already working on.\nThank you again – and see you soon.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_14/content_226.html": "Upcoming Advice Surgery with Cllr Donna Sutton\nI will be joining Cllr Donna Sutton for her advice surgery tomorrow. Come on down to Edward Dunn Mem…\nRMBC announce Rotherham Baby Packs\nThis is brilliant news – do sign up for your Rotherham Baby Pack if you are due after Monday 7…\nWales Community Theatre Players: Cinderella\nIt was great to pop into one of the last rehearsals before this week’s opening of Cinderalla. The sh…\nTraining for the Wickersley 10k!\nWickersley’s first ever 10km race, Wickersley 10, is in March this year and I was out along Ch…\nRotherham to receive £1.3m for early years support\nI am delighted to learn that Rotherham is expected to receive at least £1,322,100 through family hub…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_22_submission-to-rmbc-on-proposed-reclamation-of-maltby-colliery-tip/content_189.html": "Introduction\nThis submission lays out my outstanding objections to the planning application by Maltby Management Ltd to convert Maltby Colliery into a limestone quarry. These objections are drawn from my own reading of the application, conversations with local residents and the Environment Agency, and an impact assessment by Maltby Town Council.\nI am grateful for the extension Rotherham Council has provided for this consultation; many residents have needed longer to examine the planning application, especially given the scale of the proposed impact to local infrastructure and the environment. This additional time has helped produce this more comprehensive list of objections.\nOutstanding objections\n1. Impact on local infrastructure\nAccording to Maltby Town Council, the town’s current road infrastructure is already unprepared for any “significant and growing amount of vehicular traffic which uses it…congestion, parking, highway and pedestrian safety issues are a growing concern on some of the roads”. The application describes a serious increase in HGV movement through Maltby – an average of 128 driving through Maltby six days a week. The already busy Maltby High Street would see a serious increase in traffic – an estimated 10.5 HGV movements per hour according to Maltby Town Council’s own assessment. How will Rotherham Council ensure that Maltby is able to handle this increase in congestion?\nResidents have also raised doubts over how committed the applicants will be to their own timings. The application states in Chapter 12 section 12.42 that “material imports are conducted between 07:00 to 19:00 Monday to Friday, and 07:00 to 13:00 on Saturday”. However, 18 HGVs were recorded leaving and entering the pit site on the 19th of December between 06:00 and 07:00.\nRelated to this is the potential for anti-social noise pollution. The application outlines “HGV and plant maintenance” between 06:00am and 21:00pm from Monday to Friday, and “Pumping” between 00:00 and 23:59 seven days a week. Given this, and the serious increase in traffic through Maltby roads, it is surprising the application states in Chapter 10 Section 10.49 that “no further assessment of noise from HGVs has been undertaken”. In the same chapter, it says: “Pumping may be undertaken throughout the night-time period. No night-time noise level measurements have been undertaken as any proposed night-time operations will be attenuated to comply with the 42dBLAeq 1hr night-time noise limit”. However, this one hour of noise could take place at any time of night. How will Rotherham Council ensure that the applicants are committed to working within social hours?\n2. Impact on local health\nThere are local concerns whether the application properly accounts for the impact on local residents’ health. The additional HGV movements for instance will lead to increased air pollution – with associated prospect of respiratory and cardiovascular diseases – in an already polluted place; Maltby East’s War profile for instance describes: “In the 2016-20 time period, the mortality ratio for deaths from respiratory disease in Maltby East ward is 201.1. This is worse than England”. Connected to this are concerns around road safety. Chapter 12 of the planning application implies these HGV will be passing many houses, multiple schools and a leisure centre. There are concerns the Council has not prepared enough road safety precautions for this heavily populated area, were the application to go ahead.\n3. Workability of rail line plan\nThird, there remain questions how this proposed development will use the established rail line to help with excess import and export. Chapter 12 Section 12.68 says: “It is anticipated that further fill import and mineral export would be by train using the existing rail head on the pit yard during Phases 3 to 11, comprising up to 16 trains per week”. However, the application does not include how this plan will go ahead or who they will contact to set up this plan. Given, the application also says in Chapter 10 Section 10:50 that “the Scheme retains the option to import fill material by rail” and that “the above vehicle movements are therefore based on a ‘worst-case’ scenario that all materials will be imported by road”, I would appreciate a copy of a detailed management plan for the rail system, to understand how the applicants will try and prevent high traffic elsewhere.\n4. Removal of unmapped ancient woodland\nFourth, there are concerns about the potential removal of ancient and semi-natural woodlands on the property, in particular at the centre of the property where one woodland has seemingly not been accounted for in any of the planning documents (neither the biodiversity plan documents, nor the Revised Reclamation and Proposed Quarry Phase documents). This woodland has been identified as ancient and/or semi-natural according to the Multi-Agency Geographic Information for the Countryside map. Section 193 of the National Planning Policy Framework states: “When determining planning applications, local planning authorities should apply the following principles…development resulting in the loss or deterioration of irreplaceable habitats (such as ancient woodlands and ancient or veteran trees) should be refused, unless there is wholly exceptional reasons, and a suitable compensation strategy exists”. Does Rotherham Council believe this application counts as “exceptional reasons” and will the Council be considering offering compensation if the woodlands is removed?\n5. Impact on wildlife\nFinally, the planning application states the site is of “geological conservation importance”, and briefly, that the development will produce a biodiversity net gain in excess of 10%. The Town and Country Plannings Act 1990 Schedule 7A Chapter 13 clearly states: “Where a development proposal is likely to affect features of biodiversity or geological conservation interest, you will need to submit, with the application, sufficient information and assessments to allow the local planning authority to determine the proposal. Failure to submit all information required will result in your application being deemed invalid. It will not be considered valid until all information required by the local planning authority has been submitted”. Has Rotherham Council asked for this information, given the application concedes the site is of “geological conservation importance”? If so, will they be able to send this to me?",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_56/content_191.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nSeptember 30, 2024\nHolding Royal Mail to Account\nSeptember 27, 2024\nMacmillan Annual Coffee Morning 2024\nSeptember 25, 2024\nGuide Dogs Campaign\nPrevious Page\n1\n…\n54\n55\n56\n57\n58\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_34/content_168.html": "Open Arms Community Support Hubs\nOpen Arms Community Support Hubs in Rotherham provide cost of living advice and support. This is a p…\nBig Power for Little London\nYesterday, I raised the brilliant campaign of Big Power For Little London in Parliament. One of the …\nWorld Mental Health Day 2024\nMental health is just as important as our physical health and it is so important to talk about our t…\nYorkshire Water Site Visit\nI was pleased to invite Yorkshire Water to visit properties impacted by a significant burst to the S…\nDinnington Regeneration Project Update – October 2024\nI have written to the council criticising their appalling communication with businesses on the high …",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_15_upcoming-advice-surgery-with-cllr-donna-sutton/content_233.html": "I will be joining Cllr Donna Sutton for her advice surgery tomorrow.\nCome on down to Edward Dunn Memorial Hall, 5-6pm, Thursday 16th January with any queries or concerns you may have!\nI will be joining Cllr Donna Sutton for her advice surgery tomorrow.\nCome on down to Edward Dunn Memorial Hall, 5-6pm, Thursday 16th January with any queries or concerns you may have!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_30/content_205.html": "Royal Mail Delivery Office Visit\nIt was great to visit the Dinnington Delivery Office on Friday, and speak to the managers and some o…\nWales Primary Eco-School Visit\nIt was wonderful to meet Y6 yesterday to speak to them about their Eco-School success. The class hav…\nA Conversation on Assisted Dying\nA Private Members’ Bill will be going through Parliament later this year. The Bill will legisl…\nOur Places Fund Consultation\nFollowing the success of the Towns & Villages scheme, Rotherham Council has committed to investi…\nBus Franchising Consultation Now Open\nBUS FRANCHISING CONSULTATION NOW OPEN South Yorkshire Mayoral Combined Authority (SYMCA) will be lau…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_04_harthill-and-kiveton-active-travel-update/content_301.html": "I am really pleased to learn that funding has been secured for a feasibility study for the Harthill and Kiveton Active Travel plans.\nThis is a great first step towards securing safe and sustainable travel routes between Harthill, Kiveton, Wales and Woodall.\nThank you to Harthill Active Travel for all the work you have done so far. I will continue to keep residents up to date on the progress of this project.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_21_visit-to-todwicks-luncheon-club/content_166.html": "It was an absolute pleasure to drop into Todwick’s Luncheon Club yesterday. Whilst going door to door in Todwick, one of my team met a lady called Mrs Hayden. She told them that she was worried about the reducing numbers of attendees at the various different activities in the village. After hearing this, I thought I’d pop along to see for myself!\nYvonne Felix is the wonderful lady behind the Luncheon Club and I couldn’t believe how many were there, and it turns out neither could some of the regulars! They served up delicious meat and potato pie and piping hot chocolate sponge and custard, followed by tea or coffee and a minty chocolate. It was a brilliant atmosphere, with people from in and out of the village in attendance.\nAs well as the Luncheon Club, The Grey Matters group is held on a Friday in Todwick Church Hall from 2-4pm, with a chance to play games and chat with other residents. Do pop along if you can – it is aimed at the over 55s! More info here: https://www.todwickchurch.co.uk/grey-matter\nGroups like the Luncheon Club and Grey Matters are so important to residents’ well-being and for staying involved in the local community.\nYou can find out more about activities on at Todwick’s Church Hall here: https://www.todwickchurch.co.uk/calendar\nIf you have a group that you would like me to visit, do drop me an email to jake.richards.mp@parliament.uk with the details!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_20_aston-cum-aughton-public-meeting/content_171.html": "Thank you to everyone who came to my public meeting at Aston-Cum-Aughton Parish Hall last week. I was grateful to everyone who asked a question of me, whether that be a local or national issue.\nThere were several matters raised, which I have picked up with the relevant authorities on behalf of constituents. It was great to have robust debate and discussion and I look forward to meeting residents again in the future.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_04_visit-to-coffee-hut-at-oh-my-sweet-baby/content_18.html": "Great to have Beth from Wales High School who is shadowing me today. We popped into the new Coffee Hut at Oh My Sweet Baby on Manor Road in Maltby – it’s just opened and is the perfect place to enjoy the sun!\nGreat to have Beth from Wales High School who is shadowing me today. We popped into the new Coffee Hut at Oh My Sweet Baby on Manor Road in Maltby – it’s just opened and is the perfect place to enjoy the sun!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_41/content_338.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 20, 2024\nChristmas Light switch-on in Wickersley\nNovember 19, 2024\nA Conversation on Assisted Dying\nNovember 18, 2024\nThurcroft Junior Academy – School Council\nPrevious Page\n1\n…\n39\n40\n41\n42\n43\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_44/content_327.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 10, 2024\nRemembrance Sunday\nNovember 9, 2024\nRemembrance Service in Brampton en le Morthen\nNovember 7, 2024\nDoncaster Sheffield Airport Update\nPrevious Page\n1\n…\n42\n43\n44\n45\n46\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_06_dinnington-banking-hub-update/content_284.html": "The signage is now up on the new Dinnington Banking Hub and the doors will be opening soon to the public.\nThank you to everyone, including local councillors and my predecessor, who helped to make this happen. This will be a great community asset and I know many in Dinnington and the wider area are looking forward to it.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_letters_page_2/content_165.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nLetters\nJuly 12, 2024\nBig Power for Little London\nPrevious Page\n1\n2\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_06_constituency-garden-of-remembrance/content_57.html": "Remembrance is a time to reflect and remember those who gave their lives for our freedoms and to express gratitude to those who continue to serve.\nIt was a huge privilege to place a cross on behalf of Rother Valley in the Constituency Garden of Remembrance.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_03_rotherham-uniteds-efl-awards/content_19.html": "Rotherham United win a trophy!\nBrilliant to celebrate Rotherham United’s victory – League One Community Club of the Year, at the EFL awards last night.\nThe Millers do such brilliant work across the community – in particular encouraging girls and women’s football. I’ve organised some follow up meetings to see how we can work together to help with my men’s mental health campaign too.\nIt hasn’t been the best year on the pitch, but off it Rotherham United always do brilliantly!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_about/content_6.html": "Rother Valley is my home. I live here with my fiancée and our baby daughter.\nI was elected to represent you in Parliament at the 2024 General Election on 4 July.\nBefore being elected I was a Child Protection Barrister, representing some of the most vulnerable people in society.\nI came into politics to improve opportunities for people living here in Rother Valley. This will be my main focus every day.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_20/content_317.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 20, 2025\nBattling on with Big Power for Little London\nJanuary 19, 2025\nMeeting with Harthill Active Travel\nJanuary 17, 2025\nTalking to BBC Newsnight about New Powers and New Resources to tackle Child Sexual Abuse\nPrevious Page\n1\n…\n18\n19\n20\n21\n22\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_22_royal-mail-survey/content_203.html": "Thank you to everyone who has got in touch about problems with Royal Mail. I’ve been in touch with their head office who firstly send their apologies, and secondly have explained that there are staff shortages at the Dinnington sorting office currently. I know how hard the posties and staff work, and will be meeting them this Friday to discuss how we can improve the service for residents.\nBefore that meeting, it would be very helpful to collate all information about the service across the constituency. So please do fill in this survey below before Friday!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_31/content_182.html": "Royal Mail Survey\nThank you to everyone who has got in touch about problems with Royal Mail. I’ve been in touch with t…\nDinnington Banking Hub Information Event\nCash Access UK will be holding an information event about the new Banking Hub. It will be located at…\nBig Power for Little London Meeting\nOn Friday, I again met with Big Power For Little London to discuss their campaign to improve the dis…\nLeger Lakes Tearoom\nBrilliant to pop into Leger lakes Tearoom for a spot of lunch last week and to catch up with Mick. T…\nAston Academy Visit\nI was pleased to visit Aston Academy and James Graham, the new principal. We had a fantastic discuss…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_03_whiston-public-meeting/content_281.html": "Thank you to everyone who came to my public meeting in Whiston, I really did appreciate residents taking time out of their weekend to attend. I called the meeting in response to the update on the Lathe Road/Worrygoose Lane housing development, with Avant Homes pulling out from the site. This is good news, but we must not become complacent, as another housing developer could show interest in the future. Unfortunately, Rotherham Council have still not published the flood risk assessment that was used to grant planning permission in the first place. Whiston Residents Action Group – WRAG and myself have been fighting tirelessly for this to be published and will continue to do so. Planning permission for the ‘Sheep Cote Road’ development still stands.\nFlooding in Whiston remains an issue and I know that a Flood Alleviation Scheme will be a very welcome addition to the village to reduce flood risk and to protect properties. The scheme will aim to reduce the risk of overflowing riverbanks and will assist drainage during periods of heavy rainfall, which will prevent the flooding of Whiston Brook. Submission of the application has been scheduled for December 2024 and a decision on the planning application is expected during early 2025. You can find out more about the scheme here: https://www.rotherham.gov.uk/…/whiston-brook-flood…/5.\nOther matters for discussion included national issues and there was great debate in the room. Thank you to everyone who shared their views.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_12/content_211.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nFebruary 27, 2025\nDinnington Colliery Sign\nFebruary 24, 2025\nWoodsetts Public Meeting\nFebruary 22, 2025\nLetwell Surgery\nPrevious Page\n1\n…\n10\n11\n12\n13\n14\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_5/content_46.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nMarch 28, 2025\nVisit to JobsPlus in Maltby\nMarch 27, 2025\nVeterans Voice Event at Dinnington\nMarch 26, 2025\nYorkshire Water £47 Rip Off: Petition for Parliament – Rother Valley\nPrevious Page\n1\n…\n3\n4\n5\n6\n7\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_15/content_215.html": "Meeting with the manager of the Queens Hotel in Maltby\nIt was a pleasure to meet with Beth, the manager of the Queens Hotel in Maltby, and WetherspoonsR…\nDavid Tomlinson’s ‘Strike It Lucky’ raises thousands for Hopian\nCongratulations to David Tomlinson who has raised £4428.50 for Hopian (formerly Rotherham Rise) thro…\nDiscussing the Jay Inquiry on Politics Live\nBefore being elected, I often represented victims of child sexual abuse and rape in court in my role…\nYoga and Mindfullness\nI met with Lucy and Kirsty, two yoga and mindfulness teachers who run local classes in North Anston …\nDisruption across Rother Valley\nMost schools and nurseries have closed across the constituency (do check emails/texts from schools),…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_39/content_33.html": "Rotherham Show 2024\nI had a wonderful time at Rotherham Show yesterday. Well done to the organisers and to everyone who …\nGreat North Run 2024\nBlimey – that was wet and difficult! But I got round the Great North Run – and raised so…\nScenes of Violence and Thuggery\nYesterday, I spoke in the House of Commons about the scenes we saw in Wath last month. Violence and …\nSouth Anston High St/Sheffield Rd Proposal\nThank you to everyone who came to the South Anston street surgery – turned impromptu public me…\nWhiston Power Station Update\nI met with National Grid regarding the ‘Brinsworth’ project, also known as the Whiston p…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_60/content_133.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nAugust 28, 2024\nWhiston Power Station Update\nAugust 22, 2024\nDinnington High Street Project Update – July 2024\nAugust 21, 2024\nMaltby to Rotherham Bus Service\nPrevious Page\n1\n…\n58\n59\n60\n61\n62\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_30_whitestone-solar-farm-development-first-consultation/content_216.html": "As the Member of Parliament for the Rother Valley constituency, I have received a lot of comment and concern from my constituents about this proposal. I have held numerous meetings across the constituency and published an online survey. This is an ongoing process and I am determined to represent the views of my constituents to the developer and, as and when the application is made, to the decision-maker.\nBelow, I have attached my response to the first consultation. You can read the text in full at www.jakerichards.co.uk/whitestone.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_in-parliament_page_5/content_66.html": "Latest News in Parliament\nParliament\nStudent from Wales High School – Work Experience at Westminster\nSimon is a student at Wales High School and it was fantastic to have him do work experience with me …\nParliament\nBig Power for Little London\nYesterday, I raised the brilliant campaign of Big Power For Little London in Parliament. One of the …\nParliament\nMaiden Speech\nLast month, I made my maiden speech in Parliament. It was one of the greatest honours of my life and…\nParliament\nRaising Speeding issue in Parliament\nI raised the issue of speeding and boy racers across the constituency in Parliament last week. This …\nParliament\nAndy’s Man Club Came to Parliament\nI was thrilled to host Andy’s Man Club on World Suicide Prevention Day in Parliament. The group from…\nParliament\nScenes of Violence and Thuggery\nYesterday, I spoke in the House of Commons about the scenes we saw in Wath last month. Violence and …\nRSS Feed in Parliament\nYou can see Jake Richards’s latest appearances and speeches in Parliament (thanks to theyworkforyou):\nLoading RSS feed…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_58/content_187.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nSeptember 18, 2024\nYorkshire Water Letting Down Kiveton\nSeptember 18, 2024\nSpeeding on the A57\nSeptember 15, 2024\nAnston Cricket Club Charity Day 2024\nPrevious Page\n1\n…\n56\n57\n58\n59\n60\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_14_wales-high-school-in-parliament/content_68.html": "It was great to be joined by sixth formers from Wales High School in Parliament this week. They asked a brilliant range of questions, watched a debate in the Commons and enjoyed a tour of the Houses of Parliament.\nHave a wonderful half term!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_16_constituents-in-parliament/content_90.html": "Great to have two of my constituents, Susan and Adam, come down and visit me in Parliament yesterday.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_19/content_292.html": "Whitestone Solar Farm Proposal: Online Public Meeting\nFollowing the local consultation events held by the developers behind Whitestone Solar Farm, I would…\nUlley Public Meeting\nI met with residents in Ulley yesterday to discuss issues affecting the village. We had a constructi…\nSanta Sleigh Run – Maltby and Rother Valley Lions\nHad a brilliant time joining the Maltby and Rother Valley Lions in Aston last night. An amazing team…\nDinnington Banking Hub Open\n31-33, Laughton Road, Dinnington, Sheffield, S25 2PN Head down to the Banking Hub for all of your ba…\nAnston Brook Primary School Visit\nIt was great to meet with Sally Armstrong, Headteacher, and Emma Wilkinson, Deputy Headteacher, at A…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_23_bus-franchising-consultation-now-open/content_257.html": "BUS FRANCHISING CONSULTATION NOW OPEN\nSouth Yorkshire Mayoral Combined Authority (SYMCA) will be launching a 12-week consultation on proposals to take back control of South Yorkshire’s buses by introducing a Bus Franchising Scheme. Bus Franchising will give us control over depots, bus fleet, routes, fares, timetables and quality standards.\nOne of my election pledges to my constituents was to ensure that Rother Valley was served by reliable and frequent buses to connect our towns and villages. This is a great first step to achieving this.\nTo find out more: https://www.southyorkshire-ca.gov.uk/bus-reform\nTo complete the consultation: https://interviewer.djsresearch.com/…/Dubinterv…/Page…\nPlease do have your say on the future of buses in South Yorkshire",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_23/content_246.html": "Public Meeting on Fireworks\nFireworks are a great spectacle that many of us enjoy. I have received hundreds of comments and emai…\nTerminally Ill Adults (End of Life) Bill – Second Reading\nToday, the House of Commons voted in favour of the Terminally Ill Adults (End of Life) Bill, as it p…\nJustice Delivered for Rother Valley Miners\nNearly 2000 former mineworkers in Rother Valley will TODAY begin to receive an uplift in their weekl…\nJake Richards MP – Assisting Dying Bill Second Reading\nTomorrow, Parliament will debate a Bill that will seek to change the law in regards to assisted dyin…\nHarthill Public Meeting\nI was pleased to hold a public meeting in Harthill last week. Thank you to all the residents who bra…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_33/content_140.html": "Jake Richards MP Question to Prime Minister\nOur social care system for children is in crisis. Today I asked the Prime Minister about his governm…\nMaltby Redwood Primary School Visit\nI was delighted to visit Maltby Redwood Academy last week. It was great to take a tour of the wonder…\nVisit to Roche Abbey\nOn Friday I was thrilled to be given a tour of the beautiful Roche Abbey by Nial Motion and met with…\nStudent from Wales High School – Work Experience at Westminster\nSimon is a student at Wales High School and it was fantastic to have him do work experience with me …\nSpeeding on the A57 Update October 2024\nOn Friday 4th October, I met with Laura Koscikiewicz, District Commander for Rotherham and raised th…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_activity/content_5.html": "What has Jake been up to in Rother Valley?\nYou can see where Jake has done public events and street surgeries so far since being elected below:\nMap Key\nSurgery\nEvent / Visit\nYou can see where Jake has done public events and street surgeries so far since being elected below:",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_16_whitestone-solar-farm-proposal-online-public-meeting/content_316.html": "Following the local consultation events held by the developers behind Whitestone Solar Farm, I would like to hear from you. As previously stated, the application is not for me to allow or refuse, but I want to shape it and put pressure on the company to ensure it is done right, if it has to be done.\nThe sheer scale of what is currently being proposed and the location of some of the sites is both worrying and concerning. Therefore, it is really important for me to be able to represent your views and considerations if a planning application is made in a years time.\nNext year, I will be meeting with as many residents as possible across Rother Valley about this, so do keep an eye out for when I am in your village.\nTo begin my own consultation with residents, I will be holding an online public meeting on this matter on Monday 6th January at 18:30. You can sign up here:",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_26_male-suicide-support-for-andys-man-club-maltby-better-today-the-learning-community-ltd-and-others/content_56.html": "MALE SUICIDE – support for Andys Man Club Maltby, Better Today, The Learning Community Ltd and others.\nIn the last month, two men in my constituency have taken their own lives. This is a tragedy, and my thoughts are with their families and friends.\nYesterday, I asked the Leader of the House of Commons for a debate on mental health services for men, and how we best support and work with these brilliant organisations in our communities.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_02_whiston-sitwell-and-wickersley-speeding-meeting/content_83.html": "PUBLIC MEETING: SPEEDING and TRAFFIC CONCERNS IN SITWELL, WHISTON and WICKERSLEY\nSince being elected last month, I’ve been inundated with really concerning reports of an increase in speeding and traffic issues. These reports vary from boy racers, to rat runs, to people simply ignoring the speed limit and the need for traffic calming measures.\nI’m determined to play my role in improving the situation.\nEarlier this week, I wrote to the Chief Constable of SY police raising concerns and inviting Officers to attend a public meeting on 6th August. They have confirmed receipt, but have not yet committed to officers attending. I hope they will.\nNonetheless, I’m keen for a public meeting to show the strength of feeling on this issue and to also begin to scope the problems more formally for the police, and other authorities, to consider.\nPlease do join, and share this post so others can see (as won’t have time to post letters to the whole community).\nWhere: Whiston Village Hall\nWhen: 5.30 pm to 6.30 pm. 6th August 2024",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_10_little-london-in-parliament/content_64.html": "I meet with the campaign group Big Power For Little London regularly. They are an amazing group of residents taking collective action against a rogue landlord who has damaged their community. Anyone who has seen the Little London estate knows action is needed – as a community and from local and national government.\nI promised that I would bring them to Parliament to speak directly with the Housing Minister, and I was pleased to arrange this. It was a productive meeting with concrete next steps. I’ll be getting to work on this now.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_6/content_156.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nNovember 28, 2024\nJake Richards MP – Assisting Dying Bill Second Reading\nNovember 26, 2024\nCommunity Policing\nNovember 15, 2024\nAll Party Parliamentary Group (APPG) for Children Who Need Palliative Care\nPrevious Page\n1\n…\n4\n5\n6\n7\n8\n…\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_4/content_112.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nJanuary 27, 2025\nHolocaust Memorial Day\nJanuary 17, 2025\nBig Power for Little London in Parliament\nDecember 10, 2024\nLittle London in Parliament\nPrevious Page\n1\n2\n3\n4\n5\n6\n…\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_32/content_193.html": "Jake Richards MP introduces Private Members’ Bill\nI have introduced my Private Members Bill to Parliament today to help keep children in care close to…\nMaltby Sports Ground: Investigation\nI’m absolutely shocked and concerned about what is happening at Maltby Sports Ground. Last week, a n…\nStreet Surgeries in Brookhouse and Letwell\nTwo brilliant street surgeries in Brookhouse and Letwell this evening. Thank you to everyone who cam…\nConstituents Visit Parliament\nGreat to have two of my constituents, Susan and Adam, come down and visit me in Parliament yesterday…\nRestart A Heart Day 2024\nToday is Restart a Heart Day, which aims to increase cardiac arrest survival rates across the UK. Th…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_21_vibe-dance-rotherhams-got-talent/content_159.html": "Huge congratulations to Vibe Dance who came 3rd at Rotherham’s Got Talent last month. They are a talented group of dancers and they should be so proud of themselves. Their routine was fabulous.\nHuge congratulations to Vibe Dance who came 3rd at Rotherham’s Got Talent last month. They are a talented group of dancers and they should be so proud of themselves. Their routine was fabulous.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_04_november-newsletter/content_38.html": "You can take a read at what I’ve been up to in Rother Valley and Parliament here: https://mailchi.mp/151790b50b6c/n42y56fbq9\nSubscribe to my monthly newsletter: https://mailchi.mp/…/sign-up-for-jake-richards-newsletter\nYou can take a read at what I’ve been up to in Rother Valley and Parliament here: https://mailchi.mp/151790b50b6c/n42y56fbq9\nSubscribe to my monthly newsletter: https://mailchi.mp/…/sign-up-for-jake-richards-newsletter",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_21/content_251.html": "The Squirrel Now Open at Dinnington\nTHE SQUIRREL IS NOW OPEN! 🐿️🍺 Storm Darragh didn’t stop me from getting the f…\nSmall Business Saturday\n🛍️TODAY IS SMALL BUSINESS SATURDAY🛍️ A campaign that shines a spotligh…\nDinnington Banking Hub Update\nThe signage is now up on the new Dinnington Banking Hub and the doors will be opening soon to the pu…\nAmbitious About Autism\nIt was a privilege to attend the drop-in session held by Ambitious About Autism in Parliament last w…\nNovember 2024 Newsletter\nYou can take a read at what I’ve been up to in Rother Valley and Parliament here: https://mail…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_16_introduction-to-parliament-week-at-willows-school/content_239.html": "Yesterday, I visited the Willows School in Thurcroft to speak with their pupils about UK Parliament Week, which is coming up. I was blown away by the questions, ranging from wanting more football on the curriculum to discussing pilot salaries to discussing the NHS!\nThank you for having me – I had a wonderful time.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_13/content_180.html": "Battling on with Big Power for Little London\nContinuing the fight for Little London, I met with Big Power For Little London and Sharon Kemp, Chie…\nMeeting with Harthill Active Travel\nI was pleased to meet with Harthill Active Travel, along with Olympic cyclist Ed Clancy, Nicola Mars…\nTalking to BBC Newsnight about New Powers and New Resources to tackle Child Sexual Abuse\nI want to see the monsters who commit child sexual abuse and rape brought to justice. That’s why I w…\nBig Power for Little London in Parliament\nBig Power For Little London came to Parliament last month and met with the Housing Minister, and beg…\nOut and About in Orgreave\nBeautiful weather this afternoon for one of my regular street surgeries. Thank you to everyone who c…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_20_maltby-and-dinnington-business-meetings/content_77.html": "Our high streets are the beating heart of our communities. For too long they have been underfunded, with good local businesses deserting our high streets. I met with Maltby businesses in August and Dinnington businesses in September to discuss the future of our high streets and how best I can help support their rejuvenation moving forward.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk/content_1.html": "Wickersley Street Surgery\nThank you to all the residents who came to my street surgery in Wickersley, with many residents raising their concerns about the proposed Exagen Solar Farm. Many of you will have seen the plans to bui…\nRead MoreThis website is here to provide you with detailed information about my work as your MP and the Rother Valley constituency I am proud to represent. If you are a Rother Valley constituent and need to get in touch, you can do so by clicking here.\nAs the elected Member of Parliament for Rother Valley, it’s an honour to represent our communities. I am here to serve every resident and ensure your concerns and ideas are heard. My goal is to champion the needs of our towns and villages, working to improve the services and opportunities that matter most to you.\nI hold appointment surgeries and frequently have street surgeries across the constituency. For more information, please visit my surgeries page by clicking here.\nThank you for your trust and engagement as we work towards a brighter future for Rother Valley.\nSign up to my newsletter\nThank you to all the residents who came to my street surgery in Wickersley, with many residents raising their concerns about the proposed Exagen Solar Farm. Many of you will have seen the plans to bui…\nRead MoreReally enjoyed speaking to residents in Thorpe Salvin in the beautiful sunshine. Need help with anything? Please email [email protected].\nRead MoreFree family Easter event on Monday 21st April from 2-5pm at The Slip in Maltby. Do pop along! Thank you to Maltby & Hellaby Labour Party councillor Donna Sutton for her amazing donation of over 10…\nRead MoreI am very aware of the long-standing and incredibly frustrating issues at this junction. The traffic, especially at rush hour, is horrendous but perhaps more importantly is the number of accidents tha…\nRead MoreBrilliant to be out in the beautiful sunshine in Laughton en le Morthen this morning. Thank you to all the residents that I spoke to at the three street surgeries I held across the village. Your local…\nRead MoreThis week, I presented Rother Valley’s petition, signed by over 1000 residents, to the House of Commons urging the government to take action to stop Yorkshire Water retrospectively charging residents …\nRead More",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_16_out-and-about-in-orgreave/content_184.html": "Beautiful weather this afternoon for one of my regular street surgeries.\nThank you to everyone who came to speak with me in Orgreave.\nIf you require assistance, please get in touch by emailing:\njake.richards.mp@parliament.uk.\nBeautiful weather this afternoon for one of my regular street surgeries.\nThank you to everyone who came to speak with me in Orgreave.\nIf you require assistance, please get in touch by emailing:\njake.richards.mp@parliament.uk.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_40/content_333.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 22, 2024\nUK Parliament Week\nNovember 22, 2024\nWales High School Visit\nNovember 20, 2024\nTodwick Public Meeting\nPrevious Page\n1\n…\n38\n39\n40\n41\n42\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_22_stop-the-maltby-pit-tip-plan/content_294.html": "I spoke in Parliament about the destructive plans at Maltby Pit Tip.\nI am against this plan – and will campaign ferociously to stop it. I attended the last Maltby Town Council meeting to try and get a grip on the issue and ensure that Maltby’s voice is heard.\nFirstly, the last thing Maltby needs is more lorry traffic through the village. This is already a scourge which I am trying to help the council to stop. More lorry traffic will be horrendous.\nSecondly, I am not convinced of the environmental safety of the proposed project. And until I am, I would never support any such plan. I had a meeting with the Environment Agency about the Maltby Pit Tip in August, just a few weeks after my election, and they were wholly unaware of the plan – which left me staggered, frankly.\nI will be formally making a submission to the planning board (something which I do not do for every case because I am of the view that this is for local councillors predominantly). But this is too important.\nI am trying to speak with the developer (which is proving challenging) to see whether they will meet with me to discuss their plan and set out the concerns of local residents.\nI have emailed the four councillors in Maltby to request an urgent meeting. I am yet to get a response from two of the Conservative councillors – I urge them, and others, to put politics aside and work together on this.\nEqually I urge members of the public to sign the petition and, more importantly, make your views known by following this link:\nAt the Maltby Town Council meeting I made it clear that I thought that the whole Town Council should work together to put in a submission opposing the application. The next meeting is on 16th January – and I hope to be updated on progress then.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_22_chris-jepson-doing-the-great-tommy-sleepout/content_105.html": "Great to pop over to Wickersley to see Wickersley veteran Chris Jepson doing the Great Tommy Sleepout. He is raising money for Royal British Legion Industries, who support injured veterans.\nI’ve donated – please do give anything that you can! He’s a good man raising funds for a critical cause!\nLink below\nChris Jepson is fundraising for Royal British Legion Industries",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_43/content_326.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 13, 2024\nWhite Woods Primary Academy Trust\nNovember 12, 2024\nDinnington Public Meeting – Regeneration Project\nNovember 11, 2024\nRemembrance 2024\nPrevious Page\n1\n…\n41\n42\n43\n44\n45\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_10_yorkshire-water-site-visit/content_190.html": "I was pleased to invite Yorkshire Water to visit properties impacted by a significant burst to the Station Road pipe at the beginning of September in Kiveton Park. The burst left properties flooded after water flowed for five hours, with significant repair work needed to return the properties back to how they were before the flood. This is the second time this has happened, with the first incident around a year before – it is imperative that water companies are held accountable.\nDiscussions with Yorkshire Water centred around why the pipe was allowed to burst again and when replacement works will take place to upgrade the Station Road pipe. Yorkshire Water also met with the residents inside their properties to answer further questions and see the damage for themselves.\nYorkshire Water have confirmed that they aim to complete the upgrades to the pipe within the next financial year, which will include the replacement of 24km of pipeline along Station Road. Please find the map below in the comments, with the infrastructure along the green dotted line up for replacement. Details will be announced as soon as I have any extra information.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_54/content_197.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 7, 2024\nHarthill Reservoir\nOctober 5, 2024\nRotherham Hospice\nOctober 4, 2024\nSupporting Sense\nPrevious Page\n1\n…\n52\n53\n54\n55\n56\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_03_battery-energy-storage-system-at-hard-lane-kiveton-park-jake-richards-mp-response/content_8.html": "I have formally submitted a response to the planning application for a Battery Energy Storage System at Hard Lane, Kiveton Park.\nYou can read my submission below, which outlines my concerns and rejects the proposal on the basis that the BESS forms part of a wider infrastructure plan in the local area which is yet to receive proper scrutiny.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_9/content_109.html": "Visit to Todwick Early Years\nIt was brilliant to meet the team at Todwick Early Years, who provide care for children aged 2, 3 an…\nVisit to Shiloh Rotherham\nShiloh Rotherham – Homeless Support are an amazing charity providing support to anyone who is …\nVisit to Anston Brook Primary School\nI had a wonderful time speaking to pupils at Anston Brook on Friday. We discussed what they liked ab…\nHooton Levitt Street Surgery\nReally enjoyed speaking to residents in Hooton Levitt yesterday at one of my street surgeries. Need …\nWales High School in Parliament\nIt was great to be joined by sixth formers from Wales High School in Parliament this week. They aske…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_in-parliament/content_14.html": "Latest News in Parliament\nParliament\nRotherham United’s EFL Awards\nRotherham United win a trophy! Brilliant to celebrate Rotherham United’s victory – League One …\nParliament\nCrags Community School at the Houses of Parliament\nIt has been brilliant to welcome Crags Community School to the Houses of Parliament this week. The p…\nParliament\nConstituents at Downing Street\nGreat to bring David Tomlinson, Sascha Biggin and Andy Tupholm to Downing Street yesterday. Tomo wro…\nParliament\nMeeting with Wes Streeting, Secretary of State for Health and Social Care\nYesterday, I met with Wes Streeting, Secretary of State for Health and Social Care. I am absolutely …\nParliament\nJake Richards MP Speech about BCSSS\nYesterday, I spoke in the House of Commons to ask the government what they are doing to reassure and…\nParliament\nNational Tremor Foundation\nGreat to meet Kitty from Maltby in Parliament! As Chair of the National Tremor Foundation, Kitty and…\nRSS Feed in Parliament\nYou can see Jake Richards’s latest appearances and speeches in Parliament (thanks to theyworkforyou):\nLoading RSS feed…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_09_dinnington-regeneration-project-update-october-2024/content_195.html": "I have written to the council criticising their appalling communication with businesses on the high street and the lack of support and advice.\nIt is good news that the project is developing. But we need to ensure our brilliant local businesses are given all that they need to prosper whilst the work takes place. This is not happening currently and am hoping the council will listen and change course.\nPlease read my letter below. 👇",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_29_terminally-ill-adults-end-of-life-bill-second-reading/content_96.html": "Today, the House of Commons voted in favour of the Terminally Ill Adults (End of Life) Bill, as it passed Second Reading.\nThis is just the start of the Bill’s procedural journey and I want to carry on the conversation around assisted dying.\nWatch below.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_37/content_337.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 29, 2024\nJustice Delivered for Rother Valley Miners\nNovember 28, 2024\nJake Richards MP – Assisting Dying Bill Second Reading\nNovember 27, 2024\nHarthill Public Meeting\nPrevious Page\n1\n…\n35\n36\n37\n38\n39\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_59/content_153.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nSeptember 8, 2024\nRotherham Show 2024\nSeptember 8, 2024\nGreat North Run 2024\nAugust 30, 2024\nSouth Anston High St/Sheffield Rd Proposal\nPrevious Page\n1\n…\n57\n58\n59\n60\n61\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_06_disruption-across-rother-valley/content_231.html": "Most schools and nurseries have closed across the constituency (do check emails/texts from schools), as well as heavy disruption to local transport including the closure of Rotherham Central Railway Station until at least 11:45 this morning. Services are delayed or cancelled through Kiveton Park and Kiveton Bridge Railway Stations.\nAll First and Stagecoach bus routes are suspended across Rotherham and Sheffield. Please take care if you are travelling on the roads this morning, however the snow is still coming down so avoid any unnecessary travel.\nResidents impacted by flooding, particularly around Whiston Brook, please do ring Floodline on 0345 988 1188 or text 0345 602 6340. If you require assistance, please email me on [email protected]\nUPDATE 08:28 – Water level is falling at Whiston Brook – https://check-for-flooding.service.gov.uk/targe…/123FWF720?\nWhat to do if you need help:\nCall 105 for help if you lose power\nAlways call 999 if there is any immediate danger\nPlease stay safe – you can receive regular updates by visiting www.metoffice.gov.uk\nKeep up to date with the latest weather updates from RMBC by visiting https://www.rotherham.gov.uk/weather-updates\nCheck before you travel – https://www.travelsouthyorkshire.com",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_3/content_11.html": "Rotherham United’s EFL Awards\nRotherham United win a trophy! Brilliant to celebrate Rotherham United’s victory – League One …\nCoffee Morning Whiston Methodist Church\nWhat a lovely coffee morning!!! Thank you for inviting me to the Whiston Methodist church – it…\nVisit to JobsPlus in Maltby\nIt was great to visit the JobsPlus team in Maltby to see how the programme is progressing and suppor…\nVeterans Voice Event at Dinnington\nLast week, I hosted a veterans voice event in Dinnington alongside John Healey, Defence Secretary, a…\nYorkshire Water £47 Rip Off: Petition for Parliament – Rother Valley\nHundreds of residents have been in touch about a letter they received from Yorkshire Water outlining…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_18_speeding-on-the-a57/content_71.html": "I met with concerned residents living just off the A57. I have seen footage of the racing that occurs most weeks and am shocked that no meaningful action by any authority has been taken in two years.\nI have written to the Chief Constable of South Yorkshire police demanding this changes. The footage of the racing is incredibly concerning and we cannot have this lawlessness blighting Rother Valley. I will be working closely with my colleague, Jo White, MP for Bassetlaw, who experiences the same issues with the A57 in her constituency.\nI have also raised the issue of speeding and boy racers in the House of Commons.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_14_visit-to-roche-abbey/content_142.html": "On Friday I was thrilled to be given a tour of the beautiful Roche Abbey by Nial Motion and met with Sue Dalton, who both manage the site and are from English Heritage. It was fascinating to learn about the history of the Abbey and the importance of the site to the local community and further afield – they had visitors from the USA last year! You can visit Roche Abbey Wednesday to Sunday from 10am to 5pm.\nWe discussed the future of Roche Abbey and how best to preserve historic sites for future generations. English Heritage are currently running the ‘Million and More Appeal’ to fundraise to protect and preserve their sites for future generations to come.\nYou can donate here: Million and More Appeal | English Heritage (english-heritage.org.uk)",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_16_jake-richards-mp-question-to-prime-minister/content_62.html": "Our social care system for children is in crisis. Today I asked the Prime Minister about his government’s plans to tackle this national scandal, whereby private operators are making fortunes on the backs of vulnerable children and desperate local auhtorities.\nHere is my piece for Labour List about my Private Members Bill which offers modest reform in this area. Helpfully the government minister has already been in touch to organise a meeting about this issue.\nhttps://labourlist.org/2024/10/government-news-children-care-private-members-bill/",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_39/content_335.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 24, 2024\nStrike It Lucky Book Launch at Maltby Manor\nNovember 23, 2024\nPoppies Tea Room\nNovember 23, 2024\nStreet Surgery in North Anston\nPrevious Page\n1\n…\n37\n38\n39\n40\n41\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_08_gp-surgery-capacity-increasing-in-rother-valley/content_169.html": "I am thrilled to hear that capacity at two GP practices in Rother Valley will be increasing. Thanks to £256,074 from the Community Infrastructure Levy (CIL) from new housing developments, Stag Medical Practice and Dinnington New Street Surgery will see existing spaces in their surgeries turned into clinical rooms and services.\nThis is brilliant news for the communities served by these surgeries",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_17/content_259.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nFebruary 5, 2025\nVisit Royal Mail\nFebruary 4, 2025\nSend Provision Online Meeting\nJanuary 31, 2025\nVisit to Mixamate\nPrevious Page\n1\n…\n15\n16\n17\n18\n19\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_07_public-meeting-in-whiston-august-2024/content_151.html": "Thank you to everyone who came to the public meeting in Whiston yesterday to tell me about their experiences of the out-of-control dangerous driving in our area. In light of the residents’ numerous concerns, I’ve written to the Chief Constable, the police, and the Police and Crime Commissioner to demand action from South Yorkshire Police.\nI will keep going – and not take ‘no’ for an answer.\nI will also be sending them, separately, other specific concerns that have been raised and be seeking for methods by which these cars can be reported quickly – as many yesterday complained about the lengthy process that currently exists.\nI thank the Ward councillors for attending – and answering many questions. They work hard for our area, and I know they are raising these issues too.\nIf you or any other residents have concerns about local road safety then please do email me",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_16/content_253.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nFebruary 11, 2025\nSafer Internet Day\nFebruary 10, 2025\nA57 Public Meeting in Todwick & Update\nFebruary 8, 2025\nGP Surgery Capacity Increasing in Rother Valley\nPrevious Page\n1\n…\n14\n15\n16\n17\n18\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_campaigns/content_79.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nCampaigns\nSeptember 18, 2024\nSpeeding on the A57\nAugust 30, 2024\nSouth Anston High St/Sheffield Rd Proposal\nAugust 2, 2024\nPublic Meeting: Speeding & Traffic Concerns in Sitwell, Whiston and Wickersley\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_07_harthill-reservoir/content_172.html": "I was very excited to see the progress towards the completion of the upgrades to Harthill Reservoir during a site visit with the Canal and River Trust and the local councillor, Marnie Harvard. Works are moving ever closer to completion, with construction to be completed in the next few weeks.\nDuring the visit, I raised the concerns of residents, who have been disrupted by noise, traffic and dust during the construction period. They reassured me that residents should begin to see the winding down of construction works. We also discussed the impact of the delayed work on residents.\nThe finished upgrades will be a very welcome and improved asset to Harthill, with the new path around the reservoir improving accessibility for people using wheelchairs or mobility scooters or parents with buggies. The relaunch of the reservoir will be an exciting time for sailing, fishing and swimming, and I will do all I can to support the success of these activities once the works are complete.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_8/content_150.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nMarch 20, 2025\nMeeting with Wes Streeting, Secretary of State for Health and Social Care\nMarch 19, 2025\nVisit to Todwick Primary School\nMarch 19, 2025\nJake Richards MP Speech about BCSSS\nPrevious Page\n1\n…\n6\n7\n8\n9\n10\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_17_talking-to-bbc-newsnight-about-new-powers-and-new-resources-to-tackle-child-sexual-abuse/content_222.html": "I want to see the monsters who commit child sexual abuse and rape brought to justice.\nThat’s why I was pleased about new powers and resources for the police to investigate current and historic cases of child abuse and anyone who covered up child abuse. Please report any information you have about individuals involved to the police urgently.\nI came into politics to confront this failing system. I’m pleased positive steps are being taken. But there is more work to do.\nMe on BBC Newsnight yesterday",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_20_christmas-light-switch-on-in-wickersley/content_209.html": "Brilliant time at the Christmas light switch-on in Wickersley with John Healey.\nWell done to Maddie and Evelyn for turning on the lights – you both did a great job.\nShout out to Dinnington Colliery Band for putting on an excellent performance.\nThank you to Wickersley Parish Council for organising a wonderful evening.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_5/content_53.html": "Crags Community School at the Houses of Parliament\nIt has been brilliant to welcome Crags Community School to the Houses of Parliament this week. The p…\nConstituents at Downing Street\nGreat to bring David Tomlinson, Sascha Biggin and Andy Tupholm to Downing Street yesterday. Tomo wro…\nMeeting with Wes Streeting, Secretary of State for Health and Social Care\nYesterday, I met with Wes Streeting, Secretary of State for Health and Social Care. I am absolutely …\nVisit to Todwick Primary School\nGreat to visit Todwick Primary School and meet with Mrs Deeley, headteacher, and Mrs Perry, deputy h…\nJake Richards MP Speech about BCSSS\nYesterday, I spoke in the House of Commons to ask the government what they are doing to reassure and…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_12/content_183.html": "Visit to Bluebell Wood Children’s Hospice\nLast week, I visited Bluebell Wood Children’s Hospice and had the pleasure of meeting with Hei…\nHolocaust Memorial Day\nIt is 80 years since the liberation of Auschwitz-Birkenau, the largest Nazi concentration camp. Thes…\nHarthill Workbench\nI had a brilliant time seeing the Harthill Workbench in action. It is an amazing space for members a…\nThe Handmade Pie Company in Dinnington\nPopped into The Handmade Pie Company in Dinnington on Friday. Tasty pies and great people! Do head o…\nSubmission to RMBC on proposed reclamation of Maltby Colliery tip\nIntroduction This submission lays out my outstanding objections to the planning application by Maltb…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_12_dinnington-public-meeting-regeneration-project/content_225.html": "On Friday, I held a public meeting at The Lyric Dinnington, alongside Chris Read, Leader of Rotherham Council, and Simon Moss, Assistant Director of Planning, Regeneration and Transport at Rotherham Council.\nThe council gave an informative presentation about the plans for the regeneration scheme and gave updates on the current timeline of the project.\nOne thing is clear – everyone wants this project to happen. It is a real opportunity to rejuvenate the high street and to bring a much needed facelift to the heart of Dinnington. Unfortunately, the project cannot begin construction until the council has acquired all of the relevant properties on the high street. Last month, the council passed the use of Compulsory Purchase Order powers to enable the acquisition of the remaining properties. I will continue to keep residents updated with the progress of the project.\nThe meeting was very well attended, which is testament to how many residents in the surrounding area care about the success of the project and I would like to reiterate that the council and myself, as your local MP, will do all we can to deliver this project for Dinnington.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_26_student-from-wales-high-school-work-experience-at-westminster/content_237.html": "Fantastic to have Jake (great name!) join me for Work Experience down in Parliament. Jake is a Harthill resident and studying at Wales High School! Bright lad – and a great help down in Westminster.\nFantastic to have Jake (great name!) join me for Work Experience down in Parliament. Jake is a Harthill resident and studying at Wales High School! Bright lad – and a great help down in Westminster.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_04_new-school-based-nursery-in-rother-valley/content_58.html": "I am delighted that Todwick Primary School is one of the first 300 schools to be part of a new government scheme to deliver thousands of new and expanded school-based nurseries.\nIt’s the start of a revolution in early years education. More places, higher quality, lower costs for parents. That’s at the heart of this government’s mission to ensure that every child has the best start in life, breaking the unfair link between a child’s background and their future success.\nI look forward to seeing the school-based nursery up and running in September.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_17_christmas-royal-mail-local-service/content_296.html": "I have had numerous reports of households not receiving their post for several weeks now. Whilst it is a busy time for the postal service, and the post office staff are working their socks off, this is not an excuse. I believe there are problems structurally. I have written to them this morning to seek clarity as to the current situation and to ensure improvements are made.\nWhen I visited the local sorting office a few weeks back, they said that they had hired more staff to improve the service so I am surprised that things appear to have got worse. I will be onto them and see what is going on.\nI know in some other areas the post is working well! Do support your postie, and thank them, when you see them. They work long hours, especially at this time of year!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_08_11_scarecrow-trail-in-firbeck-2024/content_120.html": "What a brilliant day at the Scarecrow Trail in Firbeck! Firbeck Village Community Forum\nThank you to everyone who made it happen and for having me and my daughter. Firbeck is a very special community – and yesterday was evidence of that.\nSuch a shame the famous, or infamous, tug-of-war didn’t happen due to it being too wet under foot!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_29_justice-delivered-for-rother-valley-miners/content_265.html": "Nearly 2000 former mineworkers in Rother Valley will TODAY begin to receive an uplift in their weekly pension, overturning an historic injustice and ensuring fair payouts for years to come.\n£1.5billion was transferred to their pension scheme last month, ensuring former pit workers who powered the country for decades finally get the just rewards from their work.\nThe uplift represents an average 32% rise to the annual pensions of 112,000 former mineworkers and their dependents across the UK – an average increase of £29 per week for each member.\nFrom Maltby to Thurcroft to Dinnington to Kiveton Park, justice has been delivered.\nThe government has also confirmed that it will look into the British Coal Staff Superannuation Scheme (BCSSS). I will keep constituents updated on any developments and keep pushing the government to take action on this",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_18/content_288.html": "Increased Hospice Funding Announced\nToday, the government announced the biggest investment in hospices in a generation, including £26 mi…\nPreformed Windings Opening\nI had the huge privilege of opening Preformed Windings new unit in Wales on Friday 6th December. Due…\nLitter Picking Stars at Anston Park Junior School\nLeonora and her friends from Anston Park Junior School arranged a litter pick around Kendal Park and…\nChristmas Royal Mail Local Service\nI have had numerous reports of households not receiving their post for several weeks now. Whilst it …\nFirbeck Christmas Fair\nFirbeck really does know how to put on a Christmas Fair! There was a fabulous range of stalls sellin…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_09_maltby-pit-top/content_295.html": "I have asked RMBC to extend the consultation period for the application regarding the Maltby pit top. It’s absurd that this importation application is taking place over the festive period. This joins calls from both local councillors on Friday.\nI am deeply concerned about this application – in particular in regard to traffic and environmental issues. It’s right Maltby’s voice is heard and this requires time.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_11/content_192.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nMarch 4, 2025\nBrampton en le Morthen Whitestone Meeting\nMarch 2, 2025\nMeeting with Leader of Rotherham Council, Cllr Chris Read\nMarch 1, 2025\nSwallownest Street Surgery\nPrevious Page\n1\n…\n9\n10\n11\n12\n13\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_26_the-handmade-pie-company-in-dinnington/content_218.html": "Popped into The Handmade Pie Company in Dinnington on Friday. Tasty pies and great people! Do head on down and try one out for yourself.\nPopped into The Handmade Pie Company in Dinnington on Friday. Tasty pies and great people! Do head on down and try one out for yourself.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_21/content_324.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nJanuary 17, 2025\nBig Power for Little London in Parliament\nJanuary 16, 2025\nOut and About in Orgreave\nJanuary 15, 2025\nUpcoming Advice Surgery with Cllr Donna Sutton\nPrevious Page\n1\n…\n19\n20\n21\n22\n23\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_10_a57-public-meeting-in-todwick-update/content_199.html": "Thank you to everyone who came to the public meeting I organised with South Yorkshire Police in Todwick, in relation to speeding and the A57.\nThe police are fully aware of concerns regarding speeding in the area and have made it a priority. They emphasised the importance of continued reporting from residents for them to make the case internally, with the council and with the Highways Agency for the need for further speed calming measures. Regular reporting helps build a clearer picture of ongoing issues and enables the authorities to take appropriate action.\nWe also discussed the possibility of additional road signage to help address speeding concerns and I have reached out to the two local councillors to discuss this further.\nA57 CAR MEET\nFurther to the meeting held with South Yorkshire Police in Todwick at the end of last month, I wanted to provide another update in response to the irresponsible and reckless car meet held between Junction 31 of the M1 and Red Lion Roundabout on Saturday night.\nI have been contacted by many concerned residents and have passed all information I have been sent onto the police, including photos and videos that I have received via email and Facebook messenger. Today, I wrote to Rotherham South NPT inspector Darren Birley and have been informed of the police’s robust actions in response to Saturday, which is summarised below.\n• Operational Support Unit officers were deployed and dealt with the activity. The road was closed at each end of the A57 and allowed Officers to deal with some of those in attendance immediately and gather evidence for later prosecution, of others\n• Several vehicles were seized on the evening and several drivers reported on summons for driving without due care\n• Dozens of vehicles were identified and documented. Owners/drivers will be written to and dealt with accordingly\n• Drivers’ insurance companies will be made aware of their customers involvement\nI am pleased to see the police taking this matter very seriously and I will keep residents informed of any further information.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_09_remembrance-service-in-brampton-en-le-morthen/content_247.html": "It was an honour to lay a wreath at this morning’s remembrance service in Brampton en le Morthen as our MP. It was a lovely event – so thank you to all those who organised it.\nI will be at many events to remember fallen heroes across the weekend. It’s such an important moment for our nation each year. Thank you to everyone who is working so hard to make these events happen.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_50/content_242.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 18, 2024\nMaltby Sports Ground: Investigation\nOctober 17, 2024\nStreet Surgeries in Brookhouse and Letwell\nOctober 16, 2024\nRestart A Heart Day 2024\nPrevious Page\n1\n…\n48\n49\n50\n51\n52\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_25_guide-dogs-campaign/content_80.html": "Great to meet Jamie this week.\nI’m supporting the Guide Dogs campaign to ensure access for blind people to all amenities and services. I was shocked by reports that constituents are sometimes turned away when they require a guide dog. I’ll be raising this issue in Parliament.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_32/content_340.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nDecember 10, 2024\nLittle London in Parliament\nDecember 9, 2024\nMaltby Pit Top\nDecember 9, 2024\nChristmas Card Competition Winner\nPrevious Page\n1\n…\n30\n31\n32\n33\n34\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_09_11_andys-man-club-came-to-parliament/content_73.html": "I was thrilled to host Andy’s Man Club on World Suicide Prevention Day in Parliament. The group from Maltby, joined myself and the MP for Whitehaven and Workington, Josh MacAlister, along with other Andy’s Man Club groups from around the country. Over 20 MPs joined the event to listen to the importance of talking groups as a tool for helping deal with mental health problems. MPs left the event looking to see what they can do to facilitate talking groups in their constituencies.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_04_05_3-street-surgeries-in-laughton-en-le-morthen/content_12.html": "Brilliant to be out in the beautiful sunshine in Laughton en le Morthen this morning.\nThank you to all the residents that I spoke to at the three street surgeries I held across the village.\nYour local Labour team were also out speaking to residents too, so I thank everyone who took the time out to have important conversations with them too.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_09_homemade-pie-company-dinnington/content_124.html": "Award for local business!\nThe Handmade Pie Company is a brilliant local business in Dinnington! And I’m so pleased they’ve been recognised by the National Pie Awards.\nThey deserve all the praise they are getting – including on GB News\nAward for local business!\nThe Handmade Pie Company is a brilliant local business in Dinnington! And I’m so pleased they’ve been recognised by the National Pie Awards.\nThey deserve all the praise they are getting – including on GB News",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_27_christmas-fair-at-st-cuthberts-church/content_298.html": "I had a wonderful time at the Christmas fair at St Cuthbert’s Church in aid of Rotherham Cancer Care, who provide specialist care and support to people living with or affected by cancer.\nThe hall was brimming with local businesses selling handmade products, from jams to toys to personalised gifts. I am looking forward to gifting the Christmas presents I purchased from Homemade It!\nIt was great to speak with Julia, who is the community champion at Maltby Tesco and works really hard in the local community supporting different charities.\nThank you for a great Christmas fair!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_parliament_page_2/content_54.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nParliament\nMarch 20, 2025\nMeeting with Wes Streeting, Secretary of State for Health and Social Care\nMarch 19, 2025\nJake Richards MP Speech about BCSSS\nMarch 10, 2025\nNational Tremor Foundation\nPrevious Page\n1\n2\n3\n4\n…\n11\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_24_our-places-fund-consultation/content_261.html": "Following the success of the Towns & Villages scheme, Rotherham Council has committed to investing in further capital improvements in local areas across the borough and has allocated £2m under the ‘Our Places’ Fund to focus on enhancing and upgrading public spaces.\nTo understand which areas could benefit from the Our Places Fund, a consultation is being undertaken across the borough from Monday 21 October to Sunday 17 November.\nYou can access the consultation and suggest areas that could benefit from the Our Places funding here: https://www.rotherham.gov.uk/consultation-feedback/places-fund",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_20/content_260.html": "Dinnington Christmas Festival\nI had a wonderful time at the Dinnington Christmas Festival on Saturday. The Lyric Dinnington looked…\nLittle London in Parliament\nI meet with the campaign group Big Power For Little London regularly. They are an amazing group of r…\nMaltby Pit Top\nI have asked RMBC to extend the consultation period for the application regarding the Maltby pit top…\nChristmas Card Competition Winner\nI had the absolute pleasure of surprising Harvey Goodrich, a pupil in Year 1 at Anston Park Infant S…\nWoodsetts Christmas Fair\nThank you to everyone who braved the weather to come to Woodsetts Christmas fair. Lovely to see ever…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_25_a-conversation-on-assisted-dying/content_268.html": "A Private Members’ Bill will be going through Parliament later this year. The Bill will legislate to ‘allow adults who are terminally ill, subject to safeguards and protections, to request and be provided with assistance to end their own life; and for connected purposes’.\nIt is really important to hear a wide range of views on this, so I will be holding an online forum for you to voice your opinions, ask questions, and engage in a meaningful conversation on this important topic.\nPlease join me on Thursday 31st October at 19:30pm. You can sign up using the following link: https://www.eventbrite.co.uk/e/public-meeting-with-jake-richards-mp-on-assisted-dying-tickets-1046904358117?aff=oddtdtcreator",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_01_maiden-speech/content_92.html": "Last month, I made my maiden speech in Parliament. It was one of the greatest honours of my life and concluded a long and hard fought campaign to become the Member of Parliament for Rother Valley.\nIt is the privilege of my life to serve our constituency.\nWatch my maiden speech below.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_11/content_158.html": "Send Provision Online Meeting\nSpecial education needs and disability (SEND) provision is one of the biggest issues impacting paren…\nVisit to Mixamate\nLast week, I visited Mixamate‘s site in Dinnington to see the manufacturing of volumetric conc…\nWhitestone Solar Farm Development – First Consultation\nAs the Member of Parliament for the Rother Valley constituency, I have received a lot of comment and…\nNuclear Week in Parliament\nThis week is Nuclear Week in Parliament. Did you know that the civil nuclear industry employs nearly…\nDinnington Regeneration Project: The Truth\nDespite what some post on Facebook, the Dinnington Regeneration project is progressing. Yes, this pr…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_18_aston-academy-visit/content_238.html": "I was pleased to visit Aston Academy and James Graham, the new principal. We had a fantastic discussion about the positive changes being made to the Academy, as well as the wider challenges within education. It feels like a fresh start for the school and I am pleased to be able to support Mr Graham in his new role.\nThank you for having me – I look forward to visiting again!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_in-parliament_page_4/content_52.html": "Latest News in Parliament\nParliament\nConstituency Garden of Remembrance\nRemembrance is a time to reflect and remember those who gave their lives for our freedoms and to exp…\nParliament\nWales Primary School Eco-School success in the House of Commons\nI was so impressed with the Y6 class at Wales Primary School, that I shared their Eco-School success…\nParliament\nEnding the Injustice of the Mineworkers Pension Scheme\nIt is a national scandal that former miners across Rother Valley, from Maltby to Dinnington to Thurc…\nParliament\nJake Richards MP introduces Private Members’ Bill\nI have introduced my Private Members Bill to Parliament today to help keep children in care close to…\nParliament\nConstituents Visit Parliament\nGreat to have two of my constituents, Susan and Adam, come down and visit me in Parliament yesterday…\nParliament\nJake Richards MP Question to Prime Minister\nOur social care system for children is in crisis. Today I asked the Prime Minister about his governm…\nRSS Feed in Parliament\nYou can see Jake Richards’s latest appearances and speeches in Parliament (thanks to theyworkforyou):\nLoading RSS feed…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_13/content_229.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nFebruary 21, 2025\nVibe Dance – Rotherham’s Got Talent\nFebruary 21, 2025\nVisit to Todwick’s Luncheon Club\nFebruary 20, 2025\nAston-Cum-Aughton Public Meeting\nPrevious Page\n1\n…\n11\n12\n13\n14\n15\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_news_page_16/content_279.html": "Amber weather warning in place for South Yorkshire tonight through to 05/01 23:59\nThis could lead to: – Travel delays on roads, stranding some vehicles and passengers – D…\nHarthill and Kiveton Active Travel Update\nI am really pleased to learn that funding has been secured for a feasibility study for the Harthill …\nPolice Meeting with Residents in Todwick regarding A57\nFollowing my request, I am really pleased to see that the police have organised a public meeting wit…\nReminder: Whitestone Solar Farm Public Meeting\nFollowing the local consultation events held by the developers behind Whitestone Solar Farm, I would…\nMeeting with SharkEye Wheel Aligners\nI was thrilled to meet with the SharkEye Wheel Aligners UK Ltd team in Hellaby to discuss the benefi…",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_11_04_wales-primary-school-eco-school-success-in-the-house-of-commons/content_131.html": "I was so impressed with the Y6 class at Wales Primary School, that I shared their Eco-School success in the House of Commons.\nWe should celebrate all of our young people who are passionate about looking after their local community and the environment.\nWell done again Y6!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_12_20_stuart-saunders-traditional-butchers-shoplocalthischristmas/content_293.html": "Popped into Stuart Saunders Traditional Butchers to grab a joint of gammon for Christmas. They provide Maltby and beyond with brilliant service and top quality meat all year round.\nThey are open until 12pm on Christmas Eve for any last minute bits!\nPopped into Stuart Saunders Traditional Butchers to grab a joint of gammon for Christmas. They provide Maltby and beyond with brilliant service and top quality meat all year round.\nThey are open until 12pm on Christmas Eve for any last minute bits!",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_03_11_constituency-assistant/content_162.html": "An opportunity has arisen to join my dedicated constituency team. This position is based at our Dinnington Constituency Office and offers the chance to make a real difference to local people and the community.\nLocation: Dinnington Constituency Office\nPosition: Full Time Constituency Assistant\nFull details: https://www.w4mpjobs.org/JobDetails.aspx?jobid=95903\nApplications close on Friday 28th March.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_08_yoga-and-mindfullness/content_273.html": "I met with Lucy and Kirsty, two yoga and mindfulness teachers who run local classes in North Anston and the surrounding area. They also deliver sessions and bereavement support retreats at Bluebell Wood Children’s Hospice.\nIt was really insightful to speak with Lucy and Kirsty about the role yoga can play in helping individuals with trauma and bereavement in our community.\nWant to try something new? You can join their yoga classes for £7, which are held at North Anston Parish Hall every Monday and Wednesday from 18:30 to 19:45. Fitness yoga is held on a Thursday from 18:00 to 18:50.\nLucy and Kirsty are also holding a yoga disco night on Saturday 25th January at Kiveton Park and Wales Village Hall, starting at 17:30!\nFor more information, you can contact Lucy on 07859292946 or email [email protected] or [email protected]",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_07_12_big-power-for-little-london/content_30.html": "I promised Big Power For Little London that if elected one of the first things I would do is write to the new Housing Minister to organise a meeting so they could make their case for change.\nI have done that today.\nLittle London, and the conditions of the housing there, is a disgrace. It’s not been good enough. For too long, they have been overlooked – by politicians of all political colours. That stops now.\nI will be shouting from the rooftops to ensure their story is heard and hold those in power to account.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_01_04_amber-weather-warning-in-place-for-south-yorkshire-tonight-through-to-05-01-2359/content_286.html": "This could lead to:\n– Travel delays on roads, stranding some vehicles and passengers\n– Delays and cancellations to rail and air travel is expected\n– Some rural communities cut off\n– Power cuts and other services, such as mobile phone coverage, affected\nWhat to do if you need help:\nCall 105 for help if you lose power\nIf a river floods, you can call Floodline on 0345 602 6340\nAlways call 999 if there is any immediate danger\nRMBC’s severe weather emergency response (SWEP) has been triggered. An emergency shelter will be provided to anyone rough sleeping across the Borough. If you are concerned about an individual who may be sleeping rough, please contact the out of hours number on 07748143170.\nPlease stay safe – you can receive regular updates by visiting www.metoffice.gov.uk\nKeep up to date with the latest weather updates from RMBC by visiting https://www.rotherham.gov.uk/weather-updates",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2024_10_04_supporting-sense/content_143.html": "There are 1961 people living with complex disabilities in Rother Valley and it is imperative that we continue to work towards improving the lives of people with disabilities. We must ensure that they are at the heart of our plans moving forward.\nSense are a charity who champion everyone who is deafblind or lives with complex disabilities. People with complex disabilities tend to have two or more disabilities and experience unique barriers in daily life.\nI will support the work that Sense do and work with Sense to ensure that the quality of life of people living with complex disabilities is at the forefront of everything we do.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_2025_02_27_dinnington-colliery-sign/content_118.html": "It is absolutely wonderful to see the Dinnington Colliery sign back up, thanks to the work of the Dinnington Colliery Old Boys and Cllr Amanda Clarke used her councillor budget to help bring this very special sign back to Dinnington.\nIt is safe to say the Dinnington Colliery Old Boys were thrilled to see the sign returned! Brilliant from everyone involved ahead of the 40th anniversary of the march back to work.",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_42/content_330.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nNovember 16, 2024\nMaltby Christmas Light Switch on\nNovember 16, 2024\nIntroduction to Parliament Week at Willows School\nNovember 15, 2024\nIntroduction to Parliament Week at Thurcroft Junior Academy\nPrevious Page\n1\n…\n40\n41\n42\n43\n44\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch",
  "https_jakerichards_co_uk_/https_jakerichards_co_uk_category_rother-valley_page_55/content_201.html": "Jake Richards MP for Rother Valley\nHome\nAbout\nNews\nIn Parliament\nWhitestone Solar Farm\nNewsletter\nActivity\nSurgeries\nCampaigns\nContact\nUseful Contacts\nFacebook\nTwitter\nCategory:\nRother Valley\nOctober 4, 2024\nChristmas Card Competition 2024\nOctober 2, 2024\nRoad Safety on B6059 & Ryton Road\nSeptember 30, 2024\nDinnington Banking Hub Update – September 2024\nPrevious Page\n1\n…\n53\n54\n55\n56\n57\n…\n63\nNext Page\nSearch for an article\nSearch\nSearch"
}