{
  "https_www_kanishkanarayan_com_/https_www_kanishkanarayan_com/content_1.html": "Kanishka Narayan\nMember of Parliament for the Vale of Glamorgan\nWorking tirelessly to champion a fairer, more prosperous future, I am proud to serve as the Labour MP for the Vale of Glamorgan.\nA brighter tomorrow for the Vale of Glamorgan\nWith a strong track record at the heart of government, in international business and in community volunteering, I am dedicated to ensuring that the voices of Vale residents are heard in Westminster.\nProud to be a Labour MP in the Vale\nThe Labour Party has been a vehicle of exceptional progress for our country. For my family, it has meant the dignity of a good minimum wage. It has meant the opportunity of contributing to thriving public services (my parents in law, my brother in the NHS, me in our civil service). And above all, growing up under the last Labour government, it has meant a country that prospered, giving us purpose. I am proud to be part of a Labour government that is again putting our country and our future at the heart of our politics.\nPutting our community above everything\nMy mission for the Vale is focused on two things: dignity and prosperity for everyone in the Vale of Glamorgan. That is why I work tirelessly to address the issues that matter most – good jobs in the Vale, opportunity for our kids, cutting our bills, cleaning our water, and making our community safe.\nDelivering for the Vale of Glamorgan: My key priorities\nWhen I ran for election, I knocked nearly 50,000 doors and spoke to over 20,000 of my neighbours. Based on those conversations, I am focused on three priorities: delivering a 1,000 job opportunities, backing our community organisations, and tackling rising antisocial behaviour in our community.\nAll hands on tech\nI will create 1,000 job opportunities for Vale residents by 2030. It is an ambitious goal, but if we achieve it, it will revive the heritage of innovation we have in the Vale of Glamorgan. I am doing everything to make it happen. Join me?\nCommunity first\nWithin my first 6 months as the Vale’s MP, I have secured £40m from the UK Government for Barry and the Vale of Glamorgan. I am listening to you and will keep putting your voice at the heart of our plans.\nTough on crime tough on the causes\nI stood on a campaign to invest more in community policing, in support for young kids before they go on the wrong track, and in community amenities that make our Vale cleaner and safer. I will deliver on it, working with leaders in our community (like world boxing champion, Lee Selby, pictured here).",
  "https_www_kanishkanarayan_com_/https_www_kanishkanarayan_com_privacy-policy/content_2.html": "Privacy Policy\nThis Privacy Policy explains how we collect, use, and protect your personal information when you visit www.kanishkanarayan.com.\nWho We Are\nThis website is operated by the office of Kanishka Narayan MP, Member of Parliament for the Vale of Glamorgan. We are committed to protecting your privacy and ensuring that your personal data is handled in accordance with the UK General Data Protection Regulation (UK GDPR).\nWhat Information We Collect\nWe may collect and process the following information when you use this website:\n- Information you provide: This includes details submitted through contact forms, such as your name, email address, phone number, postcode, and any message you send.\n- Website usage data: We use Google Analytics to collect anonymous information about how visitors use the website, such as pages visited, time spent on the site, and the device or browser used.\nHow We Use Your Information\nWe use your information to:\n- Respond to enquiries submitted through the website.\n- Understand how people use our website, so we can improve it.\n- Monitor and analyse website performance.\nWe do not use your data for marketing purposes and will never sell your information to third parties.\nLawful Basis for Processing\nWe process your personal data based on your consent (e.g. when you submit a contact form) or where it is necessary for us to carry out our duties as a Member of Parliament.\nCookies\nThis website uses cookies to enhance your browsing experience and to help us understand how the site is used. You can manage your cookie preferences through your browser settings.\nData Sharing and Storage\nAny personal data you provide is stored securely and accessed only by authorised personnel. We do not share your information with third parties, unless required by law or with your explicit consent.\nYour Rights\nUnder the UK GDPR, you have the right to:\n- Access the personal data we hold about you.\n- Request correction or deletion of your data.\n- Withdraw your consent at any time.\n- Lodge a complaint with the Information Commissioner’s Office (ICO).\nContact Us\nIf you have any questions about this policy or wish to exercise your data rights, please contact us via the details on the Get in Touch page.",
  "https_www_kanishkanarayan_com_/https_www_kanishkanarayan_com_get-in-touch/content_3.html": "Contact Kanishka\nSurgery?\nA surgery appointment with an MP (Member of Parliament) is a chance for constituents to meet with their MP to discuss concerns, issues, or problems they might have. It’s not a medical surgery, despite the name!\nIt's a personal meeting where your Vale of Glamorgan MP, Kanishka Narayan, can listen to your concerns and try to help. It’s a chance for you to have a direct line of communication with the person elected to represent your area in Parliament.\nAppointment\nDuring the meeting, you can raise your concerns or questions whether that is national policies or personal issues. Kanishka Narayan will provide advice, offer support, or take action on your behalf, if it’s something we can help with, such as writing a letter, raising an issue in Parliament, or connecting you with relevant services. Please provide some information in the box below as to the nature of your concern, which will help us best prepare for your appointment.\nLocation\nKanishka Narayan MP holds surgeries across the Vale. These appointments are typically held in accessible, community facilities or sometimes virtually. Please indicate on the form below whether you would prefer an in-person appointment or an online appointment. Also, please also indicate your preferred location and we will look to offer you an appointment in that area.\nRequest an appointment\nPlease complete the below form, which will enable us to process your request and offer you the next, relevant surgery appointments. We look forward to hearing from you.",
  "https_www_kanishkanarayan_com_/https_www_kanishkanarayan_com_about/content_4.html": "About Me\nSouth Wales has given me and my family so much of what we cherish: a warm welcome for my parents and their two young boys; the dignity of decent work in our public services; the promise of future opportunity in education and work.\nI am determined to give back and am privileged to have the chance to do so as the Welsh Labour MP for the Vale of Glamorgan.\nMy mission: to spread opportunity to every child in the Vale of Glamorgan, and across Wales\nBorn in Bihar, India, I moved to Cardiff with my family at the age of 12. We were in a modest one-bedroom flat in Bedford Street. Each morning, my brother and I walked to Cathays High School to get a good Welsh education. My mum and dad still live and work within walking distance of where we grew up.\nFor me, as for so many others, teachers changed the course of my life. One of them carried an irrational belief in my ability and urged me to apply for scholarships to private schools. I still remember the day I asked our Headteacher, Mr Phillips, to sign a scholarship form for Eton College as he broke up a school-bus fight. He seemed totally surprised. My youthful naivety ignored it.\nI have had the deepest privileges of education since – generous bursary support that allowed me to attend Eton; undergraduate education in Philosophy, Politics and Economics at Balliol College, Oxford; an MBA at Stanford University in the USA. Throughout it, I have never forgotten a simple reality: there was no difference in talent between my friends at Cathays in Cardiff, and my friends at each of the institutions I experienced since. There was only difference in opportunity.\nThat simple reality is why I founded Attain Wales at university, a mentoring programme to support Welsh state school kids get access to top universities. It’s why I cofounded a student thinktank to tackle homelessness. And now, it’s why I pursue politics with a simple mission: to spread opportunity to every child in the Vale of Glamorgan, and across Wales.\nWork and community: international experience, grounded in Wales\nI am determined to bring everything I have learnt - from the heart of government, from business across the UK and Silicon Valley, and from community work – to the service of the Vale of Glamorgan.\nIn government, I advised Cabinet ministers and the Prime Minister at both the Business department and the Cabinet Office as Economist and Senior Adviser. I then served as Expert Adviser to Britain’s Environment Secretary, helping write the UK’s 25-year environment plan to protect the nature and landscape that defines our country.\nIn business, I worked at Lazard, advising FTSE boards, government finance ministries, and tech start-up entrepreneurs across Europe and the US. After completing my MBA, I entered global technology, spending time in Silicon Valley and the UK. I supported leading entrepreneurs in AI, fintech, and climate change initiatives. Later, I used this experience to serve as Head of Tech Policy for Labour’s Shadow Digital Secretary. I remain convinced that changing technology offers the greatest opportunity for the Vale, and for Britain, to reclaim its proud heritage of innovation.\nAt the heart of my work, I have valued deep community engagement. I used my experience in finance to produce national research on supporting households in severe debt, and volunteered with Citizens Advice and the Trussell Trust.\nAs Labour’s MP candidate and now MP, my campaign was built on relentless door-to-door engagement and an unwavering commitment to local issues: my volunteer team and I knocked 30,000 doors, delivered medicines as volunteers, picked litter, delivered post with the Royal Mail, raised money for RNLI, and supported our veterans.\nIn the 2024 general election, I proudly won the Vale of Glamorgan seat, returning it to Labour after 14 years of Conservative representation. Shortly after, I was appointed as Parliamentary Private Secretary at the Department for Environment, Food and Rural Affairs, where I work to shape policy in areas including environmental sustainability, rural affairs, and food systems.\nI continue to live in the Vale of Glamorgan, close to my family and the community that has shaped my journey. My path—from the warmest community in Cardiff to the halls of Parliament—motivates me each day to bring opportunity and a passion for public service to every kid in the Vale of Glamorgan and across the UK."
}