{
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_post_shining-a-light-on-lower-council-tax/content_27.html": "Shining a light on lower council tax\n- jamestaylor2915\n- Jan 31, 2022\n- 2 min read\nCroydon Council recently completed the upgrade of 23,630 street lights across the borough, designed to save the taxpayer £14 million over 25 years. However despite these savings, the lights are connected to the national grid, which represents a significant cost to the tax paying Croydonian and harms our environment.\nWhat if there was an eco-friendly way to light Croydon’s streets for £0? The Taking the Initiative Party (TTIP) proposes a policy to reduce the burden that this vital infrastructure has on the Council’s budget. The Party’s proposal saves £25 million over a five year period, and residents can reciprocally benefit from lower council tax and improved budgets for other areas.\nFor an initial unit cost, wind and solar panel-powered units will light Croydon’s streets with the same effectiveness as the current installations. The unit’s renewable energy source means that they are not reliant on the national grid for power.\nThis new renewable system of lighting will also reduce Croydon’s carbon footprint. Currently, regular street lighting contributes 1.9 billion tonnes of Carbon Dioxide emissions to the nation’s footprint. This proposal offers a reasonable solution to reducing Croydon’s own carbon footprint, as opposed to The Lower traffic Neighbourhood scheme, in operation in the South Norwood and Woodside areas, which has coalesced traffic into main roads, creating congestion. Croydon must lead the way in demonstrating that other (less controversial) ways of safely lighting streets are possible, notwithstanding mitigating the current climate crisis.\nAs a borough, we are facing a 1.99% increase in council tax to pay for the previous administration’s bankruptcy. Instead of passing the cost of fixing this crisis onto the taxpayer, the TTIP’s proposal seeks to use innovation to not only be more efficient with taxpayers money, but reduce Croydon’s carbon footprint. Funds can also be freed to be spent in other areas of the borough currently left in the ‘darkness’.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_news/content_23.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE\nThe Latest Updates",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_initiative-network/content_7.html": "top of page\nInitiative Network\nWe want to bring together talented people to be part of our new political community.\nThe Initiative Network will be a directory of professionals and businesses that share our vision and principles. Register your details with us now so that we can add you to what will be a go-to handbook of some of the best people across business and industry.\nbottom of page",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_womens-group-sign-up/content_10.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE\nThanks for submitting!",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_our-vision-for-croydon/content_5.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_membership/content_4.html": "START TAKING THE INITIATIVE\nBecome A Member Today\nPremium membership\nAs a premium member, you will be entitled to attend three of our educational and networking events throughout the year completely free of charge and all other events that you wish to attend will be 50% discounted for our premium members. (Subject to availability)\nStandard membership\nAs a standard member, you will receive a 40% discount on all of our events throughout the year. (Subject to availability)\nConcession membership\nSame as standard membership. This membership is available for: Students, OAP's, NHS staff, people receiving supported living/income support (Universal credit)/ Disability living allowance and Trade unions,\nBy becoming a member, Taking the Initiative, locally and nationally, may use the information submitted, including your political views, to further our objectives, share it with our elected representatives, and contact you in future using any of the means provided. Some contacts may be automated. You may opt-out of some or all contacts or exercise your other legal rights by contacting us. Further details are in our Privacy Policy\nSelect Your Plan\nPremium Membership\n£8.34\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nAble to stand for election\nDiscounted entry to the annual gala event\nFree entry to educational and networking events\nFree legal advice (subject to terms and conditions)\nFree business mentoring for start up businesses\nFree financial advice (concerning insurance, loans and more)\nPremium Membership\n£100\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nAble to stand for election\nDiscounted entry to the annual gala event\nFree entry to educational and networking events\nFree legal advice (subject to terms and conditions)\nFree business mentoring for start up businesses\nFree financial advice (concerning insurance, loans and more)\nStandard Membership\n£5\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational\nand networking events\nFree financial advice (concerning insurance, loans and more)\nStandard Membership\n£60\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational\nand networking events\nFree financial advice (concerning insurance, loans and more)\nConcession Membership\n£3\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nFree financial advice (concerning insurance, loans and more)\nConcession Membership\n£36\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nFree financial advice (concerning insurance, loans and more)\nThe Taking the Initiative Party may use the information you submit to us when\nbecoming a member (including your political views) to further our objectives,\nshare with our elected representatives, and to contact you using any of the\ndetails provided. Some contacts may be automated. You can opt-out of some\nor all contacts, or exercise your other legal rights pertaining to personal data\ncollection, by contacting us. Further details are in our Privacy Policy.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_our-party/content_9.html": "OUR PARTY\nTaking the Initiative wants to give everyone a brighter future where everyone has a chance to make a difference and thrive. Where people who take the initiative to want a better Britain are rewarded, with good schools, hospitals, and a flourishing economy.\nOUR ETHOS\nThe basis in which the Taking the Initiative Party has been created is on the collective understanding of community and business and how the two support and complement each other.\nThe most important characteristic of community and business is integrity and the old school value of doing what we say we are going to do, something which appears to be lacking in the current political arena. It is our intention to restore some of these old school values and in turn, restoring faith and credibility with those we seek to represent as we feel people would prefer to be told the truth and in turn have faith in their politicians than being sold an undeliverable dream in order to win a vote and have no intension of delivering on the promises made.\nIt is our intention, to be honest, and be bold in our expression of change and we will ensure not to oversell and under deliver. We will ensure that anything and everything we propose will be supported by empirical facts with a clear plan for delivery. We will work voraciously and tirelessly as that is nothing short of what is expected.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_events_taking-the-initiative-partys-first-womens-group/content_35.html": "top of page\nTaking the Initiative Party's First Women's Group\nSat, Apr 29\n|Croydon\nRegistration is closed\nSee other eventsTime & Location\nApr 29, 2023, 2:00 PM – 4:00 PM GMT+1\nCroydon, Croydon, UK\nAbout the event\nTaking the Initiative Party's first women's group brunch 2023!\nRun by our very own ELC Secretary Betty Evans and joined by guest speaker Alison Johnson who is a pastor, international speaker and public speaking guru on how to be a powerful, confident and compelling speaker in 2023!\nTickets\nAttendee\n£0.00\nSale ended\nGoogle Maps were blocked due to your Analytics and functional cookie settings.\nbottom of page",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_terms-and-condititons/content_28.html": "Terms & Conditions\nTerms & Conditions\nDonations\nDonations to a political party are regulated by the Political Parties Elections and Referendums Act 2000.\n-\nDonors giving more than £500 must be on a UK electoral register (we will check before accepting a donation).\n-\nFor donors giving more than £1,500 to a *Party*, or more than £7,500 to a *national Party* (including the English Regions and Wales) in a calendar year, their name and the value of the donation will be sent to the Electoral Commission which will publish details on its website. The donor’s address will not be made public.\n-\nDonations must be from the donor’s own funds and may not be passed on from a third party. It is an offence not to reveal the true source of a donation.\n-\nDonations to political parties are not tax-deductible.\n-\nThis donation facility is provided for individuals to make donations to the Initiative party. UK companies, Limited Liability Partnerships, Trade Unions and Unincorporated Associations may also make donations to the initiative Party.\nMembers ✍🏻\n-\nBy applying to become a member of the Initiative Party you agree to accept and conform to the constitution, programme, principles and policy of the Party. If applicable, be a member of a trade union, hold your membership at the address where you reside and if eligible be registered as an elector at that address.\n-\nYou also confirm that you are not a member of any other registered political party, and you are not a member of any organisation incompatible with membership of the Initiative Party.\n-\nYour provisional membership rights commence from the date your membership is recorded on the national membership list.\n-\nYour provisional membership lasts eight weeks and during that time you can attend your Initiative Party meetings in a non-voting capacity and your membership can be rejected – you would be advised in writing and depending on the reason you could have a right of appeal.\n-\nFull membership rules and procedures are available in the Initiative Party rule book.\n-\nBy supplying personal data to register as a member you agree that the Initiative Party, elected representatives of the Initiative Party, and any candidates in internal Initiative Party elections in which you are entitled to participate may contact you using any of the data supplied.\n-\nBy entering your email address and/or phone number you agree to receive communications from us, from which you can opt-out using the unsubscribe link in each email we send. Text messages can be opted out at any time using the appropriate stop message.\n-\nWe will not share your details with anyone outside the Party.\n-\nMembership includes access to:\n-\n✔ Entrepreneurial guidance and support\n-\n✔ Property and mortgage advice\n-\n✔ Access to free legal consultations\n-\n✔ Subsidised legal advice\n-\n✔ Counselling, guidance and support\n-\n✔ Vouchers and special offers\n-\n✔ Access to events\n-\n✔ Reduced and free admissions to seminars\nCurrently, annual membership will cost £12.50 (Youth & Students), £25 (Unwaged/Unemployed), £50 (Waged) and Founding500/legacy members would be asked to subscribe with £100. We are happy to receive any larger donations that members can put into the party. We invite people to join us.\nRegistered supporters ✊🏻\n-\nRegistered supporters will be kept up to date with all happenings & events.\n-\nBy supplying personal data to register as a supporter you agree that the Initiative Party, elected representatives of the Initiative Party, and any candidates in internal Initiative Party elections in which you are entitled to participate may contact you using any of the data supplied.\n-\nBy entering your email address and/or phone number you agree to receive communications from us, from which you can opt-out using the unsubscribe link in each email we send. Text messages can be opted out at any time using the appropriate stop message.\n-\nWe will not share your details with anyone outside the Party.\nAffiliated supporters 🤝\n-\nBy supplying personal data to register as an affiliated supporter you agree that the Initiative Party, elected representatives of the Initiative Party, and any candidates in internal Initiative Party elections in which you are entitled to participate may contact you using any of the data supplied.\n-\nBy entering your email address and/or phone number you agree to receive communications from us, from which you can opt-out using the unsubscribe link in each email we send. Text messages can be opted out at any time using the appropriate stop message.\n-\nYou also agree that this data will be shared with the affiliated organisation in question for the following purposes:\n-\nTo verify your membership of that organisation;\n-\nTo update your membership details with that organisation; and\n-\nTo permit that organisation to contact you with information as described by the data protection and privacy statements of that organisation.\n-\nWe will not share your details with anyone outside the Party.\nApplications to become an Affiliated or Registered Supporter will be rejected if:\n-\nThe Initiative Party has reason to believe that you do not support the Initiative Party’s aims and values.\n-\nYou are not registered as an elector at the same address provided in your application. The Initiative Party may require you to provide evidence in support of this.\n-\nYou were excluded from previous membership of the Initiative Party or your membership ended while you were subject to suspension.\nIn the event of your application being rejected your application fee will not be refunded and you will have no right to appeal. If your application is rejected this does not preclude you from applying to become a full member of the party.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_product-page_ttip-pen/content_26.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_steering-group-leader/content_29.html": "Steering Group Leader\nSteering group leaders will have the opportunity to go forward for candidacy roles, local councillor roles and to become future members of parliament within their area or constituency.\nAs a steering group leader, you will act as a “satellite” base for Taking the Initiative Party. There is no requirement to have an office or a physical base, but you would need to have constituents who can support you and the party in completing various tasks in your area; the steering group will be required to attend events and meetings on behalf of the party where the objective would be to promote the party and recruit supporters. Some of the tasks the steering group will be doing may be door to door campaigning, leafletting, organising food larders etc. The key aim is to have a representation of the party nationally, led by you and those within your sphere of influence. The steering group will be responsible for representing the Initiative Party in their area and those within it; addressing issues/concerns and bringing them back to the attention of the party.\nPlease note that Steering Group candidates will be required to go through an application process, followed by an interview and review by the ELC before being successfully appointed.\nIf you are interested in becoming a Steering Group member for Taking the initiative Party, register your interest today!",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_local-councillor/content_12.html": "Become a Local Councillor:\nAll boroughs and local authorities are divided into wards, led by democratically elected councillors who represent their local community. As a local council member you will be overseeing a ward and will be responsible for representing the people in your council ward; engaging with them and addressing any concerns/issues in the community. This role is high profile and requires strong leadership and engagement, as you will be the bridge between members of the community and the council.\nSome of the responsibilities of a local councillor are:\n-\nRepresenting the ward for which they are elected.\n-\nDecision-making - developing and reviewing council policy.\n-\nScrutinising decisions taken by the councillors on the executive or cabinet.\n-\nRegulatory, quasi-judicial and statutory duties.\nCriteria for councillor role:\n-\nBritish or a citizen of the Commonwealth or European Union\n-\nAt least 18 years old\n-\nRegistered to vote in the area or have lived, worked or owned property there for at least 12 months before an election.\nYou can’t be a councillor if you:\n-\nWork for the council you want to be a councillor for, or for another local authority in a political restricted post\n-\nAre the subject of a bankruptcy restrictions order or interim order\n-\nHave been sentenced to prison for three months or more (including suspended sentences) during the five years before election day\n-\nHave been convicted of a corrupt or illegal practice by an election court.\nIf you are interested in becoming a local councillor, on behalf of Taking the initiative Party, register your interest today!",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_post_our-local-government-councillor-training-session-left-attendees-feeling-inspired-to-be-the-change/content_33.html": "Our local government councillor training session left attendees feeling inspired to be the change\n- The Initiative Party\n- Dec 6, 2021\n- 2 min read\nOn the 27th of November, we hosted our second government councillor training session which proved to be a roaring success amongst aspiring councillors and those wanting to learn more about local politics.\n“TTIP is there for those who are looking for their place in society. It’s about being a voice for those who feel they don’t have one.” Said a representative from TTIP.\nIt was great to see such a variety of attendees at the event- mothers, fathers, students, musicians, authors, and entrepreneurs all got together to focus on their similarities- not their differences. Although they all lead different lives with different issues, they could all agree on the fact that this current government is in desperate need of an alternative.\nThe TTIP course conductor touched base on a variety of topics that are essential for any aspiring local government councillor, including what a councillor’s role entails, the seven principles of public life, an introduction to local government, and solving case studies of challenging situations within their local communities.\n“I knew I had the passion and I cared. And that’s really all you need; you need to be dedicated to know why you’re doing this.” Says guest speaker Farah London on finding her drive to become a councillor.\nFarah London is a 2021 London mayoral candidate who grew up in Croydon and came into the political arena with a drive for showing people there’s more to politics than just the career politicians that currently populate the Labour and Conservative parties.\nAttendees left the training course feeling inspired and ready to face the challenges and rewards that come with running to be a councillor as well as a wealth of knowledge about local issues in councils. We’ll be putting candidates up for the 2022 elections in Croydon and other London boroughs. We’re teaching members the skillset to make their local borough into one they are proud of, as well as being the voice for those who feel they don’t have one.\nIf you’d like further support in becoming a local government councillor our next local government councillor training provisional date is January 22nd, 2022. Our training sessions are free of charge for all TTIP’s paying members. We welcome those with an interest in running for local government councillor in the 2022 elections but also those simply looking to expand their knowledge of local politics!\nMake sure to purchase your membership today via https://www.theinitiativeparty.org.uk/copy-of-membership-new. so you don’t miss out on our future training sessions and events.\nIf you are interested in signing up as a local government councillor check out our website via https://www.theinitiativeparty.org.uk/local-councillor-training for more information.\nIf you have any further questions do not hesitate to contact us via telephone, email, or on our social media platforms.\nTel: 0208 698 7000\nFacebook: TakingTheInitiative\nInstagram: @takingtheinitiative\nTwitter: @PartyInitiative",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_local-councillor-training/content_13.html": "LOCAL GOVERNMENT COUNCILLOR TRAINING\nAre you interested in becoming a Local Councillor\nand representing your community?\nTaking the Initiative Party's first Local Government Councillor Training Session!\nTaking the Initiative Party's Local Government Councillor Training is available to those who are interested in running for the May 2022 local elections and those who simply want to expand their knowledge in the area of politics.\nThe training session is free for all paying members of Taking the Initiative Party or £45 for non-members. Please see below the link for the membership page.\nSign up for a membership here https://www.theinitiativeparty.org.uk/sign-up-as-a-member\n£45 non-members, pay here https://buy.stripe.com/dR62bH5kr3gl8fu7sy\nThe next planned training date is on\nSaturday 5th February 2022.\nFor further information on this training course and to enroll, please email us via info@theinitiativeparty.org.uk or call us on 0208 698 7000",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_donation/content_3.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE\nThank you for helping us make a difference!",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_copy-of-membership-new/content_36.html": "START TAKING THE INITIATIVE\nBecome A Member Today\nPremium membership\nAs a premium member, you will be entitled to attend three of our educational and networking events throughout the year completely free of charge and all other events that you wish to attend will be 50% discounted for our premium members. (Subject to availability)\nStandard membership\nAs a standard member, you will receive a 40% discount on all of our events throughout the year. (Subject to availability)\nConcession membership\nSame as standard membership. This membership is available for: Students, OAP's, NHS staff, people receiving supported living/income support (Universal credit)/ Disability living allowance and Trade unions,\nBy becoming a member, Taking the Initiative, locally and nationally, may use the information submitted, including your political views, to further our objectives, share it with our elected representatives, and contact you in future using any of the means provided. Some contacts may be automated. You may opt-out of some or all contacts or exercise your other legal rights by contacting us. Further details are in our Privacy Policy\nSelect Your Plan\nPremium Membership\n£8.34\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nAble to stand for election\nDiscounted entry to the annual gala event\nFree entry to educational and networking events\nFree legal advice (subject to terms and conditions)\nFree business mentoring for start up businesses\nFree financial advice (concerning insurance, loans and more)\nPremium Membership\n£100\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nAble to stand for election\nDiscounted entry to the annual gala event\nFree entry to educational and networking events\nFree legal advice (subject to terms and conditions)\nFree business mentoring for start up businesses\nFree financial advice (concerning insurance, loans and more)\nStandard Membership\n£5\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational\nand networking events\nFree financial advice (concerning insurance, loans and more)\nStandard Membership\n£60\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational\nand networking events\nFree financial advice (concerning insurance, loans and more)\nConcession Membership\n£3\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nFree financial advice (concerning insurance, loans and more)\nConcession Membership\n£36\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nFree financial advice (concerning insurance, loans and more)\nThe Taking the Initiative Party may use the information you submit to us when\nbecoming a member (including your political views) to further our objectives,\nshare with our elected representatives, and to contact you using any of the\ndetails provided. Some contacts may be automated. You can opt-out of some\nor all contacts, or exercise your other legal rights pertaining to personal data\ncollection, by contacting us. Further details are in our Privacy Policy.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_contact/content_19.html": "top of page\nCONTACT\nWe want to hear from you!\nIf you have any questions, thoughts, or just want to know more about what\nwe do, get in touch. You can reach us either by phone or by sending an email\nthrough the form below. We’ll get back to you as soon as possible.\n+44(0)2086987000\nbottom of page",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_croydon-west-candidate/content_6.html": "Our Croydon West Parliamentary Candidate\nDonna Murray-Turner\nDonna Will be running as our Croydon West Parliamentary Candidate in the 4th July 2024 election!\nWho is Donna?\nDonna Murray-Turner is TTIP’S candidate for the Croydon West Parliamentary seat 2024. Donna was born in St Mary’s hospital and raised in the borough of Croydon; from her early journey at Elmwood Primary School, Haling Manor High School and John Ruskin Sixth-form, she has studied, lived and continues to live in this borough while raising her family here.\nDonna is working for Croydon to finally make the change we all deserve. Throughout her education, Donna studied Youth Work, Social Pedagogy, and Community Learning Development at Canterbury Christchurch University. Donna is proud of her working class background and has used that as her lived experience to advocate on behalf of the community; She is also currently the Safer Neighbourhood Chair of Croydon has a stellar career as a Consultant to leading institutions. People are disenfranchised from taking part in political processes because their voices and their lived experiences are not being represented. Very few tangible solutions are offered.\nDonna has spent the past 8 years working hard across Croydon to listen to the concerns of local people, helping them find solutions and support at their point of need, to create sustainable change for them and their families. Real change will only come if we use our voices and votes to elect those who are solution focused for Croydon West. This must be more than politicking, and political ambitions, Donna believes this must be about personal investment for a better Croydon, a 5 safer Croydon, more jobs for Croydon, a cleaner Croydon, better quality social housing for Croydon; a return to a vibrant town centre, support for parents & families and importantly, spaces for young people to socialise and feel safe. Simply, a better Croydon for all.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_volunteer/content_30.html": "START TAKING THE INITIATIVE\nBecome A Volunteer Today\nWe are only as strong as our people. Whatever your experience and however\nlong you can give us, we need you!\nWhether it’s delivering leaflets, talking to voters on the phone, or pitching in\nwith office admin, your help will make a huge difference. If you’re brand new\nto volunteering, you’ll be in good company – 75% of people on our national\nvolunteer team had never volunteered before joining us.\nSign up below to find out more about volunteering and making the change\nyou want to see in your community.\nIf you submit this form, Taking the Initiative, locally and nationally, may use the information submitted, including your political views, to further our objectives, share it with our elected representatives, and contact you in future using any of the means provided. Some contacts may be automated. You may opt-out of some or all contacts or exercise your other legal rights by contacting us. Further details are in our Privacy Policy.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_profile_jamestaylor2915_profile/content_37.html": null,
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_mission-statement/content_16.html": "TAKING THE INITIATIVE PARTY\nTHE BLUEPRINT FOR CHANGE\nTaking The Initiative Party aims to create real change in communities across the UK by setting the agenda in government. We want to do this by putting forward exceptional candidates who truly represent their communities, winning seats to create a parliament that actually looks like the society it leads.\nWe believe that the current political landscape is dominated by career politicians who are failing to tackle crucial issues. We see a Government that is in the pocket of Big Business and looking after its own interests, with an ineffective Opposition bogged down in one scandal after another.\nFrom where we sit it seems that our elected politicians bicker amongst themselves while the country faces unprecedented challenges:\n-\nThe world is gripped by the effects of a pandemic which has put untold pressure on our health service and our economy.\n-\nWe are preparing for one of the most significant political events in a lifetime now that Britain has left the EU and the transition period ends in a few short months.\n-\nDigital technologies have transformed the industry, leaving some British communities decimated by the loss of manufacturing or the squeeze on farming.\n-\nTax avoidance by corporations is standard, and unprecedented levels of wealth are hoarded by a few super-rich.\n-\nMeanwhile, inequality in UK society gets only worse, with children living in poverty and foodbank use the norm.\nWe know the answer to these challenges can come from our communities. We want to be a new voice on the political stage to channel local knowledge and expertise, to come up with creative solutions and to make sure that resources go where they are needed most.\nKey domestic areas that we think need especially urgent attention are housing, education, benefits, taxation and knife crime. We are developing a manifesto that details our plans for these and the other challenges and opportunities that face the UK today, both at home and internationally.\nWe believe that Britain’s strength lies in its people. You can join us in our mission by becoming a member, a volunteer or a supporter with us today. You can also support our work by making a donation. Let’s come together with one voice to make a lasting change towards a better UK – for everyone.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_shop/content_2.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE\nTTIP Pen\nRosette\nFace Masks\nKey Rings\nCotton Tee",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_become-a-candidate/content_25.html": "TAKING THE INITIATIVE PARTY\nBecome A Candidate\nCould you make a difference to your community and your country by getting\ninvolved in politics?\nAre you ready to take the initiative?\nPolitics today is too often dominated by career politicians who have little experience of the world outside Westminster.\nThe benches of Parliament are packed with privileged people who have been able to use their wealth, connections and elite education to springboard themselves into positions of power.\nCandidates for elections are often parachuted into constituencies by the main parties, meaning that communities are represented by MP that have no connection to them.\nWe know all this could be different. We think it is vital that the people of Britain are represented by those that have their best interests at heart, and believe that this will be best achieved by ensuring candidates for election are real people from real communities. Genuine representation with an understanding of the local issues and priorities, by people who know what’s at stake.\nWe want to put forward outstanding individuals who have either lived or worked in the area they want to represent for at least two years.\nPotential candidates must also be fully paid up members of the Party at the Premium level. If you would like to represent your community and think that you have what it takes to win local support, then we want to hear from you. Sign up below to\nfind out more about becoming a candidate for Taking the Initiative.\nIf you submit this form, Taking the Initiative, locally and nationally, may use the information submitted, including your political views, to further our objectives, share it with our elected representatives, and contact you in future using any of the means provided. Some contacts may be automated. You may opt-out of some or all contacts or exercise your other legal rights by contacting us. Further details are in our Privacy Policy.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_post_ttip-at-the-uk-s-black-business-show-2022/content_14.html": "Each year, the business show comes together to host, inspire and connect black business owners and professionals! Through exhibits, workshops, interactive panels and seminars, delivered by industry pioneers, the event enables personal, professional and corporate development as well as network building.\nTo celebrate UK Black History Month, The UK Black Business Show takes place in October. The show highlights the achievements and contributions that Black businesses have made to the economy, and attendees gain insight and advice in entrepreneurship, leadership, soft skills and cultural development from some of the UK’s leading Black business owners.\nTaking the Initiative Party took part in the Black Business Show on Saturday 22nd October which took place at the Business Design Centre in Islington. It was a fantastic opportunity to engage and network with community members and businesses from all around the UK! We also had the privilege of being visited by H.M Queen Diambi of Congo!\nWe would like to say a huge thank you to our members and supporters who came to the Business Show, as well as to the new members and supporters that we met at the show!\nIf you would like to catch up on what happened at the show, you can view the video below for a live-stream recorded by the fantastic and talented Streetmic who came out to the show to support us. A massive thank you to Streetmic!",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk/content_1.html": "The Taking the Initiative Party was established by a group of British business\npeople - some from working class backgrounds who felt, like many others across the country, that we had become politically homeless.\nWe founded the Party to create meaningful politics that will inspire people to\nget out and vote. We want to put forward candidates for election who truly\nrepresent their community AND who will deliver on campaign promises. We\noffer practical policies based in fact and detail, with honesty, transparency\nand accountability at the core of everything we do.\nOur background is in business and we believe that business has a positive part\nto play in community: through entrepreneurship, employment and\nempowerment. We also believe in responsible business that contributes to\nsociety – through fair taxation, employment rights, and environmental\naccountability.\nTaking the Initiative can see a brighter future for the UK, where everyone has\na chance to make a difference and to thrive. We want to build a society where\npeople who take the initiative to work towards a better Britain are rewarded:\nwith excellent schools, world-leading healthcare, and a flourishing economy.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_product-page_face-masks/content_24.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_become-a-member/content_31.html": "START TAKING THE INITIATIVE\nBecome A Member Today\nThe standard membership rate is £60 per annum. Students and pensioners are £28 per annum. The premium membership option is £100 per annum.\nPremium membership\nAs a premium member, you will be entitled to attend three of our educational and networking events throughout the year completely free of charge and all other events that you wish to attend will be 50% discounted for our premium members. (Subject to availability)\nStandard membership\nAs a standard member, you will receive a 40% discount on all of our events throughout the year. (Subject to availability)\nConcession membership\nSame as standard membership. This membership is available for: Students, OAP's, NHS staff, people receiving supported living/income support (Universal credit)/ Disability living allowance and Trade unions,\nBy becoming a member, Taking the Initiative, locally and nationally, may use the information submitted, including your political views, to further our objectives, share it with our elected representatives, and contact you in future using any of the means provided. Some contacts may be automated. You may opt-out of some or all contacts or exercise your other legal rights by contacting us. Further details are in our Privacy Policy\nSelect Your Plan\nPremium Membership\n8.34£Every monthMonthly- Receive regular news and update\n- Receive invites to local events\n- Able to join associated organisations\n- Be consulted on campaigns & policy\n- Able to attend conferences\n- Able to vote in party elections\n- Able to vote at conference\n- Decide on party policy\n- Discounted attendance on educational and networking events\n- Able to stand for election\n- Discounted entry to the annual gala event\n- Free entry to educational and networking events\n- Free legal advice (subject to terms and conditions)\n- Free business mentoring for start up businesses\n- Free financial advice (concerning insurance, loans and more)\nPremium Membership\n100£Every yearAnnual- Receive regular news and update\n- Receive invites to local events\n- Able to join associated organisations\n- Be consulted on campaigns & policy\n- Able to attend conferences\n- Able to vote in party elections\n- Able to vote at conference\n- Decide on party policy\n- Discounted attendance on educational and networking events\n- Able to stand for election\n- Discounted entry to the annual gala event\n- Free entry to educational and networking events\n- Free legal advice (subject to terms and conditions)\n- Free business mentoring for start up businesses\n- Free financial advice (concerning insurance, loans and more)\nStandard Membership\n5£Every monthMonthly- Receive regular news and update\n- Receive invites to local events\n- Able to join associated organisations\n- Be consulted on campaigns & policy\n- Able to attend conferences\n- Able to vote in party elections\n- Able to vote at conference\n- Decide on party policy\n- Discounted attendance on educational and networking events\n- Free financial advice (concerning insurance, loans and more)\nStandard Membership\n60£Every yearAnnual- Receive regular news and update\n- Receive invites to local events\n- Able to join associated organisations\n- Be consulted on campaigns & policy\n- Able to attend conferences\n- Able to vote in party elections\n- Able to vote at conference\n- Decide on party policy\n- Discounted attendance on educational and networking events\n- Free financial advice (concerning insurance, loans and more)\nConcession Members\n36£Every yearAnnual- Receive regular news and update\n- Receive invites to local events\n- Able to join associated organisations\n- Be consulted on campaigns & policy\n- Able to attend conferences\n- Able to vote in party elections\n- Able to vote at conference\n- Decide on party policy\n- Discounted attendance on educational and networking events\n- Free financial advice (concerning insurance, loans and more)\nConcession Members\n3£Every monthMonthly- Receive regular news and update\n- Receive invites to local events\n- Able to join associated organisations\n- Be consulted on campaigns & policy\n- Able to attend conferences\n- Able to vote in party elections\n- Able to vote at conference\n- Decide on party policy\n- Discounted attendance on educational and networking events\n- Free financial advice (concerning insurance, loans and more)\nThe Taking the Initiative Party may use the information you submit to us when\nbecoming a member (including your political views) to further our objectives,\nshare with our elected representatives, and to contact you using any of the\ndetails provided. Some contacts may be automated. You can opt-out of some\nor all contacts, or exercise your other legal rights pertaining to personal data\ncollection, by contacting us. Further details are in our Privacy Policy.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_leave-a-legacy/content_11.html": "LEAVE A LEGACY\nLets Support And Build A Better Britain\nYour gift will mean that together, we can continue the fight for:\n-\nJustice and liberty.\n-\nHuman rights and open government.\n-\nEquality and community\n-\nA tolerant, united and supportive Britain\nAnd we can continue to fight against prejudice and discrimination. Our party relies on gifts in wills – we would struggle to achieve as much as we do without them. Leaving a gift in your will means that for generations to come, Taking the Initiative will be there to fight for the values that you believe in. For more info, you can read our Guide to Making a Will.\nGuide to Making a Will\nIt’s simple and easy to leave a gift to Taking the Initiative Party and it will benefit both your local party, as well as the national party. Your Will is entirely personal to you and it should fit in with your own personal situation.\nA gift in your Will to Taking the Initiative will be tax efficient, as gifts to a recognised political party are deducted from your estate before inheritance tax is calculated.\nA percentage of your estate (Residuary gift)\n-\nThis type of gift is a percentage of your estate after debts. This has the advantage of automatically keeping up with inflation.\nA specific amount of cash (Pecuniary gift)\n-\nYou can also choose to leave a specific sum of money as a gift which can be as big or as small as you like.\nSpecific gift\n-\nThese gifts tend to be a valuable item like a property, a piece of jewellery or stocks and shares.\nReversionary gift\n-\nThis gift has the advantage of ensuring that your family and friends are cared for in the first instance. The gift would only be received by Taking the Initiative party once the original beneficiaries have passed away.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_profile_indirakaler_profile/content_22.html": null,
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_privacy-policy/content_18.html": "Privacy Policy\nPRIVACY POLICY\nThis privacy policy sets out how The Taking The Initiative Party, uses and protects any information that you give when you use our website. The Taking The Initiative Party is committed to ensuring that your privacy is protected.\nWhat information do we collect?\nWe collect:\nFirst and last name\nPhone number\nEmail address\nBirthday\nWhat do we do with the information we collect?\nWe require this information to understand your needs and provide you with a better service, and in particular for the following reasons:\n-\nTo personalise your experience (your information helps us to respond to your individual needs)\n-\nTo improve our website and product (we continually strive to improve The Taking The Initiative Party texts, emails and the website based on your feedback)\n-\nWe may periodically send promotional emails about new products, special offers or other information which we think you may find interesting using the email address which you have provided.\nSecurity\nWe are committed to ensuring that your information is secure. In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online.\nCookies\nA cookie is a small file of information placed on your computer. Cookies can help track which websites you visit and what you do on the site.\nThe Taking The Initiative Party uses cookies for the following purposes:\n-\nTo understand site analytics to improve site features, tailor content, and enhance user experience.\n-\nLinks to other websites\nOur website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question.\nDo we disclose any information to outside parties?\nWe will not sell, distribute, or lease your personal information to unrelated third parties unless we have your permission or are required by law to do so. We may need to send your personal information to our third-party vendors, who are under contractual obligations to keep this information confidential. We may also use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen. Finally, if we ever sell The Taking The Initiative Party or participate in a merger or consolidation, and our User data is one of the assets involved in the sale, your personal information will be part of this sale or transfer.\nWe may also disclose your personal information:\nTo comply with any court order, law or legal process, including to respond to any government or regulatory request.\nTo enforce or apply our Terms of Use and other agreements, including for billing and collection purposes.\nIf we believe disclosure is necessary or appropriate to protect the rights, property, or safety of The Taking The Initiative Party our customers, or others. This may include exchanging information with other companies and organisations for the purposes of fraud protection and credit risk reduction.\nYour consent\nBy using our site, you consent to our privacy policy.\nDo Not Track\nDo Not Track is a preference you can set in your browser to let websites you visit know that you do not want them collecting certain information about you. We do not currently respond to, or honour, Do Not Track signals or requests from your browser.\nAccessing and Correcting Your Information\nYou can review and change your personal information by logging into your profile through the member's section on the website.\nYou may also send us an e-mail at info@theinitiativeparty.org.uk to request access to, correct or delete any personal information that you have provided to us. We may not be able to delete your personal information except by also deleting your user account. We also may not accommodate a request to change information if we believe the change would violate any law or legal requirement, or cause the information to be incorrect.\nData Protection and GDPR Compliance\nThe Taking The Initiative Party is licensed to collect personal information as stipulated in this document in accordance with GDPR compliance in the United Kingdom. You will always be asked to ‘opt-in’ and ‘unsubscribe’ to all marketing communication with us.\nThe Taking The Initiative Party does not store any personal data that you have not provided us with your permission and will only be used to communicate with you during your contracted time with us. After which, all information will be removed and permanently deleted.\nChanges to our privacy policy\nIf we decide to change our privacy policy, we will post those changes on this page.\nFor any questions,\nEmail us at info@theinitiativeparty.org.uk",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_sign-up-as-a-member/content_34.html": "START TAKING THE INITIATIVE\nBecome A Member Today\nPremium membership\nAs a premium member, you will be entitled to attend three of our educational and networking events throughout the year completely free of charge and all other events that you wish to attend will be 50% discounted for our premium members. (Subject to availability)\nStandard membership\nAs a standard member, you will receive a 40% discount on all of our events throughout the year. (Subject to availability)\nConcession membership\nSame as standard membership. This membership is available for: Students, OAP's, NHS staff, people receiving supported living/income support (Universal credit)/ Disability living allowance and Trade unions,\nBy becoming a member, Taking the Initiative, locally and nationally, may use the information submitted, including your political views, to further our objectives, share it with our elected representatives, and contact you in future using any of the means provided. Some contacts may be automated. You may opt-out of some or all contacts or exercise your other legal rights by contacting us. Further details are in our Privacy Policy.\nSelect Your Plan\nPremium Membership\n£8.34\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nAble to stand for election\nDiscounted entry to the annual gala event\nFree entry to educational and networking events\nFree legal advice (subject to terms and conditions)\nFree business mentoring for start up businesses\nFree financial advice (concerning insurance, loans and more)\nMembership pack; TTIP T-shirt, Rosette, key-ring, face mask\nPremium Membership\n£100\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nAble to stand for election\nDiscounted entry to the annual gala event\nFree entry to educational and networking events\nFree legal advice (subject to terms and conditions)\nFree business mentoring for start up businesses\nFree financial advice (concerning insurance, loans and more)\nMembership pack; TTIP T-shirt, Rosette, key-ring, face mask\nStandard Membership\n£5\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational\nand networking events\nFree financial advice (concerning insurance, loans and more)\nMembership pack; TTIP T-shirt, Rosette, key-ring, face mask\nStandard Membership\n£60\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational\nand networking events\nFree financial advice (concerning insurance, loans and more)\nMembership pack; TTIP T-shirt, Rosette, key-ring, face mask\nConcession Membership\n£3\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nFree financial advice (concerning insurance, loans and more)\nMembership pack; TTIP T-shirt, Rosette, key-ring, face mask\nConcession Membership\n£36\nEvery year\nYearly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nFree financial advice (concerning insurance, loans and more)\nMembership pack; TTIP T-shirt, Rosette, key-ring, face mask\nConcession Membership\n£3\nEvery month\nMonthly\nReceive regular news and updates\nReceive invites to local events\nAble to join associated organisations\nBe consulted on campaigns & policy\nAble to attend conferences\nAble to vote in party elections\nAble to vote at conference\nDecide on party policy\nDiscounted attendance on educational and networking events\nFree financial advice (concerning insurance, loans and more)\nMembership pack; TTIP T-shirt, Rosette, key-ring, face mask\nThe Taking the Initiative Party may use the information you submit to us when\nbecoming a member (including your political views) to further our objectives,\nshare with our elected representatives, and to contact you using any of the\ndetails provided. Some contacts may be automated. You can opt-out of some\nor all contacts, or exercise your other legal rights pertaining to personal data\ncollection, by contacting us. Further details are in our Privacy Policy.",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_product-page_key-rings/content_32.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_product-page_cotton-tee/content_15.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_subscribe/content_20.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE\nThanks for submitting!",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_become-a-supporter/content_8.html": "top of page\nSTART TAKING THE INITIATIVE\nJoin As A Supporter Today\nAs a supporter, you will receive email updates of everything that is happening with Taking The Initiative Party, including updates on events.\nIf you submit this form, Taking the Initiative, locally and nationally, may use the information submitted, including your political views, to further our objectives, share it with our elected representatives, and contact you in future using any of the means provided. Some contacts may be automated. You may opt-out of some or all contacts or exercise your other legal rights by contacting us. Further details are in our Privacy Policy.\nbottom of page",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_post_your-vote-counts/content_17.html": "Your vote counts\n- The Initiative Party\n- May 13, 2022\n- 3 min read\nTaking the Initiative Party’s first step towards ending the corruption in Croydon\nTaking the Initiative Party’s Mayor for Croydon candidate Farah London took 5,768 first choice votes away from the Labour party, mainly in the north of Croydon resulting in the Labour Party losing the mayoral election to the Conservative Party in 5th May local council elections, Croydon. The Labour Party lost the mayoral seat to the Conservative Party with a margin of 589 votes.\nAs a young, newly established party in Croydon partaking in our first ever full Local Election and after numerous consultations with the residents, it became apparent that, even though some of the behaviour of the Conservative Party has been questionable across the country, there is no doubt that the behaviour of the Labour Party in Croydon is both unethical and criminal. An example of this is the current fraud investigation being held by the Met police on Croydon council, for the £67.5 million spend on the “refurbishment” of Fairfield Halls, whilst residents have been suffering major neglect and businesses suffering major damage in the borough.\nIn order for the community to repair itself, we must address the residents’ needs as well as the lack of opportunities provided to them and support the businesses to increase local economy. We have sent a firm message to the Labour Party that corruption and unethical behaviour will no longer be accepted. We have also made our position clear, to the Conservative Party, that we expect to see real change in the north of Croydon, in relation to the appropriate distribution of funds, support for businesses, facilities for the youth, an improvement on council services being provided to residents such as bin collections, adequate housing standards, safer streets with zero tolerance to knife crime and more.\n\"We have been led to believe that as working class people, we do not have a say in what happens in our local community and we have suffered at the hands of people who have been dishonest, incompetent or both. However, we have now made a statement that we will exercise our vote to make change. The support we have built in just a year and a half has given us the power to sway the vote in favour of whoever is listening and making the lives of working class people in Croydon better. We intend to fight for Policies in Education, Health, Environment, Business and increase job opportunities. We want to make Croydon a better and happier place to live and work” says Farah London, Taking the Initiative Party’s mayoral candidate.\nThe most important lesson that this election has taught us, is that our vote counts and has the power to remove those from leadership positions who have failed us. As an example of this, alongside our votes as Taking the Initiative Party, independent candidate Andrew Pelling, who was removed from the Labour Party for having a conscience and speaking out against corruption, gained 6,807 first choice votes which also had a major impact on the shift of power. Each and every vote counts and collectively, the voters in the Croydon borough have the ability and power to change how the council is run. The total turnout for the election this year was 35%, if 65% of the remaining voters used their voice, we would have the ability to make a historic change in Croydon. Every vote counts.\nTaking the Initiative Party’s plan moving forward, is to continue to build our support in the north of Croydon as it is largely working class and has been highly neglected by the borough’s leadership. We will continue to ensure that the working class throughout London have a voice that actually represents them. Although the Labour Party was formerly seen as the party for the working class, it has become apparent that they have been drastically failing us, with the cost of living going up and people from working class backgrounds becoming more anxious, as their income is not rising in line with living costs.\nTaking the Initiative Party also intends to be fielding candidates in other areas throughout London in the upcoming parliamentary elections, as well as the next local elections where the working class is not being represented.\nTo view Farah London’s full manifesto for Croydon, visit www.ttip.org.uk. To view Taking the Initiative Party’s vision for Croydon and solutions to local issues visit https://www.theinitiativeparty.org.uk/our-vision-for-croydon\n0208 698 7000",
  "https_www_theinitiativeparty_org_uk_/https_www_theinitiativeparty_org_uk_product-page_rosette/content_21.html": "HOME\nOur Croydon West Candidate\nGet Involved\n2024 Croydon Elections\nInitiative Network\nMission Statement\nLeave a Legacy\nContact Us\nShop\nMORE"
}