{
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_3/content_8.html": "Chris Wongsosaputro suggests how cities and towns can become more environmentally friendly through urban infill.\nNational and local governments can play their parts towards cutting greenhouse gas (GHG) emissions by working together with individuals to implement strategies such as urban infill.\nUrban infill is defined as building more affordable houses, offices, factories, retail outlets and service centres in a compact manner. It is targeted towards the least densely populated, middle-income cities or towns with relatively lower carbon emissions. There is also some potential for business operations to be made more eco-friendly in such locations.\nThe Carbon Footprint Planning: Quantifying Local and State Mitigation Opportunities for 700 California Cities paper highlighted that urban infill, together with other strategies to reduce carbon consumption (e.g. boosting public transport usage) can contribute c.30% of all the potential carbon footprint reduction by 2030.\nDeep Diving Into What Urban Infill Looks Like in Practical Terms\nUrban infill is done in a compact manner to enable convenient commutes on foot or bicycle between home and work or shops, reducing reliance on private transport. Facilitating urban infill can involve using abandoned or untouched land to maximise land usage. This approach marks a clear break from sprawl constructions stretching into other suburbs or towns.\nIn order for urban infill to succeed, there is a need for national and local government involvement via monetary means and regulatory changes. For instance, the Government can provide financial support to build more environmentally friendly, accessible transport means including foot pathways, cycle lanes and public transport. The Government can further support urban infill by improving parking regulations flexibility, tightening anti-displacement laws and boosting affordable housing in infill zones. The latter can be realised via rebates or direct funding such as giving a higher share of property tax income to infill neighbourhoods.\nUrban infill measures can be accompanied by complementary measures such as increased uptake of electric vehicles and renewable energy sources outlined above.\nUrban Infill and Its Benefits Including Potential Reduction in GHG Emissions\nOne of the main benefits of urban infill is a decrease in travel distance and thus GHG emissions from traffic.\nThe benefits can be further bucketed into:\n- Environmental: Relates to the conservation of picturesque sceneries, farmlands and other essential landscapes, all of which are left untouched by urban infill developments. Moreover, urban infill enables walkable or cyclable commutes that decrease usage of vehicular transport and thus GHG emissions.\n- Economic (uplifts to California’s yearly economic growth quantified as exceeding $800 million vis-à-vis status quo by UC Berkeley):\n- Facilitates economies of scale with current and new infrastructure such as parks and public services to be built and used by a higher population density. Public transport can be self-sufficient with adequate usage volume, enabling future investments to be made to enhance the transport networks\n- Urban infill also allows for joint usage of assets (e.g. roofs) and decreases the volume of infrastructure networks required (e.g. pipes), thereby generating cost efficiencies with less infrastructure needed\n- Furthermore, the construction of urban infill areas creates jobs, (affordable) homes and retail zones for a sufficient population mass\n- Typical families benefit from decreased expenditures via lower commuting and utility costs\n- Historic preservation: Achieved via promoting the use of historic sites as operational and beautiful buildings.\nA World Bank study has quantified the impacts on GHG emission reductions from urban infill as being higher than a baseline scenario of sprawl developments – the range varies from 8.4% in Mexico City, Mexico to 39% in Chongqing, China. The benefits apply for both higher and lower-income families who benefit from residing in affordable urban infill zones.\nIn contrast, sprawl development necessitates a further, costlier commute and segments natural habitats which can harm the wildlife.\nConclusion\nCities and towns can play their part in lowering GHG emissions by proactively planning journeys to be carbon friendly. Urban infill provides one such strategy which can be combined with other measures including boosting renewable energy usage.\nWhile urban infill can contribute towards making population centres more environmentally sustainable, there is a need to communicate its benefits to the existing local population. Examples include the possibility of further economic growth and investment into their cities or towns, thereby generating more jobs.\nUrban infill also needs to be accompanied with investments into public services including hospitals and schools. Doing so will assure locals that the quality of public services such as hospitals and schools will not deteriorate with population growth.\nChris is a former Co-Chair of the Young Fabians Economy & Finance Network. He currently works as Strategy Consultant. Chris is writing this article in his personal capacity and all views expressed are his own.\nThis article has been written based on research so Chris would welcome further dialogue with members and other interested parties on this topic.",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_privacy-policy/content_6.html": "Your privacy is important to us. It is our policy to respect your privacy regarding any information we may collect from you across our website and other sites we own and operate.\nWe only ask for personal information when we truly need it to provide a service to you. We collect it by fair and lawful means, with your knowledge and consent. We also let you know why we’re collecting it and how it will be used.\nWe only retain collected information for as long as necessary to provide you with your requested service. What data we store, we’ll protect within commercially acceptable means to prevent loss and theft, as well as unauthorised access, disclosure, copying, use or modification.\nWe don’t share any personally identifying information publicly or with third-parties, except when required to by law.\nOur website may link to external sites that are not operated by us. Please be aware that we have no control over the content and practices of these sites, and cannot accept responsibility or liability for their respective privacy policies.\nYou are free to refuse our request for your personal information, with the understanding that we may be unable to provide you with some of your desired services.\nYour continued use of our website will be regarded as acceptance of our practices around privacy and personal information. If you have any questions about how we handle user data and personal information, feel free to contact us.\nThis policy is effective as of June 2023.",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_article-archive/content_5.html": "Skip to content\nFollow me\nLinkedin\nFacebook\nHome\nPriorities\nAbout\nArticles\nContact\nMenu\nHome\nPriorities\nAbout\nArticles\nContact\nArticle Archive\nOur pamphlet explores how Labour can solve the key economic issues of our age\nRead More »\nYoung Fabians Pamphlet\nRead More »\nAre Rent Controls The Answer To Britain’s Housing Crisis?\nRead More »\nCarbon Footprint Planning – The Case for Urban Infill\nRead More »\nGetting to Net Zero Housing Stock\nRead More »\nUsing sustainability as an alternative measure to societal progress vis-a-vis GDP\nRead More »",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_are-rent-controls-the-answer-to-britains-housing-crisis/content_4.html": "“Why can’t the government just cap rents?” is a question often asked by those at the sharp end of Britain’s housing crisis. The answer may come as a surprise – they already do (for some tenants). The British government limits rent increases for social housing tenants to CPI plus 1% and intends to cap this at 7% from April 2023. In Scotland, ministers in Holyrood implemented a six-month rent freeze for all current renters in September 2022 – capping the increase at 3% thereafter. The real question therefore is should such schemes be applied to all renters across the country?\nThe Way Forward?\nThe possible advantages of rent control are easy to see. Existing tenants can enjoy lower rental costs helping them to better afford housing and freeing up a chunk of their income to be spent or saved elsewhere. Rent controls also – in theory – help to prevent renters from being priced out of their homes should their neighbourhood become more sought after. Renters are also incentivised to be good long-term tenants, helping to provide landlords with a stable income. The Treasury, meanwhile, could save c.£900 million due to a falling number of welfare claimants. It sounds like a win-win, but a number of problems make rent controls better in the abstract than in reality.\nFrom a landlord’s perspective, a direct consequence of rent control is a lower rental income. This acts as a disincentive to carrying out much needed repairs – if rental income is capped anyway, then what is the point of enhancing the property? With rent controls reducing landlord earnings and tough economic conditions following interest rate rises and changes to tax relief from 2015, many would look to leave the market. This will have the impact of reducing the already meagre supply of rented accommodation. It is estimated that the number of buy-to-let properties has decreased by 116,000 (c.3%) in 2022 alone. There is also a high risk of a decline in property values – particularly in the buy-to-let sector – with adverse effects for developers building such properties due to potentially lower demand, thereby disincentivising further housebuilding.\nAll of these would burden the already struggling local authorities with soaring demand for social housing and a disastrous increase in homelessness. The effect of rent controls on housing associations offering social housing could be as great as £1.3 billion due to the loss of rental income without reimbursement. The consequences would be a large financing gap for maintenance, housing construction, and Net Zero retrofitting.\nLessons From Berlin\nWhilst it is too soon to draw conclusions about the Scottish Government scheme, the German capital offers a recent lesson on the effects of rent controls in practice. Berlin implemented the Mietendeckel (rental cap) policy in February 2020. This followed the Mietpreisbremse (rental price brake) law which the German Bundestag passed in 2015 to prevent rent from exceeding 10% of the official rates for older properties-built pre-October 2014 and allow tenants to demand rent decreases. A report indicated limited impacts of Mietpreisbremse as c.95% of new property listings exceeded the permitted amount while another noted a 6.7% rental cost increase between 2014 and 2016.\nBerlin’s Mietendeckel policy involved a five-year rental ceiling for every property built pre-2014 (to encourage housebuilding) and maintaining rental prices at their July 2019 rate until December 2021. Thereafter, yearly increases were limited to 1.3%. Tenants of an estimated 1.5 million rental properties could force a cut on their rent. Landlords were also required to decrease rental prices if they were more than 20% higher than the government cap for a similar property. Fines of €500k could be levied on those who didn’t comply.\nThe result was a fall in the number of rental properties on the Berlin market. Properties built pre-2014 were impacted by the rent control scheme and thus saw their value decreasing as tenants paid lower rents. In turn, some current landlords withdrew their properties from the market to sell or wait for a reversal of the regulations. Potential landlords were reluctant to buy the older properties from existing owners, thereby lowering the supply of rental properties. Conversely, properties built post-2014 were unaffected by the cap and saw their values increase as tenants paid higher rents. The shrinking pool of houses meanwhile left renters struggling to find property.\nThis policy was reversed when the German courts ruled in April 2021 that the Berlin city authorities had acted beyond the scope of their powers. Consequently, renters were forced to repay any savings they had made from the Mietendeckel policy back to their landlords.\nIf Not Rent Controls, Then What?\nRent controls create more problems than they solve. However, there is a very real underlying issue which has driven their support – soaring rents and spiralling property prices.\nSo, what can we do instead? A start would be to build more affordable homes to grant access to home ownership for Britain’s struggling renters. The resultant fall in demand for rental properties would cut rents for those still in the sector. In order to facilitate more house building, there is a need to review and reconsider some of the current planning regulations besides boosting funding. House building needs to take local circumstances into account including providing more local amenities such as schools and hospitals to complement the new homes.\nIt will take time to liberalise planning laws and build more homes. In the meantime, we can strengthen renters’ rights and better enforce existing protections for tenants. There are regular examples of landlords taking advantage of the rental crisis, for example by charging their tenants six-month advanced rent payment. Others have broken the law by demanding a deposit of in excess of 5 weeks rent, not protecting tenants’ deposit and setting up “ghost tenancies”. Another is the collection of agency fees under the “zero deposit scheme”. Accompanying a crackdown on these egregious offences should be a public register of landlords with reviews from tenants. We also need to change the existing laws that protect tenants. There is an ongoing campaign for the Renters Reform Bill to be passed by Parliament. The bill calls for banning no fault evictions and limiting rent rises to once per annum with two months’ notice which will enhance tenants’ rights.\nThe housing crisis is one of the largest problems facing Britain and renters are feeling it the most. We urgently need solutions but rent control in practice will bring more problems than it resolves. Only with housebuilding (and planning reforms), stronger tenants’ rights and better law enforcement will we ease the burden on this country’s renters!",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_getting-to-net-zero-housing-stock/content_7.html": "Skip to content\nFollow me\nLinkedin\nFacebook\nHome\nPriorities\nAbout\nArticles\nContact\nMenu\nHome\nPriorities\nAbout\nArticles\nContact\nGetting to Net Zero Housing Stock\nTake a look at this publication on Britain’s Broken Housing Sector.",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_young-fabians-pamphlet/content_3.html": "Skip to content\nFollow me\nLinkedin\nFacebook\nHome\nPriorities\nAbout\nArticles\nContact\nMenu\nHome\nPriorities\nAbout\nArticles\nContact\nYoung Fabians Pamphlet\nYoung Fabian’s pamphlet.",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_our-pamphlet-explores-how-labour-can-solve-the-key-economic-issues-of-our-age/content_2.html": "As the next general election approaches, Labour has been pivoting away from only offering criticisms of the government on the issues of the day, such as the cost-of-living crisis and low productivity growth. Labour has instead been constantly working towards becoming a government-in-waiting by accompanying these criticisms with its own policy proposals and vision for the country. An example is Keir Starmer’s new year speech, in which he outlined two elements of his vision for the country – a modernisation of the UK government and a ‘take back control’ bill detailing Labour’s devolution proposals. Both elements mark the start of an election campaign message that voters will hear more about during the rest of 2023 and into 2024.\nUltimately, Labour’s task is to help voters answer the question ‘what does Labour stand for’ and alleviate voters’ concerns about Labour only being interested in criticising the government. The shadow cabinet, Labour mayors, MPs, councillors (and other elected officials) and activists need to work hand in hand to amplify Labour’s message to voters via media appearances, social media postings, campaign publications and doorsteps, amongst others. A starting step is to ensure that Labour politicians and members get regular communications (e.g. emails) on the party’s latest policies. Labour can also increase its use of concise messaging, such as the “on your side” slogan of the 2022 local elections campaign, in a similar way to the “tough on crime, tough on the causes of crime” messaging of 1997.\nWith the above in mind, one key aspect for election campaign messaging is the economy. The economy consistently featured as one of the top issues ahead of the 2019 general election – 25% of the electorate ranked the economy as one of the most important issues facing the UK, behind Brexit, healthcare and crime. Although YouGov’s November 2019 polling indicated broad support for Labour’s economic policies, 53% of those polled believed that Labour’s spending priorities would not be affordable. 57% also believed that the UK would go into recession with Labour in power.\nThe writers of our new pamphlet, An Economic Lens to Reclaiming the Heartlands, therefore seek to explore credible economic policy proposals that Labour can put forward by region as key messages for the next general election, specifically:\n- Alleviating the cost-of-living crisis amid high inflation rates\n- Maintaining a commitment towards fiscal responsibility\n- Addressing the Conservatives’ U-turns on the HS2 eastern leg and Northern Powerhouse route\n- Outlining a commitment towards businesses and SMEs\n- Ensuring the next manifesto addresses the priorities of the rural community\n- Enhancing vocational and skills training at a local level\n- Providing secure, sustainable jobs\n- Focusing on housing\n- Facilitating the green energy transition\n- Enhancing broadband connectivity\n- Offering further devolution of power\n- Supporting the agenda of Mark Drakeford’s government in Wales\nWhen the above are brought together as fully-costed policies, they shape the narrative that Labour can be trusted with the economy and is a party of aspiration, willing and able to help those who work hard and aspire to succeed in life. They also provide a contrast with the Conservatives’ track record in office, during which time the UK has experienced almost stagnant growth.\nGiven the diversity of the economic situations facing various regions of the UK, there is a need to ensure that Labour’s economic offerings are tailored to each region and demographic. Our writers, who are young and senior Fabians living and working in the places they analyse, have therefore offered insights and policy recommendations for their respective regions, which make up our country’s heartlands.\nThe introduction has been written by Young Fabians Economy and Finance (YF E&F) Network senior economist Amarvir Singh-Bal, the executive summary by former YF E&F Network co-chair Chris Wongsosaputro and North West Young Fabians member Helen Clarke and the conclusion by former Fabian Society chair Dr Martin Edobor.\nFormer Prime Minister Gordon Brown has written the foreword alongside members of Labour’s shadow Treasury team, Pat McFadden MP and Tulip Siddiq MP. The pamphlet also has quotes from more than 30 Labour Party elected officials, including the shadow Treasury frontbench, Members of Parliament and the Senedd and the metro mayors, each tailored to their regions. The full project can be read here.\nThe Fabian Society Economic and Finance Policy Group and YF E&F Network would welcome your involvement in this discussion at our joint launch event, during which will discuss how Labour is placed to solve the pressing economic issues of our generation. The invited speakers for the panel discussion include IPPR executive director Carys Roberts, shadow minister for Asia and the Pacific Catherine West MP, shadow employment rights minister Justin Madders MP, Commons international trade committee member Mark Hendrick MP and shadow immigration minister Stephen Kinnock MP.\nThe event will take place from 7pm on Wednesday January 18th in Portcullis House committee room 8 in Westminster. RSVP here.",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com_using-sustainability-as-an-alternative-measure-to-societal-progress-vis-a-vis-gdp/content_9.html": "Skip to content\nFollow me\nLinkedin\nFacebook\nHome\nPriorities\nAbout\nArticles\nContact\nMenu\nHome\nPriorities\nAbout\nArticles\nContact\nUsing sustainability as an alternative measure to societal progress vis-a-vis GDP\nClick here to read more.",
  "https_chriswongsosaputro_com_/https_chriswongsosaputro_com/content_1.html": "I am Chris Wongsosaputro and I am excited to be your Labour candidate for Torbay. My journey has been shaped by diverse experiences, and I am eager to bring my unique background to serve our community here.\nMy professional journey began in the field of Accountancy and has taken me to Management Consulting, where I have worked with businesses big and small and the NHS.\nBeyond my professional life, my personal story is one of cultural diversity and migration. My family’s history spans across different countries, starting with my grandparents who moved from China to Indonesia with little means. Similarly, I moved from Indonesia to Singapore and eventually settled in the UK.\nI am proud to be British, and I carry with me a sense of gratitude for the warmth and opportunities this country has extended to me. Now, I am eager to give back to the UK by actively participating in politics. My commitment is fuelled by a desire to contribute to the community that has embraced me.\nI am excited about the prospect of representing Torbay in Parliament and I am dedicated to bringing a POSITIVE vision, FRESH perspective, a STRONG work ethic and a COMMITMENT to positive change. I will work hard for Torbay day in, day out.\nTorbay has a proud history as a successful seaside resort. However, it has been badly let down by the Conservative government with sewage being pumped into the sea, huge NHS backlogs as well as their anti-strikes bill and focus on culture war.\nWith Shadow Chancellor Rachel Reeves’ pledge to ‘make seaside towns great again’, I believe Labour can succeed where the Tories did not and with your support, we can all be part of the journey in helping this dynamic Bay fulfil its enormous potential.\nSpecifically, Labour will reform business rates, restore bathing water quality in the Bay and boost tourism to help Torbay thrive.\nRachel’s pledge will apply to Torbay as she has specifically mentioned making holiday homeowners register before letting out seaside properties and cracking down on second homeowners leaving properties empty.\nThis election offers you the chance to choose which party you would like to see forming the next Government.\nTherefore, you can vote for a Labour MP working hand in hand with a Labour Government to bring the change you want to see in Torbay!\nThe need for political representation deeply resonates with me.\nI came to the UK more than 10 years ago and decided to become involved in politics after witnessing divisive rhetoric from the Conservatives, in particular when Theresa May was the Home Secretary. I was inspired to join Labour as I share the party’s values of social justice and fairness.\nI gradually became more involved in politics, starting with becoming the first Mature and Part Time Student Officer at university and representing their concerns to the University Management.\nI am currently serving as Treasurer for my ward party and Fundraising Officer for my Constituency Labour Party. I am also active in the Socialist Societies and East and South East Asians for Labour where I am currently serving as Treasurer for both.\nOutside of politics, I am a school governor for a SEND school where I have seen first-hand the impacts of Tory cuts on our education system. Recognising the important role education plays, I will fight for more educational opportunities in Torbay.\nProfessionally, I qualified as a Chartered Accountant in 2018 and have worked as a Management Consultant since. I have worked with businesses big and small and have seen the damage the Tories have done to our economy and business confidence.\nA Labour Government prioritises economic stability with fully costed pledges. I have an understanding of what makes businesses tick and will work closely with a Labour Government to bring much-needed investment into Torbay.\nVOTE FOR CHANGE, VOTE FOR LABOUR!\n• A HARDWORKING LOCAL MP\nHaving direct voter conversations is certainly important to understand issues voters are facing in Torbay. Therefore, I will be an active MP who will lobby very hard for Torbay. I will listen to your feedback on how Labour can do better for Torbay while also sharing our initiatives with you, our voters, with regular newsletters and social media.\n• EMBEDDED IN THE COMMUNITY\nVoter contact goes beyond the doorsteps and include other stakeholders such as local enterprises, community groups and non-profit organisations. I will work with local charities, community groups and other initiatives to ensure I’m fighting for what matters to people in Torbay while also implementing Labour’s plans for the future.\n• NO SECOND JOB\nBeing your representative in Parliament as your MP will be my only job so that I can stay focused on what truly matters for Torbay.\nPromoted by Eddie Harris on behalf of Chris Wongsosaputro both of St Andrews Court, Cadewell Lane, Torquay, TQ2 7HP"
}