{
  "https_www_nfelabour_org_/https_www_nfelabour_org_about-1/content_3.html": "top of page\nHere we share Labour Party Views, Policy Discussions and Public Consultations from Local Councils in New Forest East Constituency.\nWe invite Labour Party Members to\nread the public consultations and reply individually to the Surveys,\nsubmit motions to New Forest East Labour,\nsubmit articles for publication on our website.\nYour view counts!\nNEWS\nbottom of page",
  "https_www_nfelabour_org_/https_www_nfelabour_org/content_1.html": "New Forest East Labour is proud to support the current Labour Government.\nWe are an enthusiastic group of volunteers promoting the Labour Party and its values in New Forest East.\nWe campaign, have lively debates with the odd social thrown in. Want to be involved? Want to make a difference?",
  "https_www_nfelabour_org_/https_www_nfelabour_org_privacy-and-gdpr-policies/content_4.html": "Privacy and GDPR\nPolicies\nCookies\nWe use a number of different cookies on our site. If you do not know what cookies are, or how to control or delete them, then we recommend you visit http://www.aboutcookies.org for detailed guidance.\nThe list below describes the cookies we use on this site and what we use them for. Currently we operate an implied consent policy which means that we assume you are happy with this usage. If you are not happy, then you should either not use this site, or you should delete the cookies having visited the site, or you should browse the site using your browser’s anonymous usage setting (called incognito in Chrome, InPrivate for Internet Explorer, Private Browsing in Firefox and Safari etc.)\nFirst Party Cookies\nThese are cookies that are set by this website directly.\nGoogle Analytics: We use Google Analytics to collect information about visitor behaviour on our website. Google Analytics stores information about what pages you visit, how long you are on the site, how you got here and what you click on. This Analytics data is collected via a JavaScript tag in the pages of our site and is not tied to personally identifiable information. We therefore do not collect or store your personal information (e.g. your name or address) so this information cannot be used to identify who you are.\nYou can find out more about Google's position on privacy as regards its analytics service at http://www.google.com/intl/en_uk/analytics/privacyoverview.html\nMore information on session cookies and what they are used for at http://www.allaboutcookies.org/cookies/session-cookies-used-for.html\nThird Party Cookies\nThese are cookies set on your machine by external websites whose services are used on this site. Cookies of this type are the sharing buttons across the site allow visitors to share content onto social networks. Cookies are currently set by Twitter and Facebook. In order to implement these buttons, and connect them to the relevant social networks and external sites, there are scripts from domains outside of our website. You should be aware that these sites are likely to be collecting information about what you are doing all around the internet, including on this website.\nPrivacy\nPrivacy Policy\nThis privacy policy sets out how New Forest East Labour uses and protects any information that you give New Forest East Labour using this website.\nNew Forest East Labour is committed to ensuring that your privacy is protected. Should we ask you to provide certain information by which you can be identified when using this website, then you can be assured that it will only be used in accordance with this privacy statement.\nNew Forest East Labour may change this policy from time to time by updating this page.\nWhat we collect\nName, telephone number and email address\nQueries submitted\nOther information relevant to customer surveys\nWhat we do with the information we gather\nWe require this information to understand your needs and provide you with the best service we can and inparticular for the following reasons:\nInternal record keeping\nWe may use the information to improve our products and services\nWe may periodically contact you to inform you of new policies, special offers and other information which may be relevant.\nFrom time to time, we may also use your information to contact you for market research purposes. We may contact you in person, by email,phone or mail. We may use the information to customise the website according to your interests.\nSecurity\nWe are committed to ensuring that your information is secure. In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure information we collect online.\nLinks to their websites\nOur websites may contain links to other websites of interest. However, once you have used these links to leave our site you should note that we do not have any control over that other website.\nTherefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question.\nControlling your personal information\nYou may choose to restrict the collection or use of your personal information by informing us either in the message box on the contact form, email, telephone, in person or by mail. Email: mail@nfelabour.org.uk\nWe will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen.\nYou may request details of personal information which we hold about you under the Data Protection Act 1998. Please write to us at Email: mail@nfelabour.org.uk\nIf you believe that any information we hold about you is incorrect or incomplete please write or email us as soon as possible. We will promptly correct any information found to be incorrect.",
  "https_www_nfelabour_org_/https_www_nfelabour_org_blank-1/content_5.html": "Executive Committee\nHere, in New Forest East , we have a vibrant Executive Committee. We hold interactive General meetings to discuss and develop policies and strategies, and have regular canvassing events so our local policies are relevant and fair to our constituents.\nCome along to our next meeting, to see what we do!\nHi\nI'm Sherri Johnstone, Chair of New Forest East Labour Party\nThank you for taking the time to visit our website today.\nIn these uncertain times, my belief is that we need change that is fair, climate friendly and works for you!\nThe Labour Party has a strong plan to invest in green technologies. This plan will help create new, fair paid jobs, give resilience to our energy security and help us to tackle the climate change problem. A problem, that if not addressed properly through planned, targeted investment will impact our children and grandchildren.\nALL ABOUT NEW FOREST EAST LABOUR PARTY\nWe are a passionate group of people residing in this constituency. We believe in fair respectful policies from our Government. To achieve this we work with all our stakeholders, including our constituents, party member and the Central Labour Office. We aim to promote Labour Policies to win the next General election.",
  "https_www_nfelabour_org_/https_www_nfelabour_org_about-1-1/content_2.html": "top of page\n100 Club\nThe 100 club is open to anyone who is a member of the New Forest East Labour Party.\nHOW IT WORKS\nEach member pays £5 a month of which 50% goes towards the constituency and the other 50% goes towards the prize fund. Each member is then given a unique number. A number is then selected at random by the treasurer (with at least one other witness) and then the lucky person is informed!\nIf you're interested in taking part or have any more questions please email:\nstating \"100 club application\"\nbottom of page"
}