{
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_booking-calendar_julie-s-online-music-school/content_13.html": "top of page\nLog In\nSchedule your service\nCheck out our availability and book the date and time that works for you\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_book-online/content_3.html": "1 hr\nNegotiable\nIf you have already purchased any of the services, please use your order ID in the form and will contact you back regarding it.\nThanks for submitting!",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_service-page_tv-radio-broadcasts-live-pre-recorded/content_12.html": "top of page\nTV, Radio Broadcasts Live, Pre Recorded\n1 hr1 hLocation 1\nNegotiable\nNegotiable\nService Description\nTV or Radio Broadcasts Live or Pre Recorded. Immerse your audience in an uplifting and transformative experience with Julie's dynamic TV or Radio Broadcasts, available both live and pre-recorded. Whether it's through the airwaves or on-screen, Julie's captivating presence and profound message bring hope, inspiration, and spiritual enrichment to viewers and listeners worldwide.\nContact Details\nENG, GBR\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com/content_1.html": "Welcome ! Shalom!\nJulie Vivienne is a Christian singer, worship minister ,speaker and TV and Radio host with Life Com Broadcasting Network UK (LCBNTV and LifeCom Radio) She is also a Christian candidate with the Christian Peoples Alliance UK\n.Home - Christian Peoples Alliance (cpaparty.net)\nAfter standing as a candidate for the Christian Peoples Alliance in Bournemouth West in the 2024 General Election, Julie formed Christian Action Dorset where Christians from across the county of Dorset from all Christian denominations can unite in praise, prayer and proclamation of The Gospel , standing for Biblical principals and ethics, and bringing counselling and prayer support as well as physical provisions for those in need. For regular info and updates on Christian Action Dorset email Julie at: christianactiondorset@gmail.com\nFollow Christian Action Dorset on Facebook.\nFor all other bookings as a singer, musician and/or speaker, email Julie at julie.vivienne@julie-vivienne.com\nSubscribe to Julie's YouTube Channel for music, Bible Teaching and Interviews.\nJULIE VIVIENNE\nCommitted Christian Julie Vivienne is a wife and a mother , an evangelistic speaker, Bible teacher, worship minister , Christian politician and candidate with The Christian Peoples Alliance UK. She helps lead worship at monthly prayer rallies with Christian Voice UK . She is a Soprano singer ,pianist, and flautist. She is a Christian TV Host on LCBNTV\nHear Julie both sing and speak on her YouTube Channel with many playlists covering singing, worship, music , Bible Teaching, Christian politics and interviews discussing the Biblical teaching on critical issues such as creation, abortion, euthanasia and the Biblical education of our children.\nJulie is a strong advocate for the sanctity of all human life from conception in the womb to a natural death. She strongly proclaims the Biblical Truth that GOD created the universe in six days around 6,000 years ago and that all human beings are created either male or female in God's image. She strongly opposes the teaching of evolution, all so called \"gender fluidity\" and the indoctrination of our children by a woke agenda in our schools.\nWith Jewish ancestry, Julie has a passion for Jewish people to know The LORD Jesus Christ or Yeshua Hamashiach in Hebrew, as their Messiah and loves Israel.\nShalom.\nJulie Vivienne Christian speaker and singer. - YouTube\nLOOKING TO BOOK JULIE?\nBook Julie as a Christian speaker or musician or both (!) for Christian conferences, Gospel crusades, Concerts, Recitals & Functions, Worship Meetings.\n\"Her powerful, warm and flexible voice is combined with a highly dramatic stage presence – always a winning combination\"-\nDavid Gillard MBE Opera Critic, Daily Mail\nTeaching, Training, Evangelism\nJulie is an experienced teacher of music for children and adults of all ages, as well as an examiner of the performing arts. However, greater than her love of music is her love for the Creator of music, the Lord GOD, through His Messiah, the Lord Jesus.\nJulie is a Christian speaker and politician with Christian Peoples Alliance UK.\nJulie is a regular TV host on LCBNTV, teaching from the Bible, giving interviews, and spending time in worship and prayer.\nImage Gallery\nGet to know Julie a little better through photos",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_booking-calendar_choir-training/content_8.html": "top of page\nLog In\nSchedule your service\nCheck out our availability and book the date and time that works for you\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_booking-calendar_tv-radio-broadcasts-live-pre-recorded/content_14.html": "top of page\nLog In\nSchedule your service\nCheck out our availability and book the date and time that works for you\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_booking-calendar_live-concerts/content_9.html": "top of page\nLog In\nSchedule your service\nCheck out our availability and book the date and time that works for you\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_service-page_julie-s-online-music-school/content_10.html": "Julie's Online Music School\nService Description\nJulie's Online Music School presents a unique opportunity for aspiring singers and musicians to hone their craft from the comfort of their own homes. Our comprehensive curriculum covers two essential pillars of musical proficiency: Singing Technique and Coaching, as well as Music Theory. Singing Technique and Coaching: Through a series of engaging video tutorials, Julie guides students through the fundamentals of vocal technique, helping them develop strength, flexibility, and control in their singing. Laying a firm foundation for any genre and style of singing, Julie will teach you how to support your voice from the diaphragm and develop a solid vocal technique suitable for casual to professional vocal practice, Julie's expert coaching empowers students to unlock their true vocal potential and express themselves with confidence and clarity. Music Theory: Delve into the language of music with Julie's insightful lessons on Music Theory. Whether you're a beginner or an experienced musician, Julie breaks down complex concepts such as harmony, rhythm, scales, and chords into digestible and practical insights. Through clear explanations, interactive exercises, and real-world examples, students gain a deeper understanding of music's inner workings, enabling them to read, write, and interpret music with fluency and precision. Join Julie's Online Music School today and embark on a journey of musical discovery and growth. Whether you're a budding vocalist or a curious music enthusiast, our accessible and engaging video tuition will equip you with the knowledge and skills you need to thrive in your musical endeavours. Whether you just want to develop your own understanding of music or you want to take music theory exams Julie can help you on your musical journey.\nContact Details\nENG, GBR",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_service-page_live-concerts/content_4.html": "Would you like to book Julie for any live concerts? her prior experience shows her to be a perfect choice.\nENG, GBR",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_about-4/content_6.html": "About Julie\nJulie graduated from The Royal Academy Of Music London in 1990\nJulie began public speaking in 1977 when she recited a poem she wrote for the Silver Jubilee of Queen Elizabeth The Second which was also published in the local paper\nShe is in demand as a soprano soloist throughout the UK for opera, oratoria, musicals, concerts and various functions ;as well as recording ,teaching and examining the performing arts. Her operatic roles include Santuzza in Mascagni's Cavalleria Rusticana,Maguerite in Gounod's Faust. Amelia in Verdi's A Masked Ball and The Governess in Britten's Turn of The Screw.\nShe has sung in numerous oratoria and sacred works including Handel's Messiah and Orff's Carmina Burana. Often in demand for German Lieder Julie sings for The Stoltz Society in London and has sung R. Strauss's Four Last Songs with orchestra three times.\nJulie sings songs by Gershwin, Cole Porter and the well loved songs from popular musicals.\nIn 2006 Julie was awarded the East Dorset Award for Outstanding Achievement for raising thousands of pounds for local charities in concerts and running music groups for young children including those with special needs.\nIn April 2010 she reached the semi final masterclasses of The Dame Kiri Te Kanawa Opera Prize on Radio 2.\nDavid Gillard MBE, Opera Critic for the Daily Mail writes:\n\"It has been a real pleasure to hear Julie at Jon Andrew’s Silhouette Opera concerts singing taxing arias by Mascagni, Verdi and Puccini – including the extremely challenging ‘In Questa Reggia’ from ‘Turandot’. She met every challenge with total assurance. Her powerful, warm and flexible voice is combined with a highly dramatic stage presence – always a winning combination. I wish her well in what I am sure will be an exciting future.\"\nhttps://soundcloud.com/julie-vivienne/julie-vivienne-singing-puccinis-vissi-darte-from-tosca\nA born again evangelical Christian, Julie is an experienced worship leader and Psalmist. She is also a Teacher of The Bible and preacher of The Gospel.\nSince 2020 Julie has been hosting a weekly live television programme on LCBN UK TV. You can join her live every Wednesday morning at 9.30 a.m UK time for Bible Teaching , Interviews or Worship and Prayer via the LCBNTV UK website or app, or on Freeview channel 271, or on YouTube and other internet formats such as Facebook TV, Instagram Twitter and TikTok. Her YouTube channel with various channels and videos are available here:\nJulie Vivienne Christian speaker and singer. - YouTube",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_service-page_choir-training/content_5.html": "top of page\nChoir Training\n1 hr1 hLocation 1\nNegotiable\nNegotiable\nService Description\nUnlock the full potential of your choir with Julie's expert Choir Training sessions. Whether you're a seasoned choir director or just starting out, Julie offers comprehensive training programs designed to enhance vocal skills, musicality, and ensemble cohesion. With years of experience as an accomplished singer and worship leader, Julie brings a wealth of knowledge and passion to each training session. Laying a firm foundation for any genre and style of singing, Julie will teach you how to support your voice from the diaphragm and develop a solid vocal technique suitable for casual to professional vocal practice\nContact Details\nENG, GBR\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_booking-calendar_live-bible-teaching/content_7.html": "top of page\nLog In\nSchedule your service\nCheck out our availability and book the date and time that works for you\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_service-page_live-bible-teaching/content_11.html": "top of page\nLive Bible Teaching\n1 hr1 hLocation 1\nNegotiable\nNegotiable\nService Description\nHire Julie for live bible teaching, She ministers both physical and emotional healing through the power of The Word of God The Bible and by the anointing of The Holy Spirit Julie loves to teach God's Word and especially likes to explore the riches and depths of the Hebrew language and Hebrew Feasts of The Lord and their fulfillment in both the first and second coming of The Messiah Jesus Julie is an anointed Psalmist and Worship Minister\nContact Details\nENG, GBR\nbottom of page",
  "https_www_julie-vivienne_com_/https_www_julie-vivienne_com_single-project/content_2.html": "top of page\nLog In\nJulies Project/Work Album\nJulie Vivienne on LCBN TV UK\nThe 12 Tribes of Israel : Admonitions And Anointing (Part 3) by Julie Vivienne on LCBN TV UK Watch on LCBN TV UK, FREEVIEW CH271, LCBN TV Channels on Apple TV,\nbottom of page"
}