{
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_behvaiourpolicy_html/content_5.html": "Aggressive or abusive behaviour\nI understand that many constituents are often upset and angry about the issues they have raised in their complaint. If that anger escalates into aggression towards my staff, I consider that unacceptable. Any violence, threats or abuse towards staff will not be tolerated.\nViolence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language (whether verbal or written) that may cause staff to feel offended, afraid, threatened or abused.\nI will judge each situation individually and appreciate individuals who come to my office may be upset. While I accept that those who contact me may feel angry, it is not acceptable to shout or swear at anyone in my office.\nUnacceptable language is that which:\n- is offensive, derogatory or patronising;\n- is discriminatory in any way, including racist, sexist, homophobic or transphobic comments; or\n- makes serious allegations that individuals have committed criminal, corrupt or perverse conduct without any evidence.\nI may decide that comments aimed not at my staff but at third parties are unacceptable because of the effect that listening or reading them may have on my staff. Examples include rudeness, offensive comments, derogatory remarks, making inflammatory statements, or raising unsubstantiated allegations made towards these third parties.\nAll threats against either my staff will be taken very seriously and if staff feel scared or threatened at any point during a conversation with a constituent, the interaction may be ended at any time.\nUnreasonable levels of contact\nSometimes the volume and duration of contact made to my office by an individual causes problems. This can occur over a short period, for example, a number of calls in one day or hour.\nIt may occur over the life-span of a complaint when a constituent repeatedly makes long telephone calls to us or inundates us with copies of information that has been sent already or that is irrelevant to the complaint.\nI consider that the level of contact has become unacceptable when the amount of time spent talking to a constituent on the telephone, or responding to, reviewing and filing emails or written correspondence impacts on my offices’ ability to deal with that complaint, or with other constituents’ complaints.\nHarassment\nMy staff have the right to carry out their duties free from harassment or threats of harassment. I ask everyone to respect that my staff are delivering a service on my behalf and therefore this may not reflect their own views or preferences.\nExamples of behaviours I consider to be harassment against my office include:\n- recording telephone discussions and publishing the information online such as through YouTube, Vimeo, Twitter or other social media;\n- contacting staff using their personal details or social media presence, including but not limited to Facebook, Twitter or LinkedIn;\n- publishing personal, sensitive or private information about staff online or other public domains such as noticeboards or newsletters.\nUnacceptable, unreasonable or excessive demands\nA demand becomes unacceptable when it starts to (or when complying with the demand would) impact substantially on the work of my office.\nExamples of this behaviour include:\n- repeatedly demanding a response within a unreasonable timescale;\n- insisting on, or refusing to, speak to a particular member of staff, when that is not possible;\n- repeatedly changing the substance of a complaint or raising unrelated concerns;\n- Making repeated and unnecessary contact during the course of us dealing with a complaint or carrying out an investigation;\n- Refusing to accept a decision where explanations for the decision have been provided.\nAn example of such impact would be that the demand takes up an excessive amount of staff time and in doing so disadvantages other constituents and prevents their own complaint from being dealt with quickly.\nUnacceptable and persistent levels of contact\nSometimes the volume and duration of contact made to our service by an individual causes problems. This can occur over a short period or over the life-span of a complaint.\nI consider that the level of contact has become unacceptable when the amount of time spent talking to a constituent on the telephone, or responding to, reviewing and filing emails or written correspondence impacts on our ability to deal with that complaint, or with other constituents’ complaints.\nUnacceptable or persistent levels of contact include:\n- Continuous contact while my office is in the process of considering a matter;\n- Repeated telephone calls over a short period, for example, a high number calls in one day or week;\n- Lengthy telephone calls repeating the same points of discussion;\n- High volumes of information provided by email or post referencing the same issues;\n- Unnecessarily or excessive copying us into emails to other parties;\n- Repeatedly attending the constituency office without an appointment, especially when asked not to do so.\nRefusal to co-operate\nWhen looking at a complaint, my office will need to ask the individual who has contacted us to work with us. This can include agreeing with us:\n- the complaint we will look at;\n- to provide us with further information, evidence or comments on request; or\n- help us by summarising their concerns.\nSometimes, an individual repeatedly refuses to co-operate and this makes it difficult for us to proceed. My office will always seek to assist someone if they have a specific, genuine difficulty complying with a request.\nHowever, it is unacceptable to bring a complaint to my office and then not respond to clear and appropriate requests by staff.\nReasonable adjustments\nI understand that some constituents may find it difficult for them to express themselves or communicate clearly, especially when they are anxious or upset. In order to do this, we ask that they explain what adjustments they’re looking for and how this will ensure they can access the service my office offers.\nMy office will always consider making reasonable adjustments for a constituent asked to do so. Examples of adjustments we can consider are:\n- we could consider using different methods of communication;\n- providing written communication in large print, coloured text, or in translation where possible;\n- giving clear warnings if conversations become unproductive and allowing constituents to opportunity to modify their behaviour before ending a call.\nHowever, I do not expect my staff to accept being subjected to aggressive, offensive, threatening or abusive actions, language or behaviour.\nI may still use the policy if there are actions or behaviours which are having a negative effect on our staff or our work even where a reasonable adjustment has been made.\nActions I may take\nWhen my office experiences behaviour or demands which are unacceptable, I may consider taking more formal action. The actions I will consider can include the following:\n- Warning the constituent about their behaviour and requesting that the constituent modifies their behaviour in future contact with us;\n- Appointing a specific point of contact for the constituent;\n- Communicating only in writing or via a representative;\n- Deciding not to investigate a complaint on the basis that it has been pursued in a way that is unacceptable.;\n- Stop all communication with a constituent for a period of time;\n- Restricting or limiting contact;\n- Reporting the matter to the Police.\nWhere it is decided that formal action must be taken to manage someone’s behaviour I or my office, will inform them of the decision in writing. A note will be placed on our records to this effect.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_01_07_new-year-spells-new-rights-for-parents,-children-and-families/content_31.html": "The Government is opening 2025 with key reforms to support families in Bracknell through the Children’s Wellbeing and Schools Bill. This law is a long-overdue reset on the rights of children.\nRead More | Bracknell News\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Jan 07, 2025 by pswallow\nThe Government is opening 2025 with key reforms to support families in Bracknell through the Children’s Wellbeing and Schools Bill. This law is a long-overdue reset on the rights of children.\nRead More | Bracknell News\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_campaigns/content_4.html": "Save Easthampstead Post Office\nPosted by pswallow\nMy petition to save the Post Office in Easthampstead\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted by pswallow\nMy petition to save the Post Office in Easthampstead\nPosted by pswallow\nMy petition to urge the Government to consider what support can be made available to secure the future of the Acoustic Couch in Bracknell This petition was presented to Parliament on the 29th April\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk/content_1.html": "More must be done to fix SEND services in Bracknell Forest\nPosted by pswallow\nOFSTED and the Care Quality Commission has put in black and white what parents have been saying for too long: more must be done to fix SEND services in Bracknell Forest. Since my election last year, I have worked with parents, schools, and colleagues in Government to raise the serious situation SEND families face. Steps in the right direction have been made, but change must be deep and lasting…",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_01_22_meet-bracknells-new-labour-mp,-peter-swallow/content_39.html": "Bracknell elected its first ever Labour MP in an historic election result on July 4.\nRead More | Bracknell News\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Jul 09, 2024 by pswallow\nBracknell elected its first ever Labour MP in an historic election result on July 4.\nRead More | Bracknell News\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_about-peter-swallow_html/content_20.html": "About Peter\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.\nPeter Swallow was elected as MP for the Bracknell constituency in July 2024.\nPeter was a university lecturer and teacher specialising in classics before entering Parliament.\nDuring the pandemic Peter taught secondary school classics and is a passionate advocate for the role of humanities education in a broad curriculum, as well as for Special Educational Needs support in schools. He is chair of the All Party Parliamentary Group for Classics, and Vice Chair of the All Party Parliamentary Group for the South East.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_01_30_bracknell-child-poverty-roundtable-letter-to-government/content_37.html": "29 January 2025\nRt Hon Bridget Phillipson MP\nDepartment for Education\nRt Hon Liz Kendall MP\nDepartment for Work and Pensions\nDear Bridget and Liz,\nLast week, I convened a Child Poverty Roundtable in my constituency of Bracknell, Crowthorne, Sandhurst, and Whitegrove, to address the growing issue of child poverty.\n10% of children in Bracknell live in relative poverty, with almost 14% of students eligible for Free School Meals. While Bracknell is a relatively prosperous part of the country, this means a significant number of young people grow up with real financial pressure. Bracknell also faces a significant challenge with wealth disparity, and some of the highest living costs in the country.\nThe roundtable brought together statutory and charity leaders from across the Borough:\nRoy Bailey – Bracknell Forest Council Cabinet Member for Children and Young People\nPhillip Bell – CEO, Involve Community Services\nEmma Cantrell MBE – CEO, First Days\nAnnabel Davis – Counsellor, Youthline\nLiz Fourie – Manager, Bracknell Foodbank\nSharon Kearins – Manager, Home-Start Bracknell Forest\nOlivia Morris – Community Investment Manager, Abri\nSarah Walker – Social Justice Lead, Kerith Church\nTogether, we discussed the causes, impact, and prevention of child poverty in our community.\nThe following key policy recommendations emerged from our discussions:\n- Appropriate resourcing: Measures which tackle the cost of living—particularly housing, energy, food, and childcare—would significantly improve the quality of life for parents and their children.\n- Fairer funding formulas: Funding systems must ensure that services supporting families in poverty are not only accessible but also sustainable, and that they meet the true cost of service delivery. Funding should also take into account that child poverty exists in every constituency in the country, even if it looks different in an area of relative prosperity.\n- Better financial education: Young people need to be equipped with the tools to make informed choices on their finances.\n- Community involvement: It’s essential that we listen to the voices of our community and allow communities to shape the support needed.\nI ask that you carefully review these recommendations, knowing that our community is deeply committed to working together to combat child poverty and improve the long-term well-being of children in our area, as the Child Poverty Taskforce continues its vital work.\nI look forward to speaking with you further about how we can work together to tackle this important issue.\nWith best wishes,\nPeter Swallow MP",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_07/content_14.html": "Meet Bracknell's new Labour MP, Peter Swallow\nPosted by pswallow\nBracknell elected its first ever Labour MP in an historic election result on July 4.\nRead More | Bracknell News\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted by pswallow\nBracknell elected its first ever Labour MP in an historic election result on July 4.\nRead More | Bracknell News\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_01_22_bracknells-mp-local-water-campaigners-are-finally-being-heard/content_35.html": "Bracknell's nature is one of its crowning joys. Now, with the Water (Special Measures) Bill, local campaigners' voices are being heard and water companies are being held to account for years of polluting.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Sep 24, 2024 by pswallow\nBracknell's nature is one of its crowning joys. Now, with the Water (Special Measures) Bill, local campaigners' voices are being heard and water companies are being held to account for years of polluting.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_tags_e-scooters/content_28.html": "E-scooters focus of meeting between police and Bracknell MP\nPosted by jsw |\nE-scooters: I met with Thames Valley Police to discuss road safety and anti-social driving. There's still more to be done on E-scooters, and discussed further measures around road safety.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_sitemap_html/content_2.html": "Email: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nHome\nAbout Peter\nHelp and Support\nSurgeries\nParliament\nNewsCampaigns\nPrivacy Policy\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.\nEmail: peter.swallow.mp@parliament.uk\nTelephone: 01344 918 198",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_tags_SEND/content_25.html": "Budget 2024: Bracknell MP 'thrilled' at £1bn SEN funding\nPosted by jsw |\nSEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted by jsw |\nSEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_tags_Bracknell/content_41.html": "Budget 2024: Bracknell MP 'thrilled' at £1bn SEN funding\nPosted by jsw |\nSEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted by jsw |\nSEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_09/content_21.html": "Local water campaigners are finally being heard\nPosted by pswallow\nBracknell's nature is one of its crowning joys. Now, with the Water (Special Measures) Bill, local campaigners' voices are being heard and water companies are being held to account for years of polluting.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_12/content_34.html": "Reflecting on this year at Christmas\nPosted by pswallow\nAs 2024 draws to a close, I want to take a moment to wish everyone in Bracknell Forest a very Merry Christmas.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted by pswallow\nAs 2024 draws to a close, I want to take a moment to wish everyone in Bracknell Forest a very Merry Christmas.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_03/content_30.html": "Taking Back Bracknell's Streets\nPosted by pswallow\nAntisocial behaviour is a blight on our communities, with residents afraid to use our underpasses, drug users hanging around near the school gates, motorised bikes tearing around our neighbourhoods, and shop workers facing an onslaught of shoplifting. I hear it every time I speak to constituents on the doors, in every advice surgery – when crimes like this go unchallenged, our fantastic community…",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_11_27_bracknells-mp-says-he-will-support-assisted-dying-bill/content_36.html": "There is no more sensitive or intimate topic than death. The End of Life Bill currently before Parliament has rightly generated a lot of scrutiny, as it proposes to fundamentally change the way some of us approach our deaths...\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Nov 27, 2024 by pswallow\nThere is no more sensitive or intimate topic than death. The End of Life Bill currently before Parliament has rightly generated a lot of scrutiny, as it proposes to fundamentally change the way some of us approach our deaths...\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_11/content_16.html": "Bracknell's MP says he will support Assisted Dying Bill\nPosted by pswallow\nThere is no more sensitive or intimate topic than death. The End of Life Bill currently before Parliament has rightly generated a lot of scrutiny, as it proposes to fundamentally change the way some of us approach our deaths...",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_10/content_27.html": "Budget 2024: Bracknell MP 'thrilled' at £1bn SEN funding\nPosted by jsw |\nSEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted by jsw |\nSEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nPosted by jsw |\nE-scooters: I met with Thames Valley Police to discuss road safety and anti-social driving. There's still more to be done on E-scooters, and discussed further measures around road safety.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_02/content_17.html": "Change is on the way for the NHS\nPosted by pswallow\nLast week I welcomed around 50 residents to a public meeting on the future of our NHS.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted by pswallow\nLast week I welcomed around 50 residents to a public meeting on the future of our NHS.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_11_04_budget-2024-bracknell-mp-sen-funding/content_33.html": "SEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Oct 30, 2024 by jsw\nSEND: The Labour government’s first budget in 14 years saw a £2.3 billion rise in the core budget for schools, which around half of which will be entirely dedicated to SEN.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_11_05_mp-seeking-views-on-possible-assisted-dying-changes/content_26.html": "Assisted dying: MPs are being given a chance to vote on a new Assisted Dying Law. I'm hosting a public consultation to encourage discussion and understanding ahead of the votes in Parliament.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Nov 05, 2024 by jsw\nAssisted dying: MPs are being given a chance to vote on a new Assisted Dying Law. I'm hosting a public consultation to encourage discussion and understanding ahead of the votes in Parliament.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_index_php/content_3.html": "More must be done to fix SEND services in Bracknell Forest\nPosted by pswallow\nOFSTED and the Care Quality Commission has put in black and white what parents have been saying for too long: more must be done to fix SEND services in Bracknell Forest. Since my election last year, I have worked with parents, schools, and colleagues in Government to raise the serious situation SEND families face. Steps in the right direction have been made, but change must be deep and lasting…",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_privacy-policy_html/content_9.html": "Email: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nI am the MP for Bracknell. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/) for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nData collection and use\nThe office of Peter Swallow MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with:\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Bracknell, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nYour rights:\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\nObtain copies of the personal information I hold about you (known as a “subject access request”)\nRequest that I correct or update any personal information held about you\nAsk that we erase or restrict the way in which I use your information\nRequest that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nAddress: Data Protection Officer, Office of Peter Swallow MP, Houses of Parliament, Westminster, London, SW1A 0AA.\nEmail: peter.swallow.mp@parliament.uk\nAlternatively you have the right to complain to the Information Commissioner’s Office (the “ICO”) if you are not satisfied with the way I use your information. You can contact the ICO by writing to Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, Cheshire SK9 5AF\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_help-and-support_html/content_12.html": "Email: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nHealth & wellbeing support for older persons\nMental health support and information\nFree and confidential support to anyone who has been bereaved\nHelping families face isolation, loneliness, poverty or disability\nHelping local people in crisis\nMobile community pantry\nThree-day emergency food supplies to people in need\nFree advice and information on benefits, debt, consumer, family, housing, immigration and health\nGuidance and support with debts\nBringing support to your local area\nGet housing advice from the council\nAdvice on living standards in privately rented accommodation.\nSupport with domestic violence.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.\nEmail: peter.swallow.mp@parliament.uk\nTelephone: 01344 918 198",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_01_28_nhs-services-and-child-poverty-top-of-the-agenda/content_32.html": "Last week The Health Secretary confirmed that Frimley Park Hospital is in the first wave of hospitals to be rebuilt. This puts Frimley in the highest priority group, with money set aside, and work scheduled.\nRead More | Bracknell News\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Jan 28, 2025 by pswallow\nLast week The Health Secretary confirmed that Frimley Park Hospital is in the first wave of hospitals to be rebuilt. This puts Frimley in the highest priority group, with money set aside, and work scheduled.\nRead More | Bracknell News\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_11_04_commemorating-remembrance-sunday/content_38.html": "Remembrance Sunday is taking place this weekend, providing an opportunity for us all to pause and reflect on this service and sacrifice.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Nov 04, 2024 by pswallow\nRemembrance Sunday is taking place this weekend, providing an opportunity for us all to pause and reflect on this service and sacrifice.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news/content_6.html": "More must be done to fix SEND services in Bracknell Forest\nPosted by pswallow\nOFSTED and the Care Quality Commission has put in black and white what parents have been saying for too long: more must be done to fix SEND services in Bracknell Forest. Since my election last year, I have worked with parents, schools, and colleagues in Government to raise the serious situation SEND families face. Steps in the right direction have been made, but change must be deep and lasting…",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_04_01_taking-back-bracknells-streets/content_7.html": "Antisocial behaviour is a blight on our communities, with residents afraid to use our underpasses, drug users hanging around near the school gates, motorised bikes tearing around our neighbourhoods, and shop workers facing an onslaught of shoplifting. I hear it every time I speak to constituents on the doors, in every advice surgery – when crimes like this go unchallenged, our fantastic community feels less safe.\nRead More",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_author_jsw/content_23.html": "MP seeking views on possible assisted dying changes\nPosted by jsw |\nAssisted dying: MPs are being given a chance to vote on a new Assisted Dying Law. I'm hosting a public consultation to encourage discussion and understanding ahead of the votes in Parliament.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_01/content_29.html": "Bracknell Child Poverty Roundtable: Letter to Government\nPosted by pswallow\n29 January 2025\nRt Hon Bridget Phillipson MP\nDepartment for Education\nRt Hon Liz Kendall MP\nDepartment for Work and Pensions\nDear Bridget and Liz,\nLast week, I convened a Child Poverty Roundtable in my constituency of Bracknell, Crowthorne, Sandhurst, and Whitegrove,…",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_12_17_reflecting-on-this-year-at-christmas/content_42.html": "As 2024 draws to a close, I want to take a moment to wish everyone in Bracknell Forest a very Merry Christmas.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Dec 17, 2024 by pswallow\nAs 2024 draws to a close, I want to take a moment to wish everyone in Bracknell Forest a very Merry Christmas.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_tags_Assisted+Dying/content_19.html": "MP seeking views on possible assisted dying changes\nPosted by jsw |\nAssisted dying: MPs are being given a chance to vote on a new Assisted Dying Law. I'm hosting a public consultation to encourage discussion and understanding ahead of the votes in Parliament.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_04/content_22.html": "More must be done to fix SEND services in Bracknell Forest\nPosted by pswallow\nOFSTED and the Care Quality Commission has put in black and white what parents have been saying for too long: more must be done to fix SEND services in Bracknell Forest. Since my election last year, I have worked with parents, schools, and colleagues in Government to raise the serious situation SEND families face. Steps in the right direction have been made, but change must be deep and lasting…",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_campaigns_2025_04_29_save-easthampstead-post-office/content_11.html": "My petition to save the Post Office in Easthampstead\nJoin me in fighting to keep Easthampstead Post Office open - this is a vital service for local residents.\nI'm working with Easthampstead councillors Paul Bidwell, Guy Gillbe, and Helen Purnell to make sure this service is protected.\nClick here to follow the latest from the campaign & sign the petition",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_04_01_change-is-on-the-way-for-the-nhs/content_8.html": "Last week I welcomed around 50 residents to a public meeting on the future of our NHS.\nParticipants shared heartrending stories of personal struggle and missed opportunities, as well as their gratitude for the daily miracles our health service performs in tough circumstances.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_surgeries_html/content_24.html": "Email: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPlease complete the form below to book a place.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.\nEmail: peter.swallow.mp@parliament.uk\nTelephone: 01344 918 198",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2025_04_01_more-must-be-done-to-fix-send-services-in-bracknell-forest/content_15.html": "OFSTED and the Care Quality Commission has put in black and white what parents have been saying for too long: more must be done to fix SEND services in Bracknell Forest. Since my election last year, I have worked with parents, schools, and colleagues in Government to raise the serious situation SEND families face. Steps in the right direction have been made, but change must be deep and lasting – and this report gives all partners a pathway to success.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_parliament_html/content_13.html": "Email: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.\nEmail: peter.swallow.mp@parliament.uk\nTelephone: 01344 918 198",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_2024_11_05_e-scooters-focus-of-meeting-police-bracknell-mp/content_40.html": "E-scooters: I met with Thames Valley Police to discuss road safety and anti-social driving. There's still more to be done on E-scooters, and discussed further measures around road safety.\nEmail: peter.swallow.mp@parliament.uk | Tel: 01344 918 198\nPosted on Oct 15, 2024 by jsw\nE-scooters: I met with Thames Valley Police to discuss road safety and anti-social driving. There's still more to be done on E-scooters, and discussed further measures around road safety.\nStanding up for Bracknell, Crowthorne, Sandhurst and Whitegrove.",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_news_author_pswallow/content_18.html": "More must be done to fix SEND services in Bracknell Forest\nPosted by pswallow\nOFSTED and the Care Quality Commission has put in black and white what parents have been saying for too long: more must be done to fix SEND services in Bracknell Forest. Since my election last year, I have worked with parents, schools, and colleagues in Government to raise the serious situation SEND families face. Steps in the right direction have been made, but change must be deep and lasting…",
  "https_peterforbracknell_co_uk/https_peterforbracknell_co_uk_campaigns_2025_04_29_acoustic-couch-petition/content_10.html": "My petition to urge the Government to consider what support can be made available to secure the future of the Acoustic Couch in Bracknell This petition was presented to Parliament on the 29th April\nMy petition to urge the Government to consider what support can be made available to secure the future of the Acoustic Couch in Bracknell\nThis petition was presented to Parliament on the 29th April"
}