{
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_newport/content_36.html": "Greens call for action as Newport named UK’s most polluting city 10th January 2023 / 10th January 2023 by Lauren James The Green Party has called for Newport City Council and the Welsh Government to ‘step up’ after Newport was named the most polluting city in the UK. Lauren James, Green Party councillor for Shaftesbury, said: “The reports that Newport has the highest CO2 emissions per head make grim but unsurprising reading. With 11 Air Quality […] Read more » Lauren James Newport\nNewport budget proposals ‘devastating blow’ to city’s vulnerable, Greens warn 23rd December 2022 / 21st December 2022 by Lauren James Newport’s most vulnerable people are bearing the brunt of the Labour administration’s proposed budget cuts, the Green Party has said. Proposals by Newport City Council include limiting residential placements for adult social care, slashing opening hours in Oaklands respite and residential care home and reducing staffing in children’s social care by 8 posts – which […] Read more » Lauren James Newport\nGreen Party reaction to Newport bin collection proposal 19th December 2022 / 21st December 2022 by Lauren James Responding to Newport City Council’s proposal to reduce bin collections to a three-weekly cycle [1], Green Party councillor for Shaftesbury Lauren James said: “If this was genuinely about increasing recycling rates, it would have been done a long time ago. This decision is entirely about service cuts. “It’s not enough to slash a service and […] Read more » Lauren James Newport",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_category_press/content_8.html": "Press releases from Gwent Green Party.\n10th January 2023 / 10th January 2023 by Lauren James\nThe Green Party has called for Newport City Council and the Welsh Government to ‘step up’ after Newport was named the most polluting city in the UK. Lauren James, Green Party councillor for Shaftesbury, said: “The reports that Newport has the highest CO2 emissions per head make grim but unsurprising reading. With 11 Air Quality […]\nRead more »\n23rd December 2022 / 21st December 2022 by Lauren James\nNewport’s most vulnerable people are bearing the brunt of the Labour administration’s proposed budget cuts, the Green Party has said. Proposals by Newport City Council include limiting residential placements for adult social care, slashing opening hours in Oaklands respite and residential care home and reducing staffing in children’s social care by 8 posts – which […]\n19th December 2022 / 21st December 2022 by Lauren James\nResponding to Newport City Council’s proposal to reduce bin collections to a three-weekly cycle [1], Green Party councillor for Shaftesbury Lauren James said: “If this was genuinely about increasing recycling rates, it would have been done a long time ago. This decision is entirely about service cuts. “It’s not enough to slash a service and […]\n13th April 2021 / 31st May 2021 by Lauren James\n6th April 2021 / 13th April 2021 by Lauren James\nGreen manifesto sets out plans to “secure Wales’ future” by building 12,000 affordable homes, a community model for healthcare and advocating for a Universal Basic Income. Their Green Transformation Fund promises to invest locally in communities and create tens of thousands of Green jobs.\n31st March 2021 / 31st May 2021 by Lauren James\nAmelia Womack leads the Green Party list for South Wales East Candidates have signed the Green Transformation Pledge for Wales\n4th April 2020 / 31st May 2021 by Lauren James\nWales Green Party is pleased to announce the selection of Gwent Green Party member Lauren James as the new Deputy Leader following a vacancy that arose last year after previous Deputy Mirka Virtanen stood down. Lauren will be joining the existing leadership team of Anthony Slaughter, Leader and Duncan Rees, her fellow Deputy Leader. Lauren […]\n4th June 2019 / 31st May 2021 by Lauren James\nWales Green Party welcome the decision announced today by First Minister Mark Drakeford that the plans for the controversial M4 relief road have been scrapped, a decision that follows many years of campaigning by the Green Party and many other organisations. Anthony Slaughter, Leader of Wales Green Party, said ‘This is absolutely the right decision […]\n6th March 2019 / 31st May 2021 by Lauren James\nThe Green Party Deputy Leader and anti-Brexit campaigner wants to see a Green New Deal in the UK similar proposals currently being proposed in the US. Amelia Womack was born and raised in Newport. The 34-year-old has been Deputy Leader of the Green Party of England and Wales since 2014. She qualified as a scientist […]\n26th November 2018 / 31st May 2021 by Lauren James\n* Amelia Womack selected as Newport West candidate in event of snap General Election * Newport born and raised Womack pledges to give voters a “real alternative to the status quo” * Womack: “Newport has been overlooked and left behind for too long” Green Party of England and Wales deputy leader Amelia Womack has been […]",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk/content_1.html": "Welcome to Gwent Green Party, the home of the Green Party in South East Wales. We are one of the most diverse regions in Wales, from the post-industrial heartlands of Torfaen, Islwyn and Blaenau Gwent in the north and west, the rolling hills of Monmouthshire to the east and the vibrant city of Newport to the south.\nWe have big ambitions, but to get a green voice heard in Gwent we need your help. You can:\n- Donate to Gwent Green Party\n- Join us\n- If you’re already a member, bring a friend to the party\n- Volunteer\n- Support our campaigns\nWe can build a Green Future in Gwent together.\nHelp get Greens elected in Gwent\nLatest News\nUpcoming Events\n- No upcoming events\nWe’re fighting for a fairer Gwent for everyone\nMake the Gwent Levels an Area of Outstanding Natural Beauty.\nHaving saved the Gwent Levels from the threat of the M4 Relief Road, our challenge now is to bring in further protection for this extraordinary landscape. Large areas of the Levels are designated as Sites of Special Scientific Interest, primarily for the rich aquatic life in the reens. But they’re also home to the rare shrill carder bee, to bitterns and cranes, as well as a wealth of plant life. Our campaign will focus on obtaining AONB status for the Levels – something that we will be doing in conjunction with other campaign groups and NGOs.\nDemand Action on Flooding\nOne year ago, floods devastated many homes and businesses in Gwent and elsewhere across Wales. Although the emergency response and support for recovery was mostly excellent, it feels like the Welsh Government has given up on preventing further flooding. We urge the Welsh Government to take urgent, bold and targeted action to protect people’s homes and livelihoods. People should not have to live in fear each time a storm is forecast.\nSuccess! M4 Relief Road Campaign\nThe threat of the relief road carving up the Gwent Levels hung over Wales for more than thirty years. We campaigned against this…\nAnd we won! Despite the Public Inquiry finding in favour of the road the First Minister had clearly been listening to the arguments put forward by the Green Party and other campaigning groups – as well as his own Future Generations Commissioner – and he concluded that this ill-conceived scheme had no place in 21st Century Wales.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2023_02_01_ians-column-february-2023/content_13.html": "Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine\nI love the first signs of Spring – lambs, snowdrops and earlier sunrises – but over the last month we have also had periods of extreme cold and a few days of potential flooding. As the rivers were rising, council staff and emergency services were on 24/7 standby, ready to evacuate residents in Monmouth and Skenfrith if needed. Fortunately, there was only limited flooding and the council quickly turned to clearing up the mess left by all the water.\nOne of the impacts of cold and rain is on our roads. All over the ward, residents have been contacting me about potholes and crumbling verges. I report every case to the highways team, but I’m conscious that they don’t have the capacity to repair them all and so the waiting list is growing. Given the impending cuts to council budgets, the situation is likely to get worse.\nBecause of rising inflation and increased demand for some council services, the council has faced a potential £26 million shortfall for 23/24 if it is to do the same as this year. Increased support from the Welsh government has reduced that gap to around £11 million. The Labour administration is proposing to address the gap by increasing council tax by 5.95% and reducing spending in a number of areas. There is no easy answer to balancing the books and every choice will make some unhappy. My main concern is that big cuts to the social care budget will affect some of our most vulnerable residents. You can find out more and have your say at https://www.monmouthshire.gov.uk/budget-2023-2024/ .\nAt the last council meeting, I joined with Independent and Conservative councillors to vote down Labour’s proposed ‘Community and Corporate Plan’ which sets out their priorities for the council until the next election in 2027. While I thought the plan takes us in the right direction, it did not provide enough specifics on what they want to achieve and what they would prioritise if hard choices are needed. Given this, we could not support the plan. I am meeting with the leaders of all other parties later this week to see if we can work together to produce a better plan.\nWarm wishes,\nIan",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_contact/content_4.html": "Skip to content\nSkip to footer\nGwent\nMenu\nGeneral Election 2024\nVolunteer\nNews\nPress\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_donate/content_18.html": "A Green Future for Gwent begins here.\nIn May Greens got our best results yet in a Senedd election, breaking vote records not just in South Wales East, but across Wales.\nSince then, we’ve been working hard in communities up and down the country to make change happen in a way that has real impact for residents’ lives day to day.\nWith your support, this can continue with even more people having the chance to be represented by a party that puts community front and centre, invests in the services you value and makes people and planet the top priorities – always.\nWe’re able to keep acting for people and planet thanks to grassroots supporters like you.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2021_04_13_greens-slam-welsh-waters-illegal-sewage-dump/content_7.html": "- “This complacency by the government is why we need Green Party voices in the Senedd”\nResidents in Monmouthshire are shocked at BBC Panorama’s revelations that Welsh Water have illegally dumped untreated sewage into the River Usk on 12 consecutive days in December.\nThe Usk is supposed to be a protected river, as it is a Site of Special Scientific Interest and a Special Area of Conservation. The Rivers Trust advises people not to enter the water immediately downstream of where treated sewage is released, and to avoid the overflow areas, especially after wet weather.\n“This is completely unacceptable” responded Ian Chandler, the Green Party’s Senedd candidate for Monmouth. “The Welsh Government and Welsh Water must do much better to protect the health of swimmers, wildlife and local communities along the river. This complacency by the government is why we need Green Party voices in the Senedd”.\nNotes\nhttps://www.bbc.co.uk/news/uk-56721660\nFor more information, contact Lauren James, lauren.james@greenparty.org.uk, 07825 699 023\nENDS",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2020_10_14_help-stop-the-pollution-of-wye-usk-and-monnow-rivers/content_42.html": "Our rivers Wye, Usk, Lugg and Monnow are being blighted by pollution. As Greens in Gwent, Powys and Herefordshire, we want to work across borders to tackle the sources of pollution and clean up our rivers.\nJoin our meeting to hear more about what is causing the problem and discuss how we can campaign for better regulation and enforcement.\nAll members and supporters welcome on Monday 19th October at 7pm. Together we can stop the pollution and clean up our rivers – I hope you will join us.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2022_12_01_december-2022/content_15.html": "Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s Parish Magazine\nRising inflation and interest rates are impacting on households, especially those on low or fixed incomes who have little to cushion themselves against these economic shocks. You can get advice on what support is available to you by visiting one of the Community Hubs or calling Monmouthshire Council on 01633 644644. You can also contact Citizens Advice on 0800 702 2020. Note that the UK Government has not yet announced how it will pay the £200 ‘alternative fuel payment’ for those of us using oil to heat our homes and water – hopefully this will be clearer soon.\nMonmouthshire Council is also facing its own financial challenges due to rising costs and an increased demand for the services it provides to vulnerable people.\nThis financial year it has a shortfall of nearly £9 million that council officers are trying to recover by savings on public services that were already lean after years of austerity. The budget for this financial year was set by the previous Conservative administration in March, when they agreed a council tax increase of 2.95% while inflation was already at 7% and rising.\nThe situation for 2023/24 looks worse with a projected shortfall of around £23 million. By mid-December there should be greater clarity on the cost of nationally agreed pay awards and what financial support the Welsh government will give following the UK government’s latest budget. The current Labour administration will consult Monmouthshire residents on its proposed budget in January. Inevitably, all councils in the UK are likely to introduce council tax rises and cuts to services.\nI’m sorry to be sharing such worrying news in the lead up to Christmas. Please look out for each other and support those who are struggling in these difficult times.\nWarmest wishes,\nCllr Ian Chandler\nIanChandler@monmouthshire.gov.uk\nTel: 01291 448270\nTwitter: @Ian_Chandler\nFacebook: IanChandlerGreen",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2022_12_23_newport-budget-proposals-devastating-blow-to-citys-vulnerable-greens-warn/content_38.html": "Newport’s most vulnerable people are bearing the brunt of the Labour administration’s proposed budget cuts, the Green Party has said.\nProposals by Newport City Council include limiting residential placements for adult social care, slashing opening hours in Oaklands respite and residential care home and reducing staffing in children’s social care by 8 posts – which council officers say will have a significant negative impact on children living in poverty.\nGreen councillor Lauren James said “Children and adult services are already on a knife edge, yet they are bearing the brunt of the council’s proposed cuts.\n“This budget proposal will come as a devastating blow to some of the city’s most vulnerable people.\n“This is essential preventative support and cutting it will put greater burden on our already overstretched schools, health and police services.\n“Newport could see an increase in children in care, people in poor health, antisocial behaviour and crime if the council withdraw these lifelines. These services must be protected.”\nENDS\nNotes",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_author_lauren-james_page_2/content_43.html": "4th April 2020 / 31st May 2021 by Lauren James\nWales Green Party is pleased to announce the selection of Gwent Green Party member Lauren James as the new Deputy Leader following a vacancy that arose last year after previous Deputy Mirka Virtanen stood down. Lauren will be joining the existing leadership team of Anthony Slaughter, Leader and Duncan Rees, her fellow Deputy Leader. Lauren […]\nRead more »\n6th October 2019 / 31st May 2021 by Lauren James\nCynhadledd, croeso i Gasnewydd, croeso i Gymru. Conference, welcome to Newport, welcome to Wales. Conference, these are troubling times. With our democracy in crisis and at a time of Climate Emergency our Green voice is needed more than ever. Our political system is broken with Johnson and his Bullingdon bully boys intent on defying Parliament […]\n4th June 2019 / 31st May 2021 by Lauren James\nWales Green Party welcome the decision announced today by First Minister Mark Drakeford that the plans for the controversial M4 relief road have been scrapped, a decision that follows many years of campaigning by the Green Party and many other organisations. Anthony Slaughter, Leader of Wales Green Party, said ‘This is absolutely the right decision […]\n7th April 2019 / 31st May 2021 by Lauren James\nCongratulations to Green Party of England and Wales’s Deputy Leader Amelia Womack, who secured our highest ever vote share in the Newport West by-election. This shows that the appetite for Green politics is growing in Wales, and for good reason. The IPCC report showed us that we have just 12 years to avoid catastrophic climate […]\n6th March 2019 / 31st May 2021 by Lauren James\nThe Green Party Deputy Leader and anti-Brexit campaigner wants to see a Green New Deal in the UK similar proposals currently being proposed in the US. Amelia Womack was born and raised in Newport. The 34-year-old has been Deputy Leader of the Green Party of England and Wales since 2014. She qualified as a scientist […]\n26th November 2018 / 31st May 2021 by Lauren James\n* Amelia Womack selected as Newport West candidate in event of snap General Election * Newport born and raised Womack pledges to give voters a “real alternative to the status quo” * Womack: “Newport has been overlooked and left behind for too long” Green Party of England and Wales deputy leader Amelia Womack has been […]",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_lauren-james/content_39.html": "Greens call for action as Newport named UK’s most polluting city 10th January 2023 / 10th January 2023 by Lauren James The Green Party has called for Newport City Council and the Welsh Government to ‘step up’ after Newport was named the most polluting city in the UK. Lauren James, Green Party councillor for Shaftesbury, said: “The reports that Newport has the highest CO2 emissions per head make grim but unsurprising reading. With 11 Air Quality […] Read more » Lauren James Newport\nNewport budget proposals ‘devastating blow’ to city’s vulnerable, Greens warn 23rd December 2022 / 21st December 2022 by Lauren James Newport’s most vulnerable people are bearing the brunt of the Labour administration’s proposed budget cuts, the Green Party has said. Proposals by Newport City Council include limiting residential placements for adult social care, slashing opening hours in Oaklands respite and residential care home and reducing staffing in children’s social care by 8 posts – which […] Read more » Lauren James Newport\nGreen Party reaction to Newport bin collection proposal 19th December 2022 / 21st December 2022 by Lauren James Responding to Newport City Council’s proposal to reduce bin collections to a three-weekly cycle [1], Green Party councillor for Shaftesbury Lauren James said: “If this was genuinely about increasing recycling rates, it would have been done a long time ago. This decision is entirely about service cuts. “It’s not enough to slash a service and […] Read more » Lauren James Newport\nGwent Green Party announce candidates for Senedd elections 31st March 2021 / 31st May 2021 by Lauren James Amelia Womack leads the Green Party list for South Wales East Candidates have signed the Green Transformation Pledge for Wales Read more » Amelia Womack Ian Chandler Lauren James Senedd 2021 Stephen Priestnall",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_author_harrietking/content_31.html": "1st April 2023 / 16th June 2023 by harrietking\nRead more »\n1st March 2023 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine Dydd Gŵyl Dewi Sant Hapus! This month I’d like to talk about how we get around our neighbourhoods and to and from our nearby towns. Without any scheduled buses in our area, those unable to drive or who cannot afford to […]\n1st February 2023 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine I love the first signs of Spring – lambs, snowdrops and earlier sunrises – but over the last month we have also had periods of extreme cold and a few days of potential flooding. As the rivers were rising, council staff […]\n1st December 2022 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s Parish Magazine Rising inflation and interest rates are impacting on households, especially those on low or fixed incomes who have little to cushion themselves against these economic shocks. You can get advice on what support is available to you by visiting one of […]\n1st November 2022 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for Llantilio Crossenny Parish Magazine As a County Councillor, I represent residents in the Llantilio Crossenny ward, which covers the area between Skenfrith, Rockfield, Penrhos and Llanvetherine. Labour have 22 of the 46 council seats, one short of a majority. As the largest party they have formed a minority administration, […]",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2019_04_07_highest-ever-vote-share-in-newport-west/content_21.html": "Congratulations to Green Party of England and Wales’s Deputy Leader Amelia Womack, who secured our highest ever vote share in the Newport West by-election.\nThis shows that the appetite for Green politics is growing in Wales, and for good reason. The IPCC report showed us that we have just 12 years to avoid catastrophic climate breakdown, and while Wales is leading the way in the UK, our representatives in Westminster and the Senedd still aren’t doing enough.\nThere is only one party who can offer the change we need. Join the Green Party of England and Wales to stand for what you stand on.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_ian-chandler/content_11.html": "Ian’s column – April 2023 1st April 2023 / 16th June 2023 by harrietking Read more » Ian Chandler Monmouthshire\nIan’s column – March 2023 1st March 2023 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine Dydd Gŵyl Dewi Sant Hapus! This month I’d like to talk about how we get around our neighbourhoods and to and from our nearby towns. Without any scheduled buses in our area, those unable to drive or who cannot afford to […] Read more » Ian Chandler Monmouthshire\nIan’s column – February 2023 1st February 2023 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine I love the first signs of Spring – lambs, snowdrops and earlier sunrises – but over the last month we have also had periods of extreme cold and a few days of potential flooding. As the rivers were rising, council staff […] Read more » Ian Chandler Monmouthshire\nIan’s monthly column for December 2022 1st December 2022 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s Parish Magazine Rising inflation and interest rates are impacting on households, especially those on low or fixed incomes who have little to cushion themselves against these economic shocks. You can get advice on what support is available to you by visiting one of […] Read more » Ian Chandler Monmouthshire\nIan’s monthly column for November 2022 1st November 2022 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for Llantilio Crossenny Parish Magazine As a County Councillor, I represent residents in the Llantilio Crossenny ward, which covers the area between Skenfrith, Rockfield, Penrhos and Llanvetherine. Labour have 22 of the 46 council seats, one short of a majority. As the largest party they have formed a minority administration, […] Read more » Ian Chandler Monmouthshire\nGreens slam Welsh Water’s illegal sewage dump 13th April 2021 / 31st May 2021 by Lauren James Read more » Ian Chandler Monmouthshire pollution\nGwent Green Party announce candidates for Senedd elections 31st March 2021 / 31st May 2021 by Lauren James Amelia Womack leads the Green Party list for South Wales East Candidates have signed the Green Transformation Pledge for Wales Read more » Amelia Womack Ian Chandler Lauren James Senedd 2021 Stephen Priestnall",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_author_lauren-james/content_27.html": "10th January 2023 / 10th January 2023 by Lauren James\nThe Green Party has called for Newport City Council and the Welsh Government to ‘step up’ after Newport was named the most polluting city in the UK. Lauren James, Green Party councillor for Shaftesbury, said: “The reports that Newport has the highest CO2 emissions per head make grim but unsurprising reading. With 11 Air Quality […]\nRead more »\n23rd December 2022 / 21st December 2022 by Lauren James\nNewport’s most vulnerable people are bearing the brunt of the Labour administration’s proposed budget cuts, the Green Party has said. Proposals by Newport City Council include limiting residential placements for adult social care, slashing opening hours in Oaklands respite and residential care home and reducing staffing in children’s social care by 8 posts – which […]\n19th December 2022 / 21st December 2022 by Lauren James\nResponding to Newport City Council’s proposal to reduce bin collections to a three-weekly cycle [1], Green Party councillor for Shaftesbury Lauren James said: “If this was genuinely about increasing recycling rates, it would have been done a long time ago. This decision is entirely about service cuts. “It’s not enough to slash a service and […]\n16th August 2022 / 16th August 2022 by Lauren James\nFollowing our AGM, we have a newly elected Gwent Green Party committee. Thank you to everyone who put themselves forward. Welcome to new committee members and welcome back to those returning! Chair – Lauren James Treasurer – Ann Were Fundraising Officer – Kerry Vosper Election Returns Officer – Philip Davies Communications Officer – Tanya Sinnett, […]\n13th April 2021 / 31st May 2021 by Lauren James\n6th April 2021 / 13th April 2021 by Lauren James\nGreen manifesto sets out plans to “secure Wales’ future” by building 12,000 affordable homes, a community model for healthcare and advocating for a Universal Basic Income. Their Green Transformation Fund promises to invest locally in communities and create tens of thousands of Green jobs.\n31st March 2021 / 31st May 2021 by Lauren James\nAmelia Womack leads the Green Party list for South Wales East Candidates have signed the Green Transformation Pledge for Wales\n23rd November 2020 / 31st May 2021 by Lauren James\n2020 has been a challenging year for all of us. But it has also given us the strength to make sure that 2021 will be the year we get Amelia Womack elected as our first Green Party member of the Senedd. As priority region for Wales we have the resources we need to support campaigns, […]\n14th October 2020 / 31st May 2021 by Lauren James\nOur rivers Wye, Usk, Lugg and Monnow are being blighted by pollution. As Greens in Gwent, Powys and Herefordshire, we want to work across borders to tackle the sources of pollution and clean up our rivers. Join our meeting to hear more about what is causing the problem and discuss how we can campaign for […]\n5th September 2020 / 31st May 2021 by Lauren James\nWe hope you are well and safe. The recent heatwave followed by storms and flash floods in parts of Gwent have reminded us that the climate crisis has not gone away while our attention has been focussed on the Covid-19 pandemic. We are busy building our campaign for the Senedd elections which take place next […]",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_senedd-2021/content_10.html": "Greens launch Senedd manifesto in Newport 6th April 2021 / 13th April 2021 by Lauren James Green manifesto sets out plans to “secure Wales’ future” by building 12,000 affordable homes, a community model for healthcare and advocating for a Universal Basic Income. Their Green Transformation Fund promises to invest locally in communities and create tens of thousands of Green jobs. Read more » Amelia Womack Senedd 2021\nGwent Green Party announce candidates for Senedd elections 31st March 2021 / 31st May 2021 by Lauren James Amelia Womack leads the Green Party list for South Wales East Candidates have signed the Green Transformation Pledge for Wales Read more » Amelia Womack Ian Chandler Lauren James Senedd 2021 Stephen Priestnall\nPeople of Gwent – We’re Listening 5th September 2020 / 31st May 2021 by Lauren James We hope you are well and safe. The recent heatwave followed by storms and flash floods in parts of Gwent have reminded us that the climate crisis has not gone away while our attention has been focussed on the Covid-19 pandemic. We are busy building our campaign for the Senedd elections which take place next […] Read more » Senedd 2021",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2020_09_05_people-of-gwent-were-listening/content_41.html": "We hope you are well and safe. The recent heatwave followed by storms and flash floods in parts of Gwent have reminded us that the climate crisis has not gone away while our attention has been focussed on the Covid-19 pandemic.\nWe are busy building our campaign for the Senedd elections which take place next May. There will be lots of opportunities to get involved – we will need as much help from you as you can give – and you will hear more in future newsletters and at our meetings.\nThe first action we would love you to take is to tell us which issues matter most to you by completing our Listening to people in Gwent survey.\nTake the survey\nWhen you have taken the survey, please share it widely with your family, friends, neighbours and colleagues. The more voices we hear from, the better able we will be to campaign on their behalf.\nNow more than ever we need to make the right decisions about the kind of world we all want to live in. We want to know what’s important to the people of Gwent – and there are well over half a million of us.\nThis survey will help us to understand what’s at the top of your agenda right now.\nWe have asked you about your thoughts on 8 topics that we think might be important to you. Some are local, some are national and some global. We’d like to understand how important YOU believe they are to you. This will help us prioritise our campaigning to make the differences people most want to see.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2022_12_19_green-party-reaction-to-newport-bin-collection-proposal/content_37.html": "Responding to Newport City Council’s proposal to reduce bin collections to a three-weekly cycle [1], Green Party councillor for Shaftesbury Lauren James said:\n“If this was genuinely about increasing recycling rates, it would have been done a long time ago. This decision is entirely about service cuts.\n“It’s not enough to slash a service and hope it increases recycling. Newport is already the worst place in Wales for fly-tipping and litter is a huge problem. What’s going to happen when people can’t get rid of their waste?\n“If they are serious about increasing our city’s recycling rates then they must improve their recycling offer, not take services away which some families are dependent on.”\nNotes",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2019_06_04_wales-green-party-welcomes-m4-decision/content_16.html": "Wales Green Party welcome the decision announced today by First Minister Mark Drakeford that the plans for the controversial M4 relief road have been scrapped, a decision that follows many years of campaigning by the Green Party and many other organisations.\nAnthony Slaughter, Leader of Wales Green Party, said ‘This is absolutely the right decision and one that should have made several years ago. At a time when the climate emergency is being recognised at every level of government it would have been an act of criminal folly to go ahead with a road building scheme based on 1970’s transport policy and a betrayal of future generations.\nWe hope that this decision is followed by meaningful action to create a sustainable transport system fit for the twenty first century. Urgent action is needed to reduce our carbon emissions and tackle the air pollution crisis.’\nDeputy leader of the Green Party Amelia Womack, who campaigned on this issue in the recent Newport West by election, added ‘This is fantastic news that the First Minister will scrap the M4 relief road. This is a powerful action to protect our precious biodiversity as well as to ensure we’re tackling our carbon emissions, so we remain below 1.5 degrees of warming.\nDrakeford now needs to ensure that there’s proper investment in public transport networks to reduce the volume of traffic and help reduce congestion in the area.’",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_volunteer/content_12.html": "A Green Future for Gwent begins here.\nGetting Greens elected would be transformative.\nBut we can only do that with enough volunteers.\nWe urgently need volunteers to help us with a few key tasks.\nYou’ll be fully trained and can volunteer remotely.\nThank you.\nSupporter Roles Available\nHere’s a little more information about the ways you can support us:\n- Social media: using clear guidelines, you can help our social media team by keeping an eye out for things to post about, and drafting some text.\n- Petitions and events: you can help our campaigns team by creating petitons and events to support our campaigns.\n- Graphics and video: you can support our social media and campaigns teams by creating graphics using our templates as a guide.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2022_11_01_november-2022/content_14.html": "Cllr Ian Chandler’s monthly column for Llantilio Crossenny Parish Magazine\nAs a County Councillor, I represent residents in the Llantilio Crossenny ward, which covers the area between Skenfrith, Rockfield, Penrhos and Llanvetherine.\nLabour have 22 of the 46 council seats, one short of a majority. As the largest party they have formed a minority administration, relying on support from opposition councillors to get their policies and plans agreed. The Conservatives have 18 members and tend to vote as a block. As the sole Green Party Councillor, I sit with the five independent Councillors and we discuss each proposal on their merits before individually deciding how to vote.\nAt the last council meeting, the Labour cabinet proposed an interim Community and Corporate Plan but we decided it lacked sufficient detail and asked them to come back with a fuller plan in January. This is in the context of a worrying financial position. All councils in Wales are having to deal with high inflation plus increasing demand for services as the cost of living crisis bites, while not knowing how much money the UK Government will be providing to pay for essential services.\nI sit on two key Scrutiny committees: The Place Scrutiny committee examines the administration’s proposed plans on all areas other than education and social care. The Performance & Overview committee scrutinises the council’s budgets and how well it is performing against the agreed plans. I also sit on Governance & Audit committee to ensure that the council has effective financial and other control measures in place.\nMuch of my time is spent supporting local residents and raising issues they are concerned about with the relevant council department. This has included planning matters, broadband access, potholes, traffic speeds, support for those hosting Ukrainian refugees, and much more.\nIn the ward there are two Community Councils (what used to be called Parish Councils). The southern half of the ward is Whitecastle Community Council and the northern part of Skenfrith Community Council. Both of the community councils have vacancies for members. If you are interested in being co-opted so you can speak up for your local community, please contact me and I can give you more information.\nThank you for reading this. I plan to write a short column each month highlighting council issues relevant to our area. Please contact me if there is anything I can do to help you.\nBest wishes,\nCllr Ian Chandler\nianchandler@monmouthshire.gov.uk\n01291 448270",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2022_08_16_welcome-to-our-new-committee/content_20.html": "Following our AGM, we have a newly elected Gwent Green Party committee.\nThank you to everyone who put themselves forward. Welcome to new committee members and welcome back to those returning!\n- Chair – Lauren James\n- Treasurer – Ann Were\n- Fundraising Officer – Kerry Vosper\n- Election Returns Officer – Philip Davies\n- Communications Officer – Tanya Sinnett, Clive Shakesheff, Matthew Barney (job share)\n- Membership Secretary – Stephen Gray, Daniel Harvey (job share)\n- Newport Coordinator – Lauren James\n- Monmouthshire Coordinator – Ian Chandler\n- Torfaen Coordinator – Phil Davies\nNominations are now open for coordinators for Blaenau Gwent, Caerphilly and Merthyr Tydfil – so get in touch with Lauren by emailing chair@gwent.greenparty.wales if you’d like more information.\nDon’t want a named role but want to get involved? Volunteer here.\nUnable to volunteer? Donate now to help us #GetGreensElected.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_monmouthshire/content_5.html": "Ian’s column – April 2023 1st April 2023 / 16th June 2023 by harrietking Read more » Ian Chandler Monmouthshire\nIan’s column – March 2023 1st March 2023 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine Dydd Gŵyl Dewi Sant Hapus! This month I’d like to talk about how we get around our neighbourhoods and to and from our nearby towns. Without any scheduled buses in our area, those unable to drive or who cannot afford to […] Read more » Ian Chandler Monmouthshire\nIan’s column – February 2023 1st February 2023 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine I love the first signs of Spring – lambs, snowdrops and earlier sunrises – but over the last month we have also had periods of extreme cold and a few days of potential flooding. As the rivers were rising, council staff […] Read more » Ian Chandler Monmouthshire\nIan’s monthly column for December 2022 1st December 2022 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s Parish Magazine Rising inflation and interest rates are impacting on households, especially those on low or fixed incomes who have little to cushion themselves against these economic shocks. You can get advice on what support is available to you by visiting one of […] Read more » Ian Chandler Monmouthshire\nIan’s monthly column for November 2022 1st November 2022 / 14th March 2023 by harrietking Cllr Ian Chandler’s monthly column for Llantilio Crossenny Parish Magazine As a County Councillor, I represent residents in the Llantilio Crossenny ward, which covers the area between Skenfrith, Rockfield, Penrhos and Llanvetherine. Labour have 22 of the 46 council seats, one short of a majority. As the largest party they have formed a minority administration, […] Read more » Ian Chandler Monmouthshire\nGreens slam Welsh Water’s illegal sewage dump 13th April 2021 / 31st May 2021 by Lauren James Read more » Ian Chandler Monmouthshire pollution",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_pollution/content_33.html": "Greens slam Welsh Water’s illegal sewage dump 13th April 2021 / 31st May 2021 by Lauren James Read more » Ian Chandler Monmouthshire pollution",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2019_10_06_newport-gpew-conference-2019-anthony-slaughters-speech/content_40.html": "Cynhadledd, croeso i Gasnewydd, croeso i Gymru.\nConference, welcome to Newport, welcome to Wales.\nConference, these are troubling times. With our democracy in crisis and at a time of Climate Emergency our Green voice is needed more than ever.\nOur political system is broken with Johnson and his Bullingdon bully boys intent on defying Parliament and dragging us over the dangerous cliff edge of a no deal Brexit, trashing communities, livelihoods and endangering peace in Ireland.\nIncreasing extreme weather events here and across the planet, together with the biodiversity crisis, highlight the devastating impacts of the climate emergency and the challenging future we face.\nIn the face of these challenges we see the tired old parties continuing to fight the battles of yesterday, refusing to acknowledge that business as usual is no longer an option. This is why we are seeing increasing numbers of people turning to the Greens. Here and across Europe the Green wave is growing as people recognise and share our desire for a cleaner world and a fairer society. A vote for the Green Party is a vote for the future.\nHere in Wales we have our own perspective on these challenges as we have seen the impacts and potential of the National Assembly for Wales, currently celebrating twenty years of devolution. As a party with a core value of devolving power to a local level Wales Green Party strongly supports all calls for increased devolution of powers to the Senedd, up to and including full independence if voted for by the people of Wales in any future referendum. As Westminster becomes increasingly inward looking and appears indifferent to the fate of a post Brexit Wales it is no surprise that many people are beginning to imagine a different future away from Westminster.\nWales Green Party also welcomes the recent legislation that will give sixteen- and seventeen-year olds the vote at the next Assembly election. A longstanding Green policy this will greatly boost democratic participation and opportunities for new thinking, and we will continue to campaign for votes at sixteen in all elections.\nAs a nation with many coastal communities at risk of flooding due to rising sea levels and an agricultural sector threatened by extreme weather events, people in Wales are acutely aware of the need for meaningful action to tackle the climate crisis. This was recognised by Wales becoming the first nation to declare a Climate Emergency with many councils following this lead. As Greens we will work within our communities and with every level of government to ensure that these welcome words translate into meaningful action.\nHere in Wales we also have the ground-breaking Well-being of Future Generations Act, passed by the Welsh Government in 2015. This unique piece of legislation should be and could be a game changer and the welcome scrapping of the planned M4 relief road earlier this year was a hopeful sign that the implications of the Act are finally influencing policy. Yet policy and decision making in so many areas still lag woefully behind.\nAt a time of biodiversity crisis, we see communities across Wales, like Dinas Powys in the Vale of Glamorgan, fighting the proposed destruction of valuable ancient woodland for the construction of an unnecessary, over engineered dam. Business as usual.\nAt a time of Climate Emergency, we see Welsh Government ministers boasting of increased air traffic from Cardiff airport, pushing for airport expansion and bidding for new routes such as Cardiff to London, Cardiff to Manchester. Business as usual.\nThis is why we need Green elected representation so urgently at every level of government in Wales. Greens holding decision makers to account. Greens helping shape a cleaner, greener, fairer future. Greens doing things differently. Business as usual is no longer an option.\nElected Greens in Wales will deliver a Green New Deal for Wales, ensuring a just transition for previously abandoned communities. Elected Greens will renew our democracy with a new vision for prosperity without unsustainable growth, a vision that will address the grinding poverty and inequality so widespread across the country.\nIn less than two years’ time Wales Green Party will be contesting the National Assembly for Wales elections. We are on track to get our first elected Greens onto the last legislative body in the UK without Green representation. This will be a game changer. With your help and support we will get the elected representation that Wales so desperately needs.\nThank you, Diolch",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2023_04_01_ians-column-april-2023/content_6.html": "Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine\nThe Council’s budget for 2023/24 was passed in March at the second attempt after much vigorous debate. Although it is an increase on the budget for this year, the impact of inflation and increased demand for services (particularly social care) mean that it actually represents a significant cut in real terms.\nI objected to the first budget proposed by the cabinet as I felt that our most vulnerable members of our community would feel the brunt of the cuts to services. This led to the cabinet withdrawing cuts to the educational psychology team and delaying a million pounds worth of cuts to social care. The below-inflation rise of 5.95% in Council Tax is a compromise, recognising that some residents are struggling with the cost of living crisis while wanting to safeguard services as much as possible.\nIt is going to be a tough year, so please look out for your neighbours and ensure you and they get the support you are entitled to. Information is on the Council’s website or you can phone 01633 644644. You can also contact Citizens Advice on 0800 702 2020.\nI will continue to scrutinise the council’s spending to ensure that there is no waste and it gives value for money for residents. Unfortunately that hasn’t always been the case. More than five years ago, part of the road between Cross Ash and Skenfrith was washed away. The council rented some ‘temporary’ traffic lights until it repaired the road. Those lights are still there and I found out that they have cost the council £124,507. The Daily Mail and BBC have covered my story, which will hopefully lead to some rapid action by the council.\nAs always, please get in touch if you have any concerns that I can help with.\nBest wishes,\nIan\nTel: 01291 448270\nEmail: ianchandler@monmouthshire.gov.uk\nFacebook: ianchandlergreen\nTwitter: Ian_Chandler",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2023_01_10_greens-call-for-action-as-newport-named-uks-most-polluting-city/content_35.html": "The Green Party has called for Newport City Council and the Welsh Government to ‘step up’ after Newport was named the most polluting city in the UK.\nLauren James, Green Party councillor for Shaftesbury, said:\n“The reports that Newport has the highest CO2 emissions per head make grim but unsurprising reading.\nWith 11 Air Quality Management Areas, you’d be forgiven for expecting clear and decisive action from Newport City Council and the Welsh Government – but delivery on the Burns recommendations continues to be hit by delays and the council still hasn’t published the Air Quality Progress report for 2021.\nResidents can’t use a network of alternatives that doesn’t exist yet. The council and Welsh Government have got to step up.”\nENDS\nNotes\n- Argus report Newport most polluting city in the UK\n- Newport City Council Air Quality page (the title of the most recent report says 2021 but actually covers the year 2020)",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2019_03_06_green-newport-west-candidate-calls-for-green-new-deal-for-newport/content_23.html": "The Green Party Deputy Leader and anti-Brexit campaigner wants to see a Green New Deal in the UK similar proposals currently being proposed in the US.\nAmelia Womack was born and raised in Newport. The 34-year-old has been Deputy Leader of the Green Party of England and Wales since 2014. She qualified as a scientist in 2007 and has since worked with businesses to deliver social and environmental change in communities.\n“The Green Party has been talking about a Green New Deal for the last ten years. It’s amazing to see Alexandria Ocasio-Cortez bringing this to life in the U.S. This has inspired me, as well as the wider Green Party, to get it back on the agenda here, starting with this byelection.”\nThe Green New Deal takes its inspiration from Roosevelt’s New Deal of the 1930s, which used massive investment in jobs and infrastructure to pull the US out of the Great Depression.\nA Green New Deal would mobilise resources on a scale unprecedented in peacetime to tackle the climate emergency and address spiralling inequality. It would involve huge investment in clean energy, warm homes and affordable public transport – delivering a decent, well-paid job to everyone who wants one. It would rebuild once proud communities that have been hollowed out by deindustrialisation and austerity, allowing them to thrive as part of a collective endeavour to protect the planet. And it would protect and restore threatened habitats and carbon sinks like forests, wild places, soils and oceans.\n“Newport has higher unemployment than many places and lots of empty properties. A Green New Deal in Wales would create thousands of jobs in Newport in exciting industries which are growing around the world. We have seen ten years of austerity now which clearly hasn’t worked. A Green New Deal would create jobs, help people out of poverty and give the Newport economy a massive boost.”\nIf Amelia is elected in Newport West she would be joining Caroline Lucas who has been a Member of Parliament since 2010. Caroline was elected on a manifesto based on the Green New Deal and is backing Amelia’s campaign. Caroline said:\n“The Green Party urgently needs more voices in Westminster and Amelia would be a powerful voice for the people of Newport. We have a fast closing window of opportunity to act to avoid the worst impacts of the climate crisis, and young people in particular are starting to demand that their voices be heard. I hope Amelia will join me soon in Westminster to help deliver a Green New Deal, which would see a massive increase in green investment alongside the creation of hundreds of thousands of good quality jobs.”\nAmelia is co-founder of Another Europe and has been campaigning for a People’s Vote. The by-election will be held just days after the proposed date for leaving the European Union.\n“We have seen two years of chaos in Westminster. Scientists now accept we have until 2030 to take positive action to avoid climate breakdown. We need politicians who do their jobs and take this threat seriously rather than wasting time.”\nAmelia grew up in Newport and says that Paul Flynn was an inspiration to her when she was young, leading to her getting involved in politics.\n“I am proud of the rich history and resilience of my home. Newport West has had a radical free-thinking MP and I am ready to continue in Paul’s footsteps.”",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_general-election-2024/content_26.html": "Real hope. Real change.\nIntroducing your Green Party candidates for the General Election 2024\nMonmouthshire – Ian Chandler\nIan was elected in 2022 as County Councillor in Monmouthshire and is the Cabinet Member for Social Care, Safeguarding & Accessible Health Services within the Labour-Green Coalition. Ian has a degree in chemistry, a masters degree in business, and worked for over 30 years in charities promoting international development, human rights and environmental protection.\nTorfaen – Phil Davies\nPhil is aged 29 and is local to Torfaen having been brought up in and still residing in the Oakfield area of Cwmbran. He has a degree in Psychology and a Masters in International Politics from Aberystwyth University. Phil is currently the deputy leader of Wales Green and is passionate about getting young people engaged with politics. He is also an active member of several community groups in Torfaen.\nNewport East – Lauren James\nIn 2022 Lauren broke new ground for the Green Party, becoming our first ever councillor on Newport City Council in Shaftesbury, a long-time Labour safe seat. Former deputy leader of Wales Green Party, she champions equality and a fair future for all. She moved to Newport in 2014 after a period of homelessness and wants to give back to the community that helped her.\nNewport West & Islwyn – Kerry Vosper\nKerry was active in her trade union at local, regional and national executive levels when she taught in Further Education. As someone who is particularly interested in the natural world Kerry has been the Treasurer for a Friends group on a local nature reserve and volunteered with Avon Wildlife Trust.\nCaerphilly – Mark Thomas\nMark is 35 and lives in Caerphilly with his wife and children. He works as a therapist after qualifying from the University of South Wales and also manages an award winning, family run business. Mark has a long history in volunteering with both local and international charities.\nBlaenau Gwent & Rhymney – Anne Baker\nAnne lives in Blaenau Gwent and is currently studying Environmental Management and working part time in Health and Safety. She is a keen photographer and also volunteers with several local community groups.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2020_04_04_wales-green-party-announce-new-deputy-leader/content_24.html": "Wales Green Party is pleased to announce the selection of Gwent Green Party member Lauren James as the new Deputy Leader following a vacancy that arose last year after previous Deputy Mirka Virtanen stood down. Lauren will be joining the existing leadership team of Anthony Slaughter, Leader and Duncan Rees, her fellow Deputy Leader.\nLauren James has been an active member of Wales Green Party for 5 years, volunteering at both a local and national level. A single parent of three children, Lauren has lived in Newport, South Wales for six years. Since 2017 she has worked from home as a social media manager alongside publishing a green lifestyle blog for parents.\nLauren cares deeply about the natural world, education and the lives of young people. She is a passionate advocate for gender equality and social justice.\nAnthony Slaughter, Leader of Wales Green Party said, ‘I am looking forward to working with Lauren in her new position. As a colleague, her passion and commitment in building and promoting our party and its values has been invaluable and I am confident she will bring these strengths to her new role, helping Wales Green Party to deliver our vital messages on climate justice and social justice in these challenging times, and securing the elected Green representation that Wales so desperately needs.’\nLauren James said, ‘I’m thrilled to be selected as Wales Green Party Deputy Leader. In these uncertain times it’s been heart-warming to see the community come together. From frontline NHS staff, teachers and other key workers to parents educating their children at home, Wales has shown resilience and solidarity in a crisis unlike anything in living memory.\nI look forward to being a strong Green voice for women, children and young people in Wales.’",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_category_blog/content_3.html": "Gwent Green Party’s blog – written by members, for everyone.\n1st April 2023 / 16th June 2023 by harrietking\nRead more »\n1st March 2023 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine Dydd Gŵyl Dewi Sant Hapus! This month I’d like to talk about how we get around our neighbourhoods and to and from our nearby towns. Without any scheduled buses in our area, those unable to drive or who cannot afford to […]\n1st February 2023 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine I love the first signs of Spring – lambs, snowdrops and earlier sunrises – but over the last month we have also had periods of extreme cold and a few days of potential flooding. As the rivers were rising, council staff […]\n1st December 2022 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s Parish Magazine Rising inflation and interest rates are impacting on households, especially those on low or fixed incomes who have little to cushion themselves against these economic shocks. You can get advice on what support is available to you by visiting one of […]\n1st November 2022 / 14th March 2023 by harrietking\nCllr Ian Chandler’s monthly column for Llantilio Crossenny Parish Magazine As a County Councillor, I represent residents in the Llantilio Crossenny ward, which covers the area between Skenfrith, Rockfield, Penrhos and Llanvetherine. Labour have 22 of the 46 council seats, one short of a majority. As the largest party they have formed a minority administration, […]",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2018_11_26_green-party-deputy-leader-selected-as-newport-west-candidate/content_32.html": "* Amelia Womack selected as Newport West candidate in event of snap General Election\n* Newport born and raised Womack pledges to give voters a “real alternative to the status quo”\n* Womack: “Newport has been overlooked and left behind for too long”\nGreen Party of England and Wales deputy leader Amelia Womack has been selected as the party’s candidate in Newport West in the event of a by-election or snap general election.\nThe announcement follows news that Newport West MP Paul Flynn will stand down at the earliest opportunity. [1]\nWomack, who was born and raised in Newport, has pledged to bring green jobs to her hometown, support local businesses and champion environmentally sustainable alternatives to the M4 motorway expansion.\nAfter being elected as Green Party deputy leader in 2014, Womack stood for Cardiff Central in the 2016 Welsh Assembly election.\nThe local party in Newport selected Womack as the Newport West Parliamentary candidate at a meeting on the evening of Thursday 22 November.\nAmelia Womack, deputy leader of the Green Party of England and Wales, said:\n“Newport has been overlooked and left behind for too long. I’m honoured to have been selected to represent the Green Party in my hometown and am excited to get stuck in and give voters a real alternative to the status quo.\n“I have seen first hand the impact decades of underinvestment have had on Newport and am committed to securing new clean, sustainable jobs to help revitalise our forgotten local economy.\n“With plans for toxic sludge to be dumped just down the coast the need for fearless, independent Green voices to stand up for our city has never been greater. I pledge to oppose the short-term thinking behind plans for the polluting M4 expansion, and will fight for the protection of Newport’s local environment to be at the heart of all decisions made for our city.” [2] [3]\nNotes:\n1. https://www.bbc.co.uk/news/uk-wales-politics-45975674\n2. https://www.bbc.co.uk/news/uk-wales-41347137\n3. https://bettertransport.org.uk/campaign_against_levels_motorway",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_make-gwent-levels-aonb/content_22.html": "In these strange and uncertain times when we can’t travel far from home, it’s really hit home how important our local green spaces are.\nThat’s why we want to make the Gwent Levels an Area of Outstanding Natural Beauty.\nMaking the Gwent Levels Wales’ next AONB would:\n- Give better planning protection meaning our green spaces are preserved\n- Revive our local economy and bring tourism to the area\n- Protect the local environment for future generations\nThe Levels have already been under threat once. Let’s give them the protection they deserve.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_amelia-womack/content_34.html": "Greens launch Senedd manifesto in Newport 6th April 2021 / 13th April 2021 by Lauren James Green manifesto sets out plans to “secure Wales’ future” by building 12,000 affordable homes, a community model for healthcare and advocating for a Universal Basic Income. Their Green Transformation Fund promises to invest locally in communities and create tens of thousands of Green jobs. Read more » Amelia Womack Senedd 2021\nGwent Green Party announce candidates for Senedd elections 31st March 2021 / 31st May 2021 by Lauren James Amelia Womack leads the Green Party list for South Wales East Candidates have signed the Green Transformation Pledge for Wales Read more » Amelia Womack Ian Chandler Lauren James Senedd 2021 Stephen Priestnall",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2020_11_23_senedd-2021-new-volunteer-roles-available/content_28.html": "2020 has been a challenging year for all of us.\nBut it has also given us the strength to make sure that 2021 will be the year we get Amelia Womack elected as our first Green Party member of the Senedd.\nAs priority region for Wales we have the resources we need to support campaigns, staff and volunteer recruitment and media spend.\nWe now need to build our volunteer campaign team through the passion and commitment of all our members and supporters.\nPeople like you.\nWe are recruiting for a number of exciting volunteer roles ranging from media and marketing to campaign and coordination. Whether you can see yourself on the front line or making things happen behind the scenes, you can be part of the biggest volunteer-led election campaign in the history of the Wales Green Party.\nYou will be working with an amazing and passionate strategic regional campaign team, with Amelia at the lead and coaching and mentoring available so you can learn new skills too.\nIf you think you can help in any way, click here to see the selection of roles we are looking to fill and to let us know if you are interested.\nYou can be the reason we get Amelia into the Senedd next year.\nThanks so much for your support and of course please pass this onto anyone else you think might be interested in volunteering to be part of what would be a historic achievement for the Green movement next year.\nLet’s make change happen in Wales.",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2023_03_01_ians-column-march-2023/content_2.html": "Cllr Ian Chandler’s monthly column for The New Times – Llantilio Crossenny’s parish magazine\nDydd Gŵyl Dewi Sant Hapus!\nThis month I’d like to talk about how we get around our neighbourhoods and to and from our nearby towns.\nWithout any scheduled buses in our area, those unable to drive or who cannot afford to run a car face real barriers in accessing public services and risk social isolation. Children are dependent on parents to drive them places, the elderly have to rely on neighbours or taxis, and our carbon footprint is high because of all the car journeys.\nBut there is now an alternative. The Grass Routes transport scheme is a responsive flexible bus service that makes trips on request. It operates low floor, fully accessible vehicles with volunteer drivers. The scheme is operated by Monmouthshire Council on a membership basis (a one off payment of £5 per household of up to four members) and is open to all members of the community. It costs £3.00 for a single journey and £5.00 for a return journey made on the same day, with a 50% discount for under 16’s and concessionary passes are accepted.\nMost recent users are in the south of the county and there has been very little take up so far in our area – it seems to be a well-kept secret! It can take some time to get through to the booking line (I’m pushing for a better system) but don’t let that put you off. The more users we have in our area, the better the service will be. More details at https://www.monmouthshire.gov.uk/buses-trains/grass-routes-community-transport/\nOf course, buses are not the only alternative to cars. Many residents in our area would like to walk, cycle or ride horses – to visit neighbours, to get to places or just to enjoy our stunning countryside. But many feel that our roads are not safe enough to venture out because of speeding traffic.\nI get lots of calls from residents either asking for speed limits to be reduced in their areas, or for better enforcement of existing speed limits. The council’s focus at the moment is rolling out the 20mph limits in built-up areas, but when that is complete later this year we could be pushing for more 30mph and 40mph limits instead of the 60mph limits in force along most of our country lanes. What do you think?\nBest wishes,\nIan\nTel: 01291 448270\nEmail: ianchandler@monmouthshire.gov.uk\nFacebook: ianchandlergreen\nTwitter: Ian_Chandler",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_category_news/content_30.html": "News from Gwent Green Party, for the general public.\n16th August 2022 / 16th August 2022 by Lauren James\nFollowing our AGM, we have a newly elected Gwent Green Party committee. Thank you to everyone who put themselves forward. Welcome to new committee members and welcome back to those returning! Chair – Lauren James Treasurer – Ann Were Fundraising Officer – Kerry Vosper Election Returns Officer – Philip Davies Communications Officer – Tanya Sinnett, […]\nRead more »\n23rd November 2020 / 31st May 2021 by Lauren James\n2020 has been a challenging year for all of us. But it has also given us the strength to make sure that 2021 will be the year we get Amelia Womack elected as our first Green Party member of the Senedd. As priority region for Wales we have the resources we need to support campaigns, […]\n14th October 2020 / 31st May 2021 by Lauren James\nOur rivers Wye, Usk, Lugg and Monnow are being blighted by pollution. As Greens in Gwent, Powys and Herefordshire, we want to work across borders to tackle the sources of pollution and clean up our rivers. Join our meeting to hear more about what is causing the problem and discuss how we can campaign for […]\n5th September 2020 / 31st May 2021 by Lauren James\nWe hope you are well and safe. The recent heatwave followed by storms and flash floods in parts of Gwent have reminded us that the climate crisis has not gone away while our attention has been focussed on the Covid-19 pandemic. We are busy building our campaign for the Senedd elections which take place next […]\n6th October 2019 / 31st May 2021 by Lauren James\nCynhadledd, croeso i Gasnewydd, croeso i Gymru. Conference, welcome to Newport, welcome to Wales. Conference, these are troubling times. With our democracy in crisis and at a time of Climate Emergency our Green voice is needed more than ever. Our political system is broken with Johnson and his Bullingdon bully boys intent on defying Parliament […]\n7th April 2019 / 31st May 2021 by Lauren James\nCongratulations to Green Party of England and Wales’s Deputy Leader Amelia Womack, who secured our highest ever vote share in the Newport West by-election. This shows that the appetite for Green politics is growing in Wales, and for good reason. The IPCC report showed us that we have just 12 years to avoid catastrophic climate […]",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2021_04_06_greens-launch-senedd-manifesto-in-newport/content_19.html": "- Green manifesto sets out plans to “secure Wales’ future” by building 12,000 affordable homes, a community model for healthcare and advocating for a Universal Basic Income.\n- Their Green Transformation Fund promises to invest locally in communities and create tens of thousands of Green jobs.\nThe Wales Green Party has launched their manifesto for the Senedd elections this May in an event at Belle Vue Park in Newport. The manifesto sets out the party’s plan to “transform Wales”, building a secure future through investment in 12,000 truly affordable new homes, a community model for health care, and advocating for a universal basic income.\nThey also proposed their Green Transformation Fund – investing money into communities to create tens of thousands of new Green jobs, and raising necessary finance to support their bold plans for a more secure and equal future for Wales.\nAmelia Womack – Deputy Leader of the Green Party of England and Wales, lead candidate on the South Wales East regional list, and constituency candidate for Newport West – said “I am proud to announce an exciting manifesto which presents a sensible plan to ensure Wales has a secure future. As we recover from the devastating impact of COVID-19, it is clear we cannot simply return to business as usual.”\n“With the fairer voting system on the second, regional ballot in these elections, we know that Greens can be elected – and must be, otherwise there’s a risk that far-right parties will be elected instead, whose only goals seem to be to disrupt Welsh democracy.”\n“With Labour not able to win a regional seat in almost all of Wales, it’s vital people who traditionally vote Labour lend this vote to the Greens, ensuring accountability in the Senedd, and keeping out far-right parties.”\nENDS\nNotes\nThe Wales Green Party manifesto can be found here: https://greenparty.click/Wales%20Green%20Party%202021%20Senedd%20Election%20Manifesto%20English.pdf\nFor more information, contact Lauren James, lauren.james@greenparty.org.uk, 07825 699 023",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_2021_03_31_gwent-green-party-announce-candidates-for-senedd-elections/content_25.html": "- Amelia Womack leads the Green Party list for South Wales East\n- Candidates have signed the Green Transformation Pledge for Wales\nIn an online event on Monday, the Greens launched their slate of candidates for the Senedd elections in May, with their five lead list candidates on the regional list ballot, each signing a Green Transformation Pledge for Wales.\nThe pledge document details the Green Party’s five promises to voters to help them deliver a secure Green future if elected to the Senedd on 6th May:\n• Truly affordable homes for all\n• Tackle the climate emergency and restore nature\n• Well-funded, modern healthcare in our communities\n• Education, fit for today and the future\n• Stand up to Westminster’s power-grab\nAmongst the candidates standing is Deputy Leader of the Green Party of England and Wales Amelia Womack, who is lead candidate on the South Wales East regional list, as well as constituency candidate for Newport West.\nWomack said “These elections are some of the most exciting in the history of Wales, with the possibility to shape a post-covid future which is resilient, strong and equal. We have a real chance of electing our first Green Party voices in Welsh Parliament, pushing to secure a future – a fairer, Greener Wales for everyone”.\n“Every Green elected will work constructively with other parties to transform Wales, by investing locally in our communities. Greens know that’s how you bring real change.”\nENDS\nNOTES\nRegional list candidates: Amelia Womack, Ian Chandler, Lauren James, Stephen Priestnall\nConstituency candidates: Amelia Womack (Newport West), Ian Chandler (Monmouthshire)\nFor more information or photos, contact Lauren James lauren.james@greenparty.org.uk 07825 699 023",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_tag_stephen-priestnall/content_29.html": "Gwent Green Party announce candidates for Senedd elections 31st March 2021 / 31st May 2021 by Lauren James Amelia Womack leads the Green Party list for South Wales East Candidates have signed the Green Transformation Pledge for Wales Read more » Amelia Womack Ian Chandler Lauren James Senedd 2021 Stephen Priestnall",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_campaigns/content_17.html": "Make the Gwent Levels an Area of Outstanding Natural Beauty\nHaving saved the Gwent Levels from the threat of the M4 Relief Road, our challenge now is to bring in further protection for this extraordinary landscape. Originally reclaimed by the Romans, the Levels have for nearly two thousand years been a perfect example of sustainable development. The network of reens – or drainage ditches – keeps the land irrigated in dry times and flood-free in rainy times. Large areas of the Levels are designated as Sites of Special Scientific Interest, primarily for the rich aquatic life in the reens. But they’re also home to the rare shrill carder bee, to bitterns and cranes, as well as a wealth of plant life. Our campaign will focus on obtaining AONB status for the Levels – something that we will be doing in conjunction with other campaign groups and NGOs.\nFind out more about the campaign\nPrevent flooding – Take Action\nOne year ago, floods devastated many homes and businesses in Gwent and elsewhere across Wales. Although the emergency response and support for recovery was mostly excellent, it feels like the Welsh Government has given up on preventing further flooding. David Henshaw, Chair of Natural Resources Wales (NRW), wrote “we must all accept the inevitability that communities in Wales will flood again, and that the threat is likely to become more severe and more frequent”.\nFind out more about the campaign\nM4 Relief Road Campaign – success!\nThe threat of the relief road carving up the Gwent Levels hung over Wales for more than thirty years. We campaigned against this on the grounds that it wouldn’t solve congestion (new motorways encourage more traffic); it was in direct contravention of the Welsh Government’s carbon targets; and it would destroy an area of internationally important biodiversity which has already been eaten away by thoughtless development.\nAnd we won! Despite the Public Inquiry finding in favour of the road the First Minister had clearly been listening to the arguments put forward by the Green Party and other campaigning groups – as well as his own Future Generations Commissioner – and he concluded that this ill-conceived scheme had no place in 21st Century Wales.\n“Gwent Greens are campaigning hard to make the world better for everyone. Every action, big or small, paves the way to a greener, fairer future for Gwent. Look out for ways to get involved!”\nLauren James, Deputy Leader, Wales Green Party",
  "https_gwent_greenparty_org_uk_/https_gwent_greenparty_org_uk_category_uncategorised/content_9.html": "Skip to content\nSkip to footer\nGwent\nMenu\nGeneral Election 2024\nVolunteer\nNews\nPress\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nBlog\nUncategorised\nUncategorised\nIan’s column – April 2023\n1st April 2023\n/\n16th June 2023\nby\nharrietking\nRead more »\nIan Chandler\nMonmouthshire\nTo top"
}