{
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_get-involved_html/content_11.html": "Get Involved\nVolunteering and Donations\nWays you can help to support my campaigns\nThank you for showing interest in my campaigns! Your involvement is welcome and I'm grateful for your willingness to contribute in any way that you can. Here are several ways to get involved and show your support:\nVolunteer Opportunities\n- Join my team of volunteers. Whether you're passionate about a particular subject or organising events, I welcome your help.\nSpread My Campaign Message\n- Use your social media channels to share and circulate my campaign content.\n- While social media holds significant influence, there's nothing as impactful as conversing directly with friends, family, and colleagues. Not everyone can access the internet or social platforms, so ensuring my message reaches them is crucial.\n- Write letters to the local press expressing your views on local issues and let them know why you support my campaign.\nAttend Events\n- Keep an eye on my website and social media platforms (links in footer) for details of upcoming scheduled 'meet and greet' sessions, together with debates.\n- Organise a house party for me to attend, where we can talk through something you're passionate about Contact me to arrange a mutually convenient date and time.\nDonate, Host and Raise Funds\nPlease contact me directly to discuss further\n- If you're able, please consider donating to my campaign. Every donation, regardless of how little, will be of significant assistance and will go solely towards my campaign spend.\n- My primary expenses revolve around travel and printing costs, so if you're a business owner willing and able to offer assistance, I'd greatly appreciate hearing from you. Your generosity will be duly acknowledged on my website and social media platforms.\n- If you're a business proprietor with space available for campaign meetings, I warmly invite you to reach out so that we can explore mutually beneficial arrangements.\n- Interested in organising a fundraiser? Count me in! Let me know how I can assist you in making it a success.\nJoin Issue-Based Campaigns\n- If there's a specific cause that you're passionate about (such as knife-crime, healthcare, education, housing or environmental protection), see how my campaign resonates with your concerns.\n- Collaborate with advocacy groups and community organisations that hold a focussed meaning for you. Together we can amplify our impact.",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_contact_html/content_14.html": "Phone/Text\n01244 428129 - 8am-8pm\nCall or Leave a voicemail\nCall or Leave a voicemail\nEmail me\ninfo@edwinduggan.co.uk\nI will respond asap\nI will respond asap\nEvents Calendar\nKeep an eye of where I am via my events page\nEdwin Duggan\nHuman Rights Advocate. Anti-Knife Crime Campaigner\nContact Me\nI'm Happy to Answer all Your Questions\nJoin in the conversation:\nThank you for visiting my campaign website. I hope it has given you a clear insight into my work and my commitment to advocating human rights and combatting knife crime. I am dedicated to supporting victims and their families, with a strong focus on seeking justice and preventing future tragedies. If you believe I can assist you or if you have any questions, please don’t hesitate to reach out. You can contact me by phone at 01244 428129, via email, or by leaving a message below.",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_campaigns-past_html/content_16.html": "Wilko's Debate\nSteven (Ste) was brutally murdered by Jamie Mitchell on 4th October 2022. Mitchell was sentenced to serve a minimum of 22 years of a life sentence at Mold Crown Court on the 4th of May 2023.\nMitchell went out, armed with a kitchen knife with full intent on inflicting harm to \"someone\". Ste, going about his business, completely innocent of any harm towards the perpetrator became the victim of Mitchell's anger. Ste being stabbed by Mitchell, tragically died shortly after.\nAfter long discussions and research, Ste's family agreed with me that the best way forward is to campaign the Government to debate, review and reform the existing law on knives contained in the Offensive Weapons Act 2019.\nConcentrating on the possession of or the use of knives (as defined in existing legislation) during the commission of an existing criminal offence in the UK, and to explore the creation of a new post within the Government in the form of Minister for Knife Crime in the UK.\nHaving a dedicated minister specifically assigned to prevent knife crime would demonstrate that the Government recognises the severity of the issue and is committed to tackling it. It would send a strong message that knife crime is a priority and requires targeted efforts.\nPlease visit the petition on the link below:\nhttps://petition.parliament.uk/petitions/639631\nAfter the initial six-month period of campaigning (which any petition to the Government can run) the number of signatures required to trigger an automatic debate in Parliament had not been reached. This spelt the end of Wilko's Debate Campaign in its founding format. Ste's family were emotionally exhausted, they had accompanied me to many towns and Cities across the country tirelessly campaigning, and above all this were still very much still in grief. They informed me that this was the end of their campaigning effort, they were understandably at odds with the world at large, asking themselves \"Why have not enough people signed the petition?\"\nI gave them my word that I would continue the fight which they had bravely started with me. They gave me, and continue to do so, their full blessing and endorsement of my endeavour. I have kept them informed of my progress at every stage.\nI embarked on what for me was phase 2 of the operation. I took into account the wishes of Ste's family and removed Ste's name from any future press releases and/or media content. I have referenced Ste on occasions during times since the end of Wilko's Debate, however, this is only to provide a small link to the initial reason for the current campaign.\nFurther Reading and Press Articles About This Case\nLinks below open up a new browsing window.\n- Family of Buckley murder victim Steven Wilkinson launch campaign | The Leader\n- Jamie Mitchell sentenced for murder of Steven Wilkinson in Buckley | The Leader\n- Buckley mother and nan describe impact of Steven Wilkinson's murder | The Leader\n- Jamie Mitchell found guilty of murdering Steven Wilkinson in Buckley | The Leader\n- Buckley: Man, 24, charged with Steven Wilkinson murder - BBC News\n- Wilko Debate BBC Wales 18.07.23 - YouTube",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_private-members-bill-assisted-dying-update_html/content_15.html": "Assisted Dying Bill: \"The Unresolved Debate: Revisiting the Ethical and Practical Implications of the Assisted Dying Bill Fifteen Years On\"\nFifteen years ago, I delved into the complex and contentious issue of assisted dying, exploring its ethical, moral, and practical implications. As I revisit this subject today, the landscape has evolved significantly, with new legislation, societal attitudes, and medical advancements shaping the debate. The Assisted Dying Bill, set to be debated in Parliament on 29th November 2024, proposes to legalise assisted dying for terminally ill, mentally competent adults with six months or less to live. While the bill aims to provide a compassionate choice for those suffering, it raises significant ethical, moral, and practical concerns that warrant careful consideration. This essay will critically examine these concerns, drawing on lessons from past debates and recent developments in other countries, to provide a comprehensive perspective on the potential implications of legalising assisted dying in the UK.\nAssisted Dying Bill: A Critical Perspective\nThe Assisted Dying Bill, set to be debated in Parliament on 29th November 2024, proposes to legalise assisted dying for terminally ill, mentally competent adults with six months or less to live. While the bill aims to provide a compassionate choice for those suffering, it raises significant ethical, moral, and practical concerns that warrant careful consideration.\nEthical and Moral Concerns\nOne of the primary arguments against the Assisted Dying Bill is the ethical dilemma it presents. The sanctity of life is a fundamental principle upheld by many cultures and religions. Legalising assisted dying could undermine this principle, leading to a slippery slope where the value of human life is diminished. Critics argue that once society accepts the notion that some lives are not worth living, it becomes challenging to draw a clear line, potentially leading to broader acceptance of euthanasia in non-terminal cases.\nMoreover, the bill's requirement for the approval of two doctors and a High Court judge does not eliminate the risk of coercion or undue influence. Vulnerable individuals, particularly the elderly or those with disabilities, may feel pressured to choose assisted dying to avoid being a burden on their families or the healthcare system. This pressure can be subtle and insidious, making it difficult to ensure truly voluntary consent.\nPractical and Legal Implications\nFrom a practical standpoint, the implementation of the Assisted Dying Bill poses significant challenges. Ensuring that all cases are thoroughly vetted and free from coercion requires robust safeguards and oversight mechanisms. However, even with stringent measures, the potential for abuse and error remains high. The experience of other countries that have legalised assisted dying, such as the Netherlands and Belgium, shows that safeguards can be eroded over time, leading to an increase in cases and a broadening of eligibility criteria.\nAdditionally, the bill could have profound implications for the medical profession. Doctors are traditionally seen as healers, committed to preserving life. Introducing assisted dying into medical practice could fundamentally alter this role, creating conflicts of interest and moral distress among healthcare professionals. It may also deter individuals from seeking palliative care, which focuses on providing comfort and improving the quality of life for terminally ill patients.\nConcerns from Canada's Recent Legislation Expansion\nCanada's recent expansion of its Medical Assistance in Dying (MAID) legislation to include individuals suffering solely from mental illness has raised significant concerns. Critics argue that individuals with mental health issues might be particularly vulnerable and could make decisions to end their lives during periods of severe distress. Additionally, there are concerns about whether the healthcare system is adequately prepared to handle these cases, including the availability of trained professionals and support systems. The expansion has blurred the line between suicide prevention and assisted dying, raising ethical and moral questions. There is also fear that individuals might feel pressured to choose MAID due to lack of support or resources for mental health care.\nThe Canadian government has introduced legislation to delay the expansion by three years to allow more time for preparation and to ensure the system is ready. This delay has been met with mixed reactions, with some welcoming the extra time and others arguing that it violates the rights of those suffering from mental illness.\nPotential UK Implications\nThe enactment of the Assisted Dying Bill in the UK could pave the way for similar expansions in the future, mirroring the trajectory seen in Canada. Once the principle of assisted dying is accepted, there may be gradual pressure to extend the legislation to include other categories, such as individuals with mental health conditions or chronic illnesses. This potential for legislative creep underscores the importance of carefully considering the long-term implications of the bill before its enactment.\nLessons from Lord Joffe's Bill (2005)\nThe concerns raised during the debate on Lord Joffe's Private Member's Bill in 2005 are still relevant today. Critics of that bill argued that legalising assisted dying for terminally ill patients could lead to a slippery slope where eligibility criteria might expand over time. There were also fears about the potential for vulnerable individuals, such as the elderly or those with disabilities, to feel pressured into choosing assisted dying. Additionally, the ethical concerns about the role of doctors and the need for improved palliative care were highlighted. These concerns remain critical considerations in the current debate on the Assisted Dying Bill.\nAlternatives to Assisted Dying\nRather than legalising assisted dying, efforts should be directed towards improving palliative care and support for terminally ill patients. High-quality palliative care can alleviate pain and suffering, providing patients with dignity and comfort in their final days. Investing in palliative care services, training healthcare professionals, and raising public awareness about available options can ensure that patients receive the compassionate care they deserve without resorting to assisted dying.\nFurthermore, addressing the root causes of suffering, such as inadequate social support and mental health care, can significantly improve the quality of life for terminally ill individuals. By focusing on holistic and compassionate care, society can uphold the value of life while providing meaningful support to those in need.\nConclusion\nThe Assisted Dying Bill, while well-intentioned, presents numerous ethical, moral, and practical challenges that cannot be overlooked. Legalising assisted dying risks undermining the sanctity of life, exposing vulnerable individuals to coercion, and fundamentally altering the role of healthcare professionals. Instead of pursuing this path, efforts should be directed towards enhancing palliative care and addressing the underlying causes of suffering. By doing so, we can provide compassionate and dignified care for terminally ill patients without compromising our ethical principles.\nEdwin Duggan LLB (Hons)\nPublished 27th November 2024\nReferences:\n- The Conversation: \"Assisted dying: how to understand the increasingly angry debate between MPs over this controversial bill\".\n- The Independent: \"Religious leaders come together to oppose assisted dying Bill\".\n- Law Gazette: \"Assisted dying bill: there is much in the debate that frustrates\".\n- The Conversation: \"UK's assisted dying bill would create the worst thought-out legal framework anywhere in the world - legal expert\".\n- UK Parliament: \"Assisted Dying Bill [HL] - Parliamentary Bills\".\n- UK Parliament: \"Assisted Dying Bill [HL] publications - Parliamentary Bills\".\n- Edwin Duggan: \"The Report; Assisted Dying for the Terminally Ill [2005] v Mental Capacity Act 2005 (2009)\".",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_undocumented-immigration-in-the-uk_html/content_20.html": "The Hidden Crisis: Addressing the Urgent Need for a Public Inquiry into Undocumented Immigration in the UK\nA personal analysis in light of the recent murder of Rhiannon Whyte (Bescot, West Midlands) 20 October 2024.\nFollowing the tragic death of Rhiannon Whyte from Bescot, West Midlands, the issue of Undocumented Immigrants has been brought to the forefront by many (including Rhiannon's family) who are now seeking answers from the Government as to why the individual who has now been charged with her murder was allowed to stay at an unsecure location given that no one at the Home Office actually knew who he was!\nUndocumented immigration (immigrants with no documentary history) in the UK is a complex issue with various facets. The number of people entering the UK irregularly has fluctuated over the years.\nFor instance, in the year ending June 2024, there were 38,784 detected irregular arrivals, with 81% arriving by small boats. These arrivals are often subject to seasonal fluctuations, with peaks during warmer months.\nIt must be recognised that undocumented immigrants (UI) face numerous challenges, including limited access to work, benefits, and public services. They often live in precarious conditions and are vulnerable to exploitation. The exact number of UI in the UK is difficult to determine, but latest estimates suggest there are between 800,000 and 1.2 million unauthorized immigrants in the UK.\nThe Home Office suggests that it has a strict policy regarding UI.\nUnder the Illegal Migration Act 2023, individuals who enter the UK illegally are detained and promptly removed either to their home country or a safe third country. The Act aims to deter illegal migration by removing the incentive for dangerous small boat crossings and speeding up the removal process. Additionally, those who enter the UK illegally face a lifetime ban on re-entry, settlement, and citizenship. There are some discretionary powers for the Home Secretary to waive these bans in exceptional circumstances.\nHowever, at the time of writing this, the deterrents in place have not proved effective insofar as the small boats are still arriving on the shores of the UK.\nNow the above would suggest that all is well with the \"problem\" of UI. However, this is not the case.\nIn the year ending June 2024, 18,918 people entered immigration detention in the UK. This is a 12% decrease compared to the previous year. Based on the above figures this means that there are approximately 20,000 UI being accommodated in unsecure premises across the country.\nAs a human rights advocate, I must consider why people risk their lives by travelling across the English Channel in (the most part) inadequate vessels. I must also acknowledge that many of these individuals might well be facing persecution in their homelands and as such I must accept the reality that many people will take the perilous journey no matter what the deterrents and any individual who comes to this country should be afforded to right to state their case. That said, the population of the UK has the right to be protected. The Government has an absolute duty to its population to give it protection.\nWith the above in mind, surely anyone entering the country without proof of who they are cannot be left to their own devices and be allowed to wander freely about the UK. Anyone who enters the country without documentary evidence of who they are should be accommodated within the confines of a secure unit until such a time that their identity can be fully explored and confirmed.\nThe case of Rhiannon Whyte fully demonstrates why this should be the absolute minimum requirement. Had the individual who has now been charged with her murder been subject to the constraints detailed above, she would still be alive today.\nIn conclusion: conducting a public inquiry into why UI are not accommodated in secure units until such time they have been fully identified is crucial for addressing systemic issues, ensuring transparency, and fostering trust between the government and its citizens. It offers an opportunity to create informed policies, protect human rights, and enhance national security. By comprehensively investigating and understanding the multifaceted challenges, we can develop effective solutions that benefit society and protect the population of the UK.\nEdwin Duggan LLB (Hons)\nPublished 4th November 2024\nReferences:\nmigrationobservartory.ox.ac.uk\npewresearch.org",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_campaigns_html/content_7.html": "Dedicated Minister for Knife Crime Prevention UK (DIRECT CAMPAIGN)\nI continued to press the then Conservative Government and many links I have formed with certain individuals within the House of Commons to secure a debate on Knife Crime Prevention (with the hope that this might lead to a larger one which may consider my proposals for a Knife Crime Prevention Ministerial Office).\nI also continued to give the press information to publish concerning the issue and they have never let me down as they have always published my endeavour.\nSince the Southport incident on 29th July 2024 where 11 people were stabbed by a 17-year-old and as at today's date 3 little girls have lost their lives, I have now made it known that perhaps (and considering that a new Parliament petition is needed) that the emphasis should be that a Knife Crime Prevention Commissioner for the UK be debated as a clear indication to the general public that something will be done to combat this \"epidemic\".\nPoints to be considered prior, during and post any debate:\n- Knife law in the UK is extremely stringent insofar as the current law makes it quite clear that there is no room for confusion in those seeking to carry an offensive weapon including a knife on the streets of the UK.\n- Knives are and remain an integral part of everyday life. They are present in every house, we use them to prepare food, eat our food, they are used for work, e.g.; catering, eating, fishing, carpentry, climbing, surgery, and crafting to name but a few.\n- The knife per se is a tool which is an integral part of every culture, so it would be a futile exercise in a campaign to remove the tool from society.\n- So, what to campaign for?\n- Should there be an increase on the starting point of minimum sentence imposed upon a convicted person who used a knife in the act of an assault upon a person including murder?\n- Should there be an increase in the sentence of a person found to be in possession of a knife, without just cause?\n- Should there be greater onus upon the person carrying a knife to explain the purpose and reason why they are in possession of the article?\n- Should there be a system developed which limits households to having knives which exceeds \"normal\" usage?\n- Should there be a registration requirement for every household for knives held within each premises above a certain length?\n- Should there be a registration mark attached to every knife above a certain length?\n- Should there be an added sentence starting point attached to anyone who has a previous conviction of violence with or without a weapon?\nThe list is not exhaustive and is open to debate.\nRelevant Further Reading and Press Articles\nLinks below open up a new browsing window.\n- Man behind knife minster petition reveals Bournemouth spike | Bournemouth Echo\n- Shotton campaigner teams up with police to stop knife crime | The Leader\n- Shotton campaigner asks residents to push knife crime debate | The Leader\n- Shotton campaigner urges parents to speak about knife crime | The Leader\n- Shotton campaigner urged public to back knife campaign | The Leader\n- Deeside man takes anti-knife campaign to Southport amid attacks | The Leader\n- Facebook (video from my own profile)",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_about_html/content_8.html": "About Me\nI am Edwin Duggan\nHuman Rights Advocate and Anti-Knife Crime Campaigner\nAn honest look into my past and present.\nEarly Years Living in Shotton\nAs a child, I personally witnessed the extensive impact of the closure of Shotton Steel Works, not only in Shotton itself but throughout the entire constituency and beyond. I vividly recall how the children of those who lost their jobs suffered directly as a result of the shutdown.\nA Journey Through Hardship: Personal Reflections on Financial Struggles\nDuring my early adult years I recall residing in a bedsit, jobless, uncertain about when the next meal would come. Later on I experienced unemployment once more, this time as a married man with a child. One poignant memory resurfaces from those challenging periods of one Christmas Eve, where I sat anxiously by the front door, anticipating the arrival of my giro from the postman. The thought weighed heavily on me: how would I explain to my daughter if it didn't arrive, that Father Christmas couldn't visit us this year?\nI have been there, sitting in the cold, even before I had the luxury of central heating, struggling to keep warm by adding wood to the fire. So, I understand first hand what it means to face the dilemma of 'Heating or Eating'. I wonder how many politicians in the House of Commons can genuinely grasp the reality of this choice for our pensioners and those on low incomes.\nFrom the Frontlines: Reflections on Conflict and Political Realities\nNotable areas of service included Northern Ireland, the Middle East and other strategic locations deemed important by the UK Government. During that time, I witnessed for myself the grim realities of conflict and the divisive nature it breeds, along with the manifestation of hatred. It was during this time that I began to question whether politicians truly understood the broader realities of the world. Each faction seemed entrenched in its own ideology, unwilling to negotiate, while the innocent public and security forces members suffered due to the incompetence of those in their \"ivory towers\", engaged in petty bickering or scrambling for morsels beneath the table.\nReturning to Deeside: Highs and Lows\nIn the years following my military service, I returned to the familiar surroundings and faces of my upbringing. Married, with my own business and a circle of friends, everything seemed to be on track. Life remained stable for a while, with enjoyable moments spent strolling along the river Dee, shopping and eating out in Connah's Quay, Buckley, Queensferry and Broughton, mingling with a diverse community where some had more than others, but such is life.\nI led the local Business Club during the day and engaged with those less fortunate by night. Each person I encountered had their own strengths and I never severed ties with anyone, even as I 'climbed the ladder'. Little did I know, this would prove invaluable in the future.\n2006 marked a turning point. It was the year when everything fell apart. I lost my family, my home, and my business. Despite what some said about me never recovering, I proved them wrong. Instead of wallowing in self-pity, I picked myself up, dusted myself off, and began anew.\nEmpowerment Through Education: A Path to Helping Others\nRather than giving in to self-loathing and despair, I chose to enroll at the University of Chester, where I pursued a degree in Law. Graduating in 2010 with an LLB (Hons) Law, those three years proved to be a turning point in my life. This educational path has been instrumental in enhancing my casework skills and has fuelled my aspiration to become an MP. Sadly it was not meant to be for 2024 but it was an empowering journey. On a positive note, I won more votes than most independent candidates throughout the country and if anything, it raised awareness of my profile, who I am and what I am passionate about which will help to serve my human rights and anti-knife crime focus moving forward.\nReflections on Resilience: Alyn and Deeside in Perspective\nI've since lived a relatively content life among the familiar faces of my upbringing, always mindful of the old adage: \"Never forget those you once knew on the way up, because you might have to meet them again on the way back down!\" I believe the points I've made in this brief history of my life illustrate clearly that above all else, I am a survivor and a fighter. I will be standing again in a future election, but for now, my focus is on the current serious matters affecting the whole of the UK - knife crime.",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk/content_1.html": "Update: 14th October 2024\nWelcome to the Official Website of Edwin Duggan\nI'm Edwin Duggan, a dedicated human rights and anti-knife crime campaigner committed to making a\npositive impact in communities. With a passion for social justice, I actively work to raise awareness, influence policy\nchanges, and empowerment to take action against violence and injustice. Through my campaigns, Edwin aims to create\nsafer, more inclusive environments for all, advocating for meaningful change and support for those affected by\nknife crime.\nI am deeply committed to the welfare of my local community in Flintshire, and my latest concern is the impact of the vote\nagainst winter fuel payments, which is expected to affect around 8 million pensioners across the UK. This decision directly\nimpacts our community, and after hearing the concerns of residents, I have been asked to step in where possible.\nIn response, I have partnered with Age Connects North East Wales to provide real support to those affected.\nMy action plan, including the assistance available and how you can help\nothers if you're in a position to do so, has now been published here:\nWinter Assistance Fund.\nStay updated on my latest initiatives, events, and insights as I continue to champion the causes that matter.\nIf you would like to be kept up to date with my continuing campaigns please\nemail me and/or follow me on Facebook (Eddie Duggan)\nfacebook.com/edwin.duggan",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_private-members-bill-assisted-dying_html/content_12.html": "Assisted Dying Bill: MPs Set to Debate in Parliament on 16th October 2024\nProposals to allow assisted dying will be laid out in Parliament later this month. Labour MP Kim Leadbeater has tabled a Private Member's Bill to give people 'choice at the end of life', with Downing Street indicating it will not obstruct its progress.\nThe Spen Valley MP asked for 'honest, compassionate and respectful debate' when her Bill, which will be tabled on October 16, is considered in the Commons. Her proposal would allow eligible adults to end their lives and ensure stronger protections for them and their loved ones in the aftermath.\nI wrote a paper concerning the issue of Assisted Dying while at University, placing the then Private Members Bill petitioned by Lord Joffe (2005) against the Mental Capacity Act (2005).\nThis remains a very contentious issue, there are pros and cons on both sides of the argument, however, after re reading my paper written 15 years ago, I feel that the problems that politicians faced then, will remain the same during the debate on 16th October. My findings then remain the same now as they were when writing the report, and there seems to be no route forward except only to reduce to the rights of an individual who might make, literally, a life changing decision during a time which is extremely challenging due to whatever illness they might be suffering at the time. There is no room for a \"blanket\" solution (ie; Assisted Dying Bill), unless, there is scope and a mechanism to ensure that each case be treated individually in a sensitive manner, which ensures that every avenue open to the individual has been explored exhaustively, including a police investigation of all concerned with the ultimate decision so as to exclude coercion (which unfortunately has been found to exist where Assisted Dying is legal).\nRead my essay on the link below:\nRead my essay here (opens a new window)\nEdwin Duggan LLB (Hons)\nPublished 4th October 2024",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_press-coverage_html/content_6.html": "In the Press and Media Coverage\n(Article links when clicked, open a new window)\nShotton campaigner's praise for Netflix hit 'Adolescence'\n21st March 2025 - the Leader\nAN ANTI-KNIFE campaigner from Deeside has praised a hit Netflix series for portraying the 'devastating impact of knife crime on young people'... I was specifically asked by the Leader to write an article due to its hard hitting topic relating to knife crime which I was humbled to write. The link to the press article is below, however you can read the full publication on my blog.\nShotton anti-knife campaigner up for True Crime Award\n20th March 2025 - the Leader\nAN ANTI-KNIFE campaigner from Deeside has been shortlisted for a prize at a prestigious awards do...\nI am honoured to have been shortlisted for the 'Best Awareness Campaign' prize at the True Crime Awards which will take place in London on June 5. Events like this all help raise and keep raising awareness of such campaigns highlighting the need for accountability and justice particularly where knife crime is concerned.\nFear of energy costs left woman with mouldy walls\n2nd January 2025 - bbc.co.uk\nWhen the energy crisis first hit, Beverley Jones was so worried about how she would pay her bills that she turned her heating off completely and ended up with mouldy walls...\nThis article sheds light on the issue of winter fuel poverty, which impacts not only the elderly but many others in our community. It highlights the efforts of local companies and campaigners, including Help4Heating's partnership with Warm Wales. The piece also mentions Edwin's campaign the 'Winter Assistance Fund' for Flintshire and Wrexham, launched in late autumn in collaboration with Age Connects, which has already raised nearly £600. They are still accepting donations so please give, no matter how small, to help the most vulnerable.\nAvailable support this winter in Wrexham and Flintshire\n13th October 2024 - leaderlive.co.uk\nThe cut to winter fuel payments for those on more than £12,000 a year is expected to affect around 8 million pensioners in the UK. Community campaigner and fundraiser Eddie Duggan, from Shotton, who's work has included Jade's Law and Knife Crime Prevention, has now linked up with local charity Age Connects North East Wales, based in Flint, to start a campaign... You can donate here: Total Giving, Winter Assistance Fund\nNorth Wales parents urged to speak to kids about knife crime\n27th August 2024 - rhyljournal.co.uk\nAnti-knife campaigners Edwin Duggan, from Shotton, and Danny Maddocks, from Wrexham, have made an impassioned plea to parents and youths across North Wales in the hope of getting blades off the streets....\nFlintshire: Jade's Law passes through Parliament\n24th May 2024 - leaderlive.co.uk\nJADE'S LAW, which suspends the parental rights of a parent who kills the other, has successfully passed through Parliament today, before its dissolution for the general election. ...\nBins across Wrexham and Flintshire for unwanted blades\n13th May 2024 - leaderlive.co.uk\nRESIDENTS across Wrexham and Flintshire have been urged to do their part to tackle knife crime in our communities as part of a week-long police campaign.\nShotton-based campaigner Edwin Duggan told the Leader: \"Op Sceptre is really good and the police do it twice a year. I would like to see that widened to all-year-round\". \"I am working with the Ben Kinsella Trust to develop an education package to take across North Wales into the schools - we are hoping that should start after summer....\nJade's Law named runner up in Parliamentary awards event\n29th March 2024 - leaderlive.co.uk\nA FLINTSHIRE man has spoken of his pride and thanked Leader readers after a hard-fought campaign to change the law on killers' parental rights was recognised at a Parliamentary awards event. \"I never embarked on the Jade's Law Campaign to have any accolade, my only aim was to secure it into legislation, and this has been achieved.\nI was happy at the mere fact that the campaign has been recognised to the level it has, being in the top three campaigns of the year out of an estimated 7,800 petitions raised during the year, is testament enough...\nLarge knife found in Llay prompts call to contact police\n18th March 2024 - leaderlive.co.uk\nMr Duggan and the PCC also discussed a possible campaign or a direct lobby to Parliament to make it illegal to sell any knife to persons under the age of 18. He told the Leader following Mr Maddocks' comments: \"People should absolutely be encouraged to hand knives in to the police - no question ...\nJade's Law: Petition launched following brutal murder of Deeside mum nominated for Parliament award\n21st February 2024 - Deeside.com\nIn response to the nomination, Mr Duggan took to social media to express gratitude towards the extensive support the campaign received online and the pivotal role of the 130,000 signatories in advancing the cause...\nClaims that 20mph has made driving in Deeside a 'nightmare'\n3rd March 2024 - UK Parliament - House Of Commons Committees\nDeeside residents have been getting in touch with the Leader to tell us about their experiences of driving on the roads since the change was made. Read the full article which includes my thoughts on the limit, and how I see it is affecting residents of Deeside ...\nJade's Law - Petition campaign of the year nominee\nFebruary 2024 - UK Parliament - House Of Commons Committees\nThe Petition Campaign of the Year Award celebrates people who have used petitions to campaign for change. The campaigners behind Jade's Law have been nominated for the Award by the Petitions Committee ...\nShotton campaigner teams up with police to stop knife crime\n6th February 2024 - Leader Live\nThe Leader has previously reported on the efforts of Shotton campaigner Edwin Duggan to press for the creation of a dedicated government minister for the prevention of knife crime...\nBBC NEWS Debate. An invitation to give my views on Knife Crime\n25th January 2024 - BBC The Phone In\nKnife Crime in the UK at an all time high. I was asked to give my views on the issue and my current campaign to force the government to have a dedicated minister for knife crime prevention earlier today on BBC Radio Wales ... (Unfortunately, due to constraints on time availability, the article is no longer accessible for listening)\nShotton campaigner asks residents to push knife crime debate\n8th January 2024 - Wrexham Leader\nMr Duggan, who spearheaded the Jade's Law Campaign, said he is so concerned about what he describes as the \"epidemic levels\" of knife crime across the UK, he is now personally pressing MPs to debate the issue - and he's asking others to do the same....\n\"Together at Christmas\" Featured on ITV WALES\n19th December 2023 - ITV NEWS\nHere is the News article broadcast today on ITV Wales. I organised a Christmas Day opening at Caffinaafi, Fron Road Connah's Quay, with food, drink and friendship for all who would otherwise spend Christmas alone. The cafe was open from midday until 6pm on Christmas Day ...\nFlintshire: Jade's Law passed in Government after campaign\n6th December 2023 - The Standard\nEdwin Duggan, who started the online petition, said: \"Karen, Paul, and I are very pleased that Parliament has passed the Government's Jade's Law amendment and are grateful to Mark Tami and his team for their help ...\nJade's Law: Mum 'elated' as partner-killers to be stripped of parental rights\n3rd October 2023 - ITV NEWS\nThe ruling, known as Jade's Law, after the Flintshire-mum killed by the father of her four sons, will be brought before Parliament by the end of the year...\nMan behind knife minster petition reveals Bournemouth spike\n22nd August 2023 - Daily Echo\nEdwin Duggan, the man behind a national campaign to create a government minister to combat knife crime says he was \"gobsmacked\" to see a spike in signatures from Dorset...\nFlintshire: Disappointment at Government following Jade's Law campaign\n12th May 2023 - leaderlive.co.uk\nDisappointment has followed a Government decision on a campaign to change the law so that a parent convicted of killing the other has their parental rights suspended...\nNew petition on parental responsibility follows Jade's Law campaign\n16th February 2023 - Rhyl Journal\nThis review and hopefully reform of the PR element of Section 3 of the Children's Act 1989 will assist every parent whether they be together or separated, and most importantly every child now and in the future.....",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_winter-assistance-fund_html/content_19.html": "Winter Assistance Fund\nThe vote on the winter fuel payments took place on September 9, 2024. The government won the vote, allowing the cut to the winter fuel payments to proceed.\nThe cut to winter fuel payments is expected to affect around 8 million pensioners in the UK. This change has raised concerns about the impact on vulnerable elderly individuals, especially those on low incomes who rely on these payments to help with heating costs during the winter months.\nCampaign:\nSince the announcement I have been asked by many people in the area what can be done? I think the reason many have approached me in particular is mainly due to them knowing of my previous campaigning endeavors. During the last couple of weeks, I have deliberated many different ideas on how we as a community could assist in some capacity, the following is what I see as the best approach:\nI have linked up with a local charity Age Connects North East Wales and after a constructive meeting, it was decided that we could provide viable channel where people in Flintshire and Wrexham will be able to seek real assistance in the coming winter.\nAge Connects NE Wales is a local charity serving the Counties of Flintshire and Wrexham, with funds raised during the campaign, they are strategically placed so that people who ask for assistance in these areas will be afforded such assistance.\nSo, things like warm clothing, extra bedding, cost effective heaters, food, information on local 'Warm Hubs', assistance in Social Services and/or benefits that individuals can apply for, or just a friendly conversation by someone to make sure a person is ok, this is what the charity will provide with available funds.\nI feel that as a community we should be seen to be doing something in order that the most venerable within our community know that they have not been forgotten.\nAction Plan:\nInitially, the idea of asking for blankets, food, heating solutions etc to be donated soon became moot as it was recognised that there would not be suitable storage if we were inundated with the kindness that people show with such campaigns.\nIt has been decided that cash donations are the best way forward. Anyone wishing to donate to this campaign can do so by clicking the link provided, this will take them directly to the charity payment page on the website: TotalGiving™ - Winter Assistance Fund.\nResidents of Flintshire and Wrexham will also be provided with a QR Code PDF which can be printed and then posted in local shop windows. I would also ask if any Newspapers could publish this in any physical publications as it makes it a lot easier for people to access;\nTap img or Download a Printable Copy (opens a pdf)\nBoth Age Connects NE Wales and I will be more than happy to be interviewed further on this at your convenience.\nIt is also my hope that others in the wider community will see this as a spearhead campaign and follow suit across the entire nation.\nYou can contact me either via the email I have sent this, or if you wish to contact me by phone please do, my contact details are:\nEdwin Duggan - 07506340494\nIf you wish to contact the charity Age Connects NE Wales direct, then please do:\nMaria Heron or Kathryn Cramer - 01352 753728\nCharity no. 1126170\nCompany limited by Guarantee no. 06655221\nOther media resources, photos, available if required.\nIf any Newspaper or Network wishes to attend the Charity premises for interview/photos/filming, please liaise with any of the above contacts to arrange a mutual time.\nEdwin Duggan LLB (Hons)\nPublished 14th October 2024",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_current-state-of-knife-crime_html/content_4.html": "Knife crime on the rise in the UK: A personal analysis based on data available as of 23 Aug 2024 and exploring solutions\nKnife crime in the UK has become an increasingly pressing concern, with recent data from the Office for National Statistics (ONS) revealing a 7% rise in offences involving knives or sharp instruments in 2023/24 compared to the previous year. This increase reflects a troubling trend that has reignited debate amongst the general population, particularly following the tragic deaths of the three young girls in Southport - a horrific event that has shocked the nation and underscored the urgent need for effective solutions.\nThe Current State of Knife Crime: An In-Depth Look\nAccording to the latest figures, the number of knife-related offences in England and Wales rose to 49,489 in 2023, up from 46,153 in 2022. Although this number is still 3% lower than the pre-pandemic peak of 51,206 in 2019, the upward trend is concerning, especially with a 20% increase in robberies involving knives. Let us just think about those figures for a moment before moving on. The figures do not adequately reflect the true horror of what is happening in this country, each number is somebody being stabbed with a knife!\nThese figures highlight not only the prevalence of knife crime but also the growing willingness of individuals to use these weapons in the commission of crimes, leading to a heightened risk of serious injury or death.\nThe rise in knife crime is not evenly distributed across the country, with significant regional disparities. The West Midlands reported the highest rate of knife-related offences, with 180 incidents per 100,000 people, followed closely by the Metropolitan Police area, covering most of London, at 165 per 100,000 people. In contrast, areas like Dyfed-Powys in Wales recorded far fewer incidents, with just 32 offences per 100,000 people. These disparities suggest that localised factors, including socio-economic conditions, community support structures, and policing strategies, play a critical role in influencing knife crime rates.\nKnife Homicides: A Leading Cause of Violent Deaths\nKnife crime is not just about assaults and robberies; it is also a leading cause of homicides in England and Wales. Knife crime is a symptom of deeper societal issues, including poverty, lack of opportunity, and the breakdown of community structures. Without addressing these root causes, any attempt to curb knife crime will only be a temporary fix.\nData from the Office of National Statistics (ONS) reveals that in the year ending March 2023, 41% of all homicides in England and Wales were knife-related, equating to 244 stabbing deaths out of 590 total homicides. This marks a significant proportion, highlighting the deadly consequences of knife crime. Over the last decade, from April 2012 to March 2023, 2,574 of the 6,639 homicides recorded, or 38%, were due to sharp instruments, underscoring the persistent threat posed by knife violence.\nThe data also reveals that knife-related homicides have seen fluctuations over time. While the number of knife murders in 2023 was 244, this figure is lower than the peak of 282 knife killings recorded in 2017/18. Nonetheless, the consistency with which knives account for a significant portion of homicides - 41% on average for male victims and 32% for female victims over the past decade-illustrates the deep-rooted nature of the problem.\nThe Tragic Case of Southport: A Stark Reminder\nThe recent Southport stabbings, where three young girls - Bebe King, 6, Elsie Dot Stancombe, 7, and Alice Dasilva Aguiar, 9 - were brutally murdered, serve as a stark reminder of the devastating impact of knife crime. Such events, while fortunately rare, leave an indelible mark on the communities they affect and reignite fears about the safety of public spaces and the wellbeing of children.\nOver the last decade, approximately 9% of the 6,639 homicides in England and Wales involved children under the age of 15. Of these, 217 victims were between the ages of 5 and 15, with boys accounting for about two-thirds of these tragic deaths. The deaths of young girls like those in Southport are particularly heart-wrenching, not only due to their rarity - just over 1% of all homicides in the past ten years involved young girls - but also because they highlight the profound vulnerabilities faced by children in the context of rising violence.\nExploring the Root Causes: A Complex Web\nUnderstanding the rise in knife crime requires a closer examination of the underlying factors that drive individuals, particularly young people, to carry and use knives. Patrick Green, CEO of The Ben Kinsella Trust, points to the role of drug-related activities as a significant factor. Young people are often coerced or lured into criminal networks where they are armed to protect the drugs they transport, rather than for personal protection. This exploitation of youth is a key driver of knife crime, particularly in urban areas where gang activity is prevalent.\nSocio-economic vulnerabilities, such as poverty, lack of educational opportunities, and mental health issues, further exacerbate the problem. Austerity measures over the past decade have led to the closure of youth clubs, reduced police presence, and cuts to community support services, creating environments where crime can thrive. These factors, combined with the allure of gang culture and the perceived need for self-protection, have contributed to the rising tide of knife crime.\nThe Impact on Communities and the Role of Law Enforcement\nThe rise in knife crime has had a profound impact on communities across the UK, particularly in urban areas like London and Birmingham, where the highest rates of knife crime are recorded. The fear of violence, the loss of young lives, and the lasting trauma inflicted on victims and their families underscore the urgent need for effective interventions.\nLaw enforcement agencies are responding with a mix of enforcement and community engagement initiatives. In Bristol, for example, 'Operation Hardy' aims to disrupt the cycle of youth violence by removing weapons from the streets and providing support to at-risk youth. However, as PC Christina Jones, involved in the initiative, explains, balancing enforcement with engagement is a delicate challenge. \"We see kids as young as ten carrying knives\", Jones says. \"These are children who should be worrying about school, not about protecting themselves with a weapon.\"\nThe initiative involves not just the police, but also educators, social workers, and healthcare professionals, all working together to address the factors that lead young people into knife crime. This collaborative approach recognises that solving the problem requires more than just law enforcement; it demands a holistic response that addresses the needs of the community and the individuals within it.\nThe Role of Policy and Legislation in Combating Knife Crime\nThe UK government has introduced a range of measures aimed at curbing knife crime, including bans on specific types of knives, such as zombie knives and machetes, which are often associated with youth violence.\nThe newly elected Labour government has pledged to make tackling knife crime a top priority, with proposals to close legal loopholes that currently allow certain dangerous weapons to be legally sold. Unfortunately, this is just another Government giving lip service to the problem. Every time a person is murdered with a knife, the \"Government\" (no matter the party in charge at the time), give short statements in parliament and have a token debate, but nothing is ever done! (Apart from initialising \"end of conduct\" measures and not as many organisations have suggested over the years a preemptive solution.\nThere is widespread recognition that legislation alone will not solve the problem. It should be emphasised that laws can help reduce the availability of dangerous weapons, but they cannot address the reasons why people carry them in the first place. We need to invest in education, mental health services, and community programs that provide young people with the support they need to avoid a life of crime.\nMoving Forward: A Call for a Comprehensive Solution\nAs knife crime continues to rise, it is clear that a multi-faceted approach is needed to tackle the issue effectively. This approach must include not only stricter enforcement of existing laws but also a significant investment in preventative measures. Providing young people with positive alternatives to crime, such as education, employment opportunities, and mental health support, is crucial to breaking the cycle of violence.\nThe data reveals that while knife crime is a persistent problem, it is not insurmountable. By understanding the underlying causes and addressing them through coordinated efforts across law enforcement, community services, and policymakers, the UK can begin to reverse the trend and create safer communities for all.\nThere is an absolute need for a dedicated ministerial office to be formed at Westminster, or at the very minimum the creation of a Commissioner for Knife Crime Prevention in the UK.\nThe tragic deaths of Bebe King, Elsie Dot Stancombe, and Alice Dasilva Aguiar in Southport serve as a powerful reminder of the human cost of knife crime. As a society, it is imperative that we continue to seek out and implement solutions that not only address the symptoms of this violence but also the root causes that drive it. With sustained effort and collaboration, it is possible to reduce knife crime and prevent future tragedies from occurring.\nPlease support my campaign in the creation of either a dedicated Minister or Commissioner for Knife Crime Prevention in the UK.\nEdwin Duggan LLB (Hons)\nPublished 28th August 2024\nResources:\nBen Kinsella Trust, Office for National Statistics, Metropolitan Police, West Midlands Police, Dyfed-Powys Police, South Wales Police, Operation Hardy Project.",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_blog-netflix-adolescence_html/content_9.html": "The Intersection of Art and Reality: Adolescence, Harvey Willgoose, and the Consequences of Knife Crime\nIntroduction\nKnife crime among young people is one of the most pressing issues facing modern society. Its devastating impact ripples through families, schools, and communities, leaving lasting scars. The Netflix series Adolescence tackles this issue head-on, offering a raw and unfiltered portrayal of the consequences of youth violence. As someone deeply involved in knife crime prevention campaigns, I was drawn to the series, particularly its depiction of a 13-year-old boy accused of stabbing a fellow pupil. Having personally attended the scene and reported on the tragic stabbing of Harvey Willgoose in Sheffield in February 2025, I found Adolescence to be a poignant and often harrowing reflection of real-life events. This article explores how the series mirrors the Harvey Willgoose case, the emotional and societal impact of knife crime, and the urgent need for prevention and intervention.\nThe Series: A Hard-Hitting Drama\nAdolescence is a coming-of-age drama that delves into the turbulent lives of teenagers navigating identity, relationships, and societal pressures. The central theme—a 13-year-old boy accused of stabbing a fellow pupil—resonated deeply with me, given my work in knife crime prevention. The series is unflinching in its portrayal of the incident, from the initial arrest and processing of the minor at a police station to the psychological assessment and legal proceedings. These scenes were strikingly accurate, reflecting the reality of such cases.\nThe writers occasionally strayed from the central theme, but they always returned to the emotional core of the story. By the end, I was deeply moved by the series’ exploration of guilt, trauma, and the search for justice. The stabbing incident serves as a pivotal moment, shedding light on the escalation of conflict, the aftermath for all involved, and the response of the school and community. These themes are not just fictional—they mirror the tragic real-life case of Harvey Willgoose.\nParallels to the Harvey Willgoose Case\nHarvey, a 15-year-old boy, was stabbed to death by a fellow pupil at school in February 2025, a crime that shocked the nation and underscored the urgent need to address knife crime among young people. The parallels between Harvey’s case and the fictional stabbing in Adolescence are striking.\n- Access to Knives: Both cases highlight the ease with which young people can obtain knives. In Adolescence, the series explores how the perpetrator acquired the weapon, raising questions about parental oversight and societal failures. Similarly, in Harvey’s case, the availability of knives and the lack of effective prevention measures were significant factors.\n- Warning Signs: The series delves into the importance of recognising and addressing warning signs of violent behavior. In Harvey’s case, there were reportedly signs that the perpetrator had a history of aggression, yet these were not adequately addressed by teachers, parents, or mental health professionals. Adolescence underscores the need for early intervention to prevent such tragedies.\n- Impact on Families: Both the victim’s and the perpetrator’s families are left devastated by such incidents. The series portrays the long-term consequences for these families, including their search for justice and healing. Having spoken to some of Harvey’s friends and local residents and witnessed their grief firsthand, I can attest to the accuracy of these portrayals. The perpetrator’s family, too, is often left grappling with guilt, societal judgment, and the lifelong burden of thinking they failed as parents.\nThe Emotional and Social Impact\nThe stabbing incident in Adolescence and the Harvey Willgoose case both highlight the far-reaching consequences of knife crime:\n- Fear and Trauma: The series shows how the incident creates a climate of fear and trauma within the school, affecting students’ mental health and academic performance. This mirrors the real-life impact of Harvey’s death on his school and community.\n- Social Division: The incident leads to social division, with students taking sides and forming cliques based on their perceptions of the victim and perpetrator. This exacerbates existing tensions within the school community, a dynamic I observed in the aftermath of Harvey’s death.\nThe Perpetrator’s Family: A Nuanced Perspective\nOne of the most powerful aspects of Adolescence is its exploration of the impact on the perpetrator’s family. This is often overlooked in discussions of knife crime, yet it is a critical part of the narrative.\n- Immediate Shock and Grief: The parents of the boy who stabbed the girl are portrayed as experiencing disbelief, horror, and profound sadness.\n- Guilt and Self-Blame: The series includes intimate moments of the parents reflecting on their parenting choices, questioning where they went wrong.\n- Societal Judgment and Isolation: The family faces harsh judgment from their community, leading to social isolation and a sense of shame. This is a reality for many families of offenders.\n- Long-Term Impact: The incident has lifelong consequences for the family, including strained relationships, financial difficulties, and enduring stigma. The series’ portrayal of this is both heartbreaking and thought-provoking.\nBroader Implications and Call to Action\nBoth Adolescence and the Harvey Willgoose case highlight the need for a multi-faceted approach to tackling knife crime:\n- Education and Awareness: Schools must educate young people about the dangers of carrying knives and the consequences of violence.\n- Community Support: Strong community networks can provide young people with alternatives to violence, such as sports, arts, and mentorship programs. The series depicts how a lack of such opportunities contributes to the problem.\n- Policy and Legislation: Stricter laws on knife possession and better enforcement of existing regulations are essential.\nBy mirroring the Harvey Willgoose case, Adolescence serves as a powerful call to action. It urges viewers to get involved in efforts to prevent knife crime, whether through supporting local initiatives, advocating for policy changes, or simply being more aware of the signs of violence among young people.\nConclusion\nAdolescence is more than just a drama—it is a mirror held up to society, reflecting the devastating impact of knife crime on young people, their families, and their communities. Having attended the scene and reported on the Harvey Willgoose stabbing in February 2025, I found the series to be a poignant and accurate portrayal of the issues I have encountered in my campaign work. By exploring the emotional and societal impact of knife crime, Adolescence fosters empathy and understanding, while sparking important conversations about the root causes of youth violence and the need for comprehensive solutions. It is a call to action that we cannot afford to ignore.\nEdwin Duggan LLB(Hons)\nPublished 21st March 2025",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_blog-CHAS-anniversary-2024_html/content_18.html": "Attending the 10th Anniversary Celebration of Children Heard and Seen\nI am honoured to announce my attendance at the 10th Anniversary Celebration of Children Heard and Seen (CHAS) on 28th October 2024 at the Palace of Westminster. This charity plays a vital role in supporting children affected by parental imprisonment, and I am proud to be associated with their mission.\nMy involvement with CHAS stemmed from my work on Jade's Law, which led the charity to reach out for my legal expertise. They sought my insights on how existing legislation could be expanded to better assist children with a parent in prison, particularly in terms of how the Ministry of Justice can support these children upon their parent's release.\nBack in April this year, I participated in a film produced by CHAS, which highlights the impact of parental imprisonment on children. The film emphasises the need for governmental reforms to support these children during their parent's incarceration and subsequent reintegration into their lives.\nI take great pride in serving as one of CHAS's legal advocates, working on issues that affect these vulnerable children. I am committed to continuing this vital work with the charity, ensuring that their voices are heard and their needs are addressed.\nCharity Overview:\nChildren Heard and Seen (CHAS) was established in 2014 to address the lack of support for children impacted by parental imprisonment. With over 1,200 children and their families already assisted, CHAS is the only charity dedicated to serving these children within their communities. Our mission is to meet their needs, listen to their concerns, and advocate for their voices to be included in policy decisions.\nThe exact number of children affected by parental imprisonment in the UK remains uncertain. However, a recent study by the Ministry of Justice, titled Better Outcomes through Linked Data (BOLD), estimates that over 192,912 children are impacted each year. Unfortunately, there is currently no formal process to identify these children or provide them with the necessary support. Children Heard and Seen is actively campaigning for a change in government policy to establish a system for identifying these children and delivering vital assistance.\nFor more information, please visit Children Heard and Seen - www.childrenheardandseen.co.uk",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_blog_html/content_10.html": "The Intersection of Art and Reality: Adolescence, Harvey Willgoose, and the Consequences of Knife Crime\nKnife crime among young people is one of the most pressing issues facing modern society. It's devastating impact ripples through families, schools, and communities, leaving lasting scars. The Netflix series Adolescence tackles this issue head-on, offering a raw and unfiltered portrayal of the consequences of youth violence. As someone deeply involved in knife crime prevention campaigns, I was drawn to the series, particularly its depiction of a 13-year-old boy accused of stabbing a fellow pupil. Having personally attended the scene and reported on the tragic stabbing of Harvey Willgoose in Sheffield in February 2025, I found Adolescence to be a poignant and often harrowing reflection of real-life events. This article explores how the series mirrors the Harvey Willgoose case, the emotional and societal impact of knife crime, and the urgent need for prevention and intervention.\nAn article about this publication was also featured in the leader live here: www.leaderlive.co.uk (new window)\nShortlisted for the 2025 'True Crime Awards'\nI am truly honoured to be shortlisted for the 'Best Awareness Campaign' award at the True Crime Awards, which will take place in London on 5th June 2025. Events like this are vital in keeping awareness alive, highlighting the need for accountability and justice, particularly in the fight against knife crime. I am thrilled to be nominated and look forward to attending, meeting like-minded individuals, and continuing to push my campaign forward.\nTragic Incident at All Saints Catholic High School\nOn February 3rd, 15-year-old student Harvey Willgoose lost his life in a fatal stabbing at All Saints Catholic High School in Sheffield.\nHis family remembers him as their \"beautiful boy\" and has shared their deep sorrow over his passing.\nA fellow 15-year-old student has been linked to the incident, and authorities are actively investigating the case.\nMy thoughts are with his family, friends and the community at yet another incredibly difficult time.\nFatal Stabbing of 12 year old boy - Leo Ross, Birmingham\nThis video covers the tragic incident involving 12-year-old Leo Ross, who was fatally stabbed in Birmingham on 21st January 2025. The video discusses the circumstances surrounding the event, including details of the incident, legal developments and the impact on the community.\nThe video aims to raise awareness about the issue of youth violence and the need for community action to prevent such tragedies in the future. It encourages viewers to engage in discussions about safety and support for affected families.\nMy thoughts are with Leo's family, friends and the community at this incredibly difficult time.\nSave a Life This Christmas: How You Can Help Knife Crime Victims\nEvery ten minutes in the UK, someone is stabbed - that's over 50,000 people each year. What would you do if you found yourself face-to-face with a victim of knife crime?\nThis short video equips you with the essential knowledge to provide assistance. By following the advice shared, you could make a vital difference - possibly even saving a life.\nPlease take a moment to watch, like, and share the video to help spread this life-saving message far and wide. Together, we can make a real impact. TOGETHER WE CAN MAKE A DIFFERENCE.\nFurther information:\nRed Cross: How to help someone who has been stabbed\nBBC Newsbeat: Knife crime: St John Ambulance to teach teens to help stab victims\nCampaign to Address Parental Alienation\nFamily relationships are the foundation of a child's well-being, yet for many families, these bonds face serious challenges due to parental alienation. The following article sheds light on my own deeply personal and impactful journey that compelled me to advocate for change to protect children from the emotional harm that alienation can cause. Through the proposed Parental Alienation Prevention and Resolution Act, discover how a more compassionate, just, and supportive family justice system could safeguard the well-being of countless children and families across the country.\nContinue reading to learn more about this vital cause and the proposed legislative action aimed at healing family bonds and ensuring a brighter future for all involved: Parental Alienation Prevention and Resolution Act\nRhiannon Whyte 27, Bescot West Midlands\nRhiannon Skye Whyte, a 27-year-old mother, tragically lost her life following a brutal attack on 20th October 2024 at a railway station following her shift at work. It was reported she was stabbed in the neck with a screwdriver and, despite being placed on life support, sadly passed away three days later with her family by her side. Rhiannon's family paid tribute, calling her a \"selfless person\" who was \"always there for anyone who needed it.\" Read the full article for more on Rhiannon's story and the urgent call for action to address the rise in violent crime: HERE\nAlso my latest publication is now available on the link below: The Hidden Crisis: Addressing the Urgent Need for a Public Inquiry into Undocumented Immigration in the UK: A personal analysis in light of the recent murder of Rhiannon Whyte (Bescot, West Midlands) 20 October 2024.\nCelebration service for the life of Service for Jahziah Makyle Coke\nAttending Jahziah's funeral on 24th October 2024 was a profound experience, one I will carry with me always. Though time constraints meant I couldn't deliver my speech to the congregation, I've shared it here, hoping its message reaches everyone who loved and cared for him. You can read it here: SPEECH-FOR-JAHZIAH.pdf\nI want to extend my heartfelt thanks to Jahziah's family for inviting me to his service. It was a deeply moving gathering, filled with family, friends, beautiful readings, singing, and heartfelt tributes - a testament to how loved and cherished this young man was.\nFor those who wish to view the entire service, it was broadcast live and is available on\nYouTube (click button below, opens a new window):\nChildren Heard and Seen - 10th Anniversary Celebration\nOn 28th October 2024, I will attend the 10th Anniversary Celebration at the Palace of Westminster. In my latest article, I share my journey with the charity, including my contributions to Jade's Law and my ongoing commitment to advocating for children affected by parental imprisonment. Discover how CHAS is making a difference and learn more about their mission to support these vulnerable children.\nWinter Assistance Fund\nSupporting The Vulnerable In Flintshire and Wrexham This Winter\nAs the colder months approach, with the loss of the Winter Fuel Payment, many pensioners in our community face increased financial pressure, especially with rising heating costs and household expenses. At a time when community support is more crucial than ever, I have been working in conjunction with Age Connects North East Wales to introduce and launch a vital initiative, the 'Winter Assistance Fund' a platform where people can donate funds to help provide relief for those who need it the most this winter.\nFor full information about the fund and how you can contribute, either financially, or by helping spread the word, please visit the publication here: Winter Assistance Fund A printable flyer is also available to download. Thank you!\nAssisted Dying Bill: MPs Set to Debate in Parliament on 16th October 2024\nProposals to allow assisted dying will be laid out in Parliament later this month. Labour MP Kim Leadbeater has tabled a Private Member's Bill to give people 'choice at the end of life', with Downing Street indicating it will not obstruct its progress.\nRead my article here: Private Members Bill on Assisted Dying\nMeeting with Jahziah's Family: A Tragic Loss and a Call for Change\nYesterday I met with the family of Jahziah, the 13-year-old boy who tragically lost his life in the Oldbury stabbing incident this August. The devastation this has caused his family is beyond words. They were incredibly brave to open up to me during such an unimaginably painful time, and my thoughts remain with them as they navigate their grief.\nDespite their heartbreak, Jahziah's family is determined to raise awareness about the impact of knife crime on families and the wider community. They have asked me to act as their spokesperson for the media, and I feel deeply honoured to have their trust. Additionally, they have asked me to perhaps share a message at Jahziah's funeral, highlighting the far-reaching effects of knife crime and the profound pain it causes - not only to the victim's family but to the entire community.\nAs the circumstances surrounding Jahziah's death are still under investigation, it is important to respect the process. At this time, no specific details can be shared due to strict reporting restrictions of any individual under 18 years of age. I will ensure on my part that the family's privacy and the integrity of the investigation are respected as we move forward.\nThis tragedy underscores the urgent need for us to confront knife crime head-on. My commitment to this cause remains unwavering, and I hope that by raising awareness, we can all work together to create a safer future for our children and our communities.\nInterview on Zombie Knife and Machete Legislation\nToday I'll be interviewed by Global Radio to discuss the new laws regarding the sale of Zombie Knives and Machetes. These laws are set to come into effect on the 24th, and the interview will be broadcast on the same day.\nI'll be voicing my deep concerns about the ineffectiveness of this new legislation. Shockingly, for a knife to be classed as a \"Zombie Knife,\" it must meet three specific criteria:\n- It must have a cutting edge.\n- It must have a serrated edge.\n- It must feature images or writing that suggest it's intended for violent use.\nThis means that as long as a knife doesn't bear such images or writing, it remains legal to purchase. This loophole is absurd and undermines the very purpose of the legislation.\nI've consulted with several criminal barristers, and they share my concerns. They believe that this loophole will be the primary defense for anyone caught purchasing these dangerous weapons even after the 24th of September.\nFurther Reading\nwww.gov.uk/government/news/new-law-to-ban-zombie-style-knives-and-machetes\nwww.gov.uk/government/news/nationwide-call-to-surrender-all-zombie-style-knives-and-machetes\nIn addition to the interview, I'll be in Birmingham on the 24th to meet with the family of Jahziah, the 13-year-old boy who tragically lost his life in a stabbing incident in Oldbury. I will provide an update on this meeting in due course.\nMy deepest condolences go out to Jahziah's family during this incredibly difficult time. I am deeply appreciative of their willingness to share their grief and their story with me, in the hope of raising awareness about the devastating impact of knife crime. It is through their courage and that of the many families like them, that we can bring these tragic events to the attention of Parliament and work towards meaningful change to prevent future tragedies.\nCrimeCon UK Awards 2024\nI've finally received the video footage from the April 2024 Crimcon UK Awards, held at the London Hilton on the 25th. The ceremony gave special recognition to the Jade's Law campaign, named after Jade Ward, who was tragically killed by her ex-partner in 2021. Jade's Law seeks to remove parental rights from parents convicted of murdering the other parent. This important legislative change was honoured for its profound impact on justice and its positive influence within the community.\nPlease subscribe to my youtube channel: youtube.com/@duggiechester\nIllegal Weapons Amnesty Announcement\nThe Home Office has just unveiled a new scheme aimed at removing illegal weapons from our streets (the scheme applies to 'zombie-style' knives and 'zombie-style' machetes) - a positive step forward, but it falls short of addressing the broader, more pressing issues that require action. We need a Dedicated Minister for Knife Crime Prevention that I am presently campaigning for. Read more here on my campaigns page: Campaigns\nFull details and information on how to surrender prohibited offensive weapons and claim compensation under the scheme have been published on the gov.uk website below:\nwww.gov.uk/government/publications/compensation-scheme-for-zombie-knives-and-machetes (opens a new window to an external site)\nOldbury, West Midlands\nHow many more children will be murdered before a coordinated approach to knife crime prevention is actioned in the UK?\nPlease subscribe to my youtube channel: youtube.com/@duggiechester\nPhoto and video: Permission from the family was requested and kindly granted in advance.\nWalton Liverpool, Knife Crime Incident\nAt yet another location where stabbings have taken place. A 14 year old youth and a 40 year old man. Please join my campaign to reduce knife crime in the UK in an effective way.\nPlease subscribe to my youtube channel: youtube.com/@duggiechester\nSouthport Tradgedy\nThe whole nation is deeply shocked by the tragic events in Southport and felt compelled to be there, I witnessed the profound impact it has had on the community. This heartbreaking incident only strengthens my resolve to push for the appointment of a dedicated minister or UK Commissioner for knife crime prevention. My heartfelt sympathy and condolences go out to everyone affected by this horrific crime, especially the innocent children and their families, neighbours and residents of Southport.\nPlease subscribe to my youtube channel: youtube.com/@duggiechester\nElection Results\nHere is the Alyn & Deeside result in full:\nMark Tami (Labour) - 18,395\nJeremy Richard Kent (Conservatives) - 7,892\nEdwin Duggan (Independent) - 1,575\nRichard David Marbrow (Lib Dem) - 2,065\nKarl Raymond MacNaughton (Green Party) - 1,926\nJack William Morris (Plaid Cymru) - 1,938\nVicki Roskams (Reform UK) - 9,601\nI'd like to extend my gratitude to everyone who voted, especially heartfelt to the 1,575 individuals who cast their vote for me. Your support means a greal deal and shows people still believe there are independent individuals out there who can make a difference. This is just the start of my political journey, and your votes have fueled my determination to continue the fight. Exciting opportunities are on the horizon. I've shared a detailed statement on the home page. Thank you once again for your support.\nImportant! Polling Day: 4th July, 7am-10pm\n📅 Important! Polling Day: 4th July, 7am-10pm\n🗳️ Check your poll card letter for your designated polling station. You can only vote at the one specified.\n🚫 No need to bring the card, but photo ID is a must!\nNot received your poll card letter? Contact your local Electoral Registration Office immediately. www.gov.uk/contact-electoral-registration-office\nRemember, every vote counts. Please use your right to vote!\nMy campaign team, local councillors, supporters, and I plan to be present at as many polling stations as possible throughout the day to greet and thank voters for participating, regardless of their chosen candidate. Your vote is your voice and your fundamental right, so please use it. I am grateful for your support if you choose to vote for me, but most importantly, cast your vote for the candidate you believe will best represent you. Best regards, Edwin.\nCampaign Trail So Far\nI've had the immense pleasure of meeting so many incredible people over the past few weeks. I want to extend my heartfelt thanks to everyone who has supported my campaign and to those I've had the privilege of meeting - the public, business owners, organisations, councillors and individuals from all walks of life who contribute so significantly to our community.\nAs my campaign continues until election day, I aim to meet as many of you as possible, to listen to your concerns, and to understand your experiences, both the highs and the lows. We are all in this together. If elected, I promise to do everything in my power to uplift, support, and represent each one of you in every possible way.\nWe are a wonderfully diverse community. Let's strive to make it even better by listening to one another and moving forward together. Keep an eye on my events page to see where I will be out and about next! Events Page\nVeterans & Community Hub CIC\nMondays are special at the Queensferry Institute, thanks to the VC Hub's regular Music and Song Day. It's a day filled with creativity, community, and camaraderie, making it a highlight of the week for many, including myself. Whether you're a veteran, a family member, or simply someone who loves music and art, Mondays at the Queensferry Institute have something special for you. Visit the VC's facebook page for more details: VC Hub facebook page\nLocal Social Car Group Visit\nI took some time today to visit two Deeside based car enthusiast groups at Castle Cafe in Ewloe, Deeside: Bunch of Fives (MX5 owners) and the local Mini group receiving a fantastic warm welcome. Both clubs foster a deep connection through a shared passion for cars and boast a loyal following within the community. These groups serve as a lifeline for many, helping to combat social isolation and providing a sense of belonging. They bring together people of all ages and backgrounds, creating camaraderie that might not have formed otherwise. As the groups also seek to primarily meet at various cafe's, restaurants, pubs etc they are also helping support local business. One of the hot topics of course was the 20mph restrictions in Wales and the upset caused by failure of our local government to listen to voices despite such an overwhelming petition. Is this a topic of debate for you too? Have your say!\nD-Day 80th Anniversary Commemorations in Mold\nThe community of Mold organised an incredible festival to commemorate D-Day. I thoroughly enjoyed attending and meeting everyone. The effort put into this event by the entire community was truly admirable. The importance of remembrance, recognition, and raising awareness for future generations was evident to all. Well done to everyone involved!\nPlease note that our participation in all D-Day commemorations was strictly to show support and respect, and was not connected to any political or campaign activities. These events were organised by our local authorities, and we were there solely to honour and remember this incredibly important 80th anniversary.\nD-Day 80th Anniversary in Connah's Quay\nThis morning, I attended the wreath-laying ceremony at the Connah's Quay and Shotton War Memorial in honor of the 80th D-Day Anniversary. Afterwards, I visited the V C Hub/Caffinaafi to engage with the staff, veterans, and community members.\nLater, a few team members and I attended the 'Lighting of the Beacon' ceremony. This poignant tribute featured readings by the chair and a student from Coleg Cambria, who delivered a translation in Welsh. As a veteran, I was deeply proud to be a part of both events.\nPlease note that our participation in all D-Day commemorations was strictly to show support and respect, and was not connected to any political or campaign activities. These events were organised by our local authorities, and we were there solely to honour and remember this incredibly important 80th anniversary.\nVisit to Sandycroft Hub and Pantry\nJust spent a lovely time at Sandycroft Hub and Pantry. What a wonderful team of people helping the local community. I will definitely be going to see them all again. Please support this wonderful place.\nPhoto Courtesy of Dan Goldsmith Photography / True Crime Awards\nTrue Crime Awards Ceremony 2024\nThis evening, I proudly stood alongside Karen Robinson and Paul Ward at the True Crime Awards Ceremony, hosted by CrimeCon UK where together we were honoured with a special recognition award by public vote for our work on 'Jade's Law'.\nCeremonies like the True Crime Awards serve as powerful reminders of the impact individuals and communities can have when they unite in pursuit of justice and positive change.\nWoodwork to Wellness\nHad a fantastic meeting with Graham, Andy, and all at 'The Shed', Saltney. Found out about the brilliant work that's done there which focuses on therapy over medication.\nPetition Campaign of the Year Award Ceremony\nSpent the day at Westminster, pictured here with the speaker of the House of Commons in recognition of the 'Jade's Law' Campaign which was nominated for 'Petition Campaign of the Year Award'. I was so honoured to be here. Well done #TeamJade: Philippa Ward, Karen Robinson, Paul Ward, Kennedy Mcveigh, Vicki Robinson, Ang Murton, Tay Lor, Emily Hill, Chantel Westwood, Lauren Johnson, Liam Catton and Andy Jones who either passed out flyers on the streets of London, Manchester, Blackpool and Chester, or worked so hard spreading the message on the internet. A special mention to the 130,000 people who signed the petition too! Without these wonderful people, my vision to change the law would have been so much more difficult. THANK YOU! TOGETHER WE MADE A DIFFERENCE.\nCelebrating the Chair's Charity Ball, Connah's Quay\nAttended an extraordinary evening at the Connah's Quay Town Council Chair's Charity Ball held at the Civic Centre, Connah's Quay. The event brought together dignitaries, councillors, local business leaders, and members of the public for a delightful three-course dinner, accompanied by live entertainment, an auction, and a raffle, all in support of the Shooting Star Cancer Support Charity. The chair delivered a heartfelt speech, demonstrating a deep commitment to the community he has chaired over the past 12 months. A heartfelt appreciation to Chairman Cllr Alan Manship, Consort Ann Manship, Town Clerk Suzanne Wilson, and the dedicated staff for their tireless efforts in organising such a splendid event for the community!\nBuckley Precinct Easter/Spring Market\nThis morning was well spent at the Buckley Precinct Easter/Spring Market. I had the pleasure of meeting some wonderful individuals and forging valuable connections. Sharon Beck, the event organiser, showcased the incredible work she and her team do at Shelbys, alongside Andy and his dedicated crew at The Shed woodwork to wellness in Saltney. It was inspiring to see small businesses like The Crafty Hiker and Elaine, who crafts personalised gifts from home, thriving in the community. Engaging with members of the Buckley Residents Group allowed me to delve into the concerns and aspirations of the community, sparking fruitful discussions on how to enact positive change. Overall, it was a highly productive and rewarding experience.\n'Together at Christmas' Christmas Day at Caffinaafi\nTeaming up with Caffinaafi and the VC Hub at Fron Road, Connah's Quay, we orchestrated a heartwarming Christmas Day event for the community, ensuring that no one spent the day alone. The outpouring of support from the cafe owners, local councillors, Community Champions, and the public was truly remarkable. Together, we provided abundant food, drinks, and festive spirit throughout the day. The turnout was tremendous, with a constant stream of people joining us - some to show their support, others seeking companionship, and many in need of nourishment. I was deeply touched by the overwhelming interest and assistance extended to us. Our community's solidarity is nothing short of extraordinary, and I am honoured to be a part of it. I'm already planning a larger-scale event for Christmas 2024, so stay tuned for updates!",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_blog-rhiannon-skye-whyte-murder_html/content_5.html": "Tragic Loss of Rhiannon Skye Whyte Highlights Urgent Need for Knife Crime Prevention in the UK\nRhiannon Skye Whyte, a 27-year-old mother, tragically lost her life after a brutal attack on 20th October 2024 at a railway station following her shift at work. It was reported she was stabbed in the neck with a screwdriver and, despite being placed on life support, sadly passed away three days later with her family by her side. Rhiannon's family paid tribute, calling her a \"selfless person\" who was \"always there for anyone who needed it.\"\nAn 18-year-old suspect, Deng Chol Majeck, was arrested shortly after the late-night attack on Rhiannon and has since been charged with her murder. He is set to appear at Wolverhampton Crown Court on November 19. Reports indicate the suspect arrived in the UK as an asylum seeker in July after crossing the Channel in a small boat, with no documents and applied for asylum, being housed at the Park Inn by Radisson Hotel, close to Walsall FC's stadium in Bescot, West Midlands, where Rhiannon worked.\nIt is understood a petty row over a packet of biscuits is said to have taken place at the hotel earlier. Rhiannon had just finished her shift at 11 p.m. and was headed to catch a train home at Bescot Stadium train station when she was brutally attacked. She was discovered by a passerby, unconscious and severely injured and taken to the Queen Elizabeth Hospital. Despite the heroic efforts by all who tried to save her, Rhiannon tragically succumbed to her injuries on Wednesday 23rd October at hospital surrounded by her loved ones.\nHer family shared a heartfelt message, saying, \"There is not enough paper in the world to even begin to write a tribute for you. We will love and miss you forever.\" Floral tributes now adorn the fence near the station, honouring her memory, including a plaque which you can see on my youtube video.\nTo support Rhiannon's young son, a GoFundMe campaign has been launched by Rhiannon's sister, Alexandra. The funds will support her five-year-old son and, if possible, contribute to charities assisting victims of abuse and violence - causes Rhiannon's sister said she would have wholeheartedly championed. You can contribute to the fundraiser here:\nGoFundMe - Rhiannon Skye Whyte\nIn light of yet another unecessary tragedy, this further highlights the urgent call for a Dedicated Minister for Knife Crime Prevention in the UK. The epidemic of violent attacks is ever increasing and costing innocent lives and leaving an unimaginable impact on families and communities. This crisis demands immediate, focused action to prevent more lives from being senselessly taken.\nPlease, we must take action: Sign My Petition",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_campaigns-developing_html/content_2.html": "13th November 2024\nProtecting Family Bonds: Addressing Parental Alienation\nFamily relationships are the foundation of a child's well-being, yet for many families, these bonds face serious challenges due to parental alienation. The following article sheds light on my own deeply personal and impactful journey that compelled me to advocate for change to protect children from the emotional harm that alienation can cause. Through the proposed Parental Alienation Prevention and Resolution Act, discover how a more compassionate, just, and supportive family justice system could safeguard the well-being of countless children and families across the country.\nContinue reading to learn more about this vital cause and the proposed legislative action aimed at healing family bonds and ensuring a brighter future for all involved: Parental Alienation Prevention and Resolution Act\nParental Responsibility Review & Reform Bill\nDuring the Jade's Law debate in November 2022, it was recognised that the current legislation concerning Parental Responsibility (PR) failed in so many ways. It became evident that the law concerning PR should be reviewed and reformed for future generations.\nHere are some suggestions that I identified (not the government) during the initial Jade's Law debate in the House of Commons November 2022:\n- Clear and Comprehensive Definition: The legislation should provide a clear and comprehensive definition of parental responsibility, outlining the rights, duties, and responsibilities that come with being a parent. This would help parents understand their obligations and ensure consistency in the interpretation and application of the law.\n- Education and Awareness: Implementing mandatory parenting education programs or courses can help parents develop essential skills and knowledge to fulfil their responsibilities effectively. These programs could cover areas such as child development, discipline strategies, communication skills, and conflict resolution.\n- Support Services: Enhance the availability and accessibility of support services for parents, including counselling, parenting helplines, and community-based programs. These services can provide guidance, advice, and assistance to parents who may be struggling or facing challenging circumstances.\n- Co-Parenting Guidelines: Establish guidelines or frameworks for co-parenting arrangements in cases of separation or divorce. These guidelines should emphasise the importance of maintaining the child's well-being and ensure both parents have equal opportunities to be involved in the child's life, unless there are specific reasons for limiting parental responsibility.\n- Accountability and Enforcement: Strengthen mechanisms for enforcing parental responsibility, particularly in cases of neglect or abuse. This could involve improved monitoring, reporting systems, and collaboration between social services, schools, and healthcare providers to ensure early intervention and protection of children at risk.\n- Child Participation: Promote the inclusion of children in decision-making processes that directly affect them, considering their age and level of understanding. This can be achieved by allowing children to express their views and preferences in matters relating to parental responsibility, such as custody arrangements or healthcare decisions.\n- Continuous Review and Improvement: Regularly review and update parental responsibility legislation to reflect societal changes and emerging issues affecting children and families. This can be done through consultations with experts, stakeholders, and the public to ensure the legislation remains relevant, effective, and in line with the best interests of the child.\nIt's important to note that implementing changes to legislation requires careful consideration, consultation, and collaboration with various stakeholders, including legal experts, child welfare organisations, parents, and children themselves.\nRichard's Story\nRichard committed suicide in June 2023. He might well be still with us, however, after being turned away from an NHS Hospital which he attended with his brother due to being extremely unwell (having a history of mental illness) he, with regret saw no alternative to his mental health and ended his life.\nOn the face of the evidence which his family have, the NHS powers that be, turned him away from their doors due to an idiosyncrasy in the current protocols surrounding OAP (Out Area Patients), whereby, if you are not from a particular area seemingly you can be refused medical assistance! This is predominantly in the field of Mental Health care. This is something which must be addressed in the UK and must be changed.\nHis Brother David and Sister Lisa are currently exploring their course of action with me. I assure both them and you that once we have a course of action, it will be a decisive one.\nPrivacy Rights Removed\nEveryone who receives some type of benefit in the UK should be worried about what has just been voted through in Parliament recently (29.11.23).\nAt the 3rd reading of the Digital Protection and Digital Information Bill, the Conservative representative basically added an amendment at the 11th hour. The amendment strips people privacy to the extent that the DWP can access anyone's bank account details at any time, without just cause. i.e.; without the premise that they suspect the account holder of any \"suspicious activity\", this move is a direct contravention of human rights to privacy.\nIt is totally understandable that if the department suspects a claimant of fraud, then of course they are entitled to investigate, however, for this they would have to follow strict procedure in order to access a person's bank account.\nThis Bill if passed will remove this and as such will give the Government a free pass to inspect anyone's bank account without just cause.\nThis will affect over half the population of the UK. Anyone in receipt of a benefit ranging from Universal Credit to Pension Credit will fall into this category. Even if you have never claimed a benefit, you should still be concerned as one day you will be drawing a pension!\nThere has been no opportunity for scrutiny by the Commons, the only hope is that someone in the Lords will make it a point to bring the issue into debate.\nBoth sides of the House voted the amendment through without proper consideration, this included a phalanx of Labour MPs, so no one should rely on either major Party to remove this element of the Bill.\nThis is yet another erosion of our Human Rights and must be protested, if not by MPs (of which are few) but by the general public.\nWhat to do? From a personal point of view, I am not sure at this point. Is there scope for a petition to be raised? Do we all go down to Westminster and protest? Give me your views either via my email:\nREMEMBER YOUR PRIVACY IS ENSHRINED IN LAW, DON'T LET IT BE TAKEN AWAY!\nBibby Stockholm Project\nThe Govt have supplied accommodation for the continued influx of migrants, (up to 500 occupants) and although some quarters suggest that this is not a sufficient solution to the problem, I would say that this is a cheaper option to the problem.\nFrom the very start, we have heard from the WOKE section of society that this is nothing more than a \"prison ship\" and no one should be accommodated on this vessel.\nThen after 39 people boarded the vessel, it seems that the Immigration Lawyers found a \"loophole\" by suggesting that there might be Legionaries disease so those who boarded have now had to leave.\nThe vessel has been successfully used for over 30 years in one way or another so why all of a sudden has it become \"unusable\"?\nIf there is cause for a conspiracy theory, then this has to be it.\nThe vessel is fit for purpose and should be used to house people who have suggested that they are being persecuted, indeed, if I was in the same situation, I would welcome any sanctuary and would be the last person to complain.\nIf these individuals don't want the use of a safe place to live then perhaps the following suggestion for the vessels' use might be appropriate:\nEvery MP in our area, North Wales, Cheshire, Merseyside, proposes that the barge be moved to the river Dee. We would welcome it! Then ask every homeless person in the area if they would like to board it rather than sleep on the street, although the weather is alright at the moment, it won't be in a few months. I am confident that by October (of any year), I could fill the barge with thankful individuals.\nLet's start accommodating people who would be truly thankful for a roof over their heads this winter!\nUPDATE: It has been announced by the new Labour Government that there will no longer be any funding made available for the continued use of the Bibby Stockholm barge (as apparently it costs 20m per year!!!). So, what will be done with the Barge?\nBring it to the North Wales coast (river Dee), make it available for the homeless in the areas outlined above, and if there are any MPs opposed to this then the question has to be asked, why?\nIf you have any questions you'd like to ask or anything to discuss regarding any of the campaigns on my website, I would love to hear from you. Please visit my contact page for details of how to get in touch. Thank you. Edwin.",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_privacy_html/content_17.html": "Website Terms of Use\n1 About our Terms\n1.1 These Terms explain how you may use this website (the Site) which is provided by us free of charge.\n1.2 References in these Terms to the Site are references to the website: www.edwinduggan.co.uk, and all associated web pages.\n1.3 You should read these Terms carefully before using the Site. Refer to point '10 Variation' below with regards to any future updates to these terms and this page.\n1.4 By accessing or using the Site or otherwise indicating your consent, you agree to be bound by these Terms and the documents referred to in them.\n1.5 If you do not agree with or accept any of these Terms, you should stop using the Site immediately.\n1.6 If you have any questions about the Site, please contact us by:\n1.6.1 e-mail: master@edwinduggan.co.uk (emails will typically be responded to during office open times - Daily: 8am to 8pm), or\n1.6.2 telephone 01244 811400 (will typically be answered during office open times - Daily: 9am - 5pm) [We may record calls for quality and training purposes.]\n1.7 Definitions\n| Content | 1 means any text, images, video, audio or other multimedia content, software or other information or material submitted to or on the Site; |\n| Privacy Notice & Cookie Policy | 2 means the policy 'Privacy Notice' at www.edwinduggan.co.uk/privacy.html, which governs how we process any personal data collected from you; |\n| Site | 3 means these terms and conditions of use as updated from time to time under clause 10; |\n| We, us or our | 4 has the meaning given to it in clause 4.1; |\n| You or your | 5 means the person accessing or using the Site or its Content. |\n1.8 Your use of the Site means that you must also comply with our Privacy Notice and Cookie policy, where applicable.\n2 Using the Site\n2.1 The Site is for your personal and non-commercial use only.\n2.2 You agree that you are solely responsible for:\n2.2.1 all costs and expenses you may incur in relation to your use of the Site; and\n2.2.2 keeping your password and other account details confidential\n2.3 The Site is intended for use only by those who can access it from within the UK. If you choose to access the Site from locations outside\nthe UK, you are responsible for compliance with local laws where they are applicable.\n2.4 We seek to make the Site as accessible as possible. If you have any difficulties using the Site, please contact us at\nmaster@edwinduggan.co.uk\n2.5 We may prevent or suspend your access to the Site if you do not comply with any part of these Terms, any terms or policies to which they\nrefer or any applicable law.\n3 Ownership, use and intellectual property rights\n3.1 This Site and all intellectual property rights in it including but not limited to any Content are owned by us, our licensors or both (as applicable). Intellectual property rights means rights such as: copyright, trade marks, domain names, design rights, database rights, patents and all other intellectual property3.2 Nothing in these Terms grants you any legal rights in the Site other than as necessary to enable you to access the Site. You agree not to adjust to try to circumvent or delete any notices contained on the Site (including any intellectual property notices) and in particular in any digital rights or other security technology embedded or contained within the Site.\n3.3 Trade marks: The use of any trade marks (whether registered or unregistered) on the Site is strictly prohibited unless you have our prior written permission.\n3.4 Icons used free with licence and permission for credit from:\nVote icons created by Freepik - Flaticon\nMission icons created by Freepik - Flaticon\nElections icons created by Freepik - Flaticon\nImages by DronePics.Wales are licensed under CC BY 4.0\n4 Submitting information to the Site\n4.1 While we try to make sure that the Site is secure, we cannot guarantee the security of any information that you supply to us and therefore we cannot guarantee that it will be kept confidential. For that reason, you should not let us have any patentable ideas or patent applications, advertising or marketing suggestions, prototypes, or any other information that you regard as confidential, commercially sensitive or valuable (Unwanted Submissions). While we value your feedback, you agree not to submit any Unwanted Submissions.\n4.2 We may use any Unwanted Submissions as we see reasonably fit on a free-of-charge basis (bear in mind that we have no way of knowing whether such information is confidential, commercially sensitive or valuable because we do not monitor the Site to check for these matters). Therefore, we will not be legally responsible for keeping any Unwanted Submissions confidential nor will we be legally responsible to you or anybody else for any use of such Unwanted Submissions.\n5 Accuracy of information and availability of the Site\n5.1 5.1 While we try to make sure that the Site is accurate, up-to-date and free from bugs, we cannot promise that it will be. Furthermore, we cannot promise that the Site will be fit\nor suitable for any purpose. Any reliance that you may place on the information on this Site is at your own risk.\n5.2 We may suspend or terminate operation of the Site at any time as we see fit.\n5.3 Content is provided for your general information purposes only and to inform you about us and our products and news, features, services\nand other websites that may be of interest. It does not constitute technical, financial or legal advice or any other type of advice and\nshould not be relied on for any purposes.\n5.4 While we try to make sure that the Site is available for your use, we do not promise that the Site is available at all times nor do we\npromise the uninterrupted use by you of the Site.\n6 Hyperlinks and third party sites\nThe Site may contain hyperlinks or references to third party websites other than the Site. Any such hyperlinks or references are provided for your convenience only. We have no control over third party websites and accept no legal responsibility for any content, material or information contained in them. The display of any hyperlink and reference to any third party website does not mean that we endorse that third party's website, products or services. Your use of a third party site may be governed by the terms and conditions of that third party site.\n7 Limitation on our liability\n7.1 Except for any legal responsibility that we cannot exclude in law (such as for death or personal injury), we are not legally\nresponsible for any:\n7.1.1 losses that:\n(a) were not foreseeable to you and us when these Terms were formed; or\n(b) that were not caused by any breach on our part\n7.1.2 business losses; and\n7.1.3 losses to non-consumers.\n8 Events Beyond our Control\nWe shall have no liability to you for any breach of these Terms caused by any event or circumstance beyond our reasonable control including, but not limited to, strikes, lock-outs or other industrial disputes; breakdown of systems or network access; or flood, fire, explosion or accident.\n9 Rights of third parties\nNo one other than a party to these Terms has any right to enforce any of these Terms.\n10 Variation\nThese Terms are dated 12th April 2024. No changes to these Terms are valid or have any effect unless agreed by us in writing. We reserve the right to vary these Terms from time to time. Our updated terms will be displayed on the Site and by continuing to use and access the Site following such changes, you agree to be bound by any variation made by us. It is your responsibility to check these Terms from time to time to verify such variations.\n11 Disputes\n11.1 We will try to resolve any disputes with you quickly and efficiently.\n11.2 If you are unhappy with us, please contact us as soon as possible.\n11.3 If you and we cannot resolve a dispute using our complaint handling procedure, we will:\n11.3.1 let you know that we cannot settle the dispute with you; and\n11.3.2 give you certain information about our alternative dispute resolution provider.\n11.4 If you want to take court proceedings, the relevant courts of the United Kingdom will have exclusive jurisdiction in relation to these\nTerms.\n11.5 English law applies to these Terms.\nPrivacy Notice\nYour privacy is very important to us, we make every effort to oversee the effective and secure collection, processing and storage of your personal data. Edwin Duggan will be known as the 'Controller' of the personal data that you provide to us via this website. The data that we collect and how we use it is outlined below:\nCollected Information\nWe collect basic personal data about you through email and contact e-forms via this website. This information is initiated and freely given by yourself and does not include anything deemed as sensitive. This does however include data such as name, company name, address, email and phone numbers.\nWhy we need your data\nYour basic personal data is collected in order to verify your identity and enable communication in reply to your interest in my political campaign for the role of MP within the Alyn and Deeside Constituency. We will not purposefully collect any personal data from you beyond which required to provide and oversee the above.\nData processing and storage\nThe personal data we collect is processed by the Controller and stored on an internal computer hard drive disc. Appropriate security measures (both in respect of IT and manual) are in place to ensure the protection and safe storage of your data. With the exception of our in-house agents and web service/hosting providers, third parties will not have access to the personal data collected without your prior consent, unless the law permits. Under no circumstances will your name, e-mail, phone number, address or other other personally identifiable information be sold on to a third party.\nHow long we keep your data\nYour data is held on file for as long as necessary to oversee our service to you. For general enquiries without generating a donation or sale, we would keep your data for 12 months before deletion. This is for your convenience and ours enabling us to refer back to our notes and documentation issued at the time, in case you decide to return. In some cases however, where a monitary transaction has taken place we are required under UK tax law to keep your basic personal data (name, company name, address, contact details, details of any payments made etc) for a minimum of 6 years, beyond which it will be reviewed for deletion and subsequently destroyed.\nWhat are your rights\nYou may at any point request to see the personal information of yours that we process and what is included in our records. If at any point you believe that information to be incorrect, you can request to have it amended.\nShould you have any concerns or wish to raise a complaint on how you believe we have handled your personal data, you may contact us to have the matter investigated. In the first instance, please email the Controller: master@edwinduggan.co.uk\nWe aim to respond within 30 days from the date of your enquiry; Please also allow us sufficient time to investigate, process and respond to your enquiry - we will keep you updated throughout. If you are not satisfied with our response or believe that we are processing your personal data in a manner not in accordance with the law, you may file a complaint at the Information Commissioner's Office https://ico.org.uk/concerns\nCookies in Use on this Site\nBy using our websites (through any device) you agree that this Cookie Policy applies to that use in addition to any other terms and conditions which may apply.\nWe reserve the right to make changes to our Cookie Policy without prior notice. Any such changes shall appear here and become effective immediately. Your continued use of our website is taken as meaning that you agree to our Policy and any such changes.\nOur website uses cookies, as almost all websites do, to help provide you with the best experience we can. Cookies are small text files that are placed on your computer or mobile phone when you browse websites. Our cookies help us to provide interactive features to make our website work as you'd expect, remember your settings during and between visits, improve the speed/security of the site, allow you to share pages with social networks like Facebook and providing us with information to help us continually improve our website\nWe do not use cookies to collect any personally identifiable or sensitive information or to pass personally identifiable data to third parties or pay sales commissions.\nGranting us permission to use cookies\nIf the settings on your software that you are using to view this website (your browser) are adjusted to accept cookies we take this, and your continued use of our website, to mean that you are fine with this. Should you wish to remove or not use cookies from our site you can learn how to do this below, however doing so will likely mean that our site will not work as you would expect.\nVisitor Statistics Cookies via Google Analytics\nWe use cookies to compile visitor statistics such as how many people have visited our website, what type of technology they are using (e.g. Mac or Windows which helps to identify when our site isn't working as it should for particular technologies), how long they spend on the site, what page they look at etc. This helps us to continuously improve our website. These so called 'analytics' programs also tell us if how people reached this site (e.g. from a search engine) and whether they have been here before helping us to understand how our digital marketing efforts are assisting our campaign.\nData Collection and Retention\nNo personally identifying data is collected from this source. Data collected is anonymous, stored and retained within the Google Analytics app for a period of 26 months after which it will be automatically deleted, however this will reset on new activity should you revisit the site again thereafter.\nEmbedded Videos\nEnhanced privacy mode is enabled on all YouTube embedded videos placed on this website. This means that unless the user clicks on the play button and watches an embedded video or interacts with it in some capacity, no data will be collected or stored.\nTurning Cookies Off\nYou can usually switch cookies off by adjusting your browser settings to stop it from accepting cookies, however, doing so will likely limit the functionality of our's and a large proportion of the world's websites as cookies are a standard part of most modern websites.\nIt may be that you concerns around cookies relate to so called \"spyware\". Rather than switching off cookies in your browser you may find that anti-spyware software achieves the same objective by automatically deleting cookies considered to be invasive. Learn more about managing cookies by visiting the site below:\nwww.allaboutcookies.org (opens a new window)",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_index_html/content_21.html": "Update: 14th October 2024\nWelcome to the Official Website of Edwin Duggan\nI'm Edwin Duggan, a dedicated human rights and anti-knife crime campaigner committed to making a\npositive impact in communities. With a passion for social justice, I actively work to raise awareness, influence policy\nchanges, and empowerment to take action against violence and injustice. Through my campaigns, Edwin aims to create\nsafer, more inclusive environments for all, advocating for meaningful change and support for those affected by\nknife crime.\nI am deeply committed to the welfare of my local community in Flintshire, and my latest concern is the impact of the vote\nagainst winter fuel payments, which is expected to affect around 8 million pensioners across the UK. This decision directly\nimpacts our community, and after hearing the concerns of residents, I have been asked to step in where possible.\nIn response, I have partnered with Age Connects North East Wales to provide real support to those affected.\nMy action plan, including the assistance available and how you can help\nothers if you're in a position to do so, has now been published here:\nWinter Assistance Fund.\nStay updated on my latest initiatives, events, and insights as I continue to champion the causes that matter.\nIf you would like to be kept up to date with my continuing campaigns please\nemail me and/or follow me on Facebook (Eddie Duggan)\nfacebook.com/edwin.duggan",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_have-your-say_html/content_13.html": "Have Your Say!\nWhether your issues are local or national, I am here to listen and act\nAs an advocate for human rights and anti-knife crime campaigning, I am dedicated to creating a safer and more just community for everyone. Your voice is crucial in this journey, and I am committed to ensuring it is heard and acted upon.\nWhile many speak of change, I have been actively working on the ground, addressing the pressing issues that matter most to you. From championing human rights to campaigning against knife crime, my focus has been on creating real, impactful change that reflects the needs of our community.\nThis is your opportunity to share your concerns, whether they are about safety, justice, or any other issue affecting your daily life. Over the past 18 months, I have worked closely with individuals, advocacy groups, and local leaders to understand the challenges we face. My work ethos is built on this foundation of active listening and engagement, and I want to continue hearing from you.",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_events_html/content_3.html": "I am truly honoured to be shortlisted for the 'Best Awareness Campaign' award at the True\nCrime Awards, which will take place in London on 5th June 2025.\nEvents like this are vital in keeping awareness alive, highlighting the need for accountability\nand justice, particularly in the fight against knife crime.\nChildren Heard and Seen - 10th Anniversary Celebration\nDate: Monday 28th October 2024\nLocation: Palace of Westminster\nI am honoured to announce my attendance at the 10th Anniversary Celebration of Children Heard and Seen (CHAS)\non 28th October 2024 at the Palace of Westminster. This charity plays a vital role in supporting children affected\nby parental imprisonment, and I am proud to be associated with their mission.\nRead more\nTrue Crime Awards\nDate: Thursday 5th June 2025\nLocation: London\nI am truly honoured to be shortlisted for the 'Best Awareness Campaign' award at the True Crime Awards, which will take place in London on 5th June 2025. Events like this are vital in keeping awareness alive, highlighting the need for accountability and justice, particularly in the fight against knife crime.\nChildren Heard and Seen - 10th Anniversary Celebration\nDate: Monday 28th October 2024\nLocation: Palace of Westminster\nI am honoured to announce my attendance at the 10th Anniversary Celebration of Children Heard and Seen (CHAS) on 28th October 2024 at the Palace of Westminster. This charity plays a vital role in supporting children affected by parental imprisonment, and I am proud to be associated with their mission. Read more",
  "https_www_edwinduggan_co_uk/https_www_edwinduggan_co_uk_campaign-parental-alienation-prevention-act_html/content_22.html": "Campaign to create the following Act into UK Legislation:\nParental Alienation Prevention and Resolution Act\nPersonal Reason for developing the proposed Act:\nAs someone who has personally experienced the devastating effects of parental alienation over the past five years, indeed, upon closer reflection the foundations were probably laid many years prior to this point, however, I chose to ignore the \"alarm bells\" ringing in my ears during multiple events when my place as a parent were minimised, for example being told many, many times that I was not the primary parent when clearly this was never a legal fact, and in fact both parents shared equal responsibility on all matters.\nI have witnessed firsthand the emotional and psychological toll it can take on a parent and I fear to even think of what psychological toll those first days, weeks, months may have had upon my \"little princess\".\nThe deep-seated pain, loss of trust, and severed relationships that result from such manipulation are not only profoundly damaging but also fundamentally unjust. My journey through this ordeal has underscored the urgent need for a comprehensive legal framework that can effectively prevent and address parental alienation. For me, any enactment of legislation in the form I propose will not serve my loss in any way, however, I lay this proposal before the Government insofar as ensuring that no other parent or child must endure the same anguish.\nBy advocating for the development of the Parental Alienation Prevention and Resolution Act, I aim to create a society where the emotional well-being of children is safeguarded, and healthy, nurturing relationships with both parents are promoted. This legislation would provide the necessary tools and support systems to identify, intervene, and remediate cases of parental alienation, fostering a just and fair family justice system. It is my hope that through this act, we can protect future generations from the heartbreak and trauma that I, and many others, have faced, and create a more compassionate and equitable society for all families.\nPreamble\nIn recent years, the issue of parental alienation has garnered significant attention, highlighting the urgent need for comprehensive legislative action. Parental alienation, a form of emotional abuse where one parent manipulates a child to unjustly reject the other parent, has profound and lasting effects on the psychological and emotional well-being of children. The current legal framework, while addressing various aspects of child welfare and \"custody\"/residence, lacks specific provisions to effectively combat this detrimental behavior.\nThe Parental Alienation Prevention and Resolution Act seeks to fill this gap by providing a structured and detailed approach to prevent, identify, and resolve instances of parental alienation. This act is built on the foundational belief that the welfare and best interests of children are paramount in \"custody\"/residence and access matters. By clearly defining parental alienation and establishing protocols for its identification and reporting, the act aims to create a safer and more supportive environment for children and their families.\nProposed Act: Parental Alienation Prevention and Resolution Act\nPurpose\nTo safeguard the emotional and psychological well-being of children involved in custody/residence disputes by preventing and addressing parental alienation.\nKey Provisions\nDefinition of Parental Alienation:\n- Clearly define parental alienation as a form of emotional abuse where one parent manipulates a child to unjustly reject the other parent.\n- Include examples of alienating behaviors such as badmouthing the other parent, limiting contact, and creating a false narrative about the other parent.\nIdentification and Reporting:\n- Develop standardized protocols for identifying signs of parental alienation, including psychological assessments and observations.\n- Require professionals (teachers, counselors, social workers) to report suspected cases of parental alienation to child protective services or the family court.\nTraining for Professionals:\n- Mandate comprehensive training for family court judges, lawyers, social workers, and mental health professionals on recognizing and addressing parental alienation.\n- Ensure ongoing education and workshops to keep professionals updated on the latest research and best practices.\nChild Impact Assessments:\n- Implement mandatory child impact assessments in \"custody\"/residence and access cases to evaluate the potential for and presence of parental alienation.\n- Require these assessments to be conducted by qualified mental health professionals.\nLegal Remedies:\n- Provide legal avenues for alienated parents to seek court intervention, including modifications to \"custody\"/residence arrangements, supervised visitation, or enforcement of existing orders (including punitive measures).\n- Allow courts to order therapeutic interventions, such as family counseling or reunification therapy, to address the underlying issues.\nSupport Services:\n- Establish support services for affected families, including access to counseling, mediation services, and parental education programs.\n- Create helplines and online resources for parents and children to seek advice and support anonymously.\nPublic Awareness Campaigns:\n- Launch public awareness campaigns to educate the public about the harmful effects of parental alienation and promote healthy co-parenting.\n- Collaborate with schools, community organizations, and media outlets to disseminate information and resources.\nImplementation\nEnforcement:\n- Assign a dedicated government body or task force to oversee the implementation and enforcement of the act.\n- Ensure collaboration between child protective services, family courts, and support organizations.\nMonitoring and Evaluation:\n- Regularly monitor and evaluate the effectiveness of the legislation through data collection, research, and feedback from affected families.\n- Conduct periodic reviews and make necessary adjustments to improve the framework.\nConclusion\nThis act aims to protect children from the damaging effects of parental alienation, promote healthy parent-child relationships, and ensure that custody decisions are made in the best interests of the child. By addressing this issue comprehensively, we can create a legal and social environment that supports the well-being of all family members involved.\nEdwin Duggan LLB (Hons)\nPublished 13th November 2024"
}