{
  "https_www_ryancoogan_co_uk_/https_www_ryancoogan_co_uk/content_1.html": "To do this, reform is essential in the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense would be a good start! The nation faces many challenges, but we can overcome them. To succeed. We must grow our way out of the crisis, we cannot tax our way out of it. We must stand up for our core democratic values, our civil liberties, our right to free speech. Let’s celebrate our pride in being British: our amazing culture.\nVote 'Coogan' for Cambridgeshire - the only vote that makes sense!\nA Stronger Cambridgeshire - From A Leader Who Fights For You!\nNo To Net Zero Madness!\nNet Zero policies are crippling Cambridgeshire's economy—driving up energy costs and killing jobs. We need an approach that works for people, not bureaucrats.\nKey Policies:\n• End Net Zero Mandates – Stop policies that destroy jobs and raise energy prices\n• Support for Farmers & Industry – Scrap restrictions harming agriculture and business\n• Support residents fighting against Ed Miliband’s disastrous net zero agenda.\n• Invest in Nuclear & Hydrogen – A practical, long-term energy strategy\n• Lobby national government for abolish regulations and policies that hold back Cambridgshire's businesses.\nDOGE Cambridgeshire! Efficiency Team\nRooting Out Waste, Keeping Taxes Low, Running Efficiently\nCambridgeshire taxpayers deserve value for money—not bloated bureaucracy. My DOGE (Department of Government efficiency) Cambridgshire plan will ensure efficiency and transparency.\nKey Policies:\nMore Local Control – Push for increased powers from Westminster.\nCut Government Waste – A dedicated efficiency team to slash unnecessary spending.\nLower Taxes – Keep council tax low by eliminating ‘woke wastage’.\nTransparency & Openness – Proper scrutiny of public spending.\nGrowth Cambridgeshire\nBacking Local Businesses, Driving Innovation, Creating Jobs\nBusinesses are the backbone of Cambridgeshire and Peterborough's economy, but they’re held back by red tape, weak infrastructure, and lack of investment. I’ll fix that.\nKey Policies:\nBusiness Start-Up & Growth Fund – Financial support for small businesses.\nFight to reduce tax and red tape that's holding our businesses back.\nCambs High Tech & Innovation Cluster – Attracting high-tech investment.\nAI & Big Data Digital Hub – Making Cambs and Pete, a leader in cutting-edge industries.\nCambridgeshire Business Network – A single platform to unite and support local enterprises.\nAdvocacy Team\nNavigating the local government is a tedious task, many times a call to local government feels so unproductive, so inefficient and wasteful and you get nowhere fast.\nKey Policies:\nIndependent advocacy team, fully accountable to the people, part of my direct authority team; which can navigate local government, and aid DOGE in finding the departments slowing things down, the departments masked in red tape, with the 'computer says no’ attitude. This is never helpful.\nTogether we can find the issues and solve your problems:\nI need the view from you the customer,\nI wish for everyone working in local government to serve the people. Serving and solving is filled with endorphins, making the job far more enjoyable!\nBe wholly and fully accountable to the tax payer.\nWhere a department is broken, I will fix it,\nWhere it is filled with stifling bureaucracy I will streamline it;\nWhere it is failing completely, it will be dismantled!\nPrioritising Locals\nPutting Cambridgeshire and Peterborough First in Housing, Services, and Support\nCambs people should come first — whether it's housing, social services, or public funding. For too long, we've been left behind.\nKey Policies:\nCambridgeshire Fair Share – Secure more funding from Westminster\nFighting against solar and wind farms on prime agricultural land.\nHolding flooding authorities to account to deliver overdue prevention work.\nManaged house building that works with the residents, not against.\nHomes4Heroes – A housing programme for veterans and service workers\nLocal Access Priority – Cambs residents get first priority for housing and services.\nFight for a better devolution deal for Cambridgeshire.\nBetter NHS & Social Care – Fight for better-funded local healthcare.\nGet Cambridgeshire and Peterborough Moving\nBetter Roads, Faster Transport, A County That Works\nCambs transport is slow, underfunded, and disconnected. Decades of neglect have left us with pothole-ridden roads, unreliable buses, and no long-term strategy. As Mayor, I’ll fix this\nKey Policies:\nTransport for Greater Cambridgeshire – A single body to oversee and improve transport.\nMajor Road Upgrades – Invest in key routes like A10, A1, A14, A11, M11, A47. I want to start the process of implementing the Great East Road.\nA Joined-up approach to transport. Integrating Road, Rail and Parking.\nScrap the Cambridge Congestion Charge\nWork to stop the Parking Fees in Peterborough and beyond\nReopen closed roads, including the Mill Road Bridge.\nStop the Coton Orchard disaster and bonkers busway.\nStop the war on the motorist, and welcome people into our towns and cities.\nOne Vote Counts:\nNot a career politician—A fighter who stands up for Cambridgeshire.\nProven track record - in Business, Advocacy, Volunteer work and as a Councillor\nStrong, unapologetic voice on key issues— education, crime, economy, and transport.\nRyan Coogan, The Mayoral Candidate for Cambridgeshire and Peterborough, is dedicated to bringing about positive change through reform and effective governance. With a focus on democratic values, civil liberties, and economic growth, Ryan Coogan aims to make a difference in the political landscape. Join us in this journey towards a brighter Britain.\nWelcome to my new page - designed to tell you a little more about myself - my interests and accomplishments; ‘a sort of CV for the top job’ to help raise awareness about a real choice and enable you to get in touch with your local community leaders on socials.\nEarly Life and Education\nRyan Coogan, originally from the East Cambridgeshire part of Newmarket, moved to Soham in 1989 and attended The Weatheralls School, Soham Village College, and later Hills Road College in Cambridge. Now a parent with children at Waterbeach Primary and Cottenham Village College, Coogan has deep roots in the local educational community, previously having been involved with Millfield Primary in Littleport.\nCareer Development and Business Ventures\nStarting his career with hands-on work on local farms, including manual farm laborer and tractor driving from a young age, Coogan gained significant experience early on. He started his first business at 12 years old, exporting toys to countries such as the USA. Most notably he developed, pioneered and marketed a biotech product which led direct research to find the solution to the MRSA superbug outbreak in Hospitals, saving thousands and potentially millions of lives. As well as being a pioneer in the prevention of the prevalent KHV in fish stocks, the Herpes Virus which played havoc in the early 2000’s. He progressed the efficiency and biosecurity of salmon farms and later shrimp farms, helping to produce higher yields and a better quality product. He entered the 2002 ‘whos who’ as a young entrepreneur to follow. He worked his way up through companies like Xerox and Sainsbury’s, including a notable role in the team that opened the Sainsbury’s store in Ely. Coogan has run several local businesses in the area, including a local logistics business in Huntingdon, with depots and operations across the region in; Peterborough, Wisbech, Ely, Cambridge, Huntingdon and St Neots. As well as other businesses spanning IT, eCommerce, PR, logistics, recruitment, animal health, and property. His career also includes extensive experience in healthcare, recruitment, retail, transport, biofuels, and renewable energy power stations. He has a deep care and understanding of the community throughout Cambridgeshire.\nSports and Community Involvement\nA passionate sports enthusiast, Coogan played at a high level in his youth. Has been involved in many local sports clubs and enjoys all aspects. His commitment to community service extends to past voluntary roles such as Technical Director of Sound and Lighting at the Kings Theatre in Newmarket and present, serving as a volunteer water bailiff for the Angling Trust around Ely. He collaborates with the Environment Agency and police to address illegal activities on rivers and lakes, including combatting pollution and poaching.\nLocal Advocacy and Achievements\nCoogan’s advocacy work has led to significant community impacts. He was instrumental in saving a school near Littleport from closure and improving a crucial junction on the A10 despite financial constraints, saving a predicted two deaths every ten years, and countless accidents. His efforts have also included helping to preserve the market in Downham Market, recognizing a local hero, by starting a campaign to honour and spread the news of the incredible Bill Tutte which led to a statue and memorial in Newmarket High Street, opening a social enterprise shop to provide teenagers with employment opportunities and valuable experience. Additionally, Coogan has supported the homeless in Peterborough, Wisbech and Cambridge by assisting in finding jobs, accomodation both short term and longer term and improving their well-being while stepping into the workplace and helping the less fortunate back into mainstream society, nominated and celebrated for both regional and national awards.\nDiversity and Leadership\nRecognised for his contributions to diversity, Coogan received a proud status award from the East Anglia Equality and Diversity Program for his efforts in disability awareness within business. As a former local councillor, he was known for his efficiency and effectiveness, serving as vice-chair and finance committee chair, during which he froze spiralling council tax for two years by finding budget efficiencies. Coogan also served as a police liaison, holding local law enforcement accountable, work he continues today across Cambridgeshire as well as contributing to policy development. Stepping down to focus on becoming elected in a major regional role. His commitment extended to the role of Church Treasurer for a diocese of Ely church, work which prevented a local church from closure.\nPolitical Vision\nIn politics, Ryan Coogan aims to leverage his extensive experience for the greater good. His goal is to use his role as a regional leader to enhance local health, wealth, family well-being, and overall happiness. Coogan’s policy details reflect his vision to reinstate the \"Great\" in Britain, guided by a dedication to improving the local community and addressing, and finding solutions to pressing issues locally, regionally and nationally. The local platform as a major elected individual will ensure that Cambridgeshire is put at the top table for investment, and that regional growth is achieved, prosperity returns from today’s dire situation in everything across the county.\nWe need the County to succeed, we need to place the honour and custodianship of Mayor in the hands of the only person with such diverse experience, a person with local experience, and national reach who can actually make it happen.\nThe Conservative, Liberal and Labour led public sector has failed Cambridgeshire. It is broken. Cambridgeshire needs Reform.\nPromoted by Ryan Coogan on behalf of Ryan Coogan, 124 City Road, London. EC1V 2NX - Copyright © 2025\nAll rights reserved.\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations.",
  "https_www_ryancoogan_co_uk_/https_www_ryancoogan_co_uk_my-contract-for-mayor/content_2.html": "THE PEOPLE’S CONTRACT\nThe Contract of Ryan Coogan, Reform UK Candidate for Mayor of Cambridgeshire and Peterborough\nIssued by: Ryan Coogan\nParty: Reform UK\nConstituency: Cambridgeshire and Peterborough Mayoral Election\nContact: ryan.coogan@reformparty.co.uk\nWebsite: www.ryancoogan.co.uk\nThis document represents my solemn commitment to the people of Cambridgeshire and Peterborough. As your prospective Mayor, I pledge to restore common sense to local governance, return power to our communities, and put your interests first. This manifesto is not a list of vague promises — it is a binding contract of intent, clarity, and purpose. Reform begins here.\n1. ECONOMY & ENERGY: COMMON SENSE REFORM\nEnd Net Zero Mandates: I will oppose top-down climate mandates that increase energy bills and harm local industry.\nSupport Local Farmers and Manufacturers: I will work to remove excessive restrictions and support agricultural and industrial revival.\nInvest in Long-Term Energy: I will push for practical energy development including nuclear, hydrogen, and proven technologies.\nChallenge Overregulation: I will actively campaign for the rollback of damaging national and regional red tape that stifles growth.\n2. EFFICIENT GOVERNMENT & LOWER TAXES\nCreate DOGE (Department of Government Efficiency): A new oversight body to audit waste and increase transparency across all departments.\nHold the Line on Council Tax: No frivolous spending. Every pound will be accounted for.\nDemand More Local Control: Lobby for the devolution of key powers from Westminster to better serve our region.\n3. SUPPORT FOR BUSINESS & INNOVATION\nBusiness Start-Up Fund: Establish targeted financial support for local entrepreneurs and start-ups.\nCut Red Tape: Tackle local bureaucracy and reduce unnecessary regulatory burdens.\nBring Tech Investment to Cambridgeshire: Champion the region as a national hub for AI, advanced manufacturing, and biotech.\nLaunch the Cambridgeshire Business Network: A platform for collaboration and growth across all sectors.\n⚖️ 4. TRANSPARENCY, ADVOCACY & ACCOUNTABILITY\nEstablish an Independent Advocacy Unit: A watchdog team to support constituents and businesses navigating council inefficiencies.\nAudit Local Government Performance: Introduce mandatory performance reviews and accountability systems across all departments.\n5. PRIORITISING LOCAL PEOPLE\nSecure Fair Funding from Westminster: Fight for Cambridgeshire’s fair share of public funding.\nHousing for Locals First: Prioritise new housing developments for residents, key workers, and service personnel.\nFix Local Infrastructure: Invest in repairing roads, expanding transport services, and improving regional transport.\nDefend Our NHS Services: Advocate for properly funded, locally managed healthcare delivery.\n✅ ACCOUNTABILITY CLAUSE\nIf elected, I will publish regular progress reports, hold quarterly town halls, and make all spending decisions transparent to the public. If I fail to meet these standards, I will not seek re-election.\nSIGNED,\nRyan Coogan\nCandidate for Mayor\nReform UK – Cambridgeshire & Peterborough\nwww.ryancoogan.co.uk\nPromoted by Teresa Randall on behalf of Ryan Coogan, 124 City Road, London, EC1V 2NX.\nPromoted by Ryan Coogan on behalf of Ryan Coogan, 124 City Road, London. EC1V 2NX - Copyright © 2025\nAll rights reserved.\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations."
}