{
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_weekly-update-from-chris-7th-feb-2025/content_10.html": "Weekly update from Chris -7th Feb 2025\nSussex Joins the Devolution Fast-track\nDevolution and local government reorganisation are hardly issues to set the pulse racing – but they matter. They’re part of how we push power out of Westminster and into local communities. They’re part of how we grow our local economy, create jobs and make sure Sussex punches its weight. They’re also how we can get a more joined-up approach to really complex issues that matter hugely to my constituents – like where to build new houses, how to integrate our transport system and improve local skills training to support local businesses.\nSo, it’s great news that this week Sussex and Brighton were welcomed as part of the Government’s fast-track devolution programme. This means there will be a new Mayor across the region, with elections planned in May 2026. For too long, Sussex (and pretty much everywhere south of London) has been a devolution desert – and I’m hopeful this change means extra power, resources and voice for our community.\nAt the same time, there’s also plans to simplify local government, so we have fewer and clearer local structures. In summary: unitary authorities are in, and two-tier district and county councils are out. This is a fiendishly complicated restructure, and much of the detail is to be worked out.\nTo be honest, I am concerned at the pace some of this is developing at, and I’d like there to be more input from local people – including our councillors – over the shape of this restructure. It’s also disappointing that because of these changes, local elections planned for May have now been postponed in East and West Sussex. I sympathise particularly for the candidates who had been campaigning hard and, most importantly, for voters who deserve the chance to choose their representatives.\nBut overall, this is a big and important step forward for Sussex – and if it can help create the jobs, growth and higher pay we need in Sussex, it may set pulses racing after all.\nChampioning mental health\nThis week is Children’s Mental Health Week, an important time to highlight the challenges so many young people face and the urgent need to improve mental health services and support.\nMental health is just as important as physical health, yet for too long, services have been stretched to breaking point. In particular, I’ve been struck by the number of young people in my constituency who are waiting years for a mental health assessment and the hoops parents have to jump through to get their kids meaningful support.\nRecently, I met with representatives from Brighton & Hove Citizens, who raised concerns about the need for stronger mental health support in our City. They ran a successful campaign for a new school-based counselling service, which was launched with funding from Brighton & Hove City Council. This initiative, created in response to a petition from local sixth formers, provides support for Year 9 students across the City. It’s a great example of what happens when communities come together to push for change, but we need to go further to ensure every young person gets the support they need.\nI’m also pleased that the new Government is recruiting 8,500 new mental health staff, introducing specialist mental health support in every school and walk-in mental health hubs in every community. This is a step change from the approach of recent years and can’t come soon enough.\nSo, this week, I’d encourage everyone to check in on friends, family, and colleagues— to have those honest conversations that can make all the difference. No one should be left struggling in silence.\nBrighton College’s Expansion Plans\nBrighton College is a major part of the landscape in Kemptown and is just a few streets from my constituency office. However, its latest redevelopment proposals have sparked a debate about the balance between the school’s expansion and the interests of local residents.\nThe College argue that its plans – which would see the College repurpose its primary school site and build a new boarding house with space for 150 students – will reduce pressure on local housing and improve traffic congestion. Yet concerns remain among residents – including those who recently came to my constituency surgery – about the impact on the surrounding areas and the character of the community. This also comes in the wake of the College having lost an appeal to convert three houses in Walpole Road after a Government inspector upheld the Council’s decision to refuse the application, citing concerns about “discordant expansion” of the College and the character of the area.\nBrighton College is expected to submit its formal planning application to the council any day now. Once the application is live on the council’s website, residents will have the opportunity to scrutinise the details and raise further concerns. I, along with local residents, will be carefully reviewing the application to ensure it is thoroughly assessed and does not negatively impact our community.\nI share many of the concerns voiced by residents regarding the scale of the College’s expansion and the impact on local housing and infrastructure. The speed and scale of development must be carefully considered to avoid undermining the character of the area and the well-being of its residents. The next stage in this process will be crucial. I will continue to monitor developments closely and work with the community to ensure we get the best outcome for Kemptown.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_petition-tell-morrisons-keep-your-promise-to-peacehaven/content_7.html": "Petition: Tell Morrisons — Keep Your Promise to Peacehaven\nPeacehaven has waited long enough.\nIn 2021, Morrisons announced plans to build a new supermarket at the Meridian Centre. But years later, the site remains empty, and Morrisons has now confirmed that the project is under review with no timeline for delivery.\nWe, the undersigned, urge Morrisons to honour their commitment to Peacehaven. Our town has huge potential, but we remain without a major supermarket — and the promises made must be kept.\nThis is about more than retail. It’s about community, investment, and fairness. Peacehaven deserves better.\nSign now to show Morrisons that our community is watching — and won’t be ignored.\nTell Morrisons — Keep Your Promise to Peacehaven\n933 signatures\nLatest Signatures\n| 933 | Anonymous | May 03, 2025 | ||\n| 932 | Anonymous | May 03, 2025 | ||\n| 931 | Katie M. | May 03, 2025 | ||\n| 930 | Victoria C. | May 03, 2025 | ||\n| 929 | Anonymous | May 03, 2025 | ||\n| 928 | Anonymous | May 03, 2025 | ||\n| 927 | Catrina B. | May 03, 2025 | ||\n| 926 | Janine F. | May 02, 2025 | ||\n| 925 | Anonymous | May 02, 2025 | ||\n| 924 | Anonymous | May 02, 2025 | ||\n| 923 | Heather B. | May 02, 2025 | ||\n| 922 | Anonymous | May 02, 2025 | ||\n| 921 | Anonymous | May 02, 2025 | ||\n| 920 | Beth O. | May 02, 2025 | ||\n| 919 | Anonymous | May 02, 2025 | ||\n| 918 | David B. | May 02, 2025 | ||\n| 917 | Anonymous | May 02, 2025 | ||\n| 916 | Anonymous | May 02, 2025 | ||\n| 915 | Anonymous | May 02, 2025 | ||\n| 914 | Brenda D. | May 02, 2025 | ||\n| 913 | Emma B. | May 02, 2025 | ||\n| 912 | Jennakate M. | May 02, 2025 | ||\n| 911 | Anonymous | May 02, 2025 | ||\n| 910 | Anonymous | May 01, 2025 | ||\n| 909 | Anonymous | May 01, 2025 | ||\n| 908 | Mark N. | May 01, 2025 | ||\n| 907 | Anonymous | May 01, 2025 | ||\n| 906 | Anonymous | May 01, 2025 | ||\n| 905 | Anonymous | May 01, 2025 | ||\n| 904 | Malcolm C. | May 01, 2025 | ||\n| 903 | Jacquie W. | May 01, 2025 | ||\n| 902 | Joann f. | May 01, 2025 | ||\n| 901 | Anonymous | May 01, 2025 | ||\n| 900 | Anonymous | May 01, 2025 | ||\n| 899 | Laura H. | May 01, 2025 | ||\n| 898 | Anonymous | May 01, 2025 | ||\n| 897 | Nicky P. | May 01, 2025 | ||\n| 896 | Emma S. | May 01, 2025 | ||\n| 895 | Anonymous | May 01, 2025 | ||\n| 894 | Carol B. | May 01, 2025 | ||\n| 893 | Anonymous | May 01, 2025 | ||\n| 892 | Anonymous | May 01, 2025 | ||\n| 891 | Michael W. | May 01, 2025 | ||\n| 890 | Anonymous | May 01, 2025 | ||\n| 889 | Susan R. | May 01, 2025 | ||\n| 888 | Julie H. | May 01, 2025 | ||\n| 887 | Marcial C. | May 01, 2025 | ||\n| 886 | Ann C. | May 01, 2025 | ||\n| 885 | Paul R. | May 01, 2025 | ||\n| 884 | Vivien C. | May 01, 2025 | ||\n| << < > >> |",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_job-openings/content_2.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_investing-in-britains-defence-benefits-us-all/content_15.html": "Running Brighton Half Marathon for Sussex Beacon\nWith Parliament back from recess, it’s been a particularly busy week in Westminster.\nOn Monday the Water (Special Measures) Bill became law. This will block bonuses for water company executives who pollute our waterways, introduce new sanctions on those who continue to break the law, and help improve monitoring of pollution. This is a huge issue across Sussex, given the terrible record of Southern Water and constant price hikes. So it’s welcome that the Government has taken the first of what I hope will be many steps in reigning in the water companies.\nAt the other end of its Parliamentary journey, the Police and Crime Bill was introduced to the Commons this week. This will give police new powers to tackle violent crime and anti-social behaviour (ASB), which has become one of the major challenges in parts of my constituency and many areas of Sussex. As I’ve said in this column before, ASB is not low-level: it ruins lives and livelihoods. So alongside the extra £200m the Government has allocated for neighbourhood policing, I hope this will help turn the tide against rising ASB.\nBut the major issue in Westminster, and across the country this week was the announcement that defence spending will rise significantly in order to confront the growing global threats we now face. I welcome this – particularly as it comes after a decade in which our armed forces have been criminally underfunded and hollowed out.\nBritain has rightly played a key diplomatic, military and humanitarian role in supporting Ukraine following Putin’s illegal invasion. I’m particularly proud of those – including in my constituency – who have opened their doors to Ukrainian families. But with the security of Europe now under renewed pressure, it’s right that the Government ensures we can protect our national security, rebuild our armed forces and reinforce our commitment to NATO. That’s why this week the Prime Minister announced the largest sustained increase in defence spending since the end of the Cold War – an increase that will mean not just a modernised and better equipped armed forces, but the prospect of more jobs and economic growth as well.\nAs a parliamentary aide (PPS) to the Prime Minister, I’ve seen up close his resolve and determination to make sure that our armed forces have the funding and resources they need to keep us – and Europe – safe in this new era. I’ve also seen the trade-offs and hard choices Prime Ministers have to make at times like this, which includes having to reluctantly fund extra defence spending through cuts to the international aid budget. This Prime Minister and my Party – the Party who created the Department for International Development and renewed it in 1997 – believe passionately, as I do, in the soft power of Britain’s aid budget. That’s why the Prime Minister has been clear that Britain will not step back from playing a key humanitarian role around the world in places like Sudan, Ukraine, and Gaza or in tackling climate change and supporting multinational efforts on global health challenges like vaccination. The PM was also clear that when circumstances allow, aid spending will increase. But at times like this, our own defence and security must come first. That’s a decision that was not easy, but will benefit Britain, Ukraine and our allies across Europe.\nBRIGHTON HALF MARATHON – FUNDRAISING FOR SUSSEX BEACON\nOn Sunday, I’ll be running the Brighton half-marathon alongside thousands of others. This is my first half marathon (wish me luck!!), and I’m delighted to be running it for the Sussex Beacon, who are one of the amazing charities involved in the Brighton Half, and are based in my constituency.\nFor more than three decades, the Beacon has been an integral part of our local community, providing specialist care and support for people living with HIV. I’ve worked closely with the Beacon and got to know many service users and staff over recent months. It’s an honour to be able to help support them in the half-marathon, especially as funding and the future role of the Beacon has been in doubt over recent months.\nDespite this, I am optimistic about the Beacon’s long-term future and have been in contact with the Beacon’s management throughout this difficult time. I hope that the move towards a community-based clinical model can help secure the Beacon’s future for years to come and ensure continued support for those living with HIV in our community.\nI hope to see many of you on Sunday – whether running or watching on! If you’d like to donate to help support the Beacon, you can do so here: https://www.justgiving.com/fundraising/chris-is-running-the-brighton-half-marathon-for-the-sussex-beacon\nCorridor Care at the Royal Sussex\nAs I covered here last week, I’m deeply concerned at the pressures on the A&E department at the Royal Sussex Hospital – despite the amazing work of staff who are frankly performing miracles in the most difficult of circumstances. So it was no huge surprise to read reports this week that The Royal Sussex are now recruiting staff to care specifically for people in A&E corridors. We should never normalise corridor care – it’s completely unacceptable for patients and for staff, and it’s an indictment of the state of the NHS after the last 14 years. I’ve raised this with the Health Secretary and I’ll will keep pushing for change and urgent improvement.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_net-zero-isnt-impossible-its-the-opportunity-of-our-time/content_16.html": "Net-Zero isn’t impossible, It’s the opportunity of our time\nWe’ve heard a lot this week from the Conservative Party and others that achieving our net-zero targets is “impossible”. I couldn’t disagree more. Decarbonising our economy is certainly a challenge, but it’s also the opportunity of our time and a chance to create new well-paid jobs, lower bills for good and drive growth and investment – both in Sussex and across Britain.\nLast year the net-zero economy grew three times faster than the economy as a whole, adding £83 billion and attracting record investment. Net-zero already supports nearly a million jobs across the country and 22,000 small and medium sized businesses (SMEs). Better still, these are more typically more productive and higher paid jobs than the national average and often include high-skilled apprenticeships and great opportunities for young people.\nThese are precisely the kind of jobs I’d like to see more of in my constituency – and why I’ll be making the case for more net-zero jobs and investment in Sussex. The potential here – with our coastline and natural resources, our skills and knowledge base, our clusters of SMEs and record of creativity and innovation – is enormous, particularly as the Government drives toward its mission of clean power by 2030 and our wider net-zero targets by 2050.\nThe other great opportunity of net-zero is the chance to end our dependency on volatile fossil fuel markets. We’ve all seen in recent years how dangerous this over-reliance on imported gas and energy can be – with our bills soaring and many households and businesses suffering. The best – in fact only – way to address this is to intensify the switch to renewables and to make sure our economy and our bills are no longer vulnerable to the whims of dictators like Putin. Giving up on net-zero and turning back to fossil fuels would be incredibly short-sighted and completely the wrong response.\nSo, while I don’t think opponents of the drive to net-zero are climate deniers, I do think they’re climate defeatists. And that alone would cost jobs, growth and waste the opportunity of our time.\nSupporting LGBT+ Veterans\nThis week, I had the privilege of welcoming the Minister for Veterans, Al Carns MP, to Saltdean Lido to meet with local LGBT+ veterans. This was organised alongside Fighting with Pride, an incredible charity that has been leading the charge in securing justice and recognition for veterans who were unfairly discharged from the armed forces due to their sexuality.\nI’ve been proud to work closely with Fighting with Pride to raise awareness of the injustices faced by LGBT+ veterans and to take the call to Parliament for meaningful change, recognition and financial redress. It was inspiring and deeply moving to hear firsthand from those – including many in my constituency – who served our country with such courage and dedication, only to be treated so unjustly.\nThe event was not only an opportunity to reflect on the progress we’ve made, but also a chance to discuss with the Veterans’ Minister the work that still needs to be done. There have been huge steps forward in recent years – in no small part because of the tenacity and courage of LGBT+ Veterans and Fighting with Pride – and I’m delighted that the new Government has increased funding and finally put in place a redress scheme.\nI’m incredibly grateful to Fighting with Pride, Minister Al Carns and the fantastic team at Saltdean Lido for making this event possible. I remain committed to ensuring that every veteran receives the respect, support and justice they deserve.\nTackling Hate and Vandalism in Our Community\nOver the past week, I’ve been deeply concerned by two incidents of vandalism in my constituency that have caused anger and concern among residents.\nThe first was the appearance of Nazi graffiti at a bus stop on Linchmere Avenue in Saltdean. This hateful act was not just an attack on public property, but an attack on our values. Our community has long been a place of diversity, inclusivity and respect – and there is no place for hate in Brighton Kemptown and Peacehaven or across Sussex. I’ve been in contact with local councillors and Sussex Police to ensure this graffiti was removed swiftly and to press for a robust response to any future incidents. I encourage residents to remain vigilant and report any further occurrences of hate-related vandalism. I want to say a special thanks to Cllr Mark Earthey and Saltdean residents who swiftly set about cleaning up the graffiti and supporting the local community.\nIn another upsetting incident, Queens Park’s play area— part of a £3 million investment in Brighton and Hove’s playgrounds — was extensively damaged by an appalling act of arson. This senseless destruction of a space designed for children is truly heartbreaking. The Council has acted quickly to make the area safe and is now working to replace the damaged equipment, with repairs expected to cost between £25,000 and £30,000. I’ve been in touch with the Council and Sussex Police to monitor progress and support efforts to hold those responsible accountable.\nThese incidents remind us how important it is to protect our community spaces and uphold the values that make Brighton Kemptown and Peacehaven such a welcoming place. I’ll continue working with local authorities, councillors and community groups to ensure that everyone feels safe and respected in our community.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_contact/content_14.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_school-catchment-plan-needs-a-rethink/content_17.html": "School Catchment Plan Needs a Rethink\nThere are few more important issues than making sure our schools give every child the chance to fulfil their potential. As a father of one, and soon to be two children myself, the choice and quality of our schools weighs particularly heavily on my mind.\nSo Brighton and Hove Council’s (BHCC) proposed changes to school catchment areas is something I’ve watched carefully. I know from the number of letters and emails I’ve received that many constituents are closely engaged in this too.\nI fully understand the motivation behind these changes. We need to address the school places challenge we face across Brighton, and the chronic educational inequalities that hold so many children back. It can’t be right that some children have a choice between multiple schools while others have just one. It also can’t be right that the choice of schools in the City is so heavily determined by house prices and the fortune of where your family happen to live.\nBHCC has already taken a major step forward by becoming the first council in the country to give priority in the admissions process to children receiving free school meals. This will make a huge difference and comes into place from September.\nBut I am particularly worried about two aspects of the current catchment proposals – and have raised this directly with BHCC in recent days.\nFirst, the potential impact on children with Special Educational Needs and Disabilities (SEND). As I set out in this column a couple of weeks ago, I’ve been working with local campaigners and families to improve local SEND services. The families I’ve been working with have told me just how important it is that our school system becomes more inclusive and better supports SEND children. So I’m concerned that the current catchment proposals may not deliver this, and could result in some children with SEND having to travel a long way, and potentially via multiple forms of transport, just to go to school. Frankly, that’s not realistic for many children with SEND that I have met, especially those with complex needs – and I worry could make a bad situation worse.\nSecond, transport. I’m already concerned at the cost, time and trouble that many local children endure every day simply to get to school. In areas of my constituency such as Whitehawk – where the nearest secondary schools are nearly three miles away – this is a particularly serious problem. I’ve raised this in Parliament and called for changes to school transport rules so that children who live miles away from their nearest school aren’t priced out of their education. I’m concerned that the current catchment proposals could exacerbate this and mean even more children have to travel long distances or across the City. This would, of course, mean more inconvenience, more costs and more complexity – both for families and BHCC.\nI’ve raised these concerns – as well as the impact of catchment changes on families living in parts of my constituency such as Queen’s Park – directly with BHCC. I know the Council are acutely aware of these challenges and are working hard to ensure the final proposals reflect concerns on both SEND and transport – as well as delivering greater equality and fairness in admissions.\nThose final plans are due shortly and I’ll be watching – along with many families – to ensure these concerns are addressed.\nBacking Votes at 16\nOne of the best things about being an MP is that you get to meet so many young and inspiring people. A couple of weeks ago, I visited Varndean College in Brighton to speak to their politics society. One of the first questions they asked me was when will Labour deliver their manifesto commitment to introduce votes at 16? I’ve long believed this would breathe new life into our democracy and give young people a proper say in their future. So I took Varndean’s question directly to the House of Commons, and asked the Leader of the House when there will be a vote on lowering the voting age. I was delighted that she confirmed this would likely be later this year, and in time for the next General Election.\nIt was also great to meet this week with one of our brilliant Youth Parliament Members alongside BHCC Deputy Leader Jacob Taylor. We discussed how we can ensure young people have more opportunity to take part in politics and shape our community, including securing funding to travel to Westminster for their upcoming Youth Parliament debate in the House of Commons.\nShocking rise in antisemitism\nAntisemitism is one of the oldest, and sadly still most virulent, forms of hatred. This week, figures from the Community Security Trust (CST) found that in 2024 there were an average of 10 antisemitic incidents a day in the UK – the second highest on record. In Brighton too there was a rise in recorded incidents, including shocking examples of antisemitism like holocaust denial and vandalism of synagogues and memorials.\nI’ve met with CST, the Jewish Leadership Council, the Board of Deputies and local Jewish groups over recent weeks to discuss what more we can do to tackle this. It’s clear there’s a huge amount still to do to provide reassurance and action against antisemitism in our own community and across the country – and I’ll continue to do everything I can do to support this.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_nhs-pressures-at-the-royal-sussex/content_5.html": "NHS Pressures at the Royal Sussex\nOn Wednesday, I met with the Chief Executive of the local NHS Trust (UH Sussex) and staff at the Royal Sussex County Hospital, which is in the heart of Kemptown in my constituency. What I saw was a workforce performing incredibly under huge and constant pressure.\nThere has been real progress in our NHS. Waiting lists are falling faster at UH Sussex than anywhere else in the country – down by 16% this year. The new Government has also met its target to deliver 2 million more appointments across the NHS. This will make a huge difference to the millions of people waiting for care, and comes alongside record NHS investment. But let’s be honest – our waiting lists are still far too high, and too many people are waiting too long for treatment.\nI’m also very concerned about the huge strain on A&E at the Royal Sussex. Seeing it first-hand, it was clear how much pressure staff are under, with corridors crowded, cubicles beyond capacity and the buildings in urgent need of an upgrade. The staff are performing miracles, but it’s an incredibly difficult situation that frankly lets down patients, staff and the local community.\nOne of the biggest problems I saw is that so people are now queuing to get out of hospital, as well as to get in. Around 25% of hospital beds at the Sussex are filled by patients who no longer need to be there but can’t be discharged due to a lack of adequate social care support, community beds or mental health services. It’s clear that if we’re ever going to relieve the pressure on frontline hospitals like the Sussex, we must tackle these blockages. That means changing how the NHS delivers care – pushing services out into the community and tackling the crises in social care and mental health. This is, of course, a huge task and one I’ll work with the Trust and the Government to deliver.\nSupporting the Sussex Cancer Fund\nI also met this week with the Sussex Cancer Fund. Having recently seen my dad undergo treatment at the Royal Sussex cancer centre, I’ve seen first-hand the incredible work that NHS staff, Macmillan nurses and the Sussex Cancer Fund do.\nThe Fund supports cancer services at the Sussex by providing specialist equipment, patient support, and funding grounding-breaking research. They’re working hard to expand their support, and with the second phase of the new cancer centre at the Sussex due to start next year (fingers crossed!) there’s now a real opportunity to dramatically improve cancer care for patients in Brighton and across Sussex. The Cancer Fund is an amazing charity, and I’ll do all I can to support them in achieving that goal.\nThe Community Pharmacy Crisis\nI also visited Dervis Gurol, superintendent pharmacist and owner of Healthy-U Pharmacy in Lustrells Vale, Saltdean. Pharmacies like this are the beating heart of our healthcare system, providing essential local services and picking up the slack from overstretched GP surgeries. Dervis – and many brilliant pharmacists like him – are also trusted points of care for thousands of local residents. Without them, I dread to think what our local healthcare would look like it.\nBut community pharmacies like Dervis’ are under huge pressure. Demand has skyrocketed – in part due to the shortage of local GP appointments – yet pharmacies big and small are closing at an alarming rate.\nIt’s clear that the current financial model for community pharmacies is not sustainable. The cost of buying medicines has risen by up to 60% in recent years, yet because the last government failed to deliver a new pharmacy contract, the funding they receive has fallen. Many pharmacists are now having to turn away patients because they can’t justify the cost of stocking certain drugs. Some are being forced to cut opening hours or stop home deliveries just to stay afloat. Others are seeing their business model crack under the pressure. As Dervis put it to me: the harder I work, the more money I lose.\nPharmacies are a lifeline for many people in Saltdean and across Sussex – especially older residents and those with long-term health conditions. We can’t afford to lose them. I will be raising this issue in Parliament and speaking with the Department of Health to push for urgent action.\nMeeting Residents in the Marina\nThis week, I held a “pop-up” surgery at the ASDA in Brighton Marina. My priority as your MP is to be as accessible as possible, and these pop-up sessions are a great opportunity to meet residents, hear concerns, and take action on the issues that matter most to you. A huge range of topics were raised – from NHS pressures to anti-social behaviour and support for children with special educational needs. I’ll be holding more of these across the constituency in the coming weeks, so keep an eye out for announcements. And as always, if there’s anything I can help with, you can get in touch at chris.ward.mp@parliament.uk.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_privacy/content_18.html": "We respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\n1. WHO WE ARE AND HOW TO CONTACT US\nChris Ward is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at chris.ward.mp@parliament.uk\n2. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\nyour use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a supporter of Chris Ward (the Campaign)).\nBy collecting such data, we will be able to inform you about relevant developments that relate to the Campaign and what you can do to help the Campaign as it progresses.\nIn order to advance the Campaign, we may share your data with other campaigns and movements that share the values, principles and aims of Chris Ward and/or the Campaign (including, but not limited, to other Labour Party elections) and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n3. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\nidentity data, including first name, maiden name, last name, username or similar identifier, marital status, title, date of birth and/or gender;\ncontact data, including address, email address and/or telephone number(s);\nfinancial data, including bank account and payment card details;\ntransaction data, including details about payments to and from you and other details of products and services you have purchased from us;\ntechnical data, including internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website and platforms hosting our content;\nprofile data, including your username, your interests, preferences, feedback and/or survey responses;\nusage data, including information about how you use our website; and/or\nmarketing and communications data, including your preferences in receiving content and/or marketing from us and your communication preferences.\nWe also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n4. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\nProvided by you – directly\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\nThis also includes personal data you provide when you register as a supporter of the Campaign, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\n5. HOW WE USE YOUR PERSONAL DATA\nThe uses\nWe will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\nRegister you as a supporter of Campaign and/or related campaigns;\nInform and engage you about the Campaign and/or related campaigns;\nInform and engage you with any other campaigns and movements that share the values, principles and aims of the Campaign (including, but not limited, to other Labour Party elections);\nManage donations, payments, fees and/or charges;\nComply with our legal obligations; and/or\nAnswer your queries and respond to your questions and/or complaints.\nThe legal bases\nWhere you have specifically consented to a particular use of your data (such as where you have subscribed to receive information about the Campaign);\nWhere you have entered into a legal agreement with us that necessitates that particular use of your data (such as where you make a payment or donation to us);\nWhere it is a necessary lawful basis for our legitimate interests and your interests and fundamental rights do not override those interests; or\nWhere we are obliged to process your data in a particular way by law (for example, if we are required to notify any authority or regulator of the nature or value of your donations).\n6. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\nTo enable transfers to take place (where appropriate);\nWhere we need to comply with a legal obligation; and/or\nWith suppliers who act as our ‘data processors’ and who provide the means of processing financial transactions including, but not limited to, Stripe, PayPal, The Labour Party and other commercial agents and partners of the Campaign and/or related campaign.\n7. WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nYou will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\nRight to object/Opting-out\nYou can ask us to stop sending you marketing messages at any time by contacting us at chris4brightonKTP@gmail.com\nYou have a right to opt-out of your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nWhere you opt-out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagement or transactions with us (so, for example, if you opt-out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\n8. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\n9. CHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n10. CHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n11. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n12. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n13. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n14. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n15. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them.\nRight of access\nYou may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\nWe follow the ICO’s “Subject Access Code of Practice” when dealing with requests for access to personal data. You can read this code by visiting https://ico.org.uk/media/for-organisations/documents/2014223/subject-access-code-of-practice.pdf.\nPlease note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\nYou can exercise this right at any time by contacting us at chris.ward.mp@parliament.uk and telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_category_general-news/content_3.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_category_campaigns/content_13.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_we-need-a-reset-with-the-eu-to-boost-trade-jobs-and-growth/content_11.html": "We need a reset with the EU to boost trade, jobs and growth\nIt’s been another busy week in Brighton Kemptown & Peacehaven, and in Westminster. In this week’s column I want to update you on plans for the new cancer centre at the Royal Sussex, a boost in funding for rough sleeping services in the City, and the future of the Sussex Beacon.\nI want to start, though, with something that remains one of the most important issues for my constituents but is now one of the least mentioned words in British politics – Brexit.\nIt’s now been nearly a decade since the Brexit referendum. We’ve had six different Prime Ministers and three general elections in that time, but our relationship with the EU remains unfinished business.\nI voted to Remain and I worked as an advisor to Keir Starmer when he was Shadow Brexit Secretary, so I’ve got more than my share of scars from the Brexit battles! I for one don’t want to reopen them – and Labour’s been clear about the red-lines we’ll stick to. But we do a need to reset our relationship with the EU and to be far more ambitious about building stronger ties on trade, defence, climate change and more.\nIt’s obvious that the current Brexit deal – negotiated by the Conservatives at the last minute – simply isn’t working. It’s harmed trade, jobs and growth. Businesses in my constituency tell me repeatedly that the extra costs of post-Brexit bureaucracy are holding them back. Young people tell me about the opportunities lost and horizons narrowed – particularly on rights to study and travel. There’s also no meaningful agreement on financial services or security, and our farming and fishing industries are both counting the cost of the Conservatives’ inadequate deal.\nOf course, the path to a better Brexit deal is littered with challenges and trade-offs – but I know a better deal is possible than the mess that was left by the last government. So I’m pleased that the Prime Minister has made this a priority, and has already reset relations with EU leaders. 2025 will be a big year for this and I will keep making the case in Parliament for the Government to do what’s needed to make Brexit work for local businesses and across Sussex.\nProgress on the re-build at the Royal Sussex\nMy constituency office in Kemptown is just a stones-throw from the Royal Sussex Hospital. The building site that currently stands empty next to the new Louisa Martindale building is a constant reminder of where the new Sussex cancer centre should be. But, like so many hospital rebuilds promised by the last Government, its yet to be completed, or even started.\nI’ve been pushing for progress on this ever since the general election, and on Monday the Health Secretary gave the very welcome news that funding has been allocated for the Cancer Centre to start construction next year. This will be part of the ‘first phase’ of hospital buildings under the new Government and is a major step forward. This week I spoke to Health Ministers and the local Hospital Trust about this and hope there will be more positive news in the months to come.\nExtra funding for rough sleeping\nWe face a homelessness crisis in Brighton and across the country, with record numbers of people now living in temporary accommodation. As I’ve said before in this column and in Parliament, this isn’t inevitable – it’s the result of political choices and a lack of proper funding and focus.\nI’ve met recently with brilliant local charities including the Clock Tower Sanctuary and JustLife as well as the Brighton Housing Trust, and I’ve been struck both by the amazing work being done in our City to support people who are rough sleeping or at risk of homelessness, and the ever rising demand.\nI’ve been making the case to Government for extra funding and focus on the homelessness crisis, so this week I was delighted to see a further £10m allocated to tackle rough sleeping, £275K of which will go directly to Brighton and Hove. This comes in addition to record funding for homelessness announced before Christmas, and the Government’s decision to finally ban no-fault evictions – which is now the biggest single cause of homelessness in our City. Of course, there’s a lot more that needs to be done to turn the tide on homelessness, but this is a great start.\nSussex Beacon update\nThe Sussex Beacon, who are based in my constituency, has been an iconic part of Brighton for the last three decades. The Beacon’s saved countless lives and helped generations of people living with HIV. So the news that the Beacon’s inpatient services are to close is a very difficult moment for many people and for the local community. I’ve been working closely with the Beacon and the local NHS Trust to help secure a stable future for the Beacon and to boost local HIV services. I spoke with the Beacon’s CEO this week and I’m hopeful that the proposed new model – which includes a shift to deliver additional community care – can help deliver this. I’ll continue to work with the Beacon on this keep readers updated.\nSpeaking of which, a quick reminder that the Brighton Half Marathon is fast approaching on 2nd March. I’m running it alongside the amazing Team Beacon runners – so if you can donate please do so by visiting https://tinyurl.com/yjn59jr5",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_getting-britain-building/content_9.html": "Getting Britain Building\nIf we’re honest, Britain’s economy hasn’t worked for years. Growth is too low, pay has flatlined, productivity’s stagnated, inequality’s widened. The last Parliament, incredibly, saw living standards fall. This has left many people – including in my constituency and across Sussex – feeling worse off, struggling to pay their bills or being able to plan for the future.\nThis serial economic failure is also the driver of so many problems we see all around us: broken public services, a chronic housing crisis, underfunded SEND and social care provision, shops closed on our high streets and unacceptable levels of poverty and inequality.\nGrowing the economy isn’t part of the solution to this: it’s THE solution. It’s how we boost jobs and wages, how we cut NHS waiting lists, revitalise our town centres, confront the climate crisis and build a fairer society. Without it, we risk being stuck in a doom-loop of decline, cuts and injustice.\nThat’s why Labour’s made economic growth it’s number one priority. It’s also why the Chancellor focused so heavily this week on getting Britain building again – because nothing underlines our economic failure more clearly than our inability to build the homes and infrastructure we need to drive growth. Britain hasn’t built a new reservoir since 1992, a new nuclear power plant since 1995 or a new full-length runway since the 1940s. In my own constituency, it took well over a decade for the Louisa Martingdale building at the Royal Sussex Hospital to go from planning to completion.\nThat’s why I’m pleased the Government is cracking on with speeding up the planning process – including by encouraging local councils to complete ambitious local plans as quickly as possible (As a reminder on which, Lewes District Council is holding a series of consultation events on their local plan in the coming weeks, and I’d encourage local residents to take part). A planning Bill to boost growth and kickstart stalled projects will also be brought before Parliament shortly.\nIt’s also why I support airport expansion – including at Gatwick and Heathrow – as long as this in line with our climate targets and legal requirements. If those obligations are met, airport expansion would mean thousands of jobs across Sussex and provide a welcome boost to UK growth and exports. That’s also why this is supported by so many trade unions and businesses.\nOf course, turning around our economy was never going to happen overnight. But focusing on growth, planning reform and getting Britain building again is absolutely the right place to start.\nLocal housing and anti-social behaviour\nI always say housing is the biggest challenge in Brighton Kemptown and Peacehaven, but anti-social behaviour (ASB) is not far behind. Week after week, I hear from residents at my constituency surgeries, in emails, and on the doorstep about the impact this is having on their lives.\nPerhaps the worst situation I’ve seen is at Wiltshire House, a block in the heart of Kemptown, where residents told me they feel utterly abandoned in the face of constant drug use, theft, and ASB on their doorstep. Wiltshire House has had scaffolding around it for months to deal with long-standing cladding issues – which isn’t just an eyesore and irritant for residents – it’s also providing criminals with easy access in and out of the block. People deserve to feel safe in their own homes, and right now, Wiltshire House residents have told me they do not.\nThe good news is that money is finally being spent to turn this around. More than £15m is being invested by Brighton & Hove City Council to tackle serious failings in hundreds of council homes, including Wiltshire House. My team are now working with Wiltshire House residents to ensure they get the security, repairs, and enforcement they need—and fast. That means pushing the council, police, and housing providers to get a grip on the issues and put residents first.\nSupporting local SEND services\nSome of the most distressing – and increasingly frequent – casework I receive is from parents supporting children with Special Educational Needs. Often this is because of the constant battle parents have gone through to secure an Education, Health and Care Plan (EHCP), to get the right school placement, or simply to access specialist services or family support. I know many neighbouring MPs across Sussex see this in their caseload too, and I’m increasingly worried about systematic failings in local and national SEND services.\nSo I was delighted to meet recently with Kirsti Hadley, a brilliant local campaigner fighting for changes to SEND services. Kirsti and I are now working together to find practical solutions to help tackle the SEND crisis, including setting up a local SEND Summit to bring together people who are affected by this issue. I’ll be writing more on this in coming weeks as I know too many families in our area have been let down by local SEND services for too long, and I’m determined to see real progress.\nAs always, I want to hear from you—whether it’s about ASB, housing, SEND, or any other concern. Please get in touch via chris.ward@parliament.uk",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk/content_1.html": "MP for Brighton Kemptown and Peacehaven\nThank you to everyone who voted, campaigned and supported us. It’s an enormous honour and responsibility to serve the community and Party I love. I’ll work hard to deliver the change we need across Brighton Kemptown and Peacehaven.\nPhoto: Andrew Gardner / The Argus\nAfter 14 years of Conservative failure, there’s a lot to do.\nHere’s my priorities for us.\nDonate Today\nBritain’s Future\nAbout Chris\nI’m Labour’s MP for Brighton Kemptown & Peacehaven. I was born and raised in Brighton and my parents grew up in Peacehaven. I’m a Brighton & Hove Albion season ticket holder and I care passionately about the City and the local community. I’ve worked for the Labour Party for much of the last 15 years, fighting for better housing, the NHS, a green energy revolution and a better Brexit deal.\n14 years of Conservative failure has left our public services at breaking point. NHS waiting lists are through the roof. The cost of living crisis has hit families hard. Rents and mortgages have soared. The climate crisis is being ignored.\nAs your elected MP I’ll work hard to ensure a fairer, greener future for our City. I’ll be a national voice for local people, and I’ll deliver Labour’s plans to tackle the cost of living crisis, cut NHS waiting lists and build more homes.\nOffice\n113 St Georges Road, Brighton, BN2 1EA",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_jobs_constituent-assistant-constituency-based/content_4.html": "We’re recruiting!\nIf you’d like to work in my Kemptown Office (113 St George’s Road, BN2 1EA) we currently have a vacancy for a Constituent Assistant.\nThis role will be a key member of the constituency team, responding to constituents’ enquiries and helping to ensure the smooth running of the office.\nPrior experience of working in an MPs office is welcomed, but not essential.\nSalary range is within IPSA guidelines (Pay, tax & benefits | IPSA) and dependent on experience.\nThe role starts from 1st April 2025 and the closing date for applications is March 10th.\nCore responsibilities include:\n- Responding to constituent enquires via email, phone and face-to-face\n- Ensuring constituent enquiries are dealt with promptly, sensitively and effectively\n- Logging casework and policy enquiries, maintaining databases and ensuring necessary actions are completed in a timely fashion\n- Supporting with constituency campaigns and events\n- Supporting casework and parliamentary staff as required to ensure the smooth running of the office\n- Attending constituency events as required\nTo apply please send a short covering note (max two pages) and CV setting out why you think you would be suitable for this role.\nPlease complete and submit the form below, or send applications to chris.ward.mp@parliament.uk with the subject heading Constituent Assistant application.",
  "https_chriswardmp_co_uk/http_chriswardmp_co_uk/content_12.html": "MP for Brighton Kemptown and Peacehaven\nThank you to everyone who voted, campaigned and supported us. It’s an enormous honour and responsibility to serve the community and Party I love. I’ll work hard to deliver the change we need across Brighton Kemptown and Peacehaven.\nPhoto: Andrew Gardner / The Argus\nAfter 14 years of Conservative failure, there’s a lot to do.\nHere’s my priorities for us.\nDonate Today\nBritain’s Future\nAbout Chris\nI’m Labour’s MP for Brighton Kemptown & Peacehaven. I was born and raised in Brighton and my parents grew up in Peacehaven. I’m a Brighton & Hove Albion season ticket holder and I care passionately about the City and the local community. I’ve worked for the Labour Party for much of the last 15 years, fighting for better housing, the NHS, a green energy revolution and a better Brexit deal.\n14 years of Conservative failure has left our public services at breaking point. NHS waiting lists are through the roof. The cost of living crisis has hit families hard. Rents and mortgages have soared. The climate crisis is being ignored.\nAs your elected MP I’ll work hard to ensure a fairer, greener future for our City. I’ll be a national voice for local people, and I’ll deliver Labour’s plans to tackle the cost of living crisis, cut NHS waiting lists and build more homes.\nOffice\n113 St Georges Road, Brighton, BN2 1EA",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_news/content_6.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_chriswardmp_co_uk/https_chriswardmp_co_uk_cookie-policy-uk/content_8.html": "This Cookie Policy was last updated on January 30, 2025 and applies to citizens and legal permanent residents of the United Kingdom.\n1. Introduction\nOur website, https://chriswardmp.co.uk (hereinafter: “the website”) uses cookies and other related technologies (for convenience all technologies are referred to as “cookies”). Cookies are also placed by third parties we have engaged. In the document below we inform you about the use of cookies on our website.\n2. What are cookies?\nA cookie is a small simple file that is sent along with pages of this website and stored by your browser on the hard drive of your computer or another device. The information stored therein may be returned to our servers or to the servers of the relevant third parties during a subsequent visit.\n3. What are scripts?\nA script is a piece of program code that is used to make our website function properly and interactively. This code is executed on our server or on your device.\n4. What is a web beacon?\nA web beacon (or a pixel tag) is a small, invisible piece of text or image on a website that is used to monitor traffic on a website. In order to do this, various data about you is stored using web beacons.\n5. Cookies\n5.1 Technical or functional cookies\nSome cookies ensure that certain parts of the website work properly and that your user preferences remain known. By placing functional cookies, we make it easier for you to visit our website. This way, you do not need to repeatedly enter the same information when visiting our website and, for example, the items remain in your shopping cart until you have paid. We may place these cookies without your consent.\n5.2 Marketing/Tracking cookies\nMarketing/Tracking cookies are cookies or any other form of local storage, used to create user profiles to display advertising or to track the user on this website or across several websites for similar marketing purposes.\n5.3 Social media\nOn our website, we have included content from Twitter to promote web pages (e.g. “like”, “pin”) or share (e.g. “tweet”) on social networks like Twitter. This content is embedded with code derived from Twitter and places cookies. This content might store and process certain information for personalized advertising.\nTwitter are located in the United States.\n6. Placed cookies\n7. Consent\nWhen you visit our website for the first time, we will show you a pop-up with an explanation about cookies. As soon as you click on “Save preferences”, you consent to us using the categories of cookies and plug-ins you selected in the pop-up, as described in this Cookie Policy. You can disable the use of cookies via your browser, but please note that our website may no longer work properly.\n7.1 Manage your consent settings\n8. Enabling/disabling and deleting cookies\nYou can use your internet browser to automatically or manually delete cookies. You can also specify that certain cookies may not be placed. Another option is to change the settings of your internet browser so that you receive a message each time a cookie is placed. For more information about these options, please refer to the instructions in the Help section of your browser.\nPlease note that our website may not work properly if all cookies are disabled. If you do delete the cookies in your browser, they will be placed again after your consent when you visit our website again.\n9. Your rights with respect to personal data\nYou have the following rights with respect to your personal data:\n- You have the right to know why your personal data is needed, what will happen to it, and how long it will be retained for.\n- Right of access: You have the right to access your personal data that is known to us.\n- Right to rectification: you have the right to supplement, correct, have deleted or blocked your personal data whenever you wish.\n- If you give us your consent to process your data, you have the right to revoke that consent and to have your personal data deleted.\n- Right to transfer your data: you have the right to request all your personal data from the controller and transfer it in its entirety to another controller.\n- Right to object: you may object to the processing of your data. We comply with this, unless there are justified grounds for processing.\nTo exercise these rights, please contact us. Please refer to the contact details at the bottom of this Cookie Policy. If you have a complaint about how we handle your data, we would like to hear from you, but you also have the right to submit a complaint to the supervisory authority (the Information Commissioner’s Office (ICO)).\n10. Contact details\nFor questions and/or comments about our Cookie Policy and this statement, please contact us by using the following contact details:\nChris Ward\n113 St Georges Road, Brighton, BN2 1EA\nUnited Kingdom\nWebsite: https://chriswardmp.co.uk\nEmail: chris.ward.mp@ex.comparliament.uk\nThis Cookie Policy was synchronised with cookiedatabase.org on January 30, 2025."
}