{
  "https_mt4mp_uk_/https_mt4mp_uk/content_1.html": "The people of Gaza/oppressed peoples or nations do not have a vote in this 4 July 2024 General Election – YOU DO HAVE THAT VOTE; your vote is your power – Use that power for ABDUL MAJID TRAMBOO to bring about justice and fairness for Gaza and people of Hounslow (Feltham and Heston).\nThe Labour Party and the Conservative Party have let down the people of Hounslow on all the fronts – Gaza, NHS, Social Care, Cost of Living, Education, Jobs, Pensioners and Environment – YOU HAVE A CHOICE; use that choice for Majid Tramboo who will advocate for Gaza and the people of Hounslow (Feltham and Heston).\nUse your vote to send a message from people of Hounslow (Feltham and Heston) – ENOUGH IS ENOUGH; the people of Hounslow (Feltham and Heston) cannot be taken for granted.",
  "https_mt4mp_uk_/https_mt4mp_uk_videos/content_2.html": "Date 4 july 2024\n@amtramboo Campaign Feltham high Street Majid TRAMBOO parliament election campaign today Team TRAMBOO VOTE FOR REAL CHANGE Vote Majid Tramboo #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #feltham #felthamlondon #hounslow\n♬ original sound – Abdul Majid Tramboo\nDate 4 july 2024\n@amtramboo Majid Tramboo is an International human rights and international humanitarian lawyer of more than 35 years experience in the UK, EU and UN. He is a renowned human rights defender. Vote for Real Change Vote Abdul Majid TRAMBOO #mt4mp #Election2024 #heston #change #vote #knifecrime #youthprograms #policing #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest #SME #businessrates\n♬ original sound – Abdul Majid Tramboo\nDate 3 july 2024\n@amtramboo Team TRAMBOO in Hounslow West Area Abdul Majid TRAMBOO parliament election campaign VOTE FOR REAL CHANGE Vote Abdul Majid TRAMBOO #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest\nDate 2 july 2024\n@amtramboo Inauguration of our campaign office in Feltham today. Thank you every one for coming and for your best wishes. Thanks TEAM TRAMBOO for all your efforts to make this event a success. Majid TRAMBOO parliament election campaign VOTE FOR REAL CHANGE Vote Abdul Majid TRAMBOO #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest\n♬ original sound – Abdul Majid Tramboo\nDate 2 july 2024\n@amtramboo Thank you Frank SCHWALBA-HOTH former MEP for your support VOTE FOR REAL CHANGE Vote Majid TRAMBOO #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest #mt4mp #feltham #felthamlondon #hounslow #heston #NHS #socialeqaulity #jobsforstudents\n♬ original sound – Abdul Majid Tramboo\nDate 30 june 2024\n@amtramboo Our plan for better deal for pensioners Vote for Real Change Vote Abdul Majid TRAMBOO #mt4mp #Election2024 #hounslow #change #vote #youthprograms #pension #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest\nDate 27 june 2024\n@amtrambooA generation of Londoners cannot afford their rent and many are forced to live in overcrowded or unsuitable conditions. Our plan to deal with the housing crises. Vote for Real Change Vote Abdul Majid TRAMBOO #mt4mp #Election2024 #hounslow #change #vote #youthprograms #policing #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest #housing ♬ original sound – Abdul Majid Tramboo\nDate 21 june 2024\n@amtramboo Todays campaign Afghan Centre Hounslow TW4 Vote for Real Change Vote Abdul Majid Tramboo Parliament Election Campaign. #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest #heathrow #afghans\n♬ original sound – Abdul Majid Tramboo\nDate 19 june 2024\n@amtramboo Husting by back Heathrow, an evening with all candidates from Feltham and Heston answering concerns raised by audience. Business rates and Small Businesses Abdul Majid TRAMBOO Vote for Real Change Vote Abdul Majid TRAMBOO #mt4mp #Election2024 #heston #change #vote #knifecrime #youthprograms #policing #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest #SME ♬ original sound – Abdul Majid Tramboo\nDate 9 june 2024\n@amtramboo Play for Gaza football tournament organised for this Saturday by Jibril Tramboo @jib94 People of Gaza/oppressed peoples or nations do not have a vote in General Election – YOU DO; your vote is your power – Use that power for MAJID TRAMBOO to bring about justice and fairness for Gaza and people of Hounslow (Feltham and Heston). #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #Trending #viral #fyp #foryoupage #foryourpage\n♬ original sound – Abdul Majid Tramboo\nDate 8 june 2024\n@amtramboo People of Gaza/oppressed peoples or nations do not have a vote in General Election – YOU DO; your vote is your power – Use that power for MAJID TRAMBOO to bring about justice and fairness for Gaza and people of Hounslow (Feltham and Heston). #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #Trending #viral #fyp #foryoupage #foryourpage #xyxbca\n♬ original sound – A Majid Tramboo – Abdul Majid Tramboo\nDate 8 june 2024\n@amtramboo people of Gaza/oppressed peoples or nations do not have a vote in General Election – YOU DO; your vote is your power – Use that power for MAJID TRAMBOO to bring about justice and fairness for Gaza and people of Hounslow (Feltham and Heston). #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah\n♬ original sound – A Majid Tramboo – Abdul Majid Tramboo\nDate 7 june 2024\n@amtramboo The Cost of Living crisis at home; the Global Warming and Climate change, social inequality and injustice, and unchecked exposure of our young to the Online Community—let us be united; #mt4mp #gaza #rafah #feltham #felthamlondon #hounslowwest\n@amtramboopeople of Gaza/oppressed peoples or nations do not have a vote in General Election – YOU DO; your vote is your power – Use that power for MAJID TRAMBOO to bring about justice and fairness for Gaza and people of Hounslow (Feltham and Heston). #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah ♬ original sound – A Majid Tramboo\n@amtramboo The Cost of Living crisis at home; the Global Warming and Climate change, social inequality and injustice, and unchecked exposure of our young to the Online Community—let us be united; #mt4mp #gaza #rafah #feltham #felthamlondon #hounslowwest\n♬ original sound – A Majid Tramboo\n@amtramboo I am Abdul Majid Tramboo #gaza #mt4mp #elections #elections2024 #lawyer #international #humanrights #Tramboo #oppressed #london #feltham #heston ♬ original sound – A Majid Tramboo\n@amtramboo Todays campaign Hounslow West Vote for Real Change Campaign Feltham high Street Majid TRAMBOO parliament election campaign Team TRAMBOO VOTE FOR REAL CHANGE Vote Majid Tramboo #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #feltham #felthamlondon #hounslowwest ♬ original sound – A Majid Tramboo\n@amtramboo Campaign Feltham high Street Majid TRAMBOO parliament election campaign today Team TRAMBOO VOTE FOR REAL CHANGE Vote Majid Tramboo #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah #feltham #felthamlondon #hounslow ♬ original sound – A Majid Tramboo\n@amtramboo Jobs for youth #youth #feltham #heston #election2024 #opportunity\n♬ original sound – A Majid Tramboo\n@amtramboo The people of Gaza/oppressed peoples or nations do not have a vote in General Election – YOU DO; your vote is your power – Use that power for MAJID TRAMBOO to bring about justice and fairness for Gaza and people of Hounslow (Feltham and Heston). #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah\n♬ original sound – A Majid Tramboo\n@amtramboo Majid TRAMBOO parliament election campaign launched today Team TRAMBOO VOTE FOR REAL CHANGE Vote Majid Tramboo #mt4mp #Election2024 #hounslow #change #vote #nhs #gaza #rafah\n♬ original sound – A Majid Tramboo",
  "https_mt4mp_uk_/https_mt4mp_uk_picture/content_4.html": "8th June Play for Gaza football tournament organised for this Saturday by Jibril Tramboo\n7th June Todays campaign Hira Mosque, Vote for Real Change TW14\n3rd June Todays Majid TRAMBOO parliament election campaign TW5\n1st June Todays campaign in TW4, Vote for Real Change\n31st May Majid TRAMBOO parliament election campaign launched today at Jamia Masjid Hounslow\nScroll to Top\nWe use cookies on our website to enhance your browsing experience and to improve our site. By continuing to use this website, you agree to our use of cookies in the manner described in our Cookie PolicyAccept",
  "https_mt4mp_uk_/https_mt4mp_uk_our-mission/content_6.html": "Abdul Majid Tramboo will fight to stop genocide in Gaza seeking immediate Cease fire.\nAbdul Majid Tramboo shall strive for better NHS delivery, better social care, cost of living reduced, better education and more jobs for the youth, enhanced pensions for pensioners and better strategy for the environment.\nOnly Abdul Majid Tramboo can bring about Justice and fairness for people of Gaza and people of Hounslow (Feltham and Heston).",
  "https_mt4mp_uk_/https_mt4mp_uk_our-team/content_5.html": "Abdul Majid Tramboo is an International human rights lawyer of more than 35 years experience in the UK, EU and UN. He is a renowned human rights defender.\nHe is recognised as a leading expert in human rights and humanitarian legal matters including the EEA and the UN mechanisms.\nAbdul Majid Tramboo is committed to work for fundamental freedoms by providing assistance to the people within the UK, EU and the United Nations framework. For this purpose, he has organised international conferences on critical issues such as women’s rights, children’s protection, terrorism and human rights, defending human rights in conflict zones and the right to self-determination.\nHe continues to advise and represent victims of human rights within the UK,EU & UN human rights system and conducts all this work on pro bono basis.\nAbdul Majid Tramboo strives for fundamental freedoms including the care for everyone within the NHS, job opportunities for the youth, better deal for pensioners in the environment of rising costs and caring for our environment.",
  "https_mt4mp_uk_/https_mt4mp_uk_contact-us/content_3.html": "Whether it’s a question about your local issues, policies, or you would like to know more about us please get in touch.\nPhone: Text:\nScroll to Top\nWe use cookies on our website to enhance your browsing experience and to improve our site. By continuing to use this website, you agree to our use of cookies in the manner described in our Cookie PolicyAccept"
}