{
  "https_www_syduzzaman_uk_/https_www_syduzzaman_uk_about/content_4.html": "About Me\nSyduzzaman (Sayeed)\nMany of you may not know me, but you have clapped for what I did during the COVID-19 pandemic period. Yes, I am a key worker who worked tirelessly to save lives and protect our NHS.\nI am Syduzzaman (Sayeed), a physiotherapist working for the NHS with dignity, honesty, and integrity for the last 13 years. As an NHS employee, I stood up for you when you were feeling unwell. I decided to transform my skills in caring for people to improve the community, and to participate in politics.\nIt is the honour of my life to be asked to stand as a Parliament candidate in Ilford South. I am your parliamentary candidate for Ilford South.\nThe oath I have taken to our King and State is that I will always work for the welfare of this country and in the service of the people. When I arrived in the UK 16 years ago, my father said, \"Where you live is your community, and you should always think about the development and service of the community.\" My parents instilled in me the principles of life: work hard, do the right thing, help those around you, and stand up for others. As a Muslim, ethnically Bangladeshi, my ethos and life experiences influenced who I am and helped me discover my conservative values.\nMy two lovely children grew up in the UK with fearless economic aspirations and freedom, learning the best of life in an inclusive community. My beloved wife, who works at the school, and I are all embracing sports and culture, taking the opportunity to contribute to important community causes.\nI have worked in different fields, including A&E, musculoskeletal, neurology, learning disability, and mental health, both in a hospital-based and community setting. I have created a strong bond and link within the health and social care services and professionals. With my experience, I would be able to influence and act as a liaison with the government to build a strong health policy for patients and NHS workers, reduce NHS waiting lists, and invest more in constituency development through research and a collaborative healthcare approach.\nThe diversity and inclusivity of the demographic changes make Ilford South unique in the London East area. 10 years ago, I started working at NELFT Redbridge community therapy service from 2014 to 2016. I developed a special bond with the constituents and started understanding their priorities. I observed that Redbridge provided its residents with numerous amenities. The very next year, I moved my residence with my family to Ilford.\nMy family and I have a very strong bond with Ilford South, especially our children started their schooling at Ilford South and started his first outdoor steps in South Park. What I see now is distressing: broken roads, potholes, no street name plaques, and most importantly, rising crime. So I will ensure that the government allocates as many available funds as possible to Ilford South's civil protection and police development. As your local resident, I am able to maintain direct communication with the residents, work towards resolving their issues, and speak on their behalf to encourage the government to invest more in my constituency.\nI believe many of you will find similarities in your life stories to my biographical story, thus making me more connect with you and making me a unique and outstanding candidate to be a Member of Parliament for Ilford South.",
  "https_www_syduzzaman_uk_/https_www_syduzzaman_uk_contact/content_2.html": "Skip to main content\nSyduzzaman (Sayeed)\nHome\nAbout\nDelivering for You\nContact\nHome\nAbout\nDelivering for You\nContact\nContact Me\nSayeed is your Ilford South Candidate\nADD YOUR NAME TO SUPPORT MY CAMPAIGN\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\n*\nPostal/Zip Code\nMessage\n*\nSubmit\nWebsite\nCreated & Hosted with Website.com\nWebsite Builder",
  "https_www_syduzzaman_uk_/https_www_syduzzaman_uk/content_1.html": "Former Conservative Parliamentary Candidate for Ilford South\nDelivering our five priorities will give you peace of mind today and provide the foundation for our plans to build a better future.\nA long-term plan for our NHS, more investment and more doctors\nIncreasing NHS funding for the next three years\nRecruiting 20,000 new police officers.\nBacking police budgets with £17 billion.\nProtecting front-line emergency workers.\nViolence Reduction Units and ‘hotspot policing’",
  "https_www_syduzzaman_uk_/https_www_syduzzaman_uk_blog/content_3.html": "DELIVERINGFOR YOU\nStick with the plan for long-term progress\nStrong Economy\nA stronger economy, reduce borrowing, lower mortgage rates.\nLower taxes, ending the unfair double tax on work.\nWorld-class education\nWe are delivering the biggest boost to school funding in a decade, setting up hundreds of free schools, and ensuring pupils with Special Educational Needs are not left out.\nNational Service\nNational Service to giving young people valuable skills to success in life More opportunities for young people, giving young people valuable skills\nTackling the cost of living\nWe are supporting the British people with a generous package of measures to help with the cost of living at this difficult time.\n£94 billion cost of living support package.\nNational Insurance Contributions cut.\nThe National Living Wage is up by £1,600.\nPensions Triple Lock protected.\nEnergy Price Guarantee\nMore affordable transition to domestic, sustainable energy. Prioritised energy security and family finance in our approach to Net Zero.\nControlled Immigration\nThis is a paragraph. You can write your own content here, and fill in the blanks. What's your story and where do you go from here? Tell the world about your business, and make this…"
}