{
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_crises/content_4.html": "COST OF LIVING CRISIS This is the No.1 issue for many voters. Rejoin EU supports anything to solve this. We support Citzens Advice Bureaus whose knowledge and expertise in this area is experience-based and extensive.\nRejoining the EU will help by bringing down imported food costs and recovering economies of scale that were lost when we left.\nHOUSING AND ENERGY COSTS Rents should be manageable. More social housing is needed. No fault evictions should be banned. Social tariffs may be needed for energy and utility costs. Rejoin EU will support any measure that helps.\nSMALL BOATS This started in about 2021, after we left the EU. To resolve it, we need to rejoin the EU and re-engage with the Dublin III regulation. We need to process people quicker, and have a practical, numbers-based, and human rights compliant immigration plan.\nHEALTH AND THE ENVIRONMENT Rejoin EU totally supports the NHS, free at the point of delivery, and other healthcare providers. Care for the environment is very much related, both locally, nationally, and at continental and global scales.\nSAFETY AND SECURITY People need to feel safe and secure in their homes, workplaces, shopping and leisure facilities, services, holidays, and web. Rejoin EU supports all measures to maintain and improve this.\nWAR AND PEACE Wars are awful. They destroy lives, cultures, and infrastructure. Rejoin EU supports Ukraine in its fight for independence from Russia, and deplores the awful violence on both sides in the Israel-Hamas conflict.",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me/content_1.html": "Somebody - almost anybody - makes a suggestion to the Commission. It could be the Commission itself, MEPs, ministers or civil servants or ambassadors or EU citizens individualy. A petition by a million EU citizens from a required number of member states is guaranteed to be heard.\nThe\nCommission checks that the topic is within an EU competence. If so, it sets in motion consultations and other processes needed. Consultations will typically go through one or more of the\nMEPs' parliamentary committees. During and after this, the Commission develops proposed legislation, trying to ensure that it will satisfy all members' governments.\nAlert member states will know all this. Even so, the Commission ensures that the national parliaments of\nall member states are informed of proposals a minimum of 8 weeks before they are put to the vote in the EU.\nThe proposals are then put to the Council (ministers of member states) and in most cases to the Parliament (MEPs), who vote independently on the matter. Only if both these bodies agree can the proposal become law.",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_about/content_5.html": "Edward is a sprightly 71-year old civil engineer who is now standing as a candidate in beautiful Hampshire constituency of Fareham and Waterlooville.\nEdward was born in Essex and brought up in Euston, Harlow, Woodford, and Sedbergh. He studied engineering at Cambridge and worked in the offshore energy industry and in research. Later, he taught engineering at the University of the West Indies before moving to look after a family house in Spain.\nEdward looks forward to moving to the constituency if elected to be Fareham and Waterlooville's new MP.",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_international/content_7.html": "Edward and the Rejoin EU party believe that rejoining the EU is the single most important step that Britain can take to repair its international relations, trade, security, and standing.\nWe support international action to promote peace, self-reliance and self-determination, and universal human rights, and to clean our oceans, control waste, care for nature, and tackle climate change.\nWe believe that migration and free movement are natural human activities, and that a country's duty is to welcome and manage flows of bona fide asylum seekers and others in difficult circumstances.\nWe believe in a strong defence, a well funded military, with security cooperation and support for and by our allies in Europe, NATO, and elsewhere.\nWe support Ukraine in its fight for freedom from Russia and its desire to join the EU. We deplore the awful violence on both sides in the Israel-Hamas conflict and wider Middle-East.",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_links/content_8.html": "Edward Dean - Rejoin EU\nHome\nCrises\nLocal\nNational\nInternational\nSoundbites\nF.A.Q\nLinks\nAbout\nEdward Dean - Rejoin EU\nHome\nCrises\nLocal\nNational\nInternational\nSoundbites\nF.A.Q\nLinks\nAbout\nLinks\nAll\nThe European Union\nThe European Union Website:\nhttps://european-union.europa.eu/index_en\nHow EU policy is decided:\nHow EU policy is decided\nHave Your Say portal:\nHave your say!\nThe ECJ website:\nhttps://curia.europa.eu/jcms/jcms/j_6/en/\nLocal services\nFareham Borough Council:\nhttps://www.fareham.gov.uk/\nHavant Borough Council:\nhttps://www.havant.gov.uk/\nHampshire County Council:\nhttps://www.hants.gov.uk/\nCitizens Advice Bureau:\nhttps://public.citafareham.org/\nThe Rejoin EU party\nParty website:\nhttps://therejoineuparty.com/\nParty manifesto:\nhttps://therejoineuparty.com/manifesto-2024/\nOur 26 candidates:\nhttps://therejoineuparty.com/general-election-2024/candidates/\nMusic\nThese are some of the songs I like\n(no suggestion that the musicians support me)\nSahara Moon -\nHarvest Moon\nJoe Cocker -\nI come in Peace\nSuzanne Vega -\nLuka\nChris Rea -\nRoad to Hell",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_faq/content_2.html": "Somebody - almost anybody - makes a suggestion to the Commission. It could be the Commission itself, MEPs, ministers or civil servants or ambassadors or EU citizens individualy. A petition by a million EU citizens from a required number of member states is guaranteed to be heard.\nThe\nCommission checks that the topic is within an EU competence. If so, it sets in motion consultations and other processes needed. Consultations will typically go through one or more of the\nMEPs' parliamentary committees. During and after this, the Commission develops proposed legislation, trying to ensure that it will satisfy all members' governments.\nAlert member states will know all this. Even so, the Commission ensures that the national parliaments of\nall member states are informed of proposals a minimum of 8 weeks before they are put to the vote in the EU.\nThe proposals are then put to the Council (ministers of member states) and in most cases to the Parliament (MEPs), who vote independently on the matter. Only if both these bodies agree can the proposal become law.",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_national/content_3.html": "Edward and the Rejoin EU party believe that rejoining the EU is the single most important step we can take to start the process of mending our people's and our country's spirit, pride, self-esteem, self-worth, health, safety, education, and secure wealth\nWe believe in a strong NHS and associated healthcare sector, good education, secure employment, fair pay and fair taxation, effective policing, social support and community care, responsible environmental and waste management, and non-discrimination.\nWe believe in honest, open, democratic, responsive, proactive, long-sighted and accountable politics",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_local/content_9.html": "Edward and the Rejoin EU party believe that rejoining the EU will assist the economy and finances of Fareham and Waterlooville constituents by helping to control food price increases, manage the cost of living crisis, making the country and the constituency safer, and creating new opportunities to find funding for the following and other endeavours:\nHousing: Developments need to fit in with existing space and be accompanied by more services including health, education, emergency, and transport infrastructure.\nFighting crime needs to be tough but fair: crime has a social and familial dimensions as well as legal ones.\nRegeneration. Waterlooville town centre needs cinema and leisure facilities especially for young people",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_terms/content_10.html": "Edward Dean - Rejoin EU\nHome\nCrises\nLocal\nNational\nInternational\nSoundbites\nF.A.Q\nLinks\nAbout\nEdward Dean - Rejoin EU\nHome\nCrises\nLocal\nNational\nInternational\nSoundbites\nF.A.Q\nLinks\nAbout\nHome\nTerms\nPromoted by Edward Dean, 1 Castle Street, Portchester PO16 9QD, on behalf of the Rejoin EU party, 86-90 Paul Street, London EC2A 4NE",
  "https_666af3769fca1_site123_me_/https_666af3769fca1_site123_me_soundbites/content_6.html": "Bad things got worse after Brexit. And some good things got bad. Nothing was gained, opportunities and freedoms were lost, and problems were created.\nRejoining the EU will help mitigate the cost of living crisis, and help local councils serve local people better. But it won't do everything. Other things need changing too. And a household costs index may be more useful for policymaking than a general consumer prices index.\nNational debt's ok if the interest payments are worth it for the thing or service you get early. But only if you can actually pay the principal and the interest later!\nImmigration is only a problem if it's mismanaged.\nNo fault evictions are the fault of landlords, and of governments that don't work for the people.\nFood banks exist, and are needed today.\nNet zero is an opportunity that will become a necessity. Let's seize it and make our economy great again!\nLet's try not to break international law. After all, we made most of it!"
}