{
  "https_ammar_vote_/https_ammar_vote/content_1.html": "I will stand up for the people of Edgbaston and stand up for those that need help the most.\nI will be your independent voice in Parliament, standing up for our community with compassion and integrity.\nI am a dedicated Neurology doctor working within the NHS at the local Queen Elizabeth Hospital. With a solid foundation in both medicine and business management, I graduated from Imperial College London and furthered my expertise by earning a master’s degree in public policy from Harvard University as a Fulbright Scholar. I am a Member of the Royal College of Physicians and a Fellow of the Higher Education Academy, reflecting my commitment to medical excellence and education.\nIn addition to my medical practice, I have contributed significantly to the academic community. I have served as an honorary clinical lecturer at the University of Birmingham’s medical school, where I also obtained a PGCME qualification in higher education. My passion for teaching and mentorship is evident in my dedication to educating the next generation of medical professionals.\nBeyond my professional life, I am an avid photographer, road cyclist and tennis enthusiast. I have previously played at the Edgbaston Archery and Lawn Tennis Society. I have deep roots in the Edgbaston community, having lived on Rotton Park Road and attended Lordswood Boys School.\nMy blend of professional expertise, academic involvement and personal interests makes me a well-rounded and dedicated advocate for the community.\nPolitical parties have ignored the public for far too long. They are all the same. The interests of the party, of big donors, and of the media are most important to them. The concerns of the local communities are not.\nLabour have been a huge disappointment, with U-turns on any hopeful or just policies. Keir Starmer has broken all the promises he made when seeking leadership of the party. It is clear that they no longer stand for the common person and that they cannot be trusted. The Tories have made our country an international laughing stock and are in disarray.\nIt is time for a different approach. It is time to vote for an Independent.\nI have no party or large donors to back me. I have the people of Edgbaston. As an independent, I will represent you and the issues that affect you the most. I will be your local voice, for the people of Edgbaston.\nI will listen with humility, respond with compassion, and act with integrity.\nI will not be parliament’s representative to you. I will be your representative to parliament.\nTo match other EU economies, including on much needed scanners, beds, buildings, and other physical equipment. Mental health, including Child and Adolescent Mental Health, and dentistry need a particular focus.\nPunishing parents for choosing independent schools is not the way to finance the state sector.\nSo that everyone earns enough to meet their daily needs. An end to zero-hours contracts to make employment secure.\nAnd drawing down student debt so that everyone who wants to can afford a university education.\nOf natural monopolies such as energy, water, and railways. This will ensure affordable bills, management that are accountable, and services not run for profit.\nFor drinks containers and other recyclable packaging, to reduce the litter on our streets and for greater sustainability.\nThe war on Gaza and its people is a clear case of genocide, ethnic cleansing, and war crimes. It is one of the greatest crimes of our age and in recent history. The condemnation from the UN and most respected international bodies supports this. The preliminary judgments from the ICJ and the ICC testify to it. However, this is not a recent phenomenon – oppression against the Palestinian people has been ongoing for over 75 years. Our country has had a key role in creating these conditions – from the initial Balfour declaration, to its current blind political and military support for the genocide. I know that the majority of the British public will be appalled at our government’s and Labour’s limp opposition to Israeli atrocities and their support for these war crimes in our name.\nThe mainstream parties have been surprised that normal, everyday people are appalled by Israeli atrocities and that the people want to publicly demonstrate this. The political establishment wants to restrict our ability to organise and for us to stay silent in the face of such barbarity. By pursuing this line, they are harming the very democratic fabric of our society.\nFor all nations, to achieve justice and peace."
}