{
  "https_jeffnewnham_org_/https_jeffnewnham_org_about-us/content_3.html": "MEET JEFF\na truly Independent Candidate for Bexhill & Battle\n\"The problem with elections is that no one wholly agrees or disagrees with any one Party's policies\" - Jeff Newnham\nDEFINING MOMENTS\nSchool report Ramsgate\nHaving good ideas since 1966. !\nBEHIND THE SCENES\nGet to Know Jeff\nDiscover some lesser-known facts about me !\nJudo Enthusiast\nI am a 2nd Dan black belt who volunteers coaching at 3 local judo clubs\nLifelong Learner\nEducated in farriery and passionate about continuous self-improvement.\nCommunity Builder\nActive in local issues , Community Land Trusts, equine charity work in Romania and Morocco.\nInventor\nDeveloped the glue-on horseshoe and adhesives, revolutionising equine hoof-care.\nFamily Man\nRaised three children as a single parent, a proud dad.\nNature Lover\nI enjoy sailing and badminton and staying active in the great outdoors.\ncontact me by clicking the button below\nPROFESSIONAL PATH\nMy Career Journey\nTrace the milestones that have defined my career, highlighting my dedication to innovation, community service, and leadership.\n1958\nBorn in Ramsgate, 1 of 7 children , grew up in a 3 bedroom terrace house. I formed an early love of the sea and sailing.\n1969\nMoved to Canterbury. Educated at Sturry Secondary School and later at Thanet Technical College\n1977\nRelocated to East Sussex, a significant move that marked the beginning of my long-standing relationship with the area that I would eventually seek to represent as an MP.\n1983\nAfter completing my education at the National School of Farriery in Hereford, I qualified as a Farrier in 1983. I started my farriery business in Hawkhurst, where I dedicated myself to advancing equine hoof-care.\n1989\nPurchased Horse & Rider Saddlers in Westfield, Hastings, diving into the world of local business. This venture expanded my connections within the community and provided valuable business management experience.\n1994\nDeclared Bankrupt. This challenging time taught me invaluable lessons about resilience and managing adversity. This experience of financial recovery gives me an informed practical approach to fiscal responsibility and economic development.\n2010\nDeveloped the glue-on horseshoe, an innovation in equine care technology that demonstrated my commitment to both entrepreneurship and animal welfare. Part of the 2012 London Olympic (Farriery) Team\n2022\nAfter coaching judo to children , young people and adults with Special Educational Needs I started working alongside East Sussex County Council to deliver educational and mentoring support to those with Educational Health Care Plans (EHCP) 2022,. I am committed to residents having greater say in local developments and in 2023 joined the Board of Marsham Community Land Trust looking at ways to provide housing to those with a connection to the area.",
  "https_jeffnewnham_org_/https_jeffnewnham_org_newsletter-sign-up/content_18.html": "Subscribe to receive the latest news and updates directly.\nJoin our community to get exclusive insights and updates from Jeff’s campaign. Don’t miss out!\nSubscribe to receive the latest news and updates directly.\nJoin our community to get exclusive insights and updates from Jeff’s campaign. Don’t miss out!",
  "https_jeffnewnham_org_/https_jeffnewnham_org_campaign-launch/content_8.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | May 27, 2024 | News | 0 comments",
  "https_jeffnewnham_org_/https_jeffnewnham_org_voting-methods-4/content_5.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | May 28, 2024 | News | 0 comments",
  "https_jeffnewnham_org_/https_jeffnewnham_org_manifesto/content_11.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | Jun 11, 2024 | News | 0 comments\nJeff Manifesto Click to view/download",
  "https_jeffnewnham_org_/https_jeffnewnham_org_voting-methods-2/content_19.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | May 28, 2024 | News | 0 comments",
  "https_jeffnewnham_org_/https_jeffnewnham_org_voting-methods/content_17.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | May 28, 2024 | News | 0 comments",
  "https_jeffnewnham_org_/https_jeffnewnham_org_contact/content_6.html": "Contact\nAddress\nPromoted by Connor Winter, Design & Print by Sparc PM Ltd.\n17 Eversley Road, Bexhill-on-Sea. TN40 1HA, on behalf of Jeff Newnham both at 4a Beaconsfield Road, Bexhill on Sea TN40 2BN\nOpening hours\nI will do my best to respond to all emails and phone calls within 24 hours\nPhone\n07907032030\njeff@jeffnewnham.org\nOUR SERVICES",
  "https_jeffnewnham_org_/https_jeffnewnham_org_bexhill-battle-by-ward-postcode/content_14.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | Jun 1, 2024 | News | 0 comments",
  "https_jeffnewnham_org_/https_jeffnewnham_org_how-laws-are-made/content_12.html": "How Laws are made\nHow Laws are made\nThis video describes the various processes of how laws are made.\non average there are 35 new laws made every year plus 3500 changes to existing laws made through Statutory Instruments of which about 1000 are done through Parliament.",
  "https_jeffnewnham_org_/https_jeffnewnham_org_category_news/content_4.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nSign up to my newsletter\nStay in the loop with the latest news.\nName\nEmail\nSubscribe\nNews\nPostcodes-Bexhill-and-BattleDownload",
  "https_jeffnewnham_org_/https_jeffnewnham_org/content_1.html": "Welcome to my campaign page\nJeff Newnham Independent Candidate for Bexhill & Battle committed to community\n\"The problem with elections is that no one wholly agrees or disagrees with any one Party's policies\" - Jeff Newnham\nSupport Our Campaign\nInsights into Politics\nDive deeper into the workings of politics with these short videos Understand the roles, processes, and the importance of your involvement.\nHow are laws made ?\nWhat do MPs actually do?\nPolling Day & General Election\nMeet Jeff Newnham\nI am a lifelong resident of East Sussex, I have has devoted my career to serving the community in various capacities—from my early days as a farrier and supporting equine charities, working with educational support to SN young people.& adults to community building developments. I am driven by a passion for genuine, accountable leadership which is why I am now stepping forward as an Independent candidate for Bexhill & Battle. My diverse experiences and steadfast commitment to this wonderful area make me equipped to represent the interests and voices of my fellow residents.\nJEFF NEWNHAM\nThere are many ways to vote once you are registered\nWhat are General Elections?\nElectoral Address\nLaunching my Campaign",
  "https_jeffnewnham_org_/https_jeffnewnham_org_electoral-address/content_16.html": "Promoted by Connor Winter on behalf of Jeff Newnham both at 4a Beaconsfield Road, Bexhill on Sea TN402BN\nWhat makes elections so tricky is that no one wholly likes nor dislikes any one Party’s policies or manifesto.\nAs an Independent MP my first and only job is to represent the views and wishes of my constituents.\nBeing an Independent MP puts me in a unique position to act in the best interest of my constituents without having to check with my Party first. This puts me totally at the disposal of my constituents.\n2024 is Democracy Year when over 4 billion people in various countries across the world will be voting in their own elections.\nI feel that 1 vote every 5 years is democracy light. What I propose is within the first few months of being elected as MP for Bexhill & Battle, there will be an online voting website for all constituents to vote on all House of Commons votes.\nEvery year over 30 new laws are made and over 3,500 changes to existing laws through statutory instruments. 1,000 of which need Parliamentary approval.\nThis means that your 1 vote for me will give you approximately 100 votes per year – 500 over the course of the next Parliament.\nTo truly represent the constituents of Bexhill & Battle, the result of the online voting will be delivered to the House of Commons as ‘my vote’. In this way everyone will have a local vote on National matters and the result of that vote will be the one I deliver.\nIf you are going to be affected by a particular piece of legislation or have strong views on a particular matter, this will be your opportunity to be heard and be counted.\nWork on this website is already underway and will require a login that will undergo checks against the electoral register.\nMy hope is that this unique opportunity will be embraced in full and will end the frustration of never being listened to and always being ignored. Your 1 vote for me will be 500 for yourself!\nThe current political system is unnecessarily adversarial. A good idea is a good idea, regardless of where it came from, and shouldn’t be opposed simply because it didn’t come from your Party. Too much time is wasted arguing, simply to look good to other party members and supporters, when the reality is that this simply wastes time and energy which could be better used. Working together is simply a good use of time and energy. There needs to be more collaboration rather than arguing if we are going to deal successfully and swiftly with the challenges facing us all.\nGreen issues affect us all and should be outside of politics. The internet was originally a military system, in order to keep operational even if one element was damaged. Our energy system should be similar. Every home should be self-sufficient and less dependent on one source of power. Every home should have rainwater collection for flushing and the roof utilised for solar power.\nI am a keen sailor and love using free wind power whenever possible and keeping engine use to an absolute minimum. Sailing inshore out of Sovereign harbour I have seen a deteriorating state of the sea caused by poor water and sewage management. This is simply unacceptable and fining these companies is having no effect on their careless environmental attitude. It’s their company – run it properly or get locked up, it really is that simple. These companies have a monopoly on their customers. Homeowners cannot choose who provides freshwater and handles the wastewater. It is time to look again at whether these companies should come under public ownership.\nAll developments in this area must be matched with sewage treatment capabilities. It is no use new developments connecting up to an inadequate system and thinking there isn’t going to be a problem. There is already a problem, which everyone is aware of! Let’s be honest about this and look at some solutions.\nThe cost of education through student loans results in newly qualified graduates moving abroad. Some of these are potentially Key Workers and should be considered part of our national resource. As such, all the time they are employed as Key Workers their student loan repayments should be covered by the country, as an incentive.\nOver the past 40 years running a farrier business in this area, I have probably driven up and down every country lane in East Sussex! It used to be that some of my clients lived at the end of a very bumpy drive that I would dread driving on, as often my van would bottom out and scrape the underside. Today this damage to my van is not just from those country lanes, it is now from every road I drive on. Speaking with my garage mechanic they are seeing a huge increase in the amount of ‘road damage’ to their customers’ vehicles. I have driven on many roads across Morocco that would put ours to shame – lovely smooth level roads that we seem incapable of building and maintaining here. It is shameful, and we simply must get on top of road maintenance – not just a quick patch up job here and there.\nBeing ‘on the road’ has meant that over the past 40 years I have built up a detailed knowledge of public conveniences across this area! Part of being a civilised society is having clean toilets available 24/7. The constant bickering in Bexhill between Rother District Council and Bexhill Town Council about who should own the toilets and who should maintain them must stop. I will be looking to mediate, in order to ensure the current situation is resolved. It is embarrassing that Bexhill has not 1 but 2 Councils, who between them cannot run a public toilet! This bickering must stop.\nSince my Legal Challenge to the Government on their proposed use of Northeye as an Asylum Centre for either Detention or Accommodation, approximately 50 Freedom of Information Requests have been submitted. Of these, 90% have been unanswered, with the Home Office hiding behind conventions or stating that it would take too long and exceed the cost allowed per request. If Government are fearful of information getting out, it follows they’re either embarrassed or they’ve done something wrong. They are never this shy in telling us when, on those rare occasions, they’re done something right that has worked!\nImmigration is now at unprecedented levels. Legislation has not caught up with the rate at which people are entering this country. We are caught between being seen to be charitable and being seen by those, wishing to enter UK, as a soft touch.\nThe problem, as always, is sorting out genuine asylum cases and those simply wanting to relocate, basing their chances on our system being so overwhelmed that their chances of making it and going unprocessed/undetected and not deported are in their favour and therefore worth the risk.\nAn effective deterrent must have a high chance of being caught and a high chance of enforceable consequence. At present there is neither and immigration will continue until robust measures are in place, ensuring that no matter how difficult the decisions are, the equality, rights and safety of UK citizens is held paramount.\nThe first thing we are told on an airplane is to put our own masks on first. When we send out invitations to an event, we always write RSVP. We do this in order to know how many we have to cater for.\nA country has to do the same. We need to know how many people we have to look after, and we cannot do this without a robust immigration policy that is enforced. Once we know exactly how many people, with the right to be here, we need to look after in hospitals, in schools and in housing, we can then look at how best to ensure everyone is able to access help and care whenever needed. But we simply cannot budget and tax without first knowing how many people we have to look after and ensuring this only includes those with the right to stay.\nIt is not known which Party will form the next Government. What we do know is that they must be held accountable, as history teaches us that many promises made at election time soon evaporate.\nRegardless of your own political persuasion, the one absolute promise I can make, is that I will make it my number one priority, to have in place an online vote for every person on the Electoral Register of Bexhill & Battle, giving you the opportunity to vote on every vote being conducted in The House of Commons, and guaranteeing that every vote cast will be counted. The results from these votes will then instruct me on what to deliver, as the view of the constituents of Bexhill & Battle, to The House of Commons.",
  "https_jeffnewnham_org_/https_jeffnewnham_org_author_jeff/content_15.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nSign up to my newsletter\nStay in the loop with the latest news.\nName\nEmail\nSubscribe\nNews",
  "https_jeffnewnham_org_/https_jeffnewnham_org_news/content_13.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign!\nSign up here\n.\nHome\nNews\nAbout me\nContact\nMake a Donation\nDonate\nHome\nNews\nAbout me\nContact\nMake a Donation",
  "https_jeffnewnham_org_/https_jeffnewnham_org_election-leaflet/content_10.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | Jun 3, 2024 | News | 0 comments",
  "https_jeffnewnham_org_/https_jeffnewnham_org_download-print-poster/content_20.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | Jun 7, 2024 | News | 0 comments\nmp poster",
  "https_jeffnewnham_org_/https_jeffnewnham_org_author_jeffjeffnewnham-org/content_9.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nSign up to my newsletter\nStay in the loop with the latest news.\nName\nEmail\nSubscribe\nNews\nPostcodes-Bexhill-and-BattleDownload",
  "https_jeffnewnham_org_/https_jeffnewnham_org_what-does-an-mp-do/content_7.html": "What do MPs do ?\nWhat do MPs do ?\nThis short video describes the work of MPs.\nMPs who are members of a Party have to split their time between Party activities and working for their constituents.\nAs an Independent MP my time will be devoted to constituency matters only.",
  "https_jeffnewnham_org_/https_jeffnewnham_org_what-are-general-elections/content_2.html": "Join our newsletter for exclusive updates and insights from Jeff Newnham’s campaign! Sign up here.\nby Jeff | May 28, 2024 | News | 0 comments"
}