{
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_about-lincoln/content_7.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nLincoln Jopp MC MP has represented Spelthorne in Parliament since July 2024. Before entering politics, he had a distinguished career in the British Army, where he served in multiple conflict zones, including Northern Ireland, Iraq, and Afghanistan.\nIn recognition of his bravery, he was awarded the Military Cross (MC) for his gallant and distinguished service during the Sierra Leone conflict in May-June 1997. He also commanded the Scots Guards in Afghanistan during the summer of 2010, earning the Queen’s Commendation for Valuable Service.\nAfter retiring from the military, Lincoln transitioned to civilian life, becoming the Director and Chief Operating Officer of The Pension SuperFund.\nHe lives in Sunbury, within the Spelthorne constituency, with his wife Caroline and their three children.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_defence-statement-25-02/content_29.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nToday the Government announced the increase to defence spending I've been calling for since my first speech in Parliament.\nI welcomed today's announcement and also had the chance to reflect on a valuable lesson I gained during my time in the army. Always prepare for the fight you don't want to have.\nWith the launch of a new Defence reform and efficiency team, I’m committed to holding the Prime Minister and Chancellor accountable. I’ll keep pushing to ensure every penny is spent wisely so that we’re ready for whatever challenges lie ahead.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_uk-us-bilateral-whd-5-02/content_26.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nThis afternoon, I spoke at a Westminster Hall debate on UK-US bilateral relationship, including a special mention of my fantastic Senior Parliamentary Assistant, Gloria.\nIn the current climate, it is vitally important that we foster strong and stable relations with the US.\nThere is a rich history between the two countries, one that was fought for in many battles. It has gone through many iterations and we must not let the current Labour Government derail such an important partnership.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_ashford-g-c-statement/content_12.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nPlease find below my statement on the update to the proposed Ashford Gaming Centre application.\nI would like to thank the many residents that have been in touch with me in the last 24 hours.\nAs you may know, yesterday, April 16th the Government Planning Inspector overruled the appeals made by Spelthorne Borough Council on the proposed adult gaming centre in Ashford.\nI am deeply disappointed by this outcome as you may know I took what was for me an unprecedented step of adding my voice to the thousands of other objections to this scheme. So, I, like you, am very frustrated that our voices have not been listened to.\nI do note that the Planning Inspector said in their judgement ‘at the time of writing this decision, the emerging local plan has not been found sound or whether any modifications are required. At the hearing it was agreed between the main parties that the emerging local plan is a material consideration, but any considerations carry limited weight.’\nToday, I have been in discussions with members of the licensing committee however it is not clear to me that, with planning permission already granted, this has the potential to stop the project. Nevertheless, I will share my concerns with Lisa Townsend, Police and Crime Commissioner for Surrey and Surrey GambleAware to see if there is any further course of action that we might take.\nOnce again, thank you to everyone for getting in touch.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_news-1/content_4.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nOn Saturday 7th, I was proud to take part in Small Business Saturday, an initiative celebrating the incredible contribution of small businesses to our local economy and communities.\nI greatly enjoyed visiting a range of independent shops, cafes, and pubs across Spelthorne and show support for local entrepreneurs and hear first hand about the challenges they face. Especially, give how the current government has so far failed to provide adequate support for small businesses.\nThank you to all businesses involved and I will continue to stand up for business owners in Spelthorne.\nOn Friday 13th December, I had the privilege of visiting Stanwell Family Centre, a cornerstone of support for families and children in our community.\nThe Centre, which offers a wide range of services to families in need, plays a crucial role in providing vital support, guidance, and resources to ensure that children and parents alike have the tools they need to thrive. From early years education and childcare to family counselling and community outreach, the centre is a lifeline for many local families, helping them navigate the challenges and build a better future.\nDuring the visit, I met with staff and discussed the demand for community support services and the pressures faced by local families.\nI am dedicated to standing up for stronger support for community-based organisations and ensuring that every family has access to the help they need.\nI had a fantastic visit to the Greeno Centre in Shepperton, a hub that plays a crucial role in supporting local residents, particularly vulnerable adults and the elderly.\nThe Centre, provides a wide range of services including day care for adults with additional needs, community outreach, and social activities for older residents, is an unvaluable resource for the Shepperton community. During my visit, I toured the facilities, met with staff and learnt about the challenges facing community centres.\nThe Greeno Centre is a key part of the Shepperton community, providing essential services and activities that help bring people together, improve well-being, and enhance the social fabric of the local area. Whether offering support to vulnerable adults, providing a space for socialising or delivering educational workshops. The Greeno Centre is a prime example of what a strong, compassionate community can achieve.\nI will continue to work hard to ensure that these vital services receive the support they need to thrive.\nI was pleased to meet the volunteers who comprise the Patient Participation Group (PPG) at Upper Halliford Medical Centre as well as Doctors George and Marina Kamil and the surgery staff.\nIt was interesting to learn how the surgery is managed, the challenges they face and the key initiatives that the PPG identified in their patient survey.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_laleham-ps-1/content_8.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI had a fantastic time at Laleham Church of England Primary School, celebrating 'Writing Week' with the students. Today’s focus was on world religions, and their curiosity was brilliant.\nA special shoutout to the pupils on the school council for giving me a thorough grilling, they would definitely keep some of my colleagues on their toes! They all certainly knew how to ask the tough questions.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_privacy-policy/content_10.html": "Signed in as:\nfiller@godaddy.com\nSign out\nAccount\nLincoln Jopp MC MP\nCopyright © 2024 Lincoln Jopp MC. All Rights Reserved. Promoted by Andrew Barrand on behalf of Lincoln Jopp MC both of 13 Station Approach, Ashford, TW15 2QN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_meeting-spelt-oystzone4-3/content_35.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI had a positive meeting this afternoon with the Minister for Local Transport, discussing getting Spelthorne into the Oyster Zone 6.\nIt was a productive first meeting and I'm looking forward to working alongside TFL to ensure Spelthorne gets the best possible deal. This is a step in the right direction for improving travel options and, with train fares going up (again), getting fares down.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_vets-dsc-11-03/content_25.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nToday, at the Defence Select Committee I asked the Veterans Minister whether he felt that he has fulfilled his obligations under the Armed Forces Covenant.\nOur veterans are under attack in the courts. We should be protecting them like they protected us when they served.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_contactless/content_16.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nSave the date! February 2nd (my birthday by the way) we will all be able to use contactless ticketing at train stations across the constituency, marking a significant step towards modernising local transport and improving convenience for commuters.\nContactless ticketing will be rolled out at stations in Ashford, Shepperton, Sunbury, Staines, Kempton Park and Upper Halliford and will ensure that commuters will be guaranteed the best value ticket available on the day. Although, if you’re using a railcard, you’ll still be required to buy a physical or digital ticket as the contactless system does not allow discounted travel.\nSince I was elected, I have been regularly campaigning for the introduction of contactless payments at train stations in the constituency. Whether you’re heading into London for work or popping out to visit friends, you can now simply tap in and out, no more fumbling for paper tickets. The introduction of contactless payment is a welcome step forward.\nLet’s make commuting simpler, more efficient, and more fun! Happy travels, everyone.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_olrc-school-visit-28%2F02/content_13.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nA fantastic time visiting the Year 6s at Our Lady of the Rosary Catholic Primary School who asked me asked questions about WWII as part of their studies.\nSome brilliant questions and thank you everyone for looking after me.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_m_create-account/content_18.html": "Signed in as:\nfiller@godaddy.com\nSign out\nAccount\nSign me up to receive exclusive member benefits via email.\nAlready have an account? Sign in\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nLincoln Jopp MC MP\nCopyright © 2024 Lincoln Jopp MC. All Rights Reserved. Promoted by Andrew Barrand on behalf of Lincoln Jopp MC both of 13 Station Approach, Ashford, TW15 2QN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_dwp-opq-17-03/content_28.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nThis afternoon I asked the Minister for Employment about so called 'sickfluencers' who show people how to game the benefits system.\nIt's time to crack down and ensure that support only goes to those who truly need it. I will continue to press the Government to protect hardworking taxpayers and make sure the welfare system is fair for everyone.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_bp-visit-1/content_3.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI had an amazing visit to BP’s global HQ in Sunbury. So much going on there.\nI met the security and intelligence teams as well as hearing about BP’s approach to ways of working, their environmental approach and the positive impact they strive for in the heart of the Spelthorne community.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_estonia-and-finland-visit/content_17.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nLast week I was away with the Defence Select Committee in Estonia and Finland both of which border Russia.\nMeeting the British Troops in Estonia was always going to be a highlight but I hadn’t expected to bump into a major from the Excellent Royal Dragoon Guards who was a youngster when we served together in Afghanistan in 2010.\nMeeting the various politicians and hearing their reactions to this week’s developments concerning Ukraine left a grave impression on me.\nI will take what I learned there back to the commons. As I said there recently in a debate, we seem to have forgotten the old adage: you should prepare for the war you don’t want to have to fight.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_starplayer-visit-9%2F03/content_22.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nSeveral parents who have children with SEN have been in touch, praising the Star Player Play Scheme which has been piloted at Matthew Arnold School and I took the opportunity to visit.\nI came away hugely impressed by everything Diop and the staff were doing. The children were happy and engaged, enthusiastically participating in sports and arts and crafts. The children are so obviously thriving in such a nurturing and supportive environment, and I have written to Surrey County Council to strongly encourage them to continue to fund this excellent programme, please find the letter below.\nFollowing my inspirational visit to Star Player Group at Matthew Arnold School, I took the chance to raise their ongoing funding at the highest level today.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_9-01-oyster-zone-trans-q/content_23.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nMy question to the new Secretary of State for Transport urging her to include Spelthorne into the Oyster Zone.\nI will continue to press the Minister on this issue, making commuting easier, more affordable and accessible for everyone.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_staines-army-cadets-19%2F2/content_14.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI visited the Staines Army Cadets where I inspected their muster parade and spoke to all the cadets individually.\nIt was great to see their commitment and dedication all under the watchful eye of Colour Sergeant Harriet Stallard.\nI was invited down by Cadet Corporal Sam Bailey who is busy raising funds for a trip representing the cadets in Australia in the summer. You can find Cadet-Cpl Bailey’s JustGiving link for his trip here: https://www.justgiving.com/crowdfu.../samuelbaileyacftrip...\nGreat initiative and an amazing opportunity to travel and grow.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_iwd-6-03/content_27.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nWe debated it in the House of Commons on Thursday.\nIt was a chance to sing the praises of Beatrice 'Tilly' Shilling who helped win World War II. I hope her story inspires girls and young women to get into defence and aerospace engineering.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_m_account/content_11.html": "Signed in as:\nfiller@godaddy.com\nSign out\nAccount\nSign in to your account to access your profile, history, and any private pages you've been granted access to.\nNot a member? Create account.\nLincoln Jopp MC MP\nCopyright © 2024 Lincoln Jopp MC. All Rights Reserved. Promoted by Andrew Barrand on behalf of Lincoln Jopp MC both of 13 Station Approach, Ashford, TW15 2QN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_academy-boxing-club-19%2F02/content_5.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nLast night I visited the Academy Boxing at Littleton Rec. A brilliant volunteer initiative that has 50 boxers and a waiting list of another 25.\nWe spoke about a range of topics including knife crime and how we can keep young people on the right path.\nA big thank you to Matthew, the Head Junior Coach who put me through my paces in the ring.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_m_login/content_24.html": "Signed in as:\nfiller@godaddy.com\nSign out\nAccount\nSign in to your account to access your profile, history, and any private pages you've been granted access to.\nNot a member? Create account.\nLincoln Jopp MC MP\nCopyright © 2024 Lincoln Jopp MC. All Rights Reserved. Promoted by Andrew Barrand on behalf of Lincoln Jopp MC both of 13 Station Approach, Ashford, TW15 2QN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_chagos-uq-5-02-25/content_30.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nThis afternoon I called for the Minister for Foreign, Commonwealth and Development about his understanding of the UK's membership of the International Courts of Justice and whether it is really the ICJ he is concerned about or a different court.\nThe Labour Party may claim that the Diego Garcia base on the Chagos Island was unsustainable and their deal makes it sustainable but I'd argue that paying £19 billion to Mauritius is indefensible.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_clarendon-ps-visit-14%2F03/content_20.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nIt was great fun to be back with Year 6 at Clarendon Primary School who are the first primary school to 'do the double' this season (visit me in Parliament and have me visit them at school.)\nThe Head, Mr Neale, is extremely experienced in SEN and we had an excellent conversation.\nYear 6 were, as ever, full of great, well-informed questions.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_ashford-park-ps-vist-1/content_21.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI had a fantastic visit to Ashford Park Primary School last week, where I had the privilege of speaking with dedicated staff and celebrating the incredible achievements of their pupils.\nAs I’ve visited schools across Spelthorne, one concern consistently stands out – the need for better SEND (Special Educational Needs and Disabilities) provision. Ashford Park was no exception.\nAs your MP, I remain committed to standing up for our children, supporting parents, and pushing for stronger SEND services across Spelthorne",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_worship-whd/content_32.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI was delighted to speak at the Westminster Hall debate on the continuation of the Listed Places of Worship Scheme.\nChurches and other religious sites in Spelthorne are vital beacons in our community, not just for religious worship but they’re a hub for local support.\nMy own church St Mary’s in Sunbury is a beautiful Grade II listed Church.\nI’m happy to hear that Labour have extended the scheme to 2026, I am, however, disappointed that have cut funding for the scheme. Upholding our heritage is incredibly important.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_17-12-labours-growth-plan/content_33.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nLast night I asked Labour’s “growth champion” about Labour’s plan for economic growth and whether they believe their increase to National Insurance tax is pro growth or anti-growth.\nHaving spoken to businesses all over Spelthorne in the last two months, it’s as clear to me as it is to them: this budget will shrink the economy, not grow it.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_saxon-primary-visit/content_6.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nIt was a pleasure visiting Saxon Primary School to meet with students and staff.\nI greatly enjoyed engaging with the pupils and listening to their thoughts and ideas about the world around them. It was particularly interesting to hear from Year 2 about their concern for the polar bears.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_news/content_2.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI was disappointed to see that the Ashford Gaming Centre has been given the go ahead. Please find my statement here.\nI had a fantastic visit to the Greeno Centre in Shepperton.\nThey provide vital support to elderly constituents, giving them a place to exercise, socialise amongst friends and take part in a range of different classes and services.\nI greatly enjoyed my visit to Stanwell Family Centre.\nThey offer so much for young families often in the most difficult circumstances.\nI was delighted to visit so many wonderful and hard-working businesses throughout the constituency on Saturday 7th.\nLincoln visits the Upper Halliford Medical Centre to speak to the Patient Participation Group.\nI had a fantastic time at my first Big Tree Night in Shepperton, with plenty of festive cheer.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org/content_1.html": "Fighting for a better Spelthorne\nSigned in as:\nfiller@godaddy.com\nFighting for a better Spelthorne\nLincoln Jopp MC MP is a highly decorated former army officer who won the Military Cross for bravery in Sierra Leone in 1997. Married with three children. Lincoln has a proven track record of public service and is honoured to have been elected as the Member of Parliament for Spelthorne at the July 2024 General Election.\nAs a family man and strong team player, Lincoln believes in the importance of a community working together. A proven leader and someone who never asks of others what he would not do himself, Lincoln will roll his sleeves up and energetically drive projects and initiatives to make Spelthorne an even better place to live and work.\nLincoln and his growing team want to help make Spelthorne an even better place to live, work, raise a family, and build a business. If you would like to help Lincoln then join our team today!\nLincoln was elected Member of Parliament for Spelthorne on July 4th 2024.\nSign up to hear from Lincoln and his team as they work across Spelthorne\n13 Station Approach, Ashford, TW15 2QN, United Kingdom\nContact me personally in parliament via lincoln.jopp.mp@parliament.uk",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_manor-mead-visit-1/content_15.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nIt was wonderful to visit Manor Mead School in January.\nIt was inspiring to see the incredible work being done to support students with severe and special education needs (SEN). From the dedicated staff to the bright, enthusiastic students, the entire school was remarkable.\nI will continue to help parents and children with SEN get the right help and support they need for success.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_staines-health-20%2F01/content_31.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nI raised the crucial issue with the Secretary of State for Health and Social Care about securing vital funding for the Staines Health and Well Being Centre.\nI'm pleased to report that the Secretary of State has committed to reviewing the situation, and I will continue to push hard for the resources our community deserves.\nStaines have some of the highest health needs and inequalities across Surrey.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_in-parliament/content_19.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\n17/03/25\nMy question to the Minister for Employment.\n11/03/25\nQuestioning the Veterans Minister.\n06/03/25\nInternational Women's Day debate.\nThe civil service needs reform.\n04/03/25\nMy meeting with the Minister for Local Transport about getting Spelthorne into the Oyster Zone 6.\n25/02/25\nThe Labour Government has announced an increase to defence spending\n05/02/25\nMy question to the Minister of State for Europe, North America and Overseas Territories\n05/02/25\nI spoke at a Westminster Hall debate on UK-US bilateral relationship.\n22/01/2025\nI spoke at the Westminster Hall debate on the continuation of the Listed Places of Worship Scheme.\n20/01/2025\nI asked the Secretary of State for Health and Social Care about re-visiting funding for Staines Health and Well Being Centre.\n9/01/2025\nPressing the new Secretary of State for Transport on getting Spelthorne into the Oyster Zone.\n17/12/24\nI questioned Labour's plans for growth and whether they believe their increase to National Insurance is pro-growth.\n9/12/2024\nI asked the Minister for Children and Families for a meeting to discuss sixth form provision in Spelthorne.\n2/12/2024\nI raised a deportation case with the Home Secretary.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_civil-service-reform/content_34.html": "Signed in as:\nfiller@godaddy.com\nSign out\nAccount\nThe Civil Service needs reform.\nToday I had the chance to ask the Government whether they are actually delivering on that or whether it's just words.\nLincoln Jopp MC MP\nCopyright © 2024 Lincoln Jopp MC. All Rights Reserved. Promoted by Andrew Barrand on behalf of Lincoln Jopp MC both of 13 Station Approach, Ashford, TW15 2QN\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_lincolnjoppmc_org_/https_lincolnjoppmc_org_assisted-dying-comment/content_9.html": "Signed in as:\nfiller@godaddy.com\nSigned in as:\nfiller@godaddy.com\nThank you to everyone who wrote to me and spoke to me in the run up to the Assisted Dying debate and vote on Friday 29th November.\nHere is the speech I would have made had I been called to speak:\n'Thank you, Mr Speaker, I have wrestled with this issue and have found it difficult to decide on. I have now realised why. This private member’s bill coming here today asks me to choose between compassion for the dying and protection of the vulnerable innocents.\nI have known friends die in pain, suffering and indignity. I wish they hadn’t had to. My friend Charlotte with motor neurone disease; Jacob my 19 year old constituent with osteosarcoma and metastatic spinal cord compression; Nick who couldn’t get pain relief over a weekend in a private hospital.\nIf it were a member of my own family, I would do what they wanted and take my chances with the courts. I also agree that the State has the right to take life under certain circumstances. I was, after all, a soldier for 25 years.\nI also believe in the right to commit suicide. Indeed, we have decriminalised it. And yet, if I were to see someone about to throw themselves off a bridge or under a train on the way home tonight, I would try to stop them.\nIt may be that there are some circumstances where individuals and even the state would be right to hasten death. And if there were a consensus among clinicians that there are one or two conditions which are always terminal over a very predictable timeframe and that palliative care doesn’t work in these cases, I’d be prepared to vote in that law for Charlotte, for Jacob and for Nick.\nBut I am not prepared to concede that principle for the Bill we have in front of us today. I see this Bill as a Trojan Horse. I am being asked not only to vote on the Bill tabled today, but also on the changes to it which will come over time if I do. And whilst I have compassion for my fellow man and woman, I also have a responsibility to protect the vulnerable from the darker side of human nature which also undoubtedly exists.\nWe need much more consideration of this. I welcome Gordon Brown’s advocacy for a Royal Commission on end of life care.\nThe fact that I am limited to just a few minutes in this chamber to speak on a matter of seismic importance to the social and moral fabric of our country, tells me and my constituents all we need to know about this rushed process for a bad bill.\nI know that they say that hard cases make bad law. Well, if I have my way today, we will not be making any law at all. For that reason, but with a broken heart for my dead friends, I will be voting against this Bill.'\nDuring the further passage of the Bill, I will work to make it a much better law than the one I voted against on Friday.\nAnd if I can’t, I will likely vote against the Bill at third reading."
}