{
  "https_russ4eastleigh_co_uk_/https_russ4eastleigh_co_uk/content_1.html": "Don't follow the sheep\nVote for Russ to bring our community together, to make it stronger, more prosperous and focused on what matters most!\nAbout Russ Kitching\nSerial entrepreneur Russ Kitching is a Man On A Mission – to make a positive difference in the community of Eastleigh.\nBorn and raised locally, he joined the Metropolitan Police as a cadet and lived in Canada for six years before returning to the UK in the 1980s to develop and launch a soft drinks business. That business, based in Chandler’s Ford, continues to be successful.\nHowever, Russ is perhaps best known for his involvement in saving 300-year-old The Lapstone Pub in Fair Oak from probable demolition and redevelopment. He is very proud that The Lapstone has become ‘a hub more than a pub’, known for its friendly welcome and well supported by locals.\nRuss explains: ‘Pubs and Social Clubs are the pillars of society and where communities unite and feel connected.’\nAs well as being a business owner, Russ is a qualified yoga teacher and works with local community projects – including teaching yoga to adults with learning difficulties, which Russ describes as the best hour of his week.\nRuss commented: ‘I am not interested in a career in politics, I am just interested in making a difference locally. Local issues are best dealt with by local people. The party political machines run from central offices are too distant to have a hands-on approach. I believe in doing not saying and making a difference to local lives.’\nRuss' Policies\nCommunity First\n- Community cohesion and community connection should be at the core of everything that we do at a local level. Wherever possible, policies should be based upon this principle.\nCommunity Connect\n- If we spend more time supporting our neighbours, looking after our communities, and doing what we can for those around us, the burden on the state is reduced, we all have a better understanding and respect of each other’s needs, beliefs, and priorities, and this will lead to less crime and anti-social behaviour and more social responsibility.\n- I want to introduce ‘Community Connect’: a simple neighbourhood app where people can post everyday tasks that they need help with – from companionship, to mowing lawns, to borrowing tools. We need to use technology to facilitate closer community ties and support each other. Children and young adults can earn points on this app for helping their neighbours, and these points can be used when applying for universities or colleges (as examples of community engagement) or in job applications. They can also be redeemed for local business services – local businesses (cinemas, hair dressers etc) could sign up to allow community points to be redeemed against their services. We need to reward those who contribute most to our neighbourhoods and communities, and support those who, through no fault of their own, require more assistance than others.\n- Alongside Community Connect, I would introduce a community service programme for young adults – similar to the cadet programme that the police ran when I was in training. School leavers will be asked to complete a number of hours of sport, academia, charity work, or community work for 2 years. This will be mandatory.\n- We need to invest in our youth and use our community schemes and Community Connect to give them places to go and things to do which mean they don’t get drawn into crime and anti-social behaviour. We should reward them for contributing to society.\n- We also need to invest in our country’s health by tackling issues at the source. We should all be encouraged to stay fit and healthy, and a windfall tax should be applied to ‘big pharma’ who massively profit from our health system.\n- Social care and healthcare improvements should be funded by this big pharma windfall tax, and by defence cuts – spending on unnecessary international wars should be eliminated.\nHomes\n- We need to encourage first time buyers by introducing a fixed-rate government bond which young people can access to get affordable mortgages which are not subject to fluctuating interest rates.\nBusiness\n- In Eastleigh, we are extremely lucky to have fantastic transport links, and an Airport. We also have two wonderful Universities just outside the Borough with very talented individuals. We need to make use of this by encouraging more local enterprise, and doing whatever we can to invest in local businesses. We need to help local businesses grow, so that they in turn can offer fantastic employment opportunities and competitive wages to our local residents. Eastleigh has so much going for it – we need to put it on the map!\n- However, our buses are not at an acceptable standard. Money should be set aside by the County Council to subsidise routes which are important for local people but which may not be profitable for operators.\nDirect Democracy\n- Instead of party whips getting MPs to hold the party line. I will set up an interactive poll for electorate to vote on bills going through Parliament before voting. The polls will be complied and a vote can be placed on behalf of the electorate instead of holding a party line. A bit like voting for your player of the game by Saints members.\n- True democracy and involving everyone throughout the term not just every 3 years.\nGet to know Russ and what he stands for\nIn The Press\n- Eastleigh News, 7 June 2024: Pub Landlord candidate pledges half of MP salary to charity\n- Eastleigh News, 10 June 2024: General Election: Six candidates for Eastleigh confirmed\n- Eastleigh News, 13 June 2024: Pub Landlord Vows to Deliver Chickenhall Lane Link Road"
}