{
  "https_zebunisarao_com/https_zebunisarao_com_the-community-speaks/content_4.html": "Please leave a comment or get in touch if you are able to help with any of the problems mentioned by members of the community.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_zebunisarao_com/https_zebunisarao_com/content_1.html": "Welcome\nIn the early era of what we imagined would be a bright and civilised 21st Century, we instead have witnessed a so far 8 month long genocide. Two worlds, side by side, one thriving, and one dying.\nWe, the people, of every creed, colour and background, have been out on the streets, week after week, raising our voices, spreading the message as others ask questions, learn and join us, and too demand to be heard.\nThe image of our number is felt, yet voices fall on deaf ears. Our leaders not only ignore the suffering, but their actions and dismissive attitude support it. Neither medical experts, journalists, international organisations, nor even international courts have been able to change the course of action imposed on the nation of Palestine, and this is merely a culmination of 75 years of the same.\nAs long as we are now fully unfettered in our awareness, this education, both internal and societal, must continue, and we must work harder toward creating a world of justice and peace, where life and humanity hold value.\nThis is why I have taken the step to stand as an independent candidate in the upcoming General Election. I could not allow the labour MP of Brentford and Isleworth, who has discarded any practical means of preventing the ongoing attack on Gaza, to proceed unchallenged.\nThe disappearing of values extend to our local matters in the UK. In order to fund the wars and military control abroad, we suffer from a lack of support in our public services, as well as through austerity, which in turn cause discontent and rise in crime.\nMy intention through this journey will be to inspire a newly elevated social cohesion rather than division, to rebuild the trust that the corrupt government has disposed of as its responsibility, to care for and serve the community toward progress and development, and to play every possible part in preventing the suffering caused by those who abuse their power.\nJoin me on this journey, and let's work toward a just and peaceful future.",
  "https_zebunisarao_com/https_zebunisarao_com_petitions/content_2.html": "The Watermans Centre has been a community hub for all ages, for decades.\nAt great distress to the community, the Art Gallery and Cinema has already closed.\nThe next victim to face crisis is the Brentford Muslim Centre.\nBrentford Muslim Centre has grown to be the cornerstone for the Muslim residents of Brentford. As well as a place of worship, it has been a centre for education, charity and social support. The after-school homework classes and youth club serve to keep the young engaged and productive.\nRelationship counselling has been made available. The Ramadan Iftars served to source hot meals to people of all backgrounds, religions or none, who were welcomed to share a sense of belonging, away from solitude.\nThe centre has found itself in an unfair condition and an eviction notice has been served by the landlord. of the building. An emergency petition has been created to represent a collective voice on behalf of the community. Please sign and share.\nThank you for your support.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_zebunisarao_com/https_zebunisarao_com_what-i-stand-for/content_3.html": "Promoted by Talal Khawaja, on behalf of Zebunisa Rao.\nMail Box 288, 30 Red Lion St., Richmond, TW9 1RB.\nThis website uses cookies.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
}