{
  "https_www_shannonlloyd_uk_/https_www_shannonlloyd_uk_news_visit-mindkind-projects/content_6.html": "Shannon Lloyd Visits Mindkind Projects, Emphasises Support for Local Initiatives\nToday, Shannon Lloyd, the Conservative parliamentary candidate for Walsall and Bloxwich, visited Mindkind Projects, a local organisation based in Walsall. Accompanied by Andy Street, the former West Midlands Mayor, and local councillors, the visit underscored her commitment to supporting organisations that benefit residents and businesses in Walsall, Bloxwich, and the wider Midlands.\nHosted by Nike Morris, Shannon toured the facilities and learned about the various courses, training, and research initiatives offered by Mindkind Projects. During the visit, Shannon engaged with staff and participants, gaining insights into the positive impact of the organisation’s work.\n\"You cannot help but be impressed and amazed by the impact this organisation has on local residents and the wider community. I had the opportunity to chat with some of those attending a session today and was delighted to hear their positive feedback on the difference Mindkind Projects is making to them,\" Shannon said.\nLooking Ahead\nThe visit highlighted Shannon’s determination to support local businesses and organisations. \"I am committed to helping organisations like Mindkind Projects raise their profile, secure funds, and assist as many people as possible,\" Shannon stated. She emphasised the importance of grassroots initiatives in fostering community spirit and providing essential services.\nAs her campaign progresses, Shannon will continue spotlighting the work of local enterprises that enhance the quality of life for residents in Walsall and Bloxwich. Her proactive approach aims to create a network of support and collaboration among local entities, ensuring sustainable development and community well-being.\nShannon's dedication to her hometown is evident through her continuous efforts to engage with and uplift local organisations. By promoting such initiatives, she aims to inspire collective action and highlight the transformative power of community-driven projects.\nFor more information about the work of Mindkind Projects, please visit Mindkind Projects.",
  "https_www_shannonlloyd_uk_/https_www_shannonlloyd_uk_news/content_2.html": "Post General Election Friday, 5 July, 2024 Last message for this campaign. A heartfelt thank you to all those who took the time to come out and vote for us yesterday. I’m sorry we weren’t able to deliver the local win that we hoped for. Thank you to everyone who helped with the campaign and to everyone we met when out and about, thank you for engaging with our efforts to focus on the very best of Walsall and Bloxwich. There may not be a... Local News\nVisit to Performance Through People 21st June 2024 Shannon Lloyd, the Conservative parliamentary candidate for Walsall and Bloxwich, visits Performance Through People, a local training provider based in Essex... Local News\nVisit to Bloxwich Pharmacy 21st June 2024 Today, Shannon Lloyd, the Conservative Parliamentary Candidate for Walsall and Bloxwich, visited Bloxwich Pharmacy on the High Street in Bloxwich. The visit... Local News\nA thank you to local veterans after the D-Day celebrations 13th June 2024 I would like to take this opportunity to say thank you to all the veterans who have extended the hand of friendship to me since I started my campaign for the... Local News\nGaza 13th June 2024 Statement on Gaza Hello, I am Shannon Lloyd and I am standing as a candidate in the new constituency of Walsall and Bloxwich at the General Election on the 4... Local News\nVisit to Mindkind Projects 12th June 2024 Shannon Lloyd Visits Mindkind Projects, Emphasises Support for Local Initiatives Today, Shannon Lloyd, the Conservative parliamentary candidate for Walsall and... Local News\nShannon Lloyd's Official Campaign Launch: A Community United 9th June 2024 On Saturday, Shannon Lloyd officially launched her campaign as the Conservative Party candidate for the Walsall and Bloxwich parliamentary seat. The event saw a... Local News\nVisit to Alamgeer Foods - Walsall-Based Family-Run Business Gone International 5th June 2024 Shannon Lloyd, candidate for Walsall and Bloxwich, visited Alamgeer Foods, an internationally successful family-run business based in Walsall, today. This visit... Local News\nShannon Lloyd advocates for veterans in discussion with the Secretary of Defence at Conservative Conference 4th October 2023 At the recent Conservative Party Conference, Shannon Lloyd, military veteran, barrister, and former charity executive, met with the Secretary of Defence to... Reports",
  "https_www_shannonlloyd_uk_/https_www_shannonlloyd_uk/content_1.html": "Shannon Lloyd News Post General Election Last message for this campaign. A heartfelt thank you to all those… Visit to Performance Through People Shannon Lloyd, the Conservative parliamentary candidate for Walsall and… Visit to Bloxwich Pharmacy Today, Shannon Lloyd, the Conservative Parliamentary Candidate for Walsall and…\nVisit to Performance Through People Shannon Lloyd, the Conservative parliamentary candidate for Walsall and…\nVisit to Bloxwich Pharmacy Today, Shannon Lloyd, the Conservative Parliamentary Candidate for Walsall and…",
  "https_www_shannonlloyd_uk_/https_www_shannonlloyd_uk_accessibility/content_3.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_shannonlloyd_uk_/https_www_shannonlloyd_uk_news_visit-bloxwich-pharmacy/content_5.html": "Today, Shannon Lloyd, the Conservative Parliamentary Candidate for Walsall and Bloxwich, visited Bloxwich Pharmacy on the High Street in Bloxwich. The visit further demonstrates Shannon’s commitment to supporting local businesses and our High Streets.\nInvited by Indi Kaur to tour the new facilities the Pharmacy has invested in to increase the services on offer to the local community, Shannon was able to meet staff and take a closer look at the new consulting suite. The visit allowed Shannon to see cutting edge technology used in the Pharmacy to dispense prescriptions and acknowledge the role this Pharmacy played during the role out of the COVID vaccine when it was the first in the local area to offer the vaccine to vulnerable residents.\n“Great visit to Bloxwich Pharmacy today thanks to Indi and Jas. Walsall and Bloxwich can be justifiably proud of this particular Pharmacy and its wonderful staff who are utilising cutting edge technology to serve the community and investing in consulting rooms to offer a broad range of services alongside the Pharmacy First initiative already in place. If you are in there have a look at the robot pharmacist which looks like the tubes carrying chocolate in Charlie and the Chocolate Factory to me. I will always support local businesses who are serving their community and creating jobs.”\nLooking Ahead\nThis type of visit highlights Shannon’s determination to support local businesses and our high streets. Shannon will continue to engage and promote local businesses shining a spotlight on the vital role they play for residents in Walsall and Bloxwich.\nFor more information on the services offered by Bloxwich Pharmacy, please visit @BloxwichChemist",
  "https_www_shannonlloyd_uk_/https_www_shannonlloyd_uk_news_visit-alamgeer-foods-walsall-based-family-run-business-gone-international/content_4.html": "Shannon Lloyd, candidate for Walsall and Bloxwich, visited Alamgeer Foods, an internationally successful family-run business based in Walsall, today. This visit highlights her commitment to supporting local enterprises and job creation in the community.\nSupporting Local Economy and Job Creation\nFounded in 1979, Alamgeer Foods has grown from a small food store into a major player in the Asian culinary market, now operating out of a 40,000 square-foot warehouse. Shannon toured the facilities, met with the owners and staff, and learned about the company’s journey and contributions to the local economy. She praised Alamgeer Foods for its role in providing stable employment for local residents and fostering economic growth.\n\"It's truly inspiring to see how Alamgeer Foods has not only achieved international success but also remained deeply committed to its roots here in Walsall,\" Shannon remarked. \"Their efforts in creating employment opportunities and supporting local initiatives are invaluable to our community.\"\nCommunity Engagement and Corporate Responsibility\nIn addition to job creation, Alamgeer Foods is actively involved in various community projects and charitable initiatives. The company is committed to responsible trading practices and environmental conservation, working towards Fair Trade accreditation. Shannon lauded their corporate responsibility, stating, \"Their commitment to giving back to the community sets a powerful example for other businesses. It's encouraging to see such strong corporate citizenship in action.\"\nA Vision for the Future\nShannon Lloyd’s visit underscores her focus on economic development and community support as key components of her campaign. She believes that fostering a business-friendly environment and supporting local enterprises are crucial for the prosperity of Walsall and Bloxwich. \"This visit has reinforced my belief that we must continue to support and nurture our local businesses. They are the backbone of our economy and play a vital role in our community's well-being. I am committed to advocating for policies that help businesses thrive and create more job opportunities for our residents,\" she stated.\nLooking Ahead\nAs Shannon continues her campaign, she plans to visit more local businesses and engage with community members to better understand their needs and aspirations. Her goal is to develop and promote policies that will drive economic growth, support local enterprises, and enhance the quality of life for all residents in Walsall and Bloxwich.\nResidents can look forward to a campaign that is deeply rooted in understanding and addressing the real-world challenges faced by businesses and individuals alike. Shannon Lloyd’s dedication to public service and her proactive approach promise to bring positive change and effective representation to the constituency.\nFor more updates on Shannon Lloyd’s campaign and her initiatives, visit her personal website and follow her on social media."
}