{
  "https_voteobimonye_uk_/https_voteobimonye_uk/content_1.html": "The Tie Festival Collection by Obinna Monye\nTropical Elegance with a Cultural Touch.\nCredits\nDear sir/madam,\nI am delighted to present to you my brand, Tie Festival.\nThese outfits embody a fusion of elegance and cultural symbolism, ideal for warm, vibrant and scenic environments. Inspired by traditional sarong wrapping techniques, the designs blend modern aesthetics with a nod to heritage, offering a fresh take on traditional fashion.\nThese designs are inspired by serene landscapes and my rich cultural background, offering wearers a stylish way to connect with tradition in a modern world.\nThe fabric choices reflect a luxurious yet earthy vibe, with metallic accents that catch light, embodying the warmth and radiance of island culture. Each piece is designed with flexibility, allowing the wearer to adjust for comfort while retaining the garment’s unique style.\nThe outfits aim to celebrate the harmony between nature, culture, and fashion, creating an effortless look that is both timeless and culturally inspired.\nThank you in advance for taking the time to respond to our consultation.\nYours sincerely,\nObinna Monye\nDesigner\nFittings/Photoshoots/Bookings\n+44(0)1353881381\ninfo@tiefestival.com\nGeneral Feedback on the Design.\nWelcome to the Official Campaign Website for Obi Monye\nA Vision for a Better Ely and East Cambridgeshire\nWelcome to the official campaign website for Obi Monye, your Independent Candidate for the Ely and East Cambridgeshire Constituency in the 2024 Parliamentary Elections.\nWho is Obi Monye?\nObi Monye is a dedicated advocate for positive change, driven by a passion for community service and a commitment to addressing the unique challenges faced by our constituency. With a background in public service, business, and community engagement, Obi brings a wealth of experience and a fresh perspective to the political landscape.\nWhy Vote for Obi Monye?\nIndependence and Integrity: Obi is not bound by party politics. His sole allegiance is to the people of Ely and East Cambridgeshire. He believes in transparent, honest, and accountable leadership that truly represents the will of the people.\nCommunity First: Obi’s campaign is centered on you – the residents of our vibrant community. He is committed to listening to your concerns, understanding your needs, and working tirelessly to find practical solutions that enhance our quality of life.\nProgress and Innovation: Obi is dedicated to fostering economic growth, improving local infrastructure, and promoting sustainable development. His goal is to create a thriving environment where businesses can flourish, families can prosper, and the natural beauty of our region is preserved for future generations.\nKey Campaign Issues\n- Economic Development: Promoting local businesses, supporting job creation, and ensuring a resilient local economy.\n- Health and Wellbeing: Enhancing healthcare services, mental health support, and social care for all residents.\n- Education and Opportunities: Investing in education, skills training, and youth development programs.\n- Environmental Sustainability: Advocating for green initiatives, renewable energy, and conservation efforts.\n- Public Safety: Strengthening community policing, addressing rural crime, and ensuring the safety and security of all residents.\nGet Involved\nYour support is crucial to making a difference. Whether through volunteering, donating, or simply spreading the word, every contribution counts. Join our movement to bring about meaningful change in Ely and East Cambridgeshire.\nContact Us\nWe want to hear from you. If you have any questions, ideas, or concerns, please don’t hesitate to reach out. Together, we can build a brighter future for our community.\nThank you for visiting the Vote Obi Monye website. Together, let’s make Ely and East Cambridgeshire a place where everyone can thrive.\nBackground\nObinna Monye is an English, Nigerian artist, filmmaker, director/producer with a science and engineering background.\nHe started his filmmaking journey in the UK as a volunteer in the community on Project 3D of which he later became a project consultant back in 2007.\nNEWS\nYour Questions from the Hustings\n1\nWe all see the unfolding humanitarian catastrophe in Gaza, with thousands of innocent Palestinians have been killed (37,164 people killed and counting, mostly children and women), and millions (over 90% Palestinians) are displaced and fearing for their lives, as there seems to be no safe place including hospital and refugee camps, and hardly any aid allowed including life saving aid. What are the candidates thoughts on Israel government disregard for international laws and resolutions passed by the UN security council and International Court of Justice (ICJ), to allow humanitarian assistance including life saving services to avoid genocide and for an immediate ceasefire to stop the ongoing humanitarian crisis?\n2\nYou would agree with me that nobody or country is above the law. Why is Isreal not held to the same standards of international law as every other nation of the world and why does the UK continue to support it breach of international law in expanding illegal settlements, denying Palestinian rights and in its conduct of the war in Gaza.\n3\nThis election is being conducted under the first past the post system. Out of 43 nations in Europe only the UK France & the authoritarian state of Belarus use this system the rest use some form of proportional representation.\nIf elected, will you commit to supporting the introduction of PR for elections to all levels of government in the UK. Please set out your reasons for taking this view.\n4\nIf a cohort of wealthy people were hoarding food in the way that some people amongst us are hoarding property, there would be social unrest. Monies paid as rent by tenants which is used by landlords to pay mortgages secured on their investment properties does not get recycled back into the economy. Does the panel have the moral courage to use the tax system to disincentive second property ownership and then to help young people buy their first homes?\n5\nAs we witness the ongoing humanitarian catastrophe in Gaza, with over 37,000 Palestinians, mostly children and women, killed, and millions displaced and in fear for their lives, what are your thoughts on the Israeli government’s disregard for international laws, the ICJ, and UN resolutions calling for humanitarian aid and an immediate ceasefire to prevent further genocide?\n6\nWater privatisation in England is an experiment that has failed . Do the panel acknowledge it is time to end it now ?\n7\nWhat are the parties policies towards higher income earners? Patriotic Millionaires suggest that the UK does not\nhave a wealth problem – we have a distribution problem.\n8\nWho was responsible for the lunatic decision to introduce the 20 mph speed limit for a ridiculous cost to tax payers in a City which cannot even administer a 30 mph limit. If the reason is to reduce critical road traffic accidents,when was the last one ? And if by driving in lower gear at increased revs reduces pollution, where is the proof?\n9\n- Do you support compensation for WASPI women? 68% of the general public do.\n- If you are elected, what will you do to ensure that WASPI women will get a fair and fast compensation. WASPI is calling for all political parties to commit to paying fair and fast compensation and to outline their plans to deliver justice within the first 100 days of\nthe next parliament.\n10\n(For the Labour Candidate) How are Labour planning to deal with the influx of previously private school educated pupils into the already stretched state education system if they bring in the VAT on school fees?\n11\nDisastrous underfunding of the NHS, unemployed Junior Drs, over 500 applying for posts due to huge cutbacks as no funding is available and GP’s unable to get posts for similar reasons.\n12\nAs a person of faith, I believe in working for peace, love and justice in the world. I also believe that, as human beings, we all have the capacity to be creative, destructive and transformative in relation to ourselves and others.\nWhat do you consider to be the creative, destructive and transformative aspects of your Party’s presence in the\nworld?\n13\nIn view of the recent dramatic increases in the mortgage rate, particularly affecting First Time buyers, and those renewing their mortgages, would it be desirable for the newly elected government to introduce a special scheme with special interest rates, for the above mentioned. This could include a cap on the amount that can be borrowed.\nDo the candidates also consider that without such a scheme there will be many young people unable to buy their own house with all the economic and social problems that will arise in the future?\n14\nChild poverty has reached 4.3 million, that is almost 30% of all children with 7 out of 10 of their parents with atleast one in paid work. Figures from the Child Poverty Action Group. These children are the future of our country.\nHow can one of the richest countries in the world allow this to happen? How do you think our next government can solve this problem?\n15\nSchools around Ely and East Cambridgeshire are overstretched, struggling to recruit teachers and meet the needs of our most vulnerable pupils due to an acute lack of funding with my employer having to cut £500,000 for the next academic year due to increasing costs without increasing funding. What are your plans to better support the education sector and our young people?\n16\nThere are many things which would be good and in which we as a country could fruitfully invest. However, since funds are not infinite, there are choices to be made. Can candidates tell us, please, what they would NOT fund (or fund to a significantly lesser degree)?\nGeneral Elections Hustings, Ely Cathedral,\nJune 30th, 2024\nVOTE OBI MONYE\nPARLIAMENTARY ELECTION JULY 4TH, 2024\nELY AND EAST CAMBRIDGESHIRE CONSTITUENCY\nObi Monye radiates versatility and a passion for making a positive impact across various domains. His leadership experience, coupled with his diverse skill set, positions him as a valuable asset to any organization. His track record of success, strategic acumen, and collaborative approach make him well-equipped to drive initiatives forward and contribute to achieving organizational objectives.\nAs a mentor, Obi’s dedication to education and cross-cultural communication shines through, leaving a lasting impact on those he guides.\nHis artistic talents, showcased in various mediums such as television, film, and competitions, highlight his ability to captivate audiences and contribute to compelling narratives.\nVOTE OBI MONYE\nObi Monye is running as an Independent Candidate for Ely & East Cambridgeshire in the July 4, 2024, General Parliamentary Elections. He focuses on harnessing the will of the electorate through consultation on issues like community development, environmental sustainability, and social justice which are concerning people within the constituency. He advocates for true democracy where the will of the people takes precedence. His campaign strategy includes public meetings, community events, and digital engagement.\nObi emphasizes strong constituent relationships through regular consultations and effective communication via social media and newsletters. He leverages media appearances to enhance visibility and advocates for community interests in public forums. His voter outreach strategies aim to increase registration and turnout, ensuring a comprehensive and community-focused campaign.\nVOLUNTARY AND COMMUNITY ENGAGEMENT\nElection Communication\nList of Activities\n- Author and Host, Financial Abundance (June 2024)\n- Attendee, CCSF 2024, Global Perspectives, New Museums Site, Cambridge UK (June 2024)\n- Video Producer (May 2024)\n- Player, Ely Table Tennis, Ely College, Ely UK (May 2024)\n- Attendee, CCSF 2023, Everyday Climate Heroes, Cambridge Union, Cambridge UK\n- Poetry Reading, Java Speaks Virtual Open Mike(Oct 2023)\n- Poetry Reading, Deep Expression, Meaningful connection, Hackney, London (Sept 2023)\n- Poetry Reading, Fen Speak, Babylon Arts Gallery , Ely Cambridgeshire (Sept 2023)\n- Co-Founder & Treasurer, Will of The Electorate Association, Ely UK (May 2023 – Present)\n- Attendee, Informal Networking Evening, Ely Cathedral Business Group, Poets House Hotel UK(May 2023).\n- Attendee, Ely Earth Cafe, East Cambridgeshire Climate Action Network, Ely, UK(May 2023).\n- Mentor, Angloville, Corona Hotel, Poland (Mar 2023)\n- Supporting Artist, Extra People “ONE DAY” (Jan 2023) and “Maestro” (Oct 2022).\n- Model, Finalist, Mr British Isles (Sept 2022)\n- Winner, Noise Awareness Poster Design, Jardin Corrugated, Ely UK (June 2022)\n- Attendee, Actors Pro Expo Global (Feb 2022)\n- Director, You are Beautiful, Semi Finalist, Lagos International Festival of Animation, LIFANIMA( Nov 2020)\n- Director, You are Beautiful, Official Selection, Lift-Off Filmmaker Sessions (Feb 2020)\n- Singer, Son of God, Christmas Carols, Supported Living Schemes, Sanctuary Housing , Ely (Dec 2017)\n- Games Maker, London 2012 Olympics (Sept 2012)\n- Attendee, Stop by Shoot Film, Miami International Film Festival, Miami Florida (Mar 2009)\n- Best Fundraising Event, Third Sector Award Winner, Youth -The Funding Network (2008)\n- Trustee & Director, Age UK , Sheffield (2007- 2011)\n- Regional Coordinator, Yorkshire & Humber, Student Volunteering England (2006)\n- Equal Opportunity Officer, Hallam Volunteering Sheffield, Hallam Union (2006)\n- Mixed Media Artist, Big Arts Week, Dronefield Henry Fanshawe School, Derbyshire UK (May – July 2005)\n- Hallam Volunteer, Sheffield Hallam University, Student Union (2004 – 2007)\nMY DEMOCRATIC PROMISE\nAS YOUR MP I VOTE FOR YOUR POLICIES.\nBEFORE EVERY PARLIAMENTARY VOTE, I ENTER INTO CONSULTATION WITH YOU.\nI REMAIN IN CONSULTATION WITH YOU THROUGHOUT THE PROCESS.\nVOTE FOR THE GOVERNANCE YOU DESERVE, WHERE EVERY VOICE IS HEARD.\nI VOTE ACCORDING TO YOUR WISHES.\nWHY ARE WE CONTESTING?\nTHE SYSTEM NEEDS AN UPDATE.\nA DEMOCRATIC SOLUTION\nBY VOTING FOR OBI MONYE STANDING AS AN INDEPENDENT, WE CONSULT YOU DIRECTLY\nSO YOU CAN BE FOR THE GOVERNMENT’S PROPOSAL ON ONE POLICY AND AGAINST ON ANOTHER.\nHOW IS THIS POSSIBLE?\nOUR DIGITAL SYSTEM ALLOWS YOU TO SEND YOUR VOTING PREFERENCE TO YOUR MP BEFORE EVERY VOTE SIMPLY, SECURELY, CONFIDENTIALLY, AND AT NO NO EXTRA COST TO YOU OR THE GOVERNMENT.\nSEE PILOT TEST LINK BELOW\nhttps://vote.electionrunner.com/preview/5ex1o/bxfxaJWJ6yTJfsoR\nSIMPLY SIGN UP WITH YOUR EMAIL AND ELECTORAL ROLL NUMBER.\nHOW WILL WE FUND THIS?\nFUNDING WILL BE AVAILABLE THROUGH OUR FINANCIAL ABUNDANCE PROJECTS, THE SUPPORT OF THE PUBLIC THROUGH DONATIONS, AND FROM PARTNERSHIPS WITH LOCAL ORGANISATIONS AND INDIVIDUALS.\nTOGETHER WE CAN MAKE A SIGNIFICANT IMPACT AND BUILD A BETTER FUTURE FOR ELY AND EAST CAMBRIDGESHIRE.\nVOTE OBI MONYE\nPARLIAMENTARY ELECTION 2024\nELY & EAST CAMBRIDGESHIRE CONSTITUENCY\nVOLUNTEER\nDescription\nCampaign with Obinna Monye\nIndependent Candidate Ely & East Cambridgeshire Parliamentary Elections July 4, 2024.\nOverview: Campaign Volunteers are essential to the Voice of Ely campaign with Obinna Monye. Volunteers support various campaign aspects, including voter outreach, event organization, communications, and data management, to build momentum for a successful election.\nKey Responsibilities:\n- Engage in door-to-door canvassing and phone banking to inform and mobilize voters.\n- Distribute campaign literature in public places and at community events.\n- Assist in planning and organizing events like town halls, rallies, and meet-and-greet sessions.\n- Set up, manage, and break down event spaces, ensuring smooth operations.\n- Manage social media accounts, create and post content, and draft press releases and newsletters.\n- Maintain voter information and analyze data to target outreach efforts effectively.\n- Support fundraising efforts by organizing events and reaching out to potential donors.\nBenefits:\n- Gain hands-on experience in political campaigning and grassroots organizing.\n- Develop valuable skills in communication, data management, and event planning.\n- Make a meaningful impact on the community.\n- Work closely with the candidate and campaign leadership team.\nHow to Apply: Contact Obinna Monye via email, info@voteobimonye.uk or call 07424007771 for a creative discussion.\nDONATE\nSupport My Campaign for True Democracy in Ely and East Cambridgeshire!\nDear Friends and Supporters,\nAs we approach the critical UK Parliamentary General Election, I am reaching out to you to help us bring about a transformative change in Ely and East Cambridgeshire. My name is Obinna Monye, but please call me Obi and I am running as your candidate with a pledge to uphold and implement the principles of True Democracy.\nWhy True Democracy? True Democracy means giving power back to the people. It ensures that every elector’s voice is heard on key issues affecting our community. If elected, I will commit to voting according to the highest number of votes received from our constituency on every motion.\nHow You Can Help: Running a successful campaign requires resources, and I cannot do this alone. Your generous donations will directly contribute to essential campaign activities, including:\n- Advertising: Spreading our message through posters, newspapers, and online platforms.\n- Materials: Printing leaflets and flyers to inform our community.\n- Events: Organizing public meetings to engage with voters.\n- Operational Costs: Ensuring our campaign office runs smoothly.\nMake a Donation: Your support, no matter how small, can make a significant difference. Here’s how you can contribute:\n- Bank Transfer: Transfer your donation directly to our campaign account:\n- Account Name: Obinna Monye\n- Account Number: 50181548\n- Sort Code: 52-41-19\n- Reference: Campaign Fund\n- Cheque: Send a cheque made payable to “Obinna Monye” to:\n- Obinna Monye Campaign Office\n- 27 Collier Close, Ely\n- Ely, Cambridgeshire\n- CB6 3WQ\nTransparency and Accountability: We are committed to transparency and will publicly disclose all donations received. Donations above £50 will be recorded with donor details as required by the Electoral Commission.\nJoin Us in Making History: Your contribution is more than just financial support; it’s a vote for a future where every voice counts. Together, we can build a community that truly reflects the will of its people.\nThank you for your support and belief in True Democracy.\nWarm regards,\nObinna Monye\nVOTE OBI MONYE\nINDEPENDENT CANDIDATE\nPARLIAMENTARY ELECTIONS 2024\nELY & EAST CAMBRIDGESHIRE CONSTITUENCY\nTop Ten, Obinna Monye, Finalist at Mr British Isles 2022\nScreenings\nYou are Beautiful\nDate:28 February 2021, Time: 1800 EST\nhttp://filmfestivalapp.com/\nEvents\nAwards Night\nProjects\nDestination\nJoin us as we explore the most beautiful and fascinating destinations around the world, meet locals and other travelers, indulge in exotic cuisine and drinks, and learn new skills from experts in their fields. You’ll have fun, be entertained, and be amazed by the wealth of knowledge and experiences you’ll gain. https://youtube.com/shorts/HeiChFZpGYU?feature=share\nCounter COVID-19\nTen\nThe Heartbeat of Our Home\nYou are Beautiful\nChristmas Carols\nFeedback\nWe welcome feedback on the above projects and look forward to hearing from you in the near future.\nBookings\nPlease contact us to discuss your private bookings. I wish to thank everyone involved in making this consultation a success and look forward to creative discussions in the future.\nPositive Harmony\nPlease complete the form below for positive harmony.\nFinancial Abundance Workshop\nWhat is Financial Abundance?\nRegister and Complete\nhttps://sonofgod.my.canva.site/financial-abundance-by-obinna-monye\nThank you for your patronage.\nHave a lovely day."
}