{
  "https_osmanadmani_co_uk_/https_osmanadmani_co_uk/content_1.html": "Osman Admani\nINTRODUCTION\nOsman Admani(Meet Your No 1 Candidate for Leicester-South)\n2 Britannia Street, Leicester LE1 2LA\nWhatsapp: 07468 225 292\nABOUT\nMeet Your Advocate\nHello Leicester-South. Allow me to introduce myself, Osman G. Admani. I was Born in the bustling city of London making my home in Leicester since the mid-1990s as a young independent man. Show more\nI married in Leicester where my children were subsequently born. I lived in the deprived poverty-stricken areas of St Stephen Road and then in St Mathews. I experienced the challenges in living in deprived communities. And I witnessed how social funding changed St Matthews in 2002. I want to deliver the same for places like Eyres Monsell.\nMy family and I are proud foster carers for Leicester City Council, specializing in the care of infants. This work is close to our hearts and reflects our dedication to making a difference in young lives\nI studied Law at Swansea, University of Wales and the University of Luton. Completing my training at the University of the West of England in Bristol. I am a member of The Honourable Society of the Inner Temple. I was called to the Bar in 2002. I also attended De Montfort University for a brief period. I studied scriptural law in Leicester.\nI commuted to London to work with solicitor firms. My focus was on asylum, immigration, and human rights cases, representing clients in tribunals. I also handled County Court hearings, criminal law matters, employment disputes, and more.\nI worked for a charity in North London, providing general legal advice and assistance. Strengthened my commitment to social justice.\nSince 2009 I my work is focussed in Leicester; assisting in employment matters, particularly for warehouse and care workers, helping with benefit issues and appeals, and challenging unfair housing conditions.\nMPs make laws, raise constituents' concerns, debate issues. I believe I’m the best candidate for this role. I hope you agree with me.\nA Vision for Leicester-South\nMy Manifesto\nAs your independent MP, my loyalty lies with you, not with any party or special interest group. Together, let's allow experience, knowledge, and belief to guide us.\nCost of Living Crisis\nWe all feel the squeeze from rising costs, exacerbated by the ongoing Ukraine conflict. The government has pledged £12 billion to Ukraine, but I believe we must reassess these payments. Instead, we should support struggling households directly, using the energy rebate model. The government should in the time of crises have powers to take radical steps to reduce the cost of staple foods.\nNHS Emergency and Long Waits\nThe NHS has been underfunded for far too long. The NSH needs immediate investment. 16% / £15 billion of NHS expenditure is paid to private companies. It must directly employ staff resulting in quality care and savings.\nJunior doctors have faced a steep decline in pay and need to have their pay restored.\nThis year the NHS’s antenatal care paid out £1 billion of its £3 billion budget on compensation. Providing targeted staff training is essential to professional care and savings.\nNationalisation\nWe must nationalise water and energy sectors to reduce bills and protect our environment. Private ownership has led to higher prices and inadequate investment in infrastructure.\nMany foreign companies own parts of our energy and water. Instead, our government can own the same in favour of our economy.\nWealth Tax\nA modest wealth tax on the richest 350 families could generate £20 billion. With more billionaires and food banks than ever, it's time for a fairer tax system that ensures the wealthy contribute their fair share.\nDefence Spending and Security\nWhile Labour plans to increase defence spending to £90 billion annually, we are surrounded by allies and face greater threats from cyber-attacks. Our priority should be addressing these modern threats, not escalating military spending. Leicester-South will advocate for peace and harmony with Russia, focusing on cybersecurity.\nSanctions against Russia have led to direct cost rises in the UK. British Companies are exporting hundreds of millions of millions of pounds of equipment which ends up in Russia through Uzbekistan and other countries violating official sanctions. Russian Crude oil is refined in Inda and then imported in the UK. I will argue that these companies must be taxed further for their illegal behaviour. I will in expose this equality in Parliament and demand consequences.\nGaza & International Affairs\nLeicester is united in supporting Gaza from Genocide and war crimes committed by Israil They and their allies must be held accountable.\nOur political leaders have followed policy not justice. We need to immediately stop arms sales to Israil.\nThe International Court of Justice, the ICC, the UN Security Council, the UN General Assembly and the Genova convention have all criticised Israil’s genocidal behaviour.\nThe Dutch Courts halted its government from selling weapons to Israel because there was a serious risk of violating internation law. We need independent legal checks on our government because our politicians cannot be trusted.\nRent and Housing Crisis\nFor over a decade, I’ve fought against unscrupulous landlords. We need legislation that protects tenants and ensures fair rent prices. Buildings around Leicester can be converted into affordable housing, and we should build more council and housing association homes.\nHomelessness\nFinland’s approach to homelessness, which saves £12,000 per person annually, can be our model. By reducing the use of social and health services and cutting mental health costs, we can find a sustainable solution.\nFoster Care\nAs a foster carer, I understand the challenges facing the system. We must support foster carers and social workers, who work tirelessly to protect vulnerable children. With increasing demand and a decline in foster carers, it’s crucial to invest in this essential service.\nSocial workers spend on average 10 hours or more a week on unpaid work to keep the foster system from crashing. The safety of our children must be safeguarded.\nCrime and Prevention\nOur police need the freedom to use targeted stop-and-search powers without fear of unfair criticism. Investing in smart technology and reliable admin support will allow police officers to focus on street presence, deterring crime and reducing the burden on the justice system.\nStronger Employment Protection\nHaving represented workers for over 15 years, I know the importance of strong employment rights. We need to support trade unions and ensure fair treatment in the workplace, leading to worker satisfaction and more productive businesses.\nThe Immigration Problem\nImmigration abuse must be tackled. As a former immigration lawyer, I have some insight into the issue and will discuss my detailed plan if elected. Current spouse visa rules are bias and in favour of the rich.\nElderly and Housing\nThe elderly should not have to sacrifice their homes for care. We must ensure they can pass on their property to their families. Improving care home staffing and standards is essential, as is recognising and supporting carers.\nA solution is allowing carers to become more specialised and recognised to lessen the burden on nurses. These nurses can then focus on the NHS.\nMental Health and Suicide Prevention\nWith an average of 30 suicides annually in Leicester, investing in mental health care is crucial. Better mental health support will strengthen families, support employment, and reduce NHS and police burdens.\nStudent Loans\nScottish students receive support for university tuition across the UK. Our students need similar support, ensuring fair treatment for all.\nGP Appointments\nWe need to revert to a system where patients can easily see their GPs. Prioritising patients will improve healthcare outcomes.\nTwo-Child Benefit Cap\nRising costs are making it harder for young families. The two-child benefit cap is unjust and must be challenged. This policy punishes innocent children and has no place in modern Britain.\nParking Tickets, PCNs, Bailiffs\nI have assisted with many appeals against unreasonable PCN and bailiff charges. We must stop this practice immediately. I will take this issue to Parliament to demand fair charges and prevent exploitation by private companies and demand that Magistrates’ Court act reasonably.\nWomen’s Rights\nI am a great supporter of women’s security and independence. I believe in common sense and facts.\nOur Environment\nWe have a collective environmental obligation in promoting and implanting renewable energy. At the same time these policies must be gradual and not penalise the poor.\nCONTACT\nLet’s get in touch.\nFill out my form below and send me an email."
}