{
  "https_www_runnymedeweybridgelabour_co_uk_/https_www_runnymedeweybridgelabour_co_uk_councillors-and-candidates_councillors/content_3.html": "top of page\nLocal government in Surrey runs on a two-tier system.\nYour county council handles local services like education, public transport, roads, libraries, health and social care.\nYour borough council handles services like waste collection, planning, licensing, housing, and street cleaning.\nFind your local Labour team's contact details and social media below.\nCounty Councillors\nBorough Councillors\nRobert King\nEgham Hythe\nCo-Leader of\nRunnymede Borough Council\nFinance and Corporate Lead\ncllr.robert.king@runnymede.gov.uk\n07506 274314\nAbby King\nEnglefield Green West\nGroup Deputy Leader,\nCommunity Services Lead\ncllr.abby.king@runnymede.gov.uk\n07936 870573\nbottom of page",
  "https_www_runnymedeweybridgelabour_co_uk_/https_www_runnymedeweybridgelabour_co_uk/content_1.html": "top of page\nWant to get involved? Here's what you can do.\nThere are so many ways to volunteer with us. All our campaigns rely on people like you fighting for a Britain's future and a better Runnymede.\nFrom knocking on doors and hitting the phones, to leafleting or offering some unique skills to try something new, we are nothing without our team of grassroots activists.\nEven if it's your first venture into campaigning, we've always got experienced members who're willing to train and ease you into being a part of our team.\nbottom of page",
  "https_www_runnymedeweybridgelabour_co_uk_/https_www_runnymedeweybridgelabour_co_uk_help-us-win/content_2.html": "top of page\nTories\nLib dems\nGreens\nIn 4 wards, margins of less than 150 votes separated us from the Tories in 2023\nThe help of our activists and supporters is crucial to pushing us over the line across Runnymede and show that Labour can win.\nFind out how you can help us win.\nIn Chertsey Riverside, candidate Cai Parry was fewer than 50 votes away last May\nbottom of page",
  "https_www_runnymedeweybridgelabour_co_uk_/https_www_runnymedeweybridgelabour_co_uk_volunteer/content_5.html": "Leafleting\nSending out leaflets and letters from our local campaign is one of the most effective ways of persuading people to turn out and vote Labour.\nYou can either go out delivering in a team of volunteers, stand on a street stall, or sign up to deliver regularly around your local neighbourhood. We need leafleters across the whole constituency.\nSpeaking to voters on the doorstep\nThe most valuable thing you can do for the campaign is talking to people on the doorstep, sometimes called ‘canvassing’.\nMeeting voters face-to-face lets us understand which issues are most important to them, and identify who is likely to vote Labour and who still needs to be persuaded. You don’t need to debate or have an answer to all their questions, just offer a friendly face and listen to their views.\nYou’ll always be teamed up with experienced canvassers who will show you the ropes and answer any questions you have, and you can watch our introduction to canvassing video below.\nI’m a bit nervous – what can I expect on my first campaign session?\nFirst of all, we can promise you’ll get a warm welcome from your local party – you’ll be teamed up with an experienced campaigner to start off with and they’ll be able to show you the ropes and answer any questions you might have. People do expect us to knock on their doors – especially at election time, and most people are friendly and interested.\nIt’s a great way to meet fellow members and supporters too, and sessions are often followed by a trip to a café or pub.\nOffice support on polling day\nIf you can’t go out campaigning, there’s always useful work to help with in our campaign offices.\nFrom stuffing envelopes, to entering data, to making refreshments for other volunteers on a break, a campaign is a team effort and it depends on this important support work. There really is a job for everyone.\nSharing our social media\nThe most persuasive person to deliver a political message is someone a voter already likes and trusts. Sharing Labour content on your social media is a great way for you to make a personal case for why Labour needs to win this election to your friends and family.\nYou can follow our social media here.\nCalling voters by phone\nIf you can’t make it to a battleground seat, Labour Party members can still help key campaigns across the country from where you are by calling up key voters using our voter phone-survey tool – Dialogue.\nYou can either start making calls whenever you have some free time, or sign up to the National Phonebanking Taskforce to join a group of like-minded volunteers, either virtually on a video call or in a venue in your area.\nDialogue is currently only available to registered Labour Members, so join today to get started.",
  "https_www_runnymedeweybridgelabour_co_uk_/https_www_runnymedeweybridgelabour_co_uk_labours-missions/content_4.html": "A mission-driven Runnymede\nBritain and Runnymede need a mission-driven government to follow on from 51 years of plaster sticking politics from the Conservatives who have taken their positions for granted.\nLabour in power will deliver on these missions with a fully costed plan to recover the council's finances after years of Tory financial mismanagement at Runnymede.\nOur five missions for Runnymede\nRead about our missions and how we'll achieve them below or click the buttons to skip to a section\nRescue and fix our local services\nRunnymede has the fourth highest debt per resident of any local council in the UK.\nIf the council doesn't get a hold of this situation soon, many services residents rely on will be slashed or vanish completely. Mission 1 of the next Labour administration will be to rescue our local services by reducing the £26m deficit caused by wasteful spending and debt fuelled investments which no longer support sustainable returns for taxpayers.\nWe would:\n-\nCut waste and inefficiency through service reform plans\n-\nReduce the millions that are spent on agency staff\n-\nRemodel Runnymede's investments to ensure sustainable incomes for services\n-\nCut the council's £650m debt, the fourth highest per resident in the UK.\nSupport you with the rising cost of living\nWhilst the Tories hammed hard-working families, Labour's alternative budget will have:\n-\nCut council tax bills for low-income working age families with up to a 100% relief and a move to a banded scheme which doesn't penalise those who work long hours.\n-\nProvided additional security for residents struggling with the rising cost of living by establishing a new, inflation-linked Runnymede Support Fund whilst the future of the Household Support Fund was put into question by the Tories.\nTake the climate crisis seriously\nWe have succeeded in pushing Labour's climate change action plan, along with other opposition parties, into council policy.\nThis will:\n-\nFix up leaking and run down council homes with new windows, doors and heating systems.\n-\nReduce the council's vehicle emissions by 95% with a new fleet of electric or low emission vehicles\n-\nWe will in also in administration seek to set up a Runnymede Green Bond like other local authorities, to empower communities to take leadership in driving a reduction of emissions and be a part of the solution to climate change.\nImprove estates and support young people\nLabour's strategy for tackling antisocial behaviour will also tidy up communities and provide more opportunities for young people in Runnymede\nWe would:\n-\nPrioritise estate led plans to tidy up communities and facilities that the Tories have let go to wreck and ruin\n-\nClean up community spaces ensuring they are cut back, are well kept and are safe to be enjoyed by all local residents\n-\nEnsure young people are supported with out-of-school activities that they want.\n-\nProvide a council apprenticeship scheme to give opportunities to young people after they leave school or college\nGrow the economy and support local business\nGrowing the local economy will allow our communities to thrive and provide more jobs. The key to this is supporting local business.\nWe would:\n-\nEnsure re-development schemes in town centres like Chertsey, Addlestone & Egham offer manageable rents so local businesses can succeed\n-\nSupport local enterprise partnerships through regular communication with the council's economic development team, so that policy is made around what local business wants.\n-\nBuild the council's procurement network around principles of community wealth building to prioritise local businesses when the council buys, builds or commissions."
}