{
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_events_feed/content_23.html": null,
  "https_www_marisaheath_uk_/https_www_marisaheath_uk/content_1.html": "Latest News The Environment I am renowned for my effective campaigning to protect our countryside, nature,… Fostering in Surrey Children in the care system should be our highest priority, and every effort… Extra Tough Police Force Needed for Fly-Tipping Experiencing rural crime can be devastating. It leaves many of us feeling… Find me on Facebook Find me on Twitter\nExtra Tough Police Force Needed for Fly-Tipping Experiencing rural crime can be devastating. It leaves many of us feeling…",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_campaigns_delivering-democracy/content_19.html": "There has been a breakdown in our democracy. it started a long time ago when Tony Blair lied to us about the reasons to go to war in Iraq and it has gradually got worse. It is not every politician's fault but there are a number who have really let us down and it goes across parties with expenses scandals, sexual assault allegations and then a failure to listen to residents and respond on their behalf. I would never betray the trust people put in me as an elected representative and I cannot imagine anything more embarrassing or awful than to do something which breaches the position I am put into as a politician.\nWe have so much to be proud of a nation and we need to end the deterioration of our reputation internationally by getting back to being respected democratic leaders who behave seriously and morally. I think it should be made easier to remove an MP if they have let down local residents and it should be clear that proven misconduct means they step aside. We need to take a no tolerance to sleaze approach.\nPolitician also need to be very clear about who they are and their values through their election campaign. Voters should be in no doubt about who they are getting and what that person will do for them. It used to be that people simply voted for the party colour and of course that is important if you want to know their ideology generally but there needs to be more scrutiny of candidates before election. I am addressing this with a series of video content and articles which set out my views and plans on all of the key issues. I would keep doing this if elected as well as holding regular in-person and Zoom meetings with residents to discuss those key issues.\nElected politicians should hold regular surgeries and be open to meeting resident groups and businesses throughout their term. A proven failure to do this should lead to them not being reselected to stand for election.\nI will come back to this issue but just as a final point for now it is vital we get rid of misinformation and frankly lies. People who put clear lies or misinformation into election literature or meetings to deliberately mislead voters should be held accountable. We can all disagree on issues, tell a story in a different way but anything meaningfully incorrect must be taken very seriously. We live in a world where we are struggling to find truth with social media and 'experts' on every platform and we need politicians to try to avoid deliberately misleading us.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_myplan/content_13.html": "I am constantly working on outline plans for the key issues across Dorking & Horley. I have outlined some of the issues I want to focus on below but I am currently spending the next couple of months knocking on doors, running surveys and finding out what matters to you and what you want me to think about. I will always put action over empty words.\nClick on the points below and they will expand to reveal detailed points.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_empowering-our-community-balanced-approach-dorking-and-horley/content_12.html": "As your Conservative Parliamentary Candidate for Dorking and Horley, I am committed to fostering an environment where entrepreneurialism thrives and government interference in daily life is minimised. I want to ensure that the potential in our community can be fully realised without unnecessary constraints.\nRemoving Red Tape\nIn Dorking and Horley, we have a vibrant community of small business owners and entrepreneurs whose innovation drives our local economy. I advocate for cutting the red tape that stifles such innovation. By reducing the burden of excessive taxes and bureaucratic barriers, we can make it easier for people to start and grow businesses, move homes, and establish community clubs and small charities without the fear of overwhelming bureaucracy or unnecessary costs.\nEnsuring Corporate Responsibility\nWhile we strive for less government intrusion, we cannot ignore the need to regulate corporations that have, at times, overstepped their bounds. Effective governance ensures that these entities do not undermine the integrity of our market or the well-being of residents in our community.\nSupporting the Vulnerable and Strengthening Policing\nSupport for the vulnerable members of our community is paramount to a compassionate society. In Dorking and Horley, we aim to provide consistent and reliable services to those in need. Robust policing and a zero-tolerance approach to crime will ensure that our neighbourhoods remain safe for all residents, reinforcing the foundation upon which our community can thrive.\nA Community-Led Approach\nThe spirit of Dorking and Horley is embodied in its people. It is you, the members of our community, who best understand the needs and dynamics of our locality. The government's role should be to support without overwhelming, facilitating a less risk-averse culture where innovation and the community can flourish.\nI am eager to see our community thrive with fewer governmental constraints and more personal freedoms, ensuring a prosperous future for Dorking and Horley. Together, we can foster an environment where everyone has the opportunity to succeed.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news/content_7.html": "The Environment Saturday, 1 June, 2024 I am renowned for my effective campaigning to protect our countryside, nature, and wildlife, demonstrating my commitment through leadership in numerous national and local initiatives. Unlike many who claim to value our green spaces but remain inactive, I have a proven track record of real action. Local News\nFostering in Surrey 15th May 2024 Children in the care system should be our highest priority, and every effort should be made to support them into adulthood and independence. It is one of the... ArticlesLocal News\nExtra Tough Police Force Needed for Fly-Tipping 3rd May 2024 Experiencing rural crime can be devastating. It leaves many of us feeling vulnerable and intimidated. Locally, it can pose significant emotional and financial... ArticlesLocal NewsOpinions\nBusiness Forum Meeting with Rebecca Paul a great success 16th April 2024 It was fantastic to meet with business leaders from across Surrey for the business forum meeting I held with my neighbouring constituency Parliamentary... ArticlesLocal News\nEmpowering Our Community: A Balanced Approach for Dorking and Horley 13th April 2024 As your Conservative Parliamentary Candidate for Dorking and Horley, I am committed to fostering an environment where entrepreneurialism thrives and government... ArticlesOpinions\nDoor to Dialogue: Uniting Dorking and Horley Through Your Questions and Visions 29th March 2024 One of my top priorities is to personally engage with constituents across Dorking and Horley and understand their concerns and aspirations. Over the past months... ArticlesLocal NewsOpinions\nBalancing Skies and Lives: Navigating the Future of Flight Paths Over Dorking and Horley 18th March 2024 The impact of Gatwick on both the close-by Dorking & Horley is considerable, and proposed new flight paths are something we really need to be concerned about... Local NewsOpinions\nBeyond Titles: Valuing Diverse Experiences in Political Leadership 11th March 2024 Some MPs have let their constituents down, failing to represent them adequately. However, it's essential to recognise that most MPs work diligently for their... ArticlesLocal NewsOpinions\nBridging the Gap: Reinvigorating Our Democracy for All 26th February 2024 As your Parliamentary candidate for Dorking and Horley, I will dedicate myself to listening and engaging with our community. One concern stands out across... ArticlesLocal NewsOpinions\nProgress in Action: My Ongoing Efforts to Resolve Sewage and Water Issues in Dorking and Horley 20th February 2024 As the Parliamentary Candidate for Dorking and Horley, I am acutely aware of the critical issues surrounding sewage, flooding, and water management that affect... ArticlesLocal News",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_campaigns_roads-and-transport/content_25.html": "- Roads funding is set with a national formula which currently pays per mile of road. This is madness because one length of road in a rural part of Yorkshire will be very different to the same length of road in Surrey. It should be done with some recognition of the use of that road - how many vehicles are using it? it is 2000 in Yorkshire and 2m in Surrey then that should be accounted for in the amount of funding sent to that area. Surrey has some of the most used roads in the country and we are also one of the biggest contributors to the Treasury because we have people running businesses and going to work paying their taxes and they all need our roads to do this. So simply we need a fairer funding formula which benefits Surrey.\n- The Government has recently increased funding to Surrey of £82,436,000 over the next eleven years in Surrey and a total of £8.3 billion, to resurface over 5,000 miles of roads across the country. Across Surrey, local highway authorities will receive £2,632,000 this financial year, followed by a further £ 2,632,000 for 2024-25, as part of a long-term funding plan through to 2034. We will see improvements in our roads as a result as SCC have upped their pothole and resurfacing work but we need more of this.\n- Utility companies are having an impact on our roads - they are legally allowed to dig up our roads on an 'emergency' basis but this happens all too frequently. When the roads are dug up, relaid, dug up and so on they get weaker and we have ore problems with dips and potholes forming. Also it causes chaos on our roads and often conflicts with other well planned road works in the area. Also leaks under the road from water pipes weaken the integrity of the surface causing potholes too. We need stronger rules on how the highways authority (the county council) works with utility companies. The use of 'emergency' needs to be revised and we need to ensure that it is truly a proper emergency when they dig up the road. We also need to make it mandatory that utility companies work together - if one needs to dig up the road they should collaborate with all of the others so the works are done at there same time and the road is only dug up once.\n- I have been a strong voice on implementing transport options which basically means I am not against people using their cars but I think if we offer feasible alternatives people will use them. The Government has committed an unprecedented £2 billion of funding for active travel over 5 years and we have been utilising this at Surrey County Council to work on local cycling and walking plans, and the £1 bus fare for young people. We have also invested in electric buses and I was a member of the Surrey cabinet behind the Surrey On Demand Bus which started in Mole Valley and transport 20,000 passengers around there to reach GP surgeries, attend hospital appointments, access further education and training or go shopping.\n- We have to be realistic and offer proper alternative modes of transport to really provide choice.\n- I have a strong track record in getting road investment - I was the county councillor covering the Egham area who helped get the £25 million for the re-design of the Runnymede roundabout that completely changed the way traffic moved coming off the M25 and cleared the congestion. I have had miles of roads re-surfaced during my time as a councillor and I have been behind the Local Walking & Cycling Infrastructure Plans.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_campaigns_building-homes/content_17.html": "- Mole Valley has one of the oldest Local Plans in the country and is also one of the worst constituencies for delivering affordable housing. This has led to a problem finding key workers for care services, the NHS and many municipal roles in the area. Mole Valley District Council led by the Liberal Democrats has a new draft Local Plan which they have voted on more than once but it includes a high number of Green Belt sites for housing. They have tried to blame others for this but they have controlled the Local Plan process for 5 years and have failed to deliver a robust plan that works for current residents.\n- Post COVID there is changing use of office buildings as people work from home, we also have Dorking town centre which could have areas for regeneration alongside a plan to ensure it can be a vibrant shopping centre that supports local business. More housing could be factored into a plan and this includes thinking about duplex apartments with upstairs and downstairs living for people who want to live in a town centre but don't want to be confined to boxy flats. This thinking can also be used in office re-development. It would be more attractive to those older people who may downsize and also to families who want space to have children's bedrooms or offices.\n- We need to look again at brownfield sites. I recognise it is easy to keep saying this but the problem is that building on brownfield is expensive. So planning policy needs to be reviewed broadly to make it easier and faster to build on brownfield. Local authorities should be given the resources to expedite brownfield applications helping to reduce the costs of borrowing and wasting time which can the be passed onto first time and local buyers.\n- In line with this, policy needs to be amended to support small scale developers who may be cash short but can deliver low density housing on smaller sites that work for the local area. A lot of our planning policy works for large scale developers seeking to put hundreds or thousands of homes on green belt rather than helping local business people build local homes.\n- We need to avoid building on high quality green belt that have high biodiversity value. Only low grade Green Belt should come forward and this should only be after we have fully exhausted brownfield and urban scope.\n- Where there is large scale development, the commitments to infrastructure must be met. I have seen a number of examples where the community aspects have either only been built right at the end or not built at all. Obviously we need to be sensible and think about developer cashflow but the funding for drainage, roads, doctors surgeries, schools and community buildings must all be delivered.\n- A good example of where development has been done well is the Poland Trust's project in Brockham. From my understanding the land was donated by a local landowner and working with the team from the Trust planning was agreed for the provision of 12 homes that were affordable with a contribution equivalent to 60% of market rents and priority given to those people in greatest need. The development fits well into the village and has no detrimental impact on the rural nature of the surroundings.\n- I have others thoughts and ideas which I will set out during the campaign or do get in touch if you would like to discuss housing and development.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_feed/content_16.html": null,
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_category_Local-News/content_5.html": "The Environment 1st June 2024 I am renowned for my effective campaigning to protect our countryside, nature, and wildlife, demonstrating my commitment through leadership in numerous national... Local News\nFostering in Surrey 15th May 2024 Children in the care system should be our highest priority, and every effort should be made to support them into adulthood and independence. It is one of the... ArticlesLocal News\nExtra Tough Police Force Needed for Fly-Tipping 3rd May 2024 Experiencing rural crime can be devastating. It leaves many of us feeling vulnerable and intimidated. Locally, it can pose significant emotional and financial... ArticlesLocal NewsOpinions\nBusiness Forum Meeting with Rebecca Paul a great success 16th April 2024 It was fantastic to meet with business leaders from across Surrey for the business forum meeting I held with my neighbouring constituency Parliamentary... ArticlesLocal News\nDoor to Dialogue: Uniting Dorking and Horley Through Your Questions and Visions 29th March 2024 One of my top priorities is to personally engage with constituents across Dorking and Horley and understand their concerns and aspirations. Over the past months... ArticlesLocal NewsOpinions\nBalancing Skies and Lives: Navigating the Future of Flight Paths Over Dorking and Horley 18th March 2024 The impact of Gatwick on both the close-by Dorking & Horley is considerable, and proposed new flight paths are something we really need to be concerned about... Local NewsOpinions\nBeyond Titles: Valuing Diverse Experiences in Political Leadership 11th March 2024 Some MPs have let their constituents down, failing to represent them adequately. However, it's essential to recognise that most MPs work diligently for their... ArticlesLocal NewsOpinions\nBridging the Gap: Reinvigorating Our Democracy for All 26th February 2024 As your Parliamentary candidate for Dorking and Horley, I will dedicate myself to listening and engaging with our community. One concern stands out across... ArticlesLocal NewsOpinions\nProgress in Action: My Ongoing Efforts to Resolve Sewage and Water Issues in Dorking and Horley 20th February 2024 As the Parliamentary Candidate for Dorking and Horley, I am acutely aware of the critical issues surrounding sewage, flooding, and water management that affect... ArticlesLocal News",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_my-work/content_3.html": "I have held a number of roles leading campaigns and strategies for a range of NGOs, businesses and government bodies. My expertise lies in forming sector groups and alliances to tackle issues and drive collaboration and I have extensive knowledge of Parliamentary procedure, legislative formation and influencing policy. My specialist areas are sustainability, nature recovery, animal welfare, farming and food production with a strong background on local food production across livestock and arable and plant-based growth.\nWork examples:\n- Leading cross party inquiries across industry and Parliament and authoring highly acknowledged reports with recommendations leading to legislative change.\n- Running the All-Party Parliamentary Group for Animal Welfare with cross party and associate members resulting in a wide contact book.\n- Giving expert evidence at Parliamentary Select Committees.\n- Delivering a Climate Change Adaption Strategy.\n- Working on the Surrey Local Nature Recovery Strategy.\n- Leading national project on reform for small, local and sustainable farming including co-chairing a Government task group.\n- Facilitating a trade alliance working on policy issues relating to agriculture and food production with connections across 40+ countries with member presence to create communication networks and develop positioning on sustainable food systems.\n- Experience in international food issues including World Food Programme, UNICEF Malnutrition Programme and Plant Based Foods Global Alliance.\n- Leading an alliance of NGOs and businesses including Danone, Flora and Oatly to represent plant-based sector at Government level.\n- Involvement in large scale infrastructure projects including town regeneration, River Thames Scheme and highways.\n- Part of expert panels in Government to take forward legislation and guidance.\n- Chaired Surrey Planning Committee dealing with highly controversial applications including the M25 services, an Eco Park and a number oil and gas extraction proposals.\n- Implemented an agro-forestry programme planting 120,000 trees\n- Leading in the formation and development of key sector groups across business which have resulted in a number of successful initiatives and policy change.\nWritten work examples\nA Healthier Future for Pedigree Dogs\nImproving the Effectiveness of Animal Welfare Enforcement\nPodcast\nAppearances on BBC Politics and BBC news as well as a range of podcasts and conferences.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_door-dialogue-uniting-dorking-and-horley-through-your-questions-and-visions/content_11.html": "One of my top priorities is to personally engage with constituents across Dorking and Horley and understand their concerns and aspirations. Over the past months, my team and I have knocked on literally thousands of doors throughout our constituency, engaging in helpful discussions.\nDuring these interactions, several pivotal questions have been raised repeatedly, reflecting our community's core concerns and hopes for the future. To ensure that everyone has access to these discussions, I decided to record a Q&A session where I could address these queries more broadly and share my vision for our constituency.\nThe session was recorded to ensure that it could be shared with all of you, providing an opportunity for those who couldn't attend to listen in.\nIn an effort to make our conversations even more inclusive and interactive, I'm excited to announce that through my email newsletter, there will be opportunities for constituents to suggest questions for future Q&A sessions. This initiative is close to my heart, as it ensures that our dialogue is driven by your current concerns and interests. Your input is invaluable in shaping our discussions and, ultimately, the actions we take together. So, I encourage you to subscribe and participate, making your voice heard in our journey forward.\nI am committed to transparency, dialogue, and action. This Q&A is part of our ongoing conversation. I want to hear from you, learn from you, and work together to achieve the best for Dorking and Horley. Our community's voice is my guiding force, and in partnership, I believe we can face challenges and embrace opportunities ahead.\nThank you for engaging, for sharing your thoughts and questions, and most importantly, for your continued support. Please, feel free to share this video with friends and family, encouraging more voices to join our conversation. And, as always, I'm eager to hear more from you – your concerns, your ideas, and your vision for our community.\nTogether, we can build a brighter future for Dorking and Horley.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_progress-action-my-ongoing-efforts-resolve-sewage-and-water-issues-dorking-and-horley/content_24.html": "As the Parliamentary Candidate for Dorking and Horley, I am acutely aware of the critical issues surrounding sewage, flooding, and water management that affect our communities. It is imperative to keep you, the residents, informed about the proactive steps being taken to address these concerns. Here’s a comprehensive update on my actions and future plans, aimed at ensuring a sustainable and healthy environment for us all.\nFormation of a Utility Task Group at Surrey County Council\nRecognising the need for a structured approach to dialogue with utility providers, I've been instrumental in establishing a Utility Task Group at Surrey County Council, in collaboration with Jonathan Hulley, Chairman of the relevant select committee. Our objective is to enhance communication with entities such as Thames Water, pushing for transparency and prioritisation of our community's needs. The initial meeting in January set a positive tone for future engagements, promising more constructive discussions ahead.\nResponsive Measures to Sewage Overflow in Horley\nThe unacceptable sewage overflow at Horley Sewage Works prompted immediate action. I secured the closure of the affected footpath to protect public health and sent a clear signal to Thames Water about the severity of their environmental breaches. This action was bolstered by the support of Richard Biggs, Leader of Reigate and Banstead Borough Council, who facilitated the necessary signage and barriers.\nStrategic Advocacy and Partnership\nMy commitment extends beyond immediate responses. In collaboration with the Leader of Surrey County Council, I've advocated forcefully to Thames Water, demanding an end to sewage leaks and the acceleration of upgrade works. My engagement with other water suppliers servicing Surrey has fostered productive relationships, addressing a spectrum of issues from infrastructure enhancement and leak prevention to conservation efforts and sustainable water usage.\nLobbying for Increased Local Oversight\nA key aspect of my work involves lobbying for greater powers for county councils to oversee utility companies' operations effectively. Addressing road surface damage caused by leaks and the resultant hazardous conditions is a priority. Enhanced local authority could dramatically improve our ability to manage these challenges swiftly and efficiently.\nOngoing Dedication to Environmental Stewardship\nI remain unwavering in my dedication to prioritising sewage, flooding, and water management issues. The potential for unlimited fines for pollution underscores the need for collective action and sustained pressure on utility companies. My commitment is to leverage every opportunity to advance our community's interests and environmental health.\nI value the support and input of Dorking and Horley residents as we work together in partnership to address these significant challenges. Ensuring our constituency remains a vibrant, safe, and clean place to live is my top priority.\nIf you have any ideas around this issue that you wish to discuss with me please contact me and I would welcome an opportunity to meet with you in person or on zoom/teams.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_extra-tough-police-force-needed-fly-tipping/content_27.html": "Experiencing rural crime can be devastating. It leaves many of us feeling vulnerable and intimidated. Locally, it can pose significant emotional and financial burdens on farming families and ruins our countryside.\nRural crime cost the UK nearly £50 million in 2022, with the theft of machinery, dog attacks on livestock, and fly-tipping all continuing to increase. I am focusing on fly-tipping in this video after taking Surrey County Council officers to have a look at Salvation Place.\nFly-tipping needs to be high on the agenda, reflecting on ways in which police forces can combat rural crime. If we allow people to just dump huge amounts of rubbish into our countryside, we are sending out a message that there are no rules, and we are living in an uncivilised community. For a group of people to think they can ignore the law, disregard the legitimate places provided for waste disposal, and ignore the rights of landowners, whether private or local authority, is incredibly damaging.\nIn the fly-tip featured in this video, there are piles of hazardous and toxic materials that were set on fire. It makes me very angry, and I want to see a specialist nationwide task force of the toughest police officers who can deal robustly with those responsible for this illegal activity. We cannot continue to be lenient on these sorts of issues if we are to protect our countryside and ensure the same rules apply to all.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_campaigns_protecting-our-nation/content_15.html": "I used to work in defence in 2006 and as part of a team we sought to get increased Government funding because we recognised the future threat from Russia in particular but also an increasingly unstable world. I also worked on the Royal British Legion Military Covenant Campaign as part of Sir Gerald Howarth's team as shadow defence minister. I strongly believe in investing in defence manufacturing and looking after our Armed Forces.\nDavid Cameron when PM chose to invest 0.6% GDP in international aid and I think aid can have a strong role in creating a safer world if it is spent in the right way. I have spent time working on aid projects and visiting other countries to see how our money is spent. Some of it is spent very well, some of it I would want to see spent differently. I do think, however, that defence spending should have been increased years ago. I am pleased that Rishi Sunak is the only leader who has committed to 2.5% GDP on defence and that we are also one of the only countries actually meeting the NATO spending requirements.\nIn my lifetime we have not lived in a more insecure moment with the threat of conflict hanging over us. Already we have Ukraine and Gaza and both of these events have had an impact on us. National security is the most important issue and we need to be scaling up our defence as fast as possible.\nIt is good that we are also investing in technology and innovation alongside the 2.5% direct spend on defence. Cyber security is very important and we are being hit on a constant basis through our everyday systems - banking and investment systems are at risk as are sites holding our personal data, our businesses. Also our everyday narratives are being affected - social media conversations turned into toxic arguments through the use of bots and false profiles.\nThis is serious and in many ways we are already experiencing soft wars. There is no more important role of Government than keeping its citizens safe and there are a few ways Government can do this:\n1) Spend money on defence, 2.5% is great but I would like it to get to 3%. if the money can be focused on British defence manufacturers than it creates jobs and investment which comes back into the economy.\n2) Deliver world leading diplomacy -find our allies and build those relationships and work to defuse heated situations with the more difficult nations\n3) Utilise international aid to deliver values of democracy and tackle the problems that cause migration and human suffering.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_about-marisa-heath/content_18.html": "Policy and Legislative Expertise\nMarisa runs her own successful consultancy business advising well known organisations across private sector and third sector helping them solve a range of problems through collaboration and alliances. She has influenced and changed a number of pieces of legislation and has been part of internal Government Expert Panels and co-chairs a Government Task Group. Her expertise is focused on farming, food production, animal health and welfare and conservation. She is a former Parliamentary Candidate, a Surrey County Councillor since 2006 and a former Borough Council Deputy Leader meaning her grasp on national and local government is top level and she has held a number of leadership positions at all levels. She has a strong track record in delivering positive change and has obtained millions of pounds of funding for the community, for farming and the rural economy and for business.\nMarisa has strong experience in forming alliances and sector groups across stakeholders. In putting together these groups, she identifies the shared problems and opportunities for the involved parties and establishes the points of agreement. Following that, Marisa develops a strategy to achieve the set objectives and deliver buy in from across stakeholders and government. Objectives can include legislative outcomes, whether updates to existing Acts or the introduction of new Bills or statutory guidance, best practice guidelines within industry and improved communications.\nHaving worked across charity, private and Government, Marisa is able to spot the shared goals and utilise the tools available to influence decision makers. She works cross-party and believes that many of the issues surrounding food security, farming, animal welfare and nature are best tackled collaboratively.\nSee Linkedin for more background\nPolitical Experience\nMarisa was first elected as a councillor on Runnymede Borough Council in 2003 when she was studying at Royal Holloway University. Marisa was deputy leader from 2017 to 2021 and was involved in large town regeneration projects, delivering a local plan and the COVID response.\nMarisa was elected to Surrey County Council in 2006 and is Cabinet Member for Environment covering flooding, countryside management and net zero. She is also chairman of the Surrey Environment Partnership.\nMarisa chaired the Surrey Planning Committee for over four years dealing with many large scale, controversial applications from oil and gas extraction in the Surrey Hills, major services on the M25 motorway and large scale waste and recycling facilities. She has a strong record in defending the Green Belt and protecting nature and she is a member of the Surrey Hills National Landscapes Board.\nMarisa worked to support the community on Heathrow expansion and the change to flightpaths and has spent time working on the environmental impact of airports.\nIn 2024, Marisa stood as the Parliamentary candidate for Dorking & Horley constituency.\nCommunity Work\nShe has been a school and college governor, and works closely with the Surrey universities often speaking at panels and alongside their representatives on joint environmental initiatives. She is currently a Governor to the St Peter's Medical School owing to her strong conviction that every child is entitled to a decent education. She has also had roles in Children’s Services and sat for over 8 years as a member of the Surrey Fostering Panel and as Deputy Cabinet Member for Children and Families. She is deeply committed to supporting young people who go through our systems and ensuring better transitions into adulthood which is a project she led when Deputy Cabinet Member. Marisa is always keen to speak at schools and colleges about the environment and animal welfare and how young people can influence the political agenda.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_balancing-skies-and-lives-navigating-future-flight-paths-over-dorking-and-horley/content_10.html": "The impact of Gatwick on both the close-by Dorking & Horley is considerable, and proposed new flight paths are something we really need to be concerned about. People who have not previously experienced noise and the impact of overflying may now have to deal with planes going over their homes.\nMost of us enjoy going on holiday and seeing the world, so we cannot adopt a purely NIMBY (Not In My Backyard) approach. Gatwick Airport has been operational for a long time, providing jobs and serving as a departure point for many of our flights. Nonetheless, we have to work out the balance between all of these positives with the erosion of our quality of life. There have been many studies on the impact of noise and also poor air quality on our health.\nFlight paths are a big deal, and I for one will be working to ensure we protect residents from suddenly having to deal with the impact of changes. Foremost, it is about whether the right flight paths are being put forward. Then, it's about respite, restrictions on night flights, and broadly looking at the whole issue of noise envelopes and reducing noise. Nobody should have to deal with rattling windows and being woken up.\nThe issue of flight path changes also prompts us to consider what kind of county we want Surrey to be. It is a place where many people aspire to live, and as I explore the villages of Ewhurst, Capel, Leigh, Mickleham, Westhumble, and Charlwood, I have been amazed at how many beautiful places there are. There are so many lovely houses, big and small, and so much fantastic countryside. We have a new town centre coming for Horley. It should be a place where people can enjoy sitting in restaurants and cafes outdoors and where local children can breathe clean air. We have to protect what makes this area great, from where we develop the needed new homes to the planes flying over our heads. This does not mean saying no to everything and preventing economic growth, but it does mean fighting for our quality of life.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_campaigns_supporting-local-business/content_22.html": "- I have run a small business and it was challenging enough running it from home but then when we need an industrial unit to produce the goods it became a lot more difficult as the bills were huge. I can only imagine how difficult it is running a shop on a high street especially when so many people shop online now. But I feel very strongly about keeping high streets vibrant and ensuring we have a place to go in our communities.\n- Local authorities should work closely with local businesses and seek to help them save money through sharing resources and offering opportunities. I also support the giving of grants to help businesses expand or get going which can be issued and managed through local government. Many small businesses struggle to take the next steps towards growth because they cannot get the capital that enables them to buy the piece of equipment needed or invest in skills. Also access to the latest technology is something which can really boost a growing business and Government needs to think about how to provide access to this using perhaps co-operative models or interest free loans.\n- Business rates can be varied by local authorities but we need to ensure that a fair share of the money from rates goes towards attracting people to high streets and shops. Also with town regeneration projects seeking ways to help local authorities hold some space for new businesses - shared shops or covered market areas - which can be given for no or small rents that helps them gain a presence.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_privacy/content_8.html": "This document outlines how Marisa Heath processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Marisa Heath\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Marisa Heath.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Marisa Heath, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Marisa Heath via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_campaigns_fair-tax-system/content_28.html": "Skip to main content\nMain navigation\nHome\nAbout Marisa Heath\nMy work\nNews\nContact\nA Fair Tax System\nTweet\nComing soon",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_category_Opinions/content_14.html": "Extra Tough Police Force Needed for Fly-Tipping 3rd May 2024 Experiencing rural crime can be devastating. It leaves many of us feeling vulnerable and intimidated. Locally, it can pose significant emotional and financial... ArticlesLocal NewsOpinions\nEmpowering Our Community: A Balanced Approach for Dorking and Horley 13th April 2024 As your Conservative Parliamentary Candidate for Dorking and Horley, I am committed to fostering an environment where entrepreneurialism thrives and government... ArticlesOpinions\nDoor to Dialogue: Uniting Dorking and Horley Through Your Questions and Visions 29th March 2024 One of my top priorities is to personally engage with constituents across Dorking and Horley and understand their concerns and aspirations. Over the past months... ArticlesLocal NewsOpinions\nBalancing Skies and Lives: Navigating the Future of Flight Paths Over Dorking and Horley 18th March 2024 The impact of Gatwick on both the close-by Dorking & Horley is considerable, and proposed new flight paths are something we really need to be concerned about... Local NewsOpinions\nBeyond Titles: Valuing Diverse Experiences in Political Leadership 11th March 2024 Some MPs have let their constituents down, failing to represent them adequately. However, it's essential to recognise that most MPs work diligently for their... ArticlesLocal NewsOpinions\nBridging the Gap: Reinvigorating Our Democracy for All 26th February 2024 As your Parliamentary candidate for Dorking and Horley, I will dedicate myself to listening and engaging with our community. One concern stands out across... ArticlesLocal NewsOpinions\nSecuring Tomorrow: Marisa Heath's Vision for Enhanced Defence and Meeting NATO's Call 18th February 2024 Numbers shrinking in the Armed Forces, 2% and Nato, what should our defence look like? I worked in defence for a while and I am a huge advocate for strong... ArticlesOpinions",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_contact/content_26.html": "Skip to main content\nMain navigation\nHome\nAbout Marisa Heath\nMy work\nNews\nContact\nContact\nLeave this field blank\n86 South Street, Dorking\n07503 655881\n[email protected]\nMarisa on Facebook\nMarisa on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_cdn-cgi_l_email-protection/content_30.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_accessibility/content_21.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_environment/content_2.html": "I am renowned for my effective campaigning to protect our countryside, nature, and wildlife, demonstrating my commitment through leadership in numerous national and local initiatives. Unlike many who claim to value our green spaces but remain inactive, I have a proven track record of real action.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_fostering-surrey/content_9.html": "Children in the care system should be our highest priority, and every effort should be made to support them into adulthood and independence. It is one of the key responsibilities of the government to provide support for those who need it most. I spent eight years sitting on the Surrey Fostering Panel, where we assessed potential foster carers and placed children with them. It was one of the most rewarding jobs I have ever done.\nSeeing amazing people step forward to help a young person and witnessing those young people find a home where they could receive support was profoundly insightful. It revealed the most positive aspects of our humanity. I would leave the panel sessions, which went on for hours due to the importance of the work, feeling in awe of foster carers and even more in awe of children who were going through the process and showing tremendous strength in the face of adversity.\nI don't think enough is done, despite best efforts, to showcase how fostering could work for people. Even if you have your own family, fostering can fit into your lifestyle. It is important to clearly explain how fostering can work and that it is remunerated. For stay-at-home mums and dads, fostering can provide an income and add a very positive dimension to your family. Yes, it is challenging, but as I have said, it is also highly rewarding. For those who do not have their own children, fostering can be for you as well. You can take children in, and when they move on to permanent situations, you can take a break. For older people, you can use your experience to look after a foster child and supplement your pension.\nEveryone can be a foster carer, and I personally am keen to foster at some point in my life. My sister, who lives alone and has a full-time job, fosters and really enjoys it. It has fitted into her lifestyle, and she has made long-term friends with some of the children who have stayed with her.\nSo, even if you have a tiny bit of interest in fostering, reach out to the team or me for a chat, and we can tell you more.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_bridging-gap-reinvigorating-our-democracy-all/content_6.html": "As your Parliamentary candidate for Dorking and Horley, I will dedicate myself to listening and engaging with our community. One concern stands out across conversations: a widespread sense of disconnection and apathy towards politics, affecting not just our young people but every one of us. It's clear that many feel overlooked by politicians, disillusioned by unfulfilled promises, and fatigued by what appears to be a relentless cycle of misinformation.\nThis growing apathy is a profound threat to the fabric of our democracy, which thrives on the active participation of its citizens. It's time for a new approach, one that reconnects all members of our community with the political process, based on honesty, transparency, and mutual respect.\nHonesty and Transparency Across the Board\nTransparency and honesty must be the foundation of our political engagement. The culture of vague promises and unattainable goals serves no one. My campaign is rooted in achievable objectives, emphasising straightforward communication about the challenges we face and the solutions we propose. Everyone deserves to know the truth about what can be achieved, the time it will take, and the cost involved.\nUnderstanding Beyond Age\nUnderstanding your candidates is crucial for every voter. I want you to see me not just as a name on a ballot or a colour for my party but as a dedicated member of our community, committed to addressing your concerns and improving our collective well-being. I pledge to make myself available, to engage in open dialogue, and to listen to and learn from you, regardless of age or background.\nEmpowering Through Education and Engagement\nEmpowering our community through education is essential in combating political apathy. It's vital that all members of our society are equipped with the knowledge to critically evaluate political information, understand the power of their vote, and see the direct impact of policies on their lives. I support initiatives aimed at enhancing understanding of the democratic process and encouraging active participation from all age groups.\nLeveraging Technology for Wider Engagement\nIn our mission to reconnect with every member of our community, leveraging technology plays a pivotal role. It offers us unprecedented opportunities to engage in real-time conversations, share information broadly, and create platforms for direct participation. I am committed to harnessing the power of social media and digital platforms to make politics more accessible and engaging for everyone. Through these channels, we can host virtual online meetings,, interactive Q&As, and provide up-to-the-minute updates on our campaign’s progress and initiatives.\nHowever, I am acutely aware that not everyone is comfortable or familiar with online engagement. Digital access and literacy vary across our community, and it's important that we do not leave anyone behind in our efforts to foster a more inclusive dialogue. Recognising this, I am equally committed to providing ample face-to-face opportunities for those who prefer traditional means of communication. Whether it be town hall meetings, doorstep conversations, or community events, one-on-one meetings with me, I pledge to be there, listening and engaging with you on your terms.\nI understand the value of personal interaction and the trust it builds. Therefore, my campaign will ensure that engagement opportunities are diverse and tailored to meet you where you are most comfortable. Whether online or offline, your voice is important, and I am dedicated to hearing it.\nEngagement is not a one-size-fits-all endeavour. I am here to engage with you in whatever way you prefer, recognising the importance of flexibility in fostering a truly inclusive community dialogue. My commitment is to be accessible, responsive, and present in all forms of interaction, ensuring that every member of our community feels heard, valued, and empowered to participate in shaping our shared future.\nCreating Opportunities for Participation for Everyone\nI believe in creating opportunities that allow every member of our community to actively participate in shaping our future. This includes supporting initiatives that offer a platform for voices to be heard, from youth councils to forums designed for more senior residents. Every perspective is valuable and can contribute to a richer, more inclusive understanding of the issues we face.\nAs your Parliamentary candidate, my mission is to bridge the gap between the community and politics, ensuring that every voice is heard and valued. This isn't just about re-engaging our youth; it's about reinvigorating our democracy for everyone who calls Dorking and Horley home. I am here to listen, to understand, and to take action.\nI am Marisa Heath, and I am asking for your support to create the change our community needs. Let's reconnect with politics, together, and forge a future where every voice matters, every concern is addressed, and every vote makes a difference.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_beyond-titles-valuing-diverse-experiences-political-leadership/content_20.html": "Some MPs have let their constituents down, failing to represent them adequately. However, it's essential to recognise that most MPs work diligently for their residents and represent them to the best of their abilities. From my experience working with MPs across political parties, the best are those who read and answer their emails, attend local meetings to listen to people, and keep their feet on the ground, acknowledging they are not more important than anyone else.\nI was inspired to create this video because someone asked me about my experience working for a major corporation. In reality, I have worked with many major corporations that have sought my advice through my business. I don’t believe that standing for Parliament requires one to have been a CEO, managing director of a corporation, a top city lawyer, or to have fought in a war. We need people with various experiences—individuals willing to get their hands dirty, listen, and seek advice from those running corporations, charities, or residents' associations.\nThis video outlines some of my experiences that will help me understand issues like disability, the NHS, running your own business, and fostering. I also have experience with business tax returns, working in defence, and being a parent. All of this contributes to being a grounded representative, but most importantly, I will listen to others with different experiences to ensure I always take an informed and balanced position.",
  "https_www_marisaheath_uk_/https_www_marisaheath_uk_news_category_Westminster-News/content_29.html": "Liberal Democrats insult to the Post Office victims 5th January 2024 I was reading about the Post Office scandal this week and in particular a Surrey sub-postmaster who was a victim. Seema Mistra from West Byfleet was wrongly... Westminster News\nKemi Badenoch 19th December 2023 Kemi’s profile went up recently when she went before the Women and Equalities Committee and stood up for truth. A member of that committee, Labour MP Kate... Westminster News\nMy response to yesterday’s autumn statement 23rd November 2023 What I think this budget has shown is that Rishi Sunak and Jeremy Hunt are committed to getting us back to having a true Conservative position as well as... Westminster News"
}