{
  "https_strawinnovations_com_the-team_/https_strawinnovations_com_the-team/content_1.html": "Meet our Executive Team\nCraig Jamieson\nFounder\nBrian James Arevalo\nCEO\nLaumar Alan Dave Grafilo\nEngineering Manager\nMaybellene Mendoza\nBusiness Support Manager\nJay-Rness Ceria\nBrand, Sales, & Marketing Manager\nGabriel Escultos\nField Opertions Engineer\nKirsten Jae Laurico\nCommercial Operations Engineer\nRico Erasto Ubal\nInnovations Engineer\nJoshua Morato\nTechnical Operations Engineer\nCraig Jamieson\nFounder of Straw Innovations\nCraig Jamieson originally trained in horticulture and has a master’s degree in International Rural Development with ‘Distinction’. He has worked in business management, consultancy and also scientific research, specializing in sustainable biofuels and bioenergy. His work has taken him across Africa and Asia developing bioenergy solutions that enhance rather than compete with food production. His clients have included the UK Government, UN FAO, World Agroforestry and the International Rice Research Institute.\nIn 2016 with support from the UK Government, Craig established an industrial pilot plant making clean fuel from waste rice straw. Straw Innovations Ltd was born and he is now preparing to take it to first commercial scale in the Philippines.\nBrian James M. Arevalo\nCEO\nBrian James Arevalo is a seasoned professional with a 13-year track record in waste-to-energy and reverse logistics operations. Throughout his career, Brian has been a driving force in developing sustainable solutions to address the challenges of developing alternative energy sources. His expertise spans the entire waste-to-energy value chain, from conceptualizing innovative projects to implementing efficient operational strategies. Brian's commitment to a circular economy and his ability to navigate the complexities of alternative fuel resources have positioned him as the Head of Operations at Straw Innovations.\nBrian plays a pivotal role in shaping the company's operational landscape. His keen insights and collective approach have contributed significantly to the company's goals, fostering a culture of excellence and innovation. Under Brian's guidance, Straw Innovations has seen remarkable growth, with streamlined workflows and enhanced productivity. His commitment to operational excellence makes Brian an invaluable leader in Straw Innovations.\nLaumar Alan Dave R. Grafilo\nEngineering Manager\nLaumar Alan Dave R. Grafilo is a dynamic and licensed Agricultural Engineer with a Master's Degree in Energy Engineering. He has a passion for sustainable solutions in the field of bioenergy. With a solid foundation in agricultural and energy engineering, Laumar has dedicated five years of his professional career to pioneering advancements in Agricultural R&D and in the field of renewable energy sources. His expertise lies in the intersection of agriculture and technology, where he has played a pivotal role in developing innovative approaches to harness bioenergy efficiently.\nCurrently serving as the Engineering Manager at Straw Innovations, Laumar oversees the implementation of cutting-edge technologies to revolutionize the straw utilization industry. His strategic vision and hands-on experience contribute to the company's mission of promoting environmental sustainability through the development of eco-friendly solutions. Laumar's commitment to pushing the boundaries of bioenergy and sustainable practices positions him as a key player in shaping the future of agricultural engineering and its impact on a greener, more resilient world.\nMaybellene C. Mendoza\nBusiness Support Manager\nMaybellene Mendoza is a seasoned professional with 18 years of extensive experience in finance and administrative functions. Her journey in both corporate and research organizations has been marked by a relentless commitment to excellence and a meticulous approach to financial management and administrative operations. Maybellene has demonstrated exceptional proficiency in handling complex transactions, finance controls, and strategic planning. Her analytical skills and keen attention to detail have contributed significantly to the success of the organizations she has been a part of.\nCurrently serving as the Support Services Manager at Straw Innovations, Maybellene oversees a wide range of support functions, ensuring seamless support within the company's operations. Maybellene's wealth of experience, coupled with her passion for innovation and excellence, positions her as a valuable asset in the dynamic landscape of support services at Straw Innovations.\nJay-Rness D. Ceria\nBrand, Sales, & Marketing Manager\nJay-Rness Ceria is a passionate advocate for Filipino farmers, with a proven track record for nearly a decade of driving market growth and building strong industry relationships. His diverse agricultural expertise spans market research, product development, and technical training, honed through years of direct engagement with stakeholders across the vegetable seed, fertilizer, and rice industries.\nJay-Rness excels at bridging the gap between farmers' needs and innovative solutions. He has spearheaded successful campaigns to introduce new technologies and products; spearheaded market expansion strategies; and built robust networks with government agencies, farmer associations, and project partners.\nDriven by Straw Innovations' vision to revolutionize the rice industry, Jay-Rness is adept at managing diverse teams, fostering communication, and resolving complex issues. Whether spearheading field demos, conducting pre-market assessments, or delivering training programs, his dedication to farmer success shines through.\nMore than an agricultural expert, Jay-Rness is a champion for Filipino farmers, committed to empowering them with the knowledge and resources needed to thrive.\nPartners and Collaborators\nOffices\nLawes Open Innovation Hub, Rothamsted Research, UK\nwith operations in Pila, Laguna, Philippines\nCall Us\n+63 915-914-3770\nEMAIL US\ninfo@strawinnovations.com",
  "https_strawinnovations_com_the-team_/https_strawinnovations_com/content_3.html": "Straw Innovations\nInspired by Nature\nWhat We Do\nReduce Rice Emissions\nIt’s a dark secret: rice is responsible for more emissions than the entire aviation industry.\nYet, it has only had a fraction of the attention and investment.\nStraw Innovations has invested $millions in cutting edge R&D to finally make it possible for you to enjoy your rice with less than half the emissions. The secret is in our proprietary technologies that rescue straw from boggy rice fields – conditions where normal farm equipment doesn’t work. If we didn’t do that, it would typically be burned or left to rot and release methane – one of the most powerful greenhouse gases. We don’t stop there: having collected the straw, we transform it from a polluting waste into a valuable, eco-friendly resource for clean energy and fertilizer for the next low-emissions rice crop. Our platform technologies are the first of their kind in the world; that’s why we’re called Straw Innovations.\nHelp The Farmers\nIt’s not fair. The people who work the hardest under the scorching sun to produce our food are also some of the lowest paid in the world. We help rice farmers to work smarter and make more income from their crop. Instead of all the profit going to middle men and big millers, we enable our farmers to get more reward for their effort and break out of perpetual cycles of poverty.\nEnjoy Rice Without The Guilt\nIt hurts to think about it. One of life’s essential and most enjoyable activities – eating food – is also damaging our precious planet more than any other human activity. A third of all greenhouse gases, most of our freshwater use, land use, deforestation… is caused by the food we eat. It leaves a bitter taste in the mouth.\nWe hear you. The emissions from rice production are worse than wheat, maize, soya beans, palm oil and all the other crops in the world combined. Its mostly from methane – 83 times more potent than CO2 over a 20 year period. The upside is that, cutting these emissions is one of the fastest ways to tackle climate change. Together, we can do this and more. Now you can switch to low emissions rice and make a positive impact, without having to compromise on quality and flavor. Enjoy your rice without the guilt.\nFood. Fuel. Fertilizer.\nTransforming Asia’s largest waste into a surprising climate solution\nPartners and Collaborators\nOffices\nLawes Open Innovation Hub, Rothamsted Research, UK\nwith operations in Pila, Laguna, Philippines\nCall Us\n+63 915-914-3770\nEMAIL US\ninfo@strawinnovations.com",
  "https_strawinnovations_com_the-team_/https_strawinnovations_com_blogs/content_4.html": "News & Updates\nUpdates\nGood things are happening at Straw Innovations\nStraw Innovations selected by Cambridge University as a case study.\nThe University of Cambridge Judge Business School has selected Straw Innovations as a case study for its prestigious ‘EnterpriseTECH’ programme. A team of five students on the course are working with the company to develop a business plan for commercialising its suite of technologies. The students will present their findings in a report and deliver a pitch to their peers, supervisors and other participating companies in March. For more information on the EnterpriseTECH programme, visit https://www.jbs.cam.ac.uk/entrepreneurship/programmes/enterprisetech/.\nStraw Innovations Field Trials and Farmer's Responses\n“Ideas won’t keep. Something must be done about them”\n– Alfred North Whitehead\nPartners and Collaborators\nOffices\nLawes Open Innovation Hub, Rothamsted Research, UK\nwith operations in Pila, Laguna, Philippines\nCall Us\n+63 915-914-3770\nEMAIL US\ninfo@strawinnovations.com",
  "https_strawinnovations_com_the-team_/https_strawinnovations_com_scientific-advisor-board/content_2.html": "Scientific Advisory Board\nProf. Patricia Thornley\nDirector, Supergen Bioenergy Hub,\nSchool of Engineering and Applied Science, Aston University\nDr. Renato Reyes\nProfessor in Mycology, Central Luzon State University\nDr. Saran Sohi\nUK Biochar Research Centre, School of Geosciences Global Academy of Agriculture and Food Security\nDr. Rodel Lasco\nScientific Director, OML Center for Climate Change Adaptation. IPCC Lead Author. National Scientist.\nDr. Rex Victor Cruz\nUP Scientist and Former Chancellor, University of the Philippines Los Baños (UPLB),\nIPCC Lead Author\nPartners and Collaborators\nOffices\nLawes Open Innovation Hub, Rothamsted Research, UK\nwith operations in Pila, Laguna, Philippines\nCall Us\n+63 915-914-3770\nEMAIL US\ninfo@strawinnovations.com"
}