{
  "https_medp_uk_/https_medp_uk_plans/content_3.html": "OUR PLANS\nVote\nFirst and foremost, we want you to vote for us.\nIf we are not standing a candidate in your constituency, we’re asking you to spoil your ballot in favour of us.\nSpoiling your ballot is a valid form of voting. All spoilt ballots are recorded, so we (and the main parties) will know and understand your preference.\n2024 General Election\nCandidate for Cities of London & Westminster\nIntroducing Tim Hallett:\nCandidate for Cities of London and Westminster\nFounder – MEDP\nMy name is Tim Hallett, and I’m the founder of the Modern Evolutionary Democracy Party.\nMEDP is the product of many years of increasing dissatisfaction with our current system, and analysis of the alternatives. I spoiled my ballot in 2019 and have been searching for someone to vote for since. As no-one has emerged, I have decided that the best – and perhaps only – way to change things is to make it happen.\nI hope that the MEDP proposals make it clear that my core belief is that power is best held and exercised by the people, and that there is more that there is more that binds us than divides us.\nAlthough the party has a national agenda, I understand that the most present and pressing duties for a constituency MP are making sure that your voices are heard in Westminster.\nI am, fundamentally, an ordinary person. I have lived and worked in Westminster. I struggled through the pandemic. I have lived through the problems with the NHS, with not feeling safe on our streets, and with paying ridiculous rents for years (and I still do!).\nI can promise to be a strong, independent voice for our constituency and in the coming years, as MEDP is embraced by the rest of the country, your concerns and aspirations will always guide my actions. Together, we can build a brighter, more prosperous future for all and I intend that the City of Westminster and the City of London be at the forefront of it.\nI humbly ask for your support and your vote.\nBeyond 2024\nWe are a new party, but we have big ideas and big plans.\nIt is our intention to stand candidates in every seat and in every constituency in the 2028/29 General Election.\nIn the coming years, we will work to expand and refine our platform and spread our message. We cannot do this without you.",
  "https_medp_uk_/https_medp_uk/content_1.html": "REAL CHANGE.\nWelcome to Modern Evolutionary Democracy, a political party born out of the belief we can do so much better.\nWe are proposing an innovative new model of government that takes the most successful, proven systems from around the world and combines them with leading-edge political theory to create something new.\nOur system will end the stranglehold of politicians who operate from a single ideology; promote policy-making by experts and ordinary people with impartial information; discourage unnecessary short-termism and encourage a longer-term, more strategic approach to today’s issues; and place routine oversight of policy-making back into the hands of the British public.\nWe exist for one reason only, and for only as long as it takes: to change government from the ground up. Because once that works as it should, everything else can follow.\nChange – real change – starts here.\nWHAT’S NEXT?\nWe know these are significant ambitions. We’d love to explain to you how we’re going to achieve this.\nWe are not a pressure group. We are a UK-registered political party. We are asking you to vote for us.\nOn this website, you’ll find resources that explain the structure of our new democracy and the reasoning behind it. We try to answer some of the questions you might have. We lay out our plans. And you’ll find details of how to get involved.\nOUR SYSTEM\nDiscover the structure of our new democracy here, and find answers to your questions.\nOUR PLANS\nFind details of our candidacy for the 2024 UK General Election, and our plans beyond it.\nGET INVOLVED\nSign up to our mailing list, find out how to get involved in person, join us, and donate.",
  "https_medp_uk_/https_medp_uk_system/content_5.html": "OUR SYSTEM\nWe believe that our democracy should be organised following a well-established or self-evident set of democratic principles. These are:\n- Every vote should count equally.\n- To the voter, the ability to set the agenda is as important as the ability to choose who enacts the agenda.\n- Government should, by default, think strategically and over the long-term unless the problem requires a short-term solution.\n- In conjunction with the above, Government should also be dynamic and responsive: it should be able to respond to change and world events but it should not forget the above principles in doing so.\n- Adversarial politics has a place, but politics should not be about “winning” and “losing”. We all have the same goal: to improve our lives for ourselves and our children. There is more that binds us than divides us.\nWith these principles in mind, we propose the following solution:\nElected Chamber\n- Democratically elected\n- Elections remain a potent way of choosing individuals with good ideas who we trust to enact policies\n- Responsive if necessary, with a mandate to be so\n- Provides oversight of Citizen’s Assembly\n- Single term-limited with set election periods\n- Ensures individuals stand for election on the strength of their ideas, not the strength of their political connections\n- Prevents short-termism due to the lack of need for results by the end of the election cycle\n- Instead of bowing to internal pressures: Lets our leaders, lead!\n- Organised under a PR system\n- The majority of people in this country, and twice as many under-49 year olds, support a PR system\n- Fairer, encourages a wider range of views, and ensures every vote is counted.\n- Either Party List or Ranked voting\n- Likely leads to the end of the political party.\n- If voters are able to vote for individuals with a realistic chance of winning, the party loses its power\n- If parties lose the ability to plan for their own succession, ideological biases end, as does nepotism and Old Boys networks.\n- Allows experts to become policymakers\n- Gives access to experts to enter power without having to climb the ladder of Westminster politics\n- Encourages innovation and innovative solutions\n- Current system prevents this: experts with contrarian views are too much of a challenge to party ideology (even if they’re right)\n- Forces collaboration and coalition between members\n- Prevents extremist views from becoming mainstream\n- Ends the disgraceful way our politicians talk to each other!\nCitizen’s Assembly\n- Randomly selected, as we currently do by jury (“sortition”)\n- With a large enough assembly – we propose 151 members – this ensures a wide range of views\n- Highly representative of our current society – everyone of voting age would be eligible\n- Prevents extremism from becoming mainstream\n- Shorter term service period\n- We propose two years\n- Would likely enhance career prospects of members without needing to spend extended period serving\n- Once an individual has served on the Assembly, they would become ineligible for future service\n- Enfranchises ordinary citizens\n- Any ordinary person might be selected to work on major issues and enact laws\n- Individuals with good ideas would be able to petition the Assembly; it is therefore accessible\n- Arguments against those ideas would also be made\n- The biases and egos of petitioners would be irrelevant, as both argument and counter-argument is given equal opportunity\n- The strongest ideas with the best evidence base would become policy\n- Expertise comes in many forms: this mechanism would allow for all of them\n- Possesses inherent incorruptibility\n- The entire Assembly would need to be “bought” for any powerful individual to exercise undue influence. This would likely be impossible without it becoming obvious, prohibitively expensive, and/or reported\n- Provides oversight of Elected Chamber\n- If chosen on a regional basis, would retain geographical links between representative and community\n- Members would come from every UK community\n- Ensures equal representation for all regions of England, Wales, Scotland & Northern Ireland\nFAQs\nWe have a democracy. Why change it?\nThere’s a reason why only 9% of us trust our politicians to tell the truth. We know something is severely wrong, but our system encourages blame of individual politicians (many of whom deserve it), without looking at the structural problems that underlie them.\nThe evidence of the structural problems are everywhere. Our leaders – both in power and in opposition – are incredibly unpopular. Parties change the rules whenever it suits them to get the results they want. Turnouts are declining, which together with the ability of a party to win power with barely more than a third of the popular vote, means that in every election more people don’t want the government we get, than do want them. All of this is baked in to the system – it’s a feature, not a bug.\nOur democracy is broken, and if it continues this slide, we’re in trouble. But it’s also the silver bullet to a fairer society. If we can fix it, we can fix everything.\nWon’t the policies under the new system be basically the same as under the old system?\nNo. Unequivocally not.\nOur electoral system encourages short-term thinking. A policy that takes 10 or 15 years to come to fruition does nothing for a politician who has to win an election in 4 or 5. But all good policy takes time.\nIf we remove the relentless electoral cycle, it will free policymakers to start making decisions based on what’s best for the country over short-, medium- AND long-term.\nThis feels intuitively true. Good industrial strategy or energy policy takes a generation to implement – and affects generations when we get it wrong. We need to be building houses or roads for where the population is in 10 or 15 years, not 3 or 4. Knife crime isn’t solved by putting more police on the streets or further criminalising disenfranchised young people: it’s solved by giving them hope and a reason not to carry knives.\nWe have to end policies that treat the symptom while ignoring the cause. That can never happen under the current system. It can under ours.\nWon’t we lose a ton of expertise from experienced politicians?\nBut you only need to look over the prior experience of our current and former Cabinets to know that we aren’t losing expertise of any value. Politics teaches people to do one thing well: be politicians, which is to say, persuade, cajole and occasionally bludgeon into holding the party line – in itself, the opinion of usually a handful of people – without necessarily paying attention to what the evidence suggests.\nExpertise comes from study and/or years of experience. If politicians have expertise in something, it’s largely incidental to their policy briefs.\nAnd we have a very pure recent example of when policy was taken out of the hands of politicians and left to the experts. At the height of the pandemic, we had no policy on producing a vaccine and administering it to the whole country, because we simply hadn’t foreseen the need.\nSo we handed over the vaccine production and rollout to our medical experts, and it was an unqualified success. This is what can happen when the politicians are pushed to the side and intelligent, qualified people follow the evidence. We’re trying to make sure those same people have a mandate to do this more.\nIsn’t this really radical?\nThat depends on your perspective.\nViewed from the state of our current democracy, these do seem like big changes. But all we’re really advocating for are changes that should have happened over a number of years.\nThe basic structure of our democracy was laid out in the early 18th century. In 1700, 30% of the population could read and it took ten days to travel from Edinburgh to London. Our system made sense then.\nBut our society is totally different now – that’s obvious. The structure of our democracy should have changed as society did, but it hasn’t. We’re just proposing changes that really should have already happened, and there’s nothing radical about that.\nYou’re a political party. Why do you want to end them?\nBecause they’re bad for our democracy. This is going to be a long answer.\nThey made sense at one point, but the world has changed beyond all recognition since then. Ordinary people are now highly-educated by 18th century standards. On a daily basis we’re also exposed to a wider range of views and arguments than would have been possible in a lifetime when our democracy began.\nAgainst this background it seems absurd to suggest that any of us would agree 100% with any other of us on every issue, but having a two-party system forces us to do exactly that, and as the parties have moved closer together, it’s given us even less choice. This is why so many of us feel politically homeless to a greater or lesser extent. It’s also why “tactical voting” exists, but we think nobody should have to choose between the lesser of two evils in an election. That’s just fundamentally undemocratic.\nIt’s also meant that individuals with one type of power – legislative – are targets for people with another type of power – financial. It’s a simple fact that money buys access, which buys influence, which buys results. It also buys peerages…\nWe think this is all widely accepted, but as far as we can tell, nobody has offered an alternative – until now!\nUnder this system, how would we choose our leaders?\nWe’re not sure, but we have some ideas.\nOne method could be, allowing an outgoing Citizen’s Assembly to shortlist leaders, who are then voted on at election. Another could be to make sure that leadership is baked-in to the PR system. There are more alternatives, and certainly some we haven’t thought of (yet).\nWe’re thinking about this, and when we win power, we’ll make sure we have a solution that’s as carefully thought-through as the rest of our platform.\nI like to be able to go to my MP if I have a problem. Will I lose that?\nOne of the few strengths of the Westminster system of government is the direct link between constituency MP and voter.\nWe’re creating a new system. We don’t have to lose that.\nIt’s our intention that not only will the link between constituency voter and the democratically-elected member be preserved, but additional links between citizen and Citizen’s Assembly member will be available. We’ve been clear: this system is designed to make your voice more heard, not less!\nWhat is your opinion on “XXX” issue?\nOf course, we have opinions on the major issues facing our society.\nBut the mainstream parties’ positions on these issues are a product of the system. That’s why you won’t hear them making plans for ten or more years from now. We want to change that system, so it would be disingenuous for us to comment on the issues in the same fashion.\nWhere we do comment on issues, we’ll be essentially trying to do two things: to show how the approach of the main parties is a product of the system they exist in, and to highlight how different it could be if that system was changed for the better.\nIsn’t this just going to make politics even more London-centric?\nOne of the advantages of our model is that it’s easily scalable and replicable. That means that, if the need becomes apparent as we work out the details, we could place the same model throughout equally-divided regions of the UK.\nThe strengths of this are obvious: it would mean that politics would become less London-centric.\nWe’re thinking carefully about this, and will provide answers when the time arises.\nWhy haven’t you worked out the details?\nWe have an expectation that politicians need to have everything worked out when they announce a policy.\nBut that isn’t the way life normally works. We have an idea; we refine it; we draft it; when we enact it we correct the bits that don’t work, and strengthen the bits that do; and we go through the whole process again.\nThis is one of the reasons politicians fail so often. We won’t make the same mistake.\nWe won’t enact any of this without the best route forward for each of these details, but that’s still some way off. As our momentum grows, we’ll start to work out the details. But that takes time, money, expert thought – and YOUR input!\nDoes this mean that Scotland, Wales and Northern Ireland would get more of a say in Westminster politics?\nYes!\nIn fact, we’d argue, not only would they have more of a say in Westminster politics, it would address the Independence movements’ fundamental grievance: they’d have just as much of a say as everyone else.\nWe honestly believe that this model would make sure we keep the Union together (and make it stronger).\nWhy are you doing this now?\nWe’d planned to launch mid-2024 for an Autumn election, but Rishi Sunak threw a spanner in the works with that!\nWe’re enormously unprepared for the challenges of the future. The effects of climate change have barely begun, and most of our politicians don’t even really understand what AI (or AGI) is, let alone the impact it could have on our society. And that doesn’t touch on the mainstream issues that parties have consistently failed to solve over extended periods.\nWe have to be ready, and the main parties have proven time and again that they can’t be. So the question should really be: why hasn’t all of this happened sooner?\nWhere does all this come from?\nA variety of places. Much of it comes from looking at the systems of government around the world and noticing the correlations between the really successful ones. Other aspects come from theories advanced by political scientists, and from the ideas of existing pressure groups for PR and Citizen’s Assemblies.\nAll the most successful democracies have some form of PR system in place and a high level of civic participation from their population – for instance, the Scandinavian countries or New Zealand. We’re just copying that.\nCitizen’s Assemblies have been used to tackle issues in various countries, and almost invariably have been unqualified successes. They’re well-established and scalable. If you’d like to read more about them, we’d recommend Open Democracy by Professor Helene Landemore; or take a look at sortitionfoundation.org\nAs far as we know, though, these ideas have never been combined in this way before, and no-one has ever stood for election on this platform.\nIf all of this works, and your model puts us on the right track with everything – what will Government do?\nWe hope, eventually, as little as possible.\nWe’re all sick of repeated meddling in our lives every time a policy reverses the previous one. That’s a product of lack of strategic thinking, but that’s inherent within the system.\nOur plan is: get the right policy in place, and course-correct as necessary. Eventually, we hope – Government will only need the lightest touch, because we’ll have arrived at the best possible outcome.\nThe intention is, that if we can get this right, Government necessarily becomes light touch.",
  "https_medp_uk_/https_medp_uk_get-involved/content_4.html": "GET INVOLVED\nVote\nFirst and foremost, we want you to vote for us. For details of our candidacy in the 2024 UK General Election, go to OUR PLANS\nParticipate\nIf you would like to get involved in person – be it handing out leaflets, assisting with graphic & web design, strategy and planning, if you’d like to discuss standing as a candidate on our platform, or if you just have a really good idea – please use the below form.\nMailing List\nJOIN US\nWatch this space for details of how to join Modern Evolutionary Democracy.\nDONATE\nIt is a truth of our system that the parties who spend more, win more. We are accepting any and all donations to help us spread the word. Anything you can give us is enormously appreciated.\nWe are absolutely committed to transparency and our accounts will be published on this site.\n100% of your donation will go to helping us spread our message and win office.\nPlease note, you MUST be a UK-registered voter to donate.\nTHANK YOU.",
  "https_medp_uk_/https_medp_uk_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}