{
  "https_directdemocracycandidate_org_/https_directdemocracycandidate_org/content_1.html": "STOP switching the driver and change the engine of our Democracy!\nVote for Direct Democracy\nWelcome to the website of Mr John Generic, independent candidate for the Cities of London and Westminster constituency.\nJohn is running on a platform of efficiency. By eradicating the ability to seek power through governance, we reduce the manipulation of processes within government that lead to long term inefficiencies in the way the country is run. Tired of your vote not making any real difference? It’s time to change the way we govern!\nPlease feel free to leave your details in the sign up section and pledge your support for a new tomorrow where we are in full control of our futures.\nWhat does the Direct Democracy candidate stand for?\nDirect Democracy basically means that the total population of a society is directly involved in the decision making for the society.\nWe believe that the further power is divided, the less corruption and inefficiencies can grow in a system because the power to enact change is never concentrated to a few.\nThe fact is that representational democracy bottlenecks the power of all society into the hands of a few people by trusting them with our power to act and what to enact on. This not only encourages Power to be a factor to be manipulated but also enables third party entities in society to manipulate the governance of society by infiltrating these areas of weakness in the system.\nJohn’s background in process improvement means that the solution he is bringing forward has been specifically designed to equally distribute power but also fairly distribute Accountability, Responsibility, Risk, and Reward so that all people in a society, no matter background, class etc, can contribute to the efficient running of society and evolve their thinking around society together.\nSo with the intention to divide the power of governance between every living member of that society, John made the following manipulation to the process:\nTo understand how this works please see the simple video below for a holistic view on how it encourages this manipulation.\nRepresentational Democracy\nDirect Democracy\nWhat the simple diagrams above shows is that under representational democracy, we give our rights to make the decisions on actions that affect us to the few people who claim they know what’s good for us.\nUnder Direct democracy however, you can see that the strategic goals setting is split away from politicians and given to the population in the form of periodic referendums.\nSo how will it work?\nIn a nutshell, the population are given the chance to define what are their top strategic priorities for the country through a very guided process of selecting a list of top 10 goals.\nThese lists are amalgamated into an average set of top 10 goals for the country.\nThe parties then review these strategic goals and set out in their manifestos exactly how they would implement these goals.\nWe then have an election based on who we think will BEST IMPLEMENT OUR COLLECTIVE GOALS.\nThis party is then put in power and they focus on delivering these goals and we measure them on how well they attain these goals.\nAnother key factor here is that the House of Lords’s function and purpose completely changes too and their core goals becomes simply this: To monitor and best express the performance of the governing party in delivering the goals set by the population.\nThis enables the people to become well informed and reduces the risk of misinformation being used as a tool to deflect the attention away from actual performance and keep us focused on performance and growth.\nSign Up\nInterested to learn more?\nIf you are interested in supporting Direct Democracy being implemented then please input your details below and our team can reach out with more information."
}