{
  "https_www_noor4ilfordsouth_com_/https_www_noor4ilfordsouth_com_volunteer/content_2.html": "Home\nZoom Calls\nManifesto\nDonate\nVolunteer\nRegister to Vote\nSelect Page\nVolunteer\nLoading…",
  "https_www_noor4ilfordsouth_com_/https_www_noor4ilfordsouth_com_register-to-vote/content_3.html": "Register to Vote\nIt takes less than 5 minutes to register to vote\nWhy Register to Vote?\nRegistering to vote gives you the power to have a say in important decisions that affect your community and country.\nHow to Register to Vote\nThe quickest and easiest way to register is online.\nIt only takes 5 minutes. Visit Register to Vote and follow the simple instructions by clicking on the register button shown.\nIf you prefer to register by post, you can find the instructions on the website as well.\nOnline Registration\nWhen you register online, you’ll need to provide your name, address, date of birth, and National Insurance number (but you can still register if you do not have one). It’s a quick and straightforward process.\nAfter Registration\nAfter you’ve registered, your name and address will appear on the electoral register.\nDon’t Miss Out on Your Chance to Vote!\nRegistering to vote is important and easy. Don’t miss out on the opportunity to make your voice heard. Register today!",
  "https_www_noor4ilfordsouth_com_/https_www_noor4ilfordsouth_com_manifesto/content_7.html": "Manifesto for Noor Jahan Begum – Independent Candidate for Ilford South\nAs your independent candidate, I am committed to addressing the most pressing issues affecting our community and society at large. My vision is one where fairness, equality, and justice are at the forefront of our collective progress. I pledge to tirelessly and passionately advocate for the following priorities:\n1. More Funding for the NHS\nThe NHS stands as a beacon of equality, embodying the principle that healthcare is a universal right, not a privilege. We all understand the peace of mind that comes from knowing we can see a GP or specialist when needed, regardless of our social or economic background. Increased funding is essential to maintain and enhance this vital service. By ensuring central government allocates more resources to the NHS, we can guarantee that it continues to save lives and uphold the dignity of every individual in our community.\n2. Tackle the Cost of Living Crisis\nThe escalating cost of living has plunged too many families into poverty. It is unacceptable that hard-working people are forced to sacrifice basic necessities to provide proper meals for their children. The proliferation of food banks, now a lifeline for many, highlights the urgency of this crisis. I will fight for policies that reduce living costs and provide tangible support to struggling families, ensuring that no one has to choose between heating their home and feeding their family.\n3. More Policing for Safer Neighbourhoods\nSafety is a fundamental right. Our neighbourhood police officers play a crucial role in making life safer and better for everyone. They provide the confidence and peace of mind needed to live our lives without fear. I will advocate for increased funding and support for our police force to ensure they have the resources necessary to protect and serve our communities effectively.\n4. Social Justice and Human Rights\nTrue progress is inclusive, and often measured by the way in which we protect the most vulnerable in our community. I am dedicated to promoting social justice and safeguarding human rights for all. This means fighting against discrimination, ensuring equal opportunities, and upholding the dignity of every individual, regardless of their ethnic, religious or social background. I passionately believe that by fostering a society that values and respects diversity and individuals, we can build a stronger, more cohesive community.\n5. Affordable Housing\nHousing is a basic human need, yet too many are struggling to afford a place to live. I will champion policies that increase the availability of affordable housing, ensuring that everyone has access to safe and decent accommodation. This includes supporting initiatives that promote sustainable development and protect tenants’ rights.\n6. More Inclusive Education\nEducation is the foundation of a successful, progressive society. An inclusive education system that caters to the diverse needs of all students is essential for fostering a society where everyone can thrive. I will push for policies that support equal access to quality education, ensuring that every child has the opportunity to succeed, regardless of their circumstances. An increased investment in education will also develop essential skills by our younger generation; unleashing skills and talents which are valuable for the individual and society overall, to allow for meaningful participation in civil society and political life. I will support initiatives which supports adult learning and training for the workplace.\n7. Support the Rights of the Palestinian People\nThe catastrophe facing the Palestinian people is a defining global justice issue of our time. As global citizens, it is our duty to stand up for justice and human rights everywhere, whether on our doorstep or further afield. I pledge to work with agencies and challenge the government, to support the rights of the Palestinian people, advocating for a peaceful and just resolution to their plight. By promoting dialogue, understanding, and compassion, we can contribute to a more equitable and peaceful world.Together, we can build a community and a society that reflects our shared values of fairness, equality, and justice. With your support, I will work tirelessly to turn these pledges into reality.\n8. Supporting Local Business\nI stand for prosperity for all withing our community and will advocate for greater support local business to create opportunities for growth and expansion of enterprise. I support initiatives which will bring thriving high streets and business hubs that will reinvigorate Ilford South both economically and socially.\nNationally\nI support investment in public services, in particular the NHS, schools, and the criminal justice system. I support electoral reform, an end to arms sales to countries involved in civilian killings, and rapid action on the climate crisis. In addition I support reform of party political funding and curtailing the influence of large corporations on public policy\nLocally\nI have been vocal on the urgency of the need to add a new wing to King George’s Hospital to increase capacity, called for a review of development plans for 1280 homes in Goodmayes Tesco site. I have expressed the need for rapid repairs to the Broadmead Road bridge in Woodford Green, closed by Redbridge Council due to safety concerns, and advocate for urban renewal of the Ilford Town and Ilford Lane area. I have stated my opposition to over development without adequate investment in infrastructure and to the closure of local resources. I have also been advocating for greater consultation of stakeholders particularly parents and a further review of plans to convert Park Girls into a school for children with special educational needs.\nFor a more detailed outline of my vision for Ilford South please refer to the following downloadable document.\nVote for Noor Jahan, and let’s create a future we can all be proud of!",
  "https_www_noor4ilfordsouth_com_/https_www_noor4ilfordsouth_com_zoom-calls/content_5.html": "Talk to Noor\nCome chat with Noor, the Independent MP candidate for Ilford South, and get to know her better! For more details about these online events and to register please refer to this eventbrite page.\nSaturday 15th June ,2024 – Join Zoom Meeting\nhttps://us06web.zoom.us/j/89484915147?pwd=8e3Pq3JhBdQXY7FS8HnmH2IVTb2bO4.1\n(Meeting ID: 894 8491 5147, Passcode: 745313)\nSaturday 22nd June , 2024 – Join Zoom Meeting\nhttps://us06web.zoom.us/j/82926373616?pwd=Zf5DgaA0iON4voYB2g7NuUYUy2B0Dt.1\n(Meeting ID: 829 2637 3616, Passcode: 518199)\nSaturday 29th June , 2024 – Join Zoom Meeting\nhttps://us06web.zoom.us/j/85259768118?pwd=0qyvhQ6kZOEbmwZUjJ5aLnJGcxXCaD.1\n(Meeting ID: 852 5976 8118 , Passcode: 650039)\nTuesday 2nd July, 2024 – Join Zoom Meeting\nhttps://us06web.zoom.us/j/82539331938?pwd=XhqoYRAhdlWppcbK2COa1wuwNVmdXU.1\n(Meeting ID: 825 3933 1938, Passcode: 237465)",
  "https_www_noor4ilfordsouth_com_/https_www_noor4ilfordsouth_com_privacy/content_6.html": "At Noor4IlfordSouth campaign (NC) we are committed to protecting the privacy and\nsecurity of your personal information. This privacy notice outlines how we collect,\nuse, and safeguard your personal data in accordance with the General Data\nProtection Regulation (GDPR) and the Data Protection Act 2018.\n- Information We Collect\nWe may collect and process the following types of personal information:\n- Contact Information: Names, addresses, email addresses, and phone numbers.\n- Demographic Information: Age, gender, and other relevant demographic details.\n- Communication Preferences: Your preferences regarding how we communicate\nwith you. - Professional Information: Resume/CV, cover letter, employment history,\nqualifications, skills, and references. - Sensitive Information: Information about disabilities or health conditions relevant to\nthe job, if applicable. - Other: any other personal information provided voluntarily by you when you register,\nsign up for events, subscribe to our newsletters, or as part of our Volunteer\nManagement processes. - Non-personal information: such as browser type, operating system, and IP\naddress for website analytics.\n- How We Use Your Information\nMost of the personal information we process is provided to us directly by you. We\nuse your personal information for the following purposes:\n- Communication: To keep you informed about our activities, events, and initiatives.\n- Volunteer Management: If applicable, to manage volunteers and their contributions\nin particular: - To assess your suitability for a position you may have applied for.\n- To communicate with you about the volunteer application process.\n- To verify your information and carry out background checks, where\napplicable. - To comply with legal or regulatory requirements.\n- Fundraising: If applicable, to seek your support for fundraising activities.\n- Analyse: website usage and improve our content, provide and personalise our\nservices.\n- Legal Basis for Processing\nUnder the General Data Protection Regulation (GDPR), the lawful bases we rely on\nfor processing this information are:\nNoor4IlfordSouth Campaign\n(a) Your consent. You are able to remove your consent at any time. You\ncan do this by contacting [email protected]\n(b) We have a legitimate interest.\n(c) We have a legal obligation.\n- Data Sharing\nIn certain instances, we may share your data with trusted third-party organisations to\nsupport volunteer management and fundraising objectives. This will be done in strict\ncompliance with applicable data protection laws.\n- Data Security\nWe take the security of your personal information seriously and have implemented\nmeasures to protect it from unauthorized access, disclosure, alteration, and\ndestruction. We will not hold your personal data for any longer than is required. In\nmost instances this will not exceed two years. We will dispose of this information\nsecurely, either by deleting it (erasure) or by anonymising it, so that it is no longer in a\nform which permits identification of data subjects.\n- Cookies\nWe use cookies to enhance your browsing experience. You can set your browser to\nrefuse cookies, but this may limit some features on our website.\n- Links to Other Websites\nOur website may contain links to other websites. We are not responsible for the\nprivacy practices of these sites and encourage you to review their privacy policies.\n- Your Rights\nUnder data protection law, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal\ninformation.\nYour right to rectification – You have the right to ask us to rectify personal\ninformation you think is inaccurate. You also have the right to ask us to complete\ninformation you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal\ninformation in certain circumstances.\nYour right to restriction of processing – You have the right to ask us to restrict the\nprocessing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the\nprocessing of your personal information in certain circumstances.\nNoor4IlfordSouth Campaign\nYour right to data portability – You have the right to ask that we transfer the\npersonal information you gave us to another organisation, or to you, in certain\ncircumstances.\nYou are not required to pay any charge for exercising your rights. If you make a\nrequest, we have one month to respond to you.\n- Contact Information\nIf you have any questions, concerns, or requests regarding the processing of your\npersonal information, please contact: [email protected]\n- Changes to the Privacy Notice\nWe may update this privacy notice periodically. We will notify you of any significant\nchanges by posting the updated statement on our website.\nThank you for being a part of Noor4IlfordSouth and contributing to the strength and\nvibrancy of our community.\nNoor4IlfordSouth Campaign\nLast Updated 20th May 2024",
  "https_www_noor4ilfordsouth_com_/https_www_noor4ilfordsouth_com_terms/content_4.html": "Introduction\nThese terms of use govern your use of our website; by using our website, you agree to these terms of use in full. If you disagree with these terms of use or any part of these terms of use, you must not use our website.\nYou must be at least 18 years of age to use our website. By using our website and by agreeing to these terms of use, you warrant and represent that you are at least 18 years of age.\nOur website uses cookies. By using our website and agreeing to these terms of use, you consent to our use of cookies in accordance with the terms of our privacy policy.\nLicence to use website\nUnless otherwise stated, we or our licensors own the intellectual property rights in the website and material on the website. Subject to the licence below, all these intellectual property rights are reserved.\nYou may view, download for caching purposes only, and print pages from the website for your own personal use, subject to the restrictions set out below and elsewhere in these terms of use.\nYou must not:\n(a) republish material from this website (including republication on another website);\n(b) sell, rent or sub-license material from the website;\n(c) show any material from the website in public;\n(d) reproduce, duplicate, copy or otherwise exploit material on our website for a commercial purpose;\n(e) edit or otherwise modify any material on the website; or\n(f) redistribute material from this website [except for content specifically and expressly made available for redistribution (such as our newsletter).\nWhere content is specifically made available for redistribution, it may only be redistributed within your organisation.\nAcceptable use\nYou must not use our website in any way that causes, or may cause, damage to the website or impairment of the availability or accessibility of the website; or in any way which is unlawful, illegal, fraudulent or harmful, or in connection with any unlawful, illegal, fraudulent or harmful purpose or activity.\nYou must not use our website to copy, store, host, transmit, send, use, publish or distribute any material which consists of (or is linked to) any spyware, computer virus, Trojan horse, worm, keystroke logger, rootkit or other malicious computer software.\nYou must not conduct any systematic or automated data collection activities (including, without limitation, scraping, data mining, data extraction and data harvesting) on or in relation to our website without our express written consent.\nYou must not use our website to transmit or send unsolicited commercial communications.\nYou must not use our website for any purposes related to marketing without our express written consent.\nRestricted access\nAccess to certain areas of our website is restricted. We reserve the right to restrict access to other areas of our website, or indeed our whole website, at our discretion.\nIf [we provide you with / you generate] a user ID and password to enable you to access restricted areas of our website or other content or services, you must ensure that the password is kept confidential.\nYou must notify us in writing immediately if you become aware of any unauthorised use of your account or password.\nYou are responsible for any activity on our website arising out of any failure to keep your password confidential and may be held liable for any losses arising out of such a failure.\nYou must not use any other person’s user ID and password to access our website, unless you have that person’s express permission to do so.\nWe may disable your user ID and password at any time in our sole discretion with or without notice or explanation.\nUser content\nIn these terms of use, “your content” means material (including, without limitation, text, images, audio material, video material and audio-visual material) that you submit to our website, for whatever purpose.\nYou grant to us a worldwide, irrevocable, non-exclusive, royalty-free licence to use, reproduce, adapt, publish, translate and distribute your content in any existing or future media. You also grant to us the right to sub-license these rights and the right to bring an action for infringement of these rights.\nYou warrant and represent that your content will comply with these terms of use.\nYour content must not be illegal or unlawful, must not infringe any third party’s legal rights and must not be capable of giving rise to legal action whether against you or us or a third party (in each case under any applicable law).\nYou must not submit any content to the website that is or has ever been the subject of any threatened or actual legal proceedings or other similar complaint.\nWe reserve the right to edit or remove any material submitted to our website, or stored on our servers, or hosted or published upon our website.\nNotwithstanding our rights under these terms of use in relation to your content, we do not undertake to monitor the submission of such content to, or the publication of such content on, our website.\nLimited warranties\nWe do not warrant the completeness or accuracy of the information published on this website; nor do we commit to ensuring that the website remains available or that the material on the website is kept up to date.\nTo the maximum extent permitted by applicable law, we exclude all representations, warranties and conditions relating to this website and the use of this website (including, without limitation, any warranties implied by law in respect of satisfactory quality, fitness for purpose and/or the use of reasonable care and skill).\nLimitations and exclusions of liability\nNothing in these terms of use will: (a) limit or exclude our or your liability for death or personal injury resulting from negligence; (b) limit or exclude our or your liability for fraud or fraudulent misrepresentation; (c) limit any of our or your liabilities in any way that is not permitted under applicable law; or (d) exclude any of our or your liabilities that may not be excluded under applicable law.\nThe limitations and exclusions of liability set out in this Section and elsewhere in these terms of use: (a) are subject to the preceding paragraph; and (b) govern all liabilities arising under these terms of use or in relation to the subject matter of these terms of use, including liabilities arising in contract, in tort (including negligence) and for breach of statutory duty.\nTo the extent that the website and the information and services on the website are provided free of charge, we will not be liable for any loss or damage of any nature.\nWe will not be liable to you in respect of any losses arising out of any event or events beyond our reasonable control.\nWe will not be liable to you in respect of any business losses, including (without limitation) loss of or damage to profits, income, revenue, use, production, anticipated savings, business, contracts, commercial opportunities or goodwill.\nWe will not be liable to you in respect of any loss or corruption of any data, database or software.\nWe will not be liable to you in respect of any special, indirect or consequential loss or damage.\nIndemnity\nYou hereby indemnify us and undertake to keep us indemnified against any losses, damages, costs, liabilities and expenses (including, without limitation, legal expenses and any amounts paid by us to a third party in settlement of a claim or dispute on the advice of our legal advisers) incurred or suffered by us arising out of any breach by you of any provision of these terms of use, or arising out of any claim that you have breached any provision of these terms of use.\nBreaches of these terms of use\nWithout prejudice to our other rights under these terms of use, if you breach these terms of use in any way, we may take such action as we deem appropriate to deal with the breach, including suspending your access to the website, prohibiting you from accessing the website, blocking computers using your IP address from accessing the website, contacting your internet service provider to request that they block your access to the website and/or bringing court proceedings against you.\nVariation\nWe may revise these terms of use from time to time. Revised terms of use will apply to the use of our website from the date of publication of the revised terms of use on our website.\nAssignment\nWe may transfer, sub-contract or otherwise deal with our rights and/or obligations under these terms of use without notifying you or obtaining your consent.\nYou may not transfer, sub-contract or otherwise deal with your rights and/or obligations under these terms of use.\nSeverability\nIf a provision of these terms of use is determined by any court or other competent authority to be unlawful and/or unenforceable, the other provisions will continue in effect. If any unlawful and/or unenforceable provision would be lawful or enforceable if part of it were deleted, that part will be deemed to be deleted, and the rest of the provision will continue in effect.\nExclusion of third party rights\nThese terms of use are for the benefit of you and us, and are not intended to benefit any third party or be enforceable by any third party. The exercise of our and your rights in relation to these terms of use is not subject to the consent of any third party.\nEntire agreement\nSubject to the first paragraph of Section [8], these terms of use, together with our privacy policy, constitute the entire agreement between you and us in relation to your use of our website and supersede all previous agreements in respect of your use of our website.\nLaw and jurisdiction\nThese terms of use will be governed by and construed in accordance with English law, and any disputes relating to these terms of use will be subject to the non-exclusive jurisdiction of the courts of England and Wales.\nCredits\nThis Terms & Conditions document was created using an SEQ Legal template. Further information may be obtained from the SEQ Legal website by clicking here.\nOur Details\nYou can contact us by email to info [at] www.noor4ilfordsouth.com\nLast Updated: 26th January 2024",
  "https_www_noor4ilfordsouth_com_/https_www_noor4ilfordsouth_com/content_1.html": "Meet Noor Jahan Begum: Your Independent Voice for Ilford South\nFed up with empty political promises? On July 4th, make your vote count for real change. Support Noor for Ilford South and let’s make a difference together.\nMy Priorities For Ilford South\n- To support an immediate ceasefire and increase humanitarian aid for Palestine.\n- To increase funding for the NHS and improve public services.\n- To tackle the cost of living crisis and increase support for the vulnerable.\n- To increase affordable housing and tackle homelessness.\n- To reduce crime and improve policing in Redbridge.\nFresh Start for Ilford South\nTired of endless political promises without results? It’s time for real change.\nI’m Noor Jahan Begum, and I am committed to working with residents to make Ilford South cleaner, greener, fairer, safer, and more prosperous.\nAs a local resident, mother of four, Commissioner of Health and Social Care, Magistrate, and community activist, I understand the issues that matter to you.\nI am passionate about Gaza, anti-poverty initiatives, social justice, and improving public services. As your independent voice, I will listen to you and represent all residents.\nTogether, we can tackle inequality, the cost of living, the housing crisis, and rising crime. A vote for me is a vote for positive change.\nJoin me in building a brighter future for Ilford South.\nTogether, we can get things done!\nWhy I’m Running\nManifesto and Vision for Ilford South\nPlease refer to my manifesto and vision for Ilford South for more details.\nTalk to Noor\nCome chat with Noor, the Independent MP candidate for Ilford South, and get to know her better here.\nvolunteer\nGet involved\nJoin our team and contribute to meaningful change in Redbridge.\nWe’re looking for enthusiastic volunteers to support a range of critical functions.\nEven if you can share on social media and encourage your contacts, you have a role to play.\nGet involved today via the contact us form below."
}