{
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_ruth-boulton/content_1.html": "Ruth Boulton\nEllesmere Port & Bromborough\nI have lived in the Ellesmere Port area for 37 years and during that time have taught in many of the local schools. As a teacher, I see education as a key pillar of our democracy, and therefore want to ensure that the true facts of abortion are known by everyone. It’s an horrendous act that kills the baby and harms many women.\nI have been married to a very supportive husband for 44 years, we have 2 wonderful children and 5 lively grandchildren. I’m a committed Christian and believe that life is a precious gift given to us by our Loving Heavenly Father and we have no right to take that life from anyone.\nWomen and children deserve better.\nYou can help Ruth stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_live-image-source/content_19.html": "Live image source\nVote Life explains where these pictures come from and how these images were taken\n6/29/20244 min read\nLive Image Source\nThe Education Resource Fund’s (ERF) embryo and fetus pictures are derived from many smaller images “stitched” together in much the same manner NASA uses to combine satellite photo “tiles” to form a large “mosaic.”\nEndoscopes\nERF's human embryo and fetus imagery was initially derived by teams of physician researchers and clinicians employing endoscopy (and its subsets, embryoscopy and fetoscopy) to diagnose and treat prenatal disorders in utero. Endoscopes are medical imaging devices which permit the minimally invasive, high resolution observation of tissues inside the human body. At the distal end of these instruments is an objective lens designed for imaging. At the proximal end is an eyepiece, or sensor, which enables viewing.\nHow Endoscopes Work\nThese scopes generally consist of a tube which encloses a relay lens system (in rigid endoscopes) or a fiber bundle (for fiber-optic, or flexible, endoscopes) for illumination and to transmit an image from the objective lens inside the body to the proximal end outside.\nSaid differently, endoscopes use optical elements to direct light to the area sought to be illuminated and transmit the resulting image to the eye or detector. Rigid endoscopes generally offer superior resolution or magnification. But an endoscope’s objective lens is only approximately 1/5 of an inch in diameter, and this relatively small size substantially narrows the observer’s field of view (even with the addition of supplemental lenses such as “negative” or “prism” optics, etc.)\nConstraints of Endoscopes\nThis limitation is further compounded by the need to use the scope in very confined spaces, with only short distances separating the objective lens from the anatomical structures being imaged. As a consequence, only a small segment of the embryo or fetus is observable at any point along the timeline of the scan. An endoscope’s construction must also accommodate frequently conflicting design considerations. The resulting compromises can involve not only fields of view, but depths of field (meaning thickness of the plane of focus) and image illumination and magnification, as well as distortion issues (i.e., stretched or compressed perspective), etc.\nWork-Arounds to the Constraints of Endoscopes\nSo to depict a high quality, single image of the entire embryo or fetus, large numbers of smaller, more detailed pictures must be joined together in a manner suggestive of the process by which puzzle pieces are assembled to form a completed picture.\nThis technique employs a complex proprietary process which combines segmental scans to create a final composite image. The resulting picture is digitally adjusted to preserve each segment’s original colour, resolution, contrast, illumination, etc. Technicians also correct for vignetting (image degradation or loss at the periphery of the frame).\nMagnetic Resonance Imaging and Ultrasound\nOur process resembles the image enhancement process described in the British medical journal Lancet which recently published a prenatal magnetic resonance imaging (MRI) study involving the creation of 3D pictures to diagnose and treat congenital heart problems afflicting fetuses still in the uterus. The BBC reports that “A series of 2D pictures of the heart are taken from different angles using an MRI machine” to image the fetus.\nThe story explains that “Sophisticated computer software pieces the images together, adjusts for the beating of the heart and builds … [a] 3D image of the heart.” A paediatric cardiologist describes the resulting 3D images as “beautiful.”\nThis MRI research is part of a fetal diagnostic project which is also exploring scans using “four ultrasound probes at the same time – current scans use one – to get a more detailed picture.” This process produces a more wholistic composite image.\nNASA Composite Imagery (\"Mosaic\")\nERF’s imaging process is also conceptually similar to the technologies used by the National Atmospheric and Space Administration (NASA) to produce wide-area satellite images of the earth’s surface. Until the launch of the Deep Space Climate Observatory Satellite (DSCOVR), which now orbits one million miles from the surface, NASA had no camera positioned sufficiently far from earth to capture the entire globe in a single photograph. As previously noted, an endoscope’s objective lens must also operate too near to an embryo or fetus to permit its whole anatomy to be imaged in a single frame. This is the same constraint which complicates the capture of satellite imagery. Previous pictures of the earth could, therefore, only be created using digital stitching technology to make one large composite image from smaller segments. Scientists sometimes describe this final image (or “data set”) as a “mosaic,” comprised of many individual “tiles.”\nHybrid Imagery (Multi-Media)\nA satellite picture can also be augmented by aerial photography (cameras on aircraft platforms) to improve image resolution. Hybrid images of this sort can be created by superimposing black-and-white imagery (for still higher resolution) over colour pictures of the same area, the latter to optimise chromic (colour) fidelity.\nThe scientific press, for instance, reports that the Landsat Image Mosaic of Antarctica (LIMA) “combined over one thousand precise, calibrated satellite images with other data from the continent’s surface to create a single picture of the entire continent.” The high magnification factor (think telephoto lenses which enlarge image features) of each of these puzzle pieces yielded a composite picture depicting more detail than would have been visible in a single photo shot with a wide-angle lens.\nApplications for \"Mosaicking\"\nNASA uses this mosaicking process to image celestial bodies of nearly every description. The Juno spacecraft made composite images of Jupiter; InSight of Mars; Cassini of Saturn; and Hubble of the Sombrero Galaxy.\nSo an exquisite depiction of a challenging subject, whether prohibitively small or large, near or far, may involve vastly more complexity than meets the eye of the casual observer.\nThis information is copied with permission from cbruk.org\nDevelopmental facts references\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_ruth-rawlins/content_18.html": "Disclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_the-leaflet/content_15.html": "Disclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_sharon-mclafferty/content_5.html": "Sharon McLafferty\nWashington & Gateshead South\nI came from Glasgow originally and was brought up Catholic. After we left in 1989 we moved to Chester in England I became a born again Christian at 23 years old in 1991. However, in 1987 at 18 years old I became pregnant and was abandoned by my partner and was devastated. My gut instincts were originally for life but out of huge fear and not feeling ready I sadly chose abortion. I was 10.5 weeks. I was strongly warned against it by my very loving family and good friends. I wish I had listened. Years later in 1996 when I received the love of the Father God in an instant I received His love for me, His love for life of the unborn and then the bitter tears of regret came.\nI am now fiercely passionate about the unborn and want them saved. I do not want women to suffer the trauma, pain and grief that I have. Abortion is a trauma. For me running in Washington and Gateshead South as an Independent Candidate for Vote Life is because now this is a heart mission and I very much want not only many babies saved but women from the horror and trauma of abortion that they are not told about. Abortion regret is also real and so is the grief.\nI am doing this out of love for the unborn and for women. This is not easy for me to share and has taken much courage to do so but if my story can help save even one life then it will be worth sharing. Now is the time to speak up for the unborn and give the baby a voice in this General Election in July 2024\nYou can help Sharon stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_joshua-morland/content_7.html": "Joshua Morland\nCoventry South\nMy name is Joshua Morland. I'm a maths student at Warwick university and am now standing as an independent, pro life, single issue candidate in the election. I have been blessed to grow up in a church alongside many adopted and fostered friends. I am so thankful to God that their lives have not been lost and that they are now able to be loved and cared for by our church. But I also mourn for the 10 million children that have been killed in the womb since the act of 1967. Furthermore, each one of these babies has a mother and father, and so many of these lives are ruined by the lasting effects of abortion. Meeting many such women over the last 12 months has only increased my passion to campaign for the end of abortion in the UK. I am running because I believe that both lives matter, and I know these things break my heavenly Father's heart even more than they break mine. If your heart breaks over this too, you can vote life by voting Morland.\nYou can help Joshua stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_candidates/content_12.html": "Our Candidates\n22 Constituencies\nFounder\nChristian Hacking\nFundraiser\nCarolina Murineanu\nRoles\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_mark-smallwood/content_2.html": "Mark Smallwood\nWycombe\nYou can help Mark stand for life by donating here:\nI was raised in leafy Leamington Spa and went to school in Warwick, followed by University in Bristol where I studied Philosophy and Politics. During this time my personality and convictions were shaped in two major ways: firstly, I experienced a conversion to the Christian faith and secondly a calling to speak up for the unborn child. I am a religious studies teacher and live with my wife in the wonderful town of Wycombe which is the perfect mix between town and country. In my spare time I enjoy walking, reading and swimming (never at the same time) and helping to lead the kids work at my local church.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_pauline-peachey/content_13.html": "Pauline Peachey\nKingston upon Hull\nMy name is Pauline Peachey. I was born in 1946, mother of 3 and grandmother to 8. I’m standing as an independent, pro life, single issue candidate in the election. I have known the devastation that the experience of the death of a baby from abortion brings. I have seen firsthand the dehumanising of a baby who became a ‘foetus’ when the doctor realised it would be disabled or might for any other reason be a ‘problem’. I have struggled with the aftermath of abortion for decades, talked with hundreds of women whose bereavement has not been acknowledged. “It’s only a clump of cells”.\nThere is recovery in Christ for us all. Our little baby is beyond help now, but for us, the mothers and fathers who live with the pain there is hope. Visit www.postabortsupport.org.uk for more information.\nIf you believe babies are valuable and mothers deserve better than abortion. If you recognise that fathers are important in a healthy society. If you are against the killing of babies with Downs Syndrome, babies with disabilities killed up to birth. If you recognise this evil that is killing babies up to birth for any reason - by poisoning, by inducing heart attack, by crushing and dismembering - if these things are worth voting against, vote Peachey on 4th July.\nYou can help Pauline stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_elizabeth-davey/content_16.html": "Elizabeth Davey\nNorwich South\nElizabeth grew up in Norwich, and though she moved to London for university, she and her husband moved back 4 years ago. She enjoys reading and running and is a committed Christian.\nYou can help Elizabeth stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_christian-hacking/content_6.html": "Christian Hacking\nEltham & Chislehurst\nChristian pro-life activist and writer. He is married and lives in South East London. In 2014 he broke back in a rock climbing accident. This is the first election he has sat in\nYou can help Christian stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_get-support/content_17.html": "Harmed by Abortion\nVote Life acknowledges that for many women abortion wasn't a choice. Many women are coerced or forced into abortion. Others are given no option by systems and institutions meant to help them. Another final group, did make the choice by themselves, but felt they were totally uninformed about what consequence it would have on their lives.\nVote Life is committed to helping post abortive women find their voice and achieve justice using the following pathway.\nIf you want to take your first steps towards healing and justice please fill out your details below:\nHave you or someone you know been affected by abortion? PASE is here to help.\nFrom 1967 to 2019 over 9,000,000 abortions have been performed. One in three women will have an abortion by the age of 45 (according to bpas website). This means that nearly everyone in Britain knows someone affected by abortion.\nPost Abortion Support for Everyone (PASE) was set up by Pauline Peachey. Pauline has personally gone through the experience of abortion and she understands the effects it can have. PASE provides information to those seeking help after an abortion, and support to churches wanting to care for those who have been affected by it.\nFor help or more information please visit the PASE website.\nAdditional Resources here\nWhat is 'HOPE'?\n'HOPE' is a gospel-centred model of pregnancy support. It brings grace and truth to those in a difficult pregnancy situation, a lighthouse to share hope in Christ, offering support and advice.\nWe understand you might wish 'the problem' wasn't there... but every abortion ends a human life. We are here to listen and offer help, Click here for more information and to visit the HOPE Pregnancy website\nWhat is the Vision?\nEvery woman and man in a difficult pregnancy situation receiving an opportunity to respond to the hope of the gospel, accurate information about abortion and life-affirming help with their baby.\nOffering pregnancy help online through our website and in-person at our HOPE Pregnancy Centre. Helping local churches interested in our grace and truth model, as the Church in the UK is awakened to be a voice for the unborn child in crisis and to offer compassionate, life-affirming support to women.\nNeed pregnancy help now?\nOption Line is an international service available 24/7. Real help for real lives wherever you live.\nNeed practical support?\nFor your nearest Baby Basics UK please click here. Showing the love of God by supplying essentials & equipment for new mums & families who are unable to provide these items for themselves.\nWe care about you as a whole person and believe the God who created you cares even more. Please watch this short true story of a woman who was about to have an “abortion”.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_about/content_8.html": "About\nVote Life is a network of 22 independent candidates who stood in the 2024 July election. They gained 5276 votes in total and spoke in defence of life at multiple hustings across the country. The network was responsible for coordinating the delivery of over 1.1 million leaflets containing scientifically accurate images of what a baby looks like in the womb and encouraging those harmed by abortion to share their story.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_julia-tilford/content_3.html": "Julia Tilford\nLewisham North\nJulia Tilford grew up in the Midlands, has lived in Cambridge and Portugal, and is now in SE London. She works for Gospel at Work: a lunchtime outreach to office workers, sharing the good news of Jesus in the City. She's married to Jonny and enjoys music, brownies & countryside walks in the mountains.\nYou can help Julia stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_kathryn-attwood/content_14.html": "Kathryn Attwood\nWorthing West\nI’ve lived in our beautiful constituency almost all my life. My husband of 12 years and I are raising our four children here where we’re part of a local church with a heart for this community.\nWhen I saw an image of abortion as a teenager, I was horrified that as a nation, we’d been fed a lie that abortion was anything other than killing a baby in the womb. I’ve been working to educate the public about this grave injustice ever since and am especially keen to see those who’ve been bereaved by abortion given the opportunity to share the truth and be comforted.\nYou can help Kathryn stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_elizabeth-richards/content_4.html": "Elizabeth Richards\nCoventry North West\nRecent graduate who got involved in pro-life activism while studying at uni in Coventry. As a Christian she loves being involved in the life of her local church. This is her first time standing in a general election and first time voting in a general election!\nYou can help Elizabeth stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_joy-wilson/content_11.html": "Joy Wilson\nSouth Dorset\nI am married with three grown up children living in rural Dorset looking after her mother and growing vegetables . I have worked in the voluntary sector with older people in London.\nI’m also passionate about taking the gospel and worship onto the streets as only the gospel will save this nation and restore morality. We are out on the local streets at least twice a month.\nI have heard the horror stories of women after abortion and felt their despair. For their sakes, as well as precious little children, the law must change.\nYou can help Joy stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_manifesto/content_9.html": "Manifesto\nRead our manifesto today!\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_ruth-boulton/https_votelife_co_uk_robert-spain/content_10.html": "Robert Spain\nExeter\nRobert had the Union Jack flag flying in his bedroom growing up in South Africa and his dream was always to come and live here in the United Kingdom.\nHis parents divorced when he was 11 years old and this caused him great trauma into his adult years. He knowingly practised evil habits and became addicted to sex, drugs, and self-centred living.\nRobert moved to London when 25 years old, finding the Spirit of Truth he had been searching for when participating in the Alpha Course at Holy Trinity Brompton church in London, he experienced God's genuine Love through a powerful life-changing encounter with Jesus Christ and the Holy Spirit of God and he received a clear vision of the Kingdom of Heaven through the Father's eyes when surrendering his life to Jesus.\nRobert’s recovery from the selfish, empty, and dead way of behaving was slow initially but recently his devotion to the Word of God and the Spirit of Truth in Jesus Christ has increased significantly.\nHe and his wife Jane have lived in Exeter for 14 years and are committed to reaching out, on the high street to everyone by preaching repentance for the forgiveness of sins through the crucifixion and resurrection of Jesus Christ from the dead into Eternal Life.\nThe reason I am standing in these general elections is to advocate for the right to life for every precious human being inside the womb. God created each of us inside our mother's wombs and he knows each of us from the inside out, read Psalm 139 in the Holy Bible.\nVote for me to send a clear message to the ruling parties of our land that enough is enough! Every human being deserves the chance to be born and live rightly before God our Everlasting Father!\nYou can help Mark stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved."
}