{
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com_farooqs-vision/content_8.html": "A Call for Community Engagement and Social Justice: Building a Brighter Future Together\nMy passion and dedication to my campaign stems from a deep belief in the power of community engagement, transparency, and social justice. I am fueled by the voices of everyday people who are at the heart of this grassroots movement for real change.\nI stand firmly against the cuts and privatisation of public services because I believe that healthcare, education, and social care should be accessible to all. I will fight for a fully public NHS and improved youth services because I believe every individual deserves quality care and opportunities to thrive.\nThe urgency of the climate crisis drives me to push for sustainable practices and policies to protect our planet for future generations. I am committed to investing in green energy and ensuring environmental justice for all communities.\nThe housing crisis is a pressing issue. I will work to increase the supply of affordable housing and implement strategies to prevent homelessness, because everyone deserves a safe and secure place to call home.\nI am dedicated to building a just and inclusive society where economic equality and inclusivity are prioritised. I will advocate for fair wages, workers’ rights, and social security to ensure that everyone has the opportunity to succeed regardless of their background.\nBut most importantly, I am committed to engaging with the community and being a responsive and accountable representative. I will actively listen to and address the concerns of all constituents, and I will ensure decisions are made transparently with community input.\nJoin me in creating a brighter, more equitable future for all. Together, we can make a difference and build a society where everyone has the opportunity to thrive.\nFarooq Siddique\nIndependent MP Candidate For Bristol East\nDonate to My Campaign\nThank you for supporting my campaign to be the independent voice for Bristol East.\nYour support is not just a donation; it’s a statement that you believe in a campaign driven by the power of ordinary people, not deep pockets.\nEvery contribution, however big or small, makes a huge difference as we try to reach as many voters as possible.",
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com_about-us-2/content_2.html": "About Farooq\nWe are excited to introduce Farooq Siddique, our independent candidate for Bristol East, who brings a wealth of experience and a deep commitment to our community.\nFarooq’s campaign is built on the foundation of community engagement, transparency, and a commitment to social justice. This grassroots movement is driven by the belief that real change starts from the ground up, with the voices of everyday people at its heart.\nWith roots in Bristol’s vibrant community work stretching back to the early 1990’s, when he led humanitarian aid convoys to Bosnia Herzegovina, Kosovo and Afghanistan, Farooq has been a driving force behind many significant community initiatives.\nHe is the co-founder of Bristol Muslim Cultural Society and the co-creator of the ground-breaking Radio station Salam Shalom, a platform promoting dialogue and understanding across cultures.\nFarooq’s dedication extends to the national stage, where he has served as a government advisor, bringing a thoughtful, community-focused perspective to policy-making.\nMost recently, he has been a passionate advocate for the Palestinian cause, leading and speaking at marches and rallies in Bristol to stand in solidarity with those fighting for justice and human rights.\nFarooq’s candidacy represents a new, dynamic choice for Bristol East—one rooted in years of steadfast community service and a progressive vision for the future.\nLet’s come together to bring real change to our constituency. Vote Farooq, for a better Bristol East.\nDonate to My Campaign\nThank you for supporting my campaign to be the independent voice for Bristol East.\nYour support is not just a donation; it’s a statement that you believe in a campaign driven by the power of ordinary people, not deep pockets.\nEvery contribution, however big or small, makes a huge difference as we try to reach as many voters as possible.",
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com_contact/content_6.html": "Send us a message! Send us a message be it for a chat or local concern. +(44) 7973-135965 info@farooqsiddique.com Promoted by Mubashar Chaudhryon behalf of Farooq Siddique58 St Mark’s RoadEastonBristolBS5 0LR Follow on Social Twitter Facebook Instagram Name* Email* Message You agree to receive email communication from us by submitting this form. Submit Subscribe to our newsletter Subscribe to receive latest up to date local news. Subscribe",
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com_vote-2024/content_4.html": "Who can register\nRegister by 11:59pm on 18 June 2024 to vote in the General Election on 4 July 2024.\nVoter ID: You must now show photographic identification (photo ID) at the polling station, before being given ballot papers for the elections.\nIf you live in England and Northern Ireland\nYou must be aged 16 or over.\nYou can register to vote if you’re a British citizen or an Irish citizen.\nYou can also register if you have permission to enter or stay in the UK, Channel Islands or Isle of Man – or you do not need permission – and you’re a:\n- Commonwealth citizen\n- citizen of Denmark, Luxembourg, Poland, Portugal or Spain\n- citizen of another EU country, if you have had permission to enter or stay – or not needed permission – since 31 December 2020, and this has continued without a break\nRegister online\nIt usually takes about 5 minutes.\nPostal Vote or Proxy Vote\nYou must apply for a postal vote if you want to vote by post,\nfor example if:\n- you’re away from home\n- you’re abroad and want to vote in England, Scotland or Wales\n- You do not need to give a reason unless you’re voting in Northern Ireland.\nDeadline for registering to vote in the General Election\nIf you want to apply online for a postal vote, you must apply by 5pm on 19 June 2024.\nApply for a proxy vote\nYou can get someone else to vote on your behalf (a proxy) if you cannot go to the polling station in person.\nYou’ll need to apply by 5pm on 26 June 2024 to vote by proxy in the General Election on 4 July 2024.\nDonate to My Campaign\nThank you for supporting my campaign to be the independent voice for Bristol East.\nYour support is not just a donation; it’s a statement that you believe in a campaign driven by the power of ordinary people, not deep pockets.\nEvery contribution, however big or small, makes a huge difference as we try to reach as many voters as possible.",
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com/content_1.html": "VOTE\nFAROOQ\nSIDDIQUE\nINDEPENDENT MP CANDIDATE\nFOR BRISTOL EAST\n“Our silent politicians watching hospitals bombed and destroyed in Gaza are the same who watch our own NHS collapse before our eyes. The ones quietly watching swathes of centuries-old olive groves ripped out of the ground in Gaza are the same ones watching raw sewage being pumped into our rivers and seas. The ones watching the destruction of homes in Gaza are also watching an unprecedented rise in homelessness and the lack of affordable homes here. The ones watching man-made starvation and famine grip Gaza also make sacrificial offerings at the altar of the highest number of billionaires the world has ever seen”\nDonate to My Campaign\nThank you for supporting my campaign to be the independent voice for Bristol East.\nYour support is not just a donation; it’s a statement that you believe in a campaign driven by the power of ordinary people, not deep pockets.\nEvery contribution, however big or small, makes a huge difference as we try to reach as many voters as possible.",
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com_peoples-assembly-2/content_3.html": "What is a People’s Assembly?\nAssemble is a national movement to upgrade democracy using assemblies.\nOur representatives in Parliament should be committed to hearing from the community, so Farooq Siddique, your independent candidate is running to do just that.\nAssemblies are big meet-ups, where people come together to confront the challenges they face, locally and nationally. Too many people are locked out of politics, but we can replace the House of Lords with a new chamber of ordinary citizens — a House of the People — which can bring about the true will of the people.\nFind out more at: https://timetoassemble.org/\nTHE NEXT PEOPLE’S ASSEMBLY IN BRISTOL:\nCome to our next people’s assembly to meet Farooq and help formulate campaign policy:\nWednesday 19th June 6-8.30pm,\nEaston Community Centre, Kilburn St, Easton, Bristol, BS5 6AW",
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com_farooqs-statement/content_7.html": "OUR POLITICAL SYSTEM IS BROKEN\n“The simple step of the courageous individual is to not take part in the lie.”\nI couldn’t agree more with Alexander Solzhenitsyn’s powerful words about courage in the face of lies. I can no longer ignore the feeling in my gut that something is fundamentally wrong with our political system. The insidious influence of corporate greed and profit has seeped into every aspect of our society, and it’s time that we take a stand.\nOur silent politicians watching hospitals bombed and destroyed in Gaza are the same ones who watch our own NHS collapse before our eyes. The ones quietly watching swathes of centuries-old olive groves ripped out of the ground in Gaza are the same ones watching raw sewage being pumped into our rivers and seas here.\nThe ones watching the destruction of homes in Gaza are also watching an unprecedented rise in homelessness and the lack of affordable homes here. The politicians watching man-made famine and starvation grip Gaza are the same ones silently watching the devastating rise in the cost of living criss from which so many people are suffering here. All the while, the same politicians busy themselves making sacrificial offerings at the altar of the highest number of billionaires the world has ever seen.\nAnd so, at the risk of great personal cost, I have made the bold decision to step into the political arena, and I am not alone. Together with a coalition of like-minded, independent candidates around the country and from across the political spectrum, we are determined to reset the broken system and bring power back to the people. We want to take power out of the hands of lobbyists. Out of the hands of foreign governments. Out of the hands of corporations.\nOn July 4th, I urge you to stand with me and vote for change. Let your voice be heard and make your vote count. Join me in making July 4th Independents’ Day by electing me, Farooq Siddique, as your Independent MP for Bristol East.\nTogether, we can make a difference.\nWith hope and determination.\nFarooq Siddique\nIndependent MP Candidate Bristol East",
  "https_www_farooqsiddique_com_/https_www_farooqsiddique_com_the-peoples-priorities/content_5.html": "A Vision for a Brighter Future – a manifesto created by the people!\nFarooq’s campaign is built on the foundation of community engagement, transparency, and a commitment to social justice. This grassroots movement is driven by the belief that real change starts from the ground up, with the voices of everyday people at its heart.\nOn Tuesday 18th of June 2024, Farooq hosted a people’s assembly at Easton community centre, in the Bristol East constituency. He asked the people what was important for them and what they wanted Farooq to focus on. This is how we intend to transform our political system. Normally politicians come to you with a manifesto asking for your vote. Farooq’s campaign is the exact opposite. He is asking you the people what is important to you and what you want him to prioritise. This is the first of many people’s assembly that Farooq will be hosting regardless of the outcome of the election.\nThe priorities identified by the people at the first assembly were as follows:\nA Future Rooted in Community, Equity, and Sustainability\nFarooq’s campaign is built from the ground up, driven by the power and voices of our community. At its heart, our campaign is a response to the pressing issues we face today: the erosion of public services, the climate emergency, and the struggle for affordable housing. Farooq believes in a future where every individual has access to the services and support they need to thrive, and he was asked to stand firm against the forces of austerity and privatisation that undermine our collective well-being.\nOpposing Cuts and Privatisation of Public Services\nFarooq is committed to protecting and enhancing our public services. The relentless cuts and creeping privatisation of essential services have left too many without the care and support they need. Farooq pledged to the meeting to advocate for:\n- Halting and reversing the privatisation of public services, ensuring they remain fully public and accountable.\n- Increase funding for critical services, including healthcare, education, and social care, ensuring they are adequately resourced to meet the needs of all.\nAction on the Climate Emergency\nThe climate crisis is the defining challenge of our time. Farooq recognises the urgent need for bold action to protect our planet and secure a sustainable future. He was tasked to support plans that include:\n- Implementing ambitious climate policies that reduce carbon emissions and promote renewable energy.\n- Investing in green infrastructure and public transport to create jobs and reduce environmental impact.\n- Supporting community-led environmental initiatives and ensuring that climate justice is central to his approach.\nSupporting Improved Youth Services\nOur youth are the future, and it is imperative that they have the support and opportunities they need to succeed. Farooq will:\n- Expand funding for youth services, providing safe spaces and resources for young people to learn, grow, and thrive.\n- Promote programs that offer education, training, and employment opportunities for young people.\n- Ensure mental health services for youth are accessible and adequately funded.\nA Fully Public NHS\nHealthcare is a right, not a privilege. Farooq was asked to be dedicated to restoring and strengthening the National Health Service (NHS) to its founding principles:\n- Oppose any form of NHS privatisation and bring outsourced services back into public ownership.\n- Increase investment in the NHS to reduce waiting times, improve patient care, and support healthcare workers.\n- Ensure that healthcare services are comprehensive, from mental health to primary care, and accessible to all.\nAffordable, Secure Homes for All\nThe People’s assembly stated that the housing crisis is a blight on our society, with too many people unable to afford a decent home. Farooq’s campaign will support:\n- Building affordable, secure homes to meet the growing demand and reduce homelessness.\n- Implementing rent controls and tenant protections to ensure housing stability.\n- Supporting sustainable development that prioritises community needs and environmental considerations.\nTogether, For a Better Future\nFarooq’s campaign is more than a political movement; it is a call to action for every member of our community to come together and work for a fairer, greener, and more equitable society. By championing these causes, Farooq is not just seeking election; he is striving to create a future where everyone has the opportunity to live with dignity, security, and hope. Join us in this grassroots campaign to make our vision a reality"
}