{
  "https_bemore_press_/https_bemore_press_my-books/content_2.html": "Add your promotional text...\nHOMEPAGE\nParliamentary Election Campaign 2024\nDaniels Kitchen\nPriory\nMy Books\nButton\nHOMEPAGE\nParliamentary Election Campaign 2024\nDaniels Kitchen\nPriory\nMy Books\nButton\nMy books\nOUT NOW\nDUE OUT SPRING 2026",
  "https_bemore_press_/https_bemore_press/content_1.html": "Add your promotional text...\nHOMEPAGE\nParliamentary Election Campaign 2024\nDaniels Kitchen\nPriory\nMy Books\nButton\nHOMEPAGE\nParliamentary Election Campaign 2024\nDaniels Kitchen\nPriory\nMy Books\nButton\nThanks for visiting my corner of the internet, a space where I get to share my passions and connect with new and exciting projects.\nPaul Hugill MBE",
  "https_bemore_press_/https_bemore_press_priory/content_3.html": "Nestled in the heart of the beautiful Lincolnshire Wolds The Priory is proof of what people who face their challenges, limitations and disabilities together can achieve. 2023 Hotel Of The Year and Wedding Venue Of The Year Finalists. We are pushing hard to secure a permanent home to run our community projects BUT In the meantime we continue to offer free fresh food boxes and home delivered hot meals from the Priory if you or someone you know is struggling please complete the simple form by clicking on Daniel's lovely face above.",
  "https_bemore_press_/https_bemore_press_daniels-kitchen/content_4.html": "There is no doubt that we live in challenging times with a sad increase in the number of people needing help to survive.\nWe aren’t just here to help in emergencies. Thanks to the kindness of business and people who share our belief in hope, community and kindness we are able to focus on preventative work and reducing long term need.\nWe work with groups, schools and prisons to build a more stable and hopeful future.\nOur goal is to strengthen community by giving support to individuals in need due to mental health, SEND, financial or social challenges.",
  "https_bemore_press_/https_bemore_press_parliamentary-election-campaign-2024/content_5.html": "Born and raised in Yorkshire but lived in Zambia and South Africa growing up. Exposed to the exploitation of rural communities by big business in Zambia, the inequality of apartheid in South Africa and , and the pothole politics of the two-party system in the UK. Engaged to comedian and community organiser Stephanie Laing. \"I am a Dad to two incredible grown up sons, between them and Steph I find inspiration to live a balanced life that is impactful and enjoyable.\"\nFrom Louth, with over thirty years experience in business and a decade in community projects. \"I am a passionate, people person but like to get things done and I'm a quick learner that can adapt and thrive in a crisis. And believe this will help me an effective MP. I believe that a strong economy, connected communities and a thriving countryside should be the goals of our parliament.\"\n\"I am standing to be elected as your independent MP because people have become disillusioned by empty promises and out of touch MPs. Our part of the country adds so much value through agriculture, industry and manufacturing and yet this doesn't translate into improving the quality of people's daily lives.\"\nProduced and promoted by Paul Hugill of 149 Eastgate, Louth, Lincs, LN11 9AJ on his own behalf as an independent candidate in the 2024 UK General Election\nProduced and promoted by Paul Hugill of 149 Eastgate, Louth, Lincs, LN11 9AJ on his own behalf as an independent candidate in the 2024 UK General Election\nMy Approach\nGetting STARTED\nIn addition to constituency surgeries and working in Westminster I will begin my term in office with a getting to know you/listening campaign. It would be disingenuous and arrogant of me to pretend to know what you are concerned about without consultation. For this reason I will visit all 77 towns and villages within our constituency within the first 6 months in office. I will run these listening events to find out what is putting pressure on you and the people you love, and what you would change in your community if you had the power. The results of this listening campaign will inform how I vote, motions I introduce and what I campaign for locally. For those who can’t come along I will have an online and text form for all constituents to raise concerns or questions. This will be monitored by my parliamentary staff. I will also encourage and support our civil society institutions to run internal listening campaigns of their own and send me their results.\nDemocracy\nA thriving nation is built by thriving communities. Thriving communities are built on compassion and connection.\nAm I Left or Right?\nNeither. I believe that we have more in common than what separates us, and that the conflict between left and right wing is a distraction from the real work of making our world better. We all want to be treated respectfully, to be paid fairly for our work, to have safe housing, and for the people we love to have the opportunity to thrive. These are not right or left wing issues, but human issues.\nEnvironment\nWe are the custodians of this amazing and potentially abundant planet and I believe we all have a role and a responsibility to play in its prosperity through the day to day choices we make. That being said it is disheartening to feel like we are doing what we can in our personal lives by trying to live sustainably, but then see big businesses prioritising profit over the future of our planet. We are just one part of a complex, symbiotic ecosystem. I believe that a fundamental shift in our conversation needs to take place.\nA thriving mindset will naturally gravitate towards win wins like reforestation in order to remove carbon from the atmosphere. We must not underestimate the resilience of nature. But we do need to aid it to offset anthropogenic changes to our environment. The forests and wetlands we restore to create wildlife corridors are a critical link between fragmented habitats that allow species to move freely again. Similarly I believe we need to instil an ambitious and creative mindset in our children as they are the ones that will inherit the keys to this kingdom.\nThe media’s focus on carbon neutral and fossil fuels evokes divisiveness. We need to shift from just talking about surviving to how do we contribute to a thriving eco system. It’s like focussing on weight loss versus focussing on your wellbeing. Both are connected but one focuses on what we have to give up and the other on making better, wiser , informed choices and putting in some effort for long term and sustainable benefit.\nNet Zero should be a given, not a political football. The current target of 2050 should be at the latest rather than a “hey guys aren't we doing well”, no we are not, 2050 is 26 years away. We need to do better and carbon neutral needs to be in the mix. Younger generations are more switched on but education and a culture of care are massively important.\nIn practical terms renewables, energy efficiency , biodiversity, landfill reduction, composting, recycling, upcycling, demonising avoidable single use plastic, championing and incentivising sustainable agriculture, water conservation, water management and supporting smart transport should and can become a natural and beneficial part of our mindset.\nHowever as we have seen locally, privatised public services such as Anglian Water seem to prioritise shareholder value over common sense and respecting our waterways and farmlands. In my view harsher financial penalties need to be enforced in the short term. However public services which form a natural and essential part of our infrastructure and ability to function and thrive as a society need to be returned to public ownership. Some for the long term and others temporarily.\nEfficient Water, Power and Transport are essential and should not be a source of shareholder gain. The only win should be for the end user and the planet. Economic value stems naturally from a thriving population, thriving businesses and a thriving biosphere. We need to return to the embedded liberal ideology of consistently low inflation and that means reconnecting people, public services and a culture where conservation efforts lead naturally to sustainable community practices.\nOkay Paul that's all very nice but where do you stand ?\nOkay, fair play. In very broad terms I am strongly opposed to - the nuclear waste storage, solar farms that use prime farmland, the Walpole to Grimsby pylon scheme, Anglian Waters reservoir, and the carbon capture proposal. I am happy to discuss these in detail with anyonepaul@bemore.team. If elected I will work with both district and county council to ensure that their decision making is transparent, justified and always focussed . Bottom line for me is that the onus should not be on residents to protest in order to prevent projects making a beeline towards the desk of the secretary of state. The approach should be one where residents should have first say. And any proposals should seek to work in partnership with them rather than the current approach of flimsy consultation.\nI am pro renationalisation of water transport and power. Any surplus income should automatically be reinvested in infrastructure and future guarding.\nI am pro waste-to-energy plants\nI am pro wind which is currently our biggest source of energy at around 13%\nI am pro the exploration of sand and salt water batteries and feel that innovation that benefits the planet should have rock star status\nI am pro both underground and offshore alternatives which despite initially higher capital costs have lower lifetime costs\nI applaud individuals an groups who protect, re-engage us and educate. People like James Elliot of Grimsby whose efforts as the Canoe River Cleaner inspire people of all ages to get involved with our waterways. Or the Louth Navigation Trust who recently secured funding to put a slip into the River Lud for young people to canoe and do water sports. We need to celebrate our countryside and its communities and make it accessible to young and old people alike.\nEconomic Development and Employment\nIn 2023 in this constituency the average weekly wage for a man was roughly £100 less than the national average and for a woman almost £150 less. This is maddening as our county contributes approximately 9% of the UK’s Gross Value Added, with hefty contributions in agriculture, industry, tourism and manufacturing. Lincolnshire's farmers and rural communities contribute around 12% of England's total agricultural output. To put this into context that’s approximately 20% of England's wheat, 23% of its sugar beet, 27% of its veggies and 40% of its hardy nursery stock. While lots of central funding is in the pipeline and levelling up money is being put to good use, I feel that more can be done to make sure that the quality of life for the average person is improved and represents our contribution to the country’s overall prosperity. I pledge to fight for policies that support opportunities and economic development across all the sectors of our incredible county. Like the NFU I am nervous that too many trade agreements are being considered without serious consideration for concessions that affect our farmers and manufacturers. I am also a strong advocate of shop local for both economic and environmental reasons.\nShop local - relax local\nWhen I arrived in Louth 23 years ago I was struck by the amazing high street in Louth. With several butchers, two fruit and veg shops and amazing specialty merchants like Larders and Dales. And that didn’t even take into account the amazing market days. Now in 2024 the high street is still wonderful and able to draw people in from local towns and please visiting tourists, but like many other towns in our area it is struggling and needs our support. It is important that shopping and relaxing where we live continues as it supports the hard working businesses, restaurants and pubs that in turn create jobs and tax revenue. Most importantly our high streets foster a sense of community. We all need to feel connected and a part of something but unless we shop local this will become harder and harder.\nThe arts\nThe county has a wealth of talented musicians and artists, and I will support their talent and contribution to our lives in any way that I can. A vibrant arts and music scene is reflective of a vibrant and evolving society. Venues like the Riverhead Theatre in Louth need support for bringing a diverse and talented range of performers and events to our region.\nTravellers\nRomany Gypsies, Scottish, Welsh and Irish Travellers are all ethnic minorities, recognised under UK law and the Irish government. Most live on permanent sites with only some travelling in the warmer months as is their custom. Many are respectful but there are often stories in the press of the small percentage of travellers who cause upset and damage. Fortunately the law applies to them as it does to all of us. My approach is live and let live until the law is broken.\nAlthough not immediately a part of the local constituency duties I feel it only fair to tell you my perspective on more national matters so that you can vote confidently.\nEurope\nMany have asked me where I stand on Brexit and Europe. Brexit symbolises the cack-handed way we allow our government to divide us through fear and headline grabbing. Do I believe in self determination? Absolutely, but also I believe that there is much to be gained in having healthy and mutually beneficial relationships with our European neighbours and being a part of a larger European community. A referendum was held and results had to be respected but little of the promised benefits seem as yet to be coming into fruition and if anything Brexit has made life for farmers, business and travellers cumbersome and frustrating. If a new referendum was held today I would vote to rejoin but conditional to more mutually beneficial and respectful terms that protect and further our farming, industrial and manufacturing sectors.\nDefence and foreign policy\nOur Army, Navy and Airforce are a source of pride and security to us and should be better funded and supported. However it is my personal belief that we should not risk the lives of our sons and daughters on a whim of foreign policy or jockeying on the international stage. Their role should be one of prevention, security and peacekeeping while always being battle ready. Like many European countries we once had a significant colonial footprint however I believe our foreign policy should reflect a more current view which avoids asserting ourselves for the sake of the current PM’s ego or desire to maintain the guise of a special relationship with America. Much of the terrorism threat we have experienced in the last two decades is a ripple down from the previous government's foreign policy and muscle stretching.\nImmigration Concerns - \"the boats\"\"\nI understand the fear and frustration people are feeling. People seeking asylum are bottle necked in specific parts of the UK which adds to the frustration, fear and division. And makes us forget we are a nation of immigrants. The \"boats\" has become a polarising football, kicked around by the Government and Right Wing parties. We have been bombarded with the word boats which distracts from the fact that we are talking about people, people fleeing a fate so bad that they would risk their lives to arrive upon our shores.\nIt is our ability to overcome that is the common thread in our history. We must find a solution that is effective and yet also compassionate.\nWe should of course protect our own interests, but equally we should do so with compassion. The culture of fear that the media and government has created fails to say that asylum seekers receive just over £5 a day to survive on. Or the fact that we are not the first port of call with four times as many seeking refuge in Germany or twice as many in France.\nWe also don not consider that asylum seekers represent only 11% of our annual immigration figures.\nThe solutions are complex but achievable .\nTackling the criminal gangs that exploit the fear and desperation of legitimate refugees would be a start. We need a unilateral and cooperative approach to tackling the traffickers.\nHowever prevention must be supported by a shift in the way we deal with the root cause. It is important that we examine how the approach to foreign policy and international affairs of previous governments has contributed to the problem. Have we inadvertently aided the destabilisation of regions and the lives of ordinary people like you and I. Foreign policy and foreign aid should wherever possible, support other countries to rebuild and reshape themselves so that people do not need to flee in the first place.\nLet's support and strengthen legitimate channels for those in genuine fear of their lives and make them more accessible. The term legitimate channel can be as dangerous as the use of the word boats. These channels need to be easy to access for people in danger but robust enough to filter out those who are not legitimate refuges.\nI cannot support the shameful way that the government has opened the door for the right to join them in a concerted effort to create a culture of fear which dehumanises refugees. Let us not forget that we are talking about people who have been forced to flee their homes because of war, violence or persecution, often without warning. They are unable to return home unless and until conditions in their native lands are safe for them again. Put yourself in their shoes, imagine your world, security, family being ripper apart.\nWhat can one independent hope to achieve?\nThere is no doubt that we need to reduce the enormous pressure GPs are under with most GPs across our region serving an average of 2452 patients EACH. Many of us grumble about seeing a nurse when we want to be seeing a GP but aren't aware that in the late 80s the role of Nurse Practitioner was introduced to share the increasing demand for access to a GP. Health services quite frankly are not good at building awareness of what is on offer and this is a good example. I would champion a campaign to recognise and understand the practical and valuable role of Nurse Practitioners who are highly skilled and often under appreciated.\nThey can assess and examine you, interpret lab results and x-rays, make a diagnosis and provide advice and treatment including minor surgical procedures and many can write a prescription if required.. They can make referrals to hospital doctors or other health care professionals, and admit patients into hospital when necessary. They can also provide health teaching and counselling to support the overall wellness of their patients. So what's the difference? Doctors, at their core, are scientists. They study diseases and how to cure them. Nurse practitioners, at their core, are healers.\nSimilarly there are many wonderful people providing beneficial services around the county that many of us aren't aware of. A very practical step I would work on immediately is to ensure a physical and online Directory of Health and Wellbeing is compiled and published. This would not only list the various NHS services and how to access them but include community groups and other beneficial wellbeing services.\nIn order to improve the continuity and quality of care I will campaign for the recognition of Care Advocates. A Care Advocate would be someone with interdisciplinary skills who can champion your unique medical history and wishes for care. To start with they would in effect be complex care managers and work with people with serious conditions and those with highly specific needs. However it is my hope that with time all people across the region would have a Care Advocate who can signpost and champion your wellbeing.\nI would like to work with the Integrated Care Board to make sure that the opening of new surgeries is in line with the rate of house building. My proposal is that a contribution will be made for every new home built to a community fund, managed by local councils under the health and social care act in partnership with the ICB. This money will help ensure that GP and Dentistry provision expands proportionately with the spread of new homes.\nFor me the potential contribution of Louth Hospital needs to be realised as a matter of urgency so it can share the strain the NHS is under and improve care locally. I propose that it becomes a comprehensive Community Wellbeing Hub.\nI will hold feet to the fire to make sure that the commitments made in the NHS long term plan on mental health are followed through, so that people in crisis get support quickly - when they need it most.\nSports and community activities that add preventative value and improve people's physical and mental wellbeing will have my full support and I would like to push for a district wide Community Boost fund. This would give each district councillor the ability to support people and projects in their wards, or joining with other councillors to support bigger projects which boost community and wellbeing. Such a project would cost approximately £550,000, and could be funded from reserves initially while a long term funding source could be agreed.\nI would also call for the Lincs and Notts Ambulance service to be fully funded by Lincolnshire County Council and Nottingham County Council so that all fundraising revenue can be reserved for long term security and expansion of this incredible service.\nFARMING & RURAL COMMUNITIES\nWe need to champion the contribution of our farmers who contribute a whopping 12% of our nation's food. The constant threat of TB, Blue Tongue, the strain created by excessive admin, and the uncertainty of trade agreements all adds to the financial and mental pressure farmers are under. I applaud the incredible work done by the LRSN, NFU and the Yellow Wellie team.\nI strongly oppose the National Grid’s Pylon Scheme and advocate for an underground or offshore alternative, both of which have similar capital costs but favourable lifetime costs. It is a no brainer to fight the nuclear waste dump. In my opinion the small real term environmental benefit of carbon capture makes it borderline greenwashing.\nOur rural communities, while showing a great sense of community, are blighted by inadequate public transport, pothole-riddled roads, flooding and slow internet speeds. I will do whatever I can as an MP to ensure that the quality of their day-to-day lives improves. How would I do this? In simple terms I would work with but when necessary against local, district and county council.\nWhat can one independent hope to achieve?\nIn Westminster I will fully support the NFU’s manifesto, and will be a passionate voice for a more practical and supportive approach to farming .\nI intend to push hard for scrutiny of the Environment Agency's efficacy. I would do this by means of an Early Day Motion, raising this with the Minister of State for Agriculture and Food and constant and specific haranguing of the EA through legitimate channels at my disposal.\nUsing my social media, and media to champion the contribution of our farmers and to highlight the mental, time and financial pressures they shoulder in order to keep the nation fed.\nI would call for an immediate pause to the rushed and narrowly focussed consultation process and would join those who are demanding more thorough investigation of alternative methods of meeting the National Grid's needs. Whilst some of these options would be initially more costly they would have lower lifetime costs and significantly less impact on local residents and the environment. I would also call into question what resources are being dedicated to low cost radical ideas like localised sand batteries and power generation from catalytic filtration waste plants like Copenhill, which at a cost of c£650 million would produce enough electricity to power EVERY house within the constituency.\nIt is insulting that a county that is so big and that contributes so much nationally has roads riddled with potholes. This is a much wider problem when the £22 million the Department of Transport spent on claim handling and payouts for pothole related damage in 2022 could have filled in excess of 300,000 potholes. And it is not going to get better. There are approximately 100,000 miles of asphalt that will need rebuilding at some point in the next 15 years. The current estimate to fix every pothole in the UK and Wales is around £15 billion, with the County Council estimating a budget of £400 million to resolve the county's pothole riddled roads. The County Council has a report a pothole service which is having some levels of success but this needs to be ramped up. My immediate action would be to run a campaign to encourage residents to use this service and to monitor the response so that the County Council can be pushed to meet its obligations.\nThe county lacks a dynamic transport network. Considering the size, widely spread population and tourism potential a more reliable and frequent bus service is a “no brainer”.I believe that the ability to access reliable, regular, well connected and low cost public transport is one of the most important issues we need to tackle head on. There are plans afoot to improve the abysmal current offering and no doubt under a Labour government more franchises will be awarded. However it is my opinion that this all needs to be shaped by the needs of the people of this region. I will call for scrutiny and maximum public involvement in this process.\nYOUNG PEOPLE and SOCIAL CARE\nMy fundamental message is we need to be a society that embraces and enhances a child's unique skill set, personality and ability. I think if we want to build a stronger society it's vital to boost the confidence and self worth of young people. I will shout Frederick Douglas’ words from the rooftops, “It is much easier to build strong children than to repair broken adults”.\nWhat can one independent hope to achieve?\nTo me our investment in young people should begin within the community and our homes and be reflected in our education provision. I believe strongly that education needs to go beyond results and focus on helping each child find their confidence, voice and passions while also protecting their experiences during each phase of growing up. As someone who has spent the last thirty years running businesses and organisations that embrace diversity and inclusion I will do whatever I can to push for a more inclusive education system. One that values personal development alongside academic performance. If we want a dynamic and prosperous Lincolnshire then we need to invest our time, money and understanding into our young people.\nI would like to push to trial a local Junior Town Council to engage young people from 10-15 in local democracy and issues. This would tackle two issues. Firstly we need them to feel seen and heard. But they are also a source of new ideas and not something to be tolerated or moaned about. Children can be like building sites, noisy and messy but they will one day grow to be OUR security and comfort.\nI am a keen supporter of Labour's call to lower the voting age to 16. It is my belief that if we need to engage young people in the democratic process from an early age. To counterbalance the fear that they would be easily manipulated I would also push for a none partisan democracy element to every child's curriculum.\nI will join the fight to ensure that the average spend per child's educational and social welfare must increase in line with national trends BUT must also be boosted to counter the deprivation of previous generations.\nA serious level of investment in specialist practitioners like clinical psychologists, paediatricians, and therapists is desperately needed. We need to eradicate waiting lists for diagnosis and to guarantee responsive, easily accessible mental health and social care support for children and their families . Currently CAMS staff do an amazing job when capacity allows but they are completely overwhelmed. In the short term we need to find funding for this to be delivered by private counsellors. However we also need to tackle the root and cause. I will champion schools, clubs and groups that invest in children's self-esteem, resilience and confidence by supporting local initiatives that help young people find their voice and explore core values in a safe space. Similarly many schools have wonderful dedicated staff supporting special educational needs but I believe that a child's rights to Special Educational provision should have statutory protection and not be subject to funding policy.\nI have personally seen a steady increase in the number of families unable to feed both the children and adults in their households. This is a shameful situation and while the real long-term solution is higher taxation for the wealthy, higher wages and a guaranteed standard of living for those unable to work, right now we need to guarantee free school dinners and breakfast clubs . We need to build a society where the time and energy spent by voluntary groups providing foodbanks can be devoted to preventative and proactive community projects.\nUK Politics needs to shift from division to common purpose!!\n\"I might not have the backing of one of the “gangs” but that means my loyalty is 100% to you. And I am free to fight for any idea from the left, right or centre that improves people's lives in this region.\nJust bear in mind that as an independent MP, I will have the same rights within Westminster to vote on new laws and policies, raise your concerns with ministers, debate issues and ask questions. I would also have exactly the sam staff budget and access to the same exceptional people who do so much of the hard graft behind the scenes.\nI am a vote for a fundamental improvement to the dysfunctional and disconnected role politics plays in our lives. I'm in this race to bring people together and get things done!!\"\nDecades of negative, playground politics and misuse of the press and social media have made us fearful and combative. No single party has the answers. There are good ideas and people in the left, right and central political camps. \"I will draw on any idea that protects our countryside, positively improves our region's economy and nurtures a sense of community and national pride.\"\nSend me to Westminster and let’s show the world that Lincolnshire embraces forward thinking, ambition and compassion and does not vote with fear!\nSome of the issues I intend to hit the ground running with ...\nDISCLAIMER - DO NOT VOTE FOR ME IF YOU WANT ANOTHER PARTY POLITICIAN\nVOTE FOR ME If you are ready for - positive change, someone who listens, cares and gets things done without the restrictions of party policy.\nI refuse to make promises to grab your vote. I can guarantee only that I will fight for the wellbeing and prosperity of this area and it's people. Fair warning– I may occasionally throw in some obscure philosophical perspective or dad joke.\nBEFORE YOU NEED TO MAKE A CHOICE\nParty based politics has become a bad relationship, that we stick with hoping that next time it will be better. Will you vote out of fear and choose one party to keep another one out vote. Or be a positive voter and join those voting for progress and Paul Hugill MBE .\nHEALTHCARE\nThe problems within our NHS may seem unfixable but there are many positives to celebrate and embrace while a much needed unravelling of private sector involvement takes place. Two areas that I would like to tackle are awareness and continuity of care.\nReport a pothole\nTHAT WILL EFFECT YOUR LIFE FOR THE NEXT 5 YEARS\nReady for better?\nCall for more support for Lincs and Nots Air Ambulance\nCall for the renationalisation of water companies\nCampaign for continuity of national policy making\nCampaign for more substance abuse support within the region\nSupport the White Ribbon Campaign\nPush for more rural policing with seasonal increases\nSupport the NFU's election manifesto and call for scrutiny of the EA\nCampaign to enshrine a guaranteed living income for all, that makes it viable to excel at work and in business but that also supports and respects those who can't\nCampaign to revitalise Louth County as a Health, Wellbeing and Community Hub\nEngender a culture of respect for carers, teachers, physical, mental and social care providers.\nEnsure responsible expansion and a better contribution to healthcare from construction\nFight for better quality, continuity and responsiveness of mental, physical and social care\nFight to end the funding disparity for local children and support breakfast and holiday clubs\nInvestigate and campaign for measures to guarantee better support and care for the elderly\nMake democracy more accessible and effective including online access to upcoming legislation to be debated and my surgery staffed and open regularly\nPromote a culture of safety for all and more compassion and support for all victims of abuse regardless of gender\nPromote resilience, ambition, and creativity within our young people and get them more involved in shaping the future of our communities\nPut the \"public\" back into public transport by supporting wider, more frequent transport routes\nSupport a national strategy that prevents the traffickers by international cooperation, strengthening of legitimate schemes and scrutiny of foreign policy\nSupport Cancer research, care and more support for charities such as Cancer Research UK\nSupport innovative and responsible power projects, oppose Pylons, Nuclear Dump, Solar Farms\nSupport the LBQT+ community and campaign for a culture of live and let live\nTackle the confusing, disconnected structure in our services and employ parliamentary staff with both HR and legislative expertise to identify and pressure the person with whom the buck stops"
}