{
  "https_votelife_co_uk_/https_votelife_co_uk_sarah-barber/content_15.html": "Sarah Barber\nWimbledon\nAt a young age I became acutely aware of the humanity of the baby in the womb. I had the privilege of seeing my younger sister moving about on an ultrasound screen when I was four years old. I also remember losing three of my siblings to miscarriage over the following 10 years and the grief that accompanied each life lost.\nNow a married woman who has experienced many years of infertility and suffered the loss of a baby through miscarriage, I am even more aware of the inherent value of each human being. I am not a strong woman but I do serve a strong God. It is He who upholds me as I take this stand for women who have been deeply affected by abortion and to speak up for those who cannot speak for themselves, specifically the unborn. Over 250,000 babies are killed by abortion each year in England and Wales. Ten million, since 1967 abortion act. If you believe women and children deserve better than abortion, vote Sarah Barber on 4th July.\nYou can help Sarah stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk/content_1.html": "Make Abortion a Voting Issue\nOur country has no future so long as it continues to kill a quarter of its children intentionally every year in abortion procedures. This is the greatest moral and political issue of our generation.\nThe Election Results\nHuge thank you to everyone who voted for us!\nSeeking justice for babies and women hurt by the abortion industry\nAbortion is not something that can be dealt with lightly and forgotten about. It will affect you for the rest of your life.\nAbortion not only kills a child but it can also harm mothers.\nVote Life is committed to helping bereaved parents break the stigma around abortion by telling their story, perhaps for the first time. We are committed to their healing and recovery.\nWe are also committed to helping women harmed by abortion receive recognition and reparations for the damage done.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_keith-hayden/content_8.html": "Keith Hayden\nYork Outer\nHello, I’m Keith. In 1957 I was an unborn baby waiting to enter this world…… growing…. in secret! For you created my inmost being; you knit me together in my mother’s womb….\n(from the Holy Bible, Psalm 139:13)\nI believe we are all unique and special, wonderfully made, and that our right to life is the most important one, whatever our age, gender, race, belief or stage of development.\nNow a retired teacher, I’ve lived in York for 8 years and greatly enjoy and appreciate living in this beautiful historic city. With my lovely wife I thank God for life’s many blessings – we have a wonderful daughter, amazing son-in-law, plus 5 precious grandchildren! We love working on our allotment, especially now when the land starts yielding fruit and vegetables.\nYork with its surrounding villages and beautiful countryside has huge potential to be a leading example of good living, sound business, growing enterprise and compassion to all, including the disadvantaged.\nLast year it was a privilege to coordinate the King’s Gospels, a unique coronation gift of a beautifully bound set of the 4 books – Matthew, Mark, Luke and John - handwritten by over 2000 people in York. The word ‘Gospel’ means ‘Good News!’, and we could all do with more of that!\nThis initiative involved 17 local schools as well as 25 local church and community groups. Jesus said, “I have come that they may have life, and have it to the full.” (John 10:10)\nLIFE! It’s God’s gift to us all and I’m standing to protect yours and that of the next generation.\nWe may think our nation is in a mess, and heading for unknown disasters: financial uncertainties,wars and their fallout, climate issues, the cost of living, housing problems, the explosion of knife crime, the huge challenges for the many selfless NHS staff as well as patients’ needs, emergency services and those working in education, business, farming, engineering and construction.\nAs your independent candidate I would want to see all lives protected and nurtured, and encourage everyone to discover how our gifts, skills and attributes can help improve life at home, in work, community and wider society.\nI long to see our society return to true Christian values based on the Bible, so that we:\n1) Recognise the sanctity of human life,\n2) Respect marriage, family and caring for others\n3) Honour our responsibilities within our communities.\nThank God that 80 years ago, as a nation, we were miraculously rescued from disaster when King George VI, the father of our late Queen Elizabeth II, called national days of prayer. We need it again – now!\nEveryone is special; we are all uniquely made in God's image! There is HOPE!\nYou can help Keith stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_mark-townsend/content_14.html": "Mark Townsend\nRugby\nI provide care and support for adults with learning disabilities, I am married with 2 young boys and also have 2 adult children & 3 grandchildren.\nI had a difficult childhood dragged through the care system, then as a young adult spent 2 short spells in prison. I was a devout atheist who not only denied a creator, but also felt that even if I were wrong, I would not want anything to do with a god who allows such evil in the world and then expects us to worship him.\nThen about 15 years ago, after a very unexpected encounter with the LORD, I turned to Christ, and my life has not been the same since.\nInitially my faith cost me everything, family, home and everything I valued, but GOD is faithful to his word and today I am very happily married and my life has been transformed beyond recognition, I have a sense of peace and joy I never knew.\nAs a young man I pressured a woman into having an abortion, simply to hide my infidelity, but now with a clearer understanding of what an abortion is, and with a clear understanding of how valuable every life is, I want to fight for every baby's right to life. That is why I'm standing as an independent candidate for Vote Life.\nYou can help Mark stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_conference/content_4.html": "Vote Life Conference 2025\nFollowing on from the success of the Vote Life Campaign we are convening our supporters in Coventry on the 19th July in order to strategise the ending of abortion in the UK.\nThis one day conference, will give attendees an opportunity to:\nHear our incredible story\nMeet our courageous candidates\nStrategise the ending of abortion in the UK\nConnect, Resource, Inspire\nFull details regarding venue, times and speakers will be added to this page in late August.\nTo claim your ultra early bird ticket, sign up below.\nPLEASE NOTE THE DATE CHANGE OF THE CONFERENCE TO 19th JULY 2025.\nWaitlist\nAdd your name to be notified when more tickets added:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_wilberforce-walk/content_2.html": "Wilberforce Walk 2025\nCome join us as we walk 15 miles from central London out to Kent in order to remember the past, make connections and strategise a more humane future.\nJoin us this year!\nFAQ\nAll ages and abilities welcome!\nEntry fee £5\nUnder 16's don't have to pay\nSnacks and drinks provided\nLunch not provided\nMore exact information including refreshment breaks and routes will be released in mid August.\nIf you want to volunteer on the day please contact info@votelife.co.uk\nThank you to everyone who attended and supported Wilberforce Walk 2024. In total we raised £730 which will be donated in part to pro-life educational causes ( 30%) and the rest to fund future campaigns.\nBig THANK YOU!\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_ivana-forman/content_7.html": "Ivana Forman\nEast Worthing & Shorham\nI have been married 30 years to a wonderful supportive husband, and we have four grown children with one grandchild on the way. I love Pilates and growing vegetables in my garden.\nNow, I am standing as an independent candidate for East Worthing & Shoreham with the sole purpose of raising awareness on one single issue, abortion.\nYears ago, a video of an abortion procedure opened my eyes to a hidden injustice. The abortion industry masks this grave reality with euphemisms like ‘products of conception’ and ‘clumps of cells,’ using dehumanising terms such as ‘fetus.’ As a follower of Jesus, I felt compelled to act. Since then, I have dedicated myself to ending abortion.\nI believe that once people see the beautiful humanity of the baby in the womb and understand the horror of abortion, they will see through the lies perpetuated by the abortion industry.\nWomen deserve better! They have been hurt and betrayed by a society that should protect them and their babies.\nBut there is hope and forgiveness for us all, in Jesus Christ.\nJoin me in standing up for the voiceless - the most vulnerable in society, those in the most dangerous place on earth, babies in the womb.\nYou can help Ivana stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_rob-rawlins/content_10.html": "Rob Rawlins\nEly & East Cambrideshire\nMy name is Rob Rawlins. I am married with a lovely wife, three children and five grandchildren. I am retired and live in Cambridgeshire. I have been an English language teacher to adults and still do that a little online with Iranians, Ethiopians and others.\nWhy am I standing as an independent candidate on a pro-life ticket?\nIn my youth, I never thought about such things. I was part of the swinging 60s and briefly embraced a lifestyle with no sexual morals. One time, getting intimate with a new girl-friend, I said, “We haven’t got any protection.” She replied, “Don’t worry, I abort easily.” I wasn’t with her long enough to know if she conceived then aborted my baby. Now I am shocked by this. And I am aware that abortion is irresponsibly used today by some people.\nLater, I changed dramatically to following Jesus. Then came marriage and children. Over the years, my wife and I had occasion to counsel two families considering abortion for their teenage daughters. The circumstances were hard, but it was clear to us that you don’t kill babies. The solution is life and whatever help that can be given in bearing then raising a child. A quick fix may appear to be an abortion. But not at the cost of a human life and much heartache in grief and guilt.\nYou can see Vote Life’s aims on this website. Also the rationale for offering an alternative to other parties who support or condone abortion. I feel strongly enough to take action for the babies and for the many women harmed.\nYou can help Rob stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_dr-davinder-singh-james/content_3.html": "Dr Davinder Singh James\nTooting\nDavinder always believed in God but, coming from a Sikh background, didn't know how to find Him. At seven, during a family holiday in India, God spoke to him, asking if he would follow Him if revealed.\nYears later, in School, Davinder was given a Gideon's Youth Testament and read it in his third year at university while studying psychology. He came to faith profoundly and completed his studies at the Royal London Dental School.\nDavinder is married with one son and is self-employed with several interests.\nHe believes regular evangelism and systematic Bible study are essential to fulfilling the Great Commission.\nHe is passionate for the causes of both the fatherless and the unbornb and is committed to extending The Kingdom.\nYou can help Davinder stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_fennie-yap/content_17.html": "Fennie Yap\nRomsey & Southampton North\nFennie was born to first-generation Malaysian immigrants and grew up in Fair Oak, a village just off Eastleigh. She moved with her family to Southampton when she was a teenager.\nFennie was about 14 years old when she first saw an image of an abortion victim; a small infant, fully intact, deliberately killed only 24 weeks from fertilisation. The image broke her heart and set Fennie down a path of investigation, and ultimately activism.\nFennie studied at the University of Bristol where she was president of the Bristol Pro-Life Feminist Society. She now works as a data engineer in the financial sector and serves locally in community orchestras and in her parish church.\nYou can help Fennie stand for life by donating here:\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_science/content_6.html": "Developmental facts references\nHere are the scientific references for the developmental facts used on our election leaflet:\nThe heart starts beating at 3 weeks and 1 day[1]\nBrain waves have been recorded as early as 6 weeks[2]\nThe embryo begins to make spontaneous and reflexive movements,[3] and hand motions can be observed[4]\nSince week 8, the embryo has possessed more than 90% of the structures found in the adult body[5]\nBy week 10, fingernails, toenails and unique fingerprints all appear[6]\nThe fetus now yawns and opens and closes its mouth[7]\n[1] Campbell S. 2004. Watch me grow: A unique 3-dimensional week-by-week look at your baby’s behavior and development in the womb. New York: St. Martins. 14; Carlson BM. 2004. Human embryology & developmental biology. 3rd ed. Philadelphia: Mosby. 430; de Vries PA, Saunders JB. 1962. Development of the ventricles and spiral outflow tract in the human heart. Carnegie Institution of Washington. Contrib Embryol. 37:87-114. 96; Gardner E, O'Rahilly R. 1976. The nerve supply and conducting system of the human heart at the end of the embryonic period proper. J Anat. 121(3):571-587. 583; Gilbert-Barness E, Debich-Spicer D. 1997. Cardiovascular system. In: Gilbert-Barness, editor. Potter's pathology of the fetus and infant. Vol 1. St. Louis: Mosby. 650; Gittenger-de Groot AC, Bartelings MM, Poelmann RE. 2000. Normal and abnormal cardiac development. In: Allan L, Hornberger LK, Sharland G, editors. Textbook of fetal cardiology. London: Greenwich Medical Media Limited. 15-27. 17; van Heeswijk M, Nijhuis JG, Hollanders HMG. 1990. Fetal heart rate in early pregnancy. Early Hum Dev. 22(3):151-156. 151; Kurjak A, Chervenak FA, editors. 1994. The fetus as a patient. New York: Parthenon. 439; Navaratnam V. 1991. Organisation and reorganisation of blood vessels in embryonic development. Eye. 5(Pt 2):147-150. 147-148; O'Rahilly R, Müller F. 1987. Developmental stages in human embryos. Washington: Carnegie Institution. 99; Wisser J, Dirschedl P. 1994. Embryonic heart rate in dated human embryos. Early Hum Dev. 37:107-115. 108.\n[2] Borkowski WJ, Bernstine RL. 1955. Electroencephalography of the fetus. Neurology. 5(5):362-365. 363 (cited by Bernstine RL. 1961. Fetal electrocardiography and electroencephalography. Springfield: Charles C. Thomas. 63,66; O'Rahilly R, Müller F. 1999. The embryonic human brain: an atlas of developmental stages. 2nd ed. New York: Wiley-Liss. 195; van Dongen LGR, Goudie EG. 1980. Fetal movement patterns in the first trimester of pregnancy. Br J Obstet Gynaecol. 87(3):191-193. 193); Hamlin H. 1964. Life or death by EEG. JAMA. 90(2):112-114. 113. For a summary of in utero fetal encephalography (measuring brainwaves) in the near-term fetus using abdominal and vaginal electrodes see Bernstine RL, Borkowski WJ, Price AH. 1955. Prenatal fetal electroencephalography. Am J Obstet Gynecol. 70(3):623-630.\n[3] Birnholz JC, Stephens JC, Faria M. 1978. Fetal movement patterns: a possible means of defining neurologic developmental milestones in utero. Am J Roentgenol. 130(3):537-540. 539; de Vries JIP, Visser GHA, Prechtl HFR. 1982. The emergence of fetal behaviour. I. Qualitative aspects. Early Hum Dev. 7(4):301-322. 301,304: “The first movements were observed at 7.5 weeks postmenstrual age.” [or 5½ weeks postfertilization age]; Humphrey T. 1964. Growth and maturation of the brain - some correlations between the appearance of human fetal reflexes and the development of the nervous system. In: Dominick P, Purpura DP, Schadé JP, editors. Progress in brain research. Vol 4. Amsterdam: Elsevier. 93-135. 99: earliest reflex 5½ weeks; Humphrey T. 1970. The development of human fetal activity and its relation to postnatal behavior. Advances in child development and behavior. Vol 5. Reese HW, Lipsitt LP, editors. New York: Academic. 12; Humphrey T, Hooker D. 1959. Double simultaneous stimulation of human fetuses and the anatomical patterns underlying the reflexes elicited. J Comp Neurol. 112:75-102. 76; Humphrey T, Hooker D. 1961. Reflexes elicited by stimulating perineal and adjacent areas of human fetuses. Trans Am Neurol Assoc. 86:147-152. 147; Kurjak A, Chervenak FA, editors. 1994. The fetus as a patient. New York: Parthenon. 48; Visser GH, Mulder EJ, Prechtl HF. 1992. Studies on developmental neurology in the human fetus. Dev Pharmacol Ther. 18(3-4):175-183. 175-176: “Endogenously generated fetal movements can first be observed after 7 weeks postmenstrual age (i.e. 5 weeks after conception)”; O'Rahilly R, Müller F. 1999. The embryonic human brain: an atlas of developmental stages. 2nd ed. New York: Wiley-Liss. 336: 5½ weeks postfertilization; Sorokin Y, Dierker LJ. 1982. Fetal movement. Clin Obstet Gynecol. 25(4):719-734. 723,726; Natsuyama E. 1991. In utero behavior of human embryos at the spinal-cord stage of development. Biol Neonate. 60(Suppl 1):11-29. 13: spontaneous movement observed by “Carnegie stage 15” (about 33 days postfertilization); Hogg ID. 1941. Sensory nerves and associated structures in the skin of human fetuses of 8 to 14 weeks of menstrual age correlated with functional capability. J Comp Neur. 75:371-410. 373: reflex activity begins at 6½ weeks [adjusted to postfertilization age].\n[4] Endoscopic scans in “The Biology of Prenatal Development,” Endowment for Human Development, 2006\n[5] O'Rahilly R, Müller F. 2001. Human embryology and teratology. 3rd ed. New York: Wiley-Liss. 87: “It has been estimated that more than 90% of the more than 4500 named structures of the adult body become apparent during the embryonic period (O'Rahilly).”\n[6] O'Rahilly R, Müller F. 2001. Human embryology and teratology. 3rd ed. New York: Wiley-Liss. 170-171; Babler WJ. 1991. Embryologic development of epidermal ridges and their configurations. In: Plato CC, Garruto RM, Schaumann BA, editors. Dermatoglyphics: science in transition. New York: Wiley-Liss. 95-112. 95; Penrose LS, Ohara PT. 1973. The development of epidermal ridges. J Med Genet. 10(3):201-208. 201. For an overview of ridge formation in the skin of the hands see Cummins H. 1929. The topographic history of the volar pads (walking pads; tasballen) in the human embryo. Carnegie Institution of Washington. Contrib Embryol. 20:103-126.\n[7] de Vries JIP, Visser GHA, Prechtl HFR. 1982. The emergence of fetal behaviour. I. Qualitative aspects. Early Hum Dev. 7(4):301-322. 309.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_privacy-policy/content_13.html": "Privacy Policy\nVote Life website is run by electoral agent, Christian Hacking, who is a data controller of your personal data. Vote Life also relies on volunteers who serve as data processors. All data will is kept and stored in conformity to UK GDPR regulations and will not be shared without your prior permission.\nWe have adopted this Privacy Policy, in accordance with UK GDPR regulations, which determines how we are processing the information collected by Vote Life website, which also provides the reasons why we must collect certain personal data about you. Therefore, you must read this Privacy Policy before using Vote Life website.\nWe take care of your personal data and undertake to guarantee its confidentiality and security.\nPersonal information we collect:\nWhen you visit the Vote Life, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the installed cookies on your device. Additionally, as you browse the Site, we collect information about the individual web pages or products you view, what websites or search terms referred you to the Site, and how you interact with the Site. We refer to this automatically-collected information as “Device Information.” Moreover, we might collect the personal data you provide to us (including but not limited to Name, Surname, Address, payment information, etc.) during registration to be able to fulfill the agreement.\nWhy do we process your data?\nOur top priority is customer data security, and, as such, we may process only minimal user data, only as much as it is absolutely necessary to maintain the website. Information collected automatically is used only to identify potential cases of abuse and establish statistical information regarding website usage. This statistical information is not otherwise aggregated in such a way that it would identify any particular user of the system.\nYou can visit the website without telling us who you are or revealing any information, by which someone could identify you as a specific, identifiable individual. If, however, you wish to use some of the website’s features, or you wish to receive our newsletter or provide other details by filling a form, you may provide personal data to us, such as your email, first name, last name, city of residence, organization, telephone number. You can choose not to provide us with your personal data, but then you may not be able to take advantage of some of the website’s features. For example, you won’t be able to receive our Newsletter or contact us directly from the website. Users who are uncertain about what information is mandatory are welcome to contact us via info@votelife.co.uk.\nYour rights:\nIf you are a European resident, you have the following rights related to your personal data:\nThe right to be informed.\nThe right of access.\nThe right to rectification.\nThe right to erasure.\nThe right to restrict processing.\nThe right to data portability.\nThe right to object.\nRights in relation to automated decision-making and profiling.\nIf you would like to exercise this right, please contact us through the contact information below.\nAdditionally, if you are a European resident, we note that we are processing your information in order to fulfill contracts we might have with you (for example, if you make an order through the Site), or otherwise to pursue our legitimate business interests listed above. Additionally, please note that your information might be transferred outside of Europe, including Canada and the United States.\nLinks to other websites:\nOur website may contain links to other websites that are not owned or controlled by us. Please be aware that we are not responsible for such other websites or third parties' privacy practices. We encourage you to be aware when you leave our website and read the privacy statements of each website that may collect personal information.\nInformation security:\nWe secure information you provide on computer servers in a controlled, secure environment, protected from unauthorised access, use, or disclosure. We keep reasonable administrative, technical, and physical safeguards to protect against unauthorised access, use, modification, and personal data disclosure in its control and custody. However, no data transmission over the Internet or wireless network can be guaranteed.\nLegal disclosure:\nWe will disclose any information we collect, use or receive if required or permitted by law, such as to comply with a subpoena or similar legal process, and when we believe in good faith that disclosure is necessary to protect our rights, protect your safety or the safety of others, investigate fraud, or respond to a government request.\nContact information:\nIf you would like to contact us to understand more about this Policy or wish to contact us concerning any matter relating to individual rights and your Personal Information, you may send an email to info@votelife.co.uk.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_clare-roullier/content_9.html": "Clare Roullier\nGreat Yarmouth\nYou can help Clare stand for life by donating here:\nI was born in Jamaica but my parents returned to England when I was very young and I was raised in Surrey. After falling in love with this area in the early 2000s my Husband and I moved here 3 years ago. We are both keen walkers and I love reading and gardening.\nI am a committed Christian who believes in the sanctity of life. God tells us that he knit us together in our mother’s womb and that we are fearfully and wonderfully made (Psalm 139). Science shows us that life begins at fertilisation. Reality shows us that abortion kills a baby who is a distinct, unique human being and harms many women mentally, emotionally and sometimes physically.\nI am standing to protect unborn babies; to support women in challenging pregnancies; and to seek reparation for women harmed by abortion.\nIf you agree please vote Clare Roullier.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_what-is-abortion/content_12.html": "What is Abortion?\nMany people don't stand against abortion because they have not fully comprehended what abortion is?\n5/25/20241 min read\nIf you are effected or triggered by this video please contact us today so we can connect you with help.\nDefinition:\nDon't believe us? Watch this video...\nAbortion is the intentional killing of a baby in the womb\nNeed help? You're not alone\nAlternatively, you can hear about Laura's story here\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_donate/content_11.html": "Donate to Vote Life\nDonating directly to Vote Life will allow us to contribute towards\nCandidate deposits\nPrinting costs\nTraining events\nOffice space\nFood/Drink for volunteers\nTransport, training and accommodation for in-person candidates\nVideo production\nSocial media advertising\nEnd of campaign celebration\nBefore you give please note:\n1) Vote Life is not a political party, nor a company, so all donations will be managed using a dedicated bank account in the name of Christian Hacking. For financial accountability multiple people will be given access to this account and a weekly financial summary will be uploaded onto the website between 7th June-4th July.\n2) No donations will be used as a salary\n3) Due to the rules in general election in the UK we also need to be able to trace payments so please take a moment to fill out the following form before you give.\n4) IF YOU ARE NOT A UK RESIDENT OR REGISTERED TO VOTE YOU CANNOT DONATE TOWARDS OUR CAMPAIGN.\nIf you have any questions contact donations@votelife.co.uk\nFill out this form before you give!\nUK Donations\nVote Life\nNatwest Business\nAccount number: 41261321\nSort code:60-40-05\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_jane-lawrence/content_18.html": "Jane Lawrence\nLiverpool Garston\nI am a Christian, married, and work with children. I first came to Liverpool as a student in 1981 and have lived in Garston for 23 years. The loss of our fourth child as an eight year old has taught me much about the great value of every human life. Each deserves and needs protection by the law. This is my first time standing as a candidate.\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_articles/content_5.html": "Articles\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved.",
  "https_votelife_co_uk_/https_votelife_co_uk_ive-had-a-miscarriage-how-could-you-be-so-insensitive/content_16.html": "I’ve had a miscarriage. How could you be so insensitive?\nVote Life defends use of images for women grieving miscarriage\n6/29/20242 min read\nAs part of the Vote Life campaign, we have delivered over 1 million postcards into homes, containing images of babies growing in the womb at various stages between 6-10 weeks gestation from fertilisation*.\nIn doing this, we are aware that for a small but significant proportion of recipients, the images might be upsetting due to a previous miscarriage or issues around infertility. If you have had a miscarriage, we empathise compassionately with the pain you have endured and we are sorry for your loss. We recognise miscarriage affects 1 in 4 pregnancies in the UK and is often incredibly painful for women and their partners. In the words of one testimonial on the Miscarriage Association website, miscarriage is “probably the saddest, most gut-wrenching moment in my life.”\nAt Vote Life, we recognise that this loss can have a lifelong emotional impact on women, especially if the premature death of that child is not mourned properly in private, publicly or with the help of support groups. If you are still hurting from a previous miscarriage or multiple miscarriages, we recommend and commend the work of an independent organisation named Misposa Trust. We also welcome the government's decision earlier this year to allow certificates for babies lost to miscarriage, this grief doesn't need to be hidden.\nThis said Vote Life believes the use of our images can be morally justified for the following reason. Without minimising this pain for a moment, we must be brave and ask the following question: why is miscarriage so painful?\nIf we are to believe that unborn babies are just a “blob of cells” or a collection of “pregnancy tissue,” then losing a “pregnancy” should be no more emotionally difficult than losing one's appendix or tonsils. The reality, however, is that an unborn child is not simply tissue but rather a whole and valuable human being. This is the reality that this was another human being, a precious individual, a much loved child. If this is the depth of feeling we as people feel about a miscarriage, which is normally no one's fault, just think how painful abortion is.\nWe are delighted to see more and more initiatives popping up enabling parents of miscarried children to openly and unashamedly grieve the loss of their child and receive help, healing, and recognition for this loss. However, for the 1 in 4 pregnancies also ending in abortion, very little support is available. Instead, women, because they have supposedly “chosen” to end the life of their baby, are forced to grieve in silence and contend alone with the “guilt,” “sadness,” and “despair” that often accompanies that decision. The abortion industry is not committed to their long-term health and well-being, and we as a society aren’t talking about it, which makes matters worse. These images however humanise the babies in the womb can save their lives through informing the woman's decision.\nTherefore, we contend that the image of a 6-week unborn baby in the womb is not the problem. Indeed, others who have experienced a miscarriage have thanked us for showing them a version of this image and affirming the humanity of their child. Rather, the problem is a culture that, on the one hand, affirms the humanity of unborn children when they die tragically as a result of a miscarriage but simultaneously denies the humanity of the unborn child when they are intentionally killed by abortion.\nVote Life is committed to addressing this contradiction with truth and love. If you have any more questions, please contact info@votelife.co.uk\n*Please note that Vote Life takes 100% responsibility for the coordination and delivery. Please do not direct\ncriticism towards the printer or Royal Mail who were simply doing their job\nDisclaimer\nVote Life is not a political party but a collective banner under which independent candidates can stand. We work with independent candidates to ensure they maximise the educational opportunities of the electoral system in advocating for pro-life laws and policy.\nContact us\nKEEP IN TOUCH\nby signing your name and email you consent to us sending you relevant communications to do with Vote Life.\ninfo@votelife.co.uk\nVote Life\n71-75 Shelton Street, Covent Garden, London WC2H9 JQ\n© 2024. All rights reserved."
}