{
  "https_www_frankwardindependent_co_uk_/https_www_frankwardindependent_co_uk_local-issues/content_2.html": "Local issues\nHaving lived in Worthing since the 1990s, I am passionate about seeing this fantastic area prosper. I know there are challenges in our community, but I'm determined to fight for and support the people of East Worthing and Shoreham.\n-\nStop central Government taking 80% of business rates. This will ensure money from local businesses goes back into the community, supporting the repair of local infrastructure, roads, paving and drainage.\n-\nStop central government from dictating local housing policy, which has seen developments on flood plains and nature reserves. Giving control back to the local authority will support affordable housing and projects that are not at risk of flooding.\n-\nStop the desecration of local heritage properties. Solid Victorian buildings have been demolished for developers to build cheaper, lower quality flats. We should think renovation and restoration, not demolition and cheap, fast housing projects.\n-\nAddress the A27. Construct bypasses for Worthing, Arundel and Chichester. Doing so will alleviate congestion reduce pressure on towns, maintaining traffic flow and supporting local access. This would be combined with a review of traffic controls in key blackspots, with a view to stop installing roundabouts with traffic lights that contribute to poor flow, for example.\n-\nFootbridge for Worthing Central station, a notorious pedestrian block.\n-\nLegislation to prevent local authorities from speculative investments, so local taxes are used for the provision of local services.",
  "https_www_frankwardindependent_co_uk_/https_www_frankwardindependent_co_uk_personal-promises/content_3.html": "top of page\nPersonal promises\nVoting in a local election isn't just a vote for policy but a vote for a person, the individual who'll represent you as your MP. As such, I will make a number of personal promises to the people of East Worthing and Shoreham.\n-\n100% honesty, advocacy and attention to constituency needs.\n-\n100% ability to think and act independently for the best of my constituents, not subject to party whip.\n-\n50% of my salary to be donated to local charities, subject to taxes and legal permissions.\n-\nI will fight for the underprivileged and undervalued.\n-\nI will fight political corruption, sleaze, aloofness and waste.\nbottom of page",
  "https_www_frankwardindependent_co_uk_/https_www_frankwardindependent_co_uk_thank-you/content_7.html": "Thank You\nThe 2024 General Election has come and gone, and while I didn't achieve my ultimate goal of being elected as an MP, there are many positives to take away.\nRunning as an independent candidate for East Worthing and Shoreham was a challenge but also an immense privilege. To be out, speaking to voters, engaging in healthy debate and conversation with those who wanted to talk and respectfully saying thank you to those who did not, was a joy.\nTo receive the most votes of any independent candidate is also incredibly moving. Without the same budget as mainstream opponents it was always going to be difficult to amplify what it was - and is - that I stand for. Yet many people went to the ballot box with me in mind, voting for change.\nHaving lived in Worthing for 30 years, to be a part of this process and to have found support is something I am overwhelmingly grateful for. So, to everyone who voted for me in the 2024 General Election: thank you.\nI will continue to work for change in the local area, so please keep an eye on my website for further updates and news.\nFrank Ward",
  "https_www_frankwardindependent_co_uk_/https_www_frankwardindependent_co_uk_international-issues/content_6.html": "International issues\nRepresenting the local community of East Worthing and Shoreham would be an honour, but it is important to look not just at local issues but global policies, too. Were I to be voted as your MP, I would be mindful of looking beyond the UK and standing up for what I believe to be right globally.\n-\nSupport a two-state solution in Palestine / Israel.\n-\nGive more support for Ukraine.Review the operating format of the United Nations. The current veto ability of superpowers should be removed, as one country means one vote. Allow majority votes to be carried, preventing the current blocking tactics exercised as political blackmail over others.\n-\nPossible expulsion from UN of Russia and Israel until they comply with UN instructions to act in a humane fashion and stop committing alleged war crimes.\n-\nEqual emphasis on saving lives and saving the planet, both of which are essential.",
  "https_www_frankwardindependent_co_uk_/https_www_frankwardindependent_co_uk_about/content_4.html": "top of page\nAbout Frank\nMy name is Frank Ward, your candidate for East Worthing and Shoreham in the July 2024 elections. I have had the joy of living in Worthing for the past 30 years - it really is the place I call home.\nRecently retired, I've worked as a secondary school teacher, accountant, and electrician and plumber in the construction industry. I'm a local, truly independent voice, determined to work for the people of East Worthing and Shoreham.\nIf you have any questions about me or would like to get in touch, I would be delighted to speak to you.\nCall: 07301637927\nbottom of page",
  "https_www_frankwardindependent_co_uk_/https_www_frankwardindependent_co_uk/content_1.html": "Vote change.\nVote independent.\nVote Ward.\nFrank Ward\nIndependent candidate for East Worthing and Shoreham\nMy name is Frank Ward and I've lived in Worthing for 30 years. Recently retired, I've worked as a secondary school teacher, accountant, and electrician and plumber in the construction industry. I'm a local, truly independent voice, determined to work for the people of East Worthing and Shoreham.\nWorking for local, national and international change.\nFrom donating 50% of my salary to local charities were I to be elected as an MP to absolute attention to constituency needs, I have made a number of personal promises.\nI'm determined to see the construction of Worthing, Arundel and Chichester bypasses, and stop Westminster taking 80% of business rates - local taxes should be used for local needs.\nI would like to see NHS administration funds redirected to medical care, plus more and better-funded facilities for those with severe mental and physical disabilities.\nThe UK's continued backing of Ukraine is vital and should be expanded, while central government should support a two-state solution in Palestine.",
  "https_www_frankwardindependent_co_uk_/https_www_frankwardindependent_co_uk_national-issues/content_5.html": "National issues\nVoting for a candidate for East Worthing and Shoreham means choosing an MP to represent the area on a national stage. As such, it's important for me to play an active role in change across the UK.\n-\nSupport Consolidate NHS administration. With each NHS Trust having its own administration team, consolidating these teams and sharing services will help redirect funds to where it’s needed most: into medical care.\n-\nMore police on the ground. Push for greater investment and the expansion of our police forces, reducing the dominance of cameras and removing lay Police commissioners – political appointments that have no place in policing.\n-\nJustice review. Comprehensive review of criminal justice system, sentencing for serious crime is inadequate, parole board activities need reviewing. Build new prisons with proper resources.\n-\nBusiness support. Encourage businesses to move away from the South of England using tax incentives. This would mean a more prosperous UK as a whole, with reduced pressure on an overcrowded and increasingly expensive South.\n-\nMental and physical health. Greater provision of properly resourced and funded facilities for those with severe mental and physical disabilities. We cannot abandon those who are most vulnerable in inadequate community care with exhausted carers. We must give them a place they can have supported independence.\n-\nSupport for first time buyers. We should abolish stamp duty for those buying their first home and, for those under 40, help with a matched deposit savings grant from central government, subject to a maximum.\n-\nNationalise rail. Taking advantage of the economy of scale, the railway network needs to be nationalised, rather than having duplicated services and associated administration. Nationalise water. It is vital to stop bankrupt companies taking government money to run their services while still paying dividends and polluting our water.\n-\nEducation. Greater emphasis at secondary level on preparation for life, learning a second language and social support skills, such as first aid training. School meals to be available for all those in need, with proper nutrition for children a priority.\n-\nPrevent serving MPs taking part in reality TV programmes during their term in office. Being present and available to constituents is vitally important.\n-\nMandate and monitor the time serving MPs spend listening to and working for their constituents, attending and contributing to parliamentary business. Discourage MPs holding second jobs and directorships. Being an MP is a full-time job and should be treated as one. Stop investment in UK public and private bodies by foreign governments and corrupt oligarchs.\n-\nAs a G8 economy we need to work to abolish poverty, condemn to history the need for foodbanks and homelessness.\n-\nAdvocate proportional representation in national and local elections and review of House of Lords membership.\n-\nNationalise the Post Office.\n-\nReview the veil of incorporation and limited liability for companies. Impose lifetime bans on dishonest owners and directors, rather than three to five-year bans."
}