{
  "https_ryan4hackney_my_canva_site_ryanahmad/https_ryan4hackney_my_canva_site_ryanahmad/content_1.html": "New Labour\nVote for MP:\nRyan Ahmad 4\nHackney North\n& Stokey\nMy name is Ryan Ahmad and I am standing for election as your MP in my hometown, Hackney.\nAbout me: I went to school in Enfield, Surrey and the North East, quite varied places. I studied PPE at Oxford where I came to the attention of prime minister Blair who appointed me as his aide de camp and gave me a cabinet office security clearance. I had extensive contact with cabinet ministers, senior civil servants, military and intelligence chiefs, world leaders, billionaires, I literally met a hundred of the world's most powerful people and another hundred most famous celebrities. I was sounded out for roles in the administrations of Afghanistan and Iraq (scary) and I got a superb job offer from mi5. I have experience in finance, politics, retail, the voluntary sector and hospitality. Sadly I couldn't take the mi5 offer up as I went on to have a major mental health breakdown. I was sectioned and over the next twelve years spent well over a year in mental hospitals in total, with\nmultiple incarcerations in various psychiatric wards. I was subjected to an extreme campaign of violence, suffering life changing injuries and numerous other assaults, which also led to PTSD. I didn't work for 17 years and was in constant crisis and isolation.\nIn 2012, I moved to London and my life has improved markedly since then. I've done courses, become secretary of my local branch of the labour party, I volunteer with a charity that reduces loneliness and isolation among older neighbours and this summer I started working in the best pub in the world, the Cock Tavern. Recently I applied for a private banking job, but would prefer something in politics like the civil service or SPAD.\nI was also homeless on two occasions in my life, once while on the run from a mental hospital (I spent about 4 months on the\nstreets of central London including Christmas) and then again when I was illegally evicted by my landlord while in hospital. I have benefitted a lot from Hackney's homeless hostel and am now in social housing which has allowed me to rebuild my life.\nAs MP, I would like to accelerate campaigning, political education, community activism and retention and sign up of members. I've chaired a few branch meetings in the past, and they were pretty efficient affairs. My main policy/campaigning areas are economy, mental health, homelessness, poverty (all forms of hardship really), cyber ethics and practice, environment and equality. But my prime goal as MP would be serving the constituency. I would love to tear into my consituents’ problems every day – I studied economics and politics because I want to improve people’s lives.\nI know many of you from canvassing, socials, various meetings and zoom. I often deliver input to meetings and last year I proposed a motion calling on the leadership to support\nindustrial action in the face of real wage cuts (which passed at CLP).\nMOST IMPORTANTLY, I have extensive experience of the Affairs of State that the vast majority of MPs can only grasp at. I have had loads of influence contributing to Defence Policy. I instigated billions of pounds worth of Government spending with New Labour. I have worked with all of the frontier technologies that can improve public services like the NHS. World leaders and foreign policy? I’ve met them and practised it. Heads of intelligence services, former Prime Ministers and cabinet members all contributed directly to my formative education. Additionally, I understand CAPITALISM and Wealth. A vote for me is a vote for a uniquely powerful level of competence and experience at the leadership level of our country.\nI have high hopes for my future in politics with my experience,\neducation and background standing me in good stead. I hope to one day be leader of the Labour party! I worship at the altar of Blair/Brown but thought Jeremy was inspirational. I think we need to appreciate as a party that many of our most progressive and ambitious policy ideas come from the left, who should be embraced not vilified though they have to be based on a degree of reality.\nBut with that in mind I would be liberal and progressive.\nConstiuents, I promise you socialism!\nThanks for reading.\nIn solidarity."
}