{
  "https_janilevanen_city_/https_janilevanen_city/content_1.html": "Jani Levänen\nCopyright © 2025 Jani Levänen - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_janilevanen_city_/https_janilevanen_city_imprint/content_2.html": "Created and promoted by Jani Levanen Esq, of London.\nContact: admin@janilevanen.city\nJani Levänen\nCopyright © 2025 Jani Levänen - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_janilevanen_city_/https_janilevanen_city_privacy-policy/content_3.html": "Introduction\nJani Levänen is committed to respecting and protecting your personal data. This policy explains who Jani Levänen is, what personal data (“Data”) he collects, how it is used, information on your rights, and how you can contact him. The way Jani Levänen is able to process personal data is governed by the General Data Protection Regulations (GDPR) and Data Protection Act (DPA) 2018.\nWho is collecting data\nJani Levänen is candidate for nomination as candidate for Common Council 2025 elections. For the purposes of UK data protection law, Jani Levänen is the Data Controller of all personal data sent to him by voters and supporters in his capacity as a candidate in the election for Common Council in the City of London. From 01 April 2019 elected representatives and prospective representatives (including police and crime commissioners) are exempt from paying a fee and registering with the Information Commissioner’s Office (ICO). For more information on this visit: https://ico.org.uk/for-organisations/in-your-sector/political/\nHow personal data is collected, used and stored\nWhen you contact Jani Levänen you may provide personal data to enable him to respond. Jani Levänen takes the security of your data extremely seriously. Your data will be stored in a secure manner. Access to your personal data will be limited to Jani Levänen and his team for the purpose of dealing with your communication and maintaining office records.\nJani Levänen and his staff may use information held about you in the following ways:\n• To ensure that content from this website is presented in the most effective manner for you and for your computer.\n• To provide you with relevant information of a type that you request or which Jani Levänen and his staff feel may interest you.\n• To carry out the requirements of any contracts entered into between you and Jani Levänen\n• To allow you to use the interactive features of this website, when you choose to do so.\n• To notify you about changes to this website’s service.\n• To notify you about information pertaining to the City of London, the Common Council, the Sheriffs and Mayoralty, City of London elections and events and services, Livery Companies, and election communications from Jani Levänen and his staff\nTypes of Personal Data Collected\nPersonal data collected may include:\n• Postal Address\n• Email Address\n• Phone Number\n• Your title, gender, full name, other contact information, job title, company or employment affiliation.\nIf you contact Jani Levänen or his staff, they may keep a record of that correspondence, including any information provided or required relating to your communication, enquiry or issue.\nWho your data may be shared with\nWhen in communication with you, it may be necessary for Jani Levänen and his staff to share the personal data you provide with government departments, local authorities and other public bodies. Jani Levänen will only share as much information as is necessary to take your case forward. Other than in the circumstances above, Jani Levänen and his staff will not share your personal data with other organisations or individuals without your explicit consent.\nHow long your data may be kept\nJani Levänen and his staff will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Jani Levänen and his staff will retain your data for up to five years after your communication has been closed in case you get in touch again.\nGDPR & the legal basis for processing your data\nUnder GDPR personal data can only be processed using a lawful basis defined by the Information Commissioner’s Office – see this link: Article 6 - see https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/lawful-basis-for-processing/\nJani Levänen and his staff will process your data using the lawful basis of consent (Article 6(a))and Public Task (Article 6(e)). Your data will be retained under the legal basis of Legitimate Interests (Article 6(f)) for example for the purpose of managing constituents’ casework and policy concerns effectively.\nSpecial Category Data\nIt may be that you disclose to Jani Levänen and his staff personal data which can be classified as special category data https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/lawful-basis-for-processing/special-category-data/ under GDPR. This could include information related to ethnicity, health, sexuality, race, or faith. Under GDPR this data can only be processed using a lawful basis under Article 6 and a condition of processing defined in Article 9. Jani Levänen and his staff will process such data under Article 6(a) (Consent) and Article 9(a) (Consent).\nWhat your rights are\nYou have several rights in relation to your data and can choose how it is used. You can:\n• Obtain copies of the data held about you (known as a “subject access request”)\n• Request that we correct or update any data held about you\n• Withdraw your consent and ask that we delete your data or restrict the ways in which we use your data\n• Request that data you have given your consent for us to use is provided in an electronic format so it can be transferred to another data controller (known as “data portability”)\n• Opt-out of receiving further communications from us via any medium at any time.\nYou also have the right to make a complaint directly to the Information Commissioner's Office. They can be contacted at: https://ico.org.uk/global/contact-us/ and concerns can be also logged via: https://ico.org.uk/concerns/.\nContact us\nIf you would like more information on any of the above, or have any questions about this policy, then please contact our data protection representative by emailing info@janilevanen.city\n.\nChanges to this Privacy Policy\nJani Levänen and his staff keep this privacy policy under regular review and as such it may be updated from time to time so you should check it each time you submit personal information to us. The date of the most recent revisions will appear on this page. If you do not agree to these changes, please do not continue to use this website to submit personal information to us. If material changes are made to this privacy policy we will notify you by placing a prominent notice on our website.\nUpdated: 23 Mar 2024"
}