{
  "https_shreyaforhillrise_framer_ai_/https_shreyaforhillrise_framer_ai_endorsements/content_2.html": "Don't just take it from me!\nHere are people who think I will make a real difference as a councillor in Hillrise.\nThe Hon. Dr Catherine Cunningham\n- Hillrise resident\nI saw how hard Shreya worked during the general election and I know she has a strong track record of helping people in her community. I have no doubt she will be an excellent candidate and will work hard for people in Hillrise.\nDavid Poyser - former Hillrise councillor\nI have known and worked with Shreya for many months. She has worked really hard campaigning in Hillrise since I announced my resignation from Hillrise Ward - an area I love. I have every confidence she would continue all the work I was involved with: working together with Junction councillors renewing Archway, working with police, tenants organisations, council services on the extremes of poverty and anti-social behaviour on Hillrise’s estates (especially New Orleans, Elthorne, Hornsey Lane, Holly Park etc), the drugs hostel on Ashley Road, and many more local issues.\nIn my view, Islington Council would benefit hugely from her immense knowledge of urban renewal and her key role in the general election campaign.\nDavid Poyser - former Hillrise councillor\nI have known and worked with Shreya for many months. She has worked really hard campaigning in Hillrise since I announced my resignation from Hillrise Ward - an area I love. I have every confidence she would continue all the work I was involved with: working together with Junction councillors renewing Archway, working with police, tenants organisations, council services on the extremes of poverty and anti-social behaviour on Hillrise’s estates (especially New Orleans, Elthorne, Hornsey Lane, Holly Park etc), the drugs hostel on Ashley Road, and many more local issues.\nIn my view, Islington Council would benefit hugely from her immense knowledge of urban renewal and her key role in the general election campaign.\nCllr Paul Convery - Caledonian ward\nShreya worked hard organising across the borough. Her skills as an economist would also be a valuable addition to the Islington Labour group. I very much hope she joins us on the council.\nMari Williams - Highbury ward\nCllr Paul Convery - Caledonian ward\nShreya did a fantastic job organising us in Islington and would be a great campaigner.\nShreya worked hard organising the general election campaign in Highbury and Mildmay. Her skills as an economist would also be a valuable addition to the Islington Labour group. I very much hope she joins us on the council.\nThe Hon. Dr Catherine Cunningham- Hillrise member\nI saw how hard Shreya worked during the general election and I know she has a strong track record of helping people in her community. I have no doubt she will be an excellent candidate and will work hard for people in Hillrise.\nMari Williams -\nHighbury membership officer\nShreya did a fantastic job organising us in Highbury and would be a great campaigner.\nTom Doherty - Arsenal ward\nShreya is a brilliant local and national campaigner who has progressive values in her heart. I have seen how she has built coalitions of support for key national policy priorities such as housebuilding, now a central plank of Labour’s policy. Having heard from thousands of Islington residents over recent years, I know she will be a brilliant local councillor, putting the interests and ideas of residents at the centre of everything she does.\nMark Streather - Highbury ward\nShreya will be an excellent local champion, bringing a problem-solving ethos, fresh ideas and a new perspective to our issues impacting our community. I’ve seen first-hand how effective a local organiser and campaigner she has been, not only in running campaigns herself, but in building support and involving others. She’ll be an excellent representative of the community, as well as a powerful voice locally.\nTim Sayer MBE - Highbury member\nI helped Shreya during her tireless work for Praful Nargund during the general election campaign. I was impressed by her energy and dedication, her organisational skills — and her interest in the local community. I can heartily recommend her to be a local councillor.\nTom Doherty - Arsenal ward organiser\nShreya is a brilliant local and national campaigner who has Labour values in her heart. I have seen how she has built coalitions of support for key national policy priorities such as housebuilding, now a central plank of Labour’s policy. Having heard from thousands of Islington residents over recent years, I know she will be a brilliant local councillor, putting the interests and ideas of residents at the centre of everything she does.\nTim Sayer MBE - Highbury ward\nI helped Shreya during her tireless work during recent campaigns. I was impressed by her energy and dedication, her organisational skills — and her interest in the local community. I can heartily recommend her to be a local councillor.\nBack to home",
  "https_shreyaforhillrise_framer_ai_/https_shreyaforhillrise_framer_ai/content_1.html": "Shreya for Hillrise\nYour Islington Labour candidate\nShreya for Hillrise\nYour Islington Labour candidate\nShreya for Hillrise\nYour Islington Labour candidate\nA local, experienced, and committed Labour activist, with a history of tackling wealth inequality and speaking up for the most vulnerable in our communities\nA local, experienced, and committed Labour activist, with a history of tackling wealth inequality and speaking up for the most vulnerable in our communities\nA local, experienced, and committed Labour activist, with a history of tackling wealth inequality and speaking up for the most vulnerable in our communities\nCheck out my work/social media\nHave a question? Email shreyaforhillrise@gmail.com\nHave a question? Email shreyaforhillrise@gmail.com\nI'm an activist\nI'm an activist\nI have spent years dedicating my time to making Islington a good place to live - helping mobilise hundreds of activists for causes across the borough that I care about. I've been at countless meetings and discussions, pushing a progressive, people-first agenda for years.\nI have spent years dedicating my time to making Islington a good place to live - helping mobilise hundreds of activists for causes across the borough that I care about. I've been at countless meetings and discussions, pushing a progressive, people-first agenda for years.\nI have spent years dedicating my time to making Islington a good place to live - helping mobilise hundreds of activists for causes across the borough that I care about. I've been at countless meetings and discussions, pushing a progressive, people-first agenda for years.\nI've got experience\nI've got experience\nI have a wealth of relevant experience from my work as an economist in public policy - including at the Department for Levelling up, Housing and Communities, the Institute for Public Policy Research, and as Chief Economist at the Social Market Foundation. I am keen to use this experience to help make Hillrise an even better place to live.\nI have a wealth of relevant experience from my work as an economist in public policy - including at the Department for Levelling up, Housing and Communities, the Institute for Public Policy Research, and as Chief Economist at the Social Market Foundation. I am keen to use this experience to help make Hillrise an even better place to live.\nI'll work for you\nI've got experience.\nI have worked hard in my local community, from creating reading groups across different schools to volunteering for a number of homelessness charities including Crisis in Islington. I will be in the community, working for you, and with you to make Hillrise a just and fair place for all.\nI have worked hard in my local community, from creating reading groups across different schools to volunteering for a number of homelessness charities including Crisis in Islington. I will be in the community, working for you, and with you to make Hillrise a just and fair place for all.\nI have a wealth of relevant experience from my work as an economist in public policy - including at the Department for Levelling up, Housing and Communities, the Institute for Public Policy Research, and as Chief Economist at the Social Market Foundation. I am keen to use this experience to help make Islington an even better place to live\nI'm committed to\nsafety and justice\nI'm committed to\nsafety and justice\nI'm committed to\nsafety and justice\nI have spent my career as an economist fighting for economic justice - curbing landlord power, higher taxes on wealth, and a fairer social contract. And I am proud to be a member of Unite and an advisor to the Women’s Budget Group, Tax Justice UK and the Fabian Society.\nI have spent my career as an economist fighting for economic justice - curbing landlord power, higher taxes on wealth, and a fairer social contract. And I am proud to be a member of Unite and an advisor to the Women’s Budget Group, Tax Justice UK and the Fabian Society.\nI have spent my career as an economist fighting for economic justice - curbing landlord power, higher taxes on wealth, and a fairer social contract. And I am proud to be a member of Unite and an advisor to the Women’s Budget Group, Tax Justice UK and the Fabian Society.\nDon't take it from me! Check out my endorsements\nDon't take it from me! Check out my endorsements"
}