{
  "https_www_michael-gregson_com_/https_www_michael-gregson_com_priorities/content_3.html": "Priorities\nI will fight for funding and resources to make a positive impact on\npeople’s lives. As Inverness has grown in population (25% in 20 years to 82,000),\nthe pressure on central areas - and on essential services - has increased.\nManagement of all sectors must be appropriate and consultative.\nSupporting People and Communities\nListening to people and local communities; valuing and supporting the work of Community Councils and Residents’ Associations. Being available and contactable; following up people’s requests and concerns.\nOpportunities for Young People\nInvesting in children and young people to ensure they have the opportunities and services to develop emotionally, socially and academically. Supporting schools, nurseries and other settings. Valuing and supporting Play Parks, the Merkinch Local Nature Reserve, ‘Safe, Strong & Free’ projects, and sporting and voluntary activities such as Boys Brigade, Sea Cadets, Football Academy. Protecting green spaces.\nProtecting Green Spaces\nWe need to protect our existing green spaces, such as those are Dalneigh Primary School and Hawthorn Drive\nHelping People Live in their own Homes\nSupporting people to live in their own homes with all necessary adaptations; making sure homes are the right size, in the right place, and are warm, safe and energy-efficient. Making sure Highland Council acts in response to housing issues. Speedier housing re-lets.\nAddressing Fuel Poverty\nAddressing fuel poverty, maximising and targeting all available resources where most needed. Working with the Citizens’ Advice Bureau to ensure people claim the benefits they are entitled to (e.g. Pension Credit, Winter\nFuel Allowance, Income Tax Credits, Universal Credit). Maximising Inverness Winter Payments for those most in need.\nControlling Traffic Speeds and Volumes\nControlling traffic speeds and volumes across the Ward, campaigning for improved traffic management and reduced impact on residential areas. Where necessary, seeking Residents’ Parking, One-way streets, resurfacing, double yellow lines, flexible speed limits (i.e. 20 or 30 mph according to location), seeking to limit inappropriate HGV use of narrow residential streets.\nAcademy Street Changes\nWe need to ensure that the proposed changes to Academy Street do not negatively impact local businesses and residential areas.\nStopping sales of vapes to Under-18s\nVaping has become a major social and health issue. Trading Standards, Law enforcement and the retail sector must play a part in mitigating the problem.\nSupporting Positive Improvements\nSuch as at Merkinch Primary School, Bellfield Park, the Victorian Market and encouraging Active Travel.\nWorking with Local Organisations\nWorking cooperatively and constructively with all relevant statutory and voluntary organisations for the benefit of Inverness Central Ward - not only Highland Council Services, but Police Scotland, NHS Highland, Highland Health & Social Care Partnership, Inverness Chamber of Commerce, Inverness BID, Highlands & Islands Enterprise, and others. Working constructively with the Ward Manager. Utilising Ward Discretionary Payments to support and protect local services and initiatives.",
  "https_www_michael-gregson_com_/https_www_michael-gregson_com_post_brexit-that-was-then-this-is-now/content_2.html": null,
  "https_www_michael-gregson_com_/https_www_michael-gregson_com_contact-8/content_6.html": "top of page\nCllr. Michael Gregson - Inverness Central\nHome\nPriorities\nUpdates\nContact\nMore\nUse tab to navigate through the menu items.\nCONTACT\nMail\nMichael.Gregson.cllr@highland.gov.uk\nbottom of page",
  "https_www_michael-gregson_com_/https_www_michael-gregson_com_post_fresh-revelations-about-highland-education-problems/content_4.html": null,
  "https_www_michael-gregson_com_/https_www_michael-gregson_com_post_visitor-levy-consultation-already-revealing-serious-flaws/content_7.html": null,
  "https_www_michael-gregson_com_/https_www_michael-gregson_com_post_human-rights-concerns-in-the-highlands-and-islands/content_8.html": null,
  "https_www_michael-gregson_com_/https_www_michael-gregson_com/content_1.html": "Cllr. Michael Gregson -\nInverness Central\nUr Chomhairliche airson Meadhan Inbhir Nis\nUpdates\nAbout Me\nI have been a secondary school teacher for many years. I was also an active member of the Inverness District Council from 1992 to 1996, when Highland Council was formed. I am married with two grown-up children and have served on the Children's Panel, Eden Court Board of Governors and the Local Health Council.\nMy Priorities for Inverness Central\nI will represent all who live and work in Inverness Central, to the best of my\nability. This means responding to all contacts and requests for help, liaising\nwith individuals, organisations and businesses, to make sure Highland Council\nand its partners are doing the best they can for the Ward. I will work in\ncollaboration with other elected members, and with Council officers, to\nachieve the best outcomes possible.\nI will be accessible in person, by phone, by email, and through social media. I\nwill support and drive forward all services, including:\nSupporting People and Communities\nThrough Community Councils, Residents' Associations and Community Policing\nProtecting Green Spaces\nI will fight to protect our green spaces, such as at Dalneigh Primary School and Hawthorn Drive\nOpportunities for Young People\nProviding our young people to have the opportunities and services available to them to develop emotionally, socially and academically.\nAcademy Street Changes\nEnsuring that the proposed changes to Academy Street do not negatively impact businesses and residential areas.",
  "https_www_michael-gregson_com_/https_www_michael-gregson_com_blog/content_5.html": "top of page\nVisitor Levy Consultation already revealing serious flaws\nInverness Councillor Dr Michael Gregson has praised the Highland Hospitality sector for its constructive and thoughtful analysis of the...\nJan 25\n9 views\nBrexit - that was then, this is now\nThe UK Government can no longer ignore the Brexit elephant. Any aspiration to ‘grow the economy’ will founder, unless the ship of...\nJan 25\n12 views\nFresh revelations about Highland Education problems\nInverness Councillor Dr Michael Gregson has again questioned Highland Council’s ruling Administration, as Highland placed in the five...\nJan 25\n12 views\nHuman Rights Concerns in the Highlands and Islands\nThe recent report by the Scottish Human Rights Commission has identified serious weaknesses in people's rights across the Highlands and...\nDec 24, 2024\n15 views\nbottom of page"
}