{
  "https_www_mikecrofts_com_/https_www_mikecrofts_com_post_your-title-what-s-your-blog-about/content_6.html": "Red Bull: Mike Crofts - The Change I Want To See\n- Mike Crofts\n- Aug 8, 2023\n- 1 min read\nRead about Mike's work in the Criminal Justice System\nExploring prison reform through sports based mentoring.\nI've long believed in the power of sport to engage some of the hardest to reach people in society. 3Pillars Project was created in recognition of this fact, harnessing excellent mentors who could build relationships alongside our cutting edge sports programme.\nRead the full article here: The Change I Want to See.",
  "https_www_mikecrofts_com_/https_www_mikecrofts_com_biography-policy-focus/content_5.html": "My Focus Areas\nEconomic Security for our Communities\nFair pay and pensions for all. Staunch advocate for developing Green Energy in the UK and making the transition affordable.\nSocial Justice\nStringent protection of public services and advocacy for the NHS. Lobby for an overhaul strategy of community social care.\nThe Environment\nAbsolute commitment to UK carbon net zero and ensuring we continue to lead globally. .\nCriminal Justice Reform\nA focus on tackling the turnstile effect of the Prison system and a focus on rehabilitation to reduce reoffending.\nYouth Engagement\nUtilise personal experience to enhance youth engagement.\nSupport refunding of Youth Centres and Youth Mental Health Services. Enhanced support for SEN provision in schools.\nExperience\nBritish Army\n2008-2016\nMy commitment to public service was honed as a Regular Officer in the British Army, where I completed 2 frontline tours of Afghanistan as a Captain. During my service I completed a Masters in Strategy & Security at Exeter University and also held the position of Adjutant, a senior Captain's role. On leaving Regular Service I transferred to the Reserves where I am now a Squadron Leader in a recconaissance unit.\n3Pillars Project\n2016-\nThe lessons I learned as a leader in the Army, led me to found 3Pillars Project, a charity that rehabilitates young people in custody. We work with young people on release from prison and those drawn into County Lines in the Midlands and the South East. The charity is beacon of hope for many, and the project is direct proof that, with strong leadership and a passionate belief in change, we can create new and innovative solutions to time old problems.\nLeading Purpose\n2020-\nLeading Purpose was established as a purpose led leadership practice, supporting business to re-establish positive working environments after Covid. Leading Purpose exists to enhance the leadership and performance of companies by supporting teams to flourish with accredited leadership, management, coaching and mentoring training.",
  "https_www_mikecrofts_com_/https_www_mikecrofts_com_post_podcast-veterans-in-politics/content_4.html": "Podcast: Veterans in Politics Mike CroftsAug 8, 20231 min readListen to Mike talk to Jonny Ball, why our public services need more Veterans in Politics.The Veterans in Politics Podcast: Mike Crofts",
  "https_www_mikecrofts_com_/https_www_mikecrofts_com_post_your-title-what-s-your-blog-about-1/content_3.html": "Mike Crofts in The Independent Mike CroftsAug 8, 20231 min readLeadership, Politics, Community and ServiceAs a veteran of the British Army and Charity Leader, I regularly contribute on current affairs opinions pieces. Specialist areas include leadership, foreign affairs, military and security matters, criminal justice and community cohesion.Mike Crofts in The Independent",
  "https_www_mikecrofts_com_/https_www_mikecrofts_com/content_1.html": "About Me\nI believe passionately in public service. From serving 8 years in the British Army, including two tours of Afghanistan, to founding the criminal justice charity 3Pillars Project in 2016, to deliver long-term rehabilitation programmes for young people in custody.\nMy family have deep ties to the West Midlands that go back centuries, the region is a key part of who we are. Service to our communities has been central to our family, working in hospitals and schools, with a clear commitment to seeing the region thrive. With your help, I want to continue this service.\nI have the privilege to run a criminal justice charity that rehabilitates young people in custody. Every day I see the impact that poor investment in public services has on the frontline. I see the impact of failing public transport that isolates communities. I see the impact of the climate emergency and flooding on our region. These are the key reasons why I believe in engaging in local politics.\nLeadership in public service is about consensus building but also the ability to fully represent our interests and work for economic stability and public service investment. We need representatives with a relentless commitment to the Net Zero energy transition.\nService & Leadership\nService to others comes first. Through my experiences in the Army and through running a charity, I've experienced some challenging tests. These have reaffirmed my belief in who I am and what I offer, as well as giving me a clear sense of the type of leadership I believe in as a public servant. I am determined, I am resilient and, most importantly, care about the future of others.\nThrough my work in the Army and in criminal justice, I have seen progress stall over the last decade on numerous fronts. We must continue to advocate for positive change. We are in a period of opportunity to create real and lasting improvement in people's lives.\nMy policy focuses are:\n-\nEconomic security for people on low pay and pensions\n-\nSocial justice and protection of our public services and transport\n-\nEnvironmental and ecological action - NOW!\nMy lived experiences and my commitment to the task at hand make me well equipped to deliver on these policy focusses. I have campaigned tirelessly for criminal justice reform since leaving the Army and established a successful charity working with some of the most disadvantaged young people in the country.\nI believe that government, communities and the most advantaged in society have a responsibility to support those who face the greatest challenges. In short, this is why I believe in community service.\nHow can you help?\nLet's build a movement that brings about real change and positive opportunity. Let's rebuild the proper service in our communities and the power to make a change at a local level.\nI am always excited to speak to people about endorsements and nominations, meeting people and support. Please contact me, so that we can speak; I welcome the opportunity to speak at any length. Please also feel free to get in touch directly.\nI am happy to answer any questions that you submit below - I'd love to hear from you.",
  "https_www_mikecrofts_com_/https_www_mikecrofts_com_blog/content_2.html": "top of page\nSearch\nPodcast: Veterans in Politics\nListen to Mike talk to Jonny Ball, why our public services need more Veterans in Politics. The Veterans in Politics Podcast: Mike Crofts\nMike Crofts\nAug 8, 20231 min read\n2 views\n0 comments\nMike Crofts in The Independent\nLeadership, Politics, Community and Service As a veteran of the British Army and Charity Leader, I regularly contribute on current...\nMike Crofts\nAug 8, 20231 min read\n11 views\n0 comments\nRed Bull: Mike Crofts - The Change I Want To See\nRead about Mike's work in the Criminal Justice System Exploring prison reform through sports based mentoring. I've long believed in the...\nMike Crofts\nAug 8, 20231 min read\n3 views\n0 comments\nbottom of page"
}