{
  "https_erichodgsonreform_uk_/https_erichodgsonreform_uk_my-politics/content_9.html": "My Politics:\nMy Politics\nI come originally from a ‘blue wall’ seat which was a safe Labour seat for years. Unlike Barnsley though, it changed to Conservative in 2019 but has now gone back to Labour, along with a boundary change to help it on its way. So, I have exposure to both Labour and Conservative policies and have voted for both in the past.\nNot any more though! Like millions of voters, I identify with the key aims, objectives and policies of Reform UK, who I joined 18 months ago. Straightforward, common sense policies are what I prefer. The net zero policies currently being implemented by Labour are pushing up bills, damaging British industries like steel and farming, and making us less energy secure.\nWe can protect our environment with more tree planting, more recycling and less single use plastics. New technology will help, but we must not impoverish ourselves in pursuit of unaffordable, unachievable global CO2 targets. 1 Small Modular Reactor would be capable of powering the whole of South Yorkshire! I prefer that approach to taking farming land for solar panels and obliterating the landscape with wind farms built from turbines, all made in China.",
  "https_erichodgsonreform_uk_/http_erichodgsonreform_uk_about-me/content_8.html": "I live in Dodworth with my wife.We have three children who left home a long time ago to pursue their own careers. We have 5 grandchildren.I have lived in Dodworth for the last 9 years, and the wider Parliamentary constituency of Penistone and Stocksbridge since 1986.So, I am very familiar with the area.\nIn my spare time, I enjoy looking after those grandchildren who are still at school locally.To relax I play golf, enjoy cooking, and read mainly crime fiction.\nI am self employed as a Sales Agent in Fintech, helping Small to Medium business take payments for their goods and services and providing till systems for hospitality and retail businesses.",
  "https_erichodgsonreform_uk_/http_erichodgsonreform_uk_faqs/content_6.html": "Faq's\nReform UK is a political party less than 3 years old. We are currently polling very close behind the Conservative Party in the UK, ahead of the Lib Dems and the Greens.\nIn our view this is because we represent the views of so many people in the UK. Reform UK says what people are thinking.\nIf we can get a handful of MP’s elected in the next General Election it will give millions of people a voice across the UK.\nBy having a voice in Westminster, Reform UK can hold to account any Government that is in place. Putting pressure on decisions made and speaking out for what many people are thinking.\nThis willhelp our party to grow membership and support through common sense policies.\nYou may want to simply join Reform UK. You may want to help our candidates to campaign, or you may even want to apply to be a Reform UK candidate yourself.\nVisit the Reform Party HERE\nJoin Reform UK...\nBritain needs Reform, and Reform UK needs you – enquire now and help save our country\nConsidering Defecting?\nMember of another political party considering defecting, get in touch\nMiners Pensions\nReform UK support in full all of the recommendations in the BEIS Miners Pension Report",
  "https_erichodgsonreform_uk_/http_erichodgsonreform_uk_my-politics/content_5.html": "My Politics:\nMy Politics\nI come originally from a ‘blue wall’ seat which was a safe Labour seat for years. Unlike Barnsley though, it changed to Conservative in 2019 but has now gone back to Labour, along with a boundary change to help it on its way. So, I have exposure to both Labour and Conservative policies and have voted for both in the past.\nNot any more though! Like millions of voters, I identify with the key aims, objectives and policies of Reform UK, who I joined 18 months ago. Straightforward, common sense policies are what I prefer. The net zero policies currently being implemented by Labour are pushing up bills, damaging British industries like steel and farming, and making us less energy secure.\nWe can protect our environment with more tree planting, more recycling and less single use plastics. New technology will help, but we must not impoverish ourselves in pursuit of unaffordable, unachievable global CO2 targets. 1 Small Modular Reactor would be capable of powering the whole of South Yorkshire! I prefer that approach to taking farming land for solar panels and obliterating the landscape with wind farms built from turbines, all made in China.",
  "https_erichodgsonreform_uk_/https_erichodgsonreform_uk_constituency-info/content_2.html": "List your constituency main towns and villages\n1\n2\n3\n4\n5\n6\n7\n8\n9\nWe need your support, Become a Party Member or offer your support\nFollow the Barnsley Facebook page for local info and daily updates",
  "https_erichodgsonreform_uk_/https_erichodgsonreform_uk_contact-2/content_7.html": "Contact me by email at enquiries@erichodgesreform.uk\nBy mobile on 07581 508653\nBy Whatsapp +44 7581 508653",
  "https_erichodgsonreform_uk_/https_erichodgsonreform_uk_about-me/content_4.html": "I live in Dodworth with my wife.We have three children who left home a long time ago to pursue their own careers. We have 5 grandchildren.I have lived in Dodworth for the last 9 years, and the wider Parliamentary constituency of Penistone and Stocksbridge since 1986.So, I am very familiar with the area.\nIn my spare time, I enjoy looking after those grandchildren who are still at school locally.To relax I play golf, enjoy cooking, and read mainly crime fiction.\nI am self employed as a Sales Agent in Fintech, helping Small to Medium business take payments for their goods and services and providing till systems for hospitality and retail businesses.",
  "https_erichodgsonreform_uk_/https_erichodgsonreform_uk/content_1.html": "I'm Eric Hodgson, Reform UK Candidate for Dodworth, Barnsley. Britain is in a bit of a state! 14 years of Conservative mismanagement is quickly being eclipsed by a few short months of Labour disaster.\nWe’re heading for increased inflation and economic recession.\nBusiness and personal confidence is at an all-time low:\nThe highest levels of taxation, duties and levies since the 2nd World War\nExtra 2% NI costs for employers which will lead to job losses, price increases and increased prices on the shelves\nProposed 5% increase in Council Tax\nStatic levels of Personal Allowance, moving even more people into the tax brackets\nNearly 10 Million people on benefits – that’s\nWith the prospect of another 4 and a half years of this government, we cannot change these things nationally, but together we can change national politics from a grassroots level. Politics begins at local levels.\nI live in Dodworth. If elected I promise to support all residents to the best of my ability. Put your trust in me and I promise to do everything that I possibly can to help people in Dodworth.\nVote Eric Hodgson Vote Reform UK on 12th December, 2024",
  "https_erichodgsonreform_uk_/https_erichodgsonreform_uk_contact/content_3.html": "Eric Hodgson – Reform UK Candidate - Dodworth Ward Council By-Election December 2024\nHome\nAbout Me\nMy Politics\nFaq’s\nWard Info\nContact\n✕\nHome\nAbout Me\nMy Politics\nFaq’s\nWard Info\nContact\nHome\nAbout Me\nMy Politics\nFaq’s\nWard Info\nContact\n✕\nHome\nAbout Me\nMy Politics\nFaq’s\nWard Info\nContact\nContact Details\nTo Email Me Please Fill Out the Form\n+44 123321123321\nFirst Name\n*\nEmail Address\n*\nPhone Number\nMessage\n0 / 180\nSend Message"
}