{
  "https_andyfarmer_org_uk_elections/https_andyfarmer_org_uk_business-via-linkedin/content_2.html": "Join 8,000+ others and follow Andy on LinkedIn\nAndy specialises in disruptive innovation and high-impact change. Focused on helping the UK government to fix complex systems by using emerging technologies. https://www.linkedin.com/in/andyfarmer-techology/\ncampaigns@andyfarmer.org.uk\n© 2025 Andy Farmer. All rights reserved.",
  "https_andyfarmer_org_uk_elections/https_andyfarmer_org_uk_andy-farmer-campaigning/content_4.html": "Fact-based campaigning for improvements\nOutside of his day-job, Andy undertakes pro bono campaign work for social issues that need a data-driven, fact-based approach whilst also being politically aware.\nNew campaign suggestions are welcomed (with the caveat that Andy will only campaign for issues that he believes in).\nCampaign principles\nCampaign goals must improve society in some way.\nCampaign approach is data-driven and fact-based.\nAll aspects of the Campaign must consider the narratives for each of the main political parties in the UK.\n→\nDo you have a campaign suggestion?\nCampaigning for Improvements\nAndy's pro bono campaigns bring together motivated people from the private sector and the public sector to create balanced, impactful campaigns that improve society for everyone.\nData-driven and extensively fact-checked\nAll aspects of campaigns are fact-checked and by using a diverse mix of data and tools, campaigns uncover valuable insights that help overcome political barriers and bias.\nPublic and Private Collaboration\nHistory has shown that when highly motivated people collaborate, they can 'move the needle' on society. There are highly motivated people across the public and private sectors - the most effective campaigns bring these people together to focus on a common issue.\nAll-Party Political Approach\nEvery campaign is politically aware and considers the narratives for each of the main political parties in the UK, from the 'left' and from the 'right'. This helps to navigate political landscapes and helps to keep campaigns fair, balanced, pragmatic and effective.\nAndy Farmer effectively unites diverse groups to drive impactful societal changes through balanced campaigns.\nJohn Doe\n★★★★★\nCampaign Reviews\nSee what our supporters say about Andy Farmer's impactful campaigns.\nAndy's balanced approach truly unites diverse perspectives for meaningful change.\nJohn Smith\nLondon UK\nWorking with Andy has been transformative; his ability to bridge divides is remarkable.\nEmily Jones\nBristol UK\n★★★★★\n★★★★★\ncampaigns@andyfarmer.org.uk\n© 2025 Andy Farmer. All rights reserved.",
  "https_andyfarmer_org_uk_elections/https_andyfarmer_org_uk/content_3.html": "Campaigner in Cirencester, UK.\nYou can find out more about Andy's business background via LinkedIn.\nAndy undertakes pro bono campaigns that drive improvements to society.\ncampaigns@andyfarmer.org.uk\n© 2025 Andy Farmer. All rights reserved.",
  "https_andyfarmer_org_uk_elections/https_andyfarmer_org_uk_elections/content_1.html": "Next Election: Gloucestershire County Council Elections\nI am the Labour Party candidate for Cirencester Park in the local elections on Thursday 1st May 2025.\nRaising living standards for the people of Cirencester.\nWe need better local services and more opportunities for well-paid work - I have identified ways that will help the proposed Innovation Village at the Royal Agricultural University become a reality, faster.\nRead about the RAU Innovation Village here: https://www.rau.ac.uk/innovationvillage\nCirencester families need more REALLY affordable housing to rent or buy.\nI am working locally to find small-scale sites instead of large-scale sites full of £1m+ homes where affordable housing is a hidden-away afterthought.\nBring the Pothole Machines to Cirencester.\nThe Labour government has just given £1.6bn of extra pothole funding to County Councils. Pothole Machines can fix roads faster and the County Council trialled them here last year - I am working to bring them back.\nYou can read about the GCC Pothole repair machine here: https://www.bbc.co.uk/news/articles/c4g94572502o\nand here: https://www.gloucestershire.gov.uk/roads/spring-pothole-repairs/?topic_id=UKGLOUCESTERSHIRE_123\nThe County Council's current road surfacing schedule is here: https://www.gloucestershire.gov.uk/resurfacing/\nLabour's new £1.6bn funding criteria: https://www.gov.uk/government/news/pm-tells-councils-to-prove-action-on-pothole-plague-to-unlock-extra-cash-and-reveals-48bn-for-major-roads\nRural workers & Rural way of life.\nI am exploring opportunities to help grow our rural economy and get a better deal for our rural workers – including those that rely on public transport and those working in low-income rural industries such farm workers and equestrian workers.\nCirencester needs more activities for our young people.\nI have identified new sites for activities like indoor climbing, Padel, badminton and more. I am working on funding applications to make these a reality.\nLocal services that create more value for Cirencester residents.\nI am pushing the Labour government on how they can use technology to improve our local services; to become more effective at creating value for local residents, whilst also reducing unnecessary local bureaucracy. My current focus is improvements in planning, taxation and regulation.\nThis page is promoted by Steve Lydon (Labour Party) on behalf of Andy Farmer (Labour Party), both of Furzen Leaze Farm, Cirencester, GL7 6QA.\nIf you want any of these to happen faster - vote FARMER.\ncampaigns@andyfarmer.org.uk\n© 2025 Andy Farmer. All rights reserved."
}