{
  "https_www_reformbarnet_uk/https_www_reformbarnet_uk/content_1.html": "Help us campaign today for a better tomorrow!\nHelp us campaign today for a better tomorrow!\nWe believe that Barnet urgently Needs Reform! Help us make the change that Barnet so desperately needs.\nJoined Reform UK in December 2024 after 15 years as a conservative councillor and activist. Pledge to campaign endlessly to return a reform uk government in 2029 or before. I was Mayor of Barnet 2015-2016, and had senior roles on the council in pensions, planning, schools and scrutiny. Professionally I studied actuarial science, worked as\nJoined Reform UK in December 2024 after 15 years as a conservative councillor and activist. Pledge to campaign endlessly to return a reform uk government in 2029 or before. I was Mayor of Barnet 2015-2016, and had senior roles on the council in pensions, planning, schools and scrutiny. Professionally I studied actuarial science, worked as a hedge fund manager in the city until 2010 before venturing into real estate. Married to Melissa almost 30 years with 5 kids, born in Edgware and lived in Hendon for the last 40 years. Played for Middlesex Under 17s Cricket and school chess captain. reform barnet reform uk barnet branch burnt oak\nBorn in North London, Lisa is married, has one son, and has a Greek Cypriot heritage. Lisa’s working career has been mostly in banking and litigation work. Lisa brings 16 years of experience as former Councillor and Mayor of the London Borough of Barnet in 2012. She is well known in the community as a trusting, reliable, hard-working pers\nBorn in North London, Lisa is married, has one son, and has a Greek Cypriot heritage. Lisa’s working career has been mostly in banking and litigation work. Lisa brings 16 years of experience as former Councillor and Mayor of the London Borough of Barnet in 2012. She is well known in the community as a trusting, reliable, hard-working person who understands peoples’ concerns and will not give up easy. She has an excellent reputation in speaking up and representing her residents. She was instrumental in getting the 383 Bus service for Finchley Memorial Hospital after working with TFL for 3 years. Her work as Founder and Chairman of her registered charity Dementia Club UK has also helped many people with dementia and their carers and families giving them another lifeline.\nReform Barnet Reform UK Barnet branch. Finchley Church End\nAdrian is originally from Yorkshire and has been living in the Totteridge / Whetstone for 7 years now. He runs his own company that specialises in helping company grow by providing sales and marketing strategies to help them.\nHe has been in industry for 30 years and led several highly successful companies before starting out on his own.\nHe\nAdrian is originally from Yorkshire and has been living in the Totteridge / Whetstone for 7 years now. He runs his own company that specialises in helping company grow by providing sales and marketing strategies to help them.\nHe has been in industry for 30 years and led several highly successful companies before starting out on his own.\nHe is passionate about lighting and wants to make Whetstone a safer place at night for all residents. He is a keen runner and completed the London Marathon in 2022. The family dog Marley is registered as a PET Therapy dog and they regularly attends care homes together to help the community.\nDanny is a young, driven entrepreneur currently developing a media platform covering the advancements of AI in medicine. Formerly, Danny ran Future Science Group, a medium-sized scientific publishing firm focused on quality peer-reviewed journal distribution and improving health literacy. He is a graduate of the Master’s in Technology Pol\nDanny is a young, driven entrepreneur currently developing a media platform covering the advancements of AI in medicine. Formerly, Danny ran Future Science Group, a medium-sized scientific publishing firm focused on quality peer-reviewed journal distribution and improving health literacy. He is a graduate of the Master’s in Technology Policy from the University of Cambridge and the bachelor’s in International Relations from King’s College London. Danny is passionate about foreign policy, tackling crime and ensuring technology is implemented responsibly and safely for all.\nHamish Haddow represented the Reform UK party as the Parliamentary candidate for Chipping Barnet and is the Branch Chairman for Barnet. Hamish Haddow is a family man from Hertfordshire, with 30 years of experience in IT management and a business degree. Passionate about addressing local issues, he advocates for increased police presence,\nHamish Haddow represented the Reform UK party as the Parliamentary candidate for Chipping Barnet and is the Branch Chairman for Barnet. Hamish Haddow is a family man from Hertfordshire, with 30 years of experience in IT management and a business degree. Passionate about addressing local issues, he advocates for increased police presence, infrastructure repairs, and the safety of Barnet's community. Hamish Haddow campaigned focusing on creating a safer, more inclusive environment for all residents by tackling crime, improving patriotic values, reducing migration, and restoring national accountability. Reform UK Barnet Branch. Reform Barnet. Barnet Needs Reform\nSury is a former Barnet Councillor who represented Mill Hill Ward from 2010 to 2018 and was Deputy Mayor of Barnet for 2016 – 2017 year. In October 2017 Sury was awarded the Freedom of the City of London. Sury has been in the UK since 1962 having emigrated from India and in Barnet since 1964 and has since 1977 been residing in Mill Hill\nSury is a former Barnet Councillor who represented Mill Hill Ward from 2010 to 2018 and was Deputy Mayor of Barnet for 2016 – 2017 year. In October 2017 Sury was awarded the Freedom of the City of London. Sury has been in the UK since 1962 having emigrated from India and in Barnet since 1964 and has since 1977 been residing in Mill Hill and holds a Post-Graduate Master’s Degree in Nuclear Physics from the University of London.\nSury is an ex-Civil Servant having spent some 3 1/2 decades at the Export Credits Guarantee Department until retiring in 2006 and since then devoted his time including Councillor duties to voluntary activities e.g. as Trustee of Charities, Governor at 4 local Mill Hill Schools, helping local organisations etc. Sury has a close interest in continuing to work helping residents and hopes to be able to apply his varied experience to the work of the Local Authority.\nIn March 2024, the Honourable Mayor of Barnet honoured Sury by presenting him with a Certificate Scroll of Recognition for ris Outstanding Service to the Barnet Community.Reform UK Barnet Branch.\nPlease reach us at chair.barnet@reformuk.com if you cannot find an answer to your question.\nSimply go to https://www.reformparty.uk/join and click Become a member!\nOr if you are Under 25 years old, click Become an Under 25 member!\nWe are currently recruiting for the 2026 Elections. We are looking for 63 Ward candidates across the 3 constituencies. Please do not hesitate to sign up.\nIf you are keen to be a ward candidate, please complete this application form: https://www.reformparty.uk/apply\nOnce you have completed this form or have any questions, please email chair.barnet@reformuk.com and you will be added to the Barnet Ward Candidates WhatsApp group.\nWe Urgently need donations!\nPlease help us as a lot goes into organising these elections and every single penny helps and is appreciated."
}