{
  "https_stoptherot_vote_/https_stoptherot_vote_my-priorities/content_3.html": "For too long, the old Lincolnshire establishment has let us down. Under Martin “Down” Hill OBE and his outdated leadership, council tax has gone up, but our roads and public services have gone nowhere. It’s time to put an end to 20 years of crumbling infrastructure, empty promises, and wasted potential.\nPriority 1: Shake up Lincolnshire Establishment\nLet’s shake up the Lincolnshire establishment. Elect me, and I’ll fight for your concerns with energy, break the rotten status quo, and provide a One Week Guarantee to respond to your concerns. I’ll be open and easily reachable by phone, email, and social media. click for more details\nPriority 2: Stop Wasting Taxpayers Money\nStop wasting taxpayer money: I'll hold contractors, Local Government Officials, and Councillors accountable for every penny squandered on consultants, expenses, or inflated contracting arrangements. And I won't claim a single expense. click for more details\nPriority 3: Make Westminster Pay for Flood Defences\nFlooding is a countywide crisis, and we need urgent action. I’ll work with everyone across Lincolnshire to demand proper funding from central Government and hold companies accountable for contributing to flooding risks:\nCollaborating with the Community: I’ll work with residents to develop a local action plan that we can present to the County Council, ensuring resources and expertise are delivered quickly.\nMake Westminster Pay for Flood Defences: No more endless tax rises to fund flood defences that are draining people’s pockets. We want a long-term solution paid for properly by central Government. click for more details\nPriority 4: No More Botched Potholes\nSince 2010, Lincolnshire hasn’t been birthing babies—it’s been birthing potholes! With 180,000 reported compared to 105,000 births, that’s nearly two potholes for every person. I’ll hold road repair companies accountable and ensure durable solutions to fix this mess! click for more details",
  "https_stoptherot_vote_/https_stoptherot_vote_shake-up-lincolnshire-establishment/content_12.html": "Shake up Lincolnshire Establishment\nLet’s shake up the Lincolnshire establishment. Elect me, and I’ll fight for your concerns with energy, break the rotten status quo, and provide a One Week Guarantee to respond to your concerns. I’ll be open and easily reachable by phone, email, and social media.\nOne Week Guarantee: I’ll respond quickly, politely and do my best to get you a good result.\nYour voice first: I’ll be visible in the area, online, and in the media, always putting your concerns above party politics. I’ll vote independently to ensure your voice is heard and your priorities are represented.\nFair Deals: I’ll use the media and social media to call out bad deals and help residents understand where their money is going.",
  "https_stoptherot_vote_/https_stoptherot_vote_no-more-botched-potholes/content_6.html": "No More Botched Potholes\n21st Century Roads—That Would Make Even the Romans Jealous\nBad roads cause accidents, cost lives, and disrupt our economy. Our businesses need to trade without the extra pressure and costs from damaged tyres, especially small and medium-sized businesses.\nNo more botched potholes: We need roads fixed properly, not with quick patches that crumble at the first sign of wear. Let’s hold companies accountable for shoddy works.\nFair and transparent contracting: Stopping the rot means making the tendering process open and transparent. I’ll hold companies publicly accountable to ensure they deliver the quality we’re paying for.\nMake Westminster Pay: Work with all political parties, businesses, and community groups in Lincolnshire to ensure we present a strong, united front to demand more funding from the Department for Transport. We deserve the same treatment as other councils that receive significantly more financial support than we do.",
  "https_stoptherot_vote_/https_stoptherot_vote/content_1.html": "My name is Alexander Kirk—but please, call me Kirk. I’m running as your change candidate for Folkingham Rural, with one clear mission: Stop The Rot.\nFor too long, Lincolnshire’s old establishment has failed us. Under Martin 'Down Hill' OBE, council tax has soared while roads in places like Billingborough, Horbling, Folkingham, and Rippingale have crumbled. Public services in Slackby, Laughton, and beyond have been neglected for 20 years. It’s time to stop the rot, end the empty promises, and fight for real change in our villages—from Braceby and Sapperton to Irnham, Haconby, and Pointon. Lincolnshire deserves better.\nMy Priorities\nContact Me and Arrange A Chat\nCampaign News\nI’m Taking on Lincolnshire’s Most Powerful Man – And I Need Your Help\nFor 20 years, Lincolnshire has been held back. We’ve endured rising council tax, crumbling roads, wasteful spending, and leaders who dodge accountability. Enough is enough. I’m Alexander Kirk, and I’m running to stop the rot. The Fight to Take Back Lincolnshire On May 1st, I’m standing as the Labour candidate […]",
  "https_stoptherot_vote_/https_stoptherot_vote_contact/content_4.html": "Contact Me and Arrange a Chat I’d love to meet and chat to you. Please leave your details below. Join Newsletter*NoYes Fields marked with * are required.Click to read our Privacy Policy",
  "https_stoptherot_vote_/https_stoptherot_vote_make-westminster-pay-for-flood-defences/content_8.html": "Make Westminster Pay for Flood Defences\nFlooding is a countywide crisis, and we need urgent action. I’ll work with everyone across Lincolnshire to demand proper funding from central Government and hold companies accountable for contributing to flooding risks:\nCollaborating with the Community: I’ll work with residents to develop a local action plan that we can present to the County Council, ensuring resources and expertise are delivered quickly.\nMake Westminster Pay for Flood Defences: No more endless tax rises to fund flood defences that are draining people’s pockets. We want a long-term solution paid for properly by central Government.",
  "https_stoptherot_vote_/https_stoptherot_vote_stop-wasting-taxpayers-money/content_10.html": "Stop Wasting Taxpayers Money\nDid you know Martin ‘Down’ Hill OBE has cost the taxpayer over £450,000 since 2012? Meanwhile, I won’t claim a single expense.\nIf elected, I’ll make it a priority to get the Council to review contracts—how deals are made, who benefits, and where the money’s going. We saw how contracting worked during COVID. Once I’m in, I’ll be digging into where the bad deals are and making sure we don’t get ripped off again. We can’t let this carry on. I’ll push for a fight for every penny policy with local government civil servants.\nAccountable Spending: Contractors, Local Government Officers, and Councillors should be held responsible for every penny wasted. I’ll make sure they are.\nLeading by Example: I won’t claim a single expense—because if I’m serious about saving your money, I have to start with my own.\nFight for Every Penny Policy: We’ve all heard the stories—taxpayers getting mugged off by bad deals. I’ll push for proper training for Local Government Officers and Councillors so they can go toe-to-toe with businesses that make a living out of squeezing more money from the system. I’ll make sure they’ve got the skills to fight back.",
  "https_stoptherot_vote_/https_stoptherot_vote_blog/content_9.html": "For 20 years, Lincolnshire has been held back. We’ve endured rising council tax, crumbling roads, wasteful spending, and leaders who dodge accountability. Enough is enough. I’m Alexander Kirk, and I’m running to stop the rot. The Fight to Take Back Lincolnshire On May 1st, I’m standing as the Labour candidate […]",
  "https_stoptherot_vote_/https_stoptherot_vote_privacy-policy/content_7.html": "Privacy Policy\nEffective Date: 7th February 2025\nWelcome to www.stoptherot.vote. Your privacy is important to us, and we are committed to protecting any personal information you provide. This policy outlines how we collect, use, store, and protect your data.\n1. Information We Collect\nWe collect the following personal information through our contact form:\n- Name\n- Email address\n- Message content\n2. How We Use Your Information\nWe process your personal data based on your consent (Article 6(1)(a) UK GDPR) when you subscribe to our newsletter and on our legitimate interests (Article 6(1)(f) UK GDPR) when responding to inquiries.\nWe use the information you provide to:\n- Respond to inquiries and messages.\n- Send newsletters and updates about the campaign (only if consent is given via a checkbox on the contact form).\n3. Consent and Opt-Out\n- By ticking the consent checkbox on the contact form, you agree to receive emails and newsletters related to the campaign.\n- You can unsubscribe at any time by clicking the unsubscribe link in any email you receive or by contacting kirkforfolkinghamrural@gmail.com.\n4. Data Storage and Security\n- Your information is stored securely in a Google Drive folder accessible only by authorized personnel. Google complies with UK GDPR and applies appropriate safeguards for international data transfers, such as Standard Contractual Clauses.\n- We take appropriate measures to ensure data security and prevent unauthorized access.\n5. Data Sharing\n- We do not share, sell, or distribute your personal information to third parties.\n6. Data Retention and Deletion\n- All personal data will be deleted after May 1, 2025, when the campaign ends, unless a longer retention period is required for legal reasons.\n- If you wish to have your data removed before this date, please email kirkforfolkinghamrural@gmail.com, and we will process your request promptly.\n7. Cookies and Tracking\n- Our website does not use cookies or third-party tracking software.\n8. Policy Updates\n- If any changes are made to this privacy policy, we will notify users via email (if they opted in) or post an announcement on our website.\n9. Contact Information\nYou have the right to access, correct, or delete your personal data, restrict or object to processing, and lodge a complaint with the UK Information Commissioner’s Office (ICO) at www.ico.org.uk.\nIf you have any concerns or questions about your personal data, please contact us at kirkforfolkinghamrural@gmail.com.",
  "https_stoptherot_vote_/https_stoptherot_vote_im-taking-on-lincolnshires-most-powerful-man-and-i-need-your-help/content_5.html": "For 20 years, Lincolnshire has been held back.\nWe’ve endured rising council tax, crumbling roads, wasteful spending, and leaders who dodge accountability. Enough is enough.\nI’m Alexander Kirk, and I’m running to stop the rot.\nThe Fight to Take Back Lincolnshire\nOn May 1st, I’m standing as the Labour candidate for Folkingham Rural to take on Martin “Down” Hill OBE—the man who has controlled Lincolnshire County Council for two decades.\nHe’s been in charge since 2005. To put that into perspective…\n- The iPhone hadn’t even been invented yet. We were all still using flip phones and BlackBerries to text.\n- Facebook was only for university students. The rest of us were still using MSN Messenger or updating our MySpace profiles.\n- Star Wars: Episode III – Revenge of the Sith had just hit cinemas. Since then, we’ve had three new trilogies, multiple TV series, and even Baby Yoda—yet Lincolnshire is still waiting for its leadership to move out of the past.\nThat’s how long Martin “Down” Hill has been in charge. The world has moved on, but Lincolnshire is still stuck under the same failing leadership.\nMartin ‘Down’ Hill – Will He Face Me?\nThis morning, I delivered a letter to County Hall in Lincoln, challenging Hill to a live debate, televised or broadcast on the radio.\nIf he truly believes he’s done a good job, he should have no problem defending his record in front of the people of Lincolnshire.\nIn my letter, I made it clear:\n“Your refusal to face public questioning would signal a lack of confidence in defending your record. Accepting this debate would demonstrate respect for the democratic process and the people who entrusted you with their vote for two decades.”\nNow, the challenge is out in the open. Will he show up? Or will he hide behind his 20 years of excuses?\nIt’s Time to Stop the Rot\nI’m not a career politician. I’m just fed up with seeing Lincolnshire held back. That’s why I’m running on a clear, no-nonsense plan:\n🚧 Fix Our Roads – End the pothole plague with high-quality repairs and better-value contracts.\n💰 Stop Wasting Taxpayers’ Money – No more dodgy deals, overpaid consultants, or pointless projects. I won’t claim personal expenses—because your money should go where it’s needed.\n🏠 Make Local Government Actually Work for You – You should be able to contact your councillor easily and see what’s being done. That’s why I’ll bring real transparency using social media like TikTok, Facebook, and Instagram to show what’s happening inside the council.\n🌊 Force Westminster to Pay for Flood Defences – Lincolnshire has been hit time and time again by flooding, yet the government expects us to pick up the bill. That needs to change.\nJoin the Movement – Here’s How You Can Help\nThis campaign isn’t backed by big donors or the political establishment. It’s a grassroots movement, powered by people like you.\n🔥 Follow me on social media (@stoptherot.vote) and help spread the word.\n👕 Grab a campaign T-shirt from our online shop – sales go directly towards funding our fight. The store is live now.\n📢 Talk to your friends and family – This election matters. Every conversation counts.\n📝 Register to vote – It takes 5 minutes, and it could change Lincolnshire’s future.\nThe Ball is in Hill’s Court\nThe letter has been delivered. The challenge is out in the open.\nNow, it’s up to him.\nWill Martin “Down” Hill finally face the people of Lincolnshire? Or will he do what he’s done for the past 20 years—ignore the hard questions?\nEither way, I’m not backing down. This campaign is just getting started.It’s time for a new era in Lincolnshire. It’s time to stop the rot.\nRead My Letter Here",
  "https_stoptherot_vote_/https_stoptherot_vote_terms-and-conditions/content_2.html": "Terms and Conditions for Stop The Rot Teemill Shop\nEffective Date: 7th February 2025\nThese Terms and Conditions govern the use of the Stop The Rot Teemill shop (\"the Shop\") and the purchase of products from the Shop. By placing an order, you agree to these terms.\nThe Shop is operated in partnership with Teemill. Stop The Rot is a campaign initiative supporting the Kirk for Folkingham Rural campaign and is not a separate legal entity. All transactions are processed by Teemill.\n1. Shop Operator\nThe Shop is operated in partnership with Teemill, who is responsible for:\n- The production of all products.\n- Handling and managing shipping and delivery.\nAll purchases made through the Shop are subject to Teemill’s terms of service. Stop The Rot does not process payments or hold stock. By placing an order, you are entering into a contract with Teemill, which is responsible for manufacturing, shipping, and returns.\nAs required by the UK Consumer Rights Act 2015, customers have the right to cancel their order within 14 days of receiving their items. For queries related to returns, shipping, delivery, or product quality, please contact Teemill directly via their customer service channels. You can view their terms at: https://folkingham-kirk.teemill.com/terms-of-use/\n2. Purpose of Sales\nAll profits from T-shirt sales, after Teemill’s deductions, will be donated to the Kirk for Folkingham Rural campaign to support the \"Stop The Rot\" initiative.\n3. Transparency of Funds\n- Upon request, a detailed breakdown of T-shirt sales, profits, and donation amounts will be made available.\n- Please contact votekirkforfolkingham@gmail.com to request this information.\n4. Sales Threshold\n- T-shirt sales will end once the total profits reach the campaign’s fundraising goal of £1300.\n- Updates on the sales progress and total funds raised will be shared periodically on the website.\n5. Pricing and Payment\n- Payment methods accepted are managed by Teemill and subject to their terms of service.\n6. Shipping and Delivery\n- Teemill is responsible for all aspects of shipping and delivery. Any delays, damages, or issues with the delivery must be resolved directly with Teemill.\n7. Returns and Refunds\n- Returns, exchanges, or refunds are subject to Teemill’s policies. Please review their return policy or contact their support team for assistance.\n8. Compliance with Electoral Law\n- All profits from T-shirt sales, after Teemill’s deductions, will be treated as donations to the Kirk for Folkingham Rural campaign and will be reported to the Electoral Commission where required.\n- Donations over £50 must come from a permissible UK donor and will be recorded in accordance with UK election finance rules.\n- Sales and donations will be recorded and reported in line with Electoral Commission regulations.\n- If sales exceed the campaign’s allowable spending limit, we may suspend or modify sales to comply with Electoral Commission regulations.\n9. Profit Donation\n- After Teemill’s deductions for production and shipping costs, the average donation per T-shirt sale is approximately £7.\n- All remaining profits will be donated to the Kirk for Folkingham Rural campaign.\n- Donations will be made in accordance with the timeline agreed with the campaign.\n10. Changes to the Terms and Conditions\nWe reserve the right to update these Terms and Conditions. Any changes will be posted on the website, and the \"Effective Date\" will be updated accordingly.\n11. Contact Information\nFor questions about these Terms and Conditions or the campaign, please contact:\nStop The Rot\nEmail: kirkforfolkinghamrural@gmail.com\nThank you for supporting the \"Stop The Rot\" campaign and the Kirk for Folkingham Rural initiative!",
  "https_stoptherot_vote_/https_stoptherot_vote_shop-t-shirts/content_11.html": "Show your support! All profits will go directly to the Kirk for Folkingham Rural Campaign Fund.\nAll T-Shirts are printed with low waste printing tech. Made in a renewable energy powered factory audited for a wide range of social and sustainability criteria.\nClick on the T-Shirts to get directed to my TeeMill store for colours, sizes and to order."
}