{
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org/content_2.html": "Kenilworth & Southam Labour\nA fresh start for Warwickshire\nWarwickshire County Council Elections\nWe’re looking forward to the May 2025 County Council vote, when Labour will contest every available Kenilworth & Southam seat in the County Council elections.\nOur candidates\nYou can see our candidates and plans for Warwickshire here.\nGet involved\nWe run meetings for Labour members (join here!) and discussions each month, always with a social element, plus other social events and fundraisers, but you can also get involved from the comfort of your own home.\nContact us\nYou can get in touch via FaceBook or at:",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_abbey-fields/content_10.html": "-\nKenilworth Swimming Pool progress\nNews and Comment from Labour Councillors This project is back on track, and Councillors Jim Sinnott and Chris King explain here the current state of play, and some history. Take a look at this video by Warwick District Council, presented by Chris and the Senior Project Manager, Robert Johnstone. https://www.facebook.com/share/r/1C9bP5mLLt Chris says, “We can look…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_bill/content_17.html": "-\nClosing in on Tory fraudsters\nPublic Authorities (Fraud, Error and Recovery) Bill Yesterday, 4th February 2025, this Bill passed its second reading and so has now entered the Committee Stage. It will create new powers to investigate suspected fraud against public bodies, recover owed money, and take action against offenders. Powers include compelling organisations to provide information and allowing authorised investigators to enter and search…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_fraud/content_16.html": "-\nClosing in on Tory fraudsters\nPublic Authorities (Fraud, Error and Recovery) Bill Yesterday, 4th February 2025, this Bill passed its second reading and so has now entered the Committee Stage. It will create new powers to investigate suspected fraud against public bodies, recover owed money, and take action against offenders. Powers include compelling organisations to provide information and allowing authorised investigators to enter and search…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_2025_02_26_the-conservatives-a46-bridge-to-nowhere/content_20.html": "The A46 Stoneleigh Junction project near Kenilworth, managed by the Conservative-led Warwickshire County Council, was to be completed in summer 2022 for £38 million, but as of February 2025 it is unfinished and an embarrassment to local people, who are calling it the “Bridge to Nowhere”. And the cost will probably be over £50 million.\nIn January 2025, a Conservative Councillor accidentally disclosed that an additional £16 million had been allocated to the project. Labour Councillor John Holland says, “The original design just cannot be done. It is financial mismanagement, but it is a result of their absence of strategy.”\nJohn explains that the original project was not defined properly, saying, “The lack of a well-defined and realistic plan means that it is costing more money to put it right.“\nThe project aimed to alleviate congestion by constructing a second bridge to form a new roundabout. “That’s obviously pretty important, but the failure to deliver has other consequences too,” says John.\nThe Eastern Bypass around Coventry moved traffic congestion southwards, so this expensive hiatus also makes it harder to plan for the necessary development of new houses in that area. That has consequences for ordinary people, jobs, and the local economy.\nCouncillor Sarah Feeney, leader of the Labour group, described a lack of competence saying, “We are constantly talking about highways problems.” She asks for a more collaborative approach to address these persistent issues.\nThe Conservative leadership blames challenges in sourcing appropriate materials and ongoing disputes with contractors. John Holland takes a different view, “Like I say, it is a result of failure to plan properly.”\nThe Conservatives have not been able to defend the management of the project, the financial over-run, and the fact that it is completely stalled.\nMeantime, local residents are left to sit in traffic and pick up the bill.\nphoto credit: Google Earth\nLeave a comment",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_category_local-news/content_15.html": "-\nThe Conservatives’ A46 Bridge to Nowhere\nThe A46 Stoneleigh Junction project near Kenilworth, managed by the Conservative-led Warwickshire County Council, was to be completed in summer 2022 for £38 million, but as of February 2025 it is unfinished and an embarrassment to local people, who are calling it the “Bridge to Nowhere”. And the cost will probably be over £50 million.…\n-\nKenilworth Swimming Pool progress\nNews and Comment from Labour Councillors This project is back on track, and Councillors Jim Sinnott and Chris King explain here the current state of play, and some history. Take a look at this video by Warwick District Council, presented by Chris and the Senior Project Manager, Robert Johnstone. https://www.facebook.com/share/r/1C9bP5mLLt Chris says, “We can look…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_kenilworth/content_19.html": "-\nThe Conservatives’ A46 Bridge to Nowhere\nThe A46 Stoneleigh Junction project near Kenilworth, managed by the Conservative-led Warwickshire County Council, was to be completed in summer 2022 for £38 million, but as of February 2025 it is unfinished and an embarrassment to local people, who are calling it the “Bridge to Nowhere”. And the cost will probably be over £50 million.…\n-\nKenilworth Swimming Pool progress\nNews and Comment from Labour Councillors This project is back on track, and Councillors Jim Sinnott and Chris King explain here the current state of play, and some history. Take a look at this video by Warwick District Council, presented by Chris and the Senior Project Manager, Robert Johnstone. https://www.facebook.com/share/r/1C9bP5mLLt Chris says, “We can look…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_category_national-news/content_18.html": "-\nClosing in on Tory fraudsters\nPublic Authorities (Fraud, Error and Recovery) Bill Yesterday, 4th February 2025, this Bill passed its second reading and so has now entered the Committee Stage. It will create new powers to investigate suspected fraud against public bodies, recover owed money, and take action against offenders. Powers include compelling organisations to provide information and allowing authorised investigators to enter and search…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_team/content_4.html": "We’re a group of people with all sorts of backgrounds and interests, but united in support of Labour Party principles of democratic socialism. We are organised as a Constituency Labour Party with a number of Branches and Groups. Contact us.\nConstituency Labour Party Officers\nNicola Jones – Chair\nRachel Frenguelli – Secretary\nSarah Purdy – vice-chair\nKeith Thompson – Policy\nJolene Tan – Education\nPeter Scott – Comms & Digital\nCandidates\nSee Elections for photos and bios of our candidates",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_elections/content_1.html": "Warwickshire County Council Elections May 1st 2025\nLabour’s plan for Warwickshire\nFix the roads and potholes\n- Our roads have been neglected for too long under the Conservatives.\n- Potholes dominate our streets and pavements have been left in a complete mess.\n- The Labour government is investing £25.4 million in Warwickshire to fix our\nroads and footpaths.\nGrow our local economy and support businesses\n- The Conservatives have ruined our economy, we are the only country in the G7\nwho have not recovered from Covid. Our towns and villages have lacked\ninvestment. - Labour are working with businesses to deliver investment into every corner of\nour county. - 20.8% of adults in Warwickshire are economically inactive. We’ll get more\npeople into work and make work pay.\nReturn law and order to our streets\n- The Conservatives legacy on crime is criminals let off and victims let down.\n- The Labour government will recruit 13,000 new extra police officers, and under Labour every neighbourhood in Warwickshire will have a named police officer they can contact.\n- We’ll tackle drug dealing, off road bikes and give out tougher sentences for offenders.\nDeliver reliable public transport that gets you where you need to be\n- The Labour government is investing £1 billion pounds into our bus network. We’ll deliver a reliable bus system that better connects our towns and villages.\n- The renationalization of our railways has begun, GB Rail will get our trains moving on time and more frequently.\n- We’ll promote safer active travel including better foothpaths and cycle lanes.\nBetter opportunities for our children including better SEND provision\n- The Labour government is beginning it’s roll out of free breakfast clubs, and Warwickshire schools are being encouraged to apply.\n- We’re investing £740 million in our schools to create more specialist places in mainstream schools.\nWe can work better for residents given more representation at all levels of government. Please get in touch to tell us what matters to you and your family and what you would like to see changed.\nOur Candidates\nJenny Bevan for Budbrooke and Bishop’s Tachbrook\nBudbrooke and Bishop’s Tachbrook has been Jenny’s home for 20 years. She is committed to listening to the community, ensuring every voice is heard, and delivering strong local representation to improve public services.\nJeremy Eastaugh for\nKenilworth St John’s\nSt John’s is Jeremy’s home he’s lived there 30 years, Jeremy says that local people deserve to be well represented and that he is committed to ensuring their concerns are addressed.\nSarah Purdy for Kenilworth Park HIll\nLong time Kenilworth resident and NHS neurological rehabilitation Speech and Language Therapist. I want to hold the Tory led County Council to account for wasted money and broken promises. We all deserve better services for children with specific needs, joined up health and social care, effective infrastructure planning and safer, greener transport.\nBruno Frenguelli for Kineton & Red Horse\nA Kenilworth resident for over 15 years, I will support colleagues who want to prioritise services and education for children, have health and social care that is integrated and delivers for patients and their families, and deliver affordable and low-carbon housing and greener transport options.\nDavid Spillane for Wellesbourne\nI have lived in Kenilworth with my family for the last thirty-seven years. My priorities are to improve the services for Warwickshire across all age groups including our elderly and vulnerable needing health services and social care, and for effective travel and planning decisions to ensure a safe and greener environment for everyone.\nNicola Jones for Dunsmore & Leam Valley\nI have lived in Warwickshire for 28 years, raising my family and running a business. I will put the needs of people and communities first, whether that’s filling pot-holes or reducing NHS waiting times. Local representation should work alongside national government to get Warwickshire get the best possible deal.\nTrevor Dutton for Southam, Stockton and Napton\nA retired engineer and long-term South Warwickshire resident, my priorities are to reverse the years of failing services and wasted money under the Tory led County Council. We need joined-up health and social care services that are needed to support the people in our community, and transport infrastructure that is safe, environmentally beneficial and properly planned to ensure it is suitable for all.\nKevin Purdy for Lapworth and West Kenilworth\nOriginally from Leamington and living in Kenilworth. I’m standing to help deliver real change in the County Council, reversing deteriorating services and stop wasting money. We need to support vulnerable people in our community as well as implement effective infrastructure planning and the safer, greener transport that we all want.",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_2025_02_04_kenilworth-pool-progress/content_7.html": "News and Comment from Labour Councillors\nThis project is back on track, and Councillors Jim Sinnott and Chris King explain here the current state of play, and some history.\nTake a look at this video by Warwick District Council, presented by Chris and the Senior Project Manager, Robert Johnstone. https://www.facebook.com/share/r/1C9bP5mLLt\nChris says, “We can look forward to having a wonderful facility here. The residents of Kenilworth and of the district have been waiting for a long time, and we are really proud as a District Council to be bringing this forward.”\nThere has been a complicated piling process to protect the enormous heritage value underground. It’s a difficult technical construction project, and from the outside of the site that can’t be seen.\nRobert Johnstone notes that at the end of February 2025 they should be starting to create the frame; sometimes people do not appreciate how much work goes into groundworks.\nA little history\nJim Sinnott, District Councillor and Portfolio holder for Safer, Healthier & Active Communities says, “There was a lot of push-back when we were conceiving this essential project. The Tories were against it, and the Lib Dems on the fence. We’re in coalition with the Greens and they have kindly supported us.”\nPeople often ask about the increasing costs and say it should have been obvious that it would be an archaeological site.\nAerial shot of the pool as of early February 2025\nIt’s quite right of course that Abbey Fields is going to have cultural and historical relics underground, but it was also obvious that the most sensible place to dig was under the existing pool buildings. Unfortunately, the contractors and planners in the 1980s did not have our focus on protecting archaeology. “It was a bit of a hospital pass,” says Jim. “We could either give up, or knuckle down and deliver a facility that Kenilworth needs, and something that the district can be proud of.”\nWe also know that Sport England specifies what we should have for our local population and demographic, and the new pools will deliver that. Cllr Sinnott adds, “it was our duty, and it was the right thing to do.”\nThe Tories complain about the expense, while paying an extra £16 million on a bridge to nowhere over the A46. Meanwhile, parents in Kenilworth have to travel with their kids for swimming lessons. Cllr Sinnott says, “Newbold Comyn and St. Nicks have great facilities; we have gone for excellence in Kenilworth too.”\nIt’s just not true what the Tories say about costs to Kenilworth residents. Just like other major projects, the cost is spread around the whole District. The new pools will be there for generations to enjoy.\nLeave a comment",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_jim-sinnott/content_8.html": "-\nKenilworth Swimming Pool progress\nNews and Comment from Labour Councillors This project is back on track, and Councillors Jim Sinnott and Chris King explain here the current state of play, and some history. Take a look at this video by Warwick District Council, presented by Chris and the Senior Project Manager, Robert Johnstone. https://www.facebook.com/share/r/1C9bP5mLLt Chris says, “We can look…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_2025_02_05_closing-in-on-tory-fraudsters/content_6.html": "Public Authorities (Fraud, Error and Recovery) Bill\nYesterday, 4th February 2025, this Bill passed its second reading and so has now entered the Committee Stage. It will create new powers to investigate suspected fraud against public bodies, recover owed money, and take action against offenders. Powers include compelling organisations to provide information and allowing authorised investigators to enter and search premises with a court warrant.\nIn totally unrelated news, the Covid fraud squad will have power to seize fraudsters’ cash under this Labour bill.\nLeave a comment",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_events/content_13.html": "Social Events\nChristmas Fundraiser 2024, with food, live music, and licensed bar\nConstituency, Branch and Group meetings\nWe meet at locations all over the constituency\n- Informal Groups of like-minded Labour members.\n- Local Branch meetings\n- Whole Constituency Labour Party (CLP) meetings where we organise campaigns, support candidates for election, plan fundraising, and interact with Labour MPs, Councilors and other speakers.\nRegional & National Labour collaboration\nWe support and collaborate with the nearby constituencies of Warwick & Leamington and Rugby, and send members to regional and national conferences.",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_elections_past-campaigns/content_11.html": "General Election 2024\nWe ran a very successful election campaign, and although we did not contribute to Labour’s landslide, we did give the Tories a run for their money, and as usual beat the Lib Dems into third place: their new slogan should be “coming third here!”",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_chris-king/content_9.html": "-\nKenilworth Swimming Pool progress\nNews and Comment from Labour Councillors This project is back on track, and Councillors Jim Sinnott and Chris King explain here the current state of play, and some history. Take a look at this video by Warwick District Council, presented by Chris and the Senior Project Manager, Robert Johnstone. https://www.facebook.com/share/r/1C9bP5mLLt Chris says, “We can look…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_corruption/content_14.html": "-\nClosing in on Tory fraudsters\nPublic Authorities (Fraud, Error and Recovery) Bill Yesterday, 4th February 2025, this Bill passed its second reading and so has now entered the Committee Stage. It will create new powers to investigate suspected fraud against public bodies, recover owed money, and take action against offenders. Powers include compelling organisations to provide information and allowing authorised investigators to enter and search…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_tag_pool/content_12.html": "-\nKenilworth Swimming Pool progress\nNews and Comment from Labour Councillors This project is back on track, and Councillors Jim Sinnott and Chris King explain here the current state of play, and some history. Take a look at this video by Warwick District Council, presented by Chris and the Senior Project Manager, Robert Johnstone. https://www.facebook.com/share/r/1C9bP5mLLt Chris says, “We can look…",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_posts-page/content_5.html": "Kenilworth & Southam Labour Party\nWelcome\nElections\nPast Campaigns\nTeam\nNews\nEvents\nDonate\nNews\nThe Conservatives’ A46 Bridge to Nowhere\n26th Feb 2025\nClosing in on Tory fraudsters\n5th Feb 2025\nKenilworth Swimming Pool progress\n4th Feb 2025\nShare this:\nClick to share on X (Opens in new window)\nX\nClick to share on Facebook (Opens in new window)\nFacebook\nLike\nLoading…\nSubscribe\nSubscribed\nKenilworth & Southam Labour Party\nSign me up\nAlready have a WordPress.com account?\nLog in now.\nPrivacy\nKenilworth & Southam Labour Party\nSubscribe\nSubscribed\nSign up\nLog in\nCopy shortlink\nReport this content\nView post in Reader\nManage subscriptions\nCollapse this bar\n%d",
  "https_kenilworthandsouthamlabour_org_elections_/https_kenilworthandsouthamlabour_org_donate/content_3.html": "Direct donation\nYou can make a direct donation to support local campaigns\nhttps://donate.labour.org.uk/kenilworth_and_southam\nLabour Lottery\nYou can take part in the lottery for about £2 each week; half of the proceeds come to the local Labour Party\nYou can make a direct donation to support local campaigns\nhttps://donate.labour.org.uk/kenilworth_and_southam\nYou can take part in the lottery for about £2 each week; half of the proceeds come to the local Labour Party"
}