{
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_arthur-hume/content_18.html": "After working in 3 local mines, I joined Northumbria Police in 1992 and have worked for the people of the area for most of my life. Amble obviously has special meaning to me personally – I have acquired a certain knowledge and feel for the people of the town and am eager to serve them all.\nFor too long Amble have vacillated between the main parties and the result is where we find ourselves now, in a declining area. This election, our people have a chance to vote for two people and a party which is geared to help local communities and the country. Reform U.K is the only party to change the way our town/s will be run, we will of course rely on other towns electing Reform candidates to take control of NCC to maximise our effectiveness. If we fail to do this, Groundhog day is about to come around again.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_sample-page/content_20.html": "Skip to content\nSkip to content\nHome\nPrivacy Policy\nAnnouncements\nMedia\nCounty Northumberland Policies\nNorth Northumberland Electoral Divisions\nCandidates – Local Elections\nReformUK HQ\nSearch for:\nSearch\nHome\nNorth Northumberland Electoral Divisions\nNorth Northumberland Electoral Divisions\n1st May 2025 County Council Elections\nElectoral\nDivisions\n:\nAlnwick Castle\nAlnwick Hotsput\nAmble\nAmble West with Warkworth\nBamburgh\nBerwick East\nBerwick North\nBerwick West with Ord\nDruridge Bay\nLonghirst\nLonghoughton\nLynemouth\nMorpeth North\nMorpeth Stobhill\nNorham and Islandshires\nPegswood\nRothbury\nShilbottle\nWooler\nComments are closed.",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_announcements/content_15.html": "Skip to content\nSkip to content\nHome\nPrivacy Policy\nAnnouncements\nMedia\nCounty Northumberland Policies\nNorth Northumberland Electoral Divisions\nCandidates – Local Elections\nReformUK HQ\nSearch for:\nSearch\nHome\nAnnouncements\nAnnouncements\nCHECK OUT ELECTORAL DIVISIONS TO SEE YOUR CANDIDATES\nComments are closed.",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_candidates/content_2.html": "Alnwick Castle – Martin Harrington\nAlnwick Hotspur – T.B.A\nAmble – Arthur Hume\nAmble West with Warkworth – Pauline Davidson\nBamburgh – Philip Robson\nBerwick East – Jay A Johnston\nBerwick North – Nicole Brooke\nBerwick West with Ord – Roddy Hamilton\nDruridge Bay – Michael Joyce\nLonghoughton – T.B.A\nLonghirst – Matthew Gray\nLynemouth – Daniel Taylor\nMorpeth Kirkhill – Gillian J Caldwell\nMorpeth North – Garry Featherstone\nMorpeth Stobhill – Neil Cox\nNorham and Islandshires – Patrick Lambert\nPegswood – Christopher Croft\nRothbury – Mark Hope\nShilbottle – T.B.A\nWooler – Anthony Robb",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_jay-johnston/content_10.html": "This system needs fixing. I’ll propose practical solutions for local issues like street care, housing, and school development. I want to revive local industry, creating jobs and business opportunities. I’ll listen to your ideas, deal with your concerns and make life here easier for you.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_gillian-caldwell/content_19.html": "Hi, I’m Gillian I am 56 and have worked as a nurse for 39 yrs. I am married to Ian who is ex-forces, and a physiotherapist. I have two children, four dogs and live in an area of Morpeth that has no access to broadband. I am passionate about serving this community and improving local services.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_philip-robson/content_11.html": "I live at Chathill Farm and have lived within this community all my life. I am presently\nChairman of Ellingham Parish Council and feel I’m aware of local issues. It is my goal to voice these and work on them directly at county level with your vote on May 1st. Thank you.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_matthew-gray/content_8.html": "Hello, I am delighted to be your Reform UK candidate. I grew up locally and believe communities like ours have been taken for granted by those in charge for too long. I regularly hear we don’t feel listened to. If I am chosen to represent you, it will be my mission that we be heard.\nI feel I have always had strong ties to Northumberland, from growing up here to now working in our local subsea engineering sector as a mechanical engineer.\nI care passionately about our local communities but sadly believe they’ve long been heading in the wrong direction.\nTaxes go up, services get worse and nobody is ever held accountable.\nNorthumberland Council tax has increased 23% in just five years!\nWhere all the money goes, I don’t know but 85k a day on debt interest after years of mismanagement and £18m on agency staff since 2021, while the NCC CEO earns more than the Prime Minister gives me an idea.\nI fully support Reform UK’s promise of an audit when we control the council.\nIf I am chosen to represent you, it will be my mission to listen to the community, deliver a fairer better service and give us the council we deserve.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com/content_23.html": "Our country has so much potential, but both Labour and the Conservatives have broken promise after promise for the last 30 years. You are worse off, both financially and culturally. Wages are stagnant, we have a housing crisis, our young people struggle to get on the property ladder, we have rising crime, energy bills are some of the highest in Europe, the NHS isn’t working, both legal and illegal immigration are at record levels and woke ideology has captured our public institutions and schools. The Conservatives have failed and Labour will fail too. A vote for either is a vote for more incompetence, dishonesty and failure. We are ruled by an out of touch political class who have turned their backs on our country. Reform is the alternative. Only Reform will stand up for British culture, identity and values. We will freeze immigration and stop the boats. Restore law and order. Repair our broken public services. Cut taxes to make work pay. End government waste. Slash energy bills. Unlock real economic growth. Only Reform will take back control over our borders, our money and our laws. Only Reform will secure Britain’s future as a free, proud and rich nation. Join the revolt. Yours sincerely, Nigel Farage Leader of Reform UK",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_mark-hope/content_1.html": "Hello, I am your Reform UK candidate. Having lived a life of service with a 36-year career in the RAF it would be a privilege to serve as your councillor. I have contributed to the local community for over 20 years as a Scout Leader and Sports Coach. I stand ready to take your voice to County Hall.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_garry-featherstone/content_12.html": "I am passionate about local issues and spearheaded a campaign to save the historic Willows buildings and Storey Park community centre, demolished by the current council. If elected I will find funding to rebuild Storey Park as a new centre for the people of Morpeth; expect positive change!\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_christopher-croft/content_4.html": "I am delighted and honoured to be your Reform UK candidate in the local elections on May 1st.\nI am 61 years of age, married with 3 grown up children and 2 grandchildren. I have been a local businessman for over 30 years. We pay around the highest council tax in the world and despite this our local services seem to get worse. The council since October 2023 have spent around half a million pounds on hiring “consultants “, whilst our potholes don’t get fixed, the fly tipping doesn’t get cleared away, the graffiti doesn’t get cleaned up etc, etc. I want to know where our money is spent and why local issues which affect residents are not being dealt with. Reform councillors don’t just appear at election time, we work all year round for you.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_michael-joyce/content_9.html": "My goal is to represent Druridge Bay and support the wide variety of youth, community and charitable projects which are so valuable to the people of the area. I’m hoping you will allow me the honour of being your spokesperson for social issues at county level by voting for me on May 1st. Thank you.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_daniel-taylor/content_17.html": "As a proud member of our community, I am running for councillor under Reform UK to bring fresh perspectives, and real change to local governance. I am committed to ensuring that every resident in our area has a voice that is heard, valued, and acted upon to push for the very best in our community.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_patrick-lambert/content_21.html": "Dear Local Residents,\nMy name is Patrick Lambert and I am very fortunate to have lived in the great community of Norham with my wife since 2016. I am standing for Reform UK in the County council elections on the 1st of May.\nLike yourselves when we pay our Council Tax, I am incredibly frustrated with the state of our local services and keep wondering what we are getting for our ever-increasing monthly contributions.\nOur communities and isolated hamlets in Norham & Islandshires are very much at the end of the line when the NCC is deciding on its priorities down in County Hall in Morpeth. We need Change and a fresh outlook that puts local Peoples priorities at the head of the queue, delivering actual results not just empty rhetoric from the old party consensus.\nI am setting out 3 areas we must concentrate our efforts on:\n-\nDeliver Value for Money for Council Tax & business rate Payers. Cut out Waste and Vanity projects and make sure NCC is operating within a Budget that delivers for the those that pay the bills rather than those that live off the back of NCC.\n-\nHelp and encourage small business in our communities. Rather than an economy that has become addicted to carrier vans and out of town retail outlets, we need to get back to supporting local enterprises and creating employment opportunities for our young people .\n-\nQuality Services by embracing new technology and smart business solutions. Our roads are broken, not just the canyons and pot holes we end up negotiating on our rural roads. A patch or “stitch in time” is just a false economy. Road galleys and water management , we must work with Farmers and landowners to sort out these potential issues before the roads are impassable. High quality repairs with trained teams working round the year utilising the best materials and workmanship to deliver long term rural roads that stand up to the vagaries of our weather.\nNorthumberland County Council is broken with a debt burden that is unsustainable. The 4.9% increase in Council Tax will be entirely swallowed up servicing the debt that the council has accumulated.\nReform UK is a fresh alternative that is focussed on common sense policies, cutting waste and making sure your hard-earned money is spent wisely.\nIf you want change in Northumberland County Council, Vote Reform UK on 1st May. Together we can take back control of our local area and make it work for the bill payers in our communities not the politicians.\nI hope you will give me your support to be a strong voice for our communities in this fantastic corner of Northumberland.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_privacy-policy/content_14.html": "Who we are\nOur website address is: https://reformnnbld.com.\nCookies\nThese cookies will last for one year.\nIf you visit our login page, we will set a temporary cookie to determine if your browser accepts cookies. This cookie contains no personal data and is discarded when you close your browser.\nWhen you log in, we will also set up several cookies to save your login information and your screen display choices. Login cookies last for two days, and screen options cookies last for a year. If you select “Remember Me”, your login will persist for two weeks. If you log out of your account, the login cookies will be removed.\nIf you edit or publish an article, an additional cookie will be saved in your browser. This cookie includes no personal data and simply indicates the post ID of the article you just edited. It expires after 1 day.\nEmbedded content from other websites\nArticles on this site may include embedded content (e.g. videos, images, articles, etc.). Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website.\nThese websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracking your interaction with the embedded content if you have an account and are logged in to that website.\nWho we share your data with\nNo data is collected and therfore shared with no external sources\nHow long we retain your data\nFor users that register on our website (if any), we also store the personal information they provide in their user profile. All users can see, edit, or delete their personal information at any time (except they cannot change their username). Website administrators can also see and edit that information.\nWhat rights you have over your data\nIf you have an account on this site, or have left comments, you can request to receive an exported file of the personal data we hold about you, including any data you have provided to us. You can also request that we erase any personal data we hold about you. This does not include any data we are obliged to keep for administrative, legal, or security purposes.\nWhere your data is sent\nNo data is collected.",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_local-policies/content_16.html": "Skip to content\nSkip to content\nHome\nPrivacy Policy\nAnnouncements\nMedia\nCounty Northumberland Policies\nNorth Northumberland Electoral Divisions\nCandidates – Local Elections\nReformUK HQ\nSearch for:\nSearch\nHome\nCounty Northumberland Policies\nCounty Northumberland Policies\nComments are closed.",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_anthony-robb/content_5.html": "I moved to Wooler in 2020, but have worked with the community, via music and schools, since 1976. I have a track record of fighting for traditional values and Reform UK has offered me the privilege to stand for the people who have inspired me for 50 years.\nMy doctorate was in cancer drug research. It taught me the rigours of science. Our living standards are decreasing thanks to local and national governments’ wasteful, unscientific decision making. We’re all suffering; residents, farmers, local businesses. If elected I promise to speak up for all of you and base decisions on sound science. For example whenever you see a wind turbine remember that somewhere in the country fossil fuels are still being burned so that they can take over quickly when the wind stops blowing.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_news-views/content_13.html": "Skip to content\nSkip to content\nHome\nPrivacy Policy\nAnnouncements\nMedia\nCounty Northumberland Policies\nNorth Northumberland Electoral Divisions\nCandidates – Local Elections\nReformUK HQ\nSearch for:\nSearch\nHome\nMedia\nMedia\nComments are closed.",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_nicole-brooke/content_6.html": "Originally from Newcastle, she has built a successful career in the financial sector, but also has collaborated with blue-chip companies such as Walt Disney and Formula 1. With over 20 years of experience and a degree in Human Resources Management, Nicole is known for her leadership, delivering results, and creating lasting change. As an excellent networker and proactive problem-solver, she is always ready to take decisive action when it counts.\nNicole’s commitment to community service is equally strong. As a mentor to young people and a Lioness Ambassador, she empowers the next generation and supports women entrepreneurs. Her leadership journey began in 2001 when she launched her own HR consultancy while raising her first child. Later, as the leader of the Bedford Residents Association, she championed the town’s heritage and worked tirelessly to support local businesses.\nSince moving to Berwick-upon-Tweed with her family in 2017, Nicole has embraced the town’s warm and welcoming community. Her focus is on driving business growth, supporting local education, and creating opportunities for young people to thrive. She is also determined to ensure Berwick’s older residents are well-supported and able to enjoy a happy, active lifestyle.\nWith her pragmatic approach, strong leadership, and unwavering passion for Berwick, she is committed to securing a bright and prosperous future for the town, while preserving its historic charm for generations to come.\nAs a candidate for Reform UK, Nicole is ready to make a tangible difference.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_martin-harrington/content_24.html": "I have lived in Alnwick all my life (62 years) and run my own Estate Agents and property surveying business in the town. Having served as a Town Councillor for over 15 years, I’m now standing for Reform UK because I want to make a difference at County level for the people of Alnwick & Denwick.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_pauline-davidson/content_22.html": "Hello, I am a retired Nurse Practitioner.\nI worked for the NHS for 37 years and now have the opportunity and privilege to devote my time to the common-sense Reform party. Each person in our community will be heard; I know there are many important unresolved issues. Together we can achieve so much!\nFor too long Amble & Warkworth have vacillated between the main parties and the result is where we find ourselves now, in a declining area. This election, our people have a chance to vote for two people and a party which is geared to help local communities and the country. Reform U.K is the only party to change the way our town/s will be run, we will of course rely on other towns electing Reform candidates to take control of NCC to maximise our effectiveness. If we fail to do this, Groundhog day is about to come around again.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_roddy-hamilton/content_7.html": "After a spell in the British Army and a lifetime working globally within the commercial sector, as well as having established two successful businesses, I am keen to represent the constituents of Berwick West with Ord on Northumberland County Council.\nOver the last years I, like so many others, have become entirely disillusioned with the UK political scene at a local, but also a parliamentary, level and I recognise that if I do want to see change I need to do something about it.\nWhilst new to Politics I am hopeful that by standing to represent residents in Berwick West with Ord I will, if elected, have an opportunity to help drive improvements at a County Council level to the benefit of all.\nI regard myself as a determined, and no-nonsense, individual who cares passionately about delivering projects and initiatives that improve people’s lives and the wonderful Northumberland community in which we all live.\nIf elected I shall serve my constituents with honesty, and integrity, seeking to change past political stereotype performance with a refreshing, positive, and can-do approach.\nVOTE REFORM ON THE 1st MAY 2025",
  "https_reformnnbld_com_mark-hope_/https_reformnnbld_com_neil-cox/content_3.html": "I support tighter immigration prioritizing local jobs and am committed to cutting waste in the council budget, simplifying policies for greater efficiency, Furthermore, I intend to cut the council’s net zero targets to free up funds for vital services like pothole repairs.\nVOTE REFORM ON THE 1st MAY 2025"
}