{
  "https_www_johnfalkenstein_com_/https_www_johnfalkenstein_com_contact-press/content_2.html": "For further information on my campaign please contact me below and one of my team will get back to you",
  "https_www_johnfalkenstein_com_/https_www_johnfalkenstein_com/content_1.html": "About John\nAlthough not from here, I have spent virtually all my working life in North Tyneside working and serving my community. In the 1980’s I worked in, then managed a number of welfare rights services in the Borough. Following the Meadowell riots, I helped set up training and apprenticeship programmes for our vulnerable young people and remained the Chairman of the North Tyneside Motor Project for the first 5 years of its existence. Now called Northumbria Youth Action that organisation has provided apprenticeships to hundreds of our young men and women.\nDuring the 1990’s, I was employed as a Principal Officer advising North Tyneside Council and Councillors on various aspects of policy in relation to housing, poverty and crime.\nIn 1995, I left to become a barrister, and spent the next 28 years specialising in employment, discrimination and local government law. I have been on both sides of legal arguments in representing local authorities, including cases involving North Tyneside Council. I know this Council’s strengths and weaknesses and I have the skills to restore it to one of our great Councils.\nMY PLAN FOR NORTH TYNESIDE\nNorth Tyneside has so much potential but has been failed by weak local leadership. Labour’s promise not to increase Council tax was a lie. Our Labour Council has raised Council tax by 4.99%. It has also cut the workforce by 200 staff – equivalent to 5%. On the 22 March 2025, The Times reported that north east households are now paying a record £444 per annum more in council tax that those in central London. Yet our public services are in decline and our roads are a disgrace. In her letter to households, the outgoing Labour Mayor states that further council tax rises and ‘efficiencies’ are predicted, and there is still a £14 million gap on the Council’s finances up to 2029. It is abundantly clear that Labour cannot manage our finances and its record is embarrassing.\nAs of September 2023 North Tyneside council was £403 million in debt, today that figure is even higher, interest on these debts is over 50K per day.\nIt is time for a new approach. It is time for Reform.\nSound Financial Management\nCouncil tax is amongst the highest anywhere in the UK. Yet our roads are crumbling, our public services are underfunded, and businesses struggle with red tape.\nAs your Reform UK Mayor, I pledge:\nTo review all capital and revenue expenditure to ensure all current projects are necessary and the expenditure is proportionate.\nTo scrap vanity projects. One example, is the £1.5 million Dutch style roundabout at the top of Rake Lane, which represents no value for money whatsoever.\nReform How Our Council Runs\nIt is proven that in organisations such as our Council, it is a small proportion of the workforce that do most of the real work1. There is significant under-staffing in some areas, and overstaffing within others, and even within the same areas there can be both. Job losses achieved through voluntary redundancies fail to address these fundamental imbalances, which cause low morale amongst the workforce to suffer. Myself and my cabinet will work with the trade unions to create an environment where our very best staff are retained, and not encouraged to leave. To create an environment where all staff are doing worthwhile jobs and operate in a culture where staff want to work, and work hard to serve their communities.\nAs your Reform UK Mayor, I pledge:\nTo review all public sector contracts to ensure value for money and to ensure that bureaucracy, unnecessary red tape and incompetence is not preventing the most productive use of public money\nNet Zero Madness\nThe UK contributes only 0.88% of carbon dioxide to the world’s atmosphere, and North Tyneside’s contribution to that is virtually nil. Reform UK agree we should move away from less sustainable forms of energy, but only as the technology and infrastructures develop, and economics permit.\nOur future economic prosperity should not be sacrificed at the altar of Net Zero.\nNet zero policies are crippling North Tyneside’s economy—driving up energy costs and killing jobs. It is estimated that net zero will cost us £50 billion per year until 2050. That expenditure will be recovered in taxes, council taxes and higher energy bills. Our industries will become uncompetitive, investment in industries will go elsewhere and our economy will become unsustainable, leading to high unemployment, inflation and recession.\nAs your Reform UK Mayor, I pledge:\nTo stop all non-essential expenditure on these programmes unless they can be shown to be financially proportionate and meet a compelling need. The first priority is to retain jobs and services. For that to happen, we first need to balance our books.\nJobs Training for the Young\nWe should prepare our children for the future and not just talk about it.\nI have been instrumental in setting up skills training and apprenticeship programmes in North Tyneside. North Shields based ‘Northumbria Youth Action’ is a fabulous example of a training scheme, which I developed with the police and the probation services, which has given hundreds of apprenticeships to our young people, in a real world business setting.\nAs your Reform UK Mayor, I pledge:\nTo set up an employer led ‘Skills Board’, and provide incentives to local businesses to offer apprenticeships and training opportunities to our young people on an scale not seen before locally.\nHMO`s\nThe Government wants to move away from using hotels to house migrants and asylum seekers towards using Houses in Multiple Occupancy (HMO's). This has serious implications for North Tyneside, which so far has avoided the problems experienced in Newcastle with large numbers of migrants being housed in city centre hotels at enormous costs to the tax payer. North Tyneside has a significant number of large 4 - 6 bedroom houses for rent and would be an easy target for the Home Office. The legislative change will make it easier for HMO accommodation to be used to house asylum seekers. This is a 'two tier' approach that favours asylum seekers and if allowed will increase to the resentment and lack of cohesion within our communities\nAs your Reform UK Mayor, I pledge:\nAs your Reform UK Mayor I will ensure no HMO licenses are granted by North Tyneside Council to house asylum seekers, and will ensure that all other measures possible are taken in relation to any other properties being used for these purposes.\nPotholes\nLabour is failing in its pledge to fix a million extra potholes a year. Of a total of 47.1 miles of minor road deemed in need of maintenance, North Tyneside Council has only carried out repairs on 10.8 miles – equivalent to only 22.9%. This is not a Governmental problem, but a failure by the leadership of North Tyneside Council. Whilst the Labour Party boasts it has set aside £1.6 billion to fix the UK’s roads, a report by the Asphalt Industry Alliance (AIA) has said the cost of bringing Britain’s road back to a good condition has now reached £16.8 billion – a record high.\nWhilst the Labour Party are prepared to see billions spent on developing electric vehicles and network links, it cannot maintain the roads on which they will travel.\nAs your Reform UK Mayor, I pledge:\nTo reverse this neglect, by ensuring our existing local authority standards and procedures are not operating to prevent basic repairs being undertaken in a timely and efficient manner, and if necessary, diverting existing human resources to this long neglected and now critical area.\nCentral Policy\nThe current waste of Officer’s time writing documents on equality, diversity and inclusion, will be stopped. All employers are equal opportunity employers and this is not a particular virtue of North Tyneside Council. Reform UK supports equality, however, we fail to see how Officers spending time writing and reading policies on subjects that North Tyneside Council have no jurisdiction over is time well spent. This pattern can be repeated over a number of areas, such as the environment and energy for example, and represents no value to the council tax payer.\nAs your Reform UK Mayor, I pledge:\nI will stop the current obsession with matters which have no direct bearing on the work of the Council. As a Council we will continue to promote ourselves as an equal opportunities employer, and provide links to the many plain English guides to the legalisation published by the Government and its departments, and use the existing grievance procedure to ensure alleged breaches are dealt with.\nThe National Health Service\nThe claims that Reform UK want to privatise the NHS are nonsense. Reform UK and have always said that we want the NHS free at the point of delivery. The NHS is poorly managed. We waste far too much money through bureaucracy and middle management. The NHS that people grew up with no longer exists. You can’t get a GP appointment, waiting times are shocking, and yet we continue to funnel in money. In the last 10 years 7.2 million foreign-born people have registered in GP practices. That is the equivalent of seven cities the size of Birmingham. The population explosion has meant the NHS struggles to function at any level. Reform are committed to an NHS free at the point of delivery, but we must cut the waste, bureaucracy and middle management.\nWe are a dedicated team committed to crafting exceptional experiences. Our focus lies in providing reliable and innovative solutions, driven by a deep respect for quality and a genuine desire to exceed expectations.From modest beginnings, we've grown through unwavering dedication and a commitment to continuous improvement. Each step has reinforced our core belief in the power of collaboration and the importance of integrity. We're passionate about what we do, and we're excited to share our story with you.\nAdd comment\nComments\nWhy do you keep deleting messages on your facebook page when people have asked about your residency?\nIt is important for voters to know that their mayor will be in the local area and not Italy. I have confirmation that you resident part time in Italy. Will you be moving permanently to the North East if you are elected? When did you last reside in Italy?\nDear John Roy Falkenstein,\nCan you categorically state that you would support the 'repealing' of the 'The Constitutional Reform Act 2005' to abolish the Supreme Court and re-install the 12 most senior judges – the Lords of Appeal in Ordinary, or Law Lords, to ensure our 'Parliament' is supreme in law making in our land and NOT the Judiciary?\nExplain to me the constitutional difference between the Supreme Court and what preceded it please?\nAlready posted our votes for you today :) Got your leaflet tonight - Backworth, Hotspur North. Do you know the leaflet is blank on one side? I own a printers in North Shields and it seems a waste of your advertising space to have an A4 folded to A5 leaflet, that is blank inside. Letting you know in case it is mis printed. Should have used your local printer! 🙂 That is me! Dave Dent Printers Good luck on Thursday\nNext time I’d like to print locally. It was a Party HQ decision. I actually know your firm. Those leaflets were intended to be stuck on boards and windows. We have ran out of the A5 double sided ones. We needed them to get the message out. Thanks for your support.\nDear John Roy Falkenstein,\nI am writing a continuation of the previous email I sent before (I hope you read that) as I have more important suggestions and tips that can help you win the mayoral election in the Borough of North Tyneside on 1st May 2025.\nHere are more suggestions and tips...\n5. Address Key Local Issues Beyond Finances\n• Infrastructure and Services: While Liam Bones focuses on road maintenance (£36m backlog), Falkenstein could broaden his appeal by addressing other visible issues like public transport (e.g., Metro fare dodging, as raised by Martin Uren) or the decline in public services despite tax hikes.\n• Youth and Community: His “Skills Board” proposal aligns with community priorities but needs more visibility. Partnering with local businesses to showcase potential apprenticeship programmes could win over families and young voters.\n• Balance Reform UK’s National Policies: His stance against net zero policies and migrant housing in HMOs could polarise voters. He should frame these cautiously, focusing on economic impacts (e.g., job losses from net zero costs) rather than divisive rhetoric, to avoid alienating moderate voters.\n6. Overcome Electoral Challenges\n• Compete with Labour’s Stronghold: Labour’s dominance (58% vote share in 2024 local elections) and Karen Clark’s focus on poverty and health inequalities make her a formidable opponent. Falkenstein must highlight Labour’s failures, like the £14 million budget gap projected to 2029, without appearing overly negative.\n• Stand Out in a Crowded Field: With seven candidates, including two independents (Cath Davis and Martin Uren) and a strong Green candidate (Chloe-Louise Reilly), vote splitting is a risk. Falkenstein should differentiate himself by focusing on practical solutions rather than ideological debates (e.g., Davis’s push to abolish the mayoral role or Reilly’s environmental focus).\n• Boost Turnout: The 2013 mayoral election saw 62,700 votes, with Labour’s Norma Redfearn winning 33,119. Falkenstein needs to mobilise Reform UK supporters and undecided voters, especially in wards like St Mary’s, where Labour made gains in 2024, to close the gap.\n7. Capitalise on Betting Odds and Polls\n• Momentum from Odds: Falkenstein’s 6/1 odds (as of April 24, 2025) place him third behind Clark (1/3) and Bones (5/1), but his 9/2 odds in another post suggest growing support. He should use this to project confidence and viability, encouraging voters to see him as a serious contender.\n• Reform UK’s Regional Strength: Reform UK’s 18-40% polling in other mayoral races (e.g., Greater Lincolnshire) indicates potential for an upset if Falkenstein can replicate this locally. He should emphasise national trends showing Reform UK as a credible opposition.\nRisks and Mitigation\n• Risk: Labour’s entrenched support and Clark’s local credentials could overshadow Falkenstein’s campaign. Mitigation: Focus on swing wards (e.g., Tynemouth, where Conservatives lost seats) and appeal to voters frustrated with both Labour and Conservative records.\n• Risk: His net zero and migration stances could alienate environmentally conscious or progressive voters. Mitigation: Emphasise economic benefits of his policies (e.g., lower taxes, job growth) and avoid polarising language.\n• Risk: Low voter turnout could favour Labour’s loyal base. Mitigation: Run an aggressive get-out-the-vote campaign, targeting younger voters and Reform UK supporters through social media and community events.\nConclusion\nJohn Roy Falkenstein’s path to victory in the North Tyneside mayoral election hinges on presenting himself as a credible, local alternative to Labour’s dominance, leveraging his experience as a barrister and community advocate, and mobilising disaffected voters with a clear message of fiscal reform and economic opportunity. By emphasising transparency, apprenticeships, and practical solutions to local issues like debt and infrastructure, while navigating the crowded field with high-visibility campaigning, he can maximise his chances. However, overcoming Labour’s stronghold and voter apathy will require relentless grassroots efforts and strategic messaging to capture enough votes in the first-past-the-post system on May 1, 2025.\nI hope you you accept these additional suggestions and tips.\nI am looking forward to hear from you very soon.\nKind Regards,\nKevin Siqueira\nPS: Please reply once you read this.\nDear Kevin, thank you for you detailed email, the contents of which I shall consider in due course. There is the pressing matter of the campaign and election to deal with first. Best wishes\nDear John Roy Falkenstein,\nI am writing an email because I have very important suggestions and tips that can help you win the mayoral election in the Borough of North Tyneside on 1st May 2025.\nHere is the suggestion...\nTo win the North Tyneside mayoral election on May 1, 2025, John Roy Falkenstein, running as the Reform UK candidate, would need to execute a highly strategic campaign that leverages his strengths, addresses local concerns, and navigates the competitive field of seven candidates. The election uses a first-past-the-post system, meaning the candidate with the most votes wins, and voter turnout and sentiment will be critical. Below are key strategies Falkenstein could employ, based on his background, platform, and the political landscape described in available information:\n1. Emphasise Financial Accountability and Local Economic Concerns\n• Strengthen Core Message: Falkenstein’s primary pledge to “balance the books” and scrutinise council spending resonates with voters concerned about North Tyneside Council’s £403 million debt (as of September 2023) and rising council taxes. He should continue to highlight specific examples of mismanagement, such as “vanity projects” or high executive salaries, to build a narrative of fiscal responsibility.\n• Actionable Proposals: Propose a transparent, public review of council expenditures and a clear plan to reduce debt without cutting essential services. His call for a “Skills Board” to boost apprenticeships could appeal to voters worried about youth unemployment and economic stagnation, especially if he ties it to local job creation.\n• Contrast with Labour: With Labour’s Karen Clark favoured at 1/3 odds and the party dominating local politics (51 of 60 council seats in 2024), Falkenstein must position himself as a fresh alternative to Labour’s long-standing control. He can criticise Labour’s 4.99% council tax hike and workforce cuts while emphasising Reform UK’s outsider status.\n2. Leverage His Local Roots and Experience\n• Highlight Community Ties: Falkenstein’s decades of work in North Tyneside, including managing welfare rights services, advising the council on housing and poverty, and chairing the North Tyneside Motor Project, give him credibility as a candidate who understands the borough. He should share personal storeys from his work post-Meadowell riots and with Northumbria Youth Action to connect with voters emotionally.\n• Professional Credibility: As a barrister with 28 years of experience in employment, discrimination, and local government law, he can present himself as a competent leader capable of navigating complex council challenges. This contrasts with candidates like independent Cath Davis, who wants to abolish the mayoral role, or less experienced candidates like Chloe-Louise Reilly.\n3. Appeal to Disaffected Voters\n• Target Conservative and Independent Voters: With Liam Bones (Conservative) at 5/1 odds and Reform UK polling between 18-40% in other mayoral races, Falkenstein could attract voters disillusioned with the Conservatives’ local performance (e.g., losing seats in 2024) or sceptical of Labour’s dominance. His 6/1 odds suggest a competitive edge over Bones, and he should emphasise Reform UK’s growing national momentum, especially with Nigel Farage’s regional visits.\n• Address Anti-Establishment Sentiment: Falkenstein can tap into frustration with “the same parties” running the council for decades, as he stated at the Chronicle hustings. Policies like opposing net zero costs, which he claims burden local economies, could resonate with voters feeling squeezed by rising energy bills and taxes.\n4. Increase Visibility and Engagement\n• High-Profile Campaigning: Nigel Farage’s visits to Durham and Northumberland on April 15, 2025, provided a boost to Reform UK’s profile. Falkenstein should seek more appearances with Farage or other prominent Reform figures to energise supporters and gain media coverage.\n• Hustings and Debates: His participation in the Chronicle and Journal hustings showed his ability to articulate his vision. He should continue engaging in public forums, focusing on clear, concise messaging about fiscal reform and apprenticeships to stand out among the seven candidates.\n• Social Media and Grassroots: Reform UK’s national campaign, launched by Farage on March 28, 2025, emphasises contesting nearly all council seats. Falkenstein should use platforms like X to share short, impactful messages about local issues, leveraging Reform UK’s branding while tailoring it to North Tyneside’s needs. Grassroots efforts, like door-to-door canvassing, could help reach undecided voters.\nThere are more important suggestions and tips to come.\nI am looking forward to hear from you very soon.\nKind Regards,\nKevin Siqueira\nPS: Please reply as soon as possible once you read this email.\nDear Kevin, thank you again for you detailed email, the contents of which I shall consider in due course. There is the pressing matter of the campaign and election to deal with first. Best wishes\nHi John I am a North Tynside Landlord providing long term safe homes for my customers I am effected by the Tories S24 Tax and i have had to raise my rents to cover the extra costs i have had to face\nI am a great supporter of Reform and I ask you to support good Landlords in North Tynside\nI am sure i am not alone with my thoughts I wish you all the very best for the election and i look forward to welcoming REform and commonsense policies for all uk Business Kindest regards Elaine Power\nYes, the private rented sector performs a valuable service, and but for a few bad apples, standards are generally very high. I do have some ideas which would help the sector and would be happy to consult upon these if elected. Thank you for your support."
}