{
  "https_baggyshanker_com_/https_baggyshanker_com_privacy-policy/content_4.html": "Supported by: Unite Unison GMB USDAW COMMUNITY NOMINATED BY: BLAGR\nOur website address is: https://baggyshanker.com\nThis page explains how we collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data. This is separate to how the national Labour Party uses your personal data and you should refer to their privacy policy for further information about this: www.labour.org.uk/privacy-policy\nThe Office of Baggy Shanker is the data controller as defined under the General Data Protection Regulation (“GDPR”) and responsible for your personal data (referred to as “we”, “us” or “our” in this privacy policy).\n2. Our contact details\nName: Baggy Shanker\nAddress: House of Commons, London, SW1A 0AA\nPhone Number: 01332 414990\nE-mail: baggy@baggyshanker.com\nThis privacy policy aims to give you information on how we collect and process your personal data through:\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\nThe office of Baggy Shanker will only collect and use personal information for the specific purpose for which it has been obtained.\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data), or data related to deceased individuals.\nWhen submitting sign up forms on this website, you may be asked for personal information. In each case, we will ask for your consent to use your information, and we will only use it for the purposes for which you provide it.\nWe currently collect and process the following information:\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\nProvided by you – directly\nProvided by you – indirectly\nUnder the General Data Protection Regulation (GDPR), the lawful bases we rely on for processing this information are:\nYour information is securely stored at House of Commons, London, SW1A 0AA\nWe will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. We will delete all other personal data we no longer need in line with our internal retention policies.\nWe will regularly review the personal information we hold to ensure that its use is necessary and proportionate.\nWe will then securely and permanently dispose of your information by shredding your file (if paper) or deleting your case and associated files from our case system and computer system.\n9. Cookies and Analytics\n9.1 What are cookies?\nCookies are small text files that web servers give to browsers to store on users’ machines (computers, tablets or mobile devices). They enable the website to recognise requests as coming from the same browser. Cookies are designed to allow the website to recognise its users on subsequent visits, or to authorise other designated websites to recognise these users for a particular purpose. Cookies can be essential for the operation of an application or to improve the user experience. They can also be used to track user behaviour.\nInformation collected by cookies is classed as personal data.\nFor more information on cookies, their use and how to block them, you may want to visit www.aboutcookies.org.\n9.2 Managing cookies\nYou can set your browser to not accept cookies, but this may limit your ability to use the Services. You can also opt out of receiving interest-based ads from certain ad networks here (or if located in the European Union, here).\nIn your web browser (for example, Google Chrome, Microsoft Internet Explorer, Mozilla Firefox or Apple Safari), you can control which types of cookies you allow. Most browsers accept cookies automatically, but you can alter the settings of your browser to erase cookies or prevent automatic acceptance if you prefer. You can turn cookies on or off using your browser’s settings and you can also delete cookies and clear your browser’s cache (also known as your internet viewing history). Visit the ‘Options’ or ‘Preferences’ menu on your browser to change settings, and check the following links for more browser-specific information:\nThe Information Commissioner has also provided guidance here: https://ico.org.uk/your-data-matters/online/cookies/\nThis website may include links to third party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\nUnder data protection laws, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal information.\nYour right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights, though we may apply a basic administration fee where your information right is determined as being either “manifestly unfounded” or “manifestly excessive”. If you make a request, we have one month to respond to you, though an additional two months may be applied subject to the application of an exemption available to data controllers.\nPlease contact us at:\nBaggy Shanker, House of Commons, London, SW1A 0AA\nIf you have any concerns about our use of your personal information, you can make a complaint to us at:\nBaggy Shanker, House of Commons, London, SW1A 0AA\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\nWe keep our privacy policy under regular review (at least on an annual basis) and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website and we encourage you to regularly check back for any updates about how your data is used\nCopyright © 2022-2023 Baggy Shanker - All Rights Reserved.\nPromoted by James Shires on behalf of Baggy Shanker, both at Unit 2 Pride point drive, derby de24 8bx",
  "https_baggyshanker_com_/https_baggyshanker_com_about-me/content_3.html": "Supported by: Unite Unison GMB USDAW COMMUNITY NOMINATED BY: BLAGR\nPolitics is about people. Empowering people and advocating on their behalf has been at the heart of what I have done my whole life, first in communities all across our city and then in the council chamber representing the people of Sinfin ward in Derby South.\nBorn in Arboretum and raised in Normanton, I understand our neighbourhoods and their people, having served on numerous charitable and voluntary groups in Derby for over 30 years. From these early days in the heart of the constituency my parents instilled in me lessons about helping others and the importance of equality of opportunity.\nMuch of my community work and political activism was a result of my father’s influence. He came to the UK in the 1950s and worked in a foundry here in Derby. He prided himself on helping fellow immigrants settle into their new homes alongside work in our local community. Sadly, Dad passed away suddenly just before I was 21 and it was his untimely passing which inspired me to follow in his footsteps.\nIt's the values that he taught me which I have tried to pass on to my own children who were also born and brought up in Derby. They are both off to university to study medical courses and hope one day to work for our NHS, just like their mum does. My wife Suki and I are very proud of the adults they have become and are delighted that they too want to put something back into their community.\nAlongside my community and political activism, I have been a trade unionist working in the manufacturing and civil aerospace sectors for over three decades. I currently work at Rolls Royce, undoubtedly a Derby institution, and so understand what investment in good quality jobs in our city and region means to local people and the opportunities that arise when people are given a chance – like the chances I had as the son of an immigrant. I want others to be afforded those opportunities and would work tirelessly to make that a reality for people in Derby South and beyond.\nI want to be part of the next Labour Government. A Government that will provide security for working people, create safer neighbourhoods and properly fund our NHS. A Government that will make our country the best it can be. We have a real opportunity at the next general election to take down this scandalous Tory Government and create a better society; built on Labour, trade union and Co-operative principles; one that is fairer for all.\nWe’ve had a trusted advocate in Margaret Beckett for almost 40 years, she named me as the best person to be Derby South’s next trusted Member of Parliament and take the fight on behalf of the people of Derby South to Westminster. It's time for Labour to be in Government, bring respect back to our country, sort out our economy and look after every person.\nCopyright © 2022-2023 Baggy Shanker - All Rights Reserved.\nPromoted by James Shires on behalf of Baggy Shanker, both at Unit 2 Pride point drive, derby de24 8bx",
  "https_baggyshanker_com_/https_baggyshanker_com/content_1.html": "Supported by: Unite Unison GMB USDAW COMMUNITY NOMINATED BY: BLAGR\nSupported by: Unite Unison GMB USDAW COMMUNITY NOMINATED BY: BLAGR\nWatch my latest video to discover more about me and my priorities for Derby South.\nI have known Baggy Shanker for many years, from him being a young activist to the Leader of the Labour Group. I have always found Baggy to be bright, thoughtful and diligent and he has grown into a first-rate politician. After close to 40 years as your MP I have no hesitation in stating that I will be voting for Baggy to be my replacement and Labour's Candidate for Derby South and I urge you to do the same.\nCopyright © 2022-2023 Baggy Shanker - All Rights Reserved.\nPromoted by James Shires on behalf of Baggy Shanker, both at Unit 2 Pride point drive, derby de24 8bx",
  "https_baggyshanker_com_/https_baggyshanker_com_contact-me/content_2.html": "Supported by: Unite Unison GMB USDAW COMMUNITY NOMINATED BY: BLAGR\nIf you would like to support my campaign there are many ways you can help. Delivering letters, sharing social media posts, making phone calls or donating funds.\nDrop me a line to discuss how you can help me win, and I will get back to you soon!\nSign up to show your support and receive updates on my campaign\nCopyright © 2022-2023 Baggy Shanker - All Rights Reserved.\nPromoted by James Shires on behalf of Baggy Shanker, both at Unit 2 Pride point drive, derby de24 8bx"
}