{
  "https_candidates_reformukchorley_co_uk_jon_/https_candidates_reformukchorley_co_uk_jon/content_1.html": "Myself (right) with Richard Tice (Reform UK MP for Boston & Skegness)\nAbout me\nHi, and many thanks for visiting! I'm Jonathan Close, and I'm standing for Reform UK in the Lancashire County Council district of Euxton, Buckshaw and Astley for the local elections on 1st May 2025.\nI'm 41 years old and I was born and raised in Chorley. I've lived here for almost my entire life. In my early years I attended Clayton-Le-Woods CE Primary and St Michaels CE High School, followed by Runshaw college. I went on to earn an undergraduate degree in Computer Science at Lancaster University.\nSince then, I have worked in the IT industry and currently run a software engineering and IT company based in Bolton which specialises in an IBM platform.\nI took a keen interest in politics around 2006. It quickly became clear to me that Tony Blair had been taking this country in completely the wrong direction for many years. I found his constant interference in foreign affairs and blind obsession with closer integration with Europe and open borders deeply troubling. The pinnacle of my alarm was the Lisbon Treaty being railroaded through parliament without any proper debate or scrutiny, and without the public being properly informed on the serious ramifications of what we were being silently signed up to.\nI quickly developed conservative views on the realisation of how hard you have to work to be successful, own your own home, and to achieve a comfortable quality of life. I actively campaigned for the Conservatives and was a Tory party member until 2022. Like so many, I felt completely betrayed by their total inaction and failure to get a grip on just about every issue being faced in this country\nI actively campaigned to leave the EU in 2016 and stand firmly behind this decision. I believe that any self-respecting country should have complete democratic control over its borders, laws, regulations, human rights, fishing grounds, taxes and trade policy. Under EU membership, these were all at least partly delegated to unelected officials in Brussels. Something I found to be unacceptable.\nI became a Reform UK member in 2024 and then more closely involved with the party in January when our Chorley branch was set up. I initially joined as secretary to help in any way I could. This quickly progressed to me becoming our branch Campaign coordinator and a candidate for the upcoming local elections! Roles I was deeply honoured to accept.\nElections on Thursday 1st May 2025\nFor anyone not familiar with how local elections work. In Chorley we have 2 sets of main local elections. One for our County Council which is Lancashire, and one for our Borough Council, which is Chorley. We also technically have Parish Council elections too, but I won't cover those here.\nLancashire County Council is responsible for things like education, social care, infrastructure, roads etc. Chorley Borough Council is smaller and responsible for things like refuse collection, recycling, environmental health and providing leisure facilities locally.\nThe elections on 1st May are for Lancashire County Council, although there is a by-election being held in the Ward of Chorley East for Chorley Borough Council on the same day. Therefore, unless you live in Chorley East, your vote on 1st May is only to elect a representative to be in charge of decisions taken for Lancashire County Council.\nOverall, Reform UK have 84 candidates standing in all 82 districts of Lancashire (2 of the larger districts elect 2 candidates each). All Reform UK candidates standing are ordinary, honest, decent, caring and hardworking people like me who have been carefully vetted over a number of weeks. We are from all backgrounds, including teachers, NHS workers, business owners, social carers etc. We are highly motivated, serious and aim to prove to the people of the north-west that we can change Lancashire and this country for the better.\nAlthough the elections on 1st May are for local government, please do not underestimate how crucial they are in the journey for national change. Reform UK need local councillors in office to give us a strong platform to challenge the next General Election. Not least because we need to prove that we are serious, capable, safe and most importantly, competent custodians of this wonderful country.\nWhether you usually vote at local elections or not, I ask that you please do so on 1st May and support us. I believe the future of our country now depends on it.\nLocal issues\nAt a local level, I believe Lancashire County Council urgently needs reform. Many years of mismanagement have resulted in huge debts (£1.18 billion) and an eye-watering daily interest burden of over £100,000. Freedom of Information requests conducted by Reform UK have also revealed huge levels of wasteful spending including:\n- £132,000 spent annually on salaries for pointless diversity officers\n- £520,000 wasted on \"Ergonomic chairs\"\n- £261,000 spent on translation and interpreters\n- £236,000 salary for Lancashire County Council CEO (more than the prime minister)\n- £394,000 awarded to private consultants for \"medium term ambition setting\"\n- Poorly negotiated and rip-off long-term contracts with companies providing council services, such as for pothole repair.\nMore widely across the country (not specific to only Lancashire), Reform UK have found that:\n- There are over 3,000 council staff earning salaries of over £100,000 per year\n- All Councils have backlogs of many thousands, or even tens of thousands of potholes to repair (County Durham has over 65,000 that are outstanding for repair. 27 per mile of road!)\nLocal policy\nLocally, Reform UK will:- Immediately audit the Council's accounts to cut wasteful spending\n- Cancel any fraudulent contracts with companies providing council services\n- Immediately cut wasteful spending of anything not beneficial to the residents of Lancashire\n- Introduce a British-style DOGE system to audit and hold all future Council spending to account\n- Oppose the re-organisation of local government (Chorley Borough Council is due to be swallowed up into a larger unitary council)\n- Oppose asylum seekers being housed in hotels and social/private accomodation in Lancashire, which should be being used for British people\n- Fix all potholes and get our roads up to standard as quickly as possible\n- Slash eye-watering and unjustified salaries for council bosses\n- Cut all 'woke' nonsense, including diversity officers and associated schemes\n- Cut all spending on green initiatives with zero or dubious benefit\n- Force council departments to find a £5 saving in every £100 from their budgets\n- Freeze your council tax bills\nWe will ensure that your money goes further to improve services, without forcing you to pay more.\nIn Closing\nMany thanks for reading. I hope you will consider supporting me and Reform UK on Thursday 1st May. If you'd like to know more, want to discuss a local issue, or would just to chat and get to know me! You can reach me at:jon.close@reformukchorley.co.uk\nPromoted by Jonathan Close on behalf of themselves at 124 City Road, London, EC1V 2NX (Reform UK HQ)"
}