{
  "https_tompickup_com_/https_tompickup_com_reform-uk-farming-policies/content_5.html": "’ve been asked a few times recently about Reform UK’s farming policies, so I thought I’d share them publicly in an article.\nIn the 2024 Manifesto, Reform UK proposed several policies relating to farming, which aim to help small farms.\nAs I have lived rurally, I understand a lot of the challenges that come with rural life and greatly value British farming. I think it’s important that people know what Reform UK intends to do for farmers if/when in power.\nThe last one is something I think can be pushed locally to not only help farms and young people get experience of farms and have the choice to go into it, but to tackle anti-social behaviour via outdoor pursuits. If elected I’ll be keen to engage with farms, youth clubs, scouts, DofE and see what we can come up with to get the next generations knowledgeable and skilled in farming and the outdoors.\nAll ideas and feedback on what we can do locally in Padiham & Burnley West is most welcome.",
  "https_tompickup_com_/https_tompickup_com_lancashire-county-council-waste-refugee-translation/content_39.html": "What Is Happening?\nOn 7th April 2025, Lancashire County Council put out a notice regarding a £720,000 + VAT contract for ‘the provision of interpretation and translation for Lancashire refugee integration team and named providers’.\nThe Lancashire County Council projected budget deficit for 25/26 financial year is £7.814m, this tender value is nearly 10% of it!\nWhat I Will Do\nWith Reform in power, not only will the influx of refugees from France and illegal immigrants be stopped, but money will be saved on nonsense like this. Reform County Councillors will leave no stone unturned in getting value for taxpayer money.\nUntil Reform win the next General Election, we’ll be limited to just what we can achieve at Lancashire County Council. I will look into how this tender will be used and explore replacing it with technology wherever possible, to reduce spending. Google Translate is free.\nWhat You Can Do\nVote Reform. Now, more than ever, we need Reform County Councillors at County Hall, fighting against wastes of our money like this.\nOver 70p for every £1 of Council Tax we pay goes to Lancashire County Council. Servicing the £7.814m expected new debt they’ll create in the next year will cost money in interest, so the true cost of this waste is amplified. Lancashire County Council needs Reform. Reform needs you to get out and vote for us!\nSources\nYou can read the LCC notice here: https://www.find-tender.service.gov.uk/Notice/013482-2025#award_contract-1",
  "https_tompickup_com_/https_tompickup_com_politics/content_2.html": "Great Britain is in great need of reform. Our services are at breaking point. Trust in the main political parties and their politicians is practically non-existent.\nI’m standing for Reform UK in my local ward, Burnley West and Padiham, to do what I can to help deliver the changes the towns, Lancashire and the UK need.\nWe can all unite behind looking out for younger and older generations. Improving services for them is close to my heart and will be a key focus. Lancashire County Council are planning big cuts and we need someone to represent our area who will reduce waste and give us a voice in decisions. Only Reform UK can and will do this.\nUsing my experience working at Lancashire County Council in procurement, and my career afterwards in business, if elected I’ll be doing everything I can to engage with businesses to boost the local economy & create better jobs, listening to what they need and creating opportunities for them us all to thrive.\nBurnley West & Padiham\nBurnley Central East\nBurnley Central West\nBurnley Rural\nBurnley Southwest\nBurnley Northeast\nBurnley Chairwoman\nBurnley Treasurer",
  "https_tompickup_com_/https_tompickup_com_swimathon-2025/content_33.html": "What Am I Doing?\nOn 29th-31st March 2025, I undertook the ‘Triple 5km’ challenge, for the Swimathon Foundation, to raise awareness and funds for Cancer Research (UK) and Marie Curie, at Burnley and Padiham Leisure Centres.\nThe Triple 5km challenge consists of 5km swims, on 3 consecutive days (15km in total).\nWhat Is Swimathon?\nSwimathon’s challenges range from individual; 400m to Triple 5km, or team; 1.5km to 5km. To take part, check out Swimathon’s website on the link below.\nThere is an unofficial Triple Triple 5km, of doing 3x5km swims, on 3 consecutive days, but I only found out about it after Swimathon finished, so I’ve signed up to doing it in 2026. I’ll worry about that next year!\nHow Did It Go?\nWet. But managed it just fine! Thank you to those who donated and the staff who counted the laps! 600 in total.\nHow To Donate\nLinks to Swimathon and the Cancer Research & Marie Curie donation pages are as follows:\n(Article updated 6th April 2025)",
  "https_tompickup_com_/https_tompickup_com_what-can-be-done-about-nuisance-bikes/content_45.html": "What Is Happening?\nThere have been many reports of nuisance bikes in the Ward, such as the behaviour of electric bike riders on & off road in neighbourhoods and motorbikes & quad bikes causing damage to Hapton Moor / Hameldon Hill and Quarry.\nThe Burnley Express published an article in March about the damage done to the moor by motorbikes and quad bikes, reportedly it will take years for the land to recover.\nHapton Moor / Hameldon\nAs a hiker, I’ve witnessed the nuisance and antisocial behaviour of some bikers on the moor, as well as the damage the bikes and quad bikes can do to land on Hapton Moor and Hameldon, as well as Burnley Golf Club recently.\nPotential solutions:\nAnother part of the problem is the lack of an adequate legal site for off road motorcyclists to use nearby, the closest major track being Bacup MX track (aka Bacup Quarry), which attracts people from all over the North West, but doesn’t have provisions like PPE hire (helmets, goggles and boots) available and limited bike hire.\nIt would be nice to see a good track set up in the Burnley Borough, to encourage visitors to the area to spend money here and to enable people who wish to enjoy motorsports to do so, while reducing illegal activity, trespassing, damage to the environment and the nuisance caused to members of the public and residents.\nAs an off-road biker, I’m aware of the lack of provision locally for the motorsport, as well as the barriers for some in accessing the sport, not only having to buy all the equipment, but also having to network to get a van or trailer to transport the bikes and equipment to a track if they don’t have their own.\nThe Ribble Valley has the ‘Inch Perfect’ trials bike facility, which has bike hire and instructors available.\nIf elected, while it is not the easiest thing to achieve, I’d be keen to engage with bikers and interested land owners and entrepreneurs to see if anything can be done on this front.\nEngaging with, promoting and supporting the activities of Burnley District Motorcycle Club could also be helpful, as keen motorcyclists networking with other bikers and sharing the law abiding ethos of motorcycling clubs would promote more opportunities for bikers to enjoy their passion together without causing nuisance, such as sharing transport to tracks and organising track days where Club members attend.\nElectric Bikes\nThe police prioritising tackling electric bikes would make a lot of difference, particularly having strong presence in known hotspots, seizing bikes which are illegally modified to exceed the speed limit (15.5mph) and electric bikes which don’t require pedalling, but aren’t road taxed mopeds.\nLancashire County Council has spent millions on a ‘Bikeability’ scheme, so some form of voluntary registration scheme via that and courses offered via retailers and in schools, colleges and bike clubs to promote safe and considerate use would also help.\nThis is somewhat a national issue, but the above changes in Padiham & Burnley West would be a good start and I not enough is being done to improve things for residents and bikers.",
  "https_tompickup_com_/https_tompickup_com_lancashire-county-council-waste-high-earning-staff/content_35.html": "What Is Happening?\nThe pay for Lancashire County Council’s top staff jumped up by £940,000 from 22/23 to 23/24, according to figures only released this year.\nLCC’s projected budget deficit for the 24/25 financial year was £2.908m, but has jumped up for the 2025/26 financial year to £7.814m.\nIt seems inexcusable to me to increase the top brass’s pay by £940k, while the books aren’t balanced. And we don’t know what their pay has increased by since!\nThis feels like an insult to taxpayers, especially while many Council Tax bills are rising.\nWhere’s all the money going?\nTop of the list was the CEO, on £236k+ a year (inc. pension contributions).\nSecond was the Executive Director of Adult Services and Health and Wellbeing – £202k+.\nThird was Director for Education and Children’s Services, £200k+.\nFourth was the Executive Director for Resources (now the LCC CEO), on £194k+.\nMany other roles earning over £100k a year were not even disclosed.\nWhere Does All The Money Come From?\nUltimately, all of us.\nMost of our Council Tax payments go to LCC (over 70 pence of every £1 paid).\nMost of the tax that goes to HMRC goes to the Government, then some is sent to County Councils, often with strings attached on what they can spend it on.\nThe Government and County Councils also borrow vast sums we can’t afford.\nUltimately all of us and our children will have to pay it back and suffer the consequences, while the people in power presiding over this mess are paid handsomely for worsening it.\nWhat You Can Do\nVote for Reform UK on 1st May, to ensure the current Conservative and Labour Councillors are replaced by people who have the will to sort this mess out and spend taxpayer money like it’s our own, because it is!\nOtherwise, getting involved in helping us any way you can and holding your County Councillor accountable makes a huge difference.\n8 County Councillors didn’t even show up to the 2025 LCC Budget Meeting on 26th Feb 2025; Peter Britcliffe, Alan Hosker, Terry Hurn, Hasina Khan, Stuart Morris, David Westley and Phillippa Williamson.\nI can’t find any record of any of them waiving their taxpayer funded allowances for February!\nSources\nStatement of accounts: https://www.lancashire.gov.uk/media/952766/statement-of-accounts-2023-24.pdf\nBudget meeting attendance: https://council.lancashire.gov.uk/mgMeetingAttendance.aspx?ID=13633",
  "https_tompickup_com_/https_tompickup_com_the-infrastructure-that-brings-illegal-immigrants-into-our-communities-in-burnley-and-padiham/content_16.html": "This article breaks down some of the illegal immigration supporting infrastructure that operates in Burnley and Padiham, which organisations are facilitating it and how they’re funded.\nBefore doing so, I detail the below crime statistics (source: The Telegraph), which shows that asylum seekers from the biggest 2 nations of origin (Eritrea and Afghanistan) are more than twenty times more likely to commit a sex crime than British people. I don’t want this risk in our communities, I don’t want the infrastructure that supports this happening in our communities.\nSerco Group PLC\nSerco Group PLC is a company which provides many government services, including many migration related services. Last year their revenue was £4.7billion. Shares in the company are publicly traded on the London Stock Exchange, BlackRock Investment Management (UK) Ltd is one of their biggest shareholders.\nSerco are targeting landlords in Burnley and Padiham and enticing them to house illegal immigrants and asylum seekers in our communities, by offering them a government funded 5-years of guaranteed rent, advertised as being paid on-time every month, as well as providing free repairs, maintenance and property management.\nThe government don’t do this for homeless veterans, they don’t do it for our elderly and vulnerable who are in desperate need of social housing, but they do it for those who’ve arrived illegally from France, paying organised criminal people traffickers to get here. Shame on the government and Serco.\nLancashire County Council\nLancashire County Council’s refugee resettlement team has grown in only a few years, from having 1 member of staff, to 29 staff. Their work helping illegal immigrants and asylum seekers has been nominated for a national award.\nThis is while other public services provided by LCC suffer, such as the £479m backlog of highways works, with only a budget of £74m this year, which the Tories plan to quietly cut by £30m next year.\nWe can’t afford to fix the roads, but we can afford to provide award nominated level of support to illegal immigrants. Shame on Lancashire County Council.\nBurnley Council\nBurnley Council got a nearly £500k fund from the Government to support asylum seekers in Burnley, so is now actively spending this vast sum of taxpayer money on infrastructure to support illegal immigrants and asylum seekers to come and settle here, which makes it more attractive for asylum seekers to come here and be sent here.\nThe more asylum seekers and illegal immigrants that come, the more likely it is that people they know will follow them to our communities. The more infrastructure we have to support this, the more governmental and charity organisations will see Burnley as a place to send refugees. Shame on Burnley Council.\nNew Neighbours Together CIO\nThe award winning asylum seeker support charity, based in Burnley, claims on their website to have 40 staff & volunteers helping asylum seekers here.\nLast year’s accounts for the charity shows they had a £57k+ grant from Burnley Council, a £56k+ grant from ‘Reaching Communities’ and a £14k+ grant from Sport England.\nIf we don’t have organisations like this, asylum seekers will likely go elsewhere, where they get award nominated support.\nWhat Sport England is doing spending this much money on illegal immigrants playing badminton (or whatever they’re doing) is beyond me.\nWhat We Will Do\nOnly Reform UK will dismantle the refugee support economy and infrastructure, stop their funding and deport illegal immigrants, shifting the focus back to British people.\nThe Tories were elected with a huge mandate under Boris Johnson to ‘stop the boats’, they ousted the leader the public chose and failed to deliver on what they’d promised.\nLabour were elected with a huge mandate to ‘smash the gangs’…illegal immigration via illegal boat crossings from France this March (2025) was higher than it was last March (2024).\nThe have had their chance, they have failed, Britain needs Reform.",
  "https_tompickup_com_/https_tompickup_com_newsletter/content_27.html": "Thomas Pickup\nHome\nBusiness\nCharity\nPolitics\nGet Involved\nX\nContact\nNewsletter\nSign up to the newsletter\nContaining all the latest articles & news, on business, charity events, hobbies & politics\nPlease enable JavaScript in your browser to complete this form.\nPlease enable JavaScript in your browser to complete this form.\nEmail Numbers Name\nName\n*\nFirst\nLast\nYour full name\nEmail\n*\nYour email address\nNumbers\nYour phone number (optional)\nSubmit\nContact",
  "https_tompickup_com_/https_tompickup_com_on-alan-hosker/content_41.html": "What Is Happening?\nThe current Conservative County Councillor for Padiham & Burnley West, Alan Hosker, leafleted everyone, claiming I’m a name on a piece of paper and that no one else will do half as much as he does.\nEvidence shows he only attended 44% of County Council meetings he was expected at. He didn’t even apologise for not showing up for over a quarter of the absences.\nWhat I did\nI put out a post on Facebook about this, detailing his attendance, him taking thousands in his taxpayer allowance for not turning up half of the time and his track record of conduct investigations, to which he’s made excuses, claimed it’s not his fault and refused to apologise.\nYou can read the Facebook post by clicking here.\nWhat Happened\nAlan blocked me, put out a post blaming his poor health and covid restrictions and saying I should be ashamed of myself.\nA small group of his vocal followers then commented to defend him and criticise me. This includes a woman who is alleged to be his partner, Wendy, who made a series of bizarre claims and factually inaccurate statements. Most of Wendy’s comments have now been deleted.\nWhat I did\nI’ve made a follow up post, with evidence to show that Alan was well enough to attend Burnley Council meetings in person throughout this period, as well as questioning whether\nYou can read it by clicking here.\nConclusion\nI hate seeing politicians slating each other as much as the next person, but I thought it’s in the public interest for voters to know the Tory candidate asking for their vote doesn’t even turn up half the time. This is the last I’ll say on this, the point has been made.",
  "https_tompickup_com_/https_tompickup_com_2025_04_08/content_40.html": "Lancashire County Council Waste: Refugee Translation\nTomPickup.com | Politics Lancashire County Council Waste: Refugee Translation What Is Happening? On 7th April 2025, Lancashire County Council put out a notice regarding a £720,000 + VAT contract for ‘the provision of interpretation and translation for Lancashire refugee integration team and named providers’. The Lancashire County Council projected budget deficit for 25/26 financial year […]",
  "https_tompickup_com_/https_tompickup_com_chester-marathon/content_32.html": "What Am I Doing?\nThe Chester Marathon, for the North West Air Ambulance charity.\nWhat Is The Chester Marathon?\nRunning 26 miles and 385 yards, or 42.195km, in and around the City of Chester, in Cheshire. I chose to do it for North West Air Ambulance.\nHow’s It Going?\nAs of 5th April 2025, I’ve just started training, and I’ve done 1km so far! So a long way to go yet.\nHow To Donate\nI’ll set up a specific fundraising page for this soon.\nWhat Else I’m Doing\nMarch 25 – 100 Miles for Mind | Swimathon 2025 | 10km Swim for Cancer Research\nApril 25 – 50 Miles for Sands\nSummer 25 – Olympic Triathlon | Baby G Cycle\nAutumn 25 – Chester Marathon",
  "https_tompickup_com_/https_tompickup_com_olympic-triathlon/content_19.html": "What Am I Doing?\nAn Olympic Triathlon, for the Baby G charity. A 1.5km swim, a 40km bike ride and a 10km run.\nWhat Is the Baby G Charity\nThe Baby G charity was set up in memory of baby Graham Hurst, who was born sleeping. His parents were determined to raise money in his memory and do something positive, since then Bay G has raised a fortune across many fundraising events and purchased incubators for hospitals, which sadly there is a shortage of funding for.\nHow’s It Going?\nAs of 5th April 2025, I’m well over trained for swimming (after doing Swimathon 2025 and 10km Swim for Cancer Research), I’ve just started training for running the Chester Marathon in October and the cycling I’ve been steadily working on since February on a spin bike.\nHow To Donate\nI’ll set up a fundraising page soon.\nWhat Else I’m Doing\nMarch 25 – 100 Miles for Mind | Swimathon 2025 | 10km Swim for Cancer Research\nApril 25 – 50 Miles for Sands\nSummer 25 – Olympic Triathlon | Baby G Cycle\nAutumn 25 – Chester Marathon",
  "https_tompickup_com_/https_tompickup_com_100-miles-for-mind/content_7.html": "What Am I Doing?\nHiking and running 100 miles, for Mind, the mental health charity. Mind is a cause close to my heart, everyone I know, including me, has struggled with their mental health at times in their lives!\nWhat Is 100 Miles for Mind?\nMind challenged people to hike, or run, 100 miles over March 2025, to raise awareness and funds.\nHow’s It Going?\nIn total I needed to do 100 miles, or 160.934km.\nI did:\nWeek One\n1st – 6.6km | 2nd – 2.3km | 3rd – 5.4km | 4th – 8.7km | 5th – 10.9km | 6th – 8.2km | 7th – 11.3km\nWeek Two\n8th – 8km | 9th – 7.1km | 10th – 4.3km | 11th – 6.1km | 12th – 6.9km | 13th – 4.2km | 14th – 8.2km\nWeek Three\n15th – 3.6km | 16th – 2.1km | 17th – 5km | 18th – 3.5km | 19th – 10.98km | 20th – 1.5km | 21st – 3.1km\nWeek Four\n22nd – 5.3km | 23rd – 0.61km | 24th – 1.4km | 25th – 1.1km | 26th – 5.9km | 27th – 3.5km | 28th – 13km\nWeek Five\n29th – 5.2km | 30th – 3.3km | 31st – 11.9km\nTotal = 169.19km\nHow To Donate\nLinks to 100 Miles for Mind and Mind donation pages:\nWhat Else I’m Doing\nMarch 25 – 100 Miles for Mind | Swimathon 2025 | 10km Swim for Cancer Research\nApril 25 – 50 Miles for Sands\nSummer 25 – Olympic Triathlon | Baby G Cycle\nAutumn 25 – Chester Marathon",
  "https_tompickup_com_/https_tompickup_com_stop-the-merger-of-burnley-and-blackburn-councils/content_17.html": "What Is Happening?\nLabour plan to merge Burnley and Blackburn Borough Councils. Unless we unite against this, Burnley will be ruled by Blackburn\nWhat I will do\nI’ve created a petition to show that the people of Burnley and Padiham are against this. Only Reform UK will stand up strongly with the people against things like this. Labour clearly don’t know our town, or us, if this is their plan. The Tories have done a lot of talking over the last decade, but their talking never leads to the action we want to see.\nWhat can I do?\nPlease click the link below to sign the petition via the link below to say No Nay Never to the merger of Burnley and Blackburn councils:\nhttps://www.change.org/p/stop-the-merger-of-burnley-and-blackburn-councils/",
  "https_tompickup_com_/https_tompickup_com_author_tompickup_page_3/content_37.html": "Chester Marathon\nTomPickup.com | Charity Chester Marathon What Am I Doing? The Chester Marathon, for the North West Air Ambulance charity. What Is The Chester Marathon? Running 26 miles and 385 yards, or 42.195km, in and around the City of Chester, in Cheshire. I chose to do it for North West Air Ambulance. […]\n10km Swim For Cancer Research\nTomPickup.com | Charity 10km Swim For Cancer Research What Am I Doing? Swimming 10km in March for Cancer Research, the cancer charity. What Is Swim 10km For Cancer Research? Cancer Research challenged people to swim 10km in March 2025, to raise awareness and funds to fight cancer. As I was doing the […]\n100 Miles For Mind\nTomPickup.com | Charity 100 Miles For Mind What Am I Doing? Hiking and running 100 miles, for Mind, the mental health charity. Mind is a cause close to my heart, everyone I know, including me, has struggled with their mental health at times in their lives! What Is 100 Miles for Mind? […]\nSwim 22\nTomPickup.com | Charity Swim 22 What Am I Doing? Swimming 44 miles for Diabetes UK. Diabetes UK support those who suffer from diabetes and work on finding treatments and a cure. What Is Swim-22? Diabetes UK have created the ‘Swim 22’ challenge as a fundraiser, to raise awareness and money for their […]\nLocal Services and Businesses\nTomPickup.com | Charity Local Services and Businesses What Is Happening? Lancashire County Council is in huge debt, the daily interest rates are colossal. To balance the books, they’re planning huge cuts. That means cuts to the services we rely on and need. Why Has This Happened? For years, the two main political […]\nTransparency\nTomPickup.com | Charity Transparency What’s Happening Nationally? Trust in politicians is at an all time low. The two main parties have broken promise after promise. There is zero accountability. Whether for lining their pockets with millions in PPE money, or leaving our pensioners in the cold without Winter Fuel Payments, they face no consequences. They […]\nStop The Merger of Burnley and Blackburn Councils\nTomPickup.com | Charity Stop The Merger of Burnley and Blackburn Councils What Is Happening? Labour plan to merge Burnley and Blackburn Borough Councils. Unless we unite against this, Burnley will be ruled by Blackburn What I will do I’ve created a petition to show that the people of Burnley and Padiham are against this. Only […]\nSwimathon 2025\nTomPickup.com | Charity Swimathon 2025 What Am I Doing? On 29th-31st March 2025, I undertook the ‘Triple 5km’ challenge, for the Swimathon Foundation, to raise awareness and funds for Cancer Research (UK) and Marie Curie, at Burnley and Padiham Leisure Centres. The Triple 5km challenge consists of 5km swims, on 3 consecutive days (15km […]",
  "https_tompickup_com_/https_tompickup_com_2025_04_05/content_23.html": "Local Services and Businesses\nTomPickup.com | Charity Local Services and Businesses What Is Happening? Lancashire County Council is in huge debt, the daily interest rates are colossal. To balance the books, they’re planning huge cuts. That means cuts to the services we rely on and need. Why Has This Happened? For years, the two main political […]\nTransparency\nTomPickup.com | Charity Transparency What’s Happening Nationally? Trust in politicians is at an all time low. The two main parties have broken promise after promise. There is zero accountability. Whether for lining their pockets with millions in PPE money, or leaving our pensioners in the cold without Winter Fuel Payments, they face no consequences. They […]\nStop The Merger of Burnley and Blackburn Councils\nTomPickup.com | Charity Stop The Merger of Burnley and Blackburn Councils What Is Happening? Labour plan to merge Burnley and Blackburn Borough Councils. Unless we unite against this, Burnley will be ruled by Blackburn What I will do I’ve created a petition to show that the people of Burnley and Padiham are against this. Only […]",
  "https_tompickup_com_/https_tompickup_com_business/content_8.html": "Thomas Pickup\nI started my career in construction, then went into procurement for Lancashire County Council (construction & property related buying), followed by a career in business.\nMy expertise covers:",
  "https_tompickup_com_/https_tompickup_com_reform-uk-burnley-page-removed-by-facebook/content_49.html": "What Is Happening?\nOn Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page.\nFollowing an appeal, the page was then swiftly completely removed by Facebook, on the same day.\nThis was not for anything the page posted. The reason given by Facebook for the suspension was for ‘impersonation’, citing examples of their policy being ‘creating a page that looks like it belongs to a brand or business’, despite it being the official Burnley branch page and never having been asked for authentication of this by Facebook.\nThe other parties haven’t had their local pages suspended and removed during the campaign for this reason. Based on the content of the page, no unbiased observer would logically conclude that the Reform UK – Burnley page isn’t what it purports to be.\nI have therefore reported both the Burnley Labour and Burnley Conservatives pages under the same Facebook rule, to see if they apply their rules equally. As of time of writing, their pages are still visible and the reports haven’t been replied to. I don’t believe in their pages being removed, I’m merely seeing if the rules are equally applied.\nGiven the short space of time between now and the local elections, it seems to be yet another case of potential election subversion by a social media company.\nCommentary\nUnder Tory and Labour leadership, the UK has seen a culture develop of political censorship, people being dragged through the courts and even locked up for what they post online.\nThis development, during an election campaign, is highly concerning. No political party should be subject to this, it gives others an unfair advantage. Reform UK are the UK’s leading political party according to many polls, including Burnley, so it is undoubtably in the public interest for our voice to be heard.",
  "https_tompickup_com_/https_tompickup_com_contact/content_4.html": "Thomas Pickup\nHow to contact me\nReform UK, 124 City Road, London, EC1V 2NX\ntom@tompickup.com\nPlease email first for my phone number\nAnytime",
  "https_tompickup_com_/https_tompickup_com_lancashire-county-council-waste-what-can-be-done-about-the-720k-refugee-translation-tender/content_29.html": "What Is Happening?\nI recently wrote about Lancashire County Council awarding a £720,000 tender for refugee interpretation and translation services.\nA voter wrote to me and asked what can be done about it should Reform get into power at County Hall, which is a valid and interesting question to explore.\nWhile it’s easy to point out wastes of money, it’s not always easy to stop them and the reasons behind spending are not always apparent.\nMy answer is below:\nMy Response\nGood Morning X,\nInteresting question. As I’m not sure of your background knowledge on the subject and it’s a wide-ranging topic, I’ve answered as comprehensively as possible with brevity.\nLancashire County Council are obliged by the Equality Act 2010 and Local Government Association (LGA) guidance to make their services ‘accessible’ to all. The legal interpretation of the Act and guidance means that, in the absence of the Government changing the law and the LGA guidance changing accordingly (which is only likely with a Reform government), translation services are required in some form, for the foreseeable.\nWhat form those services take, and getting value for money for the taxpayer within the legal parameters (until there is a change of government), is another matter. However as this tender has already been awarded, there’s likely to be severance fees that would make it costly to get out of, and it may have restrictions on reducing the amount the tender is used.\nIn terms of interim solutions for when the tender expires and before a Reform Gov that can be implemented at County Hall, I would strongly argue that existing free translation technology is adequate for translating most languages in a manner that is legally compliant, particularly the primary languages of most of the nations which most refugees, and those seeking asylum, statistically originate from. Paid software is better, while typically being notably cheaper than the contract value.\nOther alternative solutions exist, like utilising language learning models and AI for bespoke solutions, advertising for voluntary translators, directly employing translators for less cost, creating specific form-based solutions in each commonly used language for common tasks etc.\nWithout fully reviewing the tender documents, such as the RFQ’s and bids etc., and without being at County Hall to best assess the situations which translators are used in, it’s hard to drill into the details and suggest specific remedies for each cost-incurring situation and classify them to create a workable policy to reduce cost, and of course it’d have to be cleared with the Council’s legal team, so it’s not something I can easily do from the outside.\nWhen I worked at LCC it was typical that expensive translators would be used as a first option, without attempting to use technology, and that tender exercises would often be poorly considered in a general sense before being started, leading to much waste.\nIn the detail provided in the Gov.uk link below, there are situations in which technology-based translation solutions would be appropriate and more efficient, such as document translation.\nAccording to the link, the contract has been awarded to DA Languages Ltd, of Manchester (who are presumably actually ‘D A Languages Ltd’, as no DA Languages Ltd exists), whose accounts show £45m+ turnover with £18m+ profit, so it’s reasonable to conclude that perhaps the Council could achieve better value by utilising technology, employing translators directly, or seeking a different kind of contract and partnership with the private sector at better value.\nStrangely the link also lists the ‘reason for not providing organisation identifier’ as them being a sole trader, despite apparently being a private limited company, so something else that needs checking.\nI look forward to exploring this further at County Hall and consulting their legal and other teams on how to reduce the costs and putting better ways of working in place for after this contract ends may be most efficient, which seems to reflect the views of the majority of the public on this subject.\nI have the will to eliminate LCC deficit by taking an approach of ‘leaving no stone unturned’ on every tender, this one is a drop in the ocean.\nIf you have any ideas, suggestions, or further questions, then I’m all ears. Often these conversations are easier to have on the phone, or in person, so happy to do either if you wish.\nFootnote\nI think this accurately summarises why it’s imperative to have eager minds at LCC who wish to proactively look into these things. We pay enough money in tax to get better services, it is wasted.\nThe Reform County Councillor Candidates I’ve spoken with, in Burnley and beyond, all have an active interest to treat taxpayers money like it’s their own and clean up the mess of years of Tory and Labour mismanagement. But we can only do it with your help and voters.\nSources\nTender https://www.find-tender.service.gov.uk/Notice/013482-2025.",
  "https_tompickup_com_/https_tompickup_com_swim-22/content_22.html": "What Am I Doing?\nSwimming 44 miles for Diabetes UK. Diabetes UK support those who suffer from diabetes and work on finding treatments and a cure.\nWhat Is Swim-22?\nDiabetes UK have created the ‘Swim 22’ challenge as a fundraiser, to raise awareness and money for their cause. The hardest challenge they offer is to double the 22 miles, swimming 44 miles, between 22nd March and 22nd June 2025.\nHow’s It Going?\nIn total I need to do 70.811km (44-miles)\nI’m on 16.35km, as of the 5th April. So a couple of weeks in, I’m just over 23% completed.\nMarch\n22nd March – 750m | 27th March – 250m | 29th March – 5,000m | 30th March – 5,000m | 31st March – 5,000m\nApril\n5th April – 350m\nTotal so far = 16.35km\nHow To Donate\nLinks to Swim 22 and to donate to Diabetes UK:\nWhat Else I’m Doing\nMarch 25 – 100 Miles for Mind | Swimathon 2025 | 10km Swim for Cancer Research\nApril 25 – 50 Miles for Sands\nSummer 25 – Olympic Triathlon | Baby G Cycle\nAutumn 25 – Chester Marathon",
  "https_tompickup_com_/https_tompickup_com_author_tompickup/content_26.html": "Reform UK’s Farming Policies\nTomPickup.com | Politics Reform UK’s Farming Policies ’ve been asked a few times recently about Reform UK’s farming policies, so I thought I’d share them publicly in an article. In the 2024 Manifesto, Reform UK proposed several policies relating to farming, which aim to help small farms. As I have lived rurally, I understand a […]\nApplying School Absence Rules to Tory Councillors\nTomPickup.com | Politics Applying School Absence Rules To Tory Councillors What would happen if you applied school absence rules to Tory Councillors in Lancashire? In schools in the UK, less than 95% attendance is considered as ‘bad’ and less than 90% attendance is considered ‘persistent absence’. In Lancashire County Council, out of the 46 Tory […]\nThe Infrastructure That Brings Illegal Immigrants Into Our Communities In Burnley and Padiham\nTomPickup.com | Politics The Infrastructure That Brings Illegal Immigrants Into Our Communities In Burnley and Padiham This article breaks down some of the illegal immigration supporting infrastructure that operates in Burnley and Padiham, which organisations are facilitating it and how they’re funded. Before doing so, I detail the below crime statistics (source: The Telegraph), which […]\nLancashire County Council’s £479 Million Highways Backlog of Works\nTomPickup.com | Politics Lancashire County Council’s £479 Million Highways Backlog of Works What Is Happening? Lancashire County Council’s Highways Department have a maintenance backlog of £479 million. This is work that has been identified as needed to be done. The Tory-led Council’s highways budget for this year is only £74m. The backlog consists of required […]\nAsylum Seekers In Lancashire Costs The Taxpayer More Than Lancashire County Council’s Total Debt\nTomPickup.com | Politics Asylum Seekers In Lancashire Costs The Taxpayer More Than Lancashire County Council’s Total Debt How Many Asylum Seekers Are In Lancashire? According to 2021 Census data, Lancashire is home to 37,277 ‘resettlers’, people who have come here as refugees or asylum seekers. According to Lancashire County Council, as of 2023 there were […]\nWhat Can Be Done About Nuisance Bikes?\nTomPickup.com | Politics What Can Be Done About Nuisance Bikes? What Is Happening? There have been many reports of nuisance bikes in the Ward, such as the behaviour of electric bike riders on & off road in neighbourhoods and motorbikes & quad bikes causing damage to Hapton Moor / Hameldon Hill and Quarry. The Burnley […]\nMy Objections To The Planning Application Off Green Close\nTomPickup.com | Politics My Objections To The Planning Application Off Green Close What Is Happening? A planning application is under consideration for the building of 9 dwellings off Green Close. The proposed development will back onto the houses on Apex Close. This is in the Burnley West part of the ward, close to Burnley Golf […]\nHousing Development Causing Dust Issues\nTomPickup.com | Politics Housing Development Causing Dust Issues For Residents What Is Happening? A large housing development off Rossendale Road, in the Padiham & Burnley West ward, is apparently causing dust issues for residents. This was reported to me by a local resident, among other concerns about the site. Upon visiting the area, I witnessed […]\nWho Are Burnley’s Current County Councillors, What Do They Do And How Much Do They Get Paid?\nTomPickup.com | Politics Who Are Burnley’s Current County Councillors, What Do They Do And How Much Do They Get Paid? What Do County Councillors Do? County Councillors are responsible for setting policies and making decisions for the whole of Lancashire, for everything Lancashire County Council presides over. They decide matters relating to: Education (schools, special […]\nLancashire County Council Waste: What Can Be Done About The £720k Refugee Translation Tender\nTomPickup.com | Politics Lancashire County Council Waste: What Can Be Done About The £720k Refugee Translation Tender What Is Happening? I recently wrote about Lancashire County Council awarding a £720,000 tender for refugee interpretation and translation services. A voter wrote to me and asked what can be done about it should Reform get into power […]",
  "https_tompickup_com_/https_tompickup_com_2025_04_27/content_24.html": "Applying School Absence Rules to Tory Councillors\nTomPickup.com | Politics Applying School Absence Rules To Tory Councillors What would happen if you applied school absence rules to Tory Councillors in Lancashire? In schools in the UK, less than 95% attendance is considered as ‘bad’ and less than 90% attendance is considered ‘persistent absence’. In Lancashire County Council, out of the 46 Tory […]\nThe Infrastructure That Brings Illegal Immigrants Into Our Communities In Burnley and Padiham\nTomPickup.com | Politics The Infrastructure That Brings Illegal Immigrants Into Our Communities In Burnley and Padiham This article breaks down some of the illegal immigration supporting infrastructure that operates in Burnley and Padiham, which organisations are facilitating it and how they’re funded. Before doing so, I detail the below crime statistics (source: The Telegraph), which […]",
  "https_tompickup_com_/https_tompickup_com_olympic-triathlon-copy/content_11.html": "What Am I Doing?\nA 93-Mile cycle in a day, from Leeds to Wigan on the Leeds-Liverpool canal, in memory of Baby G, for the Baby G charity.\nWhat Is the Baby G Charity\nThe Baby G charity was set up in memory of baby Graham Hurst, who was born sleeping. His parents were determined to raise money in his memory and do something positive, since then Bay G has raised a fortune across many fundraising events and purchased incubators for hospitals, which sadly there is a shortage of funding for.\nHow’s It Going?\nDate TBC, ETA Summer 2025.\nHow To Donate\nI’ll set up a fundraising page soon.\nWhat Else I’m Doing\nMarch 25 – 100 Miles for Mind | Swimathon 2025 | 10km Swim for Cancer Research\nApril 25 – 50 Miles for Sands\nSummer 25 – Olympic Triathlon | Baby G Cycle\nAutumn 25 – Chester Marathon",
  "https_tompickup_com_/https_tompickup_com_category_politics_page_2/content_54.html": "Reform UK Burnley Page Removed By Facebook\nTomPickup.com | Politics Reform UK Burnley Page Removed By Facebook What Is Happening? On Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page. Following an appeal, the page was then swiftly completely removed by Facebook, […]\nReform UK Burnley Page Suspended By Facebook\nTomPickup.com | Politics Reform UK Burnley Page Suspended By Facebook What Is Happening? On Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook have interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page. Following an appeal, the page was then completely removed by Facebook. […]\nLancashire County Council: Criminal Trial For Former Conservative LCC Leader Geoff Driver\nTomPickup.com | Politics Lancashire County Council: Criminal Trial For Former Conservative LCC Leader Geoff Driver What Is Happening? It’s been announced that the former Conservative leader of Lancashire County Council, Geoff Driver, will finally stand trial in April 2027. The trial is set to take place 14-years after investigation into the alleged financial irregularities at […]\nLancashire County Council Waste: High Earning Staff\nTomPickup.com | Politics Lancashire County Council Waste: Management Pay Rises What Is Happening? The pay for Lancashire County Council’s top staff jumped up by £940,000 from 22/23 to 23/24, according to figures only released this year. LCC’s projected budget deficit for the 24/25 financial year was £2.908m, but has jumped up for the 2025/26 financial […]\nLancashire County Council Waste: Refugee Translation\nTomPickup.com | Politics Lancashire County Council Waste: Refugee Translation What Is Happening? On 7th April 2025, Lancashire County Council put out a notice regarding a £720,000 + VAT contract for ‘the provision of interpretation and translation for Lancashire refugee integration team and named providers’. The Lancashire County Council projected budget deficit for 25/26 financial year […]\nOn Alan Hosker\nTomPickup.com | Politics On Alan Hosker What Is Happening? The current Conservative County Councillor for Padiham & Burnley West, Alan Hosker, leafleted everyone, claiming I’m a name on a piece of paper and that no one else will do half as much as he does. Evidence shows he only attended 44% of County Council meetings […]\nLocal Services and Businesses\nTomPickup.com | Charity Local Services and Businesses What Is Happening? Lancashire County Council is in huge debt, the daily interest rates are colossal. To balance the books, they’re planning huge cuts. That means cuts to the services we rely on and need. Why Has This Happened? For years, the two main political […]\nTransparency\nTomPickup.com | Charity Transparency What’s Happening Nationally? Trust in politicians is at an all time low. The two main parties have broken promise after promise. There is zero accountability. Whether for lining their pockets with millions in PPE money, or leaving our pensioners in the cold without Winter Fuel Payments, they face no consequences. They […]\nStop The Merger of Burnley and Blackburn Councils\nTomPickup.com | Charity Stop The Merger of Burnley and Blackburn Councils What Is Happening? Labour plan to merge Burnley and Blackburn Borough Councils. Unless we unite against this, Burnley will be ruled by Blackburn What I will do I’ve created a petition to show that the people of Burnley and Padiham are against this. Only […]",
  "https_tompickup_com_/https_tompickup_com_10km-swim-for-cancer-research/content_14.html": "What Am I Doing?\nSwimming 10km in March for Cancer Research, the cancer charity.\nWhat Is Swim 10km For Cancer Research?\nCancer Research challenged people to swim 10km in March 2025, to raise awareness and funds to fight cancer.\nAs I was doing the Triple 5km for Swimathon 2025 already, who raise money for Cancer Research and Marie Curie, I thought I’d combine the cancer charity challenges and see how many kilometres of swimming I could do in March.\nHow’s It Going?\nIn total I needed to do 10km.\nI did:\nWeek One (3,200m)\n1st – 100m | 3rd – 600m | 4th – 2,500m\nWeek Two (11,295m)\n8th – 625m | 10th – 5,000m | 11th – 1,020m | 12th – 1,475m | 13th – 2,525m | 14th – 650m\nWeek Three (1,475m)\n17th – 750m | 18th – 500m | 21st – 225m\nWeek Four (1,000m)\n22nd – 750m | 27th – 250m\nWeek Five (15,000m)\n29th – 5,000m | 30th – 5,000m | 31st – 5,000m\nTotal = 31,970, (31.97km)\nHow To Donate\nLinks to 10km for Cancer Research and the Cancer Research donation page:\nWhat Else I’m Doing\nMarch 25 – 100 Miles for Mind | Swimathon 2025 | 10km Swim for Cancer Research\nApril 25 – 50 Miles for Sands\nSummer 25 – Olympic Triathlon | Baby G Cycle\nAutumn 25 – Chester Marathon",
  "https_tompickup_com_/https_tompickup_com_2025_04_10/content_50.html": "Lancashire County Council: Criminal Trial For Former Conservative LCC Leader Geoff Driver\nTomPickup.com | Politics Lancashire County Council: Criminal Trial For Former Conservative LCC Leader Geoff Driver What Is Happening? It’s been announced that the former Conservative leader of Lancashire County Council, Geoff Driver, will finally stand trial in April 2027. The trial is set to take place 14-years after investigation into the alleged financial irregularities at […]",
  "https_tompickup_com_/https_tompickup_com_category_charity/content_12.html": "93-Mile Charity Cycle\nTomPickup.com | Charity 93-Mile Cycle What Am I Doing? A 93-Mile cycle in a day, from Leeds to Wigan on the Leeds-Liverpool canal, in memory of Baby G, for the Baby G charity. What Is the Baby G Charity The Baby G charity was set up in memory of baby Graham Hurst, […]\nOlympic Triathlon\nTomPickup.com | Charity Olympic Triathlon What Am I Doing? An Olympic Triathlon, for the Baby G charity. A 1.5km swim, a 40km bike ride and a 10km run. What Is the Baby G Charity The Baby G charity was set up in memory of baby Graham Hurst, who was born sleeping. His […]\n50 Miles for Sands\nTomPickup.com | Charity 50 Miles For Sands What Am I Doing? Running 50 miles in April 2025, for the charity Sands, who are focused on saving babies lives, preventing stillbirth, and supporting bereaved parents who suffer. A cause very close to my heart, in memory of Baby G, the son of Graham Hurst. […]\nChester Marathon\nTomPickup.com | Charity Chester Marathon What Am I Doing? The Chester Marathon, for the North West Air Ambulance charity. What Is The Chester Marathon? Running 26 miles and 385 yards, or 42.195km, in and around the City of Chester, in Cheshire. I chose to do it for North West Air Ambulance. […]\n10km Swim For Cancer Research\nTomPickup.com | Charity 10km Swim For Cancer Research What Am I Doing? Swimming 10km in March for Cancer Research, the cancer charity. What Is Swim 10km For Cancer Research? Cancer Research challenged people to swim 10km in March 2025, to raise awareness and funds to fight cancer. As I was doing the […]\n100 Miles For Mind\nTomPickup.com | Charity 100 Miles For Mind What Am I Doing? Hiking and running 100 miles, for Mind, the mental health charity. Mind is a cause close to my heart, everyone I know, including me, has struggled with their mental health at times in their lives! What Is 100 Miles for Mind? […]\nSwim 22\nTomPickup.com | Charity Swim 22 What Am I Doing? Swimming 44 miles for Diabetes UK. Diabetes UK support those who suffer from diabetes and work on finding treatments and a cure. What Is Swim-22? Diabetes UK have created the ‘Swim 22’ challenge as a fundraiser, to raise awareness and money for their […]\nSwimathon 2025\nTomPickup.com | Charity Swimathon 2025 What Am I Doing? On 29th-31st March 2025, I undertook the ‘Triple 5km’ challenge, for the Swimathon Foundation, to raise awareness and funds for Cancer Research (UK) and Marie Curie, at Burnley and Padiham Leisure Centres. The Triple 5km challenge consists of 5km swims, on 3 consecutive days (15km […]",
  "https_tompickup_com_/https_tompickup_com_category_politics/content_48.html": "Reform UK’s Farming Policies\nTomPickup.com | Politics Reform UK’s Farming Policies ’ve been asked a few times recently about Reform UK’s farming policies, so I thought I’d share them publicly in an article. In the 2024 Manifesto, Reform UK proposed several policies relating to farming, which aim to help small farms. As I have lived rurally, I understand a […]\nApplying School Absence Rules to Tory Councillors\nTomPickup.com | Politics Applying School Absence Rules To Tory Councillors What would happen if you applied school absence rules to Tory Councillors in Lancashire? In schools in the UK, less than 95% attendance is considered as ‘bad’ and less than 90% attendance is considered ‘persistent absence’. In Lancashire County Council, out of the 46 Tory […]\nThe Infrastructure That Brings Illegal Immigrants Into Our Communities In Burnley and Padiham\nTomPickup.com | Politics The Infrastructure That Brings Illegal Immigrants Into Our Communities In Burnley and Padiham This article breaks down some of the illegal immigration supporting infrastructure that operates in Burnley and Padiham, which organisations are facilitating it and how they’re funded. Before doing so, I detail the below crime statistics (source: The Telegraph), which […]\nLancashire County Council’s £479 Million Highways Backlog of Works\nTomPickup.com | Politics Lancashire County Council’s £479 Million Highways Backlog of Works What Is Happening? Lancashire County Council’s Highways Department have a maintenance backlog of £479 million. This is work that has been identified as needed to be done. The Tory-led Council’s highways budget for this year is only £74m. The backlog consists of required […]\nAsylum Seekers In Lancashire Costs The Taxpayer More Than Lancashire County Council’s Total Debt\nTomPickup.com | Politics Asylum Seekers In Lancashire Costs The Taxpayer More Than Lancashire County Council’s Total Debt How Many Asylum Seekers Are In Lancashire? According to 2021 Census data, Lancashire is home to 37,277 ‘resettlers’, people who have come here as refugees or asylum seekers. According to Lancashire County Council, as of 2023 there were […]\nWhat Can Be Done About Nuisance Bikes?\nTomPickup.com | Politics What Can Be Done About Nuisance Bikes? What Is Happening? There have been many reports of nuisance bikes in the Ward, such as the behaviour of electric bike riders on & off road in neighbourhoods and motorbikes & quad bikes causing damage to Hapton Moor / Hameldon Hill and Quarry. The Burnley […]\nMy Objections To The Planning Application Off Green Close\nTomPickup.com | Politics My Objections To The Planning Application Off Green Close What Is Happening? A planning application is under consideration for the building of 9 dwellings off Green Close. The proposed development will back onto the houses on Apex Close. This is in the Burnley West part of the ward, close to Burnley Golf […]\nHousing Development Causing Dust Issues\nTomPickup.com | Politics Housing Development Causing Dust Issues For Residents What Is Happening? A large housing development off Rossendale Road, in the Padiham & Burnley West ward, is apparently causing dust issues for residents. This was reported to me by a local resident, among other concerns about the site. Upon visiting the area, I witnessed […]\nWho Are Burnley’s Current County Councillors, What Do They Do And How Much Do They Get Paid?\nTomPickup.com | Politics Who Are Burnley’s Current County Councillors, What Do They Do And How Much Do They Get Paid? What Do County Councillors Do? County Councillors are responsible for setting policies and making decisions for the whole of Lancashire, for everything Lancashire County Council presides over. They decide matters relating to: Education (schools, special […]\nLancashire County Council Waste: What Can Be Done About The £720k Refugee Translation Tender\nTomPickup.com | Politics Lancashire County Council Waste: What Can Be Done About The £720k Refugee Translation Tender What Is Happening? I recently wrote about Lancashire County Council awarding a £720,000 tender for refugee interpretation and translation services. A voter wrote to me and asked what can be done about it should Reform get into power […]",
  "https_tompickup_com_/https_tompickup_com/content_1.html": "Thomas Pickup\nI represent Padiham & Burnley West, as our County Councillor at Lancashire County Council.\nI was elected in the vote on 1st May 2025, so I’m in the process of Councillor induction and getting things set up.\nThis website is therefore undergoing upgrades to facilitate the new role.\nIf you have any issues that you need help with before then, you can contact me directly via email.\nMy background and what I do\nCharity events & fundraising\nMy hobbies, interests and things to do\nArticles & News on local & national politics\nSign up to receive the email newsletter to stay updated on the latest news & projects",
  "https_tompickup_com_/https_tompickup_com_2025_03_06/content_34.html": "Swimathon 2025\nTomPickup.com | Charity Swimathon 2025 What Am I Doing? On 29th-31st March 2025, I undertook the ‘Triple 5km’ challenge, for the Swimathon Foundation, to raise awareness and funds for Cancer Research (UK) and Marie Curie, at Burnley and Padiham Leisure Centres. The Triple 5km challenge consists of 5km swims, on 3 consecutive days (15km […]",
  "https_tompickup_com_/https_tompickup_com_lancashire-county-council-criminal-trial-for-former-lcc-leader-geoff-driver/content_44.html": "What Is Happening?\nIt’s been announced that the former Conservative leader of Lancashire County Council, Geoff Driver, will finally stand trial in April 2027.\nThe trial is set to take place 14-years after investigation into the alleged financial irregularities at LCC began. It will be five years after Mr Driver first was charged with alleged wrongdoing. He will be tried along with three others, including an ex-County Council Chief.\nThe long-running scandal has had many twists and turns, including civil court lawsuits, witness intimidation allegations, the destruction of IT equipment and more.\nThe Crown Prosecution Service alone has spent over £1m on legal advice relating to the case since 2016. The Police and the Courts have not disclosed how much the investigation and related civil cases to date have cost the taxpayer.\nThe charges relate to a £5m tender awarded to One Connect Ltd. As a criminal trial is pending, commenting further on the allegations surrounding this tender and the charges before the trials could prejudice the case.\nTimeline\nCommentary\nDespite the scandal, the Conservatives still lead Lancashire County Council. I don’t know what is worse, a Conservative Council with these allegations swirling around it and huge debt and deficit, or the fact that it’s taken 14-years of investigation and 5-years since arrest to bring this to trial. Either way, hopefully by 2027 both of these things will be done with!\nSources\n26/4/18 – Geoff Driver ‘intimidated’ witnesses https://www.bbc.co.uk/news/uk-england-lancashire-43897436\n12/2/21 – Geoff Driver stands down https://www.bbc.co.uk/news/uk-england-lancashire-56038824\n23/8/22 – Geoff Driver among men charged in finance probe https://www.bbc.co.uk/news/uk-england-lancashire-62650424\n10/10/22 – Geoff Driver v Crown Prosecution service court date https://vlex.co.uk/vid/geoffrey-driver-v-crown-913514773\n26/3/25 – 14-years and over £1m to bring Geoff Driver to trial https://lancashire.thelead.uk/p/14-years-and-over-1m-to-bring-geoff",
  "https_tompickup_com_/https_tompickup_com_housing-development-causing-dust-issues/content_42.html": "What Is Happening?\nA large housing development off Rossendale Road, in the Padiham & Burnley West ward, is apparently causing dust issues for residents.\nThis was reported to me by a local resident, among other concerns about the site. Upon visiting the area, I witnessed a lot of dust on vehicles, houses and the road, which appeared to be both blowing off the site itself and being brought onto the housing estate by vehicles exiting the site.\nWhat I did\nFortunately, a friend of mine is a Chartered Environmentalist, who specialises partly in Dust Management relating to planning applications.\nWhen we visited the area for a site survey and to find out more, a group of residents gathered to share their concerns and issues. The Chartered Environmentalist has since reviewed the planning application and noticed a number of conditions appear to possibly not be being adhered to, as per what I witnessed, so he will be advising residents how to raise their concerns and the conditions to question, to give the neighbourhood the best chance of working with the developer, the Environmental Health Officer and Burnley Council, to mitigate their concerns and the negative impact the development is having on the local residents.\nMore on this to follow…",
  "https_tompickup_com_/https_tompickup_com_author_tompickup_page_2/content_31.html": "Reform UK Burnley Page Removed By Facebook\nTomPickup.com | Politics Reform UK Burnley Page Removed By Facebook What Is Happening? On Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page. Following an appeal, the page was then swiftly completely removed by Facebook, […]\nReform UK Burnley Page Suspended By Facebook\nTomPickup.com | Politics Reform UK Burnley Page Suspended By Facebook What Is Happening? On Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook have interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page. Following an appeal, the page was then completely removed by Facebook. […]\nLancashire County Council: Criminal Trial For Former Conservative LCC Leader Geoff Driver\nTomPickup.com | Politics Lancashire County Council: Criminal Trial For Former Conservative LCC Leader Geoff Driver What Is Happening? It’s been announced that the former Conservative leader of Lancashire County Council, Geoff Driver, will finally stand trial in April 2027. The trial is set to take place 14-years after investigation into the alleged financial irregularities at […]\nLancashire County Council Waste: High Earning Staff\nTomPickup.com | Politics Lancashire County Council Waste: Management Pay Rises What Is Happening? The pay for Lancashire County Council’s top staff jumped up by £940,000 from 22/23 to 23/24, according to figures only released this year. LCC’s projected budget deficit for the 24/25 financial year was £2.908m, but has jumped up for the 2025/26 financial […]\nLancashire County Council Waste: Refugee Translation\nTomPickup.com | Politics Lancashire County Council Waste: Refugee Translation What Is Happening? On 7th April 2025, Lancashire County Council put out a notice regarding a £720,000 + VAT contract for ‘the provision of interpretation and translation for Lancashire refugee integration team and named providers’. The Lancashire County Council projected budget deficit for 25/26 financial year […]\nOn Alan Hosker\nTomPickup.com | Politics On Alan Hosker What Is Happening? The current Conservative County Councillor for Padiham & Burnley West, Alan Hosker, leafleted everyone, claiming I’m a name on a piece of paper and that no one else will do half as much as he does. Evidence shows he only attended 44% of County Council meetings […]\nPoplars Tuition\nTomPickup.com | Business Poplars Tuition What is the project? Poplars Tuition, a private tutoring business based in Bury, Greater Manchester, wanted a business logo, a website designing & hosting, a professional @poplarstuition.co.uk email address, a place to receive online reviews from their happy customers and advice about marketing the business to new & existing […]\n93-Mile Charity Cycle\nTomPickup.com | Charity 93-Mile Cycle What Am I Doing? A 93-Mile cycle in a day, from Leeds to Wigan on the Leeds-Liverpool canal, in memory of Baby G, for the Baby G charity. What Is the Baby G Charity The Baby G charity was set up in memory of baby Graham Hurst, […]\nOlympic Triathlon\nTomPickup.com | Charity Olympic Triathlon What Am I Doing? An Olympic Triathlon, for the Baby G charity. A 1.5km swim, a 40km bike ride and a 10km run. What Is the Baby G Charity The Baby G charity was set up in memory of baby Graham Hurst, who was born sleeping. His […]\n50 Miles for Sands\nTomPickup.com | Charity 50 Miles For Sands What Am I Doing? Running 50 miles in April 2025, for the charity Sands, who are focused on saving babies lives, preventing stillbirth, and supporting bereaved parents who suffer. A cause very close to my heart, in memory of Baby G, the son of Graham Hurst. […]",
  "https_tompickup_com_/https_tompickup_com_transparency/content_20.html": "What’s Happening Nationally?\nTrust in politicians is at an all time low. The two main parties have broken promise after promise. There is zero accountability. Whether for lining their pockets with millions in PPE money, or leaving our pensioners in the cold without Winter Fuel Payments, they face no consequences. They work for us, it’s our money and our lives they’re making decisions with, but they don’t seem to care, they just talk and things get worse.\nNationally, any votes Labour or The Conservatives get on the 1st May will be interpreted by them as you giving them permission to continue. Only a Vote for Reform UK will deliver the change we need.\nWhat is Happening Locally?\nYou can say ‘No Nay Never’ to this by signing my petition to stop the merger.\nWhat I will do\nI’ve created a petition to show that the people of Burnley and Padiham are against the merger. Only Reform UK will stand up strongly with the people against things like this. Labour clearly don’t know our town, or us, if this is their plan. The Tories have done a lot of talking over the last decade, but their talking never leads to the action we want to see.\nWhat You Can Do\nPlease click the link below to sign the petition via the link below to say No Nay Never to the merger of Burnley and Blackburn councils:\nhttps://www.change.org/p/stop-the-merger-of-burnley-and-blackburn-councils/",
  "https_tompickup_com_/https_tompickup_com_2025_04_09/content_53.html": "Lancashire County Council Waste: High Earning Staff\nTomPickup.com | Politics Lancashire County Council Waste: Management Pay Rises What Is Happening? The pay for Lancashire County Council’s top staff jumped up by £940,000 from 22/23 to 23/24, according to figures only released this year. LCC’s projected budget deficit for the 24/25 financial year was £2.908m, but has jumped up for the 2025/26 financial […]",
  "https_tompickup_com_/https_tompickup_com_local-services-and-business/content_18.html": "What Is Happening?\nLancashire County Council is in huge debt, the daily interest rates are colossal.\nTo balance the books, they’re planning huge cuts. That means cuts to the services we rely on and need.\nWhy Has This Happened?\nFor years, the two main political parties have mismanaged our country, our county and our area, leaving our economy and services in a mess.\nOnly Reform UK stand a chance of getting us out of it. This is why I’m standing for Reform UK. Things are going to get worse, and fast.\nNow, more than ever, we need a County Councillor at County Hall, who will represent the people in Padiham and Burnley, and make it about the people who live here. We need someone with the experience, skills and will to make changes.\nSince the last election, our current County Councillor, Alan Hosker, only turned up to 44% of Lancashire County Council meetings he was expected at. The voice and the vote of the people of Padiham and Burnley has gone mostly unheard, for years. Our tax money (close to £60k in allowances, plus expenses) has gone to waste paying him to not even turn up half of the time. If you didn’t turn up for your job more than half of the time, you’d be sacked!\nYears of Labour and Tory politicians have talked a good game, some have even shown up to vote more than half the time and actually cared, but they have all failed to turn things around.\nWhat I Will Do\nWhen I used to work in procurement at Lancashire County Council, I saw so much waste of taxpayer money that it knocked me sick.\nFor every pound I saw wasted, millions of them, I pictured all the local, honest people I knew. I knew they worked hard to pay their taxes and, in many cases, just to make ends meet. I knew that if they saw how their tax money was being wasted, and the attitudes of those whose job it was to make sure it wasn’t, they would feel sick too.\nThe politicians would swan in, acting like the big cheeses, impressed with their own importance. I’d watch their campaigns to convince their local people that they were doing a good job for them, just to get their votes, while things only got worse.\nI remember speaking to my boss about it, who was one of the good guys working against the grain to stop the waste. He advised me to go into business and learn the skills needed to go back to County Hall and make the changes that are needed. That is exactly what I’ve done. Since then, things have gotten even worse.\nI will act and act fast, finding and cutting waste, improving processes, driving the accountability and change we need.\nI will be transparent with the public, sharing everything I find and do and asking for your input into every decision. County Councillors represent you, not themselves, it’s about what you want done with your money.\nLancashire’s massive debts will be paid not only by us, but by our children and by our grandchildren. For too long we have kicked the can to the next generation. The buck needs to stop with us. If you think services have got worse in your life and we’re getting less value for money, the decline and cost will be felt even more by our children. At this rate, what will even be left for our grandchildren?\nFor local businesses, I will engage with all of them, listen to what they need and use my position, skills, experience and professional network to help them grow, bringing more money into the local economy and creating better jobs.\nWe have a lot of good local businesses already, with a little bit of support and engagement from Lancashire County Council they can thrive even more. That requires someone talking to them, listening to what they need and delivering it, not just turning up for a photo opportunity.\nFor too long we’ve had politicians who lack the experience to really make a difference, or who even show up. The UK needs Reform. Lancashire needs Reform. Padiham & Burnley West needs Reform.\nWhat can you do?\nI want to hear from the people of Padiham and Burnley West, to find out what you need. Get in touch with me, or join my Facebook Group and page for updates and discussion.\nFacebook Group – https://www.facebook.com/groups/tompickupburnley/\nFacebook Page – https://www.facebook.com/tompickupburnley/\nContact me directly – https://tompickup.com/contact/",
  "https_tompickup_com_/https_tompickup_com_asylum-seekers-in-lancashire-costs-the-taxpayer-more-than-lancashire-county-councils-total-debt/content_10.html": "How Many Asylum Seekers Are In Lancashire?\nAccording to 2021 Census data, Lancashire is home to 37,277 ‘resettlers’, people who have come here as refugees or asylum seekers.\nAccording to Lancashire County Council, as of 2023 there were also an additional 6,000 asylum seekers & refugees in Lancashire requiring ‘active support’ through a Government migration scheme.\nLCC said this figure has increased by 200% since 2021. A 200% increase from 2021 to 2023 (6,000) means the 2021 figure was 2,000.\nLCC also said forecasting predicted the number will continue to grow. A continued 200% increase from the 2023 figure to 2025 means that the present figure would be around 18,000.\nIf, as LCC’s figures suggest, since 2021, there have been an additional 2,000 (2021) + 6,000 (2023) + 18,000 (2025 estimate) asylum seekers, this equals 26,000, so we’ll use this as an estimated figure.\nHow Much Does This Cost?\nThe Institute for Public Policy Research (IPPR) reported in 2024 that per asylum seeker costs of just procuring short-term accommodation were £41,000 in 2023-24.\nThis has seen a huge rise since their reported per asylum seeker cost in 2019-20, which stood at £17,000.\nAsylum seekers in self-catering accommodation also receive £49.18 per week in benefits, which is £2,557.36 per year.\nThere’s also the costs of administration, education, healthcare, translation and any other public service which an asylum seeker may use, or cause the state to spend money, such as the fire brigade, or the police.\nIf we calculate these 37,277 ‘resettler’ Lancashire population in the 2021 Census based on the 2019-20 £17,000 per asylum seeker cost, then the cost was 37,277 X £17,000 = £633,709,000 (£633.7 million).\nIf we calculate the estimated 26,000 Lancashire asylum seekers from 2021-2025, and use the £41,000 2023-24 figure, the cost is £1,066,000,000 (£1.066 billion, or 1 billion and 66 million pounds.\nThis equals a grand total of £1,699,709,000, or 1 billion, 699 million and 709 thousand pounds.\nThat’s just for accommodation, if all the estimated 26,000 asylum seekers since 2021 all received the £49.18 per week in benefits, that’s another £66.49136m per year.\nIn 2021, total healthcare expenditure per person in the UK was £4,188. That’s another £265m+ per year (for the 37,277 resettlers up to 2021, then the estimated 26,000 since then).\nLCC’s refugee support team, as of 2023, had 29 staff. At the average salary of £37,000 per year, this is over £1m per year.\nIt is clear based just on these crude estimates that the likely cost is well in excess of £2 billion, and likely to be much more. Lancashire County Council’s total debt is over £1 billion.\nWill It Be Recouped In Tax?\nIn 2023/24, public spending per person in the UK was £12,958.\nThe median annual salary for full-time work in Lancashire, as of April 2024, is £30,262.\nAs of this tax year, that will result in £3,538.40 of income tax and £1,415.36 of National Insurance. The average (band D) Council Tax payment in Lancashire in 24/25 was £1,653.29.\nThis leaves £23,654.95 for this average person to spend. If the entirety is spent on things which incur 20% rate of VAT, then £4,730.99 will be paid in VAT. However, this is crude as not all spending is subject to VAT, but as other items incur extra taxes, it’s a good average.\nThis gives a total of £11,338.04 in tax paid for this average person.\nSo, if an asylum seeker ends up earning the average wage in Lancashire, pays their taxes and spends all their money in the UK, there’s a £1,619.96 annual deficit.\nThis means an asylum seeker has to earn considerably more than the average salary in Lancashire in order for the state to break even for the public spending they incur annually once settled and contibute enough to.\nIn many cases, they add valuable skilled labour, such as Doctors, but in many more cases, they don’t, it costs the taxpayer a lot of money and the well runneth dry, because the country is in huge debt and isn’t making ends meet already, public services are broken and our children and grandchildren will pick up the cost of our frivolous spending.\nWhat You Can Do\nVote Reform UK.\nNow, more than ever, we need Reform UK County Councillors at County Hall, to reduce the cost burden of immigration on the people of Lancashire.\nCounty Councillors alone can only put a plaster over a bullet wound and lower the costs and attractiveness of coming to Lancashire for refugees, but it’s a start, and it’ll be much more than the Conservative-led County Council have done so far.\nVoting Reform UK nationally and getting MP’s in Parliament in the next General Election will enable the nation to end this level of mitigation, which not only costs us a fortune, but puts strain on our communities and services.\nFor me it’s not about blaming a particular group within society for all our problems, this is just one of many problems. Simply put, we can’t afford to keep doing this. We owe more to our children and elderly than we do foreign refugees, many of whom are economic migrants.",
  "https_tompickup_com_/https_tompickup_com_my-objections-to-the-planning-applicaiton-off-green-close/content_43.html": "What Is Happening?\nA planning application is under consideration for the building of 9 dwellings off Green Close. The proposed development will back onto the houses on Apex Close. This is in the Burnley West part of the ward, close to Burnley Golf Club.\nI received communication from a local resident notifying me of this application, he has done a lot of good work detailing the many concerns that relate to this application, so there’s not a lot I can add, other than echoing what he’s already raised and adding my voice to the objections and concerns.\nI have detailed the concerns briefly below, as well as commenting on the planning application.\nAdditionally, I’ve enlisted the services of a personal friend, who is a Chartered Environmentalist (an air quality and dust specialist relating to planning), to advise on those aspects as the application progresses.\nConcerns\nAdditional Comments\nI’m not against house building, we need more houses and they have to go somewhere, but it seems there were ways to mitigate many of these concerns, without causing as much concern in the neighbourhood, or impact on residents.\nBuilding elsewhere in the field (further away from existing properties) and connecting the development to the main road, instead of Green Close, would’ve provided a solution that didn’t cause so much inconvenience to residents, while preserving the green space and existing public right of way footpath. Including a Dust Management Plan detailing how to mitigate the impact of dust from the site to nearby properties would’ve also gone a long way. Sadly it doesn’t appear as though any effort has been made to consider local residents.\nI would therefore like to see this planning application objected to.\nSources\nTo view and comment on the planning application (reference is PIP/2025/0213), via the link below:",
  "https_tompickup_com_/https_tompickup_com_reform-uk-burnley-page-suspended-by-facebook/content_46.html": "What Is Happening?\nOn Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook have interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page.\nFollowing an appeal, the page was then completely removed by Facebook.\nThis was not for anything the page posted. The reason given for the suspension was for ‘impersonation’, citing examples of their policy being ‘creating a page that looks like it belongs to a brand or business’, despite being the official Burnley branch page and never having been asked for authentication of this by Facebook.\nThe other parties haven’t had their local pages suspended during the campaign for this reason. Based on the content of the page, no unbiased observer would logically conclude that the Reform UK – Burnley page isn’t what it purports to be.\nGiven the short space of time between now and the local elections, it seems to be yet another case of potential election subversion by a social media company.\nCommentary\nUnder Tory and Labour leadership, the UK has seen a culture develop of political censorship, people being dragged through the courts and even locked up for what they post online.\nI would strongly support a new law which ensured that the pages of all political parties, local branches of political parties and their candidates were immune from any form of tampering by social media companies, unless they have committed a crime and the police request removal of post action by the social media companies.\nI would also support laws to return our culture to one where people weren’t censored, or at risk of being put in prison, for what they post online.\nThere have been many reports of a two-tier justice system in this respect, with posts from certain political groups and causes being given a relatively free pass, while people and posts from the ‘right wing’ of politics in Britain are censored and legally pursued by the authorities.\nIt shouldn’t be up to Facebook’s moderators to decide which political parties and candidates can be seen online during an election campaign, it should be up to voters to judge what is posted, the parties and candidates for themselves.\nPoliticians Blocking Critics\nIt’s been reported to me by many parties that MP’s, Councillors and local parties have engaged in blocking their critics, in what can only be perceived as apparent attempts to silence any negative PR, voices and create an echo chamber online.\nI have recently experienced this myself, after volunteering to stand for Reform and announcing my candidacy last month.\nBurnley’s suspended Labour MP, Oliver Ryan, followed me on Instagram and used to view my Instagram stories regularly, having no notion of my political affiliation or views. When I announced I am a candidate for Reform UK, he blocked me. When I commented on his Facebook post asking him about it, he removed the comment.\nIronically, Mr Ryan had the whip removed due to alleged inappropriate behaviour on WhatsApp.\nMy Conservative opponent on 1st May, the incumbent County Councillor Alan Hosker, also blocked me, in response to a post alerting voters to his 56% absence rate from County Council meetings he was expected at.\nPeople have reported the same thing to me regarding these two individuals, as well as the same being reported about Conservative and Labour politicians in other areas.\nPersonally I will not block any voters from voicing their views on my page, or remove their comments. I may not agree with what people say, but I will always defend their right to say it. You have a right to say what you want about what I do and to see what others say.",
  "https_tompickup_com_/https_tompickup_com_applying-school-absence-rules-to-tory-councillors/content_9.html": "What would happen if you applied school absence rules to Tory Councillors in Lancashire?\nIn schools in the UK, less than 95% attendance is considered as ‘bad’ and less than 90% attendance is considered ‘persistent absence’.\nIn Lancashire County Council, out of the 46 Tory Councillors running the show, over a quarter would be classed as having ‘persistent absence’.\nSadly LCC does not apply the same expectations to adult Councillors as they do to children and parents.\n63% of Tory Councillors attendance would be classed as ‘persistent absence’, or ‘bad’, while only 3 Councillors (6.5% of the total) had full attendance. This leaves just over a third (36.9%) having ‘good’, or ‘full’ attendance.\nUnauthorised Absences and Penalty Notices\nIf children miss more than 10 ‘sessions’ (half-days) due to ‘unauthorised absences’, out of the minimum of 380 sessions in the academic year, a local authority must consider issuing a penalty notice to the parents, which is a financial fine. This equates to children missing 2.63% of sessions in the school year.\nIn the County Council, it’s customary to apologise if absent from a meeting a Councillor is expected at. Despite this, only 66% of Tory absences were apologised for.\nIf we class non-apologies as ‘unauthorised absences’, LCC would have to consider issuing a penalty notice to the parents of over half (54%) of Tory Councillors.\nCommentary\nThis begs a few questions:",
  "https_tompickup_com_/https_tompickup_com_charity/content_6.html": "Run 50 Miles For Sands\nSands\nApril 2025\nBurnley, Lancashire\nTBC\nSands, the charity whose work helps prevent baby deaths, stillbirths and supports bereaved parents, asked people to run 50 miles in April, to raise awareness and funds…\nWigan to Southport Cycle\nBaby G Fund\nApril 2025\nWigan to Southport\nTBC\nIn loving memory of Baby G, a team will be cycling from Wigan to Southport, to raise money for the Baby G Fund, which fundraises for incubators for children’s wards in hospitals.\nSprint Triathlon\nBaby G Fund\nMay 2025\nUnited Kingdom\nTBC\nA sprint distance triathlon, in loving memory of Baby G, to raise money for incubators in hospitals in the North West…\nSwim 22\nDiabetes UK\n22 March-22 June '25\nUnited Kingdom\nTBC\nSwimming 44-miles over 12 weeks, for Diabetes UK, as part of their ‘Swim 22’ event\nOlympic Triathlon\nBaby G Fund\nSummer 2025 (TBC)\nNorth West England\nTBC\nAn Olympic triathlon is 1.5km swim, a 40km cycle and a 10km run. I’ll be doing this in summer, in memory of Baby G, to raise awareness and funds for the Baby G Fund, who buy incubators for hospitals in the North West…\nChester Marathon\nNorth West Air Ambulance\nOctober 2025\nChester, Cheshire\nTBC\nRunning the Chester marathon (26.2 miles/42.1km) for North West Air Ambulance, in October 2025…\nSwimathon 2025\nSwimathon\nMarch 2025\nBurnley, Lancashire\nTBC\nI completed the triple 5km event, swimming 5km on three consecutive days, in Padiham and Burnley. Swimathon raises awareness and funds for Marie Curie and Cancer Research.\nCancer Research Swim\nCancer Research\nMarch 2025\nLancashire\nTBC\nCancer Research challenged people to swim 10km over the month of March. I completed over 30km!\n100 Miles for Mind\nMind\nMarch 2025\nUnited Kingdom\nTBC\nMind, the mental health charity, challenged people to hike or run over 100 miles in the month of March…\n24-Hour Walk\nRohingya Refugees\n2022\nLancashire\nTBC\n24-hour charity walk across Lancashire and back (Burnley to Lytham return trip), covering over 105km (66 miles), to raise awareness and funds for the plight of the Rohingya refugees in Bangladesh…\n25km Wild Swims\nBone Cancer Trust\n2022\nNorth West\nTBC\nOver 25km of open water swimming completed, over the month of June in 2022, for the Bone Cancer research charity.\n10km Pool Swims\nBone Cancer Trust\n2022\nUnited Kingdom\nTBC\nOver 10km of pool swims completed, for Bone Cancer Research, across the month of July 2022.\nI’m always happy to help get involved in raising awareness and funds for good causes, as well as helping with networking and advising on operations, strategy and other matters.\nGet in touch with me for a chat…",
  "https_tompickup_com_/https_tompickup_com_2025_04_06/content_13.html": "On Alan Hosker\nTomPickup.com | Politics On Alan Hosker What Is Happening? The current Conservative County Councillor for Padiham & Burnley West, Alan Hosker, leafleted everyone, claiming I’m a name on a piece of paper and that no one else will do half as much as he does. Evidence shows he only attended 44% of County Council meetings […]\nPoplars Tuition\nTomPickup.com | Business Poplars Tuition What is the project? Poplars Tuition, a private tutoring business based in Bury, Greater Manchester, wanted a business logo, a website designing & hosting, a professional @poplarstuition.co.uk email address, a place to receive online reviews from their happy customers and advice about marketing the business to new & existing […]\n93-Mile Charity Cycle\nTomPickup.com | Charity 93-Mile Cycle What Am I Doing? A 93-Mile cycle in a day, from Leeds to Wigan on the Leeds-Liverpool canal, in memory of Baby G, for the Baby G charity. What Is the Baby G Charity The Baby G charity was set up in memory of baby Graham Hurst, […]\nOlympic Triathlon\nTomPickup.com | Charity Olympic Triathlon What Am I Doing? An Olympic Triathlon, for the Baby G charity. A 1.5km swim, a 40km bike ride and a 10km run. What Is the Baby G Charity The Baby G charity was set up in memory of baby Graham Hurst, who was born sleeping. His […]\n50 Miles for Sands\nTomPickup.com | Charity 50 Miles For Sands What Am I Doing? Running 50 miles in April 2025, for the charity Sands, who are focused on saving babies lives, preventing stillbirth, and supporting bereaved parents who suffer. A cause very close to my heart, in memory of Baby G, the son of Graham Hurst. […]\nChester Marathon\nTomPickup.com | Charity Chester Marathon What Am I Doing? The Chester Marathon, for the North West Air Ambulance charity. What Is The Chester Marathon? Running 26 miles and 385 yards, or 42.195km, in and around the City of Chester, in Cheshire. I chose to do it for North West Air Ambulance. […]\n10km Swim For Cancer Research\nTomPickup.com | Charity 10km Swim For Cancer Research What Am I Doing? Swimming 10km in March for Cancer Research, the cancer charity. What Is Swim 10km For Cancer Research? Cancer Research challenged people to swim 10km in March 2025, to raise awareness and funds to fight cancer. As I was doing the […]\n100 Miles For Mind\nTomPickup.com | Charity 100 Miles For Mind What Am I Doing? Hiking and running 100 miles, for Mind, the mental health charity. Mind is a cause close to my heart, everyone I know, including me, has struggled with their mental health at times in their lives! What Is 100 Miles for Mind? […]\nSwim 22\nTomPickup.com | Charity Swim 22 What Am I Doing? Swimming 44 miles for Diabetes UK. Diabetes UK support those who suffer from diabetes and work on finding treatments and a cure. What Is Swim-22? Diabetes UK have created the ‘Swim 22’ challenge as a fundraiser, to raise awareness and money for their […]",
  "https_tompickup_com_/https_tompickup_com_50-miles-for-sands/content_21.html": "What Am I Doing?\nRunning 50 miles in April 2025, for the charity Sands, who are focused on saving babies lives, preventing stillbirth, and supporting bereaved parents who suffer. A cause very close to my heart, in memory of Baby G, the son of Graham Hurst.\nWhat Is 50 Miles for Sands?\nSands are challenging people to run 50km over the month of April, to raise awareness and funds.\nHow’s It Going?\nAs of 5th April 2025, I’ve just started, and I’ve done 1km so far! So not even a mile. Long way to go!\nHow To Donate\nThe 50 Miles for Sands and Sands donation pages are:\nWhat Else I’m Doing\nMarch 25 – 100 Miles for Mind | Swimathon 2025 | 10km Swim for Cancer Research\nApril 25 – 50 Miles for Sands\nSummer 25 – Olympic Triathlon | Baby G Cycle\nAutumn 25 – Chester Marathon",
  "https_tompickup_com_/https_tompickup_com_2025_04_25/content_15.html": "Lancashire County Council’s £479 Million Highways Backlog of Works\nTomPickup.com | Politics Lancashire County Council’s £479 Million Highways Backlog of Works What Is Happening? Lancashire County Council’s Highways Department have a maintenance backlog of £479 million. This is work that has been identified as needed to be done. The Tory-led Council’s highways budget for this year is only £74m. The backlog consists of required […]\nAsylum Seekers In Lancashire Costs The Taxpayer More Than Lancashire County Council’s Total Debt\nTomPickup.com | Politics Asylum Seekers In Lancashire Costs The Taxpayer More Than Lancashire County Council’s Total Debt How Many Asylum Seekers Are In Lancashire? According to 2021 Census data, Lancashire is home to 37,277 ‘resettlers’, people who have come here as refugees or asylum seekers. According to Lancashire County Council, as of 2023 there were […]",
  "https_tompickup_com_/https_tompickup_com_local-services-and-businesses/content_36.html": "What Is Happening?\nLancashire County Council is in huge debt, the daily interest rates are colossal.\nTo balance the books, they’re planning huge cuts. That means cuts to the services we rely on and need.\nWhy Has This Happened?\nFor years, the two main political parties have mismanaged our country, our county and our area, leaving our economy and services in a mess.\nOnly Reform UK stand a chance of getting us out of it. This is why I’m standing for Reform UK. Things are going to get worse, and fast.\nNow, more than ever, we need a County Councillor at County Hall, who will represent the people in Padiham and Burnley, and make it about the people who live here. We need someone with the experience, skills and will to make changes.\nSince the last election, our current County Councillor, Alan Hosker, only turned up to 44% of Lancashire County Council meetings he was expected at. The voice and the vote of the people of Padiham and Burnley has gone mostly unheard, for years. Our tax money (close to £60k in allowances, plus expenses) has gone to waste paying him to not even turn up half of the time. If you didn’t turn up for your job more than half of the time, you’d be sacked!\nYears of Labour and Tory politicians have talked a good game, some have even shown up to vote more than half the time and actually cared, but they have all failed to turn things around.\nWhat I Will Do\nWhen I used to work in procurement at Lancashire County Council, I saw so much waste of taxpayer money that it knocked me sick.\nFor every pound I saw wasted, millions of them, I pictured all the local, honest people I knew. I knew they worked hard to pay their taxes and, in many cases, just to make ends meet. I knew that if they saw how their tax money was being wasted, and the attitudes of those whose job it was to make sure it wasn’t, they would feel sick too.\nThe politicians would swan in, acting like the big cheeses, impressed with their own importance. I’d watch their campaigns to convince their local people that they were doing a good job for them, just to get their votes, while things only got worse.\nI remember speaking to my boss about it, who was one of the good guys working against the grain to stop the waste. He advised me to go into business and learn the skills needed to go back to County Hall and make the changes that are needed. That is exactly what I’ve done. Since then, things have gotten even worse.\nI will act and act fast, finding and cutting waste, improving processes, driving the accountability and change we need.\nI will be transparent with the public, sharing everything I find and do and asking for your input into every decision. County Councillors represent you, not themselves, it’s about what you want done with your money.\nLancashire’s massive debts will be paid not only by us, but by our children and by our grandchildren. For too long we have kicked the can to the next generation. The buck needs to stop with us. If you think services have got worse in your life and we’re getting less value for money, the decline and cost will be felt even more by our children. At this rate, what will even be left for our grandchildren?\nFor local businesses, I will engage with all of them, listen to what they need and use my position, skills, experience and professional network to help them grow, bringing more money into the local economy and creating better jobs.\nWe have a lot of good local businesses already, with a little bit of support and engagement from Lancashire County Council they can thrive even more. That requires someone talking to them, listening to what they need and delivering it, not just turning up for a photo opportunity.\nFor too long we’ve had politicians who lack the experience to really make a difference, or who even show up. The UK needs Reform. Lancashire needs Reform. Padiham & Burnley West needs Reform.\nWhat can you do?\nI want to hear from the people of Padiham and Burnley West, to find out what you need. Get in touch with me, or join my Facebook Group and page for updates and discussion.\nFacebook Group – https://www.facebook.com/groups/tompickupburnley/\nFacebook Page – https://www.facebook.com/tompickupburnley/\nContact me directly – https://tompickup.com/contact/",
  "https_tompickup_com_/https_tompickup_com_2025_04_23/content_52.html": "What Can Be Done About Nuisance Bikes?\nTomPickup.com | Politics What Can Be Done About Nuisance Bikes? What Is Happening? There have been many reports of nuisance bikes in the Ward, such as the behaviour of electric bike riders on & off road in neighbourhoods and motorbikes & quad bikes causing damage to Hapton Moor / Hameldon Hill and Quarry. The Burnley […]\nMy Objections To The Planning Application Off Green Close\nTomPickup.com | Politics My Objections To The Planning Application Off Green Close What Is Happening? A planning application is under consideration for the building of 9 dwellings off Green Close. The proposed development will back onto the houses on Apex Close. This is in the Burnley West part of the ward, close to Burnley Golf […]\nHousing Development Causing Dust Issues\nTomPickup.com | Politics Housing Development Causing Dust Issues For Residents What Is Happening? A large housing development off Rossendale Road, in the Padiham & Burnley West ward, is apparently causing dust issues for residents. This was reported to me by a local resident, among other concerns about the site. Upon visiting the area, I witnessed […]",
  "https_tompickup_com_/https_tompickup_com_2025_04_19/content_47.html": "Who Are Burnley’s Current County Councillors, What Do They Do And How Much Do They Get Paid?\nTomPickup.com | Politics Who Are Burnley’s Current County Councillors, What Do They Do And How Much Do They Get Paid? What Do County Councillors Do? County Councillors are responsible for setting policies and making decisions for the whole of Lancashire, for everything Lancashire County Council presides over. They decide matters relating to: Education (schools, special […]\nLancashire County Council Waste: What Can Be Done About The £720k Refugee Translation Tender\nTomPickup.com | Politics Lancashire County Council Waste: What Can Be Done About The £720k Refugee Translation Tender What Is Happening? I recently wrote about Lancashire County Council awarding a £720,000 tender for refugee interpretation and translation services. A voter wrote to me and asked what can be done about it should Reform get into power […]",
  "https_tompickup_com_/https_tompickup_com_lancashire-county-councils-479-million-highways-backlog-of-works/content_25.html": "What Is Happening?\nLancashire County Council’s Highways Department have a maintenance backlog of £479 million. This is work that has been identified as needed to be done. The Tory-led Council’s highways budget for this year is only £74m.\nThe backlog consists of required spending like:\nCarriageways – £160m, footways – £40m, street lighting – £14m, bridges £175m and retaining walls – £90m.\nThe budget for next year? Being reduced by the Conservatives by over £30m.\nWhat We’ll Do\nReform UK plan to first reverse these planned £30m+ of cuts to the highways budget, and then to sort the whole budget out, to free up more money to clear the backlog and deliver the works needed to highways in Lancashire.\nThe Conservatives and Labour have no plan for clearing the backlog, they aren’t even being up front about it! Only Reform are being transparent about the state of affairs in Lancashire. It won’t be easy, but every candidate I’ve spoken to is honest about it and has the desire to sort it out and be honest with people about what’s going on at LCC.\nThe Conservatives have got the County Council in massive debt, they are running at a deficit and have the audacity to ask for re-election!\nCredit to Stephen Atkinson of Reform UK – Ribble Valley and his team for highlighting this.\nOnly Reform UK Councillors leading County Hall to get a handle on this. A vote for anyone else is a vote for more of the same.",
  "https_tompickup_com_/https_tompickup_com_2025_04_28/content_28.html": "Reform UK’s Farming Policies\nTomPickup.com | Politics Reform UK’s Farming Policies ’ve been asked a few times recently about Reform UK’s farming policies, so I thought I’d share them publicly in an article. In the 2024 Manifesto, Reform UK proposed several policies relating to farming, which aim to help small farms. As I have lived rurally, I understand a […]",
  "https_tompickup_com_/https_tompickup_com_who-are-burnleys-current-county-councillors-what-do-they-do-and-how-much-do-they-get-paid/content_38.html": "What Do County Councillors Do?\nCounty Councillors are responsible for setting policies and making decisions for the whole of Lancashire, for everything Lancashire County Council presides over.\nThey decide matters relating to:\n- Education (schools, special educational needs etc.)\n- Transport (e.g. roads, potholes, major projects)\n- Social care (e.g. services for children, the elderly and the vulnerable)\n- Libraries and cultural services (e.g. whether your local library stays open)\n- Public health (e.g. sexual health services)\n- Waste disposal (e.g. where rubbish from tips goes and who moves it)\n- Strategic planning (e.g. major infrastructure projects)\nThey have meetings at County Hall, in Preston, where such things are decided at both Full Council meetings and on different Committees.\nSo it’s a County Councillor’s job to represent their local area and its people in meetings at County Hall, as well as helping people in the area to access the Council’s services, such as reporting potholes in need of repair, and help them with issues.\nHow Much Spending Do They Control?\nFor 2025/26, LCC’s projected spend is over £1.2 billion. It’s likely that over the four-year term the next County Councillors will serve, they’ll be making decisions on spending over £5 billion.\nHow Much Do County Councillors Get Paid?\nFor the 2025/26 financial year, County Councillors receive a basic allowance of over £14,000.\nThey can also claim expenses (for things like travel & an IT allowance).\nIf they take on extra responsibilities, such as certain roles on committees, or their party’s leader at County Hall, they can get paid more, going up to over £42,000.\nWho Are Burnley’s Current County Councillors And What Do They Do?\nThe table below shows the County Councillors name, party, attendance since last elected, whether they attended the LCC 2025/26 budget meeting, what committees they’re on (if any) and whether they claimed expenses.\nBreakdown\n- Only one County Councillor managed full attendance (Scott Cunliffe)\n- Only one other Councillor managed over 80% attendance (Cosima Towneley)\n- The highest paid Councillor was Cosima Towneley (£39,539)\n- The worst attending Councillor had 44% attendance (Alan Hosker)\n- Only one Councillor didn’t attend the 2025/26 LCC budget meeting (Alan Hosker)\n- Every Conservative Councillor claimed expenses\n- Every Labour (at present) Councillor claimed expenses\n- Two thirds of Labour Councillors left the party during their term\n- Burnley as a whole is only represented on 3 Committees, despite having 6 Councillors\n- Every Councillor claimed expenses\nWhat I’ll Do\nTo remedy the obvious issues, I will:\n- Accountability – I’ll publish an article and provide a link on social media about every meeting, giving an overview, all the Burnley Councillor’s attendance and what input they had… so you know what’s going on and who’s doing what at County Hall\n- Committees – Reform UK’s Burnley Councillors want a say on every Committee we can get on… so the things that matter to you, the people of Burnley, are heard\n- Leaving the party – if I was to leave Reform UK, for any reason, I’ll stand down and trigger a by-election… so that it’s up to you if you then want to re-elect me, if I was standing as an independent or for another party, or re-elect a Reform UK or other candidate\nSources\nVarious parts of the https://lancashire.gov.uk/ website.",
  "https_tompickup_com_/https_tompickup_com_2025_04_14/content_51.html": "Reform UK Burnley Page Removed By Facebook\nTomPickup.com | Politics Reform UK Burnley Page Removed By Facebook What Is Happening? On Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page. Following an appeal, the page was then swiftly completely removed by Facebook, […]\nReform UK Burnley Page Suspended By Facebook\nTomPickup.com | Politics Reform UK Burnley Page Suspended By Facebook What Is Happening? On Monday 14th April, less than 3 weeks before the elections on 1st May, Facebook have interfered in Burnley and Padiham politics, by suspending the ‘Reform UK – Burnley’ Facebook page. Following an appeal, the page was then completely removed by Facebook. […]",
  "https_tompickup_com_/https_tompickup_com_politics_get-involved/content_3.html": "Get involved in the political campaign for Reform UK in Padiham & Burnley West\nWhether you want a Reform UK poster to display in your window, a Reform UK banner for your garden, to help with leaflet delivery, or to help with campaign management & organisation, or anything else... please fill out the form below or contact me.",
  "https_tompickup_com_/https_tompickup_com_poplars-tuition/content_30.html": "What is the project?\nPoplars Tuition, a private tutoring business based in Bury, Greater Manchester, wanted a business logo, a website designing & hosting, a professional @poplarstuition.co.uk email address, a place to receive online reviews from their happy customers and advice about marketing the business to new & existing markets and clients.\nWhat I Did\nLogo\nWebsite\nProject is ongoing"
}