{
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_donate/content_9.html": "Donate to your local Reform Constituency office\nReform UK is working hard to bring positive change to Bicester and Woodstock. We're committed to putting our community first and tackling the issues that matter most to local people. But we can't do it alone. We need your support!\nYour generous donation will help us to:\nRun effective local campaigns: Your contribution will enable us to reach more residents, raise awareness of important local issues, and campaign for the changes our community needs. We'll be able to produce campaign materials, organize events, and connect with voters directly.\nSupport our prospective councillors: We're building a strong team of local champions to stand as Reform UK councillors. Your donation will help provide them with the training, resources, and support they need to be successful advocates for Woodstock & Bicester.\nBuild a stronger community: Your support will empower us to strengthen our local communities by investing in local initiatives, supporting community groups, and working collaboratively with residents to build a better future for Woodstock & Bicester.\nEvery contribution, big or small, makes a real difference. Donate today and help us bring real reform to Woodstock and Bicester!\nSupport Reform UK, Bicester & Woodstock: Donate Today!\nDonate to your local Reform Constituency office\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_news-and-events/content_3.html": "Local News & Events\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_policies/content_10.html": "Our promise for a better, innovative and hopeful Britain\nReform UK's \"Contract with You\" presents a radical departure from traditional Conservative and Labour policies, promising fundamental changes to Britain's governance. The document outlines a nationalist, free-market approach prioritising reduced immigration, lower taxes, and decreased government intervention. It emphasises practical solutions to NHS waiting times and energy costs, while promoting British values and sovereignty. The plan claims to be fully costed through government savings and economic growth, with projected annual savings of £160 billion against costs of £141 billion.\nImmigration control: Freezing non-essential immigration, stopping small boats, and implementing stricter border controls to protect public services and wages\nEconomic reforms: Raising income tax threshold to £20,000, cutting corporate tax, reducing government waste, and abandoning Net Zero policies to reduce energy costs\nNHS reform: Zero waiting lists pledge, tax relief for medical staff, and introducing a voucher system for private treatment if NHS delays are too long\nLaw and order: Increasing police numbers by 40,000, implementing zero-tolerance policing, and tougher sentencing for criminals\nConstitutional change: Leaving the European Convention on Human Rights, reforming the House of Lords, and protecting British sovereignty and values\nReform UK - National Policies\nReform UK - Bicester & Woodstock\nHousing and Development\nFast-track development of brownfield sites in B&W area for housing, particularly focusing on genuinely affordable homes for local residents\nReform local planning processes to prioritise housing developments that serve community needs while protecting green belt areas\nImplement strict controls on foreign ownership of local properties to ensure housing serves local residents first\nHealthcare\nSupport the relocation and expansion of Woodstock Surgery through streamlined planning processes\nPush for tax incentives for healthcare workers to attract and retain medical staff in local facilities\nBack Reform UK's NHS voucher scheme to reduce waiting times at local practices\nInfrastructure and Transport\nReview and potentially modify East West Rail project plans to better serve local community needs\nFocus on improving existing road and rail infrastructure rather than costly new projects\nImplement practical traffic management solutions based on community feedback\nLocal Economy\nSupport local businesses through reduced regulation and lower business rates [6]\nEncourage development of local apprenticeship programs through tax incentives\nFocus on attracting investment to create more local job opportunities\nEducation\nSupport Reform UK's policies on educational standards while ensuring local schools maintain autonomy\nPush for increased funding for local vocational training programs\nBack measures to reduce bureaucracy in local schools and focus resources on frontline teaching\nEnvironment and Planning\nBalance development needs with environmental protection through smart planning\nSupport renewable energy projects where they don't impact agricultural land or local communities\nImplement practical waste management and recycling solutions\nCommunity Engagement\nYour Voice Matters\nRegular community polls and discussions to shape local policies\nOpen forums for residents to raise concerns and suggest solutions\nTransparent communication about policy development and implementation\nWe emphasize that these policies will evolve based on community input and changing needs. We invite all residents of Bicester & Woodstock to:\nShare their concerns and ideas\nParticipate in local policy discussions\nHelp shape solutions that work for our community\nThrough this collaborative approach, we aim to create policies that truly reflect local needs while aligning with Reform UK's national vision for positive change.\nLocal & Community Policies\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_councillors/content_7.html": "Make a real difference in Bicester & Woodstock\nAre you passionate about your community? Do you believe the Bicester & Woodstock constituency deserves better? Reform UK needs you! We are looking for dedicated individuals like you to stand as local councillors and make a tangible difference in our community. By becoming a Reform UK councillor, you will have the power to tackle the issues that matter most to local people and drive real change.\nAs a Reform UK councillor, you can:\nChampion local priorities: Reform UK is committed to putting communities first. As a councillor, you'll be the voice of local residents, ensuring their needs are heard and addressed by the council. You can fight for improved local services, sensible planning decisions, and greater investment in our area. We believe in empowering local communities and giving them greater control over the decisions that affect their lives – you will be at the forefront of delivering that change.\nHold the council accountable: Reform UK stands for transparency and accountability in local government. As a councillor, you will have the opportunity to scrutinize council spending, hold other councillors accountable, and ensure that taxpayer money is used effectively and efficiently. You can work to eliminate wasteful spending and prioritise essential services for the residents of Bicester & Woodstock.\nBuild a stronger community: Reform UK is dedicated to building stronger, more united communities. As a councillor, you will have the opportunity to bring people together, foster community pride, and champion local initiatives. You can work collaboratively with residents, businesses, and community groups to make Bicester & Woodstock an even better place to live, work, and raise a family.\nBecome a Reform UK Councillor\nWe are still looking for Councillors for the following locations:\nKidlington North, Otmoor, Kidlington East, Kidlington West and Eynsham\nPlease contact Ian : chair.baw@reformuk.com\nIMPORTANT!\nWorried about not having experience? Don't be!\nReform UK is committed to supporting all of its candidates. You'll receive comprehensive training and ongoing support from our experienced team in the Bicester & Woodstock constituency, as well as guidance and resources from Reform UK HQ. We'll be with you every step of the way, providing the tools and knowledge you need to be a successful councillor and a strong advocate for our community.\nApply to become a Reform UK Councillor\nLearn about being a Councillor\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_where-to-vote-for-your-candidate/content_1.html": "Where to go on May 1st and about our candidates\nWhere & how to vote\nPhotographic identification\nPhotographic identification is required to vote in English local elections, and UK parliamentary elections, since 4 May 2023\nLearn more on the website of the Electoral Commission.\nYou can apply for a free 'Voter Authority Certificate' if you do not already possess a valid ID.\nYou do not need photo ID to vote by post.ur text here...\nClick to find your polling station\nHanborough & Hailey - James Gibbs\nAfter running a successful property sector business for 30 years, I understand how to manage budgets effectively and deliver value for money - skills that are essential for responsible local government. My experience owning and running a business in the property sector with considerable management skills gives me unique insight into local planning, infrastructure needs, and community development.\nAs someone who's created jobs and contributed to local economic growth, I understand first hand how council decisions impact small businesses and residents. I believe in efficient public spending that delivers quality services while keeping costs under control. My business background has taught me to identify waste, streamline operations, and focus on practical solutions that work for everyone.\nHaving sold my business in 2021, I'm now ready to dedicate my time and expertise to serving our community in Hanborough and Hailey area. Living in East End, Oxfordshire, I'm deeply invested in our area's future. I'm standing with Reform UK because I believe in their commitment to practical, common-sense solutions to local issues.\nI'm approachable, hardworking, and ready to put my financial and management experience to work for our community. I would be honoured to receive your vote and serve as your local councillor.\nWhere to Vote for James Gibbs on May 1st\nHanborough - The Pavilion\nPlaying Field\nRoosevelt Road\nLong Hanborough\nOX29 8JG\nWoodstock - James Nash\nIt’s an honour to be your Reform UK candidate for Woodstock Division. As a Woodstock resident, I'm deeply committed to our community. With over 20 years in business leadership and local Reform UK experience (including building effective digital tools), I have a proven record of getting things done. My focus now is firmly local, bringing a common-sense approach centred on families, community, businesses, reliable services, and value for money. I'll fight for lower taxes, better services, and ensure residents are heard.\nThe Lib Dem/Green Council has failed Woodstock: neglecting road maintenance, hitting us with record tax hikes, allowing development without infrastructure, and pursuing costly Oxford-centric vanity projects over local needs like river pollution. This mismanagement must end. Woodstock deserves a strong voice demanding practical solutions. It’s time for change. We need Reform.\nWhere to Vote for James Nash on May 1st\nWoodstock Bowls and Tennis Club\nCadogan Park\nWoodstock\nOX20 1UW\nKidlington East - Danny Reeve\nAn Oxfordshire resident for 14 years, I'm committed to our local area. My experience with Kidlington Youth Forum became critical when the Council stopped investing in youth leaders and cut the weekly youth hangout. Seeing the gap, I and others from Lifehouse Community Church stepped up. We ran the drop-in weekly for three years, eventually supporting over 70 local teens – proving community initiative works where council support failed.\nThis firsthand experience fuels my drive to champion proper investment in youth services, alongside safer communities, fixing our pothole-ridden roads, and fostering local businesses. I offer a common-sense approach focused on value for your money. Enough of the Lib Dem/Green council wasting funds on ideological vanity projects while hiking Council Tax and neglecting vital services. I will fight to stop waste, lower taxes, demand better services, and ensure your voice is heard. It's Time for Change.\nWhere to Vote for Danny Reeve on May 1st\nKidlington Youth Football Club\nEvans Lane\nKidlington\nOxon\nOX5 2HX\nBicester South - Jeff Rigby\nI'm Jeff Rigby, your Reform UK candidate for Bicester South. As a dedicated Bicester South resident, my life has been committed to public service. For 19 years, I served as a prison officer, alongside vital work supporting the homeless, within our NHS, and in security roles. My qualifications in child protection and counselling further deepened my understanding of the critical importance of community safety and social welfare.\nNow retired, I want to bring this real-world experience and a common-sense approach to our council. Enough of the Lib Dem/Green failures – record Council Tax hikes while essential services like road maintenance decline into a pothole pandemic, and wasted funds on ideological projects. I will focus on what truly matters: safer streets, reliable local services, support for families and businesses, and genuine value for your money. We need a council that listens and acts on your priorities. I'll fight for lower taxes, better services, and efficient management. It’s Time for Change.\nWhere to Vote for Jeff Rigby on May 1st\nMobile Station at Graven Hill\nAnniversary Avenue East\nAmbrosden\nBicester\nOX25 2BF\nLangford Community Centre\n8 Nightingale Pl,\nBicester\nOX26 6XX\nAmbrosden Village Hall\nMerton Rd\nAmbrosden,\nBicester\nOX25 2LX,\nChesterton & Launton (and outlying villages) - Ian Hodgson\nIncludes outlying villages:\nI'm Ian Hodgson, Chairperson for Reform UK Bicester & Woodstock and a father committed to community and opportunity. With over 20 years leading in manufacturing industries – rising from engineer to Operations Director – I know firsthand the importance of efficiency, managing budgets, and developing skills. Government should operate with the same common sense, yet we see waste and bureaucracy hindering progress.\nI'm deeply concerned by the skills gap limiting our young people and the visible decline in our NHS, which I've experienced personally. Skilled staff are leaving due to poor conditions. Reform UK offers practical solutions: cutting waste, investing smartly in training and apprenticeships, and vital measures like income tax cuts for frontline health staff. It’s time to ditch slow-moving politics and apply a decisive, business-minded approach to get things done, delivering value and real opportunities. I’m committed to driving that change.\nWhere to Vote for Ian Hodgson on May 1st\nLaunton Parish Hall\nBicester Road,\nLaunton,\nBicester, Oxon\nOX26 5AE\nLaunton (OX26)\nMobile Station at the Recreation Ground\nSheen Close\nEntrance to the Ground,\nCaversfield,\nBicester, Oxon\nOX27 8AA\nCaversfield (OX27)\nChesterton\nLaunton\nKirklington\nFringford\nFinmere\nStratton Audley\nMixbury\nCaversfield\nBucknell\nMiddleton Stoney\nCottisford\nHethe\nStoke Lyne Fewcott\nKidlington North & Otmoor - Tom Burgess\nI became involved in politics in December 2023 after feeling completely let down by the Conservatives. With no real alternative in sight, I found myself politically homeless. Instead of simply grumbling at the radio, tutting at social media, or passively watching the decline of our local investment, amenities and services, I decided to take action—to channel my energy into supporting our community and providing a genuine alternative for real change.\nHaving lived in Kidlington and Bicester all my life, I intimately understand the challenges our families and communities face—but I also recognize the opportunities ahead. As a family man and local businessman, I'm deeply committed to ensuring our rural communities receive the support and services they deserve.\nI will work with you—and for you—to strengthen our community by advocating for better representation of our farming constituents, well-maintained roads, effective solutions to traffic congestion, and improved public transport.\nI pledge to drive down council debt, root out wasteful spending, and highlight inefficient processes. Our public money must be spent wisely, ensuring every investment delivers tangible, lasting benefits for all residents.\nWith extensive experience in the infrastructure sector, I understand the critical importance of responsible development—meeting local needs, maintaining existing assets, and protecting the character of our cherished countryside.\nI will work tirelessly for you—for both this generation and the next—to help create a safer, stronger, and more prosperous community that we can all proudly call home.\nI hope I can count on your vote—let's deliver real change, together.\nWhere to Vote for Tom Burgess on May 1st\nKidlington\nKidlington Youth Football Club\nEvans Lane\nKidlington\nOxon\nOX5 2HX\nCharlton on Otmoor Community Hall\nFencott Road\nCharlton-on-Otmoor\nKidlington\nOxon\nOX5 2UT\nIslip Village Hall\nChurch Lane\nIslip\nKidlington\nOxon\nOX5 2TA\nEynsham - Peter Lynn\nAs a retired language teacher and longtime Witney resident, I've witnessed first-hand how traditional parties have consistently neglected our local needs. My experience as a Town Councillor has shown me both the potential and failings of local governance, strengthening my resolve to deliver genuine change.\nI joined Reform UK because Eynsham deserves better than endless empty promises. I'm committed to breaking the status quo by bringing practical solutions to issues affecting our daily lives - from protecting green spaces to ensuring fair allocation of council resources.\nI believe in accountability. Elected officials must answer to their communities, making decisions transparently and with genuine consultation. As your Reform UK candidate, I will challenge wasteful spending, advocate for essential services, and ensure Eynsham receives its fair share.\nWith your support, we can create the meaningful change our community deserves. I hope I can count on your vote to build a more accountable future for Eynsham.\nWhere to Vote for Peter Lynn on May 1st\nEynsham\nEynsham Village Hall\nBack Lane\nEynsham\nOX29 4QW\nKidlington West - Hamish McLay\nI've been proud to call Cherwell home since the early 1980s, when I first moved to this wonderful area. My local roots run deep, beginning my career in Kidlington's vibrant motoring scene before expanding my horizons with positions at Unipart and later at Prodrive in Banbury. These experiences gave me valuable insights into our local economy and community.\nToday, I run a data research business that helps local residents navigate the complexities of moving house. This work has connected me with countless families throughout our community, allowing me to understand firsthand the challenges and aspirations of West Kidlington residents.\nOver the decades, I've witnessed both positive changes and concerning developments in our area. While our community spirit remains strong, I've become increasingly troubled by how traditional parties have failed to address our local needs and concerns.\nI'm standing for Reform UK in West Kidlington because I believe our community deserves better representation - someone who truly understands local issues and will fight tirelessly to address them. From improving our roads and infrastructure to ensuring development is managed responsibly, I'm committed to being a strong, authentic voice for all residents.\nMy approach is straightforward: listen to community concerns, speak honestly about challenges, and work relentlessly toward practical solutions. I won't make empty promises or put party politics before local interests.\nWith my deep local knowledge and genuine commitment to our community, I hope to earn your trust and your vote. Together, we can ensure West Kidlington receives the attention, resources, and representation it truly deserves.\nWhere to Vote for Hamish McLay on May 1st\nKidlington West\nBegbroke Village Hall\nBegbroke Lane\nBegbroke\nKidlington\nOxon\nOX5 1RN\nBicester West - George Popescu\nFor over eight years, I've been proud to call Bicester my home. During this time, I've developed a deep appreciation for our town's unique character and community spirit, while also witnessing the challenges that come with rapid growth and development.\nI'm standing for Reform UK because I firmly believe that development must benefit the people who live here, not just developers and distant decision-makers. Too often, local residents find their concerns sidelined while facing the consequences of poorly planned expansion.\nMy vision for Bicester centers on sustainable growth that preserves what makes our town special while embracing positive change. This means demanding high-quality housing developments with proper infrastructure in place before new homes are built. It means ensuring our roads can handle increased traffic, our schools have sufficient capacity, and our healthcare services can meet growing demands.\nI'm committed to supporting policies that strengthen our local economy, creating meaningful employment opportunities and helping small businesses thrive. A prosperous Bicester should work for all residents, not just a privileged few.\nAs your representative, I promise to be a strong voice challenging the status quo. I will listen to your concerns, stand up for your interests, and push for practical solutions to the problems we face together.\nHaving seen how traditional parties have failed to address our community's needs, I believe Reform UK offers a fresh approach - one that puts local people first. With your support, I'll work tirelessly to ensure Bicester grows in a way that enhances our quality of life and creates a town we can all be proud to call home.\nI hope I can count on your vote to help build a brighter future for Bicester.\nWhere to Vote for George Popescu on May 1st\nBicester West\nKingsmere Community Centre\nWhitelands Way\nBicester\nOX26 1EG\nBicester North & Caversfield - Alan Thomas\nAs a former British soldier and current Ministry of Justice professional, I've dedicated my life to public service and protecting our communities. These experiences have instilled in me the values of discipline, integrity, and commitment to duty—values I now hope to bring to local government.\nHaving raised my family here, I've been actively involved in community initiatives and understand the challenges we face firsthand. I believe our area deserves representation that truly listens and acts decisively on local concerns.\nMy priorities are clear: investing in our youth to provide them with opportunities and positive pathways; tackling crime and anti-social behaviour to make our streets safer; revitalising our high streets to support local businesses; standing up for our farmers who form the backbone of our rural economy; and ensuring residents' voices are genuinely heard in all council decisions.\nToo often, traditional parties have ignored local needs while pursuing their own agendas. As your Reform UK candidate, I promise to put community before party politics. I'll be accessible, accountable, and work tirelessly to represent your interests.\nMy goal is simple but ambitious: to help create a safer, stronger, and more prosperous community where families can thrive and businesses can flourish. With your support, we can build a better future together.\nI hope I can count on your vote to deliver the real change our community needs.\nWhere to Vote for Alan Thomas on May 1st\nBicester North & Caversfield\nEmmanuel Church\nBarberry Place\nBicester\nOX26 3HA\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_vacancies/content_5.html": "Vacancies\nWe need dedicated volunteers like you to make it happen. At Reform UK Bicester & Woodstock, we're looking for passionate individuals to join our team as social media creators, writers, content developers, and canvassers.\nWhile these are unpaid roles, they offer something far more valuable - the opportunity to actively shape our political landscape.\nFor too long, British politics has stagnated because good people stood back and felt powerless. That ends now. By volunteering your skills and time, you'll be part of a growing movement bringing common sense back to British politics. Whether you're great with social media, have a talent for writing, or enjoy connecting with people, your contribution could help transform our local community and influence national change. Don't just watch from the sidelines - be part of the solution\nWant to make real change in British politics? It starts here, at home.\nWhat you get from working with us\n• Valuable experience in political campaigning\n• Network with like-minded change-makers\n• Learn practical skills in communications and public engagement\n• Direct involvement in shaping local policy\n• Real opportunity to influence positive change\n• Be part of a growing grassroots movement\n• Development of leadership skills\n• Understanding of political processes from the inside\n• Platform to voice your ideas and concerns\n• Sense of purpose in actively improving your community\nYour country and local Community needs you more than ever.\nBecome a Reform UK Councillor: Make a Real Difference in Bicester & Woodstock!\nAre you passionate about your community? Do you believe Woodstock and Bicester deserve better? Reform UK needs you! We are looking for dedicated individuals like you to stand as local councillors and make a tangible difference in our community. By becoming a Reform UK councillor, you will have the power to tackle the issues that matter most to local people and drive real change.\nCURRENT VACANCIES (April, 2025)\nCampaign Administrators\n(2 positions available)\nRole Overview:\nWorking directly with our Campaign Organiser, you'll be the driving force behind our ground campaign operations across the Bicester & Woodstock constituency, planning and coordinating our local action days.\nKey Responsibilities:\nDesign efficient canvassing routes using OS maps\nPrepare and distribute campaign materials and maps\nCoordinate with local action groups\nSupport the planning and execution of action days\nMaintain campaign databases and records\nLiaise with volunteers and team leaders\nIdeal Candidates Will Have:\nStrong IT and digital mapping abilities\nExcellent organisational skills\nClear communication style\nAttention to detail\nBasic understanding of OS maps\nAbility to work systematically\nIf you're well-organised, tech-savvy, and want to help drive positive change in our constituency, this role is for you. Whether you're experienced in planning and coordination or simply have a talent for organisation, your skills could help transform local campaigning.\nTime Commitment:\nFlexible hours, with increased activity around action days and campaign events.\nThis is an unpaid, volunteer position offering valuable experience in political communications and local journalism while contributing to positive change in our community.\nTraining Officer\nRole Overview:\nWorking directly with our Chair and Deputy Chair, you'll be responsible for ensuring our team is well-prepared and confident in representing Reform UK across the Bicester & Woodstock constituency. You'll develop and deliver training that empowers our volunteers to engage effectively with residents and handle various campaign situations professionally.\nKey Responsibilities:\nDeliver canvassing response training\nBrief teams on Reform UK policies and positions\nCreate practical scenario-based training sessions\nPrepare volunteers for doorstep conversation.\nDevelop clear guidance materials\nKeep team updated on policy developments\nEnsure consistent messaging across our campaign\nIdeal Candidates Will Have:\nStrong communication and presentation abilities\nGood knowledge of Reform UK policies\nExperience in training or teaching (desirable)\nAbility to explain complex topics clearly\nPatient and encouraging teaching style\nWell-organised approach to documentation\nIf you have experience in training, education, or professional development and want to help build a strong, confident campaign team, this role is for you. Whether you're a current/former teacher, corporate trainer, or someone who enjoys helping others learn and develop, your skills could help ensure our message is delivered effectively across the constituency.\nTime Commitment:\nRegular training sessions plus preparation time, with flexibility to accommodate volunteer availability.\nThis is an unpaid, volunteer position offering valuable experience in political communications and local journalism while contributing to positive change in our community.\nReady to make a difference? If you're interested in any of our volunteer roles, drop us a message at vacancies@reformukbaw.org - Let's bring positive change together.\nMedia Content Creator - Bicester & Kidlington area\n(2 positions available)\nRole Overview:\nWorking directly with our Campaign Organiser, you'll help tell the stories that matter across our constituency's communities, highlighting issues that affect residents' daily lives and documenting our fight for common sense solutions.\nKey Responsibilities:\nIdentify and research local interest stories in your designated area (Bicester/Kidlington)\nCapture compelling photos and videos of local issues and events\nConduct vox pops and gather resident opinions on current issues\nCreate engaging content for social media and local communications\nDocument local campaigns and Reform UK activities\nHelp build our digital presence across the constituency\nIdeal Candidates Will Have:\nStrong interest in local issues and community matters\nBasic photography/video skills\nGood communication abilities\nActive social media knowledge\nAbility to spot newsworthy stories\nUnderstanding of what matters to local residents\nCommitment to Reform UK's values and mission\nThis role is perfect for media-minded individuals, whether you're a student interested in journalism, a local resident passionate about community issues, or someone looking to gain practical experience while making a real difference in our constituency. If you're keen to tell local stories that matter, this could be your opportunity to contribute to meaningful change.\nTime Commitment:\nFlexible hours to suit your availability, with some evening and weekend work for events coverage. This is an unpaid, volunteer position offering valuable experience in political communications and local journalism while contributing to positive change in our community.\nSocial Media Leader\n(2 positions available)\nRole Overview:\nWorking directly with our Campaign Organiser, you'll manage our social media presence across platforms, ensuring our message of common sense solutions reaches all corners of the Bicester & Woodstock constituency.\nKey Responsibilities:\nManage and update our Facebook and X (formerly Twitter) accounts\nShare relevant Reform UK national content\nPost approved local content and campaign updates\nMonitor local community discussions and engagement\nTrack social media metrics and engagement\nCoordinate with Media Content Creators to share local stories\nEnsure consistent messaging aligned with Reform UK values\nMaintain professional and engaging tone across all platforms\nIdeal Candidates Will Have:\nStrong understanding of social media platforms\nExperience managing Facebook and X accounts\nGood judgment in content selection\nExcellent written communication skills\nUnderstanding of political social media etiquette\nAbility to work within approval processes\nReliable and consistent availability\nIf you're passionate about social media, understand digital engagement, and want to make a real difference in our constituency, this role is for you. Whether you're a marketing professional, student, or skilled enthusiast, your digital expertise could help transform local politics.\nTime Commitment:\nFlexible hours to suit your availability, with some evening and weekend work for events coverage. This is an unpaid, volunteer position offering valuable experience in political communications and local journalism while contributing to positive change in our community.\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_privacy-policy/content_4.html": "PRIVACY POLICY / TRANSPARENCY INFORMATION\nV2.4 - January 2022\nReform Party UK process and control Personal Data and therefore are required by Articles 13 and 14 of the General Data Protection Regulation (GDPR) to publish this information using clear and plain language.\nContact Details\nReform Party UK may be contacted:\nWebsite: https://www.reformparty.uk/contact\nPostal Address: 124 City Road, London EC1V 2NX, United Kingdom\nTelephone: 0800 414 8525\nTransparent Information\nThe reasons, purposes and retention periods for which we process personal data, including any specified lawful basis or legitimate interest are detailed in separate tables for ease. These are split into data we may obtain from you directly and indirectly.\nProfiling\nReform Party UK aims to create and maintain a profile for each registered voter in the UK. We will do this by merging the Electoral Register(s) with other data that may be lawfully available to us. For more detailed information about this type of processing, you may wish to read the ICO Draft framework code of practice for the use of personal data in political campaigning. If you wish, you can ask us not to maintain a profile in your name using the contact details above and we will take steps to remove you from our systems.\nReform UK will respect the wishes of the people and aim to fully comply with the Information Commissioner's Office (ICO), in particular the specified requirements for Political Parties set out by the ICO in the report, titled Democracy Disrupted, dated 11 July 18.\nYour Rights\nUnder data protection law, you have the following rights:\nAccess: Right to ask for copies of your personal information\nRectification: Right to ask us to rectify inaccurate information and complete incomplete information\nErasure: Right to ask us to erase your personal information in certain circumstances\nRestriction: Right to ask us to restrict processing in certain circumstances\nObject: Right to object to the processing of your personal data in certain circumstances\nData Portability: Right to ask that we transfer information to another organisation or to you\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us at https://www.reformparty.uk/contact or Postal Address: 83 Victoria Street, London, SW1H 0HW if you wish to make a request.\nData Processing and Storage\nWe use service providers to host and/or process your information on our behalf. We only use processors who provide guarantees of appropriate technical and organisational measures that meet the requirements of the GDPR. Each service agreement is clear that we remain the data controller and they will only process the data in accordance with our written instructions.\nData Sharing\nWe will never sell your information or share it with another organisation.\nYour Right to Complain\nIf you are unhappy with how we use your data, you can let us know directly or complain to the Information Commissioner's Office (ICO). The ICO's contact details are:\nInformation Commissioner's Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org/content_2.html": "Bringing Common Sense to Politics\nStanding up for Bicester & Woodstock with common sense solutions that work for our towns and villages.\nDonate to your local Reform Constituency office\nVOTE REFORM UK ON MAY 1st\nRestoring Common sense.\nBuilding a community we can be proud of.\nFind out where to vote on May 1st and about your candidates in your area:\nReform UK: Bicester & Woodstock Constituency\nYour Local Voice, Your Community's Future\nLearn about the Reform UK - Bicester & Woodstock Team here\nJoin Reform UK\nBICESTER\nEYNSHAM\nWOODSTOCK\nKIDLINGTON\nHANBOROUGH\nWE NEED YOUR HELP: PLEASE DONATE TO YOUR LOCAL REFORM GROUP\nWe need to raise £4,000 to fund the local election campaign - you can donate DIRECTLY to us here\nOur Mission\nOur mission across the Bicester & Woodstock constituency is to transform how government serves our communities. We represent a constituency made up of distinct market towns, traditional villages, and rural areas, each with their own character and challenges.\nWe believe our constituency's prosperity depends on efficient public services and effective governance that works for all residents - from our bustling towns to our smallest villages. The current system isn't serving our communities effectively, whether you're in Bicester, Woodstock, Kidlington, or any of our rural parishes.\nWe're committed to addressing the real challenges facing people throughout our constituency - from the cost of living crisis affecting local families, to planning decisions that impact our communities' character, to ensuring every part of our constituency has a strong voice in decisions that affect them\nBy reimagining how local services operate and pushing for more responsive governance, we aim to build stronger, more prosperous communities across every part of the Bicester & Woodstock constituency. Our focus is on delivering practical, common sense solutions that make a real difference to people's daily lives.\nIan Hodgson - Chairman Reform UK -\nBicester & Woodstock\nOUR PLEDGE TO YOU\nWe pledge to fight against wasteful spending on non-essential initiatives and ideological projects that don't serve our communities' real needs. In line with Reform UK's national commitment, we will work to save £5 in every £100 of public spending through efficiency and smart governance. This means focusing on essential services that matter to local people, not wasting money on bureaucracy and 'woke' initiatives that don't benefit our communities. We believe in delivering value for money and transparent governance that puts local people first.\nLearn more about what we stand for and our policies here\n\"Britain is broken but if Britain is broken then logically Britain needs reform. It's just the first big step and what I now believe if you're with me if you support me if you're prepared to help me well then it will become the first big step on what I believe can be a truly astonishing historic Journey that can do something to do our country good to honor those that have gone before us and to give our children and grandchildren a better future.\"\nNigel Farage\nOur Councillor Candidates\nLearn more about our counciller candidates here\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_intranet/content_8.html": "Guest area\nPlease enter the password to access the page\nEnter\nBack to\nHome",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_about/content_11.html": "Experienced Professionals Leading Change in Bicester & Woodstock\nStrategic thinking and proven business expertise, combined with deep local knowledge - delivering real change for our community\nOur Reform UK Bicester & Woodstock team brings together accomplished business leaders with deep local roots and proven track records of delivering results. Each member contributes distinctive professional expertise - from operational leadership and financial management to strategic planning and property services. Their combined experience in transforming organizations, managing complex projects, and understanding local community needs makes them uniquely qualified to represent Reform UK's vision for positive change. This team's practical business approach, coupled with their commitment to our local area, ensures that Bicester & Woodstock's interests are represented by capable hands who understand both the challenges and opportunities facing our community.\nIan Hodgson - Chairman\nIan Hodgson is Reform UK's local branch Chairman, bringing 20+ years of leadership experience to drive effective grassroots campaigning and community engagement. His background in strategic management strengthens the branch's ability to promote Reform UK's message across our region.\nJames Nash - Deputy Chair\nJames strengthens Reform UK Bicester & Woodstock through innovation and systems expertise. From leading digital campaigns to developing cutting-edge constituency management tools, he's optimising local operations and driving efficiency.\nAdrian Reeve - Treasurer\nAdrian Reeve is Treasurer of Reform UK's local branch. As Director of Blueray Capital with extensive financial expertise and experience in business funding solutions, he ensures sound financial management of the branch's activities.\nBicester & Woodstock\nConstituency Map\nClick on the map to see the various wards withing the Bicester & Woodstock Constituency\nReform UK has truly revitalized my faith in politics. Their common-sense approach resonates deeply, making political discussions more accessible and engaging for everyone.\nPartners & Friends\nADAPTIVE INTELLIGENCE\nAdaptive Intelligence is AI consultancy specialising in transforming organisations through cutting-edge artificial intelligence solutions. Their core offering includes AI-driven business process automation, machine learning implementations, and their flagship product ATLAS - an AI-powered knowledge platform that revolutionises how organisations handle and extract value from their data. Led by AI experts, including PhD specialists in machine learning and deep learning, the company leverages partnerships with major AI platforms like OpenAI and DeepMind to deliver custom AI solutions.\nBLUERAY CAPITAL\nBlueray Capital is a London-based, FCA-regulated commercial finance specialist partnering with over 200 banks and lenders to provide comprehensive funding solutions. Their services are structured around three core areas: property finance (bridging, development, and BTL mortgages), business funding (growth finance, trade finance, and invoice finance), and acquisition finance (supporting company acquisitions and management buy-outs). Their expertise lies in securing competitive rates by accessing lenders not directly available to borrowers, particularly benefiting property developers, established UK businesses seeking growth capital, and companies planning acquisitions or management buy-outs.\nReform UK - National Leadership\nDriving Reform UK's Mission for Change\nNigel Farage MP\nParty Leader Reform UK\nRichard Tice MP\nDeputy Leader Reform UK\nLee Anderson MP\nChief Whip Reform UK\nZia Yusuf\nChairman Reform UK\nJames McMurdock MP\nMP South Basildon & East Thurrock\nRupert Lowe MP\nMP Great Yarmouth\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales",
  "https_www_reformukbaw_org_where-to-vote-for-your-candidate#bicnorth/https_www_reformukbaw_org_contact/content_6.html": "Contact Us\nReach out to us with any questions you have. We are interested in particular in:\nInfrastructure & Development\nCommunity Safety\nHousing & Planning\nHealthcare Services\nTransport Networks\nBusiness Growth\nEducation & Youth\nCouncil Tax & Spending\nPublic Services & Amenities\nYou can also email us directly here: chair.baw@reformuk.com\nLocal concerns & ideas? We want to know.\nContact Us\nGet in touch with Reform UK, Bicester & Woodstock Constituency to discuss how we can bring common sense back to British politics.\nLocation\nBicester, Woodstock, UK\nHours\n9 AM - 5 PM\nReform UK Bicester & Woodstock\nCommon sense solutions for British political issues.\nEngage\nConnect\nchair.baw@reformuk.com\n© 2024. All rights reserved.\nPromoted by Reform UK Party Limited - Copyright © 2024 Reform UK Party Limited\nCompany number 11694875 | Registered in England & Wales"
}