{
  "https_abtisammohamed_com_/https_abtisammohamed_com/content_1.html": "MP for Sheffield Central\nSheffield is my home, and throughout my life it’s given me a lot.\nEducation, community, and politics have changed my life, and allowed me to work with others to change our city. I’ve had to work hard, and I believe no one should be held back by a lack of opportunities.\nI’m a community leader, a senior councillor and a lawyer. All my life I’ve worked with people to achieve change for our communities. Now I want to take our fight to Westminster. I’m ready to serve as your Labour MP.\nI know from all of my experience that change only happens when we stand together. As your MP, I will work to bring people together, every single day. That’s how we will deliver real change for our communities, our city and our country.\nMy Story\nMy Story\nA Labour Government gave me opportunity\nI’m the daughter of a Yemeni steelworker. Growing up here during the 1980s and 90s I experienced the pain and poverty caused by the Tories.\nI left school with 4 GCSEs, but through hard work and access to education made possible by a Labour Government.\nI qualified as a teacher and then as a lawyer, while working full-time in community development.\nNow I'm giving back\nEverything I’ve ever done has been to give back. I’ve never sought the limelight. I’ve just focused on getting things done.\nToo often people are held back through no fault of their own - like the children I’ve worked with who have a lower life expectancy because of where they’re born, or the people without enough money for legal representation who I’ve supported for no charge.\nI have 20 years experience of working in, with and for communities. I’ve put in place services for all ages. I’ve set up a nursery and run community health and skills programmes.\nIn 2014 I founded my own law practice to provide legal advice and representation to vulnerable people in our city.\nI've got experience, and I'm ready to serve\nAs the senior councillor responsible for Education when Covid-19 hit, I ensured children were safe, and teachers could educate them from home. I made it my mission to reduce school exclusions. I fought education cuts standing alongside trade unions, community groups and families.\nI not only supported the Black Lives Matter movement, I set up a Race Equality Commission to tackle structural inequalities in our city.\nAs a lawyer, community leader and senior councillor I know how to bring about change. Now I’m ready to take our fight to the top.\nMy Priorities\nMy Priorities\nGet in touch\nGet in touch\nPromoted by Mark Rusling on behalf of Abtisam Mohamed, all at T&LC, Talbot Street, Sheffield, S2 2TG\nPromoted and published by Abtisam Mohamed | Privacy Policy | Website by Robin Wilde Design & Creative.",
  "https_abtisammohamed_com_/https_abtisammohamed_com_home/content_2.html": "MP for Sheffield Central\nSheffield is my home, and throughout my life it’s given me a lot.\nEducation, community, and politics have changed my life, and allowed me to work with others to change our city. I’ve had to work hard, and I believe no one should be held back by a lack of opportunities.\nI’m a community leader, a senior councillor and a lawyer. All my life I’ve worked with people to achieve change for our communities. Now I want to take our fight to Westminster. I’m ready to serve as your Labour MP.\nI know from all of my experience that change only happens when we stand together. As your MP, I will work to bring people together, every single day. That’s how we will deliver real change for our communities, our city and our country.\nMy Story\nMy Story\nA Labour Government gave me opportunity\nI’m the daughter of a Yemeni steelworker. Growing up here during the 1980s and 90s I experienced the pain and poverty caused by the Tories.\nI left school with 4 GCSEs, but through hard work and access to education made possible by a Labour Government.\nI qualified as a teacher and then as a lawyer, while working full-time in community development.\nNow I'm giving back\nEverything I’ve ever done has been to give back. I’ve never sought the limelight. I’ve just focused on getting things done.\nToo often people are held back through no fault of their own - like the children I’ve worked with who have a lower life expectancy because of where they’re born, or the people without enough money for legal representation who I’ve supported for no charge.\nI have 20 years experience of working in, with and for communities. I’ve put in place services for all ages. I’ve set up a nursery and run community health and skills programmes.\nIn 2014 I founded my own law practice to provide legal advice and representation to vulnerable people in our city.\nI've got experience, and I'm ready to serve\nAs the senior councillor responsible for Education when Covid-19 hit, I ensured children were safe, and teachers could educate them from home. I made it my mission to reduce school exclusions. I fought education cuts standing alongside trade unions, community groups and families.\nI not only supported the Black Lives Matter movement, I set up a Race Equality Commission to tackle structural inequalities in our city.\nAs a lawyer, community leader and senior councillor I know how to bring about change. Now I’m ready to take our fight to the top.\nMy Priorities\nMy Priorities\nGet in touch\nGet in touch\nPromoted by Mark Rusling on behalf of Abtisam Mohamed, all at T&LC, Talbot Street, Sheffield, S2 2TG\nPromoted and published by Abtisam Mohamed | Privacy Policy | Website by Robin Wilde Design & Creative.",
  "https_abtisammohamed_com_/http_abtisammohamed_com_privacy-policy/content_3.html": "Privacy Policy\nI am the MP for the Sheffield Central constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy responsible officer for data protection can be contacted at abtisam.mohamed.mp@parliament.uk.\nData collection and use\nThe office of Abtisam Mohamed MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer (abtisam.mohamed.mp@parliament.uk) or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nNewsletter\nI offer a newsletter service to keep constituents informed about my work and upcoming events. To subscribe to the newsletter, you can sign up through a form on this website or by clicking a link in one of my communications.\nWhen you sign up for the newsletter, I will collect your email address and any other information you voluntarily provide, such as your name. I will use this information to send you newsletters and updates about my work as an MP for Sheffield Central.\nBy subscribing to the newsletter, you explicitly consent to receive email communications from me. You can unsubscribe from the newsletter at any time by clicking the “unsubscribe” link included in the footer of each email.\nI use EmailOctopus as my email marketing platform. You can review their privacy policy here: https://emailoctopus.com/legal/privacy.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer (abtisam.mohamed.mp@parliament.uk) for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for Sheffield Central, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Sheffield Central, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nFor more information about cookies, please see this website.\nLabour members\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/ ) for details.\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\nYour rights\n• Obtain copies of the personal information I hold about you (known as a “subject access request”)\n• Request that I correct or update any personal information held about you\n• Ask that we erase or restrict the way in which I use your information\n• Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer at abtisam.mohamed.mp@parliament.uk.\nAlternatively you have right to raise any issues or concerns directly with the Information Commissioner’s Office.\nHow do we collect your data?\nMy campaign keeps its privacy policy under regular review and places any updates on this web page. This privacy policy was last updated on the 17 January 2025."
}