{
  "http_spotlandindependen_wixsite_com_sind/https_spotlandindependen_wixsite_com_sind_photos/content_3.html": "The public and press are excluded from hundreds of meetings each year; no record is kept of how individual councillors vote at committee meetings; there is an appalling lack of scrutiny on important issues; weak and feeble 'party -line' councillors, vote how they are expected to vote - they even vote how they are told to vote.\nIn short, it's a perfect environment for incompetent councillors to thrive.\nPolicies and Accountability\n1) Challenge any councillor or council employee, that I believe is not acting in the best interests of the residents of my ward.\n2) Ensure my ward obtains and retains its fair share of major funding when it is available\n3) I will only vote in the best interests of my ward or town - regardless of how others may or may not vote\n4) All council committee meetings should be recorded and made available online\n5) The way every individual councillor votes at all committee meetings should be recorded and made available online\n6) Councillors should give-up the recent 34% and 51% allowance rises as well as reducing their allowances by an additional 10%\n7) The former site of TBA should not be built but should be made into a country park\n8) A local spending policy be introduced by Rochdale Council which specifically benefits the local economy (The Preston Model)\n9) Agency workers only as an urgent stop gap measure. People carrying out council work should be directly employed by the council.\n10) All council owned open spaces and parks to be registered with the Fields in Trust Charity to protect them for future generations\n11) Support efficient renovation of existing properties instead of large scale demolition and rebuilding\n12) The actual costs of individual road repairs to be made public - in the same way as amounts to be spent are made public\n13) Oppose the outsourcing of council jobs, responsibilities and accountability\n14) End the disgraceful abuse of excluding the press and public from committee meetings",
  "http_spotlandindependen_wixsite_com_sind/https_spotlandindependen_wixsite_com_sind_theft-from-a-polling-station/content_4.html": "Spotland Community Centre\nQ. When is theft of anti-fraud electoral documentation not a theft? Answer: When it's convenient.\nWell before 2016, Spotland Community Centre had long been considered a polling station with a problem. Complaints of people feeling intimated by large groups of party activists congregating outside, meant it was the only polling station in the ward that required a police presence.\nI was a candidate at the May 2016 local elections. In July of that year I became aware that anti-fraud documentation had disappeared from the above polling station. The documentation should have accompanied the unopened ballot box to the official count. The missing documentation (called the marked register) contained the names of over 1000 people, and would have indicated whether or not they had voted. Without it, there would be no way of knowing if someone's vote had been used. Additionally, there would be no way of knowing if someone had cast a vote that was not theirs to use. ie the vote of a person who had decided not to vote (no identity is required to vote - not even a voting card).\nThe Acting Returning Officer (Rochdale Chief Executive in this case) knew this crucial anti-fraud documentation was missing. He did not inform any of the candidates. The ballot box linked to this missing documentation was rammed full of ballot papers. The votes it contained were 80-90% in favour of the Labour. I and others witnessed this, blissfully unaware of the missing anti-fraud documentation.\nTo challenge a result, you must do so within 21 days of a result being declared. By not being informed, candidates were denied the opportunity to make any sort of representation to the Electoral Commission or even object to the tainted ballot box being opened.\nAs soon I became aware of what had happened, and after RMBC were unable to explain how the documentation had gone missing, I informed the police that there had been a theft. I also informed the Electoral Commission and the Government Cabinet Office. It was the first they had heard of what had happened.\nThe police later informed me that they would not be investigating the matter because Rochdale Council were treating the matter as lost property.\nLocal councillors and the then leader (R Farnell) were made aware of the issue but showed absolutely no interest in either the missing documents, or the acts and omissions of the Chief Executive in his position as Acting Returning Officer. For this role, he was paid an extra £5-6000*. His job? To ensure the elections were properly run and democracy served. This money is agreed locally and is not refundable from central government.\nOver a year later, the Chief Executive of RMBC falsely claimed to another former candidate, that RMBC had informed the police, Electoral Commission and Cabinet Office as soon as they became aware of the missing documentation. I know this statement to be untrue as I was the one who informed them all - about 3 months after the election\nThis is what you are up against. Another reason not to vote for national parties at local level.\n*This is an estimation as RMBC have refused to disclose exactly how much extra the Acting Returning Officer is paid, but from other sources the above figure would appear to be accurate.",
  "http_spotlandindependen_wixsite_com_sind/https_spotlandindependen_wixsite_com_sind_videos-of-council-meetings/content_8.html": "Unlike 'election time' candidates, I actually attend council meetings and make pertinent enquiries to try and make a difference to how our town is run. In fact, just what councillors should be doing, rather than simply being nodding dogs and pointing at pot holes once a year (increasing to 2 or 3 a month when re-election time is approaches).\nHere are just a few examples of meetings that I have attended/taken part in and recorded. Our camera-shy councillors would prefer not to have their words, actions and votes officially recorded for future reference (that way, it makes misleading the public and avoiding accountability, that much easier).\nThe Night of the Living Dead?\nWhat happens when a successful construction comapny obtains planning permission, by agreeing to pay over £200,000 towards local amenities and road junction modifications?\nIt's simple. Two thirds the way through the development, claim it is not profitable and also that traffic at a busy junction has reduced over the last ten years. Bingo! No need to pay the £200,000. It really is that simple\nGimmee, Gimee, Gimmee\nDiscussions to increase their basic allowances had been underway for some months. Councillors were involved in the process. However, the public were only informed one week before this meeting.\nA classic case of councillor self-interest by keeping people in the dark until it is too late. Oh, yes and always do it when there is not an election the following year.\nMore tea Vicar?\nEver wondered how council owned assets get permission to be sold off?\nThe Council utilised its usual tactic of citing repair costs - councillors, as expected, responded by not asking for any details of the alleged costs involved.\nI later requested that the claims were substantiated. Surprise, surprise, they couldn't be.\nNo, it's not Uriah Heep\nIn what some might describe as a performance of stomach-churning humbleness and sincerity, Cllr C Biant explains why councillors deserve £3000 a year more and why her beloved leader, Cllr R Farnell was worth £900 per week.\nUnfortunately, she failed to explain why the existing allowances were sufficient enough for her to become a councillor in the first place and subsequently stand for re-election.\nCouncillor (Un)Accountability\nAn award winning website; reams and reams of paper; dodgy sound system; lots of clerical staff; a £50 million council building that wins awards no one has ever heard of before or since - but no facilities to record which way councillors vote.\nI requested that councillors support a change in the rules so that all individual votes are recorded. You can guess the response.\nToxic and full of rubbish\nOver the last ten years, councillors have trotted out the same lame excuses about the toxic TBA site. Even when it was illegally used as a land fill site, local councillors continued with the ploy of it being private land owned by a foreign company, so nothing could be done.\nThe truth is, that according to council publications, it is still earmarked as a potential housing development site.\nThe real problem is weak, party line local councillors.",
  "http_spotlandindependen_wixsite_com_sind/https_spotlandindependen_wixsite_com_sind/content_5.html": "In December 2016, all three Spotland and Falinge Labour councillors voted to award themselves an extra £3000 in allowances each year. They also voted for their leader to receive £900 a week. This was done with one week's notice given to the public. Councillors knew that a rise was on the cards for months. They also knew that there would not be a Local Election until May 2018 - well into the future when they hoped it would not be an election issue.\nThis wasn't simply a case of whether or not an increase was necessary - it showed absolute contempt for voters. It's this arrogance that shapes the way our council operates. Hundreds of committee meetings have been held in which the press and public have been excluded. This is a deliberate policy to ensure contentious decisions can be made with the minimum of opposition and scrutiny.\nEven stolen anti-fraud electoral documentation, isn't above the self-interest of councillors and senior council employees (see link above)\nIt's all part of the self-preservation culture of local tribal politics - so why not consider voting for an independent candidate who is free from all the nonsense of so-called party loyalty?\nRochdale Councillors hit the jackpot\nThe £200,000 Giveaway - 7th August 2017\nL' Cécile - because she's worth it\nGreedy, Spotland and Falinge LABOUR (in name only), councillors...\n...for the few - NOT the many\nOn the 3rd May vote for something better",
  "http_spotlandindependen_wixsite_com_sind/https_spotlandindependen_wixsite_com_sind_spotland-and-falinge/content_2.html": "Election leaflets from Spotland and Falinge Labour seem to say the same things over and over again. What's written often bears no resemblance to reality.\nHere are a few examples:\nLabour leaflet: A labour voice will be a strong voice on the council\nActual meaning: A Labour councillor will do as they are told by the Labour leadership\nLabour leaflet: (New candidate) Has been an active campaigner for Spotland and Falinge\nActual meaning: Has done bugger all, but now they have been selected as a candidate, they will act as though they have\nLabour leaflet: We have spent many £millions on pot holes (as though it was an act of supreme generosity)\nActual meaning: We have arranged to spend other people's money doing what we are supposed to do\nLabour leaflet: Complains about national issues such as the NHS, tax, utility bills etc\nActual meaning: As councillors we cannot do anything about these things but just like slagging-off other parties whenever we can\nLabour leaflet: We will get the toxic site of TBA sorted out\nActual meaning: We will do much navel gazing and trot out the same old excuses as to why we don't do anything\nLabour leaflet: Vote for me\nActual meaning: A direct plea to any zombie voters out there",
  "http_spotlandindependen_wixsite_com_sind/https_spotlandindependen_wixsite_com_sind_contact/content_7.html": "Home\nTheft from a polling station\nWhere I stand\nMe\nSpotland and Falinge\nWhat I've done\ncontact\nMore\nEmail: spotlandindependent@gmail.com\nSuccess! Message received.",
  "http_spotlandindependen_wixsite_com_sind/https_spotlandindependen_wixsite_com_sind_me/content_6.html": "Born and bred in Rochdale.\nI have stood as an independent candidate 5 times in Spotland and Falinge, finishing 2nd twice. This is despite being up against long established parties and their loyal supporters who, for whatever reason, feel obliged to vote for a political organisation rather than an individual person.\nI first moved to the Spotland in 1971 and attended Redbrook and Greenhill (now Falinge Park) Schools.\nHave lived on Spotland Road, Ings Lane and currently live on Rooley Moor Road.\nFor as far back as I can remember, I have always taken an interest in the well-being of my town. Like many others, I do what I can to try and improve and protect it. I consider myself to have had some success along the way - all things considered. As a councillor, I could do so much more.\nI don't belong to any political party and hope that if elected, it will encourage other independent minded candidates to come forward to make a difference.\nIt's what our town desperately needs.",
  "http_spotlandindependen_wixsite_com_sind/http_spotlandindependen_wixsite_com_sind/content_1.html": "In December 2016, all three Spotland and Falinge Labour councillors voted to award themselves an extra £3000 in allowances each year. They also voted for their leader to receive £900 a week. This was done with one week's notice given to the public. Councillors knew that a rise was on the cards for months. They also knew that there would not be a Local Election until May 2018 - well into the future when they hoped it would not be an election issue.\nThis wasn't simply a case of whether or not an increase was necessary - it showed absolute contempt for voters. It's this arrogance that shapes the way our council operates. Hundreds of committee meetings have been held in which the press and public have been excluded. This is a deliberate policy to ensure contentious decisions can be made with the minimum of opposition and scrutiny.\nEven stolen anti-fraud electoral documentation, isn't above the self-interest of councillors and senior council employees (see link above)\nIt's all part of the self-preservation culture of local tribal politics - so why not consider voting for an independent candidate who is free from all the nonsense of so-called party loyalty?\nRochdale Councillors hit the jackpot\nThe £200,000 Giveaway - 7th August 2017\nL' Cécile - because she's worth it\nGreedy, Spotland and Falinge LABOUR (in name only), councillors...\n...for the few - NOT the many\nOn the 3rd May vote for something better"
}