{
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_charity/content_12.html": "Four charities on the Wirral have received a £25,000 donation – split equally four ways – from entertainment company with a social purpose, Omaze, following its recent house draw in the area.\nOmaze was introduced to the four charities by Matthew Patrick MP, Member of Parliament for Wirral West.\nThe beneficiaries of the donation are Tomorrow’s Women, which supports and empowers women experiencing difficulties; Barnstondale – an inclusive outdoor activity centre supporting over 6,000 children each year from all backgrounds; Carrbridge Centre – a community centre on a large housing estate that aims to steer young people towards positive paths and Claire House – a hospice for terminally ill children, helping 500 families per year.\nOmaze recently ran a house draw on the Wirral – in which a five bedroom house worth £3 million – along with £250,000 in cash, was won by a 24-year-old nanny and raised £3.5 million for Scouts.\nTomorrow’s Women in Birkenhead provides targeted support across a range of areas including financial, mental health, domestic abuse, social isolation and substance abuse – and plans to use its £6,250 share to fund staff training for their stalking and harassment programme.\nBarnstondale provides inclusive outdoor experiences for schools, youth groups, and charities. With 25% of visitors having additional needs and 1 in 3 facing financial hardship, our bursary scheme helps those most in need. This £6,250 donation will directly support them, ensuring access to their centre.\nAs there is no youth centre in the area for young people aged over 13 years old, Carrbridge Centre on the Woodchurch, will use the Omaze funding to cover much needed support with its staff. The new funds will provide one “Omaze Youth Active session” per week – for an entire year.\nClaire House Children’s Hospice in Bebington can use the funds to provide a month of ‘Butterfly Care’ which is a place for a family to be with their child after they have passed.\nMatthew Patrick MP, Member of Parliament for Wirral West, said: “Across the Wirral, charities and volunteers contribute so much to our community, providing support and services to those who need it most.\n“It was great to meet with Omaze and introduce them to the four amazing organisations who they’re donating to.\n“The £25,000 donation will make a huge impact for people on the Wirral, keeping important services running and delivering new activities for young people on the Woodchurch.”\nSiobhan Waters, Fundraising and Communications Manager, Barnstondale Centre, said: “We are incredibly grateful to be one of the four charities benefiting from these much-needed funds. Omaze’s support has helped part-fund activity days and residential trips at Barnstondale, creating a life-changing impact – not just for the 55 children who directly benefited, but also for their families, teachers, and communities.\n“The confidence, resilience and teamwork skills they develop at Barnstondale will stay with them for life. Thanks to your generosity, we can continue our mission to ensure no child is left behind, giving more young people the chance to experience the joy of outdoor learning with their friends – creating memories that last a lifetime.”\nNatasha Walker, Omaze, said: “Everyone at Omaze is absolutely delighted we have been able to make a contribution to these four fantastic charities.\n“I was honoured to visit Barnstondale, to meet representatives from all four charities and hear about the incredible people who are providing such vital community services.\n“Omaze will continue to help more local causes in the areas where we host our house draws, wherever possible.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_03_20_foreign-sec-gaza-statement/content_17.html": "Matthew highlighted how imperative it is that the ceasefire in the Middle East holds.\nHe raised the plight of the 59 remaining hostages and their families who have lived through hell for more than 530 days, and the people of Gaza who desperately need aid and security.\nThe Foreign Secretary set out reassurances that Hamas should have no role to play in the future of Palestine’s governance, and that Britain is working hard to support the reform of the Palestinian Authority so the two-state solution can be realised.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_news/content_16.html": "Speaking in a debate in the House of Commons (6 January 2025), Matthew outlined the need for economic abuse to be a central part of the Government’s strategy to halve violence against women and girls (VAWG) in a decade.\nHe highlighted the work of Citizens Advice Wirral in supporting victim-survivors of domestic abuse on the Wirral, and the charity Surviving Economic Abuse for their pioneering support and research on economic abuse.\nThe Government has announced new housing targets in the National Planning Policy Framework (NPPF) in order to tackle the housing crisis in the UK. The announcement comes following Labour’s pledge to build 1.5 million new homes in the next five years. The Government confirmed that brownfield land must be the “first port of call” for development.\nThe housing crisis is impacting many people on the Wirral, with the numbers of people in temporary accommodation in the borough doubling since 2021 and homelessness rising. Temporary accommodation now costs Wirral Council a projected £1.6m a year, up from £406,418 in 2019.\nMatthew Patrick, MP for Wirral West, said that this is “unsustainable” and that “urgent action” was needed to ensure everyone has a safe and secure place to call home.\nIn the House of Commons, Matthew highlighted to the Housing Minister the thousands on waiting lists for housing on the Wirral, and welcomed the Government’s brownfield first approach. He also asked the Minister to confirm the support Wirral Council would get from the Government to ensure that housing was built in the right places.\nFollowing the Government’s statement in the Commons, Matthew said:\n“The housing crisis is impacting many people on the Wirral, with many forced to move away to get onto the property ladder. Urgent action is needed so children can grow up and stay in our area, and families can find affordable places to live.\n“People on the Wirral have been clear that brownfield first is their preference, alongside the desperately-needed regeneration of Wallasey and Birkenhead. I agree and I have taken action on this to deliver the change Wirral voted for at the election. I want to see regeneration and development in areas that need it, and to protect our green spaces.\n“I submitted representations to the NPPF consultation which addressed the need to unlock viable building on brownfield sites, so that we can protect the greenbelt which contributes so much to our lives and our environment here in Wirral West.\n“I also highlighted the risk of speculative planning applications. Developers should not be allowed to refuse to build on brownfield land and speculate on our beautiful countryside while our community is left with empty industrial buildings, shuttered shops, and poor-quality housing.\n“I will continue working with Wirral Council and with other MPs to ensure that affordable, decent homes are built in the right places and that the council has the right support to deliver for local people.”\nThank you to everyone who came to the discussion I hosted about assisted dying in Hoylake yesterday.\nIt’s an emotive subject, and people shared powerful, personal stories and perspectives. The discussion drew on the deep expertise of people in Wirral West, and, in our best traditions, was reasonable and thoughtful.\nIf you’re a constituent and would like to share your views with me, please email my office to share your perspective.\nMatthew Patrick MP has today (Wednesday 6 November) used a Prime Ministers Question to advocate for survivors of economic abuse.\nMatthew asked the Prime Minister and the Government to work with him to get the credit files of victim-survivors of economic abuse restored.\nCurrently, victim-survivors can suffer lasting consequences of economic abuse perpetrated by a current or former partner long after they’ve fled due to their credit rating being harmed by coerced debts.\nMatthew shared the story of Emily*, a survivor of domestic abuse who was left with a ruined credit file when her abusive ex-partner stopped contributing to their joint mortgage after she fled to safe accommodation for her safety.\nDespite informing her lender of the economic abuse she was experiencing, Emily* has seen lasting damage from the years spent trying to separate herself financially from her perpetrator, having faced issues trying to rent a property, finance a car and take out a mobile phone contract in her own name.\nSpeaking in the House of Commons,Matthew said: “Emily left her ex, but the abuse did not stop.\n“He stayed in their home, cancelled his mortgage contributions and destroyed her credit score.\n“Now, she cannot even take out a mobile phone contract.\n“Surviving Economic Abuse and UK Finance have made progress tackling this problem, but there is more to be done.\n“Would the Prime Minister and his Government work with me to bring in new provisions to restore the credit files of survivors of economic abuse like Emily?”\nResponding, Prime Minister Keir Starmer committed to ending the “national emergency” of economic and domestic abuse. He also assured that Matthew would meet with relevant Ministers to progress his work.\nHe said: “I thank my Honourable Friend for raising this important issue because economic abuse has a devastating impact on victims leaving them vulnerable and isolated.\n“We are committed to ending this national emergency and keeping women safe from domestic abuse, harassment and stalking.\n“That includes £200,000 this year to the charity Surviving Economic Abuse and HMRC have launched an online tool to help charities and business identify and respond to economic abuse.”\nNotes\nEmily* is a pseudonym to protect the survivor’s identity.\nFor more information about economic abuse, or support if you are experiencing or have experienced economic abuse, please visit Surviving Economic Abuse.\nI was pleased to be able to champion the incredible work of Claire House in Parliament last week, and the passion and pride every single member of their team displays.\nFunding must be there for all seriously ill children and their families to ensure they have the support they need, regardless of where they live.\nMatthew Patrick has today (16th October) spoken in Parliament about carers “pushed to breaking point” by the Carer’s Allowance overpayment scandal.\nThe MP for Wirral West shared the experiences of Wirral carers in the House of Commons, many of whom have faced anxiety over the potential financial impact of repayments and the pressures of balancing care work with day-to-day life.\nUnder the previous Conservative government, a large number of carers were made to pay back thousands of pounds over minor or inadvertent breaches of the Carer’s Allowance earnings threshold.\nSecretary of State for Work and Pensions Liz Kendall today announced an independent review into this situation, to be led by former Disability Rights UK chief executive Liz Sayce.\nThe review will investigate how overpayments of Carer’s Allowance have occurred, what can best be done to support those who have accrued them, and how to reduce the risk of these problems occurring in future.\nSpeaking in the House of Commons, Matthew paid tribute to carers in the community and the “selflessness and dedication” they embody.\nHe said: “At times of immense need, they step in. Day after day, supporting family members, making such an important contribution to their loved ones and our community.\n“Our country would simply not function without them, without their contribution.”\nHe also criticised the approach of the previous government, saying the crisis was “left to grow” and “totally ignored” while carers suffered.\nMatthew said the review announced would deliver long-overdue stability to carers who have faced anxiety over the scandal.\nClosing his speech, Matthew expressed hope that carers would “feel valued and listened to” and that “the issues they feel are important are brought to light”. He said: “I welcome today’s announcement and hope that with it, our brilliant carers know that this is a government that is on their side.”\nMatthew Patrick MP has today (Monday 7th October) paid tribute to the families of hostages for “the dignity, the courage and the love” they’ve shown.\nThe Member for Wirral West asked a question of the Prime Minister following his statement in the House of Commons marking the one-year anniversary of the 7th October attacks.\nMatthew spoke of the collective grief felt across the Jewish community on the anniversary of Hamas’ attacks, and paid tribute to the loved ones of Israeli hostages for their efforts to bring them home.\nHe said: “Today, as with so many times in the history of the Jewish people, we are bound in grief and in mourning. Would the Prime Minister assure the Jewish community that we are not alone in that grief?\n“And would he take this opportunity to join me in praising the dignity, the courage and the love shown by the families and friends of the hostages in their efforts to bring them home?”\nIn his response, Prime Minister Keir Starmer immediately made assurances to the Jewish community that they are not alone. He also paid tribute to the families and friends of hostages for sharing their stories.\nKeir Starmer said: “It is incredibly moving to spend any time with [the families of the hostages] and to hear firsthand what they are going through. As I’ve said to them every time I’ve met them, the impact it has I think on anyone listening – the impact it has on me – is profound.”\nWirral Council allocated over £3m as part of Household Support Fund extension.\nMillions of families to be supported with cost-of-living support this winter.\nLocal MP welcomes swift action to support those in need.\nThe Government has TODAY (27 September) announced more than £3 million in cost-of-living support for families on the Wirral.\nLabour’s Secretary of State for Work and Pensions, Liz Kendall, announced earlier this month that the Household Support Fund (HSF) would be extended for a further six months, until 31 March 2025. The scheme provides money to local authorities to deliver essential help to the most vulnerable people in society.\nWirral Council has been given an HSF Grant of £3,049,345.09 as part of a wider package of £421 million being provided to local authorities across England.\nMatthew Patrick, MP for Wirral West, has welcomed the Government’s investment in tackling poverty and ensuring those in the most need across the Wirral are supported. Hesaid: “I’m pleased to see the new Labour government acting swiftly to ensure support is available for those feeling the harsh impacts of the cost-of-living crisis.\n“We are already working hard to deliver change – to eradicate the root causes of poverty and prevent hardship – but I know many people in our community will be relieved to see short-term support continue.\n“If you or anyone you know is struggling this winter, please get in touch with my office or Wirral Council to explore the support available to you.”\nWirral Council previously delivered support to families and pensioners struggling with the cost of living through the HSF, helping with the cost of water and energy, as well as funding community projects, foodbanks, debt support and holiday activities for children.\nMatthew Patrick MP has questioned the Secretary of State for Wales on transport links between Wales and the Wirral.\nHe spoke in the House of Commons during Welsh oral questions on Wednesday 11 September to raise concerns that transport connections are “lagging behind” despite the strong links between Wales and Merseyside. Matthew asked for details on the conversations she’s having across government and with external organisations to deliver better connections for people on both sides of the border.\nSpeaking in the Commons, Matthew said: “Connections between my constituency of Wirral West and Wales are many, they’re deep and they’re valued on both sides of the border. Our transport connections, however, are sadly lagging behind.\n“Could she please set out what conversations she’s having with ministers and stakeholders to improve those connections?”\nIn her response, Secretary of State for Wales Jo Stevens MP shared that she has discussed improving connections between Wales and Merseyside with Transport Secretary Louise Haigh MP.\nStevens said: “I recognise the importance of cross-border travel for people across the region. The UK and Welsh governments are committed to strengthening these connections, which are vital to unlocking economic growth and employment opportunities for people and businesses.”\nShe also recognised the need for enhancements on the Wrexham to Bidston line and committed to working across government to deliver them.\nThank you for the opportunity to deliver my maiden speech in this important debate, Madam Deputy Speaker. The matter of budget responsibility is important to my constituents in Wirral West, because they know the cost of getting it wrong—the cost to public finances, public services and public trust. I know they will support the measures we are introducing.\nMay I congratulate my hon. Friend the Member for Kettering (Rosie Wrighting), my many hon. Friends and hon. Members on making their maiden speeches today? They have been beautiful, telling stories of constituencies and personal journeys. I think there is a theme to many of them—a theme about civility in public life, about ambition for everybody, and about the number of hours of sunshine that each of the various constituencies receives. I will no doubt look that one up.\nI will focus my remarks today on the place and the people who have brought me here. In so doing, I hope to explain why I believe in the power of argument, disagreement and nuance. Hon. Members will know that my constituency is in the Wirral peninsula. What the House might not have realised is that we are quite particular about how you refer to the Wirral—it is never “Wirral” but “the Wirral”, and you are rarely “in it” but, rather, “on it”.\nThe rich history of Wirral West—one of Vikings, James Bond and a Prime Minister—would not be out of place in a Hollywood blockbuster. The Vikings came to the Wirral in 900 AD, and they brought with them their own Parliament, which they called “Things”. That is how one of the most beautiful villages we enjoy, Thingwall, was named. Hon. Members will probably be grateful that I am going to skip forward a few centuries of history to bring us closer to the present day. Daniel Craig—the most recent James Bond and, in my view, the best 007—was brought up, played rugby and went to school in West Kirby and Hoylake, and former Prime Minister Harold Wilson, who did so much for lifelong learning with the Open University and introduced important social reforms, lived in Spital.\nOur past may be worthy of Hollywood, but our present and beautiful natural environment would not be out of place in a David Attenborough documentary. Its physical beauty has been captured by many of the finest photographers, but even they will tell you that there is no substitute for seeing it for yourself—from walking to Hilbre Island and watching as the seals swim through the River Dee, to admiring our golf courses, which are famous for hosting the Open.\nThose people lucky enough to call Wirral West their home are part of what makes it so special. They bring passion to everything they do, and they carry that passion with a warm welcome and great dignity. That passion runs through each of the towns and villages. It is passion for one another and for our area, helping to expand opportunities to everyone. I cannot imagine another place with as many community groups, churches and businesses that work so hard to do such good, including scouts and guides groups, the Royal National Lifeboat Institution, our schools and hospitals, and community hubs such as the Hoole Road hub—so many groups that support all people, whatever the difficulties they face. It is community spirit that has powered us through some difficult times, and I hope that this new Government can help to bring back some hope so that we can look forward to better days.\nWirral West, with its expanded boundaries, has been most recently served by two people: Margaret Greenwood and my hon. Friend the Member for Birkenhead the Member for Birkenhead (Alison McGovern).\nMargaret Greenwood is deeply passionate about our NHS and our environment, and those are two passions that I share. As an MP, Margaret knew that getting our NHS back on its feet is vital so that it can deliver world-leading care. We are fortunate in Wirral West to have two hospitals: Arrowe Park and Clatterbridge. I know the Secretary of State for Health and Social Care is particularly fond of the latter, given the support it gave to his family. I think back to the conversations I had in the election campaign, to the people waiting sometimes years for crucial operations and the stress that that waiting added to their daily lives. I will be thinking of those people as we do the work to turn the NHS around.\nAs Margaret often reminded us, there is no escaping the threat that is climate change. It came up often on the doorstep. People on the Wirral, from teachers to scientists and from environmentalists to parents are worried, like so many, about the threat of climate change. They know that it does not respond to strong rhetoric, borders or weapons. It is only action, joined up with our partners around the world, that will help us to tackle climate change and save the environment. When I see the wind farms off our Wirral shores, I am proud that we can be a home of green energy and green jobs, delivering the bold action that is desperately needed.\nMy other predecessor, who now serves Birkenhead, had a deep impact on my own journey—ambitious for me personally and many people like me, from working-class communities; ambitious for all of us, encouraging us, believing that we too can stand tall in places, even ones as grand as this. I grew up in Birkenhead. It is a wonderful place, but it is not without its struggles. Standing here now is a testament to my hon. Friend and to her encouragement and ambition for people like me. She will know that, as proud as we rightly are, some people from ordinary backgrounds can fulfil their ambitions, but it is still only some people, and there is much more that we must do. I will not rest until some people having opportunity becomes everybody having opportunity. The enormity of that task is matched only by its importance. It would be daunting, but for the fact that I know I am not alone in that mission. I am proud to stand alongside my hon. Friend the Member for Birkenhead and all of my hon. Friends in this great task.\nThe Wirral has had many politicians who have made an important contribution to public life. They include my hon. Friend the Member for Wallasey (Dame Angela Eagle) and her championing of women and the LGBT community, and Baron Hunt of Wirral, although Members will realise that I think it should be Baron Hunt of the Wirral, but I will come back to that. He comes from a different tradition from me but he has served people in this country with bravery and distinction. And of course, there was Frank Field, who we sadly lost earlier this year.\nFrank was a dear friend of mine, and I miss him terribly. He was the first MP I met. He was interested in what everyone had to say, and as hon. Members across the House may know from personal experience, he was quite interested in disagreement, too. He was fascinated when what you had to say differed from his own views, and it was Frank who taught me that disagreement did not need to be tolerated in politics but rather to be sought out and embraced. He taught me that, if you believe in something, you should feel free to say it, and that as long as you do so with reason, respect and humility, you should enjoy the consideration of others. Because we cannot reward the absolutists. Those who know everything with total certainty are, I think, the people we should most fear.\nI am conscious, standing here, of the responsibility placed on me to represent the interests and people of Wirral West, and I will do that fiercely. I am deeply aware that representation is as much about listening as it is about speaking. The most interesting and informative conversations that I had on the election campaign were with people who disagreed with me. I learned much from them. In this House, while I bring from my career expertise in local government and economic policy, which I hope will benefit others, I intend to tap into the accumulated knowledge of hon. Members from all sides of the House. There has not been enough listening in our politics of late, and I believe that, if we are to restore faith in this House, which I believe we must, listening to our constituents and to one another is a vital step.\nFrank and I spoke often about a whole range of issues and, even towards the end of his extraordinary life, he maintained a fascination with politics, with what it could do for people and with the disagreements that lay at its heart. A small part of his enormous legacy will be these three commitments that I make to this House. My commitment is to listen in good faith to arguments made in good faith. My commitment is to change my mind when it is right to do so. And my commitment is to stand up for the things that I believe in, so that others might do the same. That is what Frank would have expected, it is what the people of Wirral West rightly expect and it is what this House and our politics deserve.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_transport/content_40.html": "Matthew Patrick MP has questioned the Secretary of State for Wales on transport links between Wales and the Wirral.\nHe spoke in the House of Commons during Welsh oral questions on Wednesday 11 September to raise concerns that transport connections are “lagging behind” despite the strong links between Wales and Merseyside. Matthew asked for details on the conversations she’s having across government and with external organisations to deliver better connections for people on both sides of the border.\nSpeaking in the Commons, Matthew said: “Connections between my constituency of Wirral West and Wales are many, they’re deep and they’re valued on both sides of the border. Our transport connections, however, are sadly lagging behind.\n“Could she please set out what conversations she’s having with ministers and stakeholders to improve those connections?”\nIn her response, Secretary of State for Wales Jo Stevens MP shared that she has discussed improving connections between Wales and Merseyside with Transport Secretary Louise Haigh MP.\nStevens said: “I recognise the importance of cross-border travel for people across the region. The UK and Welsh governments are committed to strengthening these connections, which are vital to unlocking economic growth and employment opportunities for people and businesses.”\nShe also recognised the need for enhancements on the Wrexham to Bidston line and committed to working across government to deliver them.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_westminster_page_2/content_44.html": "Matthew Patrick MP has today (Monday 7th October) paid tribute to the families of hostages for “the dignity, the courage and the love” they’ve shown.\nThe Member for Wirral West asked a question of the Prime Minister following his statement in the House of Commons marking the one-year anniversary of the 7th October attacks.\nMatthew spoke of the collective grief felt across the Jewish community on the anniversary of Hamas’ attacks, and paid tribute to the loved ones of Israeli hostages for their efforts to bring them home.\nHe said: “Today, as with so many times in the history of the Jewish people, we are bound in grief and in mourning. Would the Prime Minister assure the Jewish community that we are not alone in that grief?\n“And would he take this opportunity to join me in praising the dignity, the courage and the love shown by the families and friends of the hostages in their efforts to bring them home?”\nIn his response, Prime Minister Keir Starmer immediately made assurances to the Jewish community that they are not alone. He also paid tribute to the families and friends of hostages for sharing their stories.\nKeir Starmer said: “It is incredibly moving to spend any time with [the families of the hostages] and to hear firsthand what they are going through. As I’ve said to them every time I’ve met them, the impact it has I think on anyone listening – the impact it has on me – is profound.”\nMatthew Patrick MP has questioned the Secretary of State for Wales on transport links between Wales and the Wirral.\nHe spoke in the House of Commons during Welsh oral questions on Wednesday 11 September to raise concerns that transport connections are “lagging behind” despite the strong links between Wales and Merseyside. Matthew asked for details on the conversations she’s having across government and with external organisations to deliver better connections for people on both sides of the border.\nSpeaking in the Commons, Matthew said: “Connections between my constituency of Wirral West and Wales are many, they’re deep and they’re valued on both sides of the border. Our transport connections, however, are sadly lagging behind.\n“Could she please set out what conversations she’s having with ministers and stakeholders to improve those connections?”\nIn her response, Secretary of State for Wales Jo Stevens MP shared that she has discussed improving connections between Wales and Merseyside with Transport Secretary Louise Haigh MP.\nStevens said: “I recognise the importance of cross-border travel for people across the region. The UK and Welsh governments are committed to strengthening these connections, which are vital to unlocking economic growth and employment opportunities for people and businesses.”\nShe also recognised the need for enhancements on the Wrexham to Bidston line and committed to working across government to deliver them.\nThank you for the opportunity to deliver my maiden speech in this important debate, Madam Deputy Speaker. The matter of budget responsibility is important to my constituents in Wirral West, because they know the cost of getting it wrong—the cost to public finances, public services and public trust. I know they will support the measures we are introducing.\nMay I congratulate my hon. Friend the Member for Kettering (Rosie Wrighting), my many hon. Friends and hon. Members on making their maiden speeches today? They have been beautiful, telling stories of constituencies and personal journeys. I think there is a theme to many of them—a theme about civility in public life, about ambition for everybody, and about the number of hours of sunshine that each of the various constituencies receives. I will no doubt look that one up.\nI will focus my remarks today on the place and the people who have brought me here. In so doing, I hope to explain why I believe in the power of argument, disagreement and nuance. Hon. Members will know that my constituency is in the Wirral peninsula. What the House might not have realised is that we are quite particular about how you refer to the Wirral—it is never “Wirral” but “the Wirral”, and you are rarely “in it” but, rather, “on it”.\nThe rich history of Wirral West—one of Vikings, James Bond and a Prime Minister—would not be out of place in a Hollywood blockbuster. The Vikings came to the Wirral in 900 AD, and they brought with them their own Parliament, which they called “Things”. That is how one of the most beautiful villages we enjoy, Thingwall, was named. Hon. Members will probably be grateful that I am going to skip forward a few centuries of history to bring us closer to the present day. Daniel Craig—the most recent James Bond and, in my view, the best 007—was brought up, played rugby and went to school in West Kirby and Hoylake, and former Prime Minister Harold Wilson, who did so much for lifelong learning with the Open University and introduced important social reforms, lived in Spital.\nOur past may be worthy of Hollywood, but our present and beautiful natural environment would not be out of place in a David Attenborough documentary. Its physical beauty has been captured by many of the finest photographers, but even they will tell you that there is no substitute for seeing it for yourself—from walking to Hilbre Island and watching as the seals swim through the River Dee, to admiring our golf courses, which are famous for hosting the Open.\nThose people lucky enough to call Wirral West their home are part of what makes it so special. They bring passion to everything they do, and they carry that passion with a warm welcome and great dignity. That passion runs through each of the towns and villages. It is passion for one another and for our area, helping to expand opportunities to everyone. I cannot imagine another place with as many community groups, churches and businesses that work so hard to do such good, including scouts and guides groups, the Royal National Lifeboat Institution, our schools and hospitals, and community hubs such as the Hoole Road hub—so many groups that support all people, whatever the difficulties they face. It is community spirit that has powered us through some difficult times, and I hope that this new Government can help to bring back some hope so that we can look forward to better days.\nWirral West, with its expanded boundaries, has been most recently served by two people: Margaret Greenwood and my hon. Friend the Member for Birkenhead the Member for Birkenhead (Alison McGovern).\nMargaret Greenwood is deeply passionate about our NHS and our environment, and those are two passions that I share. As an MP, Margaret knew that getting our NHS back on its feet is vital so that it can deliver world-leading care. We are fortunate in Wirral West to have two hospitals: Arrowe Park and Clatterbridge. I know the Secretary of State for Health and Social Care is particularly fond of the latter, given the support it gave to his family. I think back to the conversations I had in the election campaign, to the people waiting sometimes years for crucial operations and the stress that that waiting added to their daily lives. I will be thinking of those people as we do the work to turn the NHS around.\nAs Margaret often reminded us, there is no escaping the threat that is climate change. It came up often on the doorstep. People on the Wirral, from teachers to scientists and from environmentalists to parents are worried, like so many, about the threat of climate change. They know that it does not respond to strong rhetoric, borders or weapons. It is only action, joined up with our partners around the world, that will help us to tackle climate change and save the environment. When I see the wind farms off our Wirral shores, I am proud that we can be a home of green energy and green jobs, delivering the bold action that is desperately needed.\nMy other predecessor, who now serves Birkenhead, had a deep impact on my own journey—ambitious for me personally and many people like me, from working-class communities; ambitious for all of us, encouraging us, believing that we too can stand tall in places, even ones as grand as this. I grew up in Birkenhead. It is a wonderful place, but it is not without its struggles. Standing here now is a testament to my hon. Friend and to her encouragement and ambition for people like me. She will know that, as proud as we rightly are, some people from ordinary backgrounds can fulfil their ambitions, but it is still only some people, and there is much more that we must do. I will not rest until some people having opportunity becomes everybody having opportunity. The enormity of that task is matched only by its importance. It would be daunting, but for the fact that I know I am not alone in that mission. I am proud to stand alongside my hon. Friend the Member for Birkenhead and all of my hon. Friends in this great task.\nThe Wirral has had many politicians who have made an important contribution to public life. They include my hon. Friend the Member for Wallasey (Dame Angela Eagle) and her championing of women and the LGBT community, and Baron Hunt of Wirral, although Members will realise that I think it should be Baron Hunt of the Wirral, but I will come back to that. He comes from a different tradition from me but he has served people in this country with bravery and distinction. And of course, there was Frank Field, who we sadly lost earlier this year.\nFrank was a dear friend of mine, and I miss him terribly. He was the first MP I met. He was interested in what everyone had to say, and as hon. Members across the House may know from personal experience, he was quite interested in disagreement, too. He was fascinated when what you had to say differed from his own views, and it was Frank who taught me that disagreement did not need to be tolerated in politics but rather to be sought out and embraced. He taught me that, if you believe in something, you should feel free to say it, and that as long as you do so with reason, respect and humility, you should enjoy the consideration of others. Because we cannot reward the absolutists. Those who know everything with total certainty are, I think, the people we should most fear.\nI am conscious, standing here, of the responsibility placed on me to represent the interests and people of Wirral West, and I will do that fiercely. I am deeply aware that representation is as much about listening as it is about speaking. The most interesting and informative conversations that I had on the election campaign were with people who disagreed with me. I learned much from them. In this House, while I bring from my career expertise in local government and economic policy, which I hope will benefit others, I intend to tap into the accumulated knowledge of hon. Members from all sides of the House. There has not been enough listening in our politics of late, and I believe that, if we are to restore faith in this House, which I believe we must, listening to our constituents and to one another is a vital step.\nFrank and I spoke often about a whole range of issues and, even towards the end of his extraordinary life, he maintained a fascination with politics, with what it could do for people and with the disagreements that lay at its heart. A small part of his enormous legacy will be these three commitments that I make to this House. My commitment is to listen in good faith to arguments made in good faith. My commitment is to change my mind when it is right to do so. And my commitment is to stand up for the things that I believe in, so that others might do the same. That is what Frank would have expected, it is what the people of Wirral West rightly expect and it is what this House and our politics deserve.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_about/content_2.html": "My name is Matthew, and I am the Labour MP for Wirral West. The Wirral is my home, and where I grew up. I love it here, the people, the culture, and its beautiful beaches and parks.\nI went to school and college on the Wirral; my mum is a Librarian at a local primary school and my dad is a teaching assistant at a college here. But growing up in Birkenhead, I saw the impact of Tory governments, as my school was failed by historic low investment and low expectations. After school clubs were cut and classrooms were crumbling; no-one should lose out on a good education because of where they live.\nThanks to the last Labour Government, I was the first in my family to go to university, and I went to Liverpool John Moores. During my studies, I worked full time at a mortgage brokerage to fund myself through it. I became motivated by learning and improvement and threw myself into study and work.\nIn 2010 I joined the Labour Party, and I’ve been campaigning and fighting for change ever since. I founded a local young labour group, became a councillor for Upton, Woodchurch and Overchurch in 2013, and in 2016, a Cabinet Member on Wirral Council in 2016.\nOn Wirral’s Cabinet, I was proud to introduce policies that empowered communities. We put money into the hands of local people to be spent on what mattered to them. That work helped our community groups – already doing so much – to keep going. It gave kids something to do of an evening and it helped businesses to start and scale.\nMotivated by public service and wanting to deliver change, I volunteered with local charities to get food from supermarkets that was going to go to waste to those in need – as well as youth charities which aim to provide young people with opportunities and experiences which help divert them from anti-social behaviour and raise their ambition.\nIn 2015, I led the campaign in Wirral West for Labour which beat Esther McVey. We won by focussing on what matters to people on the Wirral, including fighting Tory plans which would damage our green environment and our beaches. I understand what matters to people here on the Wirral and I will fight for you.\nSince leaving the Council in 2018, I have worked in regulation across financial services and energy, to hold banks and energy companies to account and prioritise what matters to consumers and make sure they are working for us all. Now, I work in payments, tackling fraud and scams which do so much damage across the country.\nI’ve run winning campaigns across the new Wirral West constituency. I have a track record of delivery in elected office here, and I’m ready to hit the ground running in parliament.\nI know why winning matters. I know that politics changes people’s lives because it changed mine. A Labour Government gave me and my family opportunities we would never have – because it was ambitious for people like us.\nThe Wirral is a wonderful place to live. But after 14 years of austerity, it often feels like nothing works anymore – and we need our public services to be fit for the future so that they are there when we need them.\nWe can have a government ambitious for the Wirral again. A government that believes in places like ours, that is ambitious for us to have the best schools and hospitals, which protects our environment, and wants to harness the talents of the people here who have so much to offer.\nI believe that, together, we can change our community and our country.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_blog/content_4.html": "Four charities on the Wirral have received a £25,000 donation – split equally four ways – from entertainment company with a social purpose, Omaze, following its recent house draw in the area.\nOmaze was introduced to the four charities by Matthew Patrick MP, Member of Parliament for Wirral West.\nThe beneficiaries of the donation are Tomorrow’s Women, which supports and empowers women experiencing difficulties; Barnstondale – an inclusive outdoor activity centre supporting over 6,000 children each year from all backgrounds; Carrbridge Centre – a community centre on a large housing estate that aims to steer young people towards positive paths and Claire House – a hospice for terminally ill children, helping 500 families per year.\nOmaze recently ran a house draw on the Wirral – in which a five bedroom house worth £3 million – along with £250,000 in cash, was won by a 24-year-old nanny and raised £3.5 million for Scouts.\nTomorrow’s Women in Birkenhead provides targeted support across a range of areas including financial, mental health, domestic abuse, social isolation and substance abuse – and plans to use its £6,250 share to fund staff training for their stalking and harassment programme.\nBarnstondale provides inclusive outdoor experiences for schools, youth groups, and charities. With 25% of visitors having additional needs and 1 in 3 facing financial hardship, our bursary scheme helps those most in need. This £6,250 donation will directly support them, ensuring access to their centre.\nAs there is no youth centre in the area for young people aged over 13 years old, Carrbridge Centre on the Woodchurch, will use the Omaze funding to cover much needed support with its staff. The new funds will provide one “Omaze Youth Active session” per week – for an entire year.\nClaire House Children’s Hospice in Bebington can use the funds to provide a month of ‘Butterfly Care’ which is a place for a family to be with their child after they have passed.\nMatthew Patrick MP, Member of Parliament for Wirral West, said: “Across the Wirral, charities and volunteers contribute so much to our community, providing support and services to those who need it most.\n“It was great to meet with Omaze and introduce them to the four amazing organisations who they’re donating to.\n“The £25,000 donation will make a huge impact for people on the Wirral, keeping important services running and delivering new activities for young people on the Woodchurch.”\nSiobhan Waters, Fundraising and Communications Manager, Barnstondale Centre, said: “We are incredibly grateful to be one of the four charities benefiting from these much-needed funds. Omaze’s support has helped part-fund activity days and residential trips at Barnstondale, creating a life-changing impact – not just for the 55 children who directly benefited, but also for their families, teachers, and communities.\n“The confidence, resilience and teamwork skills they develop at Barnstondale will stay with them for life. Thanks to your generosity, we can continue our mission to ensure no child is left behind, giving more young people the chance to experience the joy of outdoor learning with their friends – creating memories that last a lifetime.”\nNatasha Walker, Omaze, said: “Everyone at Omaze is absolutely delighted we have been able to make a contribution to these four fantastic charities.\n“I was honoured to visit Barnstondale, to meet representatives from all four charities and hear about the incredible people who are providing such vital community services.\n“Omaze will continue to help more local causes in the areas where we host our house draws, wherever possible.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_blog_page_2/content_6.html": "Matthew Patrick, MP for Wirral West, has welcomed the Labour Government’s Plan for Change, set out in a landmark speech by the Prime Minister yesterday (5 December).\nThe Plan for Change consists of six clear milestones – covering the economy, the NHS, clean power, education, crime and housing – to deliver measurable change by the end of this parliament. The plan is underpinned by foundations of sound public finances and secure borders.\nThe plan sets out a blueprint for rebuilding Britain after 14 years of managed decline under the Tories and will focus on issues which impact the everyday lives of people on the Wirral.\nFor example, the Plan for Change will see NHS waiting lists – which have skyrocketed to 369,065 across Cheshire and Merseyside – tackled through 40,000 additional NHS operations and investment in state-of-the-art hospital equipment. Labour has set the target of 92% of NHS patients to receive treatment within 18 weeks. After 14 years of Tory government, this figure currently stands at just 59%.\nKnife crime and robbery are rife across the country, but the neighbourhood police who could prevent crimes like this and support victims disappeared under the Tories, with the number of Police Community Support Officers cut by 276 in Merseyside. Labour’s plans will see 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community.\nIt will also focus on improving life chances for all children by raising the number of children starting school ready to learn. As it stands, the number of children meeting key early years development targets sits at around 64% in the North West, a figure Labour wants to see hit 75% by the end of the parliament.\nWork on the Plan for Change is well underway, with this Labour government already delivering a number of landmark changes. These include:\nA pay boost for 3 million workers through an increase in the National Minimum Wage and National Living Wage, benefitting 7700 on the Wirral.\nFunding for 40,000 additional NHS operations, as well as investment in state-of-the-art scanners and diagnostic equipment to get more patients seen on time.\nBringing our total investment in housing supply to over £5bn, and delivering funding to transform neglected land into new homes.\nPutting police back on the beat with 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community through our Neighbourhood Policing Guarantee in England and Wales.\nLaunching Great British Energy to provide clean, secure and homegrown power.\nKickstarted the first stage of roll out of free Breakfast Clubs for primary school children, and delivered funding for up to 300 school-based nurseries.\nCommenting on the Plan for Change, Matthew Patrick MP said:\n“After 14 years of chaos and broken promises under the Tories, Labour was elected to deliver change.\n“In the conversations I have with people across Wirral West, time and again people raise the need to fix our NHS, get police back out on the beat, and invest in the futures of our children and young people.”\n“The Prime Minister’s announcement of these ambitious but achievable milestones shows this is a government serious about making a difference in people’s lives.”\nThank you to everyone who came to the discussion I hosted about assisted dying in Hoylake yesterday.\nIt’s an emotive subject, and people shared powerful, personal stories and perspectives. The discussion drew on the deep expertise of people in Wirral West, and, in our best traditions, was reasonable and thoughtful.\nIf you’re a constituent and would like to share your views with me, please email my office to share your perspective.\nMatthew Patrick MP has today (Wednesday 6 November) used a Prime Ministers Question to advocate for survivors of economic abuse.\nMatthew asked the Prime Minister and the Government to work with him to get the credit files of victim-survivors of economic abuse restored.\nCurrently, victim-survivors can suffer lasting consequences of economic abuse perpetrated by a current or former partner long after they’ve fled due to their credit rating being harmed by coerced debts.\nMatthew shared the story of Emily*, a survivor of domestic abuse who was left with a ruined credit file when her abusive ex-partner stopped contributing to their joint mortgage after she fled to safe accommodation for her safety.\nDespite informing her lender of the economic abuse she was experiencing, Emily* has seen lasting damage from the years spent trying to separate herself financially from her perpetrator, having faced issues trying to rent a property, finance a car and take out a mobile phone contract in her own name.\nSpeaking in the House of Commons,Matthew said: “Emily left her ex, but the abuse did not stop.\n“He stayed in their home, cancelled his mortgage contributions and destroyed her credit score.\n“Now, she cannot even take out a mobile phone contract.\n“Surviving Economic Abuse and UK Finance have made progress tackling this problem, but there is more to be done.\n“Would the Prime Minister and his Government work with me to bring in new provisions to restore the credit files of survivors of economic abuse like Emily?”\nResponding, Prime Minister Keir Starmer committed to ending the “national emergency” of economic and domestic abuse. He also assured that Matthew would meet with relevant Ministers to progress his work.\nHe said: “I thank my Honourable Friend for raising this important issue because economic abuse has a devastating impact on victims leaving them vulnerable and isolated.\n“We are committed to ending this national emergency and keeping women safe from domestic abuse, harassment and stalking.\n“That includes £200,000 this year to the charity Surviving Economic Abuse and HMRC have launched an online tool to help charities and business identify and respond to economic abuse.”\nNotes\nEmily* is a pseudonym to protect the survivor’s identity.\nFor more information about economic abuse, or support if you are experiencing or have experienced economic abuse, please visit Surviving Economic Abuse.\nI was pleased to be able to champion the incredible work of Claire House in Parliament last week, and the passion and pride every single member of their team displays.\nFunding must be there for all seriously ill children and their families to ensure they have the support they need, regardless of where they live.\nMatthew Patrick MP has described yesterday’s (30 October) Budget as a “game changer” which will “bring back hope” and deliver “a Britain we can be proud of again”.\nThe Chancellor of the Exchequer, Rachel Reeves, delivered Labour’s first Budget for 14 years, announcing a range of measures which would “fix the foundations and deliver change”.\nThe Budget announced an extra c£25.6billion over two years for the NHS, to cut waiting times with 40,000 extra elective appointments a week, and build capacity for more than 30,000 additional procedures.\nWelcoming the announcement, Matthew said: “That is not just a good health policy; it is a policy that will make Britain stronger, happier and ready to take on the challenges coming our way.\n“I do not want to be faced with more stories of my constituents waiting years for important operations. I have heard enough of those heartbreaking stories to last me a lifetime—stress upon stress, costing jobs and crushing hope.”\nThe Chancellor also announced the tripling of funding for free breakfast clubs in primary schools to £30 million, alongside an increase to the Core Schools Budget by £2.3bn next year to support the recruitment of 6,500 teachers. The Budget also included an announcement of an additional £1 billion uplift for SEND and alternative provision funding.\nMatthew said this would deliver “real hope” and added: “I cannot wait until we open those breakfast clubs in Wirral West, to expand opportunities for parents and kids alike.”\nMatthew praised the new Government’s approach, saying the Chancellor has “opened up Britain’s future once again” through policies which will invest in public services, including the NHS and state schools.\nHe said: “Our investment will mean more opportunities, better pay, and public services that are there when people need them—a Britain we can be proud of again.\n“The Government are making long-term decisions so that we can look back on a decade of expanding opportunities and rising standards, not another decade of shameful decline, which the country, and working people, cannot afford.”\nThe Chancellor also announced an increase to the National Living Wage (NLW) of 6.7% to £12.21 per hour for full time workers on the NLW – worth up to £1,400 for a full-time worker. This will mean a pay increase for around 7,700 people living on the Wirral.\nFollowing the announcement of a review into the Carers Allowance overpayment scandal earlier in the month, the Chancellor also used the Budget to announce an increase to the Carer’s Allowance Weekly Earnings Limit from £151 to £196 per week. The Treasury estimates this will allow over 60,000 more carers to access Carer’s Allowance.\nFunding was also allocated to compensate victims of the Post Office Horizon scandal (c£2 billion) and the Infected Blood scandal (£11.8 billion), the costs of which had not been fully accounted for by the previous government.\nClosing his speech in the House, Matthew said: “This Budget protects working people, invests in our NHS and rebuilds the foundations for Britain’s future.\n“More of the same simply was not an option; hope was on the ballot in July, and this Budget brings back hope.”\nMatthew Patrick has today (16th October) spoken in Parliament about carers “pushed to breaking point” by the Carer’s Allowance overpayment scandal.\nThe MP for Wirral West shared the experiences of Wirral carers in the House of Commons, many of whom have faced anxiety over the potential financial impact of repayments and the pressures of balancing care work with day-to-day life.\nUnder the previous Conservative government, a large number of carers were made to pay back thousands of pounds over minor or inadvertent breaches of the Carer’s Allowance earnings threshold.\nSecretary of State for Work and Pensions Liz Kendall today announced an independent review into this situation, to be led by former Disability Rights UK chief executive Liz Sayce.\nThe review will investigate how overpayments of Carer’s Allowance have occurred, what can best be done to support those who have accrued them, and how to reduce the risk of these problems occurring in future.\nSpeaking in the House of Commons, Matthew paid tribute to carers in the community and the “selflessness and dedication” they embody.\nHe said: “At times of immense need, they step in. Day after day, supporting family members, making such an important contribution to their loved ones and our community.\n“Our country would simply not function without them, without their contribution.”\nHe also criticised the approach of the previous government, saying the crisis was “left to grow” and “totally ignored” while carers suffered.\nMatthew said the review announced would deliver long-overdue stability to carers who have faced anxiety over the scandal.\nClosing his speech, Matthew expressed hope that carers would “feel valued and listened to” and that “the issues they feel are important are brought to light”. He said: “I welcome today’s announcement and hope that with it, our brilliant carers know that this is a government that is on their side.”\nMatthew Patrick MP has today (Monday 7th October) paid tribute to the families of hostages for “the dignity, the courage and the love” they’ve shown.\nThe Member for Wirral West asked a question of the Prime Minister following his statement in the House of Commons marking the one-year anniversary of the 7th October attacks.\nMatthew spoke of the collective grief felt across the Jewish community on the anniversary of Hamas’ attacks, and paid tribute to the loved ones of Israeli hostages for their efforts to bring them home.\nHe said: “Today, as with so many times in the history of the Jewish people, we are bound in grief and in mourning. Would the Prime Minister assure the Jewish community that we are not alone in that grief?\n“And would he take this opportunity to join me in praising the dignity, the courage and the love shown by the families and friends of the hostages in their efforts to bring them home?”\nIn his response, Prime Minister Keir Starmer immediately made assurances to the Jewish community that they are not alone. He also paid tribute to the families and friends of hostages for sharing their stories.\nKeir Starmer said: “It is incredibly moving to spend any time with [the families of the hostages] and to hear firsthand what they are going through. As I’ve said to them every time I’ve met them, the impact it has I think on anyone listening – the impact it has on me – is profound.”\nWirral Council allocated over £3m as part of Household Support Fund extension.\nMillions of families to be supported with cost-of-living support this winter.\nLocal MP welcomes swift action to support those in need.\nThe Government has TODAY (27 September) announced more than £3 million in cost-of-living support for families on the Wirral.\nLabour’s Secretary of State for Work and Pensions, Liz Kendall, announced earlier this month that the Household Support Fund (HSF) would be extended for a further six months, until 31 March 2025. The scheme provides money to local authorities to deliver essential help to the most vulnerable people in society.\nWirral Council has been given an HSF Grant of £3,049,345.09 as part of a wider package of £421 million being provided to local authorities across England.\nMatthew Patrick, MP for Wirral West, has welcomed the Government’s investment in tackling poverty and ensuring those in the most need across the Wirral are supported. Hesaid: “I’m pleased to see the new Labour government acting swiftly to ensure support is available for those feeling the harsh impacts of the cost-of-living crisis.\n“We are already working hard to deliver change – to eradicate the root causes of poverty and prevent hardship – but I know many people in our community will be relieved to see short-term support continue.\n“If you or anyone you know is struggling this winter, please get in touch with my office or Wirral Council to explore the support available to you.”\nWirral Council previously delivered support to families and pensioners struggling with the cost of living through the HSF, helping with the cost of water and energy, as well as funding community projects, foodbanks, debt support and holiday activities for children.\nMatthew Patrick MP has questioned the Secretary of State for Wales on transport links between Wales and the Wirral.\nHe spoke in the House of Commons during Welsh oral questions on Wednesday 11 September to raise concerns that transport connections are “lagging behind” despite the strong links between Wales and Merseyside. Matthew asked for details on the conversations she’s having across government and with external organisations to deliver better connections for people on both sides of the border.\nSpeaking in the Commons, Matthew said: “Connections between my constituency of Wirral West and Wales are many, they’re deep and they’re valued on both sides of the border. Our transport connections, however, are sadly lagging behind.\n“Could she please set out what conversations she’s having with ministers and stakeholders to improve those connections?”\nIn her response, Secretary of State for Wales Jo Stevens MP shared that she has discussed improving connections between Wales and Merseyside with Transport Secretary Louise Haigh MP.\nStevens said: “I recognise the importance of cross-border travel for people across the region. The UK and Welsh governments are committed to strengthening these connections, which are vital to unlocking economic growth and employment opportunities for people and businesses.”\nShe also recognised the need for enhancements on the Wrexham to Bidston line and committed to working across government to deliver them.\nThank you for the opportunity to deliver my maiden speech in this important debate, Madam Deputy Speaker. The matter of budget responsibility is important to my constituents in Wirral West, because they know the cost of getting it wrong—the cost to public finances, public services and public trust. I know they will support the measures we are introducing.\nMay I congratulate my hon. Friend the Member for Kettering (Rosie Wrighting), my many hon. Friends and hon. Members on making their maiden speeches today? They have been beautiful, telling stories of constituencies and personal journeys. I think there is a theme to many of them—a theme about civility in public life, about ambition for everybody, and about the number of hours of sunshine that each of the various constituencies receives. I will no doubt look that one up.\nI will focus my remarks today on the place and the people who have brought me here. In so doing, I hope to explain why I believe in the power of argument, disagreement and nuance. Hon. Members will know that my constituency is in the Wirral peninsula. What the House might not have realised is that we are quite particular about how you refer to the Wirral—it is never “Wirral” but “the Wirral”, and you are rarely “in it” but, rather, “on it”.\nThe rich history of Wirral West—one of Vikings, James Bond and a Prime Minister—would not be out of place in a Hollywood blockbuster. The Vikings came to the Wirral in 900 AD, and they brought with them their own Parliament, which they called “Things”. That is how one of the most beautiful villages we enjoy, Thingwall, was named. Hon. Members will probably be grateful that I am going to skip forward a few centuries of history to bring us closer to the present day. Daniel Craig—the most recent James Bond and, in my view, the best 007—was brought up, played rugby and went to school in West Kirby and Hoylake, and former Prime Minister Harold Wilson, who did so much for lifelong learning with the Open University and introduced important social reforms, lived in Spital.\nOur past may be worthy of Hollywood, but our present and beautiful natural environment would not be out of place in a David Attenborough documentary. Its physical beauty has been captured by many of the finest photographers, but even they will tell you that there is no substitute for seeing it for yourself—from walking to Hilbre Island and watching as the seals swim through the River Dee, to admiring our golf courses, which are famous for hosting the Open.\nThose people lucky enough to call Wirral West their home are part of what makes it so special. They bring passion to everything they do, and they carry that passion with a warm welcome and great dignity. That passion runs through each of the towns and villages. It is passion for one another and for our area, helping to expand opportunities to everyone. I cannot imagine another place with as many community groups, churches and businesses that work so hard to do such good, including scouts and guides groups, the Royal National Lifeboat Institution, our schools and hospitals, and community hubs such as the Hoole Road hub—so many groups that support all people, whatever the difficulties they face. It is community spirit that has powered us through some difficult times, and I hope that this new Government can help to bring back some hope so that we can look forward to better days.\nWirral West, with its expanded boundaries, has been most recently served by two people: Margaret Greenwood and my hon. Friend the Member for Birkenhead the Member for Birkenhead (Alison McGovern).\nMargaret Greenwood is deeply passionate about our NHS and our environment, and those are two passions that I share. As an MP, Margaret knew that getting our NHS back on its feet is vital so that it can deliver world-leading care. We are fortunate in Wirral West to have two hospitals: Arrowe Park and Clatterbridge. I know the Secretary of State for Health and Social Care is particularly fond of the latter, given the support it gave to his family. I think back to the conversations I had in the election campaign, to the people waiting sometimes years for crucial operations and the stress that that waiting added to their daily lives. I will be thinking of those people as we do the work to turn the NHS around.\nAs Margaret often reminded us, there is no escaping the threat that is climate change. It came up often on the doorstep. People on the Wirral, from teachers to scientists and from environmentalists to parents are worried, like so many, about the threat of climate change. They know that it does not respond to strong rhetoric, borders or weapons. It is only action, joined up with our partners around the world, that will help us to tackle climate change and save the environment. When I see the wind farms off our Wirral shores, I am proud that we can be a home of green energy and green jobs, delivering the bold action that is desperately needed.\nMy other predecessor, who now serves Birkenhead, had a deep impact on my own journey—ambitious for me personally and many people like me, from working-class communities; ambitious for all of us, encouraging us, believing that we too can stand tall in places, even ones as grand as this. I grew up in Birkenhead. It is a wonderful place, but it is not without its struggles. Standing here now is a testament to my hon. Friend and to her encouragement and ambition for people like me. She will know that, as proud as we rightly are, some people from ordinary backgrounds can fulfil their ambitions, but it is still only some people, and there is much more that we must do. I will not rest until some people having opportunity becomes everybody having opportunity. The enormity of that task is matched only by its importance. It would be daunting, but for the fact that I know I am not alone in that mission. I am proud to stand alongside my hon. Friend the Member for Birkenhead and all of my hon. Friends in this great task.\nThe Wirral has had many politicians who have made an important contribution to public life. They include my hon. Friend the Member for Wallasey (Dame Angela Eagle) and her championing of women and the LGBT community, and Baron Hunt of Wirral, although Members will realise that I think it should be Baron Hunt of the Wirral, but I will come back to that. He comes from a different tradition from me but he has served people in this country with bravery and distinction. And of course, there was Frank Field, who we sadly lost earlier this year.\nFrank was a dear friend of mine, and I miss him terribly. He was the first MP I met. He was interested in what everyone had to say, and as hon. Members across the House may know from personal experience, he was quite interested in disagreement, too. He was fascinated when what you had to say differed from his own views, and it was Frank who taught me that disagreement did not need to be tolerated in politics but rather to be sought out and embraced. He taught me that, if you believe in something, you should feel free to say it, and that as long as you do so with reason, respect and humility, you should enjoy the consideration of others. Because we cannot reward the absolutists. Those who know everything with total certainty are, I think, the people we should most fear.\nI am conscious, standing here, of the responsibility placed on me to represent the interests and people of Wirral West, and I will do that fiercely. I am deeply aware that representation is as much about listening as it is about speaking. The most interesting and informative conversations that I had on the election campaign were with people who disagreed with me. I learned much from them. In this House, while I bring from my career expertise in local government and economic policy, which I hope will benefit others, I intend to tap into the accumulated knowledge of hon. Members from all sides of the House. There has not been enough listening in our politics of late, and I believe that, if we are to restore faith in this House, which I believe we must, listening to our constituents and to one another is a vital step.\nFrank and I spoke often about a whole range of issues and, even towards the end of his extraordinary life, he maintained a fascination with politics, with what it could do for people and with the disagreements that lay at its heart. A small part of his enormous legacy will be these three commitments that I make to this House. My commitment is to listen in good faith to arguments made in good faith. My commitment is to change my mind when it is right to do so. And my commitment is to stand up for the things that I believe in, so that others might do the same. That is what Frank would have expected, it is what the people of Wirral West rightly expect and it is what this House and our politics deserve.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_11_04_claire-house-westminster-hall/content_14.html": "I was pleased to be able to champion the incredible work of Claire House in Parliament last week, and the passion and pride every single member of their team displays.\nFunding must be there for all seriously ill children and their families to ensure they have the support they need, regardless of where they live.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_my-priorities/content_15.html": "Cost of Living\nUnder the Conservatives it has become harder and harder for families to make ends meet. The crisis has been felt particularly in the last year since the economic crash caused by the reckless Conservative Budget. But for many families it has been going on for years as government cuts and low pay have led to a stagnating economy. I know how much families and business are struggling across the Wirral and ending this crisis is my top priority.\nOur NHS\nThe Wirral is home to some of the best specialist NHS hospitals in the country, but its brilliant staff are struggling amidst an underfunded service which has been repeatedly let down by the last 14 years of Tory Governments.\nOur Green Spaces\nThe Wirral’s green spaces and our beautiful beaches are what makes this such a wonderful place to live. I am committed to protecting our environment and I wholeheartedly support the Council’s local plan to build new housing on Brownfield land.\nEnergy and Climate Change\nOver the last few years energy bills have soared due to a lack of investment and planning by successive Tory Governments. We are also facing a Climate Crisis which threatens our environment, and our future. Labour’s plan to create GB Energy, owned by the public, to invest in our collective future and provide clean energy, will bring down bills, invest in our future, and bring an end to our reliance on oil and gas.\nThe Best Start in Life\nChildren on the Wirral deserve the best education, opportunities, and start to life whatever their background or circumstances. I will prioritise good quality childcare to help parents, high and rising standards in our schools, and opportunities for developing skills for teenagers and young adults.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_wirral/content_36.html": "Four charities on the Wirral have received a £25,000 donation – split equally four ways – from entertainment company with a social purpose, Omaze, following its recent house draw in the area.\nOmaze was introduced to the four charities by Matthew Patrick MP, Member of Parliament for Wirral West.\nThe beneficiaries of the donation are Tomorrow’s Women, which supports and empowers women experiencing difficulties; Barnstondale – an inclusive outdoor activity centre supporting over 6,000 children each year from all backgrounds; Carrbridge Centre – a community centre on a large housing estate that aims to steer young people towards positive paths and Claire House – a hospice for terminally ill children, helping 500 families per year.\nOmaze recently ran a house draw on the Wirral – in which a five bedroom house worth £3 million – along with £250,000 in cash, was won by a 24-year-old nanny and raised £3.5 million for Scouts.\nTomorrow’s Women in Birkenhead provides targeted support across a range of areas including financial, mental health, domestic abuse, social isolation and substance abuse – and plans to use its £6,250 share to fund staff training for their stalking and harassment programme.\nBarnstondale provides inclusive outdoor experiences for schools, youth groups, and charities. With 25% of visitors having additional needs and 1 in 3 facing financial hardship, our bursary scheme helps those most in need. This £6,250 donation will directly support them, ensuring access to their centre.\nAs there is no youth centre in the area for young people aged over 13 years old, Carrbridge Centre on the Woodchurch, will use the Omaze funding to cover much needed support with its staff. The new funds will provide one “Omaze Youth Active session” per week – for an entire year.\nClaire House Children’s Hospice in Bebington can use the funds to provide a month of ‘Butterfly Care’ which is a place for a family to be with their child after they have passed.\nMatthew Patrick MP, Member of Parliament for Wirral West, said: “Across the Wirral, charities and volunteers contribute so much to our community, providing support and services to those who need it most.\n“It was great to meet with Omaze and introduce them to the four amazing organisations who they’re donating to.\n“The £25,000 donation will make a huge impact for people on the Wirral, keeping important services running and delivering new activities for young people on the Woodchurch.”\nSiobhan Waters, Fundraising and Communications Manager, Barnstondale Centre, said: “We are incredibly grateful to be one of the four charities benefiting from these much-needed funds. Omaze’s support has helped part-fund activity days and residential trips at Barnstondale, creating a life-changing impact – not just for the 55 children who directly benefited, but also for their families, teachers, and communities.\n“The confidence, resilience and teamwork skills they develop at Barnstondale will stay with them for life. Thanks to your generosity, we can continue our mission to ensure no child is left behind, giving more young people the chance to experience the joy of outdoor learning with their friends – creating memories that last a lifetime.”\nNatasha Walker, Omaze, said: “Everyone at Omaze is absolutely delighted we have been able to make a contribution to these four fantastic charities.\n“I was honoured to visit Barnstondale, to meet representatives from all four charities and hear about the incredible people who are providing such vital community services.\n“Omaze will continue to help more local causes in the areas where we host our house draws, wherever possible.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_12_05_matthew-welcomes-labours-plan-for-change/content_37.html": "Matthew Patrick, MP for Wirral West, has welcomed the Labour Government’s Plan for Change, set out in a landmark speech by the Prime Minister yesterday (5 December).\nThe Plan for Change consists of six clear milestones – covering the economy, the NHS, clean power, education, crime and housing – to deliver measurable change by the end of this parliament. The plan is underpinned by foundations of sound public finances and secure borders.\nThe plan sets out a blueprint for rebuilding Britain after 14 years of managed decline under the Tories and will focus on issues which impact the everyday lives of people on the Wirral.\nFor example, the Plan for Change will see NHS waiting lists – which have skyrocketed to 369,065 across Cheshire and Merseyside – tackled through 40,000 additional NHS operations and investment in state-of-the-art hospital equipment. Labour has set the target of 92% of NHS patients to receive treatment within 18 weeks. After 14 years of Tory government, this figure currently stands at just 59%.\nKnife crime and robbery are rife across the country, but the neighbourhood police who could prevent crimes like this and support victims disappeared under the Tories, with the number of Police Community Support Officers cut by 276 in Merseyside. Labour’s plans will see 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community.\nIt will also focus on improving life chances for all children by raising the number of children starting school ready to learn. As it stands, the number of children meeting key early years development targets sits at around 64% in the North West, a figure Labour wants to see hit 75% by the end of the parliament.\nWork on the Plan for Change is well underway, with this Labour government already delivering a number of landmark changes. These include:\n- A pay boost for 3 million workers through an increase in the National Minimum Wage and National Living Wage, benefitting 7700 on the Wirral.\n- Funding for 40,000 additional NHS operations, as well as investment in state-of-the-art scanners and diagnostic equipment to get more patients seen on time.\n- Bringing our total investment in housing supply to over £5bn, and delivering funding to transform neglected land into new homes.\n- Putting police back on the beat with 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community through our Neighbourhood Policing Guarantee in England and Wales.\n- Launching Great British Energy to provide clean, secure and homegrown power.\n- Kickstarted the first stage of roll out of free Breakfast Clubs for primary school children, and delivered funding for up to 300 school-based nurseries.\nCommenting on the Plan for Change, Matthew Patrick MP said:\n“After 14 years of chaos and broken promises under the Tories, Labour was elected to deliver change.\n“In the conversations I have with people across Wirral West, time and again people raise the need to fix our NHS, get police back out on the beat, and invest in the futures of our children and young people.”\n“The Prime Minister’s announcement of these ambitious but achievable milestones shows this is a government serious about making a difference in people’s lives.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_climate/content_10.html": "Matthew has today (18 March) asked a question to the Secretary of State for Energy Security and Net Zero.\nHe highlighted that he climate emergency is the challenge of our generation, and the role of Merseyside in meeting that challenge, with pioneering carbon capture and hydrogen technology.\nAs the Energy Secretary set out, people in Wirral West will benefit from the region’s expertise with good jobs and a cleaner future.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_nhs/content_42.html": "Patients in Wirral West will be able to access more appointments closer to home and get the treatment they need faster with Labour’s plan to tackle hospital backlogs.\n- Hundreds of thousands more appointments in the North West to be created through plan to get people the treatment they need quicker.\n- Patients in Wirral West to feel the impact of greater patient choice over follow-up care as part of a drive to open-up one million appointments, alongside better use of tech and other action to save another million missed appointments.\n- Reforms mark next step in delivering government’s Plan for Change to deliver for working people.\nPatients in Wirral West will be able to access more appointments closer to home and get the treatment they need faster under a new plan to tackle hospital backlogs set out by the Prime Minister last week (6 January).\nIn the North West there are 1,063,560 cases on waiting lists at huge cost to their health.\nTackling the 7.5million strong waiting list inherited from the Tories so that the NHS once again meets the 18-week standard for planned treatment is a key milestone in the Government’s Plan for Change. Restoring this standard will mean patients in Wirral West no longer have to have their lives put on hold.\nCurrently, too many patients face long waits for appointments or surgeries and may be referred to hospitals they don’t choose at inconvenient times, while appointments and staff time are being lost to inefficiencies or inconsistencies in care. In the Cheshire and Merseyside Integrated Care Board area, which covers Wirral West, there are 367,350 cases on waiting lists, with 158,156 waiting more than 18 weeks for treatment.\nThe Labour Government’s Elective Reform Plan, published by NHS England, sets out a whole system approach to hitting the 18-week referral to treatment target by the end of this Parliament. This includes opening Community Diagnostic Centres on evenings and weekends so that many more people will be able to access tests and checks while going about their daily lives. The NHS will also increase the number of surgical hubs, which help protect planned care from the impact of seasonal and other pressures.\nThe plan will drive forward progress on the Government’s first steps commitment to deliver 2 million extra appointments in its first year, equivalent to 40,000 every week. The reforms will put patients first, harness technology to support staff and help the NHS to do things more efficiently.\nUnder the plan, 65% of patients will be treated within 18 weeks by the end of next year. Based on the size of the current waiting list, that would mean a fall of more than 450k people waiting more than 18 weeks for treatment.\nPrime Minister Keir Starmer said:\n“This Government promised change and that is what I am fighting every day to deliver.\n“NHS backlogs have ballooned in recent years, leaving millions of patients languishing on waiting lists, often in pain or fear. Lives on hold. Potential unfulfilled.\n“This elective reform plan will deliver on our promise to end the backlogs. Millions more appointments. Greater choice and convenience for patients. Staff once again able to give the standard of care they desperately want to.\n“This is a key plank of our Plan for Change, which will drive growth that puts more money in people’s pockets, secures our borders and makes the NHS fit for the future so what working people live longer, healthier, more prosperous lives.”\nMatthew Patrick, MP for Wirral West, said: “Hundreds of residents in Wirral West are stuck on the record long waiting lists inherited by the Labour Government at huge cost to their health.\n“Whenever I’m out in our community, people tell me about the need to get the NHS back on track, and of their experience of a system left to decline under the Conservatives.\n“We are getting on with the job of delivering. That’s why I welcome the reforms announced by the Prime Minister to cut NHS waiting times from 18 months to 18 weeks. It will make such a huge difference.\n“With so many people waiting for treatment, it is more urgent than ever that we reform our NHS so it will always be there for you when you need it.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_02_24_matthew-asks-the-home-secretary-about-antisocial-behaviour/content_33.html": "Matthew has today (24th February) raised the unacceptable levels of antisocial behaviour.\nFor too long, people across our area have been facing threats and intimidation in their own homes – this cannot go on.\nWirral Council and Merseyside Police are doing good work to ensure this kind of behaviour is dealt with, but we need a whole system approach to preventing and tackling this vile crime.\nWe need to put more neighbourhood police and community support officers back into local communities to crack down on those causing havoc.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_11_08_discussion-assisted-dying/content_31.html": "Thank you to everyone who came to the discussion I hosted about assisted dying in Hoylake yesterday.\nIt’s an emotive subject, and people shared powerful, personal stories and perspectives. The discussion drew on the deep expertise of people in Wirral West, and, in our best traditions, was reasonable and thoughtful.\nIf you’re a constituent and would like to share your views with me, please email my office to share your perspective.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_author_mattpatrick8_page_2/content_45.html": "Matthew Patrick, MP for Wirral West, has welcomed the Labour Government’s Plan for Change, set out in a landmark speech by the Prime Minister yesterday (5 December).\nThe Plan for Change consists of six clear milestones – covering the economy, the NHS, clean power, education, crime and housing – to deliver measurable change by the end of this parliament. The plan is underpinned by foundations of sound public finances and secure borders.\nThe plan sets out a blueprint for rebuilding Britain after 14 years of managed decline under the Tories and will focus on issues which impact the everyday lives of people on the Wirral.\nFor example, the Plan for Change will see NHS waiting lists – which have skyrocketed to 369,065 across Cheshire and Merseyside – tackled through 40,000 additional NHS operations and investment in state-of-the-art hospital equipment. Labour has set the target of 92% of NHS patients to receive treatment within 18 weeks. After 14 years of Tory government, this figure currently stands at just 59%.\nKnife crime and robbery are rife across the country, but the neighbourhood police who could prevent crimes like this and support victims disappeared under the Tories, with the number of Police Community Support Officers cut by 276 in Merseyside. Labour’s plans will see 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community.\nIt will also focus on improving life chances for all children by raising the number of children starting school ready to learn. As it stands, the number of children meeting key early years development targets sits at around 64% in the North West, a figure Labour wants to see hit 75% by the end of the parliament.\nWork on the Plan for Change is well underway, with this Labour government already delivering a number of landmark changes. These include:\nA pay boost for 3 million workers through an increase in the National Minimum Wage and National Living Wage, benefitting 7700 on the Wirral.\nFunding for 40,000 additional NHS operations, as well as investment in state-of-the-art scanners and diagnostic equipment to get more patients seen on time.\nBringing our total investment in housing supply to over £5bn, and delivering funding to transform neglected land into new homes.\nPutting police back on the beat with 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community through our Neighbourhood Policing Guarantee in England and Wales.\nLaunching Great British Energy to provide clean, secure and homegrown power.\nKickstarted the first stage of roll out of free Breakfast Clubs for primary school children, and delivered funding for up to 300 school-based nurseries.\nCommenting on the Plan for Change, Matthew Patrick MP said:\n“After 14 years of chaos and broken promises under the Tories, Labour was elected to deliver change.\n“In the conversations I have with people across Wirral West, time and again people raise the need to fix our NHS, get police back out on the beat, and invest in the futures of our children and young people.”\n“The Prime Minister’s announcement of these ambitious but achievable milestones shows this is a government serious about making a difference in people’s lives.”\nThank you to everyone who came to the discussion I hosted about assisted dying in Hoylake yesterday.\nIt’s an emotive subject, and people shared powerful, personal stories and perspectives. The discussion drew on the deep expertise of people in Wirral West, and, in our best traditions, was reasonable and thoughtful.\nIf you’re a constituent and would like to share your views with me, please email my office to share your perspective.\nMatthew Patrick MP has today (Wednesday 6 November) used a Prime Ministers Question to advocate for survivors of economic abuse.\nMatthew asked the Prime Minister and the Government to work with him to get the credit files of victim-survivors of economic abuse restored.\nCurrently, victim-survivors can suffer lasting consequences of economic abuse perpetrated by a current or former partner long after they’ve fled due to their credit rating being harmed by coerced debts.\nMatthew shared the story of Emily*, a survivor of domestic abuse who was left with a ruined credit file when her abusive ex-partner stopped contributing to their joint mortgage after she fled to safe accommodation for her safety.\nDespite informing her lender of the economic abuse she was experiencing, Emily* has seen lasting damage from the years spent trying to separate herself financially from her perpetrator, having faced issues trying to rent a property, finance a car and take out a mobile phone contract in her own name.\nSpeaking in the House of Commons,Matthew said: “Emily left her ex, but the abuse did not stop.\n“He stayed in their home, cancelled his mortgage contributions and destroyed her credit score.\n“Now, she cannot even take out a mobile phone contract.\n“Surviving Economic Abuse and UK Finance have made progress tackling this problem, but there is more to be done.\n“Would the Prime Minister and his Government work with me to bring in new provisions to restore the credit files of survivors of economic abuse like Emily?”\nResponding, Prime Minister Keir Starmer committed to ending the “national emergency” of economic and domestic abuse. He also assured that Matthew would meet with relevant Ministers to progress his work.\nHe said: “I thank my Honourable Friend for raising this important issue because economic abuse has a devastating impact on victims leaving them vulnerable and isolated.\n“We are committed to ending this national emergency and keeping women safe from domestic abuse, harassment and stalking.\n“That includes £200,000 this year to the charity Surviving Economic Abuse and HMRC have launched an online tool to help charities and business identify and respond to economic abuse.”\nNotes\nEmily* is a pseudonym to protect the survivor’s identity.\nFor more information about economic abuse, or support if you are experiencing or have experienced economic abuse, please visit Surviving Economic Abuse.\nI was pleased to be able to champion the incredible work of Claire House in Parliament last week, and the passion and pride every single member of their team displays.\nFunding must be there for all seriously ill children and their families to ensure they have the support they need, regardless of where they live.\nMatthew Patrick MP has described yesterday’s (30 October) Budget as a “game changer” which will “bring back hope” and deliver “a Britain we can be proud of again”.\nThe Chancellor of the Exchequer, Rachel Reeves, delivered Labour’s first Budget for 14 years, announcing a range of measures which would “fix the foundations and deliver change”.\nThe Budget announced an extra c£25.6billion over two years for the NHS, to cut waiting times with 40,000 extra elective appointments a week, and build capacity for more than 30,000 additional procedures.\nWelcoming the announcement, Matthew said: “That is not just a good health policy; it is a policy that will make Britain stronger, happier and ready to take on the challenges coming our way.\n“I do not want to be faced with more stories of my constituents waiting years for important operations. I have heard enough of those heartbreaking stories to last me a lifetime—stress upon stress, costing jobs and crushing hope.”\nThe Chancellor also announced the tripling of funding for free breakfast clubs in primary schools to £30 million, alongside an increase to the Core Schools Budget by £2.3bn next year to support the recruitment of 6,500 teachers. The Budget also included an announcement of an additional £1 billion uplift for SEND and alternative provision funding.\nMatthew said this would deliver “real hope” and added: “I cannot wait until we open those breakfast clubs in Wirral West, to expand opportunities for parents and kids alike.”\nMatthew praised the new Government’s approach, saying the Chancellor has “opened up Britain’s future once again” through policies which will invest in public services, including the NHS and state schools.\nHe said: “Our investment will mean more opportunities, better pay, and public services that are there when people need them—a Britain we can be proud of again.\n“The Government are making long-term decisions so that we can look back on a decade of expanding opportunities and rising standards, not another decade of shameful decline, which the country, and working people, cannot afford.”\nThe Chancellor also announced an increase to the National Living Wage (NLW) of 6.7% to £12.21 per hour for full time workers on the NLW – worth up to £1,400 for a full-time worker. This will mean a pay increase for around 7,700 people living on the Wirral.\nFollowing the announcement of a review into the Carers Allowance overpayment scandal earlier in the month, the Chancellor also used the Budget to announce an increase to the Carer’s Allowance Weekly Earnings Limit from £151 to £196 per week. The Treasury estimates this will allow over 60,000 more carers to access Carer’s Allowance.\nFunding was also allocated to compensate victims of the Post Office Horizon scandal (c£2 billion) and the Infected Blood scandal (£11.8 billion), the costs of which had not been fully accounted for by the previous government.\nClosing his speech in the House, Matthew said: “This Budget protects working people, invests in our NHS and rebuilds the foundations for Britain’s future.\n“More of the same simply was not an option; hope was on the ballot in July, and this Budget brings back hope.”\nMatthew Patrick has today (16th October) spoken in Parliament about carers “pushed to breaking point” by the Carer’s Allowance overpayment scandal.\nThe MP for Wirral West shared the experiences of Wirral carers in the House of Commons, many of whom have faced anxiety over the potential financial impact of repayments and the pressures of balancing care work with day-to-day life.\nUnder the previous Conservative government, a large number of carers were made to pay back thousands of pounds over minor or inadvertent breaches of the Carer’s Allowance earnings threshold.\nSecretary of State for Work and Pensions Liz Kendall today announced an independent review into this situation, to be led by former Disability Rights UK chief executive Liz Sayce.\nThe review will investigate how overpayments of Carer’s Allowance have occurred, what can best be done to support those who have accrued them, and how to reduce the risk of these problems occurring in future.\nSpeaking in the House of Commons, Matthew paid tribute to carers in the community and the “selflessness and dedication” they embody.\nHe said: “At times of immense need, they step in. Day after day, supporting family members, making such an important contribution to their loved ones and our community.\n“Our country would simply not function without them, without their contribution.”\nHe also criticised the approach of the previous government, saying the crisis was “left to grow” and “totally ignored” while carers suffered.\nMatthew said the review announced would deliver long-overdue stability to carers who have faced anxiety over the scandal.\nClosing his speech, Matthew expressed hope that carers would “feel valued and listened to” and that “the issues they feel are important are brought to light”. He said: “I welcome today’s announcement and hope that with it, our brilliant carers know that this is a government that is on their side.”\nMatthew Patrick MP has today (Monday 7th October) paid tribute to the families of hostages for “the dignity, the courage and the love” they’ve shown.\nThe Member for Wirral West asked a question of the Prime Minister following his statement in the House of Commons marking the one-year anniversary of the 7th October attacks.\nMatthew spoke of the collective grief felt across the Jewish community on the anniversary of Hamas’ attacks, and paid tribute to the loved ones of Israeli hostages for their efforts to bring them home.\nHe said: “Today, as with so many times in the history of the Jewish people, we are bound in grief and in mourning. Would the Prime Minister assure the Jewish community that we are not alone in that grief?\n“And would he take this opportunity to join me in praising the dignity, the courage and the love shown by the families and friends of the hostages in their efforts to bring them home?”\nIn his response, Prime Minister Keir Starmer immediately made assurances to the Jewish community that they are not alone. He also paid tribute to the families and friends of hostages for sharing their stories.\nKeir Starmer said: “It is incredibly moving to spend any time with [the families of the hostages] and to hear firsthand what they are going through. As I’ve said to them every time I’ve met them, the impact it has I think on anyone listening – the impact it has on me – is profound.”\nWirral Council allocated over £3m as part of Household Support Fund extension.\nMillions of families to be supported with cost-of-living support this winter.\nLocal MP welcomes swift action to support those in need.\nThe Government has TODAY (27 September) announced more than £3 million in cost-of-living support for families on the Wirral.\nLabour’s Secretary of State for Work and Pensions, Liz Kendall, announced earlier this month that the Household Support Fund (HSF) would be extended for a further six months, until 31 March 2025. The scheme provides money to local authorities to deliver essential help to the most vulnerable people in society.\nWirral Council has been given an HSF Grant of £3,049,345.09 as part of a wider package of £421 million being provided to local authorities across England.\nMatthew Patrick, MP for Wirral West, has welcomed the Government’s investment in tackling poverty and ensuring those in the most need across the Wirral are supported. Hesaid: “I’m pleased to see the new Labour government acting swiftly to ensure support is available for those feeling the harsh impacts of the cost-of-living crisis.\n“We are already working hard to deliver change – to eradicate the root causes of poverty and prevent hardship – but I know many people in our community will be relieved to see short-term support continue.\n“If you or anyone you know is struggling this winter, please get in touch with my office or Wirral Council to explore the support available to you.”\nWirral Council previously delivered support to families and pensioners struggling with the cost of living through the HSF, helping with the cost of water and energy, as well as funding community projects, foodbanks, debt support and holiday activities for children.\nMatthew Patrick MP has questioned the Secretary of State for Wales on transport links between Wales and the Wirral.\nHe spoke in the House of Commons during Welsh oral questions on Wednesday 11 September to raise concerns that transport connections are “lagging behind” despite the strong links between Wales and Merseyside. Matthew asked for details on the conversations she’s having across government and with external organisations to deliver better connections for people on both sides of the border.\nSpeaking in the Commons, Matthew said: “Connections between my constituency of Wirral West and Wales are many, they’re deep and they’re valued on both sides of the border. Our transport connections, however, are sadly lagging behind.\n“Could she please set out what conversations she’s having with ministers and stakeholders to improve those connections?”\nIn her response, Secretary of State for Wales Jo Stevens MP shared that she has discussed improving connections between Wales and Merseyside with Transport Secretary Louise Haigh MP.\nStevens said: “I recognise the importance of cross-border travel for people across the region. The UK and Welsh governments are committed to strengthening these connections, which are vital to unlocking economic growth and employment opportunities for people and businesses.”\nShe also recognised the need for enhancements on the Wrexham to Bidston line and committed to working across government to deliver them.\nThank you for the opportunity to deliver my maiden speech in this important debate, Madam Deputy Speaker. The matter of budget responsibility is important to my constituents in Wirral West, because they know the cost of getting it wrong—the cost to public finances, public services and public trust. I know they will support the measures we are introducing.\nMay I congratulate my hon. Friend the Member for Kettering (Rosie Wrighting), my many hon. Friends and hon. Members on making their maiden speeches today? They have been beautiful, telling stories of constituencies and personal journeys. I think there is a theme to many of them—a theme about civility in public life, about ambition for everybody, and about the number of hours of sunshine that each of the various constituencies receives. I will no doubt look that one up.\nI will focus my remarks today on the place and the people who have brought me here. In so doing, I hope to explain why I believe in the power of argument, disagreement and nuance. Hon. Members will know that my constituency is in the Wirral peninsula. What the House might not have realised is that we are quite particular about how you refer to the Wirral—it is never “Wirral” but “the Wirral”, and you are rarely “in it” but, rather, “on it”.\nThe rich history of Wirral West—one of Vikings, James Bond and a Prime Minister—would not be out of place in a Hollywood blockbuster. The Vikings came to the Wirral in 900 AD, and they brought with them their own Parliament, which they called “Things”. That is how one of the most beautiful villages we enjoy, Thingwall, was named. Hon. Members will probably be grateful that I am going to skip forward a few centuries of history to bring us closer to the present day. Daniel Craig—the most recent James Bond and, in my view, the best 007—was brought up, played rugby and went to school in West Kirby and Hoylake, and former Prime Minister Harold Wilson, who did so much for lifelong learning with the Open University and introduced important social reforms, lived in Spital.\nOur past may be worthy of Hollywood, but our present and beautiful natural environment would not be out of place in a David Attenborough documentary. Its physical beauty has been captured by many of the finest photographers, but even they will tell you that there is no substitute for seeing it for yourself—from walking to Hilbre Island and watching as the seals swim through the River Dee, to admiring our golf courses, which are famous for hosting the Open.\nThose people lucky enough to call Wirral West their home are part of what makes it so special. They bring passion to everything they do, and they carry that passion with a warm welcome and great dignity. That passion runs through each of the towns and villages. It is passion for one another and for our area, helping to expand opportunities to everyone. I cannot imagine another place with as many community groups, churches and businesses that work so hard to do such good, including scouts and guides groups, the Royal National Lifeboat Institution, our schools and hospitals, and community hubs such as the Hoole Road hub—so many groups that support all people, whatever the difficulties they face. It is community spirit that has powered us through some difficult times, and I hope that this new Government can help to bring back some hope so that we can look forward to better days.\nWirral West, with its expanded boundaries, has been most recently served by two people: Margaret Greenwood and my hon. Friend the Member for Birkenhead the Member for Birkenhead (Alison McGovern).\nMargaret Greenwood is deeply passionate about our NHS and our environment, and those are two passions that I share. As an MP, Margaret knew that getting our NHS back on its feet is vital so that it can deliver world-leading care. We are fortunate in Wirral West to have two hospitals: Arrowe Park and Clatterbridge. I know the Secretary of State for Health and Social Care is particularly fond of the latter, given the support it gave to his family. I think back to the conversations I had in the election campaign, to the people waiting sometimes years for crucial operations and the stress that that waiting added to their daily lives. I will be thinking of those people as we do the work to turn the NHS around.\nAs Margaret often reminded us, there is no escaping the threat that is climate change. It came up often on the doorstep. People on the Wirral, from teachers to scientists and from environmentalists to parents are worried, like so many, about the threat of climate change. They know that it does not respond to strong rhetoric, borders or weapons. It is only action, joined up with our partners around the world, that will help us to tackle climate change and save the environment. When I see the wind farms off our Wirral shores, I am proud that we can be a home of green energy and green jobs, delivering the bold action that is desperately needed.\nMy other predecessor, who now serves Birkenhead, had a deep impact on my own journey—ambitious for me personally and many people like me, from working-class communities; ambitious for all of us, encouraging us, believing that we too can stand tall in places, even ones as grand as this. I grew up in Birkenhead. It is a wonderful place, but it is not without its struggles. Standing here now is a testament to my hon. Friend and to her encouragement and ambition for people like me. She will know that, as proud as we rightly are, some people from ordinary backgrounds can fulfil their ambitions, but it is still only some people, and there is much more that we must do. I will not rest until some people having opportunity becomes everybody having opportunity. The enormity of that task is matched only by its importance. It would be daunting, but for the fact that I know I am not alone in that mission. I am proud to stand alongside my hon. Friend the Member for Birkenhead and all of my hon. Friends in this great task.\nThe Wirral has had many politicians who have made an important contribution to public life. They include my hon. Friend the Member for Wallasey (Dame Angela Eagle) and her championing of women and the LGBT community, and Baron Hunt of Wirral, although Members will realise that I think it should be Baron Hunt of the Wirral, but I will come back to that. He comes from a different tradition from me but he has served people in this country with bravery and distinction. And of course, there was Frank Field, who we sadly lost earlier this year.\nFrank was a dear friend of mine, and I miss him terribly. He was the first MP I met. He was interested in what everyone had to say, and as hon. Members across the House may know from personal experience, he was quite interested in disagreement, too. He was fascinated when what you had to say differed from his own views, and it was Frank who taught me that disagreement did not need to be tolerated in politics but rather to be sought out and embraced. He taught me that, if you believe in something, you should feel free to say it, and that as long as you do so with reason, respect and humility, you should enjoy the consideration of others. Because we cannot reward the absolutists. Those who know everything with total certainty are, I think, the people we should most fear.\nI am conscious, standing here, of the responsibility placed on me to represent the interests and people of Wirral West, and I will do that fiercely. I am deeply aware that representation is as much about listening as it is about speaking. The most interesting and informative conversations that I had on the election campaign were with people who disagreed with me. I learned much from them. In this House, while I bring from my career expertise in local government and economic policy, which I hope will benefit others, I intend to tap into the accumulated knowledge of hon. Members from all sides of the House. There has not been enough listening in our politics of late, and I believe that, if we are to restore faith in this House, which I believe we must, listening to our constituents and to one another is a vital step.\nFrank and I spoke often about a whole range of issues and, even towards the end of his extraordinary life, he maintained a fascination with politics, with what it could do for people and with the disagreements that lay at its heart. A small part of his enormous legacy will be these three commitments that I make to this House. My commitment is to listen in good faith to arguments made in good faith. My commitment is to change my mind when it is right to do so. And my commitment is to stand up for the things that I believe in, so that others might do the same. That is what Frank would have expected, it is what the people of Wirral West rightly expect and it is what this House and our politics deserve.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_01_17_solar-energy/content_27.html": "Speaking in the debate on the New Homes (Solar Panels) Bill, Matthew shared how increasing the use of solar energy will better for the pockets of Wirral West residents, and will be better for the planet.\nCategories\nSpeaking in the debate on the New Homes (Solar Panels) Bill, Matthew shared how increasing the use of solar energy will better for the pockets of Wirral West residents, and will be better for the planet.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_economic-abuse/content_34.html": "Speaking in a debate in the House of Commons (6 January 2025), Matthew outlined the need for economic abuse to be a central part of the Government’s strategy to halve violence against women and girls (VAWG) in a decade.\nHe highlighted the work of Citizens Advice Wirral in supporting victim-survivors of domestic abuse on the Wirral, and the charity Surviving Economic Abuse for their pioneering support and research on economic abuse.\nMatthew Patrick MP has today (Wednesday 6 November) used a Prime Ministers Question to advocate for survivors of economic abuse.\nMatthew asked the Prime Minister and the Government to work with him to get the credit files of victim-survivors of economic abuse restored.\nCurrently, victim-survivors can suffer lasting consequences of economic abuse perpetrated by a current or former partner long after they’ve fled due to their credit rating being harmed by coerced debts.\nMatthew shared the story of Emily*, a survivor of domestic abuse who was left with a ruined credit file when her abusive ex-partner stopped contributing to their joint mortgage after she fled to safe accommodation for her safety.\nDespite informing her lender of the economic abuse she was experiencing, Emily* has seen lasting damage from the years spent trying to separate herself financially from her perpetrator, having faced issues trying to rent a property, finance a car and take out a mobile phone contract in her own name.\nSpeaking in the House of Commons,Matthew said: “Emily left her ex, but the abuse did not stop.\n“He stayed in their home, cancelled his mortgage contributions and destroyed her credit score.\n“Now, she cannot even take out a mobile phone contract.\n“Surviving Economic Abuse and UK Finance have made progress tackling this problem, but there is more to be done.\n“Would the Prime Minister and his Government work with me to bring in new provisions to restore the credit files of survivors of economic abuse like Emily?”\nResponding, Prime Minister Keir Starmer committed to ending the “national emergency” of economic and domestic abuse. He also assured that Matthew would meet with relevant Ministers to progress his work.\nHe said: “I thank my Honourable Friend for raising this important issue because economic abuse has a devastating impact on victims leaving them vulnerable and isolated.\n“We are committed to ending this national emergency and keeping women safe from domestic abuse, harassment and stalking.\n“That includes £200,000 this year to the charity Surviving Economic Abuse and HMRC have launched an online tool to help charities and business identify and respond to economic abuse.”\nNotes\nEmily* is a pseudonym to protect the survivor’s identity.\nFor more information about economic abuse, or support if you are experiencing or have experienced economic abuse, please visit Surviving Economic Abuse.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_foreign-affairs/content_38.html": "Matthew highlighted how imperative it is that the ceasefire in the Middle East holds.\nHe raised the plight of the 59 remaining hostages and their families who have lived through hell for more than 530 days, and the people of Gaza who desperately need aid and security.\nThe Foreign Secretary set out reassurances that Hamas should have no role to play in the future of Palestine’s governance, and that Britain is working hard to support the reform of the Palestinian Authority so the two-state solution can be realised.\nMatthew Patrick MP has today (Monday 7th October) paid tribute to the families of hostages for “the dignity, the courage and the love” they’ve shown.\nThe Member for Wirral West asked a question of the Prime Minister following his statement in the House of Commons marking the one-year anniversary of the 7th October attacks.\nMatthew spoke of the collective grief felt across the Jewish community on the anniversary of Hamas’ attacks, and paid tribute to the loved ones of Israeli hostages for their efforts to bring them home.\nHe said: “Today, as with so many times in the history of the Jewish people, we are bound in grief and in mourning. Would the Prime Minister assure the Jewish community that we are not alone in that grief?\n“And would he take this opportunity to join me in praising the dignity, the courage and the love shown by the families and friends of the hostages in their efforts to bring them home?”\nIn his response, Prime Minister Keir Starmer immediately made assurances to the Jewish community that they are not alone. He also paid tribute to the families and friends of hostages for sharing their stories.\nKeir Starmer said: “It is incredibly moving to spend any time with [the families of the hostages] and to hear firsthand what they are going through. As I’ve said to them every time I’ve met them, the impact it has I think on anyone listening – the impact it has on me – is profound.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_10_16_carers-allowance-overpayments-scandal/content_9.html": "Matthew Patrick has today (16th October) spoken in Parliament about carers “pushed to breaking point” by the Carer’s Allowance overpayment scandal.\nThe MP for Wirral West shared the experiences of Wirral carers in the House of Commons, many of whom have faced anxiety over the potential financial impact of repayments and the pressures of balancing care work with day-to-day life.\nUnder the previous Conservative government, a large number of carers were made to pay back thousands of pounds over minor or inadvertent breaches of the Carer’s Allowance earnings threshold.\nSecretary of State for Work and Pensions Liz Kendall today announced an independent review into this situation, to be led by former Disability Rights UK chief executive Liz Sayce.\nThe review will investigate how overpayments of Carer’s Allowance have occurred, what can best be done to support those who have accrued them, and how to reduce the risk of these problems occurring in future.\nSpeaking in the House of Commons, Matthew paid tribute to carers in the community and the “selflessness and dedication” they embody.\nHe said: “At times of immense need, they step in. Day after day, supporting family members, making such an important contribution to their loved ones and our community.\n“Our country would simply not function without them, without their contribution.”\nHe also criticised the approach of the previous government, saying the crisis was “left to grow” and “totally ignored” while carers suffered.\nMatthew said the review announced would deliver long-overdue stability to carers who have faced anxiety over the scandal.\nClosing his speech, Matthew expressed hope that carers would “feel valued and listened to” and that “the issues they feel are important are brought to light”. He said: “I welcome today’s announcement and hope that with it, our brilliant carers know that this is a government that is on their side.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_category_uncategorized_page_2/content_43.html": "Matthew Patrick, MP for Wirral West, has welcomed the Labour Government’s Plan for Change, set out in a landmark speech by the Prime Minister yesterday (5 December).\nThe Plan for Change consists of six clear milestones – covering the economy, the NHS, clean power, education, crime and housing – to deliver measurable change by the end of this parliament. The plan is underpinned by foundations of sound public finances and secure borders.\nThe plan sets out a blueprint for rebuilding Britain after 14 years of managed decline under the Tories and will focus on issues which impact the everyday lives of people on the Wirral.\nFor example, the Plan for Change will see NHS waiting lists – which have skyrocketed to 369,065 across Cheshire and Merseyside – tackled through 40,000 additional NHS operations and investment in state-of-the-art hospital equipment. Labour has set the target of 92% of NHS patients to receive treatment within 18 weeks. After 14 years of Tory government, this figure currently stands at just 59%.\nKnife crime and robbery are rife across the country, but the neighbourhood police who could prevent crimes like this and support victims disappeared under the Tories, with the number of Police Community Support Officers cut by 276 in Merseyside. Labour’s plans will see 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community.\nIt will also focus on improving life chances for all children by raising the number of children starting school ready to learn. As it stands, the number of children meeting key early years development targets sits at around 64% in the North West, a figure Labour wants to see hit 75% by the end of the parliament.\nWork on the Plan for Change is well underway, with this Labour government already delivering a number of landmark changes. These include:\nA pay boost for 3 million workers through an increase in the National Minimum Wage and National Living Wage, benefitting 7700 on the Wirral.\nFunding for 40,000 additional NHS operations, as well as investment in state-of-the-art scanners and diagnostic equipment to get more patients seen on time.\nBringing our total investment in housing supply to over £5bn, and delivering funding to transform neglected land into new homes.\nPutting police back on the beat with 13,000 more officers, PCSOs and special constables in neighbourhood roles and a named officer in every community through our Neighbourhood Policing Guarantee in England and Wales.\nLaunching Great British Energy to provide clean, secure and homegrown power.\nKickstarted the first stage of roll out of free Breakfast Clubs for primary school children, and delivered funding for up to 300 school-based nurseries.\nCommenting on the Plan for Change, Matthew Patrick MP said:\n“After 14 years of chaos and broken promises under the Tories, Labour was elected to deliver change.\n“In the conversations I have with people across Wirral West, time and again people raise the need to fix our NHS, get police back out on the beat, and invest in the futures of our children and young people.”\n“The Prime Minister’s announcement of these ambitious but achievable milestones shows this is a government serious about making a difference in people’s lives.”\nThank you to everyone who came to the discussion I hosted about assisted dying in Hoylake yesterday.\nIt’s an emotive subject, and people shared powerful, personal stories and perspectives. The discussion drew on the deep expertise of people in Wirral West, and, in our best traditions, was reasonable and thoughtful.\nIf you’re a constituent and would like to share your views with me, please email my office to share your perspective.\nMatthew Patrick MP has today (Wednesday 6 November) used a Prime Ministers Question to advocate for survivors of economic abuse.\nMatthew asked the Prime Minister and the Government to work with him to get the credit files of victim-survivors of economic abuse restored.\nCurrently, victim-survivors can suffer lasting consequences of economic abuse perpetrated by a current or former partner long after they’ve fled due to their credit rating being harmed by coerced debts.\nMatthew shared the story of Emily*, a survivor of domestic abuse who was left with a ruined credit file when her abusive ex-partner stopped contributing to their joint mortgage after she fled to safe accommodation for her safety.\nDespite informing her lender of the economic abuse she was experiencing, Emily* has seen lasting damage from the years spent trying to separate herself financially from her perpetrator, having faced issues trying to rent a property, finance a car and take out a mobile phone contract in her own name.\nSpeaking in the House of Commons,Matthew said: “Emily left her ex, but the abuse did not stop.\n“He stayed in their home, cancelled his mortgage contributions and destroyed her credit score.\n“Now, she cannot even take out a mobile phone contract.\n“Surviving Economic Abuse and UK Finance have made progress tackling this problem, but there is more to be done.\n“Would the Prime Minister and his Government work with me to bring in new provisions to restore the credit files of survivors of economic abuse like Emily?”\nResponding, Prime Minister Keir Starmer committed to ending the “national emergency” of economic and domestic abuse. He also assured that Matthew would meet with relevant Ministers to progress his work.\nHe said: “I thank my Honourable Friend for raising this important issue because economic abuse has a devastating impact on victims leaving them vulnerable and isolated.\n“We are committed to ending this national emergency and keeping women safe from domestic abuse, harassment and stalking.\n“That includes £200,000 this year to the charity Surviving Economic Abuse and HMRC have launched an online tool to help charities and business identify and respond to economic abuse.”\nNotes\nEmily* is a pseudonym to protect the survivor’s identity.\nFor more information about economic abuse, or support if you are experiencing or have experienced economic abuse, please visit Surviving Economic Abuse.\nI was pleased to be able to champion the incredible work of Claire House in Parliament last week, and the passion and pride every single member of their team displays.\nFunding must be there for all seriously ill children and their families to ensure they have the support they need, regardless of where they live.\nMatthew Patrick MP has described yesterday’s (30 October) Budget as a “game changer” which will “bring back hope” and deliver “a Britain we can be proud of again”.\nThe Chancellor of the Exchequer, Rachel Reeves, delivered Labour’s first Budget for 14 years, announcing a range of measures which would “fix the foundations and deliver change”.\nThe Budget announced an extra c£25.6billion over two years for the NHS, to cut waiting times with 40,000 extra elective appointments a week, and build capacity for more than 30,000 additional procedures.\nWelcoming the announcement, Matthew said: “That is not just a good health policy; it is a policy that will make Britain stronger, happier and ready to take on the challenges coming our way.\n“I do not want to be faced with more stories of my constituents waiting years for important operations. I have heard enough of those heartbreaking stories to last me a lifetime—stress upon stress, costing jobs and crushing hope.”\nThe Chancellor also announced the tripling of funding for free breakfast clubs in primary schools to £30 million, alongside an increase to the Core Schools Budget by £2.3bn next year to support the recruitment of 6,500 teachers. The Budget also included an announcement of an additional £1 billion uplift for SEND and alternative provision funding.\nMatthew said this would deliver “real hope” and added: “I cannot wait until we open those breakfast clubs in Wirral West, to expand opportunities for parents and kids alike.”\nMatthew praised the new Government’s approach, saying the Chancellor has “opened up Britain’s future once again” through policies which will invest in public services, including the NHS and state schools.\nHe said: “Our investment will mean more opportunities, better pay, and public services that are there when people need them—a Britain we can be proud of again.\n“The Government are making long-term decisions so that we can look back on a decade of expanding opportunities and rising standards, not another decade of shameful decline, which the country, and working people, cannot afford.”\nThe Chancellor also announced an increase to the National Living Wage (NLW) of 6.7% to £12.21 per hour for full time workers on the NLW – worth up to £1,400 for a full-time worker. This will mean a pay increase for around 7,700 people living on the Wirral.\nFollowing the announcement of a review into the Carers Allowance overpayment scandal earlier in the month, the Chancellor also used the Budget to announce an increase to the Carer’s Allowance Weekly Earnings Limit from £151 to £196 per week. The Treasury estimates this will allow over 60,000 more carers to access Carer’s Allowance.\nFunding was also allocated to compensate victims of the Post Office Horizon scandal (c£2 billion) and the Infected Blood scandal (£11.8 billion), the costs of which had not been fully accounted for by the previous government.\nClosing his speech in the House, Matthew said: “This Budget protects working people, invests in our NHS and rebuilds the foundations for Britain’s future.\n“More of the same simply was not an option; hope was on the ballot in July, and this Budget brings back hope.”\nMatthew Patrick has today (16th October) spoken in Parliament about carers “pushed to breaking point” by the Carer’s Allowance overpayment scandal.\nThe MP for Wirral West shared the experiences of Wirral carers in the House of Commons, many of whom have faced anxiety over the potential financial impact of repayments and the pressures of balancing care work with day-to-day life.\nUnder the previous Conservative government, a large number of carers were made to pay back thousands of pounds over minor or inadvertent breaches of the Carer’s Allowance earnings threshold.\nSecretary of State for Work and Pensions Liz Kendall today announced an independent review into this situation, to be led by former Disability Rights UK chief executive Liz Sayce.\nThe review will investigate how overpayments of Carer’s Allowance have occurred, what can best be done to support those who have accrued them, and how to reduce the risk of these problems occurring in future.\nSpeaking in the House of Commons, Matthew paid tribute to carers in the community and the “selflessness and dedication” they embody.\nHe said: “At times of immense need, they step in. Day after day, supporting family members, making such an important contribution to their loved ones and our community.\n“Our country would simply not function without them, without their contribution.”\nHe also criticised the approach of the previous government, saying the crisis was “left to grow” and “totally ignored” while carers suffered.\nMatthew said the review announced would deliver long-overdue stability to carers who have faced anxiety over the scandal.\nClosing his speech, Matthew expressed hope that carers would “feel valued and listened to” and that “the issues they feel are important are brought to light”. He said: “I welcome today’s announcement and hope that with it, our brilliant carers know that this is a government that is on their side.”\nMatthew Patrick MP has today (Monday 7th October) paid tribute to the families of hostages for “the dignity, the courage and the love” they’ve shown.\nThe Member for Wirral West asked a question of the Prime Minister following his statement in the House of Commons marking the one-year anniversary of the 7th October attacks.\nMatthew spoke of the collective grief felt across the Jewish community on the anniversary of Hamas’ attacks, and paid tribute to the loved ones of Israeli hostages for their efforts to bring them home.\nHe said: “Today, as with so many times in the history of the Jewish people, we are bound in grief and in mourning. Would the Prime Minister assure the Jewish community that we are not alone in that grief?\n“And would he take this opportunity to join me in praising the dignity, the courage and the love shown by the families and friends of the hostages in their efforts to bring them home?”\nIn his response, Prime Minister Keir Starmer immediately made assurances to the Jewish community that they are not alone. He also paid tribute to the families and friends of hostages for sharing their stories.\nKeir Starmer said: “It is incredibly moving to spend any time with [the families of the hostages] and to hear firsthand what they are going through. As I’ve said to them every time I’ve met them, the impact it has I think on anyone listening – the impact it has on me – is profound.”\nWirral Council allocated over £3m as part of Household Support Fund extension.\nMillions of families to be supported with cost-of-living support this winter.\nLocal MP welcomes swift action to support those in need.\nThe Government has TODAY (27 September) announced more than £3 million in cost-of-living support for families on the Wirral.\nLabour’s Secretary of State for Work and Pensions, Liz Kendall, announced earlier this month that the Household Support Fund (HSF) would be extended for a further six months, until 31 March 2025. The scheme provides money to local authorities to deliver essential help to the most vulnerable people in society.\nWirral Council has been given an HSF Grant of £3,049,345.09 as part of a wider package of £421 million being provided to local authorities across England.\nMatthew Patrick, MP for Wirral West, has welcomed the Government’s investment in tackling poverty and ensuring those in the most need across the Wirral are supported. Hesaid: “I’m pleased to see the new Labour government acting swiftly to ensure support is available for those feeling the harsh impacts of the cost-of-living crisis.\n“We are already working hard to deliver change – to eradicate the root causes of poverty and prevent hardship – but I know many people in our community will be relieved to see short-term support continue.\n“If you or anyone you know is struggling this winter, please get in touch with my office or Wirral Council to explore the support available to you.”\nWirral Council previously delivered support to families and pensioners struggling with the cost of living through the HSF, helping with the cost of water and energy, as well as funding community projects, foodbanks, debt support and holiday activities for children.\nMatthew Patrick MP has questioned the Secretary of State for Wales on transport links between Wales and the Wirral.\nHe spoke in the House of Commons during Welsh oral questions on Wednesday 11 September to raise concerns that transport connections are “lagging behind” despite the strong links between Wales and Merseyside. Matthew asked for details on the conversations she’s having across government and with external organisations to deliver better connections for people on both sides of the border.\nSpeaking in the Commons, Matthew said: “Connections between my constituency of Wirral West and Wales are many, they’re deep and they’re valued on both sides of the border. Our transport connections, however, are sadly lagging behind.\n“Could she please set out what conversations she’s having with ministers and stakeholders to improve those connections?”\nIn her response, Secretary of State for Wales Jo Stevens MP shared that she has discussed improving connections between Wales and Merseyside with Transport Secretary Louise Haigh MP.\nStevens said: “I recognise the importance of cross-border travel for people across the region. The UK and Welsh governments are committed to strengthening these connections, which are vital to unlocking economic growth and employment opportunities for people and businesses.”\nShe also recognised the need for enhancements on the Wrexham to Bidston line and committed to working across government to deliver them.\nThank you for the opportunity to deliver my maiden speech in this important debate, Madam Deputy Speaker. The matter of budget responsibility is important to my constituents in Wirral West, because they know the cost of getting it wrong—the cost to public finances, public services and public trust. I know they will support the measures we are introducing.\nMay I congratulate my hon. Friend the Member for Kettering (Rosie Wrighting), my many hon. Friends and hon. Members on making their maiden speeches today? They have been beautiful, telling stories of constituencies and personal journeys. I think there is a theme to many of them—a theme about civility in public life, about ambition for everybody, and about the number of hours of sunshine that each of the various constituencies receives. I will no doubt look that one up.\nI will focus my remarks today on the place and the people who have brought me here. In so doing, I hope to explain why I believe in the power of argument, disagreement and nuance. Hon. Members will know that my constituency is in the Wirral peninsula. What the House might not have realised is that we are quite particular about how you refer to the Wirral—it is never “Wirral” but “the Wirral”, and you are rarely “in it” but, rather, “on it”.\nThe rich history of Wirral West—one of Vikings, James Bond and a Prime Minister—would not be out of place in a Hollywood blockbuster. The Vikings came to the Wirral in 900 AD, and they brought with them their own Parliament, which they called “Things”. That is how one of the most beautiful villages we enjoy, Thingwall, was named. Hon. Members will probably be grateful that I am going to skip forward a few centuries of history to bring us closer to the present day. Daniel Craig—the most recent James Bond and, in my view, the best 007—was brought up, played rugby and went to school in West Kirby and Hoylake, and former Prime Minister Harold Wilson, who did so much for lifelong learning with the Open University and introduced important social reforms, lived in Spital.\nOur past may be worthy of Hollywood, but our present and beautiful natural environment would not be out of place in a David Attenborough documentary. Its physical beauty has been captured by many of the finest photographers, but even they will tell you that there is no substitute for seeing it for yourself—from walking to Hilbre Island and watching as the seals swim through the River Dee, to admiring our golf courses, which are famous for hosting the Open.\nThose people lucky enough to call Wirral West their home are part of what makes it so special. They bring passion to everything they do, and they carry that passion with a warm welcome and great dignity. That passion runs through each of the towns and villages. It is passion for one another and for our area, helping to expand opportunities to everyone. I cannot imagine another place with as many community groups, churches and businesses that work so hard to do such good, including scouts and guides groups, the Royal National Lifeboat Institution, our schools and hospitals, and community hubs such as the Hoole Road hub—so many groups that support all people, whatever the difficulties they face. It is community spirit that has powered us through some difficult times, and I hope that this new Government can help to bring back some hope so that we can look forward to better days.\nWirral West, with its expanded boundaries, has been most recently served by two people: Margaret Greenwood and my hon. Friend the Member for Birkenhead the Member for Birkenhead (Alison McGovern).\nMargaret Greenwood is deeply passionate about our NHS and our environment, and those are two passions that I share. As an MP, Margaret knew that getting our NHS back on its feet is vital so that it can deliver world-leading care. We are fortunate in Wirral West to have two hospitals: Arrowe Park and Clatterbridge. I know the Secretary of State for Health and Social Care is particularly fond of the latter, given the support it gave to his family. I think back to the conversations I had in the election campaign, to the people waiting sometimes years for crucial operations and the stress that that waiting added to their daily lives. I will be thinking of those people as we do the work to turn the NHS around.\nAs Margaret often reminded us, there is no escaping the threat that is climate change. It came up often on the doorstep. People on the Wirral, from teachers to scientists and from environmentalists to parents are worried, like so many, about the threat of climate change. They know that it does not respond to strong rhetoric, borders or weapons. It is only action, joined up with our partners around the world, that will help us to tackle climate change and save the environment. When I see the wind farms off our Wirral shores, I am proud that we can be a home of green energy and green jobs, delivering the bold action that is desperately needed.\nMy other predecessor, who now serves Birkenhead, had a deep impact on my own journey—ambitious for me personally and many people like me, from working-class communities; ambitious for all of us, encouraging us, believing that we too can stand tall in places, even ones as grand as this. I grew up in Birkenhead. It is a wonderful place, but it is not without its struggles. Standing here now is a testament to my hon. Friend and to her encouragement and ambition for people like me. She will know that, as proud as we rightly are, some people from ordinary backgrounds can fulfil their ambitions, but it is still only some people, and there is much more that we must do. I will not rest until some people having opportunity becomes everybody having opportunity. The enormity of that task is matched only by its importance. It would be daunting, but for the fact that I know I am not alone in that mission. I am proud to stand alongside my hon. Friend the Member for Birkenhead and all of my hon. Friends in this great task.\nThe Wirral has had many politicians who have made an important contribution to public life. They include my hon. Friend the Member for Wallasey (Dame Angela Eagle) and her championing of women and the LGBT community, and Baron Hunt of Wirral, although Members will realise that I think it should be Baron Hunt of the Wirral, but I will come back to that. He comes from a different tradition from me but he has served people in this country with bravery and distinction. And of course, there was Frank Field, who we sadly lost earlier this year.\nFrank was a dear friend of mine, and I miss him terribly. He was the first MP I met. He was interested in what everyone had to say, and as hon. Members across the House may know from personal experience, he was quite interested in disagreement, too. He was fascinated when what you had to say differed from his own views, and it was Frank who taught me that disagreement did not need to be tolerated in politics but rather to be sought out and embraced. He taught me that, if you believe in something, you should feel free to say it, and that as long as you do so with reason, respect and humility, you should enjoy the consideration of others. Because we cannot reward the absolutists. Those who know everything with total certainty are, I think, the people we should most fear.\nI am conscious, standing here, of the responsibility placed on me to represent the interests and people of Wirral West, and I will do that fiercely. I am deeply aware that representation is as much about listening as it is about speaking. The most interesting and informative conversations that I had on the election campaign were with people who disagreed with me. I learned much from them. In this House, while I bring from my career expertise in local government and economic policy, which I hope will benefit others, I intend to tap into the accumulated knowledge of hon. Members from all sides of the House. There has not been enough listening in our politics of late, and I believe that, if we are to restore faith in this House, which I believe we must, listening to our constituents and to one another is a vital step.\nFrank and I spoke often about a whole range of issues and, even towards the end of his extraordinary life, he maintained a fascination with politics, with what it could do for people and with the disagreements that lay at its heart. A small part of his enormous legacy will be these three commitments that I make to this House. My commitment is to listen in good faith to arguments made in good faith. My commitment is to change my mind when it is right to do so. And my commitment is to stand up for the things that I believe in, so that others might do the same. That is what Frank would have expected, it is what the people of Wirral West rightly expect and it is what this House and our politics deserve.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_02_25_matthew-supports-increase-in-defence-spending/content_18.html": "I welcome the Prime Minister’s announcement today that defence spending will increase to 2.5% in this Parliament.\nInternationally, this solidifies our government’s commitment to defending our values abroad.\nAt home, we can make this an opportunity for British businesses to be at the very heart of our nation’s security.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_assisted-dying/content_24.html": "Thank you to everyone who came to the discussion I hosted about assisted dying in Hoylake yesterday.\nIt’s an emotive subject, and people shared powerful, personal stories and perspectives. The discussion drew on the deep expertise of people in Wirral West, and, in our best traditions, was reasonable and thoughtful.\nIf you’re a constituent and would like to share your views with me, please email my office to share your perspective.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_01_09_vawg-debate/content_13.html": "Speaking in a debate in the House of Commons (6 January 2025), Matthew outlined the need for economic abuse to be a central part of the Government’s strategy to halve violence against women and girls (VAWG) in a decade.\nHe highlighted the work of Citizens Advice Wirral in supporting victim-survivors of domestic abuse on the Wirral, and the charity Surviving Economic Abuse for their pioneering support and research on economic abuse.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_10_31_budget-2024/content_8.html": "Matthew Patrick MP has described yesterday’s (30 October) Budget as a “game changer” which will “bring back hope” and deliver “a Britain we can be proud of again”.\nThe Chancellor of the Exchequer, Rachel Reeves, delivered Labour’s first Budget for 14 years, announcing a range of measures which would “fix the foundations and deliver change”.\nThe Budget announced an extra c£25.6billion over two years for the NHS, to cut waiting times with 40,000 extra elective appointments a week, and build capacity for more than 30,000 additional procedures.\nWelcoming the announcement, Matthew said: “That is not just a good health policy; it is a policy that will make Britain stronger, happier and ready to take on the challenges coming our way.\n“I do not want to be faced with more stories of my constituents waiting years for important operations. I have heard enough of those heartbreaking stories to last me a lifetime—stress upon stress, costing jobs and crushing hope.”\nThe Chancellor also announced the tripling of funding for free breakfast clubs in primary schools to £30 million, alongside an increase to the Core Schools Budget by £2.3bn next year to support the recruitment of 6,500 teachers. The Budget also included an announcement of an additional £1 billion uplift for SEND and alternative provision funding.\nMatthew said this would deliver “real hope” and added: “I cannot wait until we open those breakfast clubs in Wirral West, to expand opportunities for parents and kids alike.”\nMatthew praised the new Government’s approach, saying the Chancellor has “opened up Britain’s future once again” through policies which will invest in public services, including the NHS and state schools.\nHe said: “Our investment will mean more opportunities, better pay, and public services that are there when people need them—a Britain we can be proud of again.\n“The Government are making long-term decisions so that we can look back on a decade of expanding opportunities and rising standards, not another decade of shameful decline, which the country, and working people, cannot afford.”\nThe Chancellor also announced an increase to the National Living Wage (NLW) of 6.7% to £12.21 per hour for full time workers on the NLW – worth up to £1,400 for a full-time worker. This will mean a pay increase for around 7,700 people living on the Wirral.\nFollowing the announcement of a review into the Carers Allowance overpayment scandal earlier in the month, the Chancellor also used the Budget to announce an increase to the Carer’s Allowance Weekly Earnings Limit from £151 to £196 per week. The Treasury estimates this will allow over 60,000 more carers to access Carer’s Allowance.\nFunding was also allocated to compensate victims of the Post Office Horizon scandal (c£2 billion) and the Infected Blood scandal (£11.8 billion), the costs of which had not been fully accounted for by the previous government.\nClosing his speech in the House, Matthew said: “This Budget protects working people, invests in our NHS and rebuilds the foundations for Britain’s future.\n“More of the same simply was not an option; hope was on the ballot in July, and this Budget brings back hope.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_03_21_sg-question-rape-sexual-offences/content_29.html": "Highlighting the case of a constituent, who is a victim-survivor of rape, Matthew emphasised the need for swift justice, which has sadly not been the case for far too long.\nThe Government is serious about halving the rate of violence against women and girls, but it must be equally serious about tackling the unacceptable delays in the criminal justice system which are failing women and girls.\nMatthew has committed to monitoring progress on the enhanced partnership between Merseyside Police and the CPS to ensure victim-survivors can have their cases heard.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_01_16_matthew-clear-nhs-backlog/content_26.html": "Patients in Wirral West will be able to access more appointments closer to home and get the treatment they need faster with Labour’s plan to tackle hospital backlogs.\n- Hundreds of thousands more appointments in the North West to be created through plan to get people the treatment they need quicker.\n- Patients in Wirral West to feel the impact of greater patient choice over follow-up care as part of a drive to open-up one million appointments, alongside better use of tech and other action to save another million missed appointments.\n- Reforms mark next step in delivering government’s Plan for Change to deliver for working people.\nPatients in Wirral West will be able to access more appointments closer to home and get the treatment they need faster under a new plan to tackle hospital backlogs set out by the Prime Minister last week (6 January).\nIn the North West there are 1,063,560 cases on waiting lists at huge cost to their health.\nTackling the 7.5million strong waiting list inherited from the Tories so that the NHS once again meets the 18-week standard for planned treatment is a key milestone in the Government’s Plan for Change. Restoring this standard will mean patients in Wirral West no longer have to have their lives put on hold.\nCurrently, too many patients face long waits for appointments or surgeries and may be referred to hospitals they don’t choose at inconvenient times, while appointments and staff time are being lost to inefficiencies or inconsistencies in care. In the Cheshire and Merseyside Integrated Care Board area, which covers Wirral West, there are 367,350 cases on waiting lists, with 158,156 waiting more than 18 weeks for treatment.\nThe Labour Government’s Elective Reform Plan, published by NHS England, sets out a whole system approach to hitting the 18-week referral to treatment target by the end of this Parliament. This includes opening Community Diagnostic Centres on evenings and weekends so that many more people will be able to access tests and checks while going about their daily lives. The NHS will also increase the number of surgical hubs, which help protect planned care from the impact of seasonal and other pressures.\nThe plan will drive forward progress on the Government’s first steps commitment to deliver 2 million extra appointments in its first year, equivalent to 40,000 every week. The reforms will put patients first, harness technology to support staff and help the NHS to do things more efficiently.\nUnder the plan, 65% of patients will be treated within 18 weeks by the end of next year. Based on the size of the current waiting list, that would mean a fall of more than 450k people waiting more than 18 weeks for treatment.\nPrime Minister Keir Starmer said:\n“This Government promised change and that is what I am fighting every day to deliver.\n“NHS backlogs have ballooned in recent years, leaving millions of patients languishing on waiting lists, often in pain or fear. Lives on hold. Potential unfulfilled.\n“This elective reform plan will deliver on our promise to end the backlogs. Millions more appointments. Greater choice and convenience for patients. Staff once again able to give the standard of care they desperately want to.\n“This is a key plank of our Plan for Change, which will drive growth that puts more money in people’s pockets, secures our borders and makes the NHS fit for the future so what working people live longer, healthier, more prosperous lives.”\nMatthew Patrick, MP for Wirral West, said: “Hundreds of residents in Wirral West are stuck on the record long waiting lists inherited by the Labour Government at huge cost to their health.\n“Whenever I’m out in our community, people tell me about the need to get the NHS back on track, and of their experience of a system left to decline under the Conservatives.\n“We are getting on with the job of delivering. That’s why I welcome the reforms announced by the Prime Minister to cut NHS waiting times from 18 months to 18 weeks. It will make such a huge difference.\n“With so many people waiting for treatment, it is more urgent than ever that we reform our NHS so it will always be there for you when you need it.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_defence/content_19.html": "I welcome the Prime Minister’s announcement today that defence spending will increase to 2.5% in this Parliament.\nInternationally, this solidifies our government’s commitment to defending our values abroad.\nAt home, we can make this an opportunity for British businesses to be at the very heart of our nation’s security.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk/content_1.html": "Politics can change lives. Done well, it helps people to do more of the things they love and are passionate about.\nIt protects that which needs protecting, supports those that need supporting, and fights for everyone – without fear or favour.\nI stood to be our MP because we need that change.\nThe things that make the Wirral such an amazing place – the creativity, community and our beautiful natural spaces – are all still here.\nBut for too many of us, it’s a struggle. I don’t know anybody who isn’t finding ways to cut costs. As our MP, my top priority is to tackle the cost of living crisis.\nWe’re lucky to have some of the best specialist NHS hospitals in the country. But, the brilliant staff who work across our NHS are being let down. Waiting times are too long. The NHS must be fit and strong for current and future generations. Working with the NHS, embracing technology and focusing on early intervention is key. As our MP, I’ll champion this approach.\nUnsuitable development, not right and not welcome, has threatened our Greenbelt. The community has stopped it and we must be ready to stop it again. As our MP, I will back the Council’s brownfield first position. We need to get building houses, but in the wrong place or without the accompanying infrastructure (schools, doctors, dentists), it would cause more problems than it solves.\nMatthew",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_westminster/content_21.html": "Highlighting the case of a constituent, who is a victim-survivor of rape, Matthew emphasised the need for swift justice, which has sadly not been the case for far too long.\nThe Government is serious about halving the rate of violence against women and girls, but it must be equally serious about tackling the unacceptable delays in the criminal justice system which are failing women and girls.\nMatthew has committed to monitoring progress on the enhanced partnership between Merseyside Police and the CPS to ensure victim-survivors can have their cases heard.\nMatthew highlighted how imperative it is that the ceasefire in the Middle East holds.\nHe raised the plight of the 59 remaining hostages and their families who have lived through hell for more than 530 days, and the people of Gaza who desperately need aid and security.\nThe Foreign Secretary set out reassurances that Hamas should have no role to play in the future of Palestine’s governance, and that Britain is working hard to support the reform of the Palestinian Authority so the two-state solution can be realised.\nMatthew has today (18 March) asked a question to the Secretary of State for Energy Security and Net Zero.\nHe highlighted that he climate emergency is the challenge of our generation, and the role of Merseyside in meeting that challenge, with pioneering carbon capture and hydrogen technology.\nAs the Energy Secretary set out, people in Wirral West will benefit from the region’s expertise with good jobs and a cleaner future.\nSpeaking in the debate on the New Homes (Solar Panels) Bill, Matthew shared how increasing the use of solar energy will better for the pockets of Wirral West residents, and will be better for the planet.\nSpeaking in a debate in the House of Commons (6 January 2025), Matthew outlined the need for economic abuse to be a central part of the Government’s strategy to halve violence against women and girls (VAWG) in a decade.\nHe highlighted the work of Citizens Advice Wirral in supporting victim-survivors of domestic abuse on the Wirral, and the charity Surviving Economic Abuse for their pioneering support and research on economic abuse.\nThe Government has announced new housing targets in the National Planning Policy Framework (NPPF) in order to tackle the housing crisis in the UK. The announcement comes following Labour’s pledge to build 1.5 million new homes in the next five years. The Government confirmed that brownfield land must be the “first port of call” for development.\nThe housing crisis is impacting many people on the Wirral, with the numbers of people in temporary accommodation in the borough doubling since 2021 and homelessness rising. Temporary accommodation now costs Wirral Council a projected £1.6m a year, up from £406,418 in 2019.\nMatthew Patrick, MP for Wirral West, said that this is “unsustainable” and that “urgent action” was needed to ensure everyone has a safe and secure place to call home.\nIn the House of Commons, Matthew highlighted to the Housing Minister the thousands on waiting lists for housing on the Wirral, and welcomed the Government’s brownfield first approach. He also asked the Minister to confirm the support Wirral Council would get from the Government to ensure that housing was built in the right places.\nFollowing the Government’s statement in the Commons, Matthew said:\n“The housing crisis is impacting many people on the Wirral, with many forced to move away to get onto the property ladder. Urgent action is needed so children can grow up and stay in our area, and families can find affordable places to live.\n“People on the Wirral have been clear that brownfield first is their preference, alongside the desperately-needed regeneration of Wallasey and Birkenhead. I agree and I have taken action on this to deliver the change Wirral voted for at the election. I want to see regeneration and development in areas that need it, and to protect our green spaces.\n“I submitted representations to the NPPF consultation which addressed the need to unlock viable building on brownfield sites, so that we can protect the greenbelt which contributes so much to our lives and our environment here in Wirral West.\n“I also highlighted the risk of speculative planning applications. Developers should not be allowed to refuse to build on brownfield land and speculate on our beautiful countryside while our community is left with empty industrial buildings, shuttered shops, and poor-quality housing.\n“I will continue working with Wirral Council and with other MPs to ensure that affordable, decent homes are built in the right places and that the council has the right support to deliver for local people.”\nMatthew Patrick MP has today (Wednesday 6 November) used a Prime Ministers Question to advocate for survivors of economic abuse.\nMatthew asked the Prime Minister and the Government to work with him to get the credit files of victim-survivors of economic abuse restored.\nCurrently, victim-survivors can suffer lasting consequences of economic abuse perpetrated by a current or former partner long after they’ve fled due to their credit rating being harmed by coerced debts.\nMatthew shared the story of Emily*, a survivor of domestic abuse who was left with a ruined credit file when her abusive ex-partner stopped contributing to their joint mortgage after she fled to safe accommodation for her safety.\nDespite informing her lender of the economic abuse she was experiencing, Emily* has seen lasting damage from the years spent trying to separate herself financially from her perpetrator, having faced issues trying to rent a property, finance a car and take out a mobile phone contract in her own name.\nSpeaking in the House of Commons,Matthew said: “Emily left her ex, but the abuse did not stop.\n“He stayed in their home, cancelled his mortgage contributions and destroyed her credit score.\n“Now, she cannot even take out a mobile phone contract.\n“Surviving Economic Abuse and UK Finance have made progress tackling this problem, but there is more to be done.\n“Would the Prime Minister and his Government work with me to bring in new provisions to restore the credit files of survivors of economic abuse like Emily?”\nResponding, Prime Minister Keir Starmer committed to ending the “national emergency” of economic and domestic abuse. He also assured that Matthew would meet with relevant Ministers to progress his work.\nHe said: “I thank my Honourable Friend for raising this important issue because economic abuse has a devastating impact on victims leaving them vulnerable and isolated.\n“We are committed to ending this national emergency and keeping women safe from domestic abuse, harassment and stalking.\n“That includes £200,000 this year to the charity Surviving Economic Abuse and HMRC have launched an online tool to help charities and business identify and respond to economic abuse.”\nNotes\nEmily* is a pseudonym to protect the survivor’s identity.\nFor more information about economic abuse, or support if you are experiencing or have experienced economic abuse, please visit Surviving Economic Abuse.\nI was pleased to be able to champion the incredible work of Claire House in Parliament last week, and the passion and pride every single member of their team displays.\nFunding must be there for all seriously ill children and their families to ensure they have the support they need, regardless of where they live.\nMatthew Patrick has today (16th October) spoken in Parliament about carers “pushed to breaking point” by the Carer’s Allowance overpayment scandal.\nThe MP for Wirral West shared the experiences of Wirral carers in the House of Commons, many of whom have faced anxiety over the potential financial impact of repayments and the pressures of balancing care work with day-to-day life.\nUnder the previous Conservative government, a large number of carers were made to pay back thousands of pounds over minor or inadvertent breaches of the Carer’s Allowance earnings threshold.\nSecretary of State for Work and Pensions Liz Kendall today announced an independent review into this situation, to be led by former Disability Rights UK chief executive Liz Sayce.\nThe review will investigate how overpayments of Carer’s Allowance have occurred, what can best be done to support those who have accrued them, and how to reduce the risk of these problems occurring in future.\nSpeaking in the House of Commons, Matthew paid tribute to carers in the community and the “selflessness and dedication” they embody.\nHe said: “At times of immense need, they step in. Day after day, supporting family members, making such an important contribution to their loved ones and our community.\n“Our country would simply not function without them, without their contribution.”\nHe also criticised the approach of the previous government, saying the crisis was “left to grow” and “totally ignored” while carers suffered.\nMatthew said the review announced would deliver long-overdue stability to carers who have faced anxiety over the scandal.\nClosing his speech, Matthew expressed hope that carers would “feel valued and listened to” and that “the issues they feel are important are brought to light”. He said: “I welcome today’s announcement and hope that with it, our brilliant carers know that this is a government that is on their side.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_contact/content_35.html": "If you need my help, there are many ways to get in touch. Please note that due to parliamentary protocol, I am only able to help you if you live in Wirral West.\nYou can find out if I am your MP with the button below.\nFor me to help you, I will need the following information:\n- Your full name.\n- Your full postal address in Wirral West including your postcode.\n- A contact telephone number and an email address if you have one.\n- Copies of any supporting documents.\nThe fastest way to get in touch with me at the moment is via email. Please send an email containing the required information outlined above and details of how I can help you to Matthew.Patrick.mp@parliament.uk.\nBooking an Appointment\nIf you would prefer to discuss a matter with me in-person, over the phone, or online, please email Matthew.Patrick.mp@parliament.uk to request an appointment slot. My team will be in touch with details about my surgeries.\nAlternative Contact Details\nIf you would prefer another way to get in touch, you can write to me at my address in the Houses of Parliament:\nMatthew Patrick MP, Houses of Parliament, London SW1A 0AA.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_09_11_transport-wales-and-wirral/content_25.html": "Matthew Patrick MP has questioned the Secretary of State for Wales on transport links between Wales and the Wirral.\nHe spoke in the House of Commons during Welsh oral questions on Wednesday 11 September to raise concerns that transport connections are “lagging behind” despite the strong links between Wales and Merseyside. Matthew asked for details on the conversations she’s having across government and with external organisations to deliver better connections for people on both sides of the border.\nSpeaking in the Commons, Matthew said: “Connections between my constituency of Wirral West and Wales are many, they’re deep and they’re valued on both sides of the border. Our transport connections, however, are sadly lagging behind.\n“Could she please set out what conversations she’s having with ministers and stakeholders to improve those connections?”\nIn her response, Secretary of State for Wales Jo Stevens MP shared that she has discussed improving connections between Wales and Merseyside with Transport Secretary Louise Haigh MP.\nStevens said: “I recognise the importance of cross-border travel for people across the region. The UK and Welsh governments are committed to strengthening these connections, which are vital to unlocking economic growth and employment opportunities for people and businesses.”\nShe also recognised the need for enhancements on the Wrexham to Bidston line and committed to working across government to deliver them.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_07_30_maiden-speech/content_39.html": "Thank you for the opportunity to deliver my maiden speech in this important debate, Madam Deputy Speaker. The matter of budget responsibility is important to my constituents in Wirral West, because they know the cost of getting it wrong—the cost to public finances, public services and public trust. I know they will support the measures we are introducing.\nMay I congratulate my hon. Friend the Member for Kettering (Rosie Wrighting), my many hon. Friends and hon. Members on making their maiden speeches today? They have been beautiful, telling stories of constituencies and personal journeys. I think there is a theme to many of them—a theme about civility in public life, about ambition for everybody, and about the number of hours of sunshine that each of the various constituencies receives. I will no doubt look that one up.\nI will focus my remarks today on the place and the people who have brought me here. In so doing, I hope to explain why I believe in the power of argument, disagreement and nuance. Hon. Members will know that my constituency is in the Wirral peninsula. What the House might not have realised is that we are quite particular about how you refer to the Wirral—it is never “Wirral” but “the Wirral”, and you are rarely “in it” but, rather, “on it”.\nThe rich history of Wirral West—one of Vikings, James Bond and a Prime Minister—would not be out of place in a Hollywood blockbuster. The Vikings came to the Wirral in 900 AD, and they brought with them their own Parliament, which they called “Things”. That is how one of the most beautiful villages we enjoy, Thingwall, was named. Hon. Members will probably be grateful that I am going to skip forward a few centuries of history to bring us closer to the present day. Daniel Craig—the most recent James Bond and, in my view, the best 007—was brought up, played rugby and went to school in West Kirby and Hoylake, and former Prime Minister Harold Wilson, who did so much for lifelong learning with the Open University and introduced important social reforms, lived in Spital.\nOur past may be worthy of Hollywood, but our present and beautiful natural environment would not be out of place in a David Attenborough documentary. Its physical beauty has been captured by many of the finest photographers, but even they will tell you that there is no substitute for seeing it for yourself—from walking to Hilbre Island and watching as the seals swim through the River Dee, to admiring our golf courses, which are famous for hosting the Open.\nThose people lucky enough to call Wirral West their home are part of what makes it so special. They bring passion to everything they do, and they carry that passion with a warm welcome and great dignity. That passion runs through each of the towns and villages. It is passion for one another and for our area, helping to expand opportunities to everyone. I cannot imagine another place with as many community groups, churches and businesses that work so hard to do such good, including scouts and guides groups, the Royal National Lifeboat Institution, our schools and hospitals, and community hubs such as the Hoole Road hub—so many groups that support all people, whatever the difficulties they face. It is community spirit that has powered us through some difficult times, and I hope that this new Government can help to bring back some hope so that we can look forward to better days.\nWirral West, with its expanded boundaries, has been most recently served by two people: Margaret Greenwood and my hon. Friend the Member for Birkenhead the Member for Birkenhead (Alison McGovern).\nMargaret Greenwood is deeply passionate about our NHS and our environment, and those are two passions that I share. As an MP, Margaret knew that getting our NHS back on its feet is vital so that it can deliver world-leading care. We are fortunate in Wirral West to have two hospitals: Arrowe Park and Clatterbridge. I know the Secretary of State for Health and Social Care is particularly fond of the latter, given the support it gave to his family. I think back to the conversations I had in the election campaign, to the people waiting sometimes years for crucial operations and the stress that that waiting added to their daily lives. I will be thinking of those people as we do the work to turn the NHS around.\nAs Margaret often reminded us, there is no escaping the threat that is climate change. It came up often on the doorstep. People on the Wirral, from teachers to scientists and from environmentalists to parents are worried, like so many, about the threat of climate change. They know that it does not respond to strong rhetoric, borders or weapons. It is only action, joined up with our partners around the world, that will help us to tackle climate change and save the environment. When I see the wind farms off our Wirral shores, I am proud that we can be a home of green energy and green jobs, delivering the bold action that is desperately needed.\nMy other predecessor, who now serves Birkenhead, had a deep impact on my own journey—ambitious for me personally and many people like me, from working-class communities; ambitious for all of us, encouraging us, believing that we too can stand tall in places, even ones as grand as this. I grew up in Birkenhead. It is a wonderful place, but it is not without its struggles. Standing here now is a testament to my hon. Friend and to her encouragement and ambition for people like me. She will know that, as proud as we rightly are, some people from ordinary backgrounds can fulfil their ambitions, but it is still only some people, and there is much more that we must do. I will not rest until some people having opportunity becomes everybody having opportunity. The enormity of that task is matched only by its importance. It would be daunting, but for the fact that I know I am not alone in that mission. I am proud to stand alongside my hon. Friend the Member for Birkenhead and all of my hon. Friends in this great task.\nThe Wirral has had many politicians who have made an important contribution to public life. They include my hon. Friend the Member for Wallasey (Dame Angela Eagle) and her championing of women and the LGBT community, and Baron Hunt of Wirral, although Members will realise that I think it should be Baron Hunt of the Wirral, but I will come back to that. He comes from a different tradition from me but he has served people in this country with bravery and distinction. And of course, there was Frank Field, who we sadly lost earlier this year.\nFrank was a dear friend of mine, and I miss him terribly. He was the first MP I met. He was interested in what everyone had to say, and as hon. Members across the House may know from personal experience, he was quite interested in disagreement, too. He was fascinated when what you had to say differed from his own views, and it was Frank who taught me that disagreement did not need to be tolerated in politics but rather to be sought out and embraced. He taught me that, if you believe in something, you should feel free to say it, and that as long as you do so with reason, respect and humility, you should enjoy the consideration of others. Because we cannot reward the absolutists. Those who know everything with total certainty are, I think, the people we should most fear.\nI am conscious, standing here, of the responsibility placed on me to represent the interests and people of Wirral West, and I will do that fiercely. I am deeply aware that representation is as much about listening as it is about speaking. The most interesting and informative conversations that I had on the election campaign were with people who disagreed with me. I learned much from them. In this House, while I bring from my career expertise in local government and economic policy, which I hope will benefit others, I intend to tap into the accumulated knowledge of hon. Members from all sides of the House. There has not been enough listening in our politics of late, and I believe that, if we are to restore faith in this House, which I believe we must, listening to our constituents and to one another is a vital step.\nFrank and I spoke often about a whole range of issues and, even towards the end of his extraordinary life, he maintained a fascination with politics, with what it could do for people and with the disagreements that lay at its heart. A small part of his enormous legacy will be these three commitments that I make to this House. My commitment is to listen in good faith to arguments made in good faith. My commitment is to change my mind when it is right to do so. And my commitment is to stand up for the things that I believe in, so that others might do the same. That is what Frank would have expected, it is what the people of Wirral West rightly expect and it is what this House and our politics deserve.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_category_uncategorized/content_5.html": "Four charities on the Wirral have received a £25,000 donation – split equally four ways – from entertainment company with a social purpose, Omaze, following its recent house draw in the area.\nOmaze was introduced to the four charities by Matthew Patrick MP, Member of Parliament for Wirral West.\nThe beneficiaries of the donation are Tomorrow’s Women, which supports and empowers women experiencing difficulties; Barnstondale – an inclusive outdoor activity centre supporting over 6,000 children each year from all backgrounds; Carrbridge Centre – a community centre on a large housing estate that aims to steer young people towards positive paths and Claire House – a hospice for terminally ill children, helping 500 families per year.\nOmaze recently ran a house draw on the Wirral – in which a five bedroom house worth £3 million – along with £250,000 in cash, was won by a 24-year-old nanny and raised £3.5 million for Scouts.\nTomorrow’s Women in Birkenhead provides targeted support across a range of areas including financial, mental health, domestic abuse, social isolation and substance abuse – and plans to use its £6,250 share to fund staff training for their stalking and harassment programme.\nBarnstondale provides inclusive outdoor experiences for schools, youth groups, and charities. With 25% of visitors having additional needs and 1 in 3 facing financial hardship, our bursary scheme helps those most in need. This £6,250 donation will directly support them, ensuring access to their centre.\nAs there is no youth centre in the area for young people aged over 13 years old, Carrbridge Centre on the Woodchurch, will use the Omaze funding to cover much needed support with its staff. The new funds will provide one “Omaze Youth Active session” per week – for an entire year.\nClaire House Children’s Hospice in Bebington can use the funds to provide a month of ‘Butterfly Care’ which is a place for a family to be with their child after they have passed.\nMatthew Patrick MP, Member of Parliament for Wirral West, said: “Across the Wirral, charities and volunteers contribute so much to our community, providing support and services to those who need it most.\n“It was great to meet with Omaze and introduce them to the four amazing organisations who they’re donating to.\n“The £25,000 donation will make a huge impact for people on the Wirral, keeping important services running and delivering new activities for young people on the Woodchurch.”\nSiobhan Waters, Fundraising and Communications Manager, Barnstondale Centre, said: “We are incredibly grateful to be one of the four charities benefiting from these much-needed funds. Omaze’s support has helped part-fund activity days and residential trips at Barnstondale, creating a life-changing impact – not just for the 55 children who directly benefited, but also for their families, teachers, and communities.\n“The confidence, resilience and teamwork skills they develop at Barnstondale will stay with them for life. Thanks to your generosity, we can continue our mission to ensure no child is left behind, giving more young people the chance to experience the joy of outdoor learning with their friends – creating memories that last a lifetime.”\nNatasha Walker, Omaze, said: “Everyone at Omaze is absolutely delighted we have been able to make a contribution to these four fantastic charities.\n“I was honoured to visit Barnstondale, to meet representatives from all four charities and hear about the incredible people who are providing such vital community services.\n“Omaze will continue to help more local causes in the areas where we host our house draws, wherever possible.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_12_12_matthew-supports-brownfield-development/content_23.html": "The Government has announced new housing targets in the National Planning Policy Framework (NPPF) in order to tackle the housing crisis in the UK. The announcement comes following Labour’s pledge to build 1.5 million new homes in the next five years. The Government confirmed that brownfield land must be the “first port of call” for development.\nThe housing crisis is impacting many people on the Wirral, with the numbers of people in temporary accommodation in the borough doubling since 2021 and homelessness rising. Temporary accommodation now costs Wirral Council a projected £1.6m a year, up from £406,418 in 2019.\nMatthew Patrick, MP for Wirral West, said that this is “unsustainable” and that “urgent action” was needed to ensure everyone has a safe and secure place to call home.\nIn the House of Commons, Matthew highlighted to the Housing Minister the thousands on waiting lists for housing on the Wirral, and welcomed the Government’s brownfield first approach. He also asked the Minister to confirm the support Wirral Council would get from the Government to ensure that housing was built in the right places.\nFollowing the Government’s statement in the Commons, Matthew said:\n“The housing crisis is impacting many people on the Wirral, with many forced to move away to get onto the property ladder. Urgent action is needed so children can grow up and stay in our area, and families can find affordable places to live.\n“People on the Wirral have been clear that brownfield first is their preference, alongside the desperately-needed regeneration of Wallasey and Birkenhead. I agree and I have taken action on this to deliver the change Wirral voted for at the election. I want to see regeneration and development in areas that need it, and to protect our green spaces.\n“I submitted representations to the NPPF consultation which addressed the need to unlock viable building on brownfield sites, so that we can protect the greenbelt which contributes so much to our lives and our environment here in Wirral West.\n“I also highlighted the risk of speculative planning applications. Developers should not be allowed to refuse to build on brownfield land and speculate on our beautiful countryside while our community is left with empty industrial buildings, shuttered shops, and poor-quality housing.\n“I will continue working with Wirral Council and with other MPs to ensure that affordable, decent homes are built in the right places and that the council has the right support to deliver for local people.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_vawg/content_30.html": "Speaking in a debate in the House of Commons (6 January 2025), Matthew outlined the need for economic abuse to be a central part of the Government’s strategy to halve violence against women and girls (VAWG) in a decade.\nHe highlighted the work of Citizens Advice Wirral in supporting victim-survivors of domestic abuse on the Wirral, and the charity Surviving Economic Abuse for their pioneering support and research on economic abuse.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_10_07_hostage-families-oct-7/content_28.html": "Matthew Patrick MP has today (Monday 7th October) paid tribute to the families of hostages for “the dignity, the courage and the love” they’ve shown.\nThe Member for Wirral West asked a question of the Prime Minister following his statement in the House of Commons marking the one-year anniversary of the 7th October attacks.\nMatthew spoke of the collective grief felt across the Jewish community on the anniversary of Hamas’ attacks, and paid tribute to the loved ones of Israeli hostages for their efforts to bring them home.\nHe said: “Today, as with so many times in the history of the Jewish people, we are bound in grief and in mourning. Would the Prime Minister assure the Jewish community that we are not alone in that grief?\n“And would he take this opportunity to join me in praising the dignity, the courage and the love shown by the families and friends of the hostages in their efforts to bring them home?”\nIn his response, Prime Minister Keir Starmer immediately made assurances to the Jewish community that they are not alone. He also paid tribute to the families and friends of hostages for sharing their stories.\nKeir Starmer said: “It is incredibly moving to spend any time with [the families of the hostages] and to hear firsthand what they are going through. As I’ve said to them every time I’ve met them, the impact it has I think on anyone listening – the impact it has on me – is profound.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_tag_desnz/content_22.html": "Matthew has today (18 March) asked a question to the Secretary of State for Energy Security and Net Zero.\nHe highlighted that he climate emergency is the challenge of our generation, and the role of Merseyside in meeting that challenge, with pioneering carbon capture and hydrogen technology.\nAs the Energy Secretary set out, people in Wirral West will benefit from the region’s expertise with good jobs and a cleaner future.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_03_18_desnz-question-18mar/content_41.html": "Matthew has today (18 March) asked a question to the Secretary of State for Energy Security and Net Zero.\nHe highlighted that he climate emergency is the challenge of our generation, and the role of Merseyside in meeting that challenge, with pioneering carbon capture and hydrogen technology.\nAs the Energy Secretary set out, people in Wirral West will benefit from the region’s expertise with good jobs and a cleaner future.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_09_27_household-support-fund/content_32.html": "- Wirral Council allocated over £3m as part of Household Support Fund extension.\n- Millions of families to be supported with cost-of-living support this winter.\n- Local MP welcomes swift action to support those in need.\nThe Government has TODAY (27 September) announced more than £3 million in cost-of-living support for families on the Wirral.\nLabour’s Secretary of State for Work and Pensions, Liz Kendall, announced earlier this month that the Household Support Fund (HSF) would be extended for a further six months, until 31 March 2025. The scheme provides money to local authorities to deliver essential help to the most vulnerable people in society.\nWirral Council has been given an HSF Grant of £3,049,345.09 as part of a wider package of £421 million being provided to local authorities across England.\nMatthew Patrick, MP for Wirral West, has welcomed the Government’s investment in tackling poverty and ensuring those in the most need across the Wirral are supported. He said: “I’m pleased to see the new Labour government acting swiftly to ensure support is available for those feeling the harsh impacts of the cost-of-living crisis.\n“We are already working hard to deliver change – to eradicate the root causes of poverty and prevent hardship – but I know many people in our community will be relieved to see short-term support continue.\n“If you or anyone you know is struggling this winter, please get in touch with my office or Wirral Council to explore the support available to you.”\nWirral Council previously delivered support to families and pensioners struggling with the cost of living through the HSF, helping with the cost of water and energy, as well as funding community projects, foodbanks, debt support and holiday activities for children.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2025_04_04_omaze-charity-donation/content_7.html": "Four charities on the Wirral have received a £25,000 donation – split equally four ways – from entertainment company with a social purpose, Omaze, following its recent house draw in the area.\nOmaze was introduced to the four charities by Matthew Patrick MP, Member of Parliament for Wirral West.\nThe beneficiaries of the donation are Tomorrow’s Women, which supports and empowers women experiencing difficulties; Barnstondale – an inclusive outdoor activity centre supporting over 6,000 children each year from all backgrounds; Carrbridge Centre – a community centre on a large housing estate that aims to steer young people towards positive paths and Claire House – a hospice for terminally ill children, helping 500 families per year.\nOmaze recently ran a house draw on the Wirral – in which a five bedroom house worth £3 million – along with £250,000 in cash, was won by a 24-year-old nanny and raised £3.5 million for Scouts.\nTomorrow’s Women in Birkenhead provides targeted support across a range of areas including financial, mental health, domestic abuse, social isolation and substance abuse – and plans to use its £6,250 share to fund staff training for their stalking and harassment programme.\nBarnstondale provides inclusive outdoor experiences for schools, youth groups, and charities. With 25% of visitors having additional needs and 1 in 3 facing financial hardship, our bursary scheme helps those most in need. This £6,250 donation will directly support them, ensuring access to their centre.\nAs there is no youth centre in the area for young people aged over 13 years old, Carrbridge Centre on the Woodchurch, will use the Omaze funding to cover much needed support with its staff. The new funds will provide one “Omaze Youth Active session” per week – for an entire year.\nClaire House Children’s Hospice in Bebington can use the funds to provide a month of ‘Butterfly Care’ which is a place for a family to be with their child after they have passed.\nMatthew Patrick MP, Member of Parliament for Wirral West, said: “Across the Wirral, charities and volunteers contribute so much to our community, providing support and services to those who need it most.\n“It was great to meet with Omaze and introduce them to the four amazing organisations who they’re donating to.\n“The £25,000 donation will make a huge impact for people on the Wirral, keeping important services running and delivering new activities for young people on the Woodchurch.”\nSiobhan Waters, Fundraising and Communications Manager, Barnstondale Centre, said: “We are incredibly grateful to be one of the four charities benefiting from these much-needed funds. Omaze’s support has helped part-fund activity days and residential trips at Barnstondale, creating a life-changing impact – not just for the 55 children who directly benefited, but also for their families, teachers, and communities.\n“The confidence, resilience and teamwork skills they develop at Barnstondale will stay with them for life. Thanks to your generosity, we can continue our mission to ensure no child is left behind, giving more young people the chance to experience the joy of outdoor learning with their friends – creating memories that last a lifetime.”\nNatasha Walker, Omaze, said: “Everyone at Omaze is absolutely delighted we have been able to make a contribution to these four fantastic charities.\n“I was honoured to visit Barnstondale, to meet representatives from all four charities and hear about the incredible people who are providing such vital community services.\n“Omaze will continue to help more local causes in the areas where we host our house draws, wherever possible.”",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_privacy-policy/content_3.html": "We respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\n1. WHO WE ARE AND HOW TO CONTACT US\nMatthew Patrick for Wirral West is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at matthew.patrick.mp@parliament.uk.\n2. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\n- your use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a supporter of Matthew Patrick for Wirral West (the Campaign)).\nBy collecting such data, we will be able to inform you about relevant developments that relate to the Campaign and what you can do to help the Campaign as it progresses.\nIn order to advance the Campaign, we may share your data with other campaigns and movements that share the values, principles and aims of Matthew Patrick for Wirral West (including, but not limited, to other Labour Party elections) and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place. You can find the Labour Party’s privacy policy here.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n3. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\n- identity data, including first name, maiden name, last name, username or similar identifier, marital status, title, date of birth and/or gender;\n- contact data, including address, email address and/or telephone number(s);\n- financial data, including bank account and payment card details;\n- transaction data, including details about payments to and from you and other details of products and services you have purchased from us;\n- technical data, including internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website and platforms hosting our content;\n- profile data, including your username, your interests, preferences, feedback and/or survey responses;\n- usage data, including information about how you use our website; and/or\n- marketing and communications data, including your preferences in receiving content and/or marketing from us and your communication preferences.\nWe also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n4. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\nProvided by you – directly\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\nThis also includes personal data you provide when you register as a supporter of the Campaign, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\n5. HOW WE USE YOUR PERSONAL DATA\nWe will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\n- Register you as a supporter of Matthew Patrick for Wirral West Campaign;\n- Inform and engage you about the Campaign;\n- Inform and engage you with any other campaigns and movements that share the values, principles and aims of Matthew Patrick for Wirral West (including, but not limited, to other Labour Party elections);\n- Manage donations, payments, fees and/or charges;\n- Comply with our legal obligations; and/or\n- Answer your queries and respond to your questions and/or complaints.\nThe legal bases\n- Where you have specifically consented to a particular use of your data (such as where you have subscribed to receive information about Matthew Patrick for Wirral West campaign);\n- Where you have entered into a legal agreement with us that necessitates that particular use of your data (such as where you make a payment or donation to us);\n- Where it is a necessary lawful basis for our legitimate interests and your interests and fundamental rights do not override those interests; or\n- Where we are obliged to process your data in a particular way by law (for example, if we are required to notify any authority or regulator of the nature or value of your donations).\n6. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\n- To enable transfers to take place (where appropriate);\n- Where we need to comply with a legal obligation; and/or\n- With suppliers who act as our ‘data processors’ and who provide the means of processing financial transactions including, but not limited to Matthew Patrick for Wirral West/The Labour Party, Stripe, PayPal and others.\n7. WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nYou will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\nRight to object/Opting-out\nYou can ask us to stop sending you marketing messages at any time by contacting us at matthew.patrick.mp@parliament.uk.\nYou have a right to opt-out of your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nWhere you opt-out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagement or transactions with us (so, for example, if you opt-out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\n8. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\nOur service providers may use cookies and those cookies may be stored on your computer when you visit our website.\n9. CHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n10. CHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n11. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n12. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n13. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n14. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n15. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them.\nRight of access\nYou may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\nWe follow the ICO’s “Subject Access Code of Practice” when dealing with requests for access to personal data. You can read this code by visiting https://ico.org.uk/media/for-organisations/documents/2014223/subject-access-code-of-practice.pdf.\nPlease note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\nYou can exercise this right at any time by contacting us at matthew.patrick.mp@parliament.uk and telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request.\nYour right to rectification and erasure\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (you may have heard of this right described as the “right to be forgotten“).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\nYou can exercise this right at any time by contacting us at matthew.patrick.mp@parliament.uk and telling us that you are making a request to have your personal data rectified or erased and on what basis you are making that request. If you want us to replace inaccurate data with new data, you should tell us what that new data is. You do not have to fill in a specific form to make this kind of request.\nYour right to restrict processing\nWhere we process your personal data on the basis of a legitimate interest (see the sections of this privacy policy which explain how and why we use your information), you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data: (a) if you dispute the accuracy of that personal data and want us to verify that data’s accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; or (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nPlease note that if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it. You can exercise this right at any time by contacting us at matthew.patrick.mp@parliament.uk and telling us that you are making a request to have us stop processing the relevant aspect of your personal data and describing which of the above conditions you believe is relevant to that request. You do not have to fill in a specific form to make this kind of request.\nYour right to portability\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nBecause of the kind of the nature of our work do and the systems that we use, we do not envisage this right being particularly relevant to the majority of individuals with whom we interact. However, if you wish to transfer your data from us to a third party, we are happy to consider such requests in good faith.\nYour right to stop receiving communications\nAs noted above, where we send you email marketing communications (or other regulated electronic messages) you have the right to opt-out at any time. You can do this by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications).\nAlternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at matthew.patrick.mp@parliament.uk and telling us which communications you would like us to stop sending you.\nYour right to object to automated decision making and profiling\nYou have the right to be informed about the existence of any automated decision making and profiling of your personal data, and where appropriate, be provided with meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing that affects you.\nExercising your rights\nWhen you write to us making a request to exercise your rights, we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help us to verify your identity. This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be, the faster and more efficiently we can deal with your request. If you do not provide us with sufficient information, then we may delay actioning your request until you have provided us with additional information (and where this is the case, we will tell you).\nYou will not usually have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.\nWe try to respond to all legitimate requests within one (1) month. However, it could take us longer than a month if your request is particularly complex or if you have made a number of requests. In this case, we will notify you of this and keep you updated.\n16. RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nThe contact details for the ICO are:\n- Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n- Telephone: 0303 123 1113\n- Website: https://ico.org.uk/concerns/",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_2024_11_06_economic-abuse-pmq/content_11.html": "Matthew Patrick MP has today (Wednesday 6 November) used a Prime Ministers Question to advocate for survivors of economic abuse.\nMatthew asked the Prime Minister and the Government to work with him to get the credit files of victim-survivors of economic abuse restored.\nCurrently, victim-survivors can suffer lasting consequences of economic abuse perpetrated by a current or former partner long after they’ve fled due to their credit rating being harmed by coerced debts.\nMatthew shared the story of Emily*, a survivor of domestic abuse who was left with a ruined credit file when her abusive ex-partner stopped contributing to their joint mortgage after she fled to safe accommodation for her safety.\nDespite informing her lender of the economic abuse she was experiencing, Emily* has seen lasting damage from the years spent trying to separate herself financially from her perpetrator, having faced issues trying to rent a property, finance a car and take out a mobile phone contract in her own name.\nSpeaking in the House of Commons, Matthew said: “Emily left her ex, but the abuse did not stop.\n“He stayed in their home, cancelled his mortgage contributions and destroyed her credit score.\n“Now, she cannot even take out a mobile phone contract.\n“Surviving Economic Abuse and UK Finance have made progress tackling this problem, but there is more to be done.\n“Would the Prime Minister and his Government work with me to bring in new provisions to restore the credit files of survivors of economic abuse like Emily?”\nResponding, Prime Minister Keir Starmer committed to ending the “national emergency” of economic and domestic abuse. He also assured that Matthew would meet with relevant Ministers to progress his work.\nHe said: “I thank my Honourable Friend for raising this important issue because economic abuse has a devastating impact on victims leaving them vulnerable and isolated.\n“We are committed to ending this national emergency and keeping women safe from domestic abuse, harassment and stalking.\n“That includes £200,000 this year to the charity Surviving Economic Abuse and HMRC have launched an online tool to help charities and business identify and respond to economic abuse.”\nNotes\n- Emily* is a pseudonym to protect the survivor’s identity.\n- For more information about economic abuse, or support if you are experiencing or have experienced economic abuse, please visit Surviving Economic Abuse.",
  "https_matthewpatrick_co_uk_/https_matthewpatrick_co_uk_author_mattpatrick8/content_20.html": "Four charities on the Wirral have received a £25,000 donation – split equally four ways – from entertainment company with a social purpose, Omaze, following its recent house draw in the area.\nOmaze was introduced to the four charities by Matthew Patrick MP, Member of Parliament for Wirral West.\nThe beneficiaries of the donation are Tomorrow’s Women, which supports and empowers women experiencing difficulties; Barnstondale – an inclusive outdoor activity centre supporting over 6,000 children each year from all backgrounds; Carrbridge Centre – a community centre on a large housing estate that aims to steer young people towards positive paths and Claire House – a hospice for terminally ill children, helping 500 families per year.\nOmaze recently ran a house draw on the Wirral – in which a five bedroom house worth £3 million – along with £250,000 in cash, was won by a 24-year-old nanny and raised £3.5 million for Scouts.\nTomorrow’s Women in Birkenhead provides targeted support across a range of areas including financial, mental health, domestic abuse, social isolation and substance abuse – and plans to use its £6,250 share to fund staff training for their stalking and harassment programme.\nBarnstondale provides inclusive outdoor experiences for schools, youth groups, and charities. With 25% of visitors having additional needs and 1 in 3 facing financial hardship, our bursary scheme helps those most in need. This £6,250 donation will directly support them, ensuring access to their centre.\nAs there is no youth centre in the area for young people aged over 13 years old, Carrbridge Centre on the Woodchurch, will use the Omaze funding to cover much needed support with its staff. The new funds will provide one “Omaze Youth Active session” per week – for an entire year.\nClaire House Children’s Hospice in Bebington can use the funds to provide a month of ‘Butterfly Care’ which is a place for a family to be with their child after they have passed.\nMatthew Patrick MP, Member of Parliament for Wirral West, said: “Across the Wirral, charities and volunteers contribute so much to our community, providing support and services to those who need it most.\n“It was great to meet with Omaze and introduce them to the four amazing organisations who they’re donating to.\n“The £25,000 donation will make a huge impact for people on the Wirral, keeping important services running and delivering new activities for young people on the Woodchurch.”\nSiobhan Waters, Fundraising and Communications Manager, Barnstondale Centre, said: “We are incredibly grateful to be one of the four charities benefiting from these much-needed funds. Omaze’s support has helped part-fund activity days and residential trips at Barnstondale, creating a life-changing impact – not just for the 55 children who directly benefited, but also for their families, teachers, and communities.\n“The confidence, resilience and teamwork skills they develop at Barnstondale will stay with them for life. Thanks to your generosity, we can continue our mission to ensure no child is left behind, giving more young people the chance to experience the joy of outdoor learning with their friends – creating memories that last a lifetime.”\nNatasha Walker, Omaze, said: “Everyone at Omaze is absolutely delighted we have been able to make a contribution to these four fantastic charities.\n“I was honoured to visit Barnstondale, to meet representatives from all four charities and hear about the incredible people who are providing such vital community services.\n“Omaze will continue to help more local causes in the areas where we host our house draws, wherever possible.”"
}