{
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_about-karen/content_3.html": "Karen was born in the Moorlands and spent her early years in Cheddleton. She moved to nearby Buxton, when her parents took over the family business, the Queens Head Hotel – growing up over the pub gave her a unique introduction to people from all walks of life.\nKaren attended her local comprehensive, Buxton Girls School, before going on to gain a BSc in Maths from Imperial College London.\nAfter university she qualified as both a Chartered Accountant and Chartered Tax Adviser and spent nearly 20 years in business, working as an accountant for two of the major accounting firms and with a spell as a self-employed tax and economics consultant. Karen has advised businesses of all types from multi-national electronics companies to small farms, and on issues from tax to commercial strategy, and she brings this real-world understanding to bear in economic and growth policy.\nKaren well and truly caught the politics bug when she acted as an independent technical adviser to the Shadow Treasury Team and she saw the potential to make a positive difference to society in Parliament, and she threw herself into active campaigning.\nKaren worked in the Conservative Policy Unit before the 2005 General Election helping to develop economic and fiscal policies, particularly those aimed at removing unnecessary regulation and red tape. She fought the Parliamentary seat of Manchester Withington in 2005.\nKaren was selected for her home seat of Staffordshire Moorlands in July 2006 and was returned as the Member of Parliament at the General Election on 6th May 2010, with a majority of 6,689; a swing of 5.7% from Labour.\nKaren has contributed to several reports for think tanks helping to develop social and fiscal policy including Iain Duncan Smith’s key report on Breakthrough Britain for the Centre for Social Justice. She is the co-author of Little Britons: Financing Childcare Choice for Policy Exchange, and of Turbo-Charging Growth for the Centre for Policy Studies.\nShortly after she entered the House of Commons Karen was elected to the Select Committee on Work and Pensions and later to the Procedure Select Committee. She relinquished both these positions when she was appointed as a Minister in the Government Whips office in October 2012. In October 2013 Karen was promoted to be a Lord Commissioner of HM Treasury, as senior Whip. In February 2014 she became Minister for Modern Slavery and Organised Crime at the Home Office. She brought in the Serious Crime Act to help protect people in the UK from organised crime and just before Parliament was dissolved in March 2015 Karen secured the passing of the Modern Slavery Act. This is a landmark piece of legislation that will protect people from the evil of slavery today.\nOn 7th May 2015 Karen was re-elected as the MP for Staffordshire Moorlands with an increased majority of 10,174 and with 51% of the vote. Karen's vote increased by 6% compared with a national increase in the Conservative vote of 1%.\nAfter the election Karen was reappointed to the Home Office, becoming Minister for Preventing Abuse, Exploitation and Crime. Karen was promoted to Secretary of State for Digital, Culture Media and Sport in the Government reshuffle on 14th July 2016.\nKaren lives in Leek with her husband and two children. When she is not campaigning for the people of Staffordshire Moorlands or looking after the kids, Karen enjoys walking in the beautiful Staffordshire Peak District or experimenting with new recipes.\nKaren served as the MP for Staffordshire Moorlands from 8th June 2017 until 6th November 2019.\nShe continued in her role as Secretary of State for Digital, Culture, Media and Sport until 8th January 2018. She was then honoured to serve as Secretary of State for Northern Ireland, from 8th January 2018 to 24th July 2019.\nKaren was proud to stand as the Conservative Parliamentary Candidate for Staffordshire Moorlands in the General Election on 12th December 2019 and to be re-elected as MP for Staffordshire Moorlands with an increased majority.\nIn February 2020 Karen was proud to be elected Chair of the House of Commons Procedure Committee. She is also Co-Chair of the All Party Parliamentary Group on Human Trafficking and Modern Slavery and Chair of the APPG on Challenger Banks and Building Societies.\nKaren served as the MP for Staffordshire Moorlands from 12th December 2019 until 29th May 2024.\nKaren was honoured to be re-elected as the Member of Parliament for the Staffordshire Moorlands constituency on 4th July 2024. In September Karen was elected as Chair of the Home Affairs Select Committee, a cross-party committee of MPs responsible for scrutinising the work of the Home Office and its associated bodies.",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_contact/content_6.html": "If you are a resident of Staffordshire Moorlands please use the form below to get in touch with Karen. Information you provide on this form will be used by Dame Karen Bradley MP who will be the data controller for this data, for the purposes of assisting with the matter you have raised. The information will be processed in accordance with our privacy policy, which you can view on Karen's website.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_cookies/content_8.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_campaigns_helping-combat-loneliness-and-isolation/content_5.html": "Karen pledges to keep up her positive action on loneliness and isolation.\nHer hugely popular Senior Tea Dances and Pensioners' Information and Advice Fairs, the 'Beyond the Front Door' Conference and Loneliness Directory have all helped hundreds of elderly people.\nKaren's next Pensioners Information & Advice Fair will be in Cheadle - more details to follow.",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_campaigns_opposing-government-policies/content_9.html": "Many residents have contacted Karen about some of the new government’s policies.\nWinter Fuel Payments\nOne of these is the plan to cut winter fuel payments. Karen is totally opposed to this decision, which affects over 20,000 people in the Staffordshire Moorlands constituency, and has been campaigning against these cuts. If you haven’t already done so, you can sign the petition at: keepwinterfuel.com\nFamily Farm Tax\nKaren is also opposed to the government's decision to impose inheritance tax on family farms and will do all she can to try to make the Chancellor change her mind.\nKaren said,\n\" I have always stood up for our farmers and can see just what a dreadful impact this ill thought-out policy will have on so many farms in the Moorlands.\n\"I have also signed a letter to the Chancellor, together with other MPs, Lords & industry groups, calling on the Government to reverse this cut.\"\nDevolution\nFinally Karen was able to speak against devolution during the debate on the King’s Speech, stating that we do not want to be in a unitary authority across north Staffordshire and want to keep our unique identity. You can see her speech here:\nMy final point relates completely to my constituency: the status of the Staffordshire Moorlands. We are a very proud and unique area. We are part of the Peak District national park. We have beautiful Churnet valley, which is desperate for area of outstanding natural beauty status. But we face challenges. We are concerned about what might happen with devolution, as we do not want to be in a unitary authority across north Staffordshire. We want to keep our unique identity. We do not want the green belt between our villages and the city built on. We want powers to ensure that locally elected people make the decisions on solar farm development, battery storage development, pylons and other local matters.\nI urge the Government: please, no top-down targets; please, no imposition from above. Listen to the people on the ground. This matters to them. Staffordshire Moorlands needs to keep its unique identity.",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_news_karen-does-q-children-oxhey-first-school/content_7.html": "Moorlands MP, Karen Bradley visited Oxhey First School in Biddulph this morning.\nShe met Deputy Head Liz Holt and did a Q & A session with some of the children.\nKaren said,\n\"Thank you to Deputy Head, Liz Holt for the lovely visit and to the children for their great questions.\"",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_accessibility/content_4.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk_campaigns_action-solar-farms/content_2.html": "Karen surveyed constituents earlier this year on local solar farm proposals. She would like to thank everyone who returned the survey and has sent a letter to the Rt Hon Ed Miliband MP, Secretary of State for Energy and Net Zero with the results.\nKaren has also copied in the Leader of Staffordshire Moorlands District Council, Cllr Mike Gledhill.\nKaren commented,\n\" I would like to thank everyone who took the time to complete my survey on solar farm proposals.\n\"The results demonstrate the strength of feeling on this important issue and I hope will inform decisions on future policy.\n\"I will of course continue to work with local residents on this important issue.\"",
  "http_www_karenbradley_co_uk_/http_www_karenbradley_co_uk/content_1.html": "Sign the Petiton Keep the Moorlands out of Stoke\nI am very proud to be from the Moorlands and call it my home. We should not be forced into a devolution deal or combined authority against our will, and the decisions that matter to us should continue to be taken in the Moorlands. I have made that point in the House of Commons, both to the Minister and the Prime Minister, but have been disappointed by their responses.\nI can assure you that I will continue to fight to stop us being forced into any unsuitable deal.\nSign the petition to send a message to the Labour Government that we say NO to a merger with Stoke:"
}