{
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news146_html/content_70.html": "Call for extra Ormskirk CCTV\nAdrian is calling for an additional CCTV camera on St Helens Road in Ormskirk.\nAdrian said, “The current CCTV system is being modernised and upgraded with funds from the Local Strategic Partnership. It seems the right time to raise the case for an additional camera coming out of the town centre.”\n\"An extra camera would provide reassurance, especially for the increasing number of young female students who walk along St Helens Road back to the university campus.”\nUPDATE: 1 March 2012 The Conservative council approved £250,000 additional investment in CCTV at the budget meeting last night. Adrian will now be working to ensure that this additonal camera on St Helens Road becomes a reality.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news190_html/content_35.html": "Replace Diseased Tree Call to County Council\nThe Borough council is hoping that the county council will relax its stance on the replacement of trees on the public highway according to Adrian. Independent councillor, Adrian said that the Borough council tree officer has asked the county council to plant a replacement for a\ndiseased horse chestnut which recently had to be taken down on Ruff Lane, by Victoria Park. Adrian said, “It is a shame that the mature horse chestnut had to be taken down, but it was suffering from canker disease. I\nunderstand that usually the county council do not replace trees on highways land, citing financial issues while sometimes they may also have caused problems for\nwheelchair and pram users.” Adrian continued, “However, in this case, I hope the county council will listen to our Tree and Landscape Officer and make an\nexception to their rule and plant a replacement tree. The location is in the Ruff Lane Conservation Area and tree-lined roads are an intrinsic part of the\nlandscape in this area. Such trees also play an important role in capturing airborne particulates from vehicles so reducing air pollution which is a concern\nin parts of the town centre.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news133_html/content_73.html": "Dial a Ride's future\nAdrian has expressed concern at news that Dial a Ride is being prohibited by the county council from trialling different business models during the three month transitional funding period announced last week.\nAdrian said, \"The Borough council has always recognised the valuable role that Dial a Ride plays in providing a lifeline for people who otherwise might be largely housebound.”\n“Unfortunately, the previous Labour government decided to centralise funding and responsibility at county council level from this April and the county council seem to be trying to adopt a one size fits all approach which doesn’t reflect the local differences across Lancashire.”\n“The county council describe the latest three month funding as transitional. Yet at the same time they are preventing Dial a Ride from piloting new business models that might help them be sustainable in the long term. I understand that Dial a Ride wished to introduce a £2 flat charge, but the county council are insisting this must not be done. The funding situation will be the same at the end of June as it is now and so Dial a Ride should be given the freedom to pilot different approaches.”\n“The county council describe the latest three month funding as transitional. Yet at the same time they are preventing Dial a Ride from piloting new business models that might help them be sustainable in the long term. I understand that Dial a Ride wished to introduce a £2 flat charge, but the county council are insisting this must not be done. The funding situation will be the same at the end of June as it is now and so Dial a Ride should be given the freedom to pilot different approaches.”\nAdrian, who used to be a trusteee of a community transport organisation said he had raised the issue with the Borough council leader and with local county councillors after speaking to Dial a Ride and to other Lancashire community transport providers.\nAdrian concluded, “Decisions on this at the county council appear to be taken by a small group at the top of the council. Our local county councillors knew nothing about this latest move by the county council. I hope that they will now use their influence to ensure that West Lancashire’s voice is heard.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news167_html/content_93.html": "Night-time nuisance in Ormskirk running at almost three times the rate of Chorley\nImage courtesy of David Dominici / FreeDigitalPhotos.net Adrian has said that newly released police figures which show night-time anti-social behaviour incidents in the town running at nearly three times the rate of Chorley “lay bare the extent of nuisance” faced by residents.\nAdrian, who represents the town’s Derby ward, was speaking after obtaining figures from Lancashire police showing that solely between the hours of midnight and 6am the police had recorded an annual average of 230 anti- social behaviour incidents between April 2011 and March 2013.\nAdrian asked for the figures for Chorley town centre in comparison. He said, “Chorley’s population is almost double that of Ormskirk. I would have expected almost double the number of anti-social behaviour incidents. Instead the number of incidents in Chorley was almost 50% lower than Ormskirk’s.”\nThe statistics also showed a sharp rise in assaults taking place in the early hours of the morning in Ormskirk town centre. Assaults after midnight were 58% more frequent in 2012/13 than in the 12 months previously.\nAdrian continued, “I have written to the police to ask them for further detail about the sharp rise in assaults but the anti-social behaviour figures underline the findings of our own. One resident told me she was woken up six times in a single night recently.\nThe figures are also an underestimate. We know that residents don’t report all incidents. The neighbourhood police line was out of action three times in recent months while one resident said to me last week that ‘disturbance is now almost something to set your clock by’ and that ‘it can be exhausting to do any more than let it wash over you.’”\nLast November, Councillor Owens called on the Borough Council to consider introducing an Early Morning Restriction Order (EMRO) on pubs in Ormskirk to require early closing times, something the council is now considering.\nAdrian concluded, “Since my call last autumn, other towns are now considering introducing similar restrictions on pub opening times. The level of crime and nuisance in Ormskirk certainly demonstrates we have an issue, and I continue to believe that earlier weeknight pub closing would lead to an improvement.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news152_html/content_56.html": "A decent night's sleep may still be possible for town centre residents\nAdrian spoke in support of concerns expressed by local residents at last week's planning committee. The concerns related to applications to extend the opneing hours of the Green Room and Mustard Club to 3.30am on Saturday and Sunday mornings. The Planning Committee recognised the concerns expressed and rejected the applications by an overwhelming margin.\nAdrian said after the meeting,“This wasn't especially about these premises and it wasn't about preventing people having a good time. It was more about the right of local residents to a decent night's sleep and consideration for their amenity. Resdients must continue to call the non emergency police number 101 and obtain a log number for each and every case of disturbance or nuisance they suffer.\"\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news162_html/content_74.html": "Local Conservatives support residents through welfare changes\nLocal residents living in council homes will receive extra support to help them adjust to changes to welfare payments following a decision by the Conservative council last week.\nAmong the measures agreed, in which Adrian was a prime mover, are proposals to work closely with a local credit union and to take on an additional officer to work with tenants to ensure that they can access the best value banking; energy and telecoms products.\nCabinet members on the council also agreed to the promotion of direct debits and agreed in principle a scheme to allow tenants to purchase replacement household goods such as washing machines and furniture at affordable interest rates.\nAdrian said, “Welfare changes are coming as part of the Government’s plans to reduce the overspending inherited from Labour and ensure that work pays. However, we realise that these changes will impact significantly on many of our tenants. That’s why we are taking steps to increase our officer support and develop additional options to help tenants balance their household books as these welfare changes take place.”\nThe Government is making changes to housing benefit from April this year. Next year sees further changes with the introduction of Universal Credit and its direct payment to recipients.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news189_html/content_25.html": "Council and Edge Hill need to end delay and update student accomodation numbers says Adrian\nAdrian has called for an end to the delay in updating important information on the current state of the student\nhousing market. Adrian said that the Borough Council and Edge Hill have been in communication since last October, but that the data on updated student\nhousing market needs was still not available. “Our local plan states that it must be demonstrated that there is an overriding need for purpose-built student accommodation”,\nsaid Cllr Owens. “My gut feel is that such accommodation will still reduce pressure on housing elsewhere, but it is only a gut feel and the situation is altering.\nWe need up-to-date data as the amount of student housing and the need for it has changed rapidly in recent years.” “I enquired again this past week, and the updated data that the planning committee need is not yet available in spite of the council\nand Edge Hill talking about it for almost 9 months.”\n“Edge Hill supplied some very basic information before Christmas and promised to provide more. In March they said they had someone working on it, and yet still it is awaited. The council too have other information sources from council tax and other records but this has also not been forthcoming.”\nAdrian said that it is known that student intake at Edge Hill peaked in 2011 and has fallen since and that some houses in the town used for student accommodation were taking longer to let than a year or two ago.\nAdrian, a Derby ward independent concluded, “There are planning applications for student accommodation under consideration currently and it is quite wrong that the information that the planning committee need to assess these applications adequately against our planning policy is being so severely delayed.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news172_html/content_48.html": "Bulb planting completes Wigan Road improvement project\nIn April, councillors, local residents and Edge Hill Students’ Union were involved in a project planting shrubs to improve an open space\non Wigan Road in Ormskirk. Now an autumn tidy up of the area close to School House Green and planting hundreds of bulbs has given the area a further boost.\nAdrian said, “The area was already looking better with the shrubs we planted, but the area needed an end of season tidy up and\nthe bulbs we planted will give the area a real splash of colour next spring. Thanks to everyone who helped especially students from Edge Hill.\"\nJess Martin from Edge Hill Students’ Union said, “Students from Edge Hill were involved in the shrub planting in April.\nStudents are involved in hundreds of hours of volunteer activity every year and it’s great to have a project like this at the start of the academic year to\nget new students involved.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news144_html/content_81.html": "Adrian wins cabinet support on change to draft local plan - now have your say\nOn 5th January, consultation will begin on the new draft local plan.\nAt the cabinet meeting last week, Adrian successfully persuaded his cabinet colleagues to accept an amendment to the draft local plan to protect St Helens Road from even more traffic congestion by retaining the current car parking standards for Edge Hill rather than relaxing them which might have meant an extra 1600 car journeys each day and more tarmacing over of green space.\nAdrian said, \"Now it's time for local residents to have their say. Details on the consultation will be in a 4-page wrap around in the Champion on Wednesday 4th January. I urge Derby ward residents to make their views known. It helps me to represent you better and the draft plan already includes changes made following representations you made at the previous stage in early 2011.\"\nThe new draft plan includes:\nAdrian said, \"The proposals for Edge Hill are likely to produce a mixed response from residents. Representations from residents at the earlier stage in the process have helped improve the plan, for example in ensuring that much needed housing takes place in the most appropriate locations. Residents should make well argued cases for further changes they feel are necessary once the consultation opens on January 5th.\"\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news202_html/content_34.html": "Parking Chaos near Edge Hill looms again as Lancashire Parking Services Frustrate Coordinated Action\nThe parking chaos seen every September and October in recent years looms large again because Lancashire Parking Services are\nfrustrating coordinated action says Adrian. Now he has written to the transport portfolio holder, John Fillis asking that he\nintervenes. Adrian said, “It’s entirely predictable that the residential streets around the University will experience dangerous and\nobstructive parking in the first few weeks of the academic year. That’s why the local police and I raised the matter at the Freshers’ Group Meeting with a host of\nagencies in June. Since then, Borough Council officers and the local police sergeant have provided information about the streets affected but the\nresponse from Lancashire Parking Services has been dismissive. I discovered earlier this year that parking enforcement resources had been deliberately removed from\nWest Lancashire in favour of Preston and other areas, but the start of year parking around Edge Hill is a predictable problem and as council taxpayers we should expect\na positive response from Lancashire Parking Services, not the terse and negative replies they have provided.” Adrian has now written to Cllr Fillis requesting he gets involved. “Cllr Fillis lives in Ormskirk. He knows full well the\nproblems caused at the start of the academic year with parking. For the sake of road safety and the amenity of local residents he needs to get West Lancashire our\nfair share of parking enforcement time and ensure Lancashire Parking Services plays a positive role in the same way that every other local agency does with Freshers’\nplanning.” Photo courtesy of QLocal\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news153_html/content_94.html": "Council “has a heart” for young people\nCommenting on the highly successful Apprenticeship Fair at Skelmersdale Library last Thursday (pictured), Adrian, who is the councillor in charge of Regeneration said that especially during these difficult times the council was committed to having a heart for young people. Adrian also cited as evidence of the council's commitment, the recruitment of seven new apprentices/trainees by Forrest which had been enabled by the £4 million windows contract the council has placed with the construction firm.\n“These are tough times in which to enter the jobs market for the first time. That’s why we as a council have made helping young people onto the employment ladder a key focus in the past 12 months”, Adrian said. More than 60 local apprenticeship opportunities were created by the initiative in the first 10 months alone.\nAdrian continued,“The Apprenticeship Fair saw more than 20 apprenticeships on offer, including in unusual areas such as fishery management. The council’s new windows contractor, Forrest was also on hand to explain the seven new opportunities they will make available.”\nAdrian also said that since the Apprenticeship Fair, the council had been approached by another local company keen to offer an apprenticeship opportunity.\nAdrian added, “It’s important to have a heart for young people in this jobs market. My message to all employers is: we all started our career with little or no experience, but someone gave us our first break. Can you do the same for someone else? There is government funding support available and council officers can help you through the process, so please get in touch and help us boost our apprenticeship starts to over hundred.”\nFor further information contact john.corish@westlancs.gov.uk or contact Adrian here\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news177_html/content_33.html": "Press Letter - July 2014\nSir, Residents in West Lancashire should be deeply concerned about the plans to continue with the European Arrest Warrant debated in the House of Commons last week.\nThe average person would assume that before a British citizen can be extradited to a foreign country that a British court would\nhave the power to consider the prima facie evidence against them and make a decision, based on that evidence, that their extradition is justified or not.\nThat is not the case with the European Arrest Warrant.\nUnder the EAW all that is required to send a suspect off to a foreign judicial system is that a form is correctly completed.\nIndeed neither Ormskirk magistrates, nor any British court has power to consider any evidence, or refuse extradition.\nOther treasured liberties such as habeas corpus and trial by jury are also undermined by this deeply flawed\npan-European system.\nWe successfully extradite serious criminals to countries on every continent, as we should, without such a dangerously flawed system.\nThe Government is seriously mistaken to pursue this policy. The Prime Minister recently told the “Today” programme that he wants to pursue a relationship with our\nEuropean partners based on “trade and co-operation” and on being “an independent nation state”. I agree with those sentiments, but the actions need to match.\nPostscript and update 10/11/14. Clearly the actions didn't match the sentiments. I think this puts it rather well.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_biography_html/content_76.html": "adrian's biography\nAdrian is a local businessman who has lived in West Lancashire for more than 20 years raising his family here. He is married to Jocelyn and his children attend local schools such as St Bede's in Ormskirk. Born on the Wirral, Adrian is a science graduate from Trinity College, Cambridge and has pursued a career in manufacturing. He now runs his own business consultancy helping small businesses through the legal minefield of health, safety and environmental matters. Adrian is a practising Christian and spends his free time enjoying time with his family.\nPolitical experience\nHe has been a councillor in Ormskirk since 1999 and was finance portfolio holder on West Lancashire District council from 2002-2008, keeping district council tax rises to inflation or less. He was Borough council Deputy Leader and Regeneration Portfolio Holder between 2008-2014. He is a strong campaigner and works hard to ensure that residents' voices are heard.\nAdrian is the Chairman of the Our West Lancashire group of Independent councillors. The group has grown from 2 to 6 councillors in recent times.\nOther interests\nAdrian is an active supporter or member of a number of organisations such as Right to Life and the Freedom Association. He is also a long-standing supporter of the National Trust. Adrian spends his leisure time with his family and enjoys walking in the local countryside. He walked and camped a 50-mile stretch of the Leeds-Liverpool canal with his eldest daughter and completed the Three Peaks Challenge with a group of young people from the Birchwood Centre in Skelmersdale, raising £7000 for the charity which helps homeless young people.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news186_html/content_57.html": "Strange goings on in budget preparations\nAdrian, who is a long standing Borough Councillor and was himself financial portfolio holder for six years has written to the Borough\nCouncil Leader, Councillor Westley expressing serious concern that the budget estimates for 2015/16 for the general revenue account have still not been\npublished when the council meeting to set the budget is only two weeks away. Adrian said, “This will be my 16th budget as a councillor and in that time the budget estimates have always been published during\nJanuary in time for the Executive Overview and Scrutiny committee or its predecessor committees and for public scrutiny. Their absence this year is unprecedented\nand I’ve written to the Council Leader for an explanation.” Update: 6 hours later the budget estimates arrived. I am still awaiting an explanation for the delay. I have formed my own opinion.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news203_html/content_17.html": "Labour making it up as they go along on Green Bins\nAdrian has criticised the Labour run council for the lack of answers to questions residents are already asking about how the\nunpopular green bin charge will operate. Adrian said that when he asked the officers charged with operating the new scheme how it would work they were unable to provide an\nanswer to any question he asked. “I asked them when the charge would start – no answer. I asked them how they would tell who had paid the charge and who hadn’t – no answer.\nI asked them whether residents who didn’t pay the charge would keep their green bin or would those bins be collected back – no answer.” “I’ve loudly criticised the decision to introduce this charge. That flew in the face of the strongest public opposition I can\nrecall. However, to make this decision with no plan as to how to carry it out, beggars belief.\" Adrian concluded, “No doubt, they will get ideas from the councils who have already gone down this route, but the lack of thought that has gone\ninto this is appalling. The council leadership should be ashamed to be making up policy as they go along. They need a plan quickly and they need to let residents\nknow what will happen. The best plan of course would be to ditch the idea altogether, but Labour are deaf to that.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news166_html/content_92.html": "Sun shines on project to improve Wigan Road street scape\nThe sun shone on a team of twenty or so who worked over Friday and Saturday to improve a stretch of landscaping on Wigan Road in Ormskirk. Thanks to people from Midstream; Edge Hill Students Union; local residents and two of the Derby Ward councillors, the area at the junction of School House Green has been much improved.\nThe project, which was initiated by Adrian, saw more than 25 bags of rubbish removed and around eighty shrubs planted, designed to give all round colour to this prominent 50m stretch of border. The workers were supported by the Ropers Arms who provided sandwiches and the use of their toilets. The corner next to the Ropers Arms was also cleared of overgrown vegetation by the pub landlord and has been planted with new shrubs to match the community project.\nAdrian said, “This year I wanted a project that might bring students and the permanent community of Ormskirk together to work jointly on improving an area and the project succeeded in that. We will return in the autumn to plant spring flowering bulbs and I hope that the Students Union will take this area under its wing for ongoing maintenance.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news193_html/content_6.html": "Application for student flats at Fat Olive refused\nPhoto courtesy of Wiki Media Commons Many concerned residents will be relieved to hear that the application to convert the former Fat Olive restaurant on St Helens Road into\nstudent flats has been refused. Adrian had worked with concerned residents and spoke at the planning committee meeting on their behalf. Adrian said, \"Purpose built student accommodation has its place, and I supported the plans on Church street and at the indoor market\nwhich will bring a further 103 student rooms on stream when developed, reliving pressure on housing in the town, but location is crucial and I'm clear that the location here was\ncompletely wrong. I'm delighted that the planning committee refused the application.\" Adrian continued, \"We still urgently need updated data on the number of students requirig accommodation in the town and I am pressing the University and council in this regard.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news207_html/content_14.html": "At last Borough and County Council come to their senses on Grounds Maintenance\nThe Borough Council cabinet have agreed a proposal from the County Council for the Borough to provide a 'joined-up' Grounds Maintenance service in 2018 and future years in a move warmly welcomed by Adrian.\nLast week, approval was given for the Borough to enter into a 3 year partnership agreement for public realm works with the County Council.\nIn July, Adrian had to intervene to ensure overgrown routes through West Lancashire were improved in time for the The Open Championship at Royal Birkdale, while the county council had to be shamed into promising better standards across the Borough and maintaining planters in Ormskirk. In one surreal episode, the county council even refused the offer of FREE grounds maintenance from a professional landscape gardener.\nAdrian said \"At times over this year we have had the unedifying spectacle of the Borough and County Councils pointing fingers at each other while the\nstandards of weed control; grass cutting and general care of many of our public spaces suffered (as pictured above). I and my fellow Independents have fought for better standards\nand a joined up approach and this partnership agreement offers the prospect of some improvement next year and is to be welcomed.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news205_html/content_4.html": "Council should publish Confidential Cabinet report that Recommended installing Enforcement Cameras on Ormskirk's car parks\nAdrian has called on the Borough Council to publish the confidential cabinet report that agreed to\nthe controversial installation of automatic number plate recognition cameras on the town centre car parks. Adrian issued his call after Our West Lancashire started a petition against the camera plans and the council\nin turn issued a statement trying to justify the move. Adrian said, “The council’s statement talks about mobile phone top-up but seems to imply that cameras are needed for this. They are not. The mobile phone top-up facility could be installed on the current machines at a low cost. This is\nsomething the council could and should have done two years ago when it was called for by Our West Lancashire.” “If the council are going to start making public statements about the plans for cameras, then they should make public the council\nreport that led to cabinet approving this move. As a councillor, I’ve read that report and I think members of the public should also be able to read it. Then\nresidents would be able to form their own opinion rather than rely on the version from the council’s PR department. Any commercially confidential sentences can be\nexcluded from what is made public.” Adrian concluded by saying that the petition against the plans has already gathered 200 signatures online and face-to-face with\ncomments from retailers and shoppers that cameras will simply discourage a percentage of motorists from visiting the town.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news174_html/content_20.html": "Council Homes Secured by Local Working People boosted after change in policy\nLocal people in employment are being allocated a higher proportion of\ncouncil homes as they become available following changes to the Conservative council’s allocations policy last summer.\nThe council will continue to prioritise those in need but figures show that for the first six months of the new policy,\nalmost 3 out of every 10 council homes were allocated to working people. The policy also gives priority to local people and to members of the Armed Forces.\nAdrian, who has the housing finance portfolio welcomed the figures, “We must always house those in need but there was a\nperception, partly reinforced by the way the previous policy worked, that there was no point in applying for a council house if you tried to get on in life,\nworked and didn’t rely on benefits.”\n“I’m delighted that house allocations to those residents who work have increased by a third since July, and I expect them to\nincrease further.”\nAdrian concluded by pointing out that with around 800 council properties becoming available this year and with 1500\npeople on the waiting list, there was a better chance of being allocated a council house than for many years.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news213_html/content_22.html": "Piecemeal Development Proposal leaves Future of Historic Listed Building 'up in the air'\nThe future of the 18th century listed building that housed the former Windmill pub in Ormskirk is in doubt says ward councillor Cllr Adrian Owens, after the owner proposed splitting the site and building houses on the former bowling green while leaving the former pub up for sale.\nCllr Owens said, “The proposed development of 4 terraced properties on the bowling green has some points in its favour, but I have concerns over the height of the properties. The applicant must also be required to provide some financial assistance to contribute to the upkeep of other local bowling green facilities to compensate for the loss of the current green.”\n“However, the most significant concern is the fact that it leaves the future of the listed Windmill pub building up in the air and makes its sale more difficult as land which may be required for car parking for its future use is lost.”\n“I have already had to involve council officers after residents approached me concerned about possible deterioration in the roof. This planning application on the bowling green appears to me to make the renovation of the listed building harder to achieve. For that reason, among others, I have called the application in for consideration by the Planning Committee.”\n5th June 2019\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news212_html/content_26.html": "Council 'not interested' in retailers' needs says long-serving councillor\nThe Borough Council has been accused of showing a lack of interest in the needs of the area’s retailers in stinging remarks from a long-serving councillor.\nCllr Adrian Owens made the remarks after the Council Leader ignored a request to meet with Independent retailers from the Concourse in Skelmersdale. Independent retailers had approached Cllr Owens to request the meeting over their concerns about the Council’s plans for Skelmersdale town centre.\nCllr Owens said, “The health of our shopping centres is a vital concern to local residents and it is astounding and very disappointing that the Council Leader won’t meet with local businesses that bring employment and variety to our centres. Unfortunately, this is a pattern with this council currently. I’ve had reports of several small retailers feeling their concerns were dismissed at the recent Ormskirk town centre meeting.”\n“The priorities of the Council are wrong. In the past three weeks the Council’s Twitter Feed has promoted the £30 green waste bin scheme EIGHT times but not once tweeted support for local retailers. Worse, the Council-run Discover Ormskirk Facebook Page which exists to promote Ormskirk town centre has posted only once in the past two months and even then it didn’t promote Ormskirk!”\nCllr Owens concluded, “The Council’s agenda for our town centres seems very one-dimensional currently. Our town centres will only thrive through fully coordinated efforts that recognise that shops must continue to play a vital role in ensuring vibrant town and village centres.”\n22nd April 2019\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news204_html/content_13.html": "Water Tower Proposal could raise Privacy & Overlooking Issues\nAdrian says that the latest proposal for refurbishment of the Water Tower on Tower Hill in\nOrmskirk could raise privacy and overlooking issues. A Liverpool-based architect has submitted a planning application for a single residential\ndwelling on top of the existing Water Tower on Tower Hill where the water tank used to be situated. Adrian said, “I led opposition to a 2007 proposal for 7 flats at the Water Tower and I said then that a single residential\ndwelling was economically possible. So I’m pleased that this latest application is not for flats.” “This application seeks to increase the height of the Tower with extensive glazing and balconies on all four sides.\nI would expect that this could cause privacy and overlooking issues with Derby Ward residents and would like them to have the opportunity to respond to the\nconsultation. Many households are not contacted directly by the Planning Department and will be unaware of the current application.” Adrian pointed out that people who wanted to comment on the development proposal for this prominent\nbuilding on the town’s skyline must do so by 4th January to the Borough Council quoting Ref: 2016/1136/FUL.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news197_html/content_15.html": "Opportunity now to Rebalance Wigan Road housing mix\nSpeaking after the planning committee refused the application for student accommodation at The Windmill, Adrian who is ward councillor expressed his delight at the decision. “I have worked to ensure that the concerns of residents were heard loud and clear from the time the application was submitted in\nAugust right through to speaking at the planning committee. This was quite simply the wrong type of proposed development in the wrong area. The redevelopment of this site gives an opportunity to rebalance the community in this part of town and I hope that plans come forward in the future that the community can support.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_index_htm/content_1.html": "Welcome to my website...\nOn May 6th, Vote Adrian Owens, Our West Lancashire\nAdrian Owens is an experienced local councillor in West Lancashire. He is a councillor in Derby Ward covering part of Ormskirk and Westhead village and was Deputy Leader of West Lancashire Borough Council between 2008 and 2014. He is a member of the group of Independents, Our West Lancashire.\nAs the council's Regeneration portfolio holder he helped secure investment in Skelmersdale, Ormskirk and Burscough's centres. While Finance Portfolio Holder he reduced the real level of council tax and expanded services, while in housing he approved major investments to 1 in 4 council house properties and spearheaded the major estate revival at Firbeck while giving extra priority for council housing to people who work and volunteer.\nFind out more about Adrian here. Adrian has long advocated a clear, transparent approach to expenses. He publishes his expenses on this website - see here for further details. He has donated a proportion of his councillor allowance to charity since 2004.\nAdrian continues to campaign hard on a number of issues. For Adrian's latest news see the sidebar to the right\nor visit the news section or the Our West Lancashire website. He also occasonally blogs when the urge takes him and his latest posts can be read via the panel to the right.\nAdrian spearheaded the successful public opposition to Labour’s hugely\nunpopular Local Plan proposals to build 16,000 houses—mostly in our Green Belt—including between Altys Lane and St Helens Road (pictured here). After 4 public meetings organised by Adrian and following a record number of\nobjections from the public the proposals were dropped. He was responsible for initiating the Freedom of the Borough for the Duke of Lancaster's\nRegiment. He promotes Ormskirk as a market town and West Lancashire as a great place to live. He is a strong supporter of the Motorfest and as finance portfolio\nholder provided funds for massive improvements at Coronation Park and for a new children's play area in Westhead. He led the campign in 2015, to prevent the Labour council from\nplanning a closure of Park Pool in Ormskirk. Please use the links above to explore the site and use the contact page to tell Adrian your views or sign up to his newsletter.\nOn May 6th, Vote Adrian Owens, Our West Lancashire",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news178_html/content_24.html": "British Telecom challenged on slow delivery of Superfast Broadband in Ormskirk Town centre. Adrian writes to Open Reach after resident complaint\nTelecoms chiefs have been challenged by Adrian over delays in the rollout of superfast broadband to Ormskirk town centre.\nCllr Adrian Owens said that he had written to Open Reach,\na part of British Telecom responsible for the rollout demanding an explanation.\nAdrian said, “I acted after receiving a complaint from a frustrated town centre business. It seems that all the surrounding\nresidential areas have been enabled in recent months and will soon be taking orders for superfast broadband. Town centre businesses cannot remain in the slow lane,\ndue to these unexplained delays by Open Reach.”\n“I have checked with council officers and there are no planning constraints to the new superfast fibre cabinets being installed\nin the town centre. It’s time Open Reach got a move on. Ormskirk town centre should not be left behind in the technology stakes.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news137_html/content_67.html": "Adrian's intervention secures extra time for residents to respond to Edge Hill plans\nEdge Hill have submitted a large planning application to build new sports facilities in the green belt, create a new junction and entrance road to the campus and create further car parking spaces.\nAdrian said, \"This is a complex and unusual application and there are over 100 documents submitted in support of the proposal. I am delighted that planning officers have agreed to my suggestion that in these rare circumstances public consultation be extended. It’s important that local residents can properly understand what is proposed and have their say. The extended deadline assists with that.\"\nThe application and the more than 100 associated documents can be viewed at http://publicaccess.westlancsdc.gov.uk/PublicAccess/tdc/DcApplication/application_detailview.aspx?caseno=LK9ALYRH02W00 and the reference number is 2011/0504/FUL. Videos in support of the application can be seen at www.westlancs.gov.uk/edgehill .\nAdrian wants to know your views on this application. Please contact him so that he can understand the views of ward residents.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news206_html/content_7.html": "Adrian 'wrings' grass cutting and road sweeping commitments out of councils in advance of The Open Championship\nAfter being contacted by a resident concerned by the appearance of West Lancashire scarcely a week before many overseas and national visitors will visit or pass through the Borough\nin connection with the Open Championship at Royal Birkdale, Adrian contacted senior staff and councillors at the Borough and County Councils. Adrian wrote: \"The Open Championship is to be held at Royal Birkdale the week after next. The Borough will be hosting many hundreds\nof visitors from other countries and thousands more will travel through it on the way to the Links. It must be hoped that some of the “visitor dollar” will be spent\nin the hospitality industry in West Lancashire, but with its current appearance they would be forgiven for driving swiftly on. Currently, I am ashamed of the appearance of our Borough and the boundary between West Lancashire and Sefton is a stark one as one travels along the main\nthoroughfares. In the remaining time before the start of the golf (a week at most given the busy practice days), what work do you intend to carry out to ensure that, at the very\nleast, the main thoroughfares and entrances to the Borough are presentable rather than their current unkempt; untidy; overgrown; weed strewn and grimy condition?\" In responses today, the County Council has promised to cut grass and maintain the grounds along 'the advertised diversion route from Junction 3 of the M58 to the Royal Birkdale Golf course' this Wednesday and the\nBorough council is organising street cleansing to follow behind. Adrian said, \"I had to wring this commitment from the respective councils. The current condition of our street scene is shameful and this doesn't address anything other than the single route to the golf.\nHow we expect to encourage visitors to linger in our Borough is not explained in the council responses.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news168_html/content_71.html": "Are Labour capable of running local council?\nRuling Conservatives on West Lancashire Borough council have this week turned their attack on Labour after the Labour group once again fired their group leader and installed a new one – the fourth in 4 years\nConservative Deputy Leader, Adrian Owens said “Councillor Fillis is the latest in a long line of Labour leaders who has been stabbed in the back by his own colleagues. Perhaps it’s because he put up no alternative budget; no alternative local development plan, no plan for apprenticeships and no answers to the difficulties we face.”\n“We’ve had a different Labour Leader every year since 2010 as the Labour group lurches about bereft of policy ideas and prone to factional in-fighting.”\nAdrian welcomed Cllr Bell to the role of Labour Leader but said that the initial signs for any positive change in the Labour group were not good.\n“While the Conservatives, cut the cost of local politicians yet again last week by reducing the size of the cabinet to six, Labour’s new leader instead announced a much larger team of spokesmen and women. This is an ominous sign. The last time they ran the council, they more than doubled the amount of money paid to councillors in allowances and this latest move looks like more “jobs for the boys”.\nAdrian concluded by noting that the Conservative council had reduced councillor allowances in real terms by 40% over the past decade which had helped to keep council tax rises to the lowest in Lancashire.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news180_html/content_28.html": "Don't Short Change Council Tenants\nCouncil tenants must not be short-changed as a result of an efficiency report into part of the housing service, said Adrian this week.\nAdrian was speaking after securing the unanimous backing of the council’s Scrutiny committee in requesting council officers\nto bring a detailed implementation timetable on the report to next month’s committee meeting.\nThe report on the council’s Voids & Allocations; Estate Management; and Rent & Money Advice services is one of a\nprogramme of organisational re-engineering projects that seek to streamline processes and reduce paperwork and bureaucracy.\nAdrian said, “The report highlights many possible efficiency improvements that could save £235,000 a year and at the same time\nreduce a lot of frustration for staff and council tenants alike. Yet the report unusually contained no timetable for implementation and talked about taking two years\nto implement. Many of the 37 recommended improvements are relatively easy to complete and council tenants need to see those improvements much quicker.\n\"Many tenants work in jobs which pay modestly. They have to budget carefully and if they have an opportunity to make a saving\nin their household budget they take it. The council must do the same with the rent monies it collects from tenants.”\nAdrian concluded, “The sooner we can make the identified savings, the sooner we can increase investment, bringing forward future\n“bricks and mortar” projects.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news164_html/content_80.html": "Can you help with Wigan Road Community Project?\nCan you give an hour or two to help improve a small piece of landscaping on Wigan Road in Ormskirk (pictured here) this spring? That’s the call that’s gone out this week to local residents.\nThe project has been initiated by ward councillor, Adrian Owens who last year coordinated a project to paint the railings at Ormskirk Church of England School on Greetby Hill.\nAdrian said, “This year I wanted a project that might bring students and the permanent community of Ormskirk together to work jointly on improving an area. As a lot of students live in Wigan Road, and it’s a main thoroughfare with highly visible landscaping, it seemed a good choice. I’ve informally consulted local residents and the responses received have welcomed the project.”\nThe project already includes Edge Hill Students Union and Midstream, the Skelmersdale social enterprise for adults with learning difficulties. It has received funding from the Borough Council’s Community Chest as well as financial support from Adrian.\nJess Martin from Edge Hill Students’ Union said, “Students from Edge Hill are involved in hundreds of hours of volunteer activity every year. So when Councillor Owens approached us about this project we were keen to get involved and make a positive impact in this part of town. We will be working to recruit student volunteers for the project.”\nMidstream will devise the planting scheme for the project and provide the plants, and their trainees will assist with the landscaping, alongside the community and student volunteers. Mark Saxon, Operations Manager at Midstream said, “The project will involve preparing the land by digging and then planting larger types of flowering evergreen, with variegated leaves for year round colour such as Rhododendrons and Photinia along with both spring and autumn flowering bulbs. This is a great project involving residents and students and Midstream is very pleased to be involved.”\nAdrian concluded by asking anyone who was interested in volunteering for the project which will take place on 19th and 20th April (26th and 27th in reserve in case of poor weather) to contact him on 01257 464813 or by email at adrian@adrianowens.com\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_esurgery_html/content_54.html": "E-surgery\nAdrian's role as a councillor is to try to assist residents and Adrian especially relishes battling bureaucracies. He has resolved any number of issues on a range of different subjects for West Lancashire residents over the years.\nThis E-Surgery resource has been developed to help point you in the right direction in the first instance and ensure your problems are solved quickly and efficiently by the relevant organisations. If you have tried unsucesssfully to get your issue resolved, or require further help, please contact Adrian.\nWhere can I get more information on...?\n- Housing, refuse and recycling collections, planning, environmental health, parks and open spaces, Council Tax, Business Rates, licensing, and travel concessions, click here\n- Schools, social care, highways, community recycling centres and bus services, click here\n- Child Maintenance, click here\n- Registering with an NHS dentist, click here\n- Immigration case issues, click here\n- Job Centre Plus job search, click here\n- Money, tax and benefits enquiries, click here\n- West Lancashire's hospital services, click here\n- Finding your local police team, click here\n- Contacting your County Councillor, click here or contacting your Borough Councillor, click here\n- Help and advice for volunteering organisations, please click here",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news209_html/content_43.html": "Planning Application for Windmill pub resurfaces\nThree years ago an application to develop The Windmill site for accommodation for 33 students was refused. Now there’s a new application.\nThis time the proposal is to accommodate 27 persons— 14 students in the former pub & 13 people in the apartment block. There is no occupancy restriction on the apartments. They can be let to anyone.\nCompared to the previous application, the apartment block would be a half-metre taller. Dormer windows would overlook Mill Street and Windmill Avenue.\nMore car parking is proposed to be located close to the boundary with Windmill Avenue with an access road along the side of 2 Mill Street.\nIn 2015, Adrian strongly opposed the application and supported residents to successfully defeat it. Now, OWL councillors, Ian Davis and Adrian Owens are opposing this new application and are supporting residents to make their views known.\n17th August 2018\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news132_html/content_87.html": "Council and Edge Hill to work on minimising traffic and parking problems\nAdrian has secured the establishment of a working group to seek to minimise issues caused by traffic and parking related to the University, particularly at peak times. The agreement was reached at a Council/University Forum meeting last Friday.\nAdrian said, \"There are a number of smaller improvements relating to junction and car park permit management that can help minimise the impact of car traffic visiting the University, especially at the start of the autumn term. So, I'm delighted that the Forum agreed to my suggestion to establish a working group to see what can be done to alleviate the problems we saw last autumn.\"\nAdrian said, \"Although the working group will be made up of staff from the council, University, county council and police, I would like to hear from local residents about their suggestions for improvements. So please contact me, preferably by e-mail so that I can feed your suggestions into the discussions.\"\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news185_html/content_16.html": "Celebrating Ruff Wood improvements\nChildren from Westhead St James Primary school helped celebrate the recent improvements at Ruff Wood last week.\nIn recent months, the Borough Council has improved pathways; installed new benches;\nimproved signage and introduced a number of chain saw animal carvings into dead wood features within the ancient woodland. Adrian, who is the local ward councillor for the area, joined the children from the school, council officials and Groundwork staff at the celebration. He said,\n“The improvements make the Wood much easier to access for people with mobility difficulties, bringing the enjoyment of this little gem to a greater\nnumber of people\".\nI saw the chainsaw sculptor at work and the carvings he has produced throughout the wood of owls, badgers and the like create a trail to follow. I will be taking my family for a walk there shortly and I would encourage local residents to themselves enjoy the peace and beauty of this place.”\nThe project was funded from receipts received by the council from new housing developments in the Derby ward.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news188_html/content_23.html": "Open Letter to the Mayor-Elect\nToday, Adrian has sent an Open Letter, to the Mayor-Elect, Cllr Nikki Hennessy Dear Nikki, I have read in the council agenda papers for the meeting of council next Wednesday, that you are the Labour Group’s nominee for Mayor\nfor the ensuing Municipal Year. Many congratulations, I am sure that you will fulfil the role of First Citizen of the Borough with great grace. You will be aware that the Borough Council faces some very tough budget decisions in the summer and autumn and that there is a real prospect\nthat some of our staff will lose their jobs and that services to the public we serve will be reduced. The budget shortfall is estimated to be at least £1 million\na year.\nI fully recognise that to fulfil the role of Mayor fittingly, the holder of the role will incur additional expenditure on, for example, clothing. A Mayoral allowance is therefore appropriate.\nHowever, given the financial position in which the Borough council finds itself and given the fact that you already have entitlements to allowances as a county councillor; county lead member for schools; and as a borough councillor which total £23,341 a year (£10,362 as county councillor; £8,137 as Lead Member for Schools; £4,842 as Borough Councillor), I am writing to ask you to consider not taking all, or at least most, of the Mayoral Allowance of £8730. If you were to take this allowance on top of the other three allowances you already receive, you would be receiving more than £32,000 from the public purse for your public service this year. Many of my ward residents would find it difficult to accept that the Mayor, a unifying figure in the Borough, would take such a sum during a year when the council will be making some very difficult financial decisions.\nI hope that you will reflect on my suggestion to waive most or all of your Mayoral Allowance given the circumstances and I look forward to your reply. As this is a matter of public interest, I am copying this letter to the local media.\nYours sincerely,\nAdrian Owens\nUPDATE: Councillor Hennessy replied: \"I am absolutely honoured to be the Mayor Elect of West Lancashire. It is widely recognised that the role of the Mayor is Civic, promoting West Lancashire along with businesses, schools and other organisations in the borough and Charitable, raising many thousands of pounds for local causes. This has been recognised and respected by all members of the council regardless of their political parties and I will accept the allowance set for this role under the budget.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news139_html/content_55.html": "New Landlord Scheme Proposed\nA new scheme to accredit local landlords could be launched by Conservative controlled West Lancashire Borough Council. The idea was first raised at a meeting of the Borough Council/Edge Hill Forum and has been developed by the Council since then and will be considered by council cabinet on 13th September.\nThe proposal, which would see the council work with the Residential Landlords Association, has been welcomed by Derby ward’s Conservative councillors.\nAdrian said: “Edge Hill Student Union is supportive of the principle of piloting a landlord accreditation scheme and I and my housing portfolio colleague will be meeting with Edge Hill management later today to see if they too will be involved.”\n“It’s important to recognise the scheme is a voluntary one – landlords are not compelled to participate. It will not be a magic wand, but if we can get good cooperation between the partners then we can start to deal with some of the issues faced by both tenants of the properties and their neighbours.”\nAdrian will report Edge Hill's response at the council cabinet meeting on Tuesday.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news154_html/content_59.html": "Council's housing investment is sound sense for wallets, purses and the environment\nIn his role as the council's lead on housing finance, Adrian submitted this letter to the Letters Page of the local press.\n“Dear Sir,\nProposed wind turbines whether at Walkers in Skelmersdale or in Wrightington continue to generate local controversy, if not electricity.\nGiven the experience of Denmark, which has promoted wind power since 1980, that’s not surprising. In spite of thirty years development, large subsidies continue to be required from the Danish population. Nor do residents seem to become more accepting of the technology as the years pass. Noise issues have become a major factor in the backlash against onshore wind energy from Danish residents.\nI am a strong supporter of renewable energy. I have championed tidal and wave power which has the benefit of being constant, something wind power is not. As the council’s lead on housing finance we are currently exploring biomass heating for the estate revival scheme on the Firbeck estate in Skelmersdale. Yet in these difficult times we need to spend money wisely to maximum effect.\nThat’s why the local council is installing double glazing in around 1200 of our council house properties this year. This could save almost £200,000 annually in energy for those residents and reduce carbon emissions by more than 800 tonnes a year. To achieve the same carbon reductions with wind turbines we’d need to install more than 220 turbines reaching forty feet in height at three times the cost of our windows programme. Of course, the turbines would also not provide the direct benefit in warmer homes, better health and lower fuel bills to some of our less well-off residents.\nIn housing, the council will continue to focus on practical energy measures that benefit our residents and the environment.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news215_html/content_36.html": "Urgent Action needed by Royal Mail bosses in Ormskirk\nRoyal Mail bosses need to get a grip of the situation at the local Ormskirk office says Adrian Owens. He was speaking after residents contacted him about the Covid outbreak in the office and the resulting lack of post deliveries.\nAdrian said, “My first thoughts are for the staff who have come down with Covid-19 at the Ormskirk Royal Mail office and for their families; also for their colleagues who have had to self-isolate as a result. Several numbers have been mentioned to me, but whatever the precise figure, it seems that a very large percentage of the mail staff at the office are now off work as a result of this cruel virus.”\n“Bosses need to ask how so many staff had to self-isolate after the first cases were announced. Other Royal Mail offices haven’t seen the same disruption. Management are supposed to ensure controls are in place so that staff are kept apart as much as possible. They have a duty to their staff to keep them safe.\"\nAdrian then turned to the impact on mail deliveries, saying, “Now, though the knock-on effect, is that residents are contacting me expressing concern that they haven’t received any post for 10 days. Not everyone uses email or looks at social media. Many older people in particular could have critical mail relating to health matters held up in the post. It’s time the local management at Ormskirk Royal Mail employed additional temporary staff to clear the backlog. It’s not fair on those staff still at work or returning shortly from illness or isolation to shoulder the whole burden and residents need to receive a half-decent service.”\n“I have written to complain to the Royal Mail. I understand some residents have also complained to our MP and I trust that she will investigate fully what is going on and get Royal Mail to get their act together”, Adrian concluded.\nUpdate: Royal Mail have been on touch, have confirmed they have recruited temporary staff and residents are reporting bumper mail deliveires as the backlog is cleared.\n20th January 2021\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news165_html/content_83.html": "Baronness Thatcher of Kesteven RIP\nI was deeply saddened to hear of the death of our country’s first woman Prime Minister. May she rest in peace. She took a country seemingly in terminal decline and gave it self-belief and purpose again. I fear we will rarely see her like again.\nI have only recently made a donation to the campaign to raise funds for a statue of her in her home town of Grantham. This campaign also has the support of local Labour councillors in Grantham and is a fitting tribute in that it reminds us that one of our greatest Prime Ministers rose from humble origins as a grocer’s daughter. Re-building such a strong meritocracy is an urgent challenge for the politicians of today.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news157_html/content_82.html": "Boost for Ormskirk town centre as council supports Love Ormskirk\nLove Ormskirk, the group comprising town centre retailers and businesses, has received the backing of the Conservative council, with a £20,000 grant from the Government's High Street Innovation Fund. Adrian presented the cheque to the group in the town centre last week.\nAdrian said, “In the past it has often been difficult to encourage the town's traders to come together, but the Love Ormskirk team have enthusiastically engaged the support of very many of the shop owners in the town to come together to promote Ormskirk. At the council, we have been supporting them up to now through our small town centre promotions budget. When we received funding from the Conservative-led Government to support our town centres, we've been able to turn to Love Ormskirk and provide the funding for them to put some of their ideas into practice.\"\n“Building on last month's Motorfest, we have the opportunity to bring visitors back to Ormskirk for return visits, and the promotions and events planned by Love Ormskirk should help do just that.\"\nAdrian concluded,\"If you haven't yet registered your support, and to receive details of special promotions, events and discounts, then sign up now at Love Ormskirk. Ormskirk needs the support of its residents as local shoppers if it is to remain a lively market town.\"\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news141_html/content_64.html": "Adrian calls for big turnout to honour Lancashire's troops\nAdrian, who first initiated the idea of Freedom of the Borough for the Duke of Lancaster’s Regiment, has called for a big turnout on Saturday to show public support for the work of our Armed Forces.\nAdrian said, “The idea came from discussions I had with a local resident when the Regiment lost its first casualties in Afghanistan in late 2009. By the time they returned from that tour of duty nine of their number had made the ultimate sacrifice.”\n“This isn’t a political matter. It has unanimous support from all parties. It isn’t about the rights or wrongs of any particular armed conflict. Instead it is about recognising, through our county’s regiment, the brave men and women of our armed forces, who put their lives on the line to keep Britain safe.”\nAdrian added, “I’m calling for a large turnout of local people to crowd the streets of Ormskirk during the march past to show the strength of support for our Armed Forces.”\nThe troops will march from 52 Derby Street to Ormskirk Parish Church at 11am on Saturday 22nd October. Following the service, they will parade across Park Road, down Church Street to the dais on Moor Street at 12.10pm, before parading out of the town centre.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news182_html/content_45.html": "New ASB legislation offers greater hope to curtail rowdy partying\nThe rowdy partying of a few may be better tackled by new antisocial behaviour legislation passed last month says Adrian.\nAdrian said that following serious disturbance after an all-night party in a house in Ormskirk at the beginning of this month local\npolice had already warned the house’s occupants about the new powers in the Anti-social Behaviour, Crime and Policing Act.\n“I have been told by the police that the occupants were informed that under the legislation there was the prospect of them being fined\n£2000 or closure of their property if they continued to cause serious disturbance and nuisance to their neighbours. That prospect seems to have had a sobering effect\non them.”\nAdrian said “We know from our 351352 incident line that there are a small minority of properties in the town which cause repeated\ndisturbance to residents, not just at times like the start of the academic year, but regularly through the year.”\n“The legislation includes new injunction powers and new legal instruments such as Community Protection Notices. I have written to council officers and asked them to look at how we change our procedures to make full use of these extra tools in dealing with noise and disturbance from properties. In that way hopefully the level of disturbance suffered by residents can be reduced.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news145_html/content_53.html": "£7000 raised as Three Peaks Challenge appeal closes\nAdrian thanks everyone who donated so generously to the Three Peaks Challenge fundraiser for the Birchwood Centre. The appeal was closed when the total reached £7000, just before Christmas, easily exceeding the £5000 target.\nLast July, Adrian along with six young people from the Birchwood Centre, a charity based in Skelmersdale for homeless young people in crisis scaled Ben Nevis, Scafell Pike and Snowdon in a non-stop challenge to raise funds to help other local homeless young people. The photo shows the team celebrating on the summit of Ben Nevis and then again at the completion of the Challenge at the foot of Snowdon around 10pm.\nAdrian said, \"The Challenge had three purposes: to raise funds for the Centre; to heighten awareness of the Centre's work and to provide an inspirational personal development experience for the young people involved. On all counts, I feel we succeeded. The day and night were memorable - to scale 1/3rd the height of Everest non-stop was certainly a Challenge!\"\nAdrian is a trustee of the Birchwood Centre charity and if you would like to find out more about the Centre's work then take a look at their website here The Birchwood Centre.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news142_html/content_69.html": "Businesses - Take on an apprentice says Adrian\nWest Lancashire’s businesses are being challenged to give apprentices a chance by Adrian who is overseeing a local project to promote apprenticeships\nAdrian said, “I work professionally with small businesses. Several of them have realised the sound business case for investing in apprentices. Skilling the next generation of employees is the right investment to ensure businesses are ready to make the most of opportunities as the economy recovers.”\n“The council is working with partners at West Lancashire College and the local CVS on the West Lancashire Challenge project. We have focused a council officer on working with local employers and the National Apprenticeship Service to help firms maximise the benefits that apprentices bring. It’s not just about traditional crafts; apprenticeships are available in many careers. The council itself employs two apprentices.”\nAdrian added that there was support for employers to help them with running an apprentice scheme and urged companies to contact the council.\n“Employers imagine that the paperwork is over the top. It isn’t. It’s been slimmed down and we and our partners are there to assist you. An apprentice is an affordable addition to your workforce that prepares your company for the future.”\nFor further information see http://www.westlancs.gov.uk/business/advice_and_support/west_lancashire_challenge.aspx\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news155_html/content_79.html": "Time to talk up our local economy\nWelcoming news that unemployment in West Lancashire has fallen to its lowest level since 2008, Adrian said, “It’s easy to lose sight of the big picture with the ups and downs of economic news. However, the latest jobless figures which show unemployment at the lowest level in West Lancashire since December 2008, the year of the banking crisis, show that we shouldn’t be overly gloomy. Confidence is a key part of any economy and we mustn’t talk ourselves down.”\n“Our unemployment rate is also below the regional and national average. Some people outside West Lancashire may have an image that parts of our Borough are full of work shy couch potatoes. These figures show that image to be completely false. Of course the economic situation is difficult, but we have people with energy and skills and many local companies flourishing . Remembering and highlighting that will help build further confidence.”\nAdrian added that to date, over 100 local apprenticeships have been created by the council and its partners working in collaboration with local business. He is pictured here with Marie Hackney and Tony Lewis of West Lancashire Disability Helpline. Marie is one of 14 apprentices recruited through the Supported Apprenticeship Scheme wth local voluntary organisations - this is on top of those created with private sector employers. Meanwhile, the first two apprentices employed by West Lancashire Borough council have also secured permanent employment.\n“While the economic picture is mixed”, Adrian concluded, “many local private sector businesses are thriving and creating the job vacancies that put local job seekers in a better position than in many other boroughs. Confidence is infectious - we need to try to spread it.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news187_html/content_11.html": "Introduce Public Question Time at Council Meetings says Adrian\nMembers of the public should be able to table and ask questions of their councillors at council meetings. That’s the suggestion\nmade this week by Independent Borough Councillor, Adrian Owens. Adrian, who resigned from the Conservatives last month to start an Independent group, Our West Lancashire said, “I’ve placed a motion on the council agenda next week\nthat would allow members of the public to submit written questions to council cabinet members and then ask those questions and a related supplementary question in a\npublic question time slot at the beginning of council meetings.” “I was at the forefront of introducing public speaking at planning committees more than 10 years ago and that works well. It’s past\ntime when we should allow residents to quiz their elected representatives at full council meetings. Many other Lancashire councils allow this already, as do\nparish councils here in West Lancashire.” Adrian concluded by saying this was one of a number of measures he and Our West Lancashire were promoting to give residents\na greater voice.\nThe motion submitted for debate by the council on 25th February is appended below:\nThat this council notes that the introduction of public speaking at planning committee introduced more than 10 years ago has proved very successful in ensuring that those potentially affected by a planning application are heard prior to a decision being made.\nThat Council further notes that many councils in Lancashire have ‘public question time’ before council meetings including Preston, Burnley, Rossendale, Hyndburn and Lancaster thus enabling their residents to be more fully involved in local democracy.\nThat ‘public question time’ for up to 30 minutes at the start of ordinary council meetings be introduced from the start of the 2015/16 municipal year.\nThat officers work up a suitable procedure for ‘public question time’ having due regard to the draft guidelines set out at Appendix A and submit a report to Council on 15 April 2015 for approval.\nTo navigate back to Press Releases, click here.\nImage courtesy of Artur84 at FreeDigitalPhotos.net",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news176_html/content_31.html": "Annual Council Meeting - 11th June 2014 - Personal Statement\nI was elected Leader of the Conservative council group in a secret ballot after the local elections\nlast month and formed a strong prospective cabinet and team in preparation for the year ahead.\nIt is deeply regrettable that two members of the group were unwilling to accept the democratic decision of their\ncolleagues in the group and did not support the Conservative whip during the vote to elect the Leader of the Council on Wednesday evening.\nBecause I continue to believe that Conservatives are better at running the Borough than the local Labour alternative,\nfor the unity of the Conservative group I stood down as Leader, and subsequently supported our new Leader in the reconvened votes.\nIt has been a thoroughly unpleasant few days. The mayor-making evening was wrecked. The Conservative Group has split into factions and friendships have been ended.\nI hope that local Conservatives can come together, but previous examples of Leaders being replaced in such circumstances do not lead me to be optimistic.\nI will be considering my own future over the coming weeks.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news183_html/content_50.html": "County Council consultation a \"travesty\"\nLancashire County Council was slammed today after giving residents only two weeks to respond to proposals that would slash important services.\nAdrian, a local Ormskirk councillor called the consultation a “travesty”. He said, “Last Thursday,\nLancashire County Council’s cabinet, including West Lancashire’s Cllr Fillis, set out additional savings proposals which would see gully cleaning; street lighting;\nwork on uneven pavements; speeding traffic and parking enforcement all cut. Amazingly, residents are given only a fortnight to respond.”\n“It’s pretty clear that these proposals are being slipped out in the pre-Christmas rush after the main consultation\nin the hope they go unnoticed. That’s not surprising, as I know many of my ward residents will be opposed to them.”\nAdrian explained that the proposals if accepted would lead, among others, to:\nAdrian said, “I already receive many complaints about poor gully cleaning; the lack of parking enforcement and speeding traffic. If residents are already dissatisfied with these services from county council then the levels of dissatisfaction with Preston will rise still further.”\n“I urge people to respond to this consultation that Lancashire county council hoped you wouldn’t notice. You can respond here.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news149_html/content_63.html": "Big boost for apprentices in West Lancashire\nAdrian has warmly welcomed news that a council partnership has already helped to secure 61 apprenticeships in the past 10 months, with many more in the pipeline.\nApprentice hairdressers; business administrators; manufacturing operatives; customer service staff; plumbers and warehouse operatives are just some of the wide range of opportunities secured through the West Lancashire Challenge Project a partnership of the Borough council, West Lancashire College and West Lancashire CVS.\nAdrian, who is the councillor who has overseen the Project said,“The council is clear that promoting apprenticeships is key to helping people, especially young people, into sustainable employment in these tough times. We’ve worked hard with our partners to promote the advantages an apprentice can bring to a business and I’m delighted at the success the project is having.”\n“There are many more apprenticeship opportunities in the pipeline with private sector employers and also an exciting new supported apprenticeship scheme that will train up to 12 apprentices in some of West Lancashire’s thriving social enterprises and charities.”\nAdrian added that the council too had recruited apprentices and was using its influence on suppliers to ensure they too gave young people a step onto the employment ladder.\n“As a council we’ve put our money where our mouth is and employed apprentices ourselves – we currently have two working for us. Indeed one of our former apprentices, a young woman, has already secured a job elsewhere as a result. We have also encouraged out new housing repairs contractors to provide new employment opportunities. This is something we will be seeking to expand when contractors are appointed for the £8 million of housing improvements agreed in the Conservative council budget a few weeks ago.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news136_html/content_85.html": "Litter picking local grot spot\nThe path between Ormskirk rail station and the bus station was cleared of more than 10 bags of litter last Saturday, as Adrian joined members of local churches in carrying out community work in the town centre.\nAdrian said, \"I was pleased to give my support to Servolution. The phrase \"we are all in this together\", may be a little trite, but the more local people can volunteer and take a pride in their town and a care for their neighbour, the better Ormskirk will be.\"\n“Network Rail provide only a basic grounds maintenance programme on the path between the rail station and the bus station, and the litter there is a real eyesore, so among all the tasks on offer, this seemed to me especially worthwhile.\"\n“The local churches, and especially Ormskirk Christian Fellowship who took the lead, are to be commended on this initiative. I know they plan more such days, so if you know of any tasks - painting, litter picking, gardening etc or you want to help next time, then please let me know.\"\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_press%20releases%20extra_html/content_39.html": "news archive\nBulb planting completes Wigan Road improvement project\nFinishing touches to landscaping project led by Adrian\nPublished 6 October 2013.\nLicensing Committee agrees to formally consult on possible earlier midweek pub closing\nUnanimous support for Adrian\nPublished 31 July 2013.\nNew play facilities at Coronation Park\nFunded as a result of local housing developments\nPublished 26 July 2013.\nLocal jobless figures fall to 4 and half year low\nSigns of improvement continue in local economy\nPublished 22 July 2013.\nAre Labour capable of running local council?\nAdrian asks question as Labour change leader yet again\nPublished 20 May 2013.\nNight time nuisance almost three times as high in Ormskirk as neighbouring town\nAdrian renews call for action\nPublished 11 May 2013.\nSun shines on project to improve Wigan Road street scape\nMidstream, Students Union and community work together to improve local landscape\nPublished 21 April 2013.\nStatement on death of Baronness Thatcher of Kesteven\nPublished 9 April 2013.\nCan you help with Wigan Road Community Project?\nCall goes out for help in improving local open area this April.\nPublished 9 March 2013.\nCouncil agrees to consider call for tighter midweek licensing hours\nAdrian would like to hear your views on a possible Early Morning Restriction Order\nPublished 10 February 2013.\nHelping residents through the welfare changes\nCouncil cabinet approves measures in which Adrian was a prime mover\nPublished 22 January 2013.\nArmed Forces and those who work in council house boost\nAdrian has led moves to revise the Borough Council's council housing allocation policy. Now have your say.\nPublished 13 December 2012.\nCall for tighter licensing hours in Ormskirk\nAdrian calls for council to consider using new licensing powers.\nPublished 20 November 2012.\nFree press too important to free society to regulate\nAdrian speaks on eve of Leveson report.\nPublished 12 November 2012.\nAll small commercial units now let\nSmall units all taken as Brighter Future workshop expand into Ormskirk\nPublished 8 October 2012.\nCash boost for Ormskirk town centre\nLove Ormskirk receives £20,000 in support from council to promote the market town\nPublished 26 September 2012.\nMotorfest \"bigger and better\" than last year\nAdrian was a volunteer steward at this year's event and comments here\nPublished 30 August 2012.\nIt's not all gloom on economy especially in West Lancashire\nUnemployment at lowest since 2008 as apprenticeships rise\nPublished 19 August 2012.\nProtecting wallets, purses and the environment\nAdrian explains how investment in local council housing is a win-win\nPublished 2 July 2012.\nCouncil has heart for young people\nRecent boosts for apprenticeships\nPublished 1 June 2012.\nA decent night's sleep might still be possible for town centre residents\nAdrian speaks after persuading planning committee to refuse planning applications\nPublished 24 May 2012.\n\"I'll vote for you, but...\"\nAdrian comments on local voter feeling\nPublished 10 May 2012.\nWhere were the other candidates?\nAdrian attacks other candidates for ducking hustings event\nPublished 2 May 2012.\nBig boost for apprentices in West Lancashire\nAdrian welcomes latest Challenge Project success\nPublished 11 April 2012.\nCan you spare a hour or two to smarten up Ormskirk?\nAdrian is appealing to local residents to join a community effort to smarten the street scene on an important approach road to the town\nPublished 19 March 2012. UPDATED 28 APRIL 2012\nCalling time on pubs that fuel drunkenness\nMeeting with police and licensing officers called by Adrian leads to action\nPublished 27 February 2012.\nAdditional CCTV required in Ormskirk says Adrian\nAdrian calls for additonal CCTV coverage in St Helens Road\nPublished 5 February 2012.\n£7000 raised for Birchwood Centre by Adrian and team of young people\nAdrian thanks all donors as Three Peaks appeal closes with target exceeded.\nPublished 4 January 2012.\nDraft local plan out for consultation\nAdrian points to positive changes affecting Ormskirk and Westhead and calls on residents to make their views known on latest version of local plan.\nPublished 23 December 2011.\nSuccess in 20mph school campaign\nAdrian hails news that his campaign for 20mph limits outside schools has been successful.\nPublished 1 December 2011.\nCall for businesses to take on apprentices\nAdrian calls on local business to take up council help and support young people through tough times.\nPublished 6 November 2011.\nLet's have large turnout to honour our troops\nAdrian calls for big public turnout for Freedom of Borough parade this Saturday.\nPublished 16 October 2011.\nWhy not a park and ride for Edge Hill?\nWith 45% of Edge Hill traffic passing Junction 3 a park and ride should be fully explored.\nPublished 17 September 2011.\nLandlord accreditation scheme proposed\nA report coming before council cabinet is a welcome step says Adrian.\nPublished 9 September 2011.\nMotorfest a \"roaring\" success\nAdrian hails the great community spirit on display in Ormskirk on Sunday.\nPublished 30 August 2011.\nAdrian wins extra time for public to have say on Edge Hill plans\nConsultation period on Edge Hill's latest planning application extended.\nPublished 19 July 2011.\nLitter picking local grot spot\nAdrian joins local churches in community work in Ormskirk town centre.\nPublished 30 June 2011.\nLocal Unemployment down by 300 since General Election\nAdrian welcomes fall in jobless total as vacancies rise\nPublished 19 June 2011.\nPolice need dose of fresh thinking\nWhy the police can find savings elsewhere\nPublished 14 June 2011.\nDial a Ride's Future\nAdrian speaks out on future of Dial a Ride.\nPublished 13 April 2011.\nEasing the traffic impact at Edge Hill?\nAfter Adrian raised the idea, a working group is established to try to minimise the traffic impacts\nfrom people visiting Edge Hill's campus.\nPublished 4 April 2011.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_press releases extra_html/content_91.html": "news archive\nBulb planting completes Wigan Road improvement project\nFinishing touches to landscaping project led by Adrian\nPublished 6 October 2013.\nLicensing Committee agrees to formally consult on possible earlier midweek pub closing\nUnanimous support for Adrian\nPublished 31 July 2013.\nNew play facilities at Coronation Park\nFunded as a result of local housing developments\nPublished 26 July 2013.\nLocal jobless figures fall to 4 and half year low\nSigns of improvement continue in local economy\nPublished 22 July 2013.\nAre Labour capable of running local council?\nAdrian asks question as Labour change leader yet again\nPublished 20 May 2013.\nNight time nuisance almost three times as high in Ormskirk as neighbouring town\nAdrian renews call for action\nPublished 11 May 2013.\nSun shines on project to improve Wigan Road street scape\nMidstream, Students Union and community work together to improve local landscape\nPublished 21 April 2013.\nStatement on death of Baronness Thatcher of Kesteven\nPublished 9 April 2013.\nCan you help with Wigan Road Community Project?\nCall goes out for help in improving local open area this April.\nPublished 9 March 2013.\nCouncil agrees to consider call for tighter midweek licensing hours\nAdrian would like to hear your views on a possible Early Morning Restriction Order\nPublished 10 February 2013.\nHelping residents through the welfare changes\nCouncil cabinet approves measures in which Adrian was a prime mover\nPublished 22 January 2013.\nArmed Forces and those who work in council house boost\nAdrian has led moves to revise the Borough Council's council housing allocation policy. Now have your say.\nPublished 13 December 2012.\nCall for tighter licensing hours in Ormskirk\nAdrian calls for council to consider using new licensing powers.\nPublished 20 November 2012.\nFree press too important to free society to regulate\nAdrian speaks on eve of Leveson report.\nPublished 12 November 2012.\nAll small commercial units now let\nSmall units all taken as Brighter Future workshop expand into Ormskirk\nPublished 8 October 2012.\nCash boost for Ormskirk town centre\nLove Ormskirk receives £20,000 in support from council to promote the market town\nPublished 26 September 2012.\nMotorfest \"bigger and better\" than last year\nAdrian was a volunteer steward at this year's event and comments here\nPublished 30 August 2012.\nIt's not all gloom on economy especially in West Lancashire\nUnemployment at lowest since 2008 as apprenticeships rise\nPublished 19 August 2012.\nProtecting wallets, purses and the environment\nAdrian explains how investment in local council housing is a win-win\nPublished 2 July 2012.\nCouncil has heart for young people\nRecent boosts for apprenticeships\nPublished 1 June 2012.\nA decent night's sleep might still be possible for town centre residents\nAdrian speaks after persuading planning committee to refuse planning applications\nPublished 24 May 2012.\n\"I'll vote for you, but...\"\nAdrian comments on local voter feeling\nPublished 10 May 2012.\nWhere were the other candidates?\nAdrian attacks other candidates for ducking hustings event\nPublished 2 May 2012.\nBig boost for apprentices in West Lancashire\nAdrian welcomes latest Challenge Project success\nPublished 11 April 2012.\nCan you spare a hour or two to smarten up Ormskirk?\nAdrian is appealing to local residents to join a community effort to smarten the street scene on an important approach road to the town\nPublished 19 March 2012. UPDATED 28 APRIL 2012\nCalling time on pubs that fuel drunkenness\nMeeting with police and licensing officers called by Adrian leads to action\nPublished 27 February 2012.\nAdditional CCTV required in Ormskirk says Adrian\nAdrian calls for additonal CCTV coverage in St Helens Road\nPublished 5 February 2012.\n£7000 raised for Birchwood Centre by Adrian and team of young people\nAdrian thanks all donors as Three Peaks appeal closes with target exceeded.\nPublished 4 January 2012.\nDraft local plan out for consultation\nAdrian points to positive changes affecting Ormskirk and Westhead and calls on residents to make their views known on latest version of local plan.\nPublished 23 December 2011.\nSuccess in 20mph school campaign\nAdrian hails news that his campaign for 20mph limits outside schools has been successful.\nPublished 1 December 2011.\nCall for businesses to take on apprentices\nAdrian calls on local business to take up council help and support young people through tough times.\nPublished 6 November 2011.\nLet's have large turnout to honour our troops\nAdrian calls for big public turnout for Freedom of Borough parade this Saturday.\nPublished 16 October 2011.\nWhy not a park and ride for Edge Hill?\nWith 45% of Edge Hill traffic passing Junction 3 a park and ride should be fully explored.\nPublished 17 September 2011.\nLandlord accreditation scheme proposed\nA report coming before council cabinet is a welcome step says Adrian.\nPublished 9 September 2011.\nMotorfest a \"roaring\" success\nAdrian hails the great community spirit on display in Ormskirk on Sunday.\nPublished 30 August 2011.\nAdrian wins extra time for public to have say on Edge Hill plans\nConsultation period on Edge Hill's latest planning application extended.\nPublished 19 July 2011.\nLitter picking local grot spot\nAdrian joins local churches in community work in Ormskirk town centre.\nPublished 30 June 2011.\nLocal Unemployment down by 300 since General Election\nAdrian welcomes fall in jobless total as vacancies rise\nPublished 19 June 2011.\nPolice need dose of fresh thinking\nWhy the police can find savings elsewhere\nPublished 14 June 2011.\nDial a Ride's Future\nAdrian speaks out on future of Dial a Ride.\nPublished 13 April 2011.\nEasing the traffic impact at Edge Hill?\nAfter Adrian raised the idea, a working group is established to try to minimise the traffic impacts\nfrom people visiting Edge Hill's campus.\nPublished 4 April 2011.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news199_html/content_37.html": "Planning appeal on Fat Olive \"provocative\"\nSpeaking after news that Mr Michael McComb has launched an appeal to the Planning Inspectorate for the larger 4 storey student\naccommodation block at the former Fat Olive on St Helens Road, Derby ward councillor, Adrian called the move “provocative”. Adrian said, “Mr McComb has recently received planning permission for a three storey development at the site. Now he is appealing\nbecause he didn’t get permission for a larger four storey block. There is a place for purpose built student accommodation in the town which is why I have supported\ndevelopments at the Indoor Market and on Church Street, but this latest appeal is provocative.\" The developer is adopting the approach of repeated applications and appeals in the hope of wearing down the resistance of local people.\nHe can be sure that where a proposed development is broadly acceptable, local people will support it; they want to see a balanced housing market and the right\ninvestment in Ormskirk. However, with this latest move residents will feel they have been kicked in the teeth and that Mr McComb simply wants to ride roughshod\nover Ormskirk.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news208_html/content_38.html": "Graffiti removal - Ormskirk Town Centre\nComments from residents led Adrian to recently paint over the graffiti on the side wall of Clarks' shoe shop in the town centre.\nThis was a follow up to the alley spring clean that Adrian carried out with Our West Lancashire colleagues in March. Thanks must also\ngo to Dave Mutch, an Ormskirk resident who mucked in to give the wall a bright face lift.\n15th June 2018\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news143_html/content_60.html": "Success in school 20mph campaign\nDerby Ward’s primary schools in Westhead and on Greetby Hill are set to get 20 mph speed limits in a victory for local residents and for the campaign initiated by Adrian three years ago.\nAdrian said, “When I started a campaign in 2008 for 20 mph limits outside our local primary schools, the idea was relatively new to Lancashire. Yet we collected more than 600 signatures from concerned parents including those at Westhead Lathom St James’s and Ormskirk Church of England Primary and persuaded the Borough Council to produce a scrutiny report.”\nAdrian continued saying that while Labour controlled the county council the campaign stalled. “They seemed to see it as party political and took a “not invented here” attitude which was disappointing.” With Conservatives taking control of the county council attitudes changed and a 20 mph limit is now planned for outside both schools during a phased programme over the next two years.\nAdrian concluded,“Not only as a councillor, but as a parent of young children this change in speed limits outside schools will help to reduce accidents and make the journey to school safer for everyone.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news194_html/content_10.html": "County Council dragging feet on HGVs past parish church\nOrmskirk councillor, Adrian Owens and local residents have criticised the county council and Transport Portfolio Holder, John Fillis for an extremely slow response,\nwhen some through traffic especially heavy goods vehicles could have been diverted away from the town centre and A570./p>\nAdrian said, “The opening of the new Thornton relief road this week should have brought some much needed relief for Ormskirk.\nSignage changes on the M58 could have diverted some through traffic along the new Thornton Relief Road into Sefton. Instead, we find out that substantive discussions\nwith Sefton council and the Highways Agency have only recently commenced.\" Adrian continued, \"I and residents have been asking Councillor Fillis to progress this since last year and the county council’s\nown transport masterplan identifies new signage on the M58 as a key early priority. It’s hugely disappointing then that vital months have been wasted.” Local Ormskirk resident, Barrie French said “I and a neighbour contacted Cllr Fillis about this matter many months ago. It’s\nnot the only action in the masterplan for West Lancashire that seems to be slipping. I’ve asked about Ormskirk bus station and cycle lanes to the University too\nas they are also behind schedule.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news171_html/content_66.html": "Licensing Committee agrees to formally consult on possible earlier midweek pub closing\nImage courtesy of David Dominici / FreeDigitalPhotos.net Long-suffering Ormskirk residents are one step closer to having their night’s sleep restored after councillors agreed unanimously on Tuesday evening to formally consult on an Early Morning Restriction Order (EMRO).\nThe committee agreed to a motion moved by Adrian which would see a consultation on possible restrictions from half past midnight on Monday to Thursday evenings for licenced premises in and near the town centre. There would be no restrictions in the height of summer or over the Christmas and New Year period.\nAdrian first raised the possibility of an EMRO last November after being inundated with resident complaints. He said that some residents are woken night after night between 2am and 3am while other complaints relate to verbal abuse; criminal damage and other disorder.\nAfter the committee meeting Adrian said, “I read the committee report and listened as the debate progressed. As matters currently stand, this proposal offers the best prospect of a solution to the problem evidenced to the committee. The consultation, when it starts later in the autumn, will give others the opportunity to make representations and if there is another solution, then great. However, in the 5 months since the council first debated this, the situation has not improved; and complaints have continued to come in. No realistic alternative has been suggested by others. The problem will not get better unless we take action.”\nAdrian said that he was delighted that every councillor on the committee supported the motion. “When I first raised the issue last year, I think there was a view that the problem was not significant. That perception is changing. The proposal we will consult on is based on the preliminary evidence presented and is reasonable and proportionate to the problem faced, that’s why the motion secured the support of every councillor present.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news135_html/content_68.html": "Fall in local unemployment welcomed\nNews that unemployment has fallen by more than 300 in West Lancashire since the General Election has been warmly welcomed by Adrian who is in charge of West Lancashire’s economy brief.\nAdrian said, “The latest figures released last week show that unemployment in West Lancashire has fallen to 2,170. This is too many, but it is more than 300 lower than it was in April last year. Long term joblessness is also falling.\n“It’s a promising sign that so many fewer people are unemployed locally. The progress over the past 12 months is another sign, along with recent strong manufacturing output, that we are starting to rebalance the economy away from the debt-driven policies of the previous Labour government.”\n“While the recovery is bound to see ups and downs and there will likely be public sector job losses, recent news that Comet is expanding its distribution operations in the constituency and that Hotter Comfort Shoes are taking on more staff gives grounds for believing that job opportunities will continue to be available in the area. Currently job centre vacancies are more than 50% higher than 12 months ago.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news214_html/content_46.html": "Delay in Cycle Route Project to University putting lives at risk\nLives are being put at risk because of your delays. That’s the message to Lancashire County Council this week from residents, cycle commuters and the area’s ward councillor who united to call for the proposals for the cycle route between Ormskirk town centre and the University to be published.\nMoney was provided in 2011 from developments at Edge Hill University for a cycle track, yet it remains unused in the council’s coffers years later due to repeated delays in taking the project forward. Derby ward councillor, Adrian Owens and local Ruff Lane resident, Geoff Kearsley renewed the call for action in 2016 with Mr Kearsley, a retired construction engineer even drawing up his own costed proposal for the project. They attended two meetings with County Council officers and the Highways chief, Cllr Keith Iddon but now say progress has stalled again.\nMr Kearsley said, “It has been agreed that Ruff Lane is preferred for the cycle route project from the town centre to the University, especially as it has a 20 mph speed limit. The problem is that many vehicles exceed this limit on Ruff Lane. My costed proposal for the project included speed calming measures and clear signage to give cyclists priority on Ruff Lane. A cycle route just involving road markings will not encourage people to switch from 4 wheels to two.\n“The delays from the county council are very frustrating. The officers on the team had changed between the two meetings I attended and at the second meeting we seemed to go back over old ground.”\nFellow Ruff Lane resident Mike Smith added,“I have lived in Ormskirk for 40 years and 26 of those years on Ruff Lane. I have witnessed the increase in traffic and the poor standard of driving is becoming a real reason for concern.”\nKeen cyclist Becka Foster, who regularly cycles from Burscough to the University, said, “I ride my bike to work for many reasons, not least of which is to try and do my part to alleviate the issues of traffic congestion in and around Ormskirk. However, there are numerous cars who exceed the 20mph speed limit on Ruff Lane and force me off the road as they do not obey the highway code and wait for me to pass when their lane is impeded by parked cars. A designated cycle route on Ruff Lane with speed calming would encourage more people to cycle to the University.”\nDerby Ward Councillor Adrian Owens concluded, “This saga has not shown the County Council in a good light with delays now stretching over 4 years. It’s long past time for firm proposals to be tabled and a scheme to improve road safety and encourage cycling to be started.”\n4th March 2020\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_about_html/content_19.html": "biography, beliefs & priorities\nAdrian runs his own small business in West Lancashire helping other businesses through the health and safety minefield. A West Lancashire councillor for\nmore than 20 years, he is married with a family. He was Chairman of Governors at Our Lady and\nAll Saints School in Parbold until 2013 steering it to an Outstanding OFSTED report.\nAdrian is a trustee of the Birchwood Centre, a Skelmersdale charity working with homeless young people. He organised\nthe Three Peaks Challenge for the Centre in 2011 raising £7000 for the Centre's work and inspiring six of the Centre's residents to complete the Challenge.\nHe is also a Foundation Governor at Ormskirk School and a local Ormskirk trustee on the Peter Lathom charity.\nAdrian is campaigning on a number of issues to make West Lancashire a better place to live. Read about Adrian's beliefs and priorities here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_contact_html/content_2.html": "contact adrian\nWhatever your question or comment, Adrian wants to hear from you. Please fill in the form below or, if you prefer, feel free to email Adrian directly on adrian@adrianowens.com. Adrian will reply to every contact made.\nWhatever your question or comment, Adrian wants to hear from you. Please fill in the form below or, if you prefer, feel free to email Adrian directly on adrian@adrianowens.com. Adrian will reply to every contact made.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news160_html/content_84.html": "Call for tighter licensing hours in Ormskirk\nThe Borough Council should use new licensing powers to selectively reduce Ormskirk pub licensing hours and allow long-suffering residents a night’s sleep. That’s the call Adrian is making.\nAdrian, who represents the town’s Derby ward, said that he had been contacted almost 90 times since late September by residents suffering late night noise and nuisance across several areas of the ward. He says he knows of residents in other parts of Ormskirk with similar problems.\nAdrian said,“Many of the calls have been received between 2 and 3am in the morning when the town centre pubs close. Residents are being disturbed often several times in the middle of the week when they have to get up for work the following morning. Some of these residents have safety critical jobs and when they use words like exhausted to describe their condition, I am understandably concerned.”\n“I have written to the council’s chief licensing officer and formally requested that the council consider establishing an Early Morning Restriction Order in Ormskirk. This would allow the council to enforce early closing times on licensed premises at certain times and in certain areas. The details will need careful consideration and would be subject to consultation. Indeed, I have also already written to the contact of the group of town centre landlords I met earlier this year and offered to meet with them again, but the current situation is completely unacceptable. Residents’ lives are being made a misery.”\nAdrian explained that Early Morning Restriction Orders had been introduced under new Government legislation at the end of October. Earlier this year, Cllr Owens had called for local pubs and clubs to alter their practices that fuelled drunkenness.\nAdrian was supported in his call by one local resident, Michael Forth from St Helens Road. Mr Forth said,“The problem of night-time noise and nuisance is getting worse. I’ve had my gate pillars damaged twice and been woken at all hours. Neighbours cannot sleep and some have suffered criminal damage. Such is the concern there is talk about sending a joint letter to the Chief Constable.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news192_html/content_5.html": "Update on traffic and parking problems relating to Edge Hill at start of academic year\nI have been pressing the relevant organisations on the matter of the significant inconvenience caused by illegal and inconsiderate parking and\nthe traffic congestion on St Helens Road which occurs at the start of each academic year.\nAdrian was the only ward councillor to attend the recent Freshers’ Planning meeting, and raised this matter and has been pursuing it\nsubsequently. Adrian has also recently arranged the relining of worn out yellow lines on part of Ruff Lane.\nIn discussions with Edge Hill, the following points have been identified or initiatives have been taken, which taken together may impact\npositively on the matter this September.\n- Last September, Adrian audited the parking permit issuing process by visiting campus car parks on several occasions. Permits were taking up to three weeks to\nissue and in the interim something close to a free for all pertained encouraging those with no right to park on campus to chance their luck. He pressed the University\nhard on this very unsatisfactory state of affairs. Adrian is very pleased therefore that a new parking permit supplier has been engaged via a contract with clear performance requirements\nthat place a greater emphasis on the ‘turnaround’ of permits at the start of term.\n- The number of Post Graduate Certificate Education students who require access/parking on campus at the start of term in September 2015 has reduced significantly\nsince last year – their numbers last September contributed to the increased volume of traffic.\n- The number of on campus residential students will have increased again for this September. As the default position is that residential students are not permitted\nto park on campus, this should have an overall positive net impact on traffic flow to and from the University. I will monitor campus car parks to check on this, but\nplease let me have any evidence if you feel those liking on campus are getting parking permits. (Those with special needs may be allowed a permit of course).\n- The University has revamped its communication strategy in relation to parking to focus attention on the need for all campus users to consider alternative modes of\ntransport, other than single-occupancy car journeys, at peak times i.e. the start of term – even those eligible for a Permit. Importantly the University have\nreminded all campus users of their responsibility to park safely and considerately and to pay particular care and attention should they choose to park in residential\nareas. Obviously, it is not expected this message will sink in with all recipients of the message, so please involve Adrian if required in September to pursue\nillegal/inconsiderate parking with the police and Lancashire Parking Services.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news195_html/content_27.html": "Local \"Gem\" Ruff Wood sparkles more brightly after weekend spruce up\nRuff Wood enjoyed a spruce up recently as a team of volunteers organised by local ward councillor, Adrian Owens rolled up their sleeves towards the end of last month. A team of more than 15 volunteers directed by the council’s park ranger service picked litter; dismantled a den; cleared overgrowth from paths; and lopped branches. The community action day was the latest in a series run by the local party of independents on the council, Our West Lancashire of which Adrian is a member.\nAdrian said, “It’s easy to always demand that someone else does something, whereas if we all do our bit instead, then our neighbourhoods would be stronger, cleaner\nand safer. It was great to see a good response from those living close to the Wood and our youngest volunteer on the day was only five years old.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news201_html/content_32.html": "Safety Fears Eased after Council agrees to Extra Parking Spaces\nRoad safety fears in a Westhead cul-de-sac will be eased after Adrian worked with residents to propose an\nEnvironmental Improvement scheme which has now received approval from the Borough Council. Adrian was approached by residents of council bungalows on Holly Close concerned about the lack of off-street parking which had\ncaused access problems for ambulances in emergencies and poor visibility of pedestrians especially children playing in the area. Working with the residents, Adrian drafted a plan for ten additional off street car parking spaces utilising land in front of the\nbungalows and submitted it to the council’s Environmental Improvement Budget for consideration. Adrian said “I’m delighted that the council has now agreed to fund these improvements with special thanks to Cllr Patterson who\nimmediately understood the case that we were making. Additional off street parking will benefit the whole of Holly Close as on street parking will be reduced.\nAll council properties on Holy Close will have off street parking after this improvement and providing car parking at this and other sheltered schemes will sustain\ndemand for our sheltered properties.” The works will take place this year and officers have started preparatory planning.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news163_html/content_62.html": "Adrian welcomes council decision to formally consider tighter pub restrictions\nAdrian has welcomed the decision of the Borough Council to formally consider whether an Early Morning Restriction Order (EMRO) to close pubs in the town earlier on some nights of the week should be taken forward.\nAdrian made his call for this option to be considered in November, and he says he is delighted that the Licensing committee have now agreed to a formal consideration.\n“There is no perfect solution to the problems residents face. Residents are being repeatedly woken at 2 and 3 in the morning by revellers returning home on foot as pubs close. That’s the problem I am suggesting can be significantly improved by closing pubs at midnight on week nights while allowing late night drinking at weekends to strike a balance.”\nAdrian continued, “There may be other solutions. One might be for Edge Hill or the pub trade to lay on free buses to return people to their accommodation, but I have heard nothing to date to suggest that is on the agenda.”\n“I’m happy to meet anyone and discuss their ideas. What I want is to solve the intolerable situation where people working in hospitals and schools, offices and factories are turning up for work exhausted. I know some residents who cannot use their front bedrooms, while I’ve heard reports of others going to bed at 8 or 9 in the evening as they know their night’s sleep will be disturbed.”\nAdrian said that almost 150 complaints had been made since late September and the worst week was surprisingly during the recent snowy weather. He added that week nights were the worst for incidents.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news148_html/content_90.html": "Can you spare an hour or two to smarten up Ormskirk?\nAdrian is appealing to local residents to join a community effort to smarten the street scene on an important approach road to the town.\nAdrian has brought together Ormskirk Churches working under the Servolution banner along with the local school community at Ormskirk Church of England Primary School on Greetby Hill for a major volunteer painting task. The painting is planned for Saturday 21st and Saturday 28th April.\nThe task is to prepare and repaint the school railings which are adjacent to Greetby Hill. Currently the railings are rusting badly and are unsightly to those passing and living close by.\nAdrian said,“I worked with the local churches when they had a volunteer day in the town last year and I will be picking up my paint brush on this occasion. However, this is an enormous task. Although we will have support from volunteers from the churches and from the school, if there are any local residents who can help, will they please get in touch with me on 01257 464813 or by email to adrian@adrianowens.com \"\nUPDATE 28 APRIL 2012 Local website Ormskirk GB covered the community effort here The railings facing Greetby Hill have now been completed and a route into the town smartened up as a result. Thank you to everyone - from churches, school and local community (including my two Derby ward councillor colleagues) who helped.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_expenses_html/content_18.html": "expenses record\nI am a supporter of open and transparent politics. I believe that politics is about public service.\nIf you would like to suggest a local charity for a donation from the allowances I have placed in a charity fund, please contact me. Ormskirk's Wellbeing Centre for Older People; Ormskirk Civic Hall; Praise in the Park; West Lancashire Debt Advice; and Queenscourt Hospice have received donations in the recent past.\nI have waived my entitlement to a special responsibility allowance in 2019/20 and 2020/21 as I do not believe that the workload justifies the payment. This has saved taxpayers nearly £5000.\nTax year 2007/08\nTaxable Gross Allowance Received: £7416.57\nCharitable Donations through Give As You Earn: £1920.00\nExpenses claimed: Nil\nOther: Not applicable\nTax year 2008/09\nTaxable Gross Allowance Received: £9161.79\nCharitable Donations through Give As You Earn: £2320.00\nExpenses claimed: Nil\nOther: July 2008 - Attended Buckingham Palace Garden Party with my wife, representing West Lancashire District Council. Two Labour councillors also attended.\nTwo nights bed and breakfast at City Inn, Westminster and chauffeured transport to London and to the Palace provided by West Lancashire District Council. All other meal, transport and incidental expenses covered from personal account. Other councillors will attend this event in future years.\nNovember 2008 - Attended Speed Reading course run by Northwest Employers. Cost: £99\nTax year 2009/10\nTaxable Gross Allowance Received: £9225\nCharitable Donations through Give as You Earn: £2880\nExpenses claimed: Nil\nTax year 2010/11\nTaxable Gross Allowance Received: £9225\nCharitable Donations through Give as You Earn: £2880\nExpenses claimed: Nil\nTax year 2011/12\nTaxable Gross Allowance Received: £9225\nCharitable Donations through Give as You Earn: £2880\nExpenses claimed: £162.10 for 2nd class advanced return train fare to London and one night\nbed and breakfast in hotel to attend a training course on developments in Local Government Housing Finance having taken on role of Housing Finance Portfolio Holder and before the major changes to housing finance in April 2012\nTax year 2012/13\nTaxable Gross Allowance Received: £9225\nCharitable Donations through Give as You Earn: £2880\nExpenses claimed: Nil\nOther: June 2012 - Attended a dinner with drink and entertainment at the Manchester Hilton Hotel paid for by Tunstall. Paid for own travel expenses.\nTax year 2013/14\nTaxable Gross Allowance Received: £9225\nCharitable Donations through Give as You Earn: £2880\nExpenses claimed: Nil\nTax year 2014/15\nTaxable Gross Allowance Received: £5144.43\nCharitable Donations through Give as You Earn: £1130\nExpenses claimed: Nil\nTax year 2015/16\nTaxable Gross Allowance Received: £3462\nCharitable Donations through Give as You Earn: £1380\nExpenses claimed: Nil\nTax year 2016/17\nTaxable Gross Allowance Received: £3462\nCharitable Donations through Give as You Earn: £1380\nExpenses claimed: Nil\nTax year 2017/18\nTaxable Gross Allowance Received: £3462\nCharitable Donations through Give as You Earn: £1380\nExpenses claimed: Nil\nTax year 2018/19\nTaxable Gross Allowance Received: £3462\nCharitable Donations through Give as You Earn: £1380\nExpenses claimed: Nil\nTax year 2019/20\nTaxable Gross Allowance Received: £3462\nCharitable Donations through Give as You Earn: £1380\nExpenses claimed: Nil",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news147_html/content_86.html": "Calling time on pubs that fuel drunkenness\nAdrian says that some pubs and clubs in Ormskirk need to alter practices that lead to drunkenness and disturbance to local residents or face further controls.\nHe was speaking after a meeting that he arranged between council officers, the police and trading standards to review what additional steps could be taken to tackle the problem.\nAdrian said that in recent months he had heard from residents who suffered broken sleep in the middle of the working week through rowdiness in the early hours; vomit in hedges; and in one case, a pensioner traumatised when drunken yobs kicked her front door off its hinges and yelled abuse at her.\n\"Selling drinks at £1 a shot is irresponsible while serving drinks to someone who is already drunk is illegal. Most liquor licence holders are responsible, but a few are fuelling the anti-social behaviour and crime that residents in parts of my ward are suffering. Enough is enough.\"\n“Following the meeting that I called, the police will be increasing patrols midweek. They will also meet with town centre landlords and seek an agreement to a minimum price for alcohol. Trading standards will be organising further test purchases of alcohol to ensure it is not being sold to people underage.”\nAdrian continued saying that if voluntary measures did not work new legal powers being introduced this autumn would be considered.\n“I hope that landlords will work with the council and police to make sure that Ormskirk is a pleasant place for an evening out and that my residents can enjoy peace in their own homes. However, the new legal powers will be considered if necessary. Any powers used must be on the basis of evidence and I would urge residents to continue to report any incidents using the non-emergency 101 number and ask for a log number.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_press%20releases extra_html/content_95.html": "news archive\nBulb planting completes Wigan Road improvement project\nFinishing touches to landscaping project led by Adrian\nPublished 6 October 2013.\nLicensing Committee agrees to formally consult on possible earlier midweek pub closing\nUnanimous support for Adrian\nPublished 31 July 2013.\nNew play facilities at Coronation Park\nFunded as a result of local housing developments\nPublished 26 July 2013.\nLocal jobless figures fall to 4 and half year low\nSigns of improvement continue in local economy\nPublished 22 July 2013.\nAre Labour capable of running local council?\nAdrian asks question as Labour change leader yet again\nPublished 20 May 2013.\nNight time nuisance almost three times as high in Ormskirk as neighbouring town\nAdrian renews call for action\nPublished 11 May 2013.\nSun shines on project to improve Wigan Road street scape\nMidstream, Students Union and community work together to improve local landscape\nPublished 21 April 2013.\nStatement on death of Baronness Thatcher of Kesteven\nPublished 9 April 2013.\nCan you help with Wigan Road Community Project?\nCall goes out for help in improving local open area this April.\nPublished 9 March 2013.\nCouncil agrees to consider call for tighter midweek licensing hours\nAdrian would like to hear your views on a possible Early Morning Restriction Order\nPublished 10 February 2013.\nHelping residents through the welfare changes\nCouncil cabinet approves measures in which Adrian was a prime mover\nPublished 22 January 2013.\nArmed Forces and those who work in council house boost\nAdrian has led moves to revise the Borough Council's council housing allocation policy. Now have your say.\nPublished 13 December 2012.\nCall for tighter licensing hours in Ormskirk\nAdrian calls for council to consider using new licensing powers.\nPublished 20 November 2012.\nFree press too important to free society to regulate\nAdrian speaks on eve of Leveson report.\nPublished 12 November 2012.\nAll small commercial units now let\nSmall units all taken as Brighter Future workshop expand into Ormskirk\nPublished 8 October 2012.\nCash boost for Ormskirk town centre\nLove Ormskirk receives £20,000 in support from council to promote the market town\nPublished 26 September 2012.\nMotorfest \"bigger and better\" than last year\nAdrian was a volunteer steward at this year's event and comments here\nPublished 30 August 2012.\nIt's not all gloom on economy especially in West Lancashire\nUnemployment at lowest since 2008 as apprenticeships rise\nPublished 19 August 2012.\nProtecting wallets, purses and the environment\nAdrian explains how investment in local council housing is a win-win\nPublished 2 July 2012.\nCouncil has heart for young people\nRecent boosts for apprenticeships\nPublished 1 June 2012.\nA decent night's sleep might still be possible for town centre residents\nAdrian speaks after persuading planning committee to refuse planning applications\nPublished 24 May 2012.\n\"I'll vote for you, but...\"\nAdrian comments on local voter feeling\nPublished 10 May 2012.\nWhere were the other candidates?\nAdrian attacks other candidates for ducking hustings event\nPublished 2 May 2012.\nBig boost for apprentices in West Lancashire\nAdrian welcomes latest Challenge Project success\nPublished 11 April 2012.\nCan you spare a hour or two to smarten up Ormskirk?\nAdrian is appealing to local residents to join a community effort to smarten the street scene on an important approach road to the town\nPublished 19 March 2012. UPDATED 28 APRIL 2012\nCalling time on pubs that fuel drunkenness\nMeeting with police and licensing officers called by Adrian leads to action\nPublished 27 February 2012.\nAdditional CCTV required in Ormskirk says Adrian\nAdrian calls for additonal CCTV coverage in St Helens Road\nPublished 5 February 2012.\n£7000 raised for Birchwood Centre by Adrian and team of young people\nAdrian thanks all donors as Three Peaks appeal closes with target exceeded.\nPublished 4 January 2012.\nDraft local plan out for consultation\nAdrian points to positive changes affecting Ormskirk and Westhead and calls on residents to make their views known on latest version of local plan.\nPublished 23 December 2011.\nSuccess in 20mph school campaign\nAdrian hails news that his campaign for 20mph limits outside schools has been successful.\nPublished 1 December 2011.\nCall for businesses to take on apprentices\nAdrian calls on local business to take up council help and support young people through tough times.\nPublished 6 November 2011.\nLet's have large turnout to honour our troops\nAdrian calls for big public turnout for Freedom of Borough parade this Saturday.\nPublished 16 October 2011.\nWhy not a park and ride for Edge Hill?\nWith 45% of Edge Hill traffic passing Junction 3 a park and ride should be fully explored.\nPublished 17 September 2011.\nLandlord accreditation scheme proposed\nA report coming before council cabinet is a welcome step says Adrian.\nPublished 9 September 2011.\nMotorfest a \"roaring\" success\nAdrian hails the great community spirit on display in Ormskirk on Sunday.\nPublished 30 August 2011.\nAdrian wins extra time for public to have say on Edge Hill plans\nConsultation period on Edge Hill's latest planning application extended.\nPublished 19 July 2011.\nLitter picking local grot spot\nAdrian joins local churches in community work in Ormskirk town centre.\nPublished 30 June 2011.\nLocal Unemployment down by 300 since General Election\nAdrian welcomes fall in jobless total as vacancies rise\nPublished 19 June 2011.\nPolice need dose of fresh thinking\nWhy the police can find savings elsewhere\nPublished 14 June 2011.\nDial a Ride's Future\nAdrian speaks out on future of Dial a Ride.\nPublished 13 April 2011.\nEasing the traffic impact at Edge Hill?\nAfter Adrian raised the idea, a working group is established to try to minimise the traffic impacts\nfrom people visiting Edge Hill's campus.\nPublished 4 April 2011.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news200_html/content_12.html": "Residents Getting a \"Raw Deal” on Parking Enforcement from County Council\nOur West Lancashire Borough councillor, Adrian Owens has sharply criticised Lancashire County Council Parking Services this week\nafter figures in their annual report showed parking enforcement in West Lancashire had dropped by 39%. Adrian said, “No one wants to see overzealous traffic wardens waiting to catch unsuspecting motorists, but we have the opposite\nproblem locally. I get many complaints from residents about vehicles regularly flouting yellow line restrictions on roads around the Borough.\nThe problem has been getting worse and these figures in the Parking Service Annual Report seem to show why.” “Some Lancashire Boroughs have seen increased enforcement but West Lancashire is one of the areas of Lancashire where enforcement has\ndropped dramatically. Perhaps it is because we are on the edge of the county. Whatever the reason, West Lancashire appears to be getting a raw deal and it’s not\ngood enough.” Adrian has now written to the Head of Lancashire Parking Services demanding an explanation of the figures. Adrian concluded,“If our parking habits in West Lancashire had markedly improved then that might be an explanation for the\nreduction in tickets issued, but the complaints I regularly receive from residents and the evidence of my own eyes says this is not the case even with the savings\nin the parking service that the county council have enacted.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news198_html/content_21.html": "Labour propose cuts to services for older people at Ormskirk's Wellbeing Centre\nA working group of Labour councillors has recommended to cut all of the funding that the Borough Council provides to Age UK Lancashire for the Wellbeing\nCentre in Ormskirk. This centre promotes the holistic wellbeing of older people through a range of activities include computer sessions; keep fit; indoor bowling;\ndancing; chair exercise; arts and crafts and the popular lunch clubs. Over 1000 older people per month are assisted. The council cabinet will make the decision and Adrian has now written to all cabinet members urging them not to make this damaging cut.\nIn his letter to the cabinet Adrian said,\"The funding requested is no more and no less than Age UK Lancashire have received for many years and it constitutes a significant part of the operating budget of the\nCentre. This can be seen from the financial figures provided with the application. I have been in contact with the Chief Executive, Donna Studholme who has confirmed that there will be an effect on the services that\nthey are able to offer at the Centre if this reduction proceeds. I do not want to see, and I am sure that you do not want to see, those more than 1000 older people\nlose some of these popular and long established services. Funding can be found for this depending on the choices that are made, and I would ask you please to make a choice in favour of the Ormskirk Wellbeing Centre.\"\nCabinet will make their decision next Tuesday, 2nd February. You can contact Council Leader, Ian Moran and Older Peoples' Champion, Terry Aldridge to give your views.\nImage courtesy of QLocal Ormskirk\nUPDATE: Adrian says, \"The cabinet decided on 3rd February to push ahead with this cut. Not what Labour voters expect of a Labour council. There is no need to balance the budget by hitting the vulnerable.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news210_html/content_58.html": "Support for the proposed new local plan crumbling as MP comes out in opposition\nIndependent Councillor Adrian Owens says support for the new proposed local plan is crumbling even before the public consultation starts with the local MP, Rosie Cooper now opposing the plans put forward by her Labour council colleagues.\nAdrian said, “Our West Lancashire has been advising local residents to write to Rosie Cooper as the local MP. Initially, responses from the MP were non-committal and we advised residents further. Now however, clearly taken aback by the level of public anger at the proposals, Rosie Cooper has said that she does ‘not believe that West Lancashire Borough Council should build houses for Merseyside’”.\n““Yet the Labour council’s plan proposes just that - building more than 6000 houses for Merseyside in West Lancashire’s green belt on prime farming land. So, this puts the MP in direct opposition to her own Labour council!”\nAdrian continued,“This particular proposal on Merseyside housing, along with idea to have a plan for 30 years, was why I said this draft local plan was based on entirely the wrong premise. I am delighted that the MP has reached the same conclusion.”\n“The result will be that the prime, large sites will be snapped up first and developed rapidly by large house builders, and all this\nwithout even any promise of any significant extra road or rail links. When Preston reached a City Deal with the Government to build thousands of houses – it was a\ndeal. They got something in return the transport infrastructure needed. In contrast, there is no such promise with this ‘wing and a prayer’ draft plan in West\nLancashire. It will need local residents to reject it via the ballot box”, Adrian concluded.\n3rd September 2018\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news184_html/content_29.html": "Great news from Birchwood Centre AGM\nAdrian is proud to be a trustee of the Birchwood Centre, based in Birch Green in Skelmersdale but serving the whole of West Lancashire.\nAt the charity's AGM last week, Stella Connell, Director of the Centre announced the great news that the Centre has received funding of\nalmost £500,000 from the Big Lottery Fund to develop and expand its mediation services. Adrian said, “The Centre has successfully piloted family mediation work in Skelmersdale. The results have been positive in preventing the\nbreakdown in family relationships which so often lead to homelessness for young people. With over 50 young people needing our accommodation services last year, the more\nwe can do to prevent crisis situations in the first place. Our bid was entitled \"Mediation makes a Difference\". The pilot work demonstrated that and the Big Lottery Fund were able to see\nClearly the positive impact in preventing further family breakdown.\"\nAdrian concluded by saying that anyone interested in the work of the Centre should take a look at the Centre's website. \"We are always looking to raise awareness of our work with vulnerable young people among the wider community\", he said.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news158_html/content_78.html": "Every small council commercial unit now let in boost for economy\nAdrian, who is responsible for Regeneration and Estates at the council has warmly welcomed news that every one of the council’s small commercial units are now let, as Brighter Future Workshop have opened in the former Shopmobility unit in Ormskirk.\nAdrian said that for the first time in several years every one of the smaller units marketed by the council had been taken. “It’s great to see business bouncing back and the rents they pay mean that the council’s income in this section has increased compared to 12 months ago. That will help to soften the impact of spending reductions elsewhere.”\n“Businesses come and go, but we work hard to help fledgling businesses as this news shows. It was sad to see Shopmobility close in Ormskirk earlier this year, but I’m delighted that Brighter Future Workshop, our award-winning social enterprise have moved in at Two Saints Place. We worked hard to meet their deadline to open on time and having spoken with Peter Cousins and Jackie Tittle, they seem to be pleased with the start they have made.”\nAdrian said that some of the larger, older industrial units still posed problems. “They are not always to a size and format to suit modern industrial needs. That is why we are using some of the extra income we are generating from the small units to demolish some industrial units and then work to replace them with the type of premises demanded by 21st century business.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news211_html/content_30.html": "Support for the proposed new local plan crumbling as MP comes out in opposition\nIndependent Councillor Adrian Owens says support for the new proposed local plan is crumbling even before the public consultation starts with the local MP, Rosie Cooper now opposing the plans put forward by her Labour council colleagues.\nAdrian said, “Our West Lancashire has been advising local residents to write to Rosie Cooper as the local MP. Initially, responses from the MP were non-committal and we advised residents further. Now however, clearly taken aback by the level of public anger at the proposals, Rosie Cooper has said that she does ‘not believe that West Lancashire Borough Council should build houses for Merseyside’”.\n“Yet the Labour council’s plan proposes just that - building more than 6000 houses for Merseyside in West Lancashire’s green belt on prime farming land. So, this puts the MP in direct opposition to her own Labour council!”\nAdrian continued,“This particular proposal on Merseyside housing, along with idea to have a plan for 30 years, was why I said this draft local plan was based on entirely the wrong premise. I am delighted that the MP has reached the same conclusion.”\nThe Derby ward councillor who chairs the Our West Lancashire Council Group concluded by saying that Our West Lancashire would be holding further resident meetings in coming weeks and distributing leaflets to help inform people before making their representations during the public consultation which runs until 13th December.\n8th October 2018\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news151_html/content_61.html": "Local voters tell me: “I’ll support you locally, but I won't vote for David Cameron”\nCommenting on the local elections, Cllr Adrian Owens said, “I was delighted that the result in my ward saw a swing to the Conservatives, in sharp contrast to the anti-Conservative mood elsewhere. I thank my local ward residents for placing their support with me at the election and promise to serve them to the best of my abilities in the next four years.”\n“However, it was abundantly clear that voters were disenchanted with the current Government. I had comments saying that they would support me in a council election but that if this was a General Election, they wouldn’t support David Cameron.”\n“I have a lot of sympathy with my voters, and I have written to the Prime Minister to ensure that he understands the views of the people I met during the campaign.\"\nAdrian said that he couldn’t understand how any Conservative could promote marginal tax rates of 65-70% as would be the case with George Osborne’s so-called “improved” child benefit reforms. He also called for the government to roll up its sleeves and find additional savings so that the planned rise in fuel duty in August could be halted.\n“Local voters want to see action on their everyday concerns. They want the Government to halt fuel duty rises that could put fuel over the £1.50 a litre mark. They frankly scratch their heads at Britain sending money to prop up a failed and collapsing Eurozone when we should instead be working with our European neighbours to create a new monetary system for Europe.”\n“I hear constantly from local businesses discouraged from creating new jobs by red tape. Cutting red tape can be done without affecting deficit reduction, yet instead of pursuing this, the Government are obsessed with priorities such as gay marriage and House of Lords reform. These aren’t top of the concerns of local voters and I’ve told David Cameron so.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news196_html/content_9.html": "Time for Council to Pilot Electric Vehicle Use\nAdrian has called for the council to take a lead and purchase their first electric vehicles. Adrian said, “We have installed a Charge Point at the council offices in Ormskirk, yet strangely the council doesn’t have any current\nplans to purchase electric or hybrid vehicles.” “Clearly these vehicles aren’t suitable in every role. However, sales of electric cars have increased ten-fold in less than two years.\nTheir lower running costs will help a cash strapped council and they would be suitable for the short journeys made by some officers. It’s time to give them a try\nwhen the next suitable vehicle renewal falls due”. Adrian also highlighted the benefits that the clean emissions from such cars could bring. “We have air pollution issues in parts\nof the Borough and the council as a community leader should be piloting the use of these vehicles because of the positive contribution they could make to air quality.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news161_html/content_89.html": "Armed Forces and those who work to get extra priority for council housing\nMembers of the Armed Forces and those who work or make a community contribution will be given priority for council houses under new proposals from the Conservative Borough Council to be set out this week for consultation.\nUnder the new proposed policies, which Adrian was prominent in drafting, members of the Armed Forces with a connection to West Lancashire seeking accommodation on discharge will be placed in the highest bands for council housing such as that built by the Conservative council in Elmstead in 2011 (pictured). Those injured will be placed in the top band, A and all others in Band B.\nVal Hopley, Conservative Spokesman for Housing said, “Our Armed Forces put themselves in harm’s way for us. We Conservatives feel it is right to prioritise their housing need on their return.”\nThe policies going out for consultation also include additional priority for those in employment or who are making a community contribution through voluntary work or training.\nAdrian said, “It is important that council estates are balanced, thriving communities. We want to avoid the possibility of estates where few if any of the residents work. The new message is – If you want to increase your chance of council housing, work or make a contribution to your community. Those who volunteer or seek to improve their employment prospects through training will also get extra priority.”\nVal Hopley explained the proposed new tenure policy that is also going out to consultation. “Older people and vulnerable groups will continue to receive lifetime tenancies and no existing tenant will be affected. However, for most new tenants of working age, we are proposing new flexible tenancies lasting five years rather than a council house for life. People’s circumstances change through life and we want to ensure that our tenancies can adapt to that change and provide greater opportunities for the many people waiting for a council property.”\nAdrian urged residents to have their say in the consultation. “We believe we have the broad policy correct, but we want to hear from people, especially the thousands on our waiting lists on whom these proposed changes will impact.”\nThe council consultation can be viewed and responded to here.\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news134_html/content_44.html": "Police need a dose of fresh thinking\nCommenting on initial proposals to sell police properties at Burscough, Parbold, Scarisbrick and Rufford and close Ormskirk’s front desk to the public, Cllr Adrian Owens said that Lancashire police urgently needed “a dose of fresh thinking”.\nAdrian said, “Residents rightly expect efficient spending of their hard earned taxes. Where is the fresh thinking from the police? The Borough council and county council are sharing premises in Ormskirk and at the depot in Skelmersdale to cut costs. If the police shared premises with other public bodies the public could continue to report crimes and concerns face to face.\n\"Of course police staff should be prioritised over bricks and mortar, but when I witness five police officers or PCSOs attending Newburgh Fair at the weekend (see photo above) I seriously question if Lancashire police have lost the plot. They might not be facing the financial difficulties they claim and our police stations might not be threatened if they didn’t adopt such a profligate approach to spending.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news150_html/content_77.html": "Adrian asks: Where were the other candidates?\nAdrian, who is standing as Conservative candidate in this week's local elections, has attacked his election opponents for failing to turn up at a specially arranged election hustings for students at Edge Hill University.\nAdrian was the only candidate at the event. The Labour candidate, who lives on campus, did not attend and did not send a representative. There was also a no show from the other candidates or their parties.\nAdrian said,“It is very poor that none of my opponents, or their representatives, were in attendance at this important event. It was particularly disappointing that Labour, whose candidate is a student himself and lives on campus at Edge Hill, couldn't be bothered to turn up. This proves they are not interested in listening to students and take them for granted. It's clear they'd rather hide behind their misleading leaflets rather than debate the real local issues face to face in front of local voters.\"\n\"Edge Hill is an important part of Derby Ward and, despite the no show from other parties, I was delighted to attend the hustings and answer questions from students. I'd also like to thank Billy Jones from the Students' Union for organising the event.\"\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news156_html/content_72.html": "Motorfest bigger and better but no thanks to Labour\nHailing the success of Sunday’s Ormskirk Motorfest, Adrian said that the event had proved “bigger and better” than last year.\nAdrian, who worked as a volunteer marshal at the event said, “This year’s Motorfest was bigger and better than last year’s and proved a great family day out, especially as the sun came out for a change. It was pleasing to see the town’s retailers doing brisk business and visitors coming to our town for the first time. Hopefully many will return again.”\n“While nothing is ever perfect, and there are further improvements that can be made, Aintree Circuit Club did a fantastic job and the support from sponsors especially the Belfry Group was vital to the growth of the event this year.”\nAdrian was highly critical though of the stance of the West Lancashire Labour party in relation to Motorfest. “Firstly, at the beginning of the year they tried to strangle the Motorfest at birth by arguing that much of the council money underwriting the event should be withdrawn. There would have been no Motorfest if we had followed Labour’s line. Then, more recently, we have had the carping from our Labour MP who seems to spend more time running down our area in the local press than promoting our area’s interests at Westminster. Shame on the local Labour party.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news175_html/content_42.html": "Local Jobless figures at lowest level for 6 years\nAdrian who is the lead councillor for regeneration has welcomed this week’s sharp fall in unemployment in West Lancashire.\nAdrian welcomed figures showing that unemployment fell by more than 130 in a single month in West Lancashire in April.\nThe Borough’s jobless figure has fallen to 1587 – or 2.3% - the lowest for six years. West Lancashire’s employment performance is also significantly better\nthan the regional or national averages.\nAdrian said, “It’s private businesses that create jobs and its pleasing to see that the upturn in the economy is leading to many\nmore vacancies – more than 400 currently in Skelmersdale which gives hope to those still looking for work.”\nAdrian added that the council used its position as a leading landlord of business premises to support existing businesses and bring new\nones to the area. He said, “That’s good not just for job seekers but for local council taxpayers too as our commercial property income helps us balance budgets\nfor council services. Indeed, we are showing our confidence in the economy by building new commercial units at more than £1 million in Skelmersdale.”\nAdrian concluded by saying that the Conservative council was continuing its work with partners to ensure those further from securing\na job are helped. “We are helping our council tenants, especially those affected by welfare reform, as finding a job is the best way solution and we are\ncontinuing to promote apprenticeships in the local area. It’s pleasing to see the number of people in the Borough with no qualifications falling in 2013”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news173_html/content_41.html": "New Policy on Houses of Multiple Occupation starts to have effect\nAdrian has welcomed news that a planning inspector has backed the decision of the Borough council to refuse\nconversion of a family house on Knowsley Road into a house of multiple occupation (HMO).\nAdrian said, “This is welcome news for residents in Knowsley Road who were seeing a gradual change in the composition of households\nin the road. It’s also a vindication of the new council policy on controlling the conversion of family homes into houses of multiple occupation.”\nThe new policy, adopted as part of the new local plan, restricts the percentage of family homes which can be converted into HMOs\nin Ormskirk, Aughton and Westhead. The aim of the policy is not to prevent all such conversions but to ensure that high concentrations of HMOs do not build up\nin particular roads. The local plan was passed by the ruling Conservative group on the council.\nAdrian said, “In the recent past, high concentrations of HMOs have reduced residential amenity in some parts of Ormskirk.\nThey have also reduced the number of suitable properties in the town available to first time buyers.\nThe policy in the local plan aims to prevent neighbourhoods becoming more unbalanced and I’m very pleased that the planning\ninspector recognised this. In the same week as the inspector’s decision the council refused two further such planned conversions, so the policy is starting\nto have an effect.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news179_html/content_8.html": "Turning the Tide on Night time Nuisance\nAs Freshers’ week starts, Adrian has spoken of his cautious hopes that the tide might at last be turning on night time nuisance which has worsened in recent years.\nAdrian said that the council and its partners had pulled together the best resourced action plan for the start of the academic year.\nHe commented, “I promoted extra funds for this at the last council budget round and there will be extra policing on the streets until 3am with response teams\nafter that.”\nAdrian also said that he would be visiting the CCTV team this week to satisfy himself that CCTV including the extra cameras\ninstalled earlier this year was properly integrated with the police response.\nThere was also a new openness to learning from other areas according to the Ormskirk councillor. “Other towns experience\nsimilar issues to Ormskirk and I have long highlighted the positive work done in Loughborough, another small town with a significant University campus less than\na mile from the town centre. I’m delighted therefore that the Area Police Inspector has already spoken to colleagues in Loughborough and I understand that senior\nstaff from Edge Hill are visiting there next month to see first-hand how they work. Meanwhile, council officers are exploring another initiative at the University\nof Warwick in Leamington Spa.”\nAdrian said that a drop in reported incidents between January and June compared to the previous year gave him cautious grounds\nfor hope. “The start of the last academic year saw a rise in reported incidents but that worsening trend was reversed after Christmas. If we can continue the\nsuccess of the last few months during the difficult autumn term then we might be confidently able to say that the problem is improving.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news_html/content_3.html": "news and press releases\nRoyal Mail bosses need to sort out Ormskirk mail backlog\nAdrian calls for urgent action by Royal Mail bosses\nPublished 20 January 2021.\nDelay in Cycle Route Project to University putting lives at Risk\nResidents, bicycle commuters and local councillor unite to call on County Council to end delays over cycle route project in Ormskirk\nPublished 4 March 2020.\nPiecemeal Development Proposal threatens future of Listed Building\nFuture of Windmill pub building 'up in the air'\nPublished 5 June 2019.\nCouncil 'not interested' in retailers' needs\nAdrian criticises Council Leader for ignoring meeting request from Concourse retailers\nPublished 22 April 2019.\nSupport for the proposed new local plan crumbling as MP comes out in opposition\nNow Rosie Cooper opposes her Labour colleague's local plan proposals\nPublished 8 October 2018.\nNew Local Plan proposals for 16,000 new houses based on entirely the wrong premise\n- and there’s no deal with Government for the new transport links that would be needed\nPublished 3 September 2018.\nWindmill application returns\nPlans to turn former Ormskirk pub into student accommodation resurface\nPublished 17 August 2018.\nGraffiti removal in town centre\nAdrian grabs paint roller to give shoe shop wall a facelift\nPublished 15 June 2018.\nAt last Borough and County Council come to their senses on Grounds Maintenance\nAdrian warmly welcomes the end of finger pointing between our councils\nPublished 12 November 2017.\nAdrian wrings grounds maintenance work out of councils\nCouncils make limited promises of improvements in advance of The Open Championship\nPublished 17 July 2017.\nPublish confidential cabinet report says Adrian\nPublic should be able to form their own opinion on car park cameras proposal\nPublished 31 March 2017.\nWater Tower Proposal could raise privacy & overlooking issues\nAdrian raises awareness of latest proposal to redevelop Tower Hill's landmark\nPublished 19 December 2016.\nNo answers and no plan for green bin charge\nLabour are making it up as they go along\nPublished 3 November 2016.\nParking chaos around Edge Hill looms again\nLancashire Parking Services frustrating progress\nPublished 16 August 2016.\nSafety Fears Eased after Council agrees to Extra Parking Spaces\nAdrian works with Westhead residents to achieve a result\nPublished 27 June 2016.\nRaw deal from county council on Parking Enforcement\nFigures show parking enforcement down 39% year on year while some areas of Lancashire see rise\nPublished 22 May 2016.\nFat Olive move \"provocative\"\nAdrian says developer's move is a kick in the teeth for Ormskirk\nPublished 5 February 2016.\nLabour propose cut to services for older people in Ormskirk\nAdrian writes to cabinet to urge them to reject working group recommendation\nPublished 27 January 2016.\nRebalance the Wigan Road community\nRefusal of planning appliction for the Windmill gives an opportunity to rebalance the local housing mix\nPublished 16 November 2015.\nCouncil should pilot electric vehicles\nAdrian says time is right for council to experiment with their first electric powered vehicles\nPublished 9 November 2015.\nRuff Wood sparkles a little brighter\nAdrian leads community effort to polish up Ruff Wood\nPublished 4 September 2015.\nLancashire county council dragging feet on HGVs\nAdrian joins forces with residents to highlight a missed opportunity by county council\nPublished 10 August 2015.\nStudent flats turned down at Fat Olive\nAdrian supported concerned residents\nPublished 1 August 2015.\nUpdate on Edge Hill traffic and parking problems\nAdrian provides update as start of academic year draws near\nPublished 29 July 2015.\nSpeed enforcement by camera back at last in Westhead\nAdrian explains saga of Westhead speed camera.\nPublished 2 July 2015.\nReplace diseased tree call to county council\nBorough council wants highways tree replaced in conservation area and Adrian backs their stance.\nPublished 8 June 2015.\nEnd delay on student accommodation data\nAdrian says delay in getting updated student accommodation data puts planning committee in difficult position in considering latest planning applications\nPublished 1 June 2015.\nAn Open Letter to the Mayor-Elect\nAdrian asks Mayor-Elect to forego some allowances. £32,000 from the public purse for voluntary roles in straitened times is too much\nPublished 15 May 2015.\nIntroduce public question time at council meetings\nWhat's right for residents of Preston and Lancaster should be right for West Lancashire residents too\nPublished 16 February 2015.\nStrange goings on in budget preparations\nDelay in publication of budget estimates unprecedented and explanations not forthcoming\nPublished 9 February 2015.\nCelebrating improvements at Ruff Wood\nChildren from Westhead St James school help celebrate the improvements at Ruff Wood\nPublished 2 February 2015.\nGreat news from Birchwood AGM\nWest Lancashire charity secures £500,000 for mediation work with troubled families\nPublished 30 January 2015.\nLancashire county council consultation a \"travesty\"\nAdrian slams county council for slipping out cuts proposals in pre-Christmas rush\nPublished 4 December 2014.\nNew ASB legislation offers greater hope to curtail rowdy partying\nAdrian hopes new legislation will help\nPublished 21 November 2014.\nDon't delay repointing of Aughton Street\nAdrian has written to the county council portfolio holder urging speedy repairs to Aughton Street\nPublished 26 October 2014.\nDon't short change council tenants\nAdrian secures unanimous all party support on scrutiny committee to ensure identified savings benefit tenants as soon as possible\nPublished 6 October 2014.\nTurning the tide on night-time nuisance\nPositive signs at last\nPublished 20 September 2014.\nAdrian challenges British Telecom over Superfast Broadband\nParts of Ormskirk town centre must not be left in slow lane\nPublished 24 August 2014.\nAdrian is completely opposed to European Arrest Warrant\nAdrian's letter to the press on the subject\nPublished 10 July 2014.\nAnnual Council 11th June - Personal Statement\nAdrian makes personal statement\nPublished 13 June 2014.\nLocal jobless at lowest for 6 years\nAdrian welcomes signs of economy having turned\nPublished 19 May 2014.\nBoost for those who work\nWorkers getting allocated more council houses\nPublished 1 February 2014.\nNew Policy on Houses of Multiple Occupation starts to have effect\nPlanning Inspector backs council stance\nPublished 5 January 2014.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news169_html/content_47.html": "local unemployment at lowest for four and a half years\nThe fall in the Borough’s unemployment to its lowest for four and a half years has been welcomed by Adrian who is the council’s lead member for regeneration this week.\nAdrian welcomed figures showing that West Lancashire’s jobless figure has fallen to 2055 – or 3% - the lowest since November 2008. West Lancashire’s employment performance is also significantly better than the regional or national averages.\nAdrian said “These figures, along with recent surveys of business confidence in the region, suggest that the economic situation is improving further. We are certainly seeing signs of that improvement locally. We know of companies with healthy order books and business enquiries and new tenancies are picking up.”\n“At the council we’ve recently offered 40 work experience places through our Regenerating Homes programme, leading to apprenticeship opportunities. These signs of greater confidence and our work experience and apprenticeship programmes locally give hope to young people leaving education this summer and to those affected by welfare changes.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news191_html/content_51.html": "Speed enforcement in Westhead by camera back at last\nFinally speeding motorists will be taking a risk travelling through Westhead after county officers confirmed the speed camera will be back in use again. Following questions from a concerned resident, Adrian pursued a Freedom of Information request with Lancashire Police and found that the camera had been non-operational since October\n2012! The police indicated that there was a legal issue with the traffic regulation order which prevented camera enforcement. Adrian said, “As soon as I raised the matter with the police in November last year - 2 years after enforcement stopped, the county council were\nfinally spurred into action. It has still taken them a further 8 months to get the revised order in place which I view as very poor. The lack of a joined up approach between county council and police appears to be at the root of this which traces back\nto the split in camera maintenance and revenue generating responsibilities.” Adrian concluded, “I am not the biggest fan of speed cameras but they have their place, especially here close to a primary school.\nI have written to the police and will monitor to check that the camera is working as it should be.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news159_html/content_88.html": "Free press too important to free society for state to regulate\nAdrian has sent the following letter to the local press:\n“Dear Sir,\nMore than 40 Conservative MPs and peers wrote a letter to the Guardian last week calling for state regulation of the press. They are supported by MPs in the other main parties. Lord Leveson’s inquiry may also call for regulation of the press.\nGiven the phone hacking scandal and some of the other intrusions into privacy, such calls are well-intentioned, but they are nevertheless wrong.\nA free press is a fundamental element of a free society. We have just remembered those who died in war. The regimes we fought in those wars had strangled their free press .\nEven if regulation is well-intentioned it may not be effective. The BBC is regulated – that regulation has not prevented the woeful errors made recently in that institution. The criminal law, not least that of libel, provides a check on any press excesses.\nIt was a free press that exposed the MP expenses scandal and they continue to expose corruption and incompetence in public bodies. In a democracy with elections only every 4 or 5 years, what holds governments and local councils to account in the years between elections? Surely it’s a confident and questioning press not hidebound by regulation that reminds those in authority that they are servants and not masters.\nThe system for licensing publications was abolished in 1694 following the Bill of Rights. Let’s not time the clock back more than three centuries.\"\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news181_html/content_52.html": "Let’S Get Aughton Street repointed now\nAdrian has expressed frustration this week at the delays in repointing the paving sets in Aughton Street.\nAdrian said, “The pointing in Aughton Street is badly damaged and poses a hazard to pedestrians, especially those less steady\non their feet. The problem has been raised with me by numerous local residents.”\n“The funding for the re-pointing is in place, but Lancashire county council officers seem to be tying the work in with the Moor\nStreet improvements. Those won’t start until the late winter or spring. There is no good reason to delay the repointing of Aughton Street until then. I know that\nBorough council officers are frustrated about the delay as the work, once started, would be completed in only a few days.”\nAdrian said that he had written to the county council portfolio holder, Cllr John Fillis requesting him to\nintervene and speed up the re-pointing. “The county council are the Highways authority and are leading on repairs and improvements to the pedestrian areas.\nI hope that Cllr Fillis will be able and willing to get these repairs completed more quickly.”\nTo navigate back to Press Releases, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news140_html/content_75.html": "45% of Edge Hill traffic passes Junction 3 of M58 - why not a Park & Ride?\nAs the new University year starts this week with increased traffic congestion, Adrian has said Junction 3 of the M58 is the ideal location for a park and ride facility\nAdrian said, “A new analysis shows that 45% of Edge Hill traffic passes Junction 3 of the motorway. In the coming weeks, we will see significant additional congestion on local roads, especially the A570, so a park and ride located near that junction would make sense and significantly reduce that congestion.”\nAdrian has previously successfully pressed for a transport working group involving the council and Edge Hill to be established. He added that he was pleased at small improvements to traffic management agreed by the transport working group.\nAdrian said, “The improvements to the parking permit system and the new electronic entrance signs will assist, but the fundamental problem is too many cars on the finite amount of tarmac on the roads leading to the University. Switching car users to shuttle buses near Junction 3 would improve traffic flows. I understand that Ormskirk hospital bosses now support a park and ride and it seems an option that needs detailed exploration.”\n“The coming weeks will see the same issues as previous years – too many cars traveling at the same time to the same location. Traffic is so bad that earlier this year the bus timetable from St Helens to Ormskirk had to be reduced because of it, and the extra drag it places on all local businesses is the last thing our area needs in these tough economic times.”\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news138_html/content_65.html": "Motorfest a \"roaring\" success\nThousands of people packed Ormskirk on August Bank Holiday Sunday as the first Ormskirk Motorfest roared into town.\nThe Motorfest was organised by Aintree Circuit Club and was championed by club member and local Borough Council Officer, Colin Brady. The event was strongly supported by the Conservative council who financially underwrote the event with the sum of £10,000 even when others cast doubt on proceeding.\nLocal people were stalwarts of the event and even the occasional light shower couldn't dampen spirits as cars and motorbikes lapped the town centre. Cars as old as a 1915 vintage Austin were in action, along with the ill-fated aluminium De Lorean sportscar. Seeing a Formula One racing car in action on Derby Street was a sight not to be forgotten.\nAdrian hailed the event a roaring success. \"The Motorfest was a fantastic community event. For instance, I saw ward residents of mine not only enjoying the spectacle but acting as event stewards and driving cars and motorbike/sidecars in the event itself. The event was of a scale where all the family could enjoy and experience the history and range of motor vehicles close up. Well done to Aintree Circuit Club, Colin Brady from the council and my Conservative councillor colleagues for backing this event and raising Ormskirk's profile among the many visitors.\"\nFor more pictures and a flavour of the day see http://www.youtube.com/watch?v=jWOv51nnmvA&sns=em , courtesy of young Scarisbrick resident Adam Fowler.\nTo navigate back to Press Archive, click here.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_beliefs_html/content_49.html": "beliefs and priorities\n• Adrian strongly believes in the model of political leadership where the leader is servant. The concept of public service is increasingly obscured. Too many politicians are in it for what they can get out.\n• Adrian is on the side of the majority of people who work hard and pay their taxes. The waste of human potential and financial cost of those on benefits must be tackled: everyone has something to offer. Extra help should also be provided to tackle the tragedy of personal debt.\n• Adrian will fight to protect our local environment and the heritage that makes West Lancashire's different communities varied and unique.\n• Adrian believes that government - national and local can't, and shouldn't, be expected to do everything. Communities are stronger when individuals and families come together with encouragement and support from agencies. In West Lancashire, charities and social enterprises often reach those people that government fails.\n• Adrian believes that more needs to be done within West Lancashire to tackle the barriers between some of our communities. By working smartly we can bring more of the skills and resources of those fortunate enough to be fluorishing to help those less fortunate to also develop.\n• Adrian believes that politicians do not know it all. That is why he supports giving voters more say, whether here in West Lancashire, nationally or in referendums such as the one on membership of the European Union.",
  "http_www_adrianowens_com_index_htm/http_www_adrianowens_com_news170_html/content_40.html": "derby ward councillors finance new play equipment for older children and teens in coronation park\nThere's one less reason for older children and teens to get bored this summer holidays with the opening of the new play area in Coronation Park. Designed with older children and young teens in mind, the new facilities include a zipwire; waltzer type roundabout; mini climbing wall and cradle swing.\nAdrian welcomed the opening of the new facility saying, \"Derby ward councillors surveyed local residents last autumn about three ideas for open space improvements from monies arising from new housing developments at the hospital and old Grammar School sites. All three ideas received good support. The improvements to benches at Victoria Park have already taken place and improvements at Ruff Wood are in the offing. I particularly welcome these facilities as I often receive views that there is not enough to amuse older children in Ormskirk.\"\n“My children have already tried out the new play equipment and gave it the thumbs up. It was being well used when we went along. It extends the age range catered for by the play equipment in the park and continues the ongoing improvements over the last decade which have made Coronation Park a local facility in which we can have pride.”\nFor events in the Park this summer visit the Leisure and Tourism section of the Council website.\nTo navigate back to Press Releases, click here."
}