{
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_edi-officer/content_11.html": "Janine Pyke\n’ve been a GPEW member since 2018 although I have always been extremely active in green issues for many years beforehand. I was on the steering group for Save Druridge and was the lead employee representative for recycling etc. at Gateshead Council. I had never been a member of any political party because I had assumed, incorrectly, that it would be too expensive. A heads-up for anyone trying to recruit others to our cause – we have annual and monthly membership starting from bargain amounts.\nI was proud to serve four years on the regional council (GPRC) and Appeals Committee until February 2024 and I am a member of a number of liberation groups. I have a particular interest in Disability Greens. I’m an active member of my local party before and after our merger and have assisted in leafleting for a number of candidates over the years.\nI’d love to see our membership grow and the Party’s political influence increase exponentially as we really are the only Party with a genuine and passionate interest in environmental issues and true social justice.\nEDI Role\nMy view of the Green Party and my role as EEDI Officer is that we should act in an exemplary manner in the way we treat and care about our membership.\nAs a membership-led party, we are all equals and deserve equal respect and consideration, while also recognising that some members may need additional support to ensure equity..\nI intend to work with the Regional EEDI Officer, the Party’s EEDI Officer and central office staff and main Liberation Groups to ensure we are compliant with the law and latest guidance. I welcome input from other members in our local party and I aim to represent everyone and will act as liaison with the national party.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2025_01_29_northumberland-green-party-neca-transport-plan-response-jan-2025/content_4.html": "The NECA summary document lacks virtually all context and jumps directly to the policies and proposed projects.\nOur overview is that the aims and objectives are unobjectionable ‘motherhood and apple pie’. All good, what’s not to like! The focus on improved services, integrated services, better sustainable travel and lower environmental impacts is fine, apart from a sweeping statement that the NE has above average trips per person which is ‘good’, but even more trips are desirable as it would improve the regional economy! Travel is generally considered a necessary evil consuming people’s money and time, not a ‘good’: if high levels of trips lead to a better economy, and the NE already has higher levels than average, how come the NE des not have a stronger economy? This whole line of reasoning lacks any substance.\nThere is no analysis of how the conversion of objectives to policies is undertaken. The first priority is apparently to create a ‘Transport NE’ unified identity – no doubt great for politicking by the Mayor but not necessarily any pragmatic benefit in terms of travelling around the region, let alone making journeys outside the region.\nMore substantial issues are in relation to investment in improved roads (including dualling the A1 and improving the A19) and creating improved road freight access to the airport and regional sea ports. Nothing in the background papers suggests any requirement for this, though a single sentence suggests these investments will somehow reduce CO2 emissions from road transport.\nThere are fanciful and unquantified promises to increase the range of Public Transport Services to serve all communities, and to increase the level of service to cover journeys from early morning to late at night. These policies are seemingly universal and are uncosted.\nOf more practical benefit are proposals for a single travel information source, for creation of transport hubs with provision for sustainable travel including bike hire and all available modes of public transport and community facilities (whatever they may be). The proposal to improve the quality of walking and cycling routes is welcome and sits alongside a commitment to repair potholes. A recognition of the need for people to feel safe and secure – even if limited to women and girls – and the inclusion of road traffic accident reduction goals has to be welcome. We do wonder where the boundary is between the actions and policies of the mayor, and the responsibilities of the Local Councils: we were told the Mayor is to have powers cascaded down from central government, but much of this looks like duties being moved up from local councils; ie, the exact reverse of devolution.\nThere is a suggestion of a welcome link to planning policy, emphasizing that new development must incorporate high quality walking and cycling routes, and support existing public transport services. Beyond that it is proposed that major new development should be concentrated along the Leamside Railway line to maximise the accessibility benefits. We are not clear whether the NECA has the planning powers to ensure these policies can be brought about, especially as they may not align with the proposed relaxation of Planning controls currently being floated by the government or local housing targets..\nFinally there is the cost of it all. Many of these policies are expensive, some of them unlimited in their aspirations and expensive to deliver. The Plan makes only one reference to money in stating that the Mayor has been granted additional funds for the region – but we are certain those funds scarcely touch the edges of the ambition in this document. If it cannot all happen, what are the priorities?\nWe urgently suggest that priorities for implementation should be:\nSO AS TO STRENGTHEN ACTIVE TRAVEL\nIntroduction of a default 20mph within all settlements throughout the region, so that safety of more vulnerable road users is recognised as paramount. This speed limit should only be varied by prior approval and in certain very specific circumstances (eg dual carriageways where controlled crossings – or bridges or tunnels – are provided at regular internal)\nA minimum percentage of all annual highways budgets throughout the region –10% or more – to be ringfenced to provide physical infrastructure to enable active travel, or to make it safer (eg separated cycle lanes, widening pavements, narrowing of carriageways)\nALL individual interventions on the A1 through Northumberland to include infrasturcture to allow non-motorised traffic to cross from east to west without entering onto the carriageway (ie, bridges or tunnels)\nSO AS TO IMPROVE PUBLIC TRANSPORT\nIncrease bus services throughout the region (and including cross-border services to adjacent regions and to Scotland) both within settlements and between settlements\nIn such rural areas, the vast majority of bus journeys cannot by their nature be truly door-to-door: therefore, so as to enable the “last mile” of more journeys, ensure that ALL bus services that extend beyond a single settlement should include space for at least two cycles\nSee below for the link to the NECA transport plan\nhttps://www.northeast-ca.gov.uk/how-we-work/transport/transport-plan",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2025_02_20_green-party-announce-election-candidate-for-new-alnwick-hotspur-ward-article-in-northumberland-gazette/content_13.html": "20 February 2025 / 20 February 2025 by David Tunnell\nRead full article by following the link.\nhttps://www.northumberlandgazette.co.uk/news/politics/green-party-announce-election-candidate-for-new-alnwick-hotspur-ward-4998922",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_councillor-nick-morphet/content_14.html": "I grew up in the Tyne Valley and have been passionate about environmental issues since an early age.\nAfter leaving school I studied zoology and veterinary science and I then spent seventeen years working in veterinary practice, much of this time being spent working to improve animal welfare.\nIn 2015 I re-engaged with environmental issues and became more political, and it didn’t take me long to establish a deep connection with Green Party politics. I gained political experience by standing as a paper candidate in Byker in 2016. In 2018 I gained an MSc in Wild Animal Health, but before beginning a career in wildlife medicine I took a break to work as a care worker and to represent the Green Party in the 2019 General Election. The following year I offered to stand as a target ward candidate in the 2021 local elections.\nA successful Target To Win campaign led to me becoming County Councillor for Humshaugh and leader of Northumberland County Council’s Green Party group, a job that I take very seriously. Being group leader gives me the opportunity to influence decisions and promote the politics of People and Planet.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_treasurer/content_24.html": "Jan Rosen\nAs Treasurer, I am committed to maintaining responsibility and accountability, not only for managing our finances but also for securing the necessary funding to support the election of local councillors. This necessitates fostering a culture of internal transparency to ensure our members have complete visibility into our financial operations.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2024_04_11_test-post/content_19.html": "I’ve been working on a community-based project focused on rewilding our towns and villages and would love to get as many Green party activists as possible involved. The plan is to plant, plant and plant some more. The common thread that connects us all in the Greens is a love for nature, and what better way to connect with others than getting together whilst planting for all to enjoy? Bare root planting season is over, now the big yellow thing in the sky has returned, but the seed planting season is in full swing. Let’s boost our lived-in areas with the tools to support wildlife and beautify it for us all! If you’d like to know more or get involved, please contact me. All are welcome, Green members or not, it doesn’t matter, we all benefit from increased biodiversity and if we pick up new members along the way then it’s a win-win.\nPete Burns (April 2024)",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2024_06_15_environment-hustings/content_18.html": "Your chance to quiz the candidates on their environmental positions.\nWednesday 19th of June at the St James’ Church in #alnwick, doors open 7.15pm.\nCome along and participate; all are welcome and encouraged to attend.\nPublished and promoted by Steve Leyland on behalf of The Green Party, both at 83 Doxford Place, Cramlington, Northumberland NE23 6DX",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_category_local-news/content_17.html": "20 February 2025 / 20 February 2025 by David Tunnell\nRead full article by following the link. https://www.northumberlandgazette.co.uk/news/politics/green-party-announce-election-candidate-for-new-alnwick-hotspur-ward-4998922\nRead more »\n4 February 2025 / 4 February 2025 by David Tunnell\nThere is increasing public concerns about the amount of raw sewage being pumped into our rivers and threatening wildlife. This also can effect water quality on our beautiful Northumberland beaches. Attached is a map which gives an up to date interactive map which shows where spillages occur. https://www.sewagemap.co.uk\n29 January 2025 / 29 January 2025 by David Tunnell\nThe NECA summary document lacks virtually all context and jumps directly to the policies and proposed projects.Our overview is that the aims and objectives are unobjectionable ‘motherhood and apple pie’. All good, what’s not to like! The focus on improved services, integrated services, better sustainable travel and lower environmental impacts is fine, apart from a […]\n28 August 2024 / 31 August 2024 by David Tunnell\nCramlington Eastfields By-election Results In June, Christine Dunbar, the incumbent Conservative County Councillor in Cramlington Eastfield ward, stood down triggering a by-election. I’m pleased to report that long-time member Paul Evans offered to stand as a paper candidate in the election. We knew this seat would be heavily fought between the Tories and Labour, but […]\n15 June 2024 by David Tunnell\nYour chance to quiz the candidates on their environmental positions. Wednesday 19th of June at the St James’ Church in #alnwick, doors open 7.15pm. Come along and participate; all are welcome and encouraged to attend. Published and promoted by Steve Leyland on behalf of The Green Party, both at 83 Doxford Place, Cramlington, Northumberland NE23 […]\n28 May 2024 / 28 May 2024 by Jan Rosen\nby Northumberland Green Party in Cramlington, Northumberland, United Kingdom The General Election is way overdue, but is finally here: this is our opportunity to turn the page on fourteen years of austerity, chaos and division, and to make a bold statement on our priorities for the future – real hope and real change, so as to ensure a safe […]\n4 May 2024 / 4 May 2024 by Jan Rosen\nOur next regular members’ meeting will be held on Saturday, May 11th, from 2 to 4 p.m., at Hexham Community Centre, Gilesgate, Hexham NE46 3NP. If you’re not a member but interested in joining or learning more about the Green Party, please come along: you’ll be made very welcome. The Community Centre is a 5-minute […]\n3 May 2024 / 3 May 2024 by Jan Rosen\nCongratulations to Green Party Member Khaled Musharraf as he is Green to ever be elected in Newcastle Upon Tyne. Here is the link to the Chronicle article.\n11 April 2024 / 11 April 2024 by Steve\nI’ve been working on a community-based project focused on rewilding our towns and villages and would love to get as many Green party activists as possible involved. The plan is to plant, plant and plant some more. The common thread that connects us all in the Greens is a love for nature, and what better […]",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_news/content_5.html": "Election Fundraising 28 May 2024 / 28 May 2024 by Jan Rosen by Northumberland Green Party in Cramlington, Northumberland, United Kingdom The General Election is way overdue, but is finally here: this is our opportunity to turn the page on fourteen years of austerity, chaos and division, and to make a bold statement on our priorities for the future – real hope and real change, so as to ensure a safe […] Read more »\nGreen Party announce election candidate for new Alnwick Hotspur ward – Article in Northumberland Gazette 20 February 2025 / 20 February 2025 by David Tunnell Read full article by following the link. https://www.northumberlandgazette.co.uk/news/politics/green-party-announce-election-candidate-for-new-alnwick-hotspur-ward-4998922 Read more »\nLocal Sewage Spills 4 February 2025 / 4 February 2025 by David Tunnell There is increasing public concerns about the amount of raw sewage being pumped into our rivers and threatening wildlife. This also can effect water quality on our beautiful Northumberland beaches. Attached is a map which gives an up to date interactive map which shows where spillages occur. https://www.sewagemap.co.uk Read more »\nNORTHUMBERLAND GREEN PARTY – NECA TRANSPORT PLAN RESPONSE – Jan 2025 29 January 2025 / 29 January 2025 by David Tunnell The NECA summary document lacks virtually all context and jumps directly to the policies and proposed projects.Our overview is that the aims and objectives are unobjectionable ‘motherhood and apple pie’. All good, what’s not to like! The focus on improved services, integrated services, better sustainable travel and lower environmental impacts is fine, apart from a […] Read more »\nCramlington Eastfields By-election Results 28 August 2024 / 31 August 2024 by David Tunnell Cramlington Eastfields By-election Results In June, Christine Dunbar, the incumbent Conservative County Councillor in Cramlington Eastfield ward, stood down triggering a by-election. I’m pleased to report that long-time member Paul Evans offered to stand as a paper candidate in the election. We knew this seat would be heavily fought between the Tories and Labour, but […] Read more »\nEnvironment Hustings 15 June 2024 by David Tunnell Your chance to quiz the candidates on their environmental positions. Wednesday 19th of June at the St James’ Church in #alnwick, doors open 7.15pm. Come along and participate; all are welcome and encouraged to attend. Published and promoted by Steve Leyland on behalf of The Green Party, both at 83 Doxford Place, Cramlington, Northumberland NE23 […] Read more »\nNorthumberland Green Party Meeting 4 May 2024 / 4 May 2024 by Jan Rosen Our next regular members’ meeting will be held on Saturday, May 11th, from 2 to 4 p.m., at Hexham Community Centre, Gilesgate, Hexham NE46 3NP. If you’re not a member but interested in joining or learning more about the Green Party, please come along: you’ll be made very welcome. The Community Centre is a 5-minute […] Read more »\nGreen Party enjoys historic night in Newcastle with double win to get its first city councillors 3 May 2024 / 3 May 2024 by Jan Rosen Congratulations to Green Party Member Khaled Musharraf as he is Green to ever be elected in Newcastle Upon Tyne. Here is the link to the Chronicle article. Read more »\nCommunity Rewilding 11 April 2024 / 11 April 2024 by Steve I’ve been working on a community-based project focused on rewilding our towns and villages and would love to get as many Green party activists as possible involved. The plan is to plant, plant and plant some more. The common thread that connects us all in the Greens is a love for nature, and what better […] Read more »",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_people/content_10.html": "2025 Council Elections Candidates\nIvor RacKham Green Party Candidate for Amble west and Warkworth, 2025, Northumberland county Council Local elections\nI’ve run my own successful photography, training and technology support business for the last decade. I’m also a writer. Previously, I was the election agent for the local Green Party in a general election and I’ve championed environmental campaigns. I’m also a town councillor and hold various voluntary positions\nAntonia Azocar-Nevin Green Party Candidate for HUMSHAUGH, 2025, Northumberland county Council Local elections\nI am a qualified gardener and love spending my time outdoors. I want to be a councillor because I’m passionate about environmental issues and the wildlife crisis. Working at Belsay I developed my own utopia for beneficial pollinators: I researched native and non native plants to create a cottage garden feel, and used natural detergents like garlic spray and iron infused straw mulch. I used to work in youth and community work, with litter picks and gardening days for all. I’m also finishing a qualification in forest school as I believe the education of the outdoors for our youth of today will make a big difference for a better future!\nMartin Swinbank Green Party Candidate for ALNWICK HOTSPUR, 2025 Northumberland County Council Local Elections\nAs a County Councillor over the last four years in the 2-seat ward of Alnwick, I’ve seen just how important it is to work collaboratively with Councillor colleagues and council officers to support the ward. Despite Alnwick now being split into two wards, I will continue to work across both physical and political boundaries to achieve the best outcomes for Alnwick and Edlingham. Good decisions are made and outcomes achieved when Councillors are free to challenge existing norms, power structures and political control. As a Green, I’m free to do just that and I look forward with positivity to address the many challenges we face\nJan Rosen Party Candidate for Morpeth North, 2025, Northumberland county Council Local elections\nI am an instrumentation engineer, after previously working for technology and environmentally sustainable solutions. I studied Geography and Environmental Management and Leadership and Management at Northumbria University. I am married to Lisa, who I met at Cork airport while on a business trip to Ireland, and we live in the centre of Morpeth with our black labrador. I am involved with local community groups and charities and am currently Treasurer of the Northumberland Green Party\nYour Local Councillors\nCll. Nick Morphet, Northumberland County Council\nI grew up in the Tyne Valley and have been passionate about environmental issues since an early age.\nCll. Martin Swinburn, Northumberland County Council\nI’ve long been involved in many Green issues, for example I was part of the team who helped stop\nYour Name Here.\nPlease get in touch if you feel you can help us winning seats in the coming elections\nYour Local Officers\nTom Stewart, Coordinator\nI have been a member of the Green Party for ten years, and have lived, worked and cycled in Northumberland for thirty years. I have particular interest in improving existing housing, and in improving opportunities for young people and following generations.\nJan Rosen, Treasurer\nAs Treasurer, I am committed to maintaining responsibility and accountability, not only for managing our finances but also for securing the necessary funding to support the election of local councillors.\nJanine Pyke, EDI Officer\nI’ve been a GPEW member since 2018 although I have always been extremely active in green issues for many years beforehand. I was on the steering group for Save Druridge and was the lead employee representative for recycling etc. at Gateshead Council.\nPete Burns, Membership Officer\nHi I’m Pete,\nOriginally I’m from Glasgow but spent my youth in Alnmouth. As an adult I have lived in Newcastle, Aberystwyth, Glencoe, Southampton and have finally settled in Morpeth with my wife and our three children.\nSteve Leyland, Nominations Officer\nThe Nominations Officer role is very much an administration task ensuring that our candidates are correctly reported to Northumberland County Council’s Elections Office in a timely fashion.\nYour Name Here…\nPlease get in touch if you feel you can help us winning seats in the coming elections.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_author_jan-rosen/content_25.html": "28 May 2024 / 28 May 2024 by Jan Rosen\nby Northumberland Green Party in Cramlington, Northumberland, United Kingdom The General Election is way overdue, but is finally here: this is our opportunity to turn the page on fourteen years of austerity, chaos and division, and to make a bold statement on our priorities for the future – real hope and real change, so as to ensure a safe […]\nRead more »\n4 May 2024 / 4 May 2024 by Jan Rosen\nOur next regular members’ meeting will be held on Saturday, May 11th, from 2 to 4 p.m., at Hexham Community Centre, Gilesgate, Hexham NE46 3NP. If you’re not a member but interested in joining or learning more about the Green Party, please come along: you’ll be made very welcome. The Community Centre is a 5-minute […]\n3 May 2024 / 3 May 2024 by Jan Rosen\nCongratulations to Green Party Member Khaled Musharraf as he is Green to ever be elected in Newcastle Upon Tyne. Here is the link to the Chronicle article.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_author_steve-leyland/content_21.html": "11 April 2024 / 11 April 2024 by Steve\nI’ve been working on a community-based project focused on rewilding our towns and villages and would love to get as many Green party activists as possible involved. The plan is to plant, plant and plant some more. The common thread that connects us all in the Greens is a love for nature, and what better […]\nRead more »",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_author_david-tunnell/content_6.html": "20 February 2025 / 20 February 2025 by David Tunnell\nRead full article by following the link. https://www.northumberlandgazette.co.uk/news/politics/green-party-announce-election-candidate-for-new-alnwick-hotspur-ward-4998922\nRead more »\n4 February 2025 / 4 February 2025 by David Tunnell\nThere is increasing public concerns about the amount of raw sewage being pumped into our rivers and threatening wildlife. This also can effect water quality on our beautiful Northumberland beaches. Attached is a map which gives an up to date interactive map which shows where spillages occur. https://www.sewagemap.co.uk\n29 January 2025 / 29 January 2025 by David Tunnell\nThe NECA summary document lacks virtually all context and jumps directly to the policies and proposed projects.Our overview is that the aims and objectives are unobjectionable ‘motherhood and apple pie’. All good, what’s not to like! The focus on improved services, integrated services, better sustainable travel and lower environmental impacts is fine, apart from a […]\n28 August 2024 / 31 August 2024 by David Tunnell\nCramlington Eastfields By-election Results In June, Christine Dunbar, the incumbent Conservative County Councillor in Cramlington Eastfield ward, stood down triggering a by-election. I’m pleased to report that long-time member Paul Evans offered to stand as a paper candidate in the election. We knew this seat would be heavily fought between the Tories and Labour, but […]\n15 June 2024 by David Tunnell\nYour chance to quiz the candidates on their environmental positions. Wednesday 19th of June at the St James’ Church in #alnwick, doors open 7.15pm. Come along and participate; all are welcome and encouraged to attend. Published and promoted by Steve Leyland on behalf of The Green Party, both at 83 Doxford Place, Cramlington, Northumberland NE23 […]",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2024_05_03_green-party-enjoys-historic-night-in-newcastle-with-double-win-to-get-its-first-city-councillors/content_9.html": "3 May 2024 / 3 May 2024 by Jan Rosen\nCongratulations to Green Party Member Khaled Musharraf as he is Green to ever be elected in Newcastle Upon Tyne.\nHere is the link to the Chronicle article.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_councillor-martin-swinburn/content_26.html": "I’ve long been involved in many Green issues, for example I was part of the team who helped stop the proposed opencast coalmine at Druridge Bay. I became an Alnwick Town Councillor in 2013 and have represented Alnwick on Northumberland County Council since May 2021, as one of the first two Green Councillors elected. I’m a Friends of the Earth member, support two community orchards in Alnwick and I am helping develop a Greenway route along a stretch of the former Alnwick to Cornhill railway line. I work as an installer of solar water heating systems and enjoy cycling and dinghy sailing. I love finding ways to reduce my ecological impact on this beautiful and wonderful planet we call Earth, and inspiring others to do likewise.\nSpeaking out on environmental and social justice issues in County Council meetings has had a discernable and positive effect. Environmental and Climate policies have been strengthened across the Council and social justice issues continue to be pressed. Having Greens in the room has held the Administration to account on numerous occasions including on the declaration of an Ecological Emergency and ensuring that new schools are built to extremely high energy efficiency standards.\nAs a Town Councillor I’ve persuaded the Council to declare a Climate Emergency and we are working to refresh our Neighbourhood Plan where I lead on Transport. Having Greens in the room helps ensure that the revised Neighbourhood Plan will prominently feature Active Travel, Affordable Housing and Climate & Nature.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_gdpr-privacy-policy/content_8.html": "Click below to download PDF document\nhttps://northumberland.greenparty.org.uk/wp-content/uploads/sites/245/2024/10/Privacy-Policy.pdf\nPrivacy Policy\nKeeping your data safe\nLast updated: 05/10/2024.\nNorthumberland Green Party (NGP) believes that protecting your personal information is very important. In accordance with Data Protection law we are a Data Controller and accountable for the way we process your data. NGP has therefore implemented appropriate physical, technical and organisational measures to protect the personal information we have under our control, both online and offline. NGP is committed to protecting your privacy and the transparent use of any information you share with us in accordance with our legal obligations. This Privacy Notice sets out in detail the purposes for which we process your personal data, who we share it with, what rights you have in relation to that data and everything else we think is important for you to know.\nNGP’s Privacy Notice may change so please remember to check back from time to time.\nPersonal data means any information that can directly or indirectly identify a living person –\n- from those data, or\n- from those data and other information, which is in the possession of, or is likely to come into the possession of, the data controller and includes any expression of opinion about the individual and any indication of the intentions of the data controller or any other person in respect of the individual.\nContacting us about Data Protection\nIf you have any questions about this Notice or you would like any more information in regard to how we process, store or use your personal information, please contact The NGP Data Protection Officer:\nTo email: data@northumberland.greenparty.org.uk\nYou also have the right to contact the Information Commissioner’s Office if you would like to complain about us, please see their contact details below:\nTo call: 0303 123 1113\nTheir complaint page is: https://ico.org.uk/global/contact-us/\nWho are we?\nIn this document, when you see the words ‘NGP’, ‘we’ ‘us’ or ‘our’, it refers to the Northumberland Green Party.\nNGP is a constitutional local party under the umbrella of the Green Party of England and Wales and thereby registered with the Electoral Commission. We are a data controller registered with the ICO (Reference: ZA196614).\nIn the UK, the key pieces of legislation governing data protection are the UK General Data Protection Regulation (UK GDPR), the Data Protection Act 2018 and the Privacy and Electronic Communications (EC Directive) Regulations 2003 (PECR).\nNorthumberland Green Party, are committed to protecting your personal information and making every effort to ensure that your personal information is processed in a fair, open and transparent manner.\nWho is in control?\nIt is important that you understand who is responsible for keeping your data safe. We are the “controller” of all personal data collected and used by Northumberland Green Party for the purposes set out in this Privacy Notice. This means that we are responsible for deciding how and why your data is used and for ensuring that your data is handled legally and safely.\nIt is important to note that we are shared controllers of membership, supporter and volunteer data along with the North East Green Party and the Green Party of England and Wales. Each party has specific and appropriate processes in place for ensuring Data Protection.\nWhat data do we collect and where from?\nWebsite subscription forms\nWe collect the details you submit to us when you complete an online form asking us to keep you updated on party activities and related issues.\nPetitions and Surveys\nWe also collect information that you voluntarily provide to us when you respond to petitions or surveys including your responses to any questions they might ask.\nMembership Signups\nWhen you join as a member of the Green Party of England and Wales, all of the details you provide, including contact details and any other details that are voluntarily provided, are collected. Your payment details are also collected where necessary to process your membership subscriptions and donations. NGP will make appropriate use of these details to notify you of actions we’re taking to organise campaigns and any appropriate social activities.\nCookies and IP addresses\nWe collect information about how you interact with our websites using Cookies and your connection’s Internet Connection (IP) Address if your browser is set to accept/provide such.\nLocal Green Party Organisations\nNorthumberland Green Party is a constituent local party of the Green Party of England and Wales. As such, we may on occasions make use of the data collected by the Green Party of England and Wales, as well as personal data captured by surveys, events and campaigning activities, to maintain any relationship or communications regarding local meetings, events, campaigns and correspondence.\nThe Electoral Register\nAs a political party we are provided with access to the electoral register for the purposes of canvassing and promotion.\nSocial Media\nWe also collect anonymised publicly available information from social networking sites such as Facebook and Twitter, for example likes, shares, tweets and posts about Northumberland Green Party and its activities and campaigns. This information is provided to us by the third-party social media platform.\nWhat do we use your data for?\nWe use the data you provide us to communicate with our membership and supporters about party business, activities and campaigns. From time to time we will also communicate with you about fundraising campaigns we run in order to finance the operation of the party and/or support specific causes.\nWe use your data, including any voluntarily provided information, to choose which campaigns or Party activity we believe may be of interest to you. Our communications may be via Post, Telephone, Email or Social Media.\nYour address information (where provided) is used in an automated way to inform you of campaigns of geographical relevance.\nAs a Political Party we use your expressed political opinions to inform our campaigning including what issues we promote, how we contact you and what we say to you. This ensures that we can continue to represent supporters’ views in a democratic way and to help us generate revenue to fund our political activities.\nWhat is our legal basis for using your data?\nIn order to process personal data lawfully we may use different lawful grounds for processing. For example, where the law permits, we may use Public Task to send Freepost communications. We may use Consent where it is informed and specific to the purposes for which it was gathered, such as for fundraising or campaigning. In a similar way we may use our Legitimate Interest where we believe the individual may have a reasonable expectation that their data is processed. For members of the Party, we may use Contractual Obligation to process personal data. Broadly, our processing activities include but are not limited to;\nInforming Members and Supporters of Green Party Activities and campaigns\nWe process this personal data on the basis that we ensure that we communicate effectively with actual and potential supporters of Northumberland Green Party and its campaigns. This ensures that we can continue to represent supporters’ views in a democratic way. This processing is considered to be fundamental to our role in promoting democracy in the public interest. Political opinions are classed as ‘special category’ data under data privacy legislation and our processing of this data is in accordance with Article 9(2)(g) of the General Data Protection Regulations.\nCommunicating with Members about their membership and constitutional role within the Party\nWe process your membership and personal data with respect to your membership position in line with the constitution of the Party and your agreed participation. As a membership organisation we require that we be able to communicate with members about constitutional issues (such as leadership elections, conference and changes to the constitution) . This is considered to be a fundamental part of our role in promoting democracy in the public interest.\nFundraising\nWe may from time to time contact you directly asking for donations to help fund the work of the Party. Without funding it would be impossible to function as a Political Party and therefore such communication is considered to be a fundamental part of our role in promoting democracy.\nCanvassing of Political Opinions\nAs a political party we require an understanding of the political opinions of the UK electorate both nationally and on local campaigns and issues. This understanding is considered to be a fundamental part of our role in promoting democracy. We acknowledge that there is a difference between genuine research activities which may identify the views of the public and help to shape the Party’s policies for the future and gathering data which may be used to target individuals with marketing materials to encourage support.\nWho do we share your data with?\nLocal Green Party and National Office\nThe data you provide will be shared between NGP, the North East Green Party and the Green Party of England and Wales central office. All of these are joint data controllers and, as such, have put in place appropriate data sharing arrangements.\nDonations and financial information\nThe personal details you provide to NGP will be held internally by our finance officers and will be shared with the Electoral Commission in the case where your donations exceed declarable thresholds over £500. The personal details you provide will be held internally and the bank details you provide will be kept securely and only be shared with our bank.\nThird Party Platforms\nThe Northumberland Green Party website uses Google Analytics, a web analytics service provided by Google, Inc. (Google). Google Analytics uses cookies, which are text files placed on your computer, to help the website analyse how users use the site. The information generated by the cookie about your use of the website (including your IP address) will be transmitted to and stored by Google on servers in the United States.\nGoogle will use this information for the purpose of evaluating your use of the website, compiling reports on website activity for website operators and providing other services relating to website activity and internet usage. Google may also transfer this information to third parties where required to do so by law, or where such third parties process the information on Google’s behalf. Google will not associate your IP address with any other data held by Google. You may refuse the use of cookies by selecting the appropriate settings on your browser. By using this website, you consent to the processing of data about you by Google in the manner and for the purposes set out above. We use Google Analytics to make sure our online campaigning is as effective as possible, and it is also one of the ways we make sure that this website is clear and usable.\nYou can read Google’s privacy policy here for further information.\nWith your permission, our website utilises the Conversion Tracking Pixel service of Facebook Inc., 1601 S. California Ave., Palo Alto, CA 94304, USA (“Facebook”). This tool allows us to follow the actions of users after they are redirected to a provider’s website by clicking on a Facebook advertisement. We are thus able to record the efficacy of Facebook advertisements for statistical and market research purposes.\nThe collected data remain anonymous. This means that we cannot see the personal data of any individual user. However, the collected data is saved and processed by Facebook. We are informing you on this matter according to our information at this time.\nWhere you comment on a social media post we have made, we may repost your comment or share your comment on another social media channel. We will do this in our Legitimate Interest. When you post information on our social media channels which are in the public domain, we may not be able to control information which is reposted or copied by a third party.\nFacebook is able to connect the data with your Facebook account and use the data for their own advertising purposes, in accordance with Facebook’s Data Use Policy found here. Facebook Conversion Tracking also allows Facebook and its partners to show you advertisements on and outside Facebook. In addition, a cookie will be saved onto your computer for these purposes.\nAction Network\nWe use tracking in our mailings we send to you to evaluate the impact of our mailings.\nSurveys\nWe may hold your answers to the survey questions against your name. The data will be used internally to seek your voluntary help with local campaigns and administration tasks and only shared with the external organisations defined above.\nBy default this data will be retained while you remain a member or supporter. If you wish to be removed from our survey database, please inform us by emailing our Data Protection Officer via data@northumberland.greenparty.org.uk.\nPlease Note: If having requested being removed from our survey database, you subsequently participate in another survey, your data will be restored to our database as a result of that operation.\nOther processors\nFrom time to time we may need to share some of your data with third party data processors (such as technology providers, website hosts, online systems). Where we do so we will have a data processing agreement with the third party, and where they are located outside the UK we will ensure that they provide enough security and privacy to enable us to meet our legal obligations to you.\nAn example of this would be where we use a third-party email provider to deliver our emails to you. We would need to share your email address with the supplier to carry out this function, but their processing of your data would be in line with a data processing agreement we would have with them.\nHow long do we keep your data for?\nWhere you join as a member of the Party your data will be held for as long as you maintain your membership. If your membership lapses, your status may change to a supporter or may be deleted from our records.\nWhere you have donated to the Party or one of its campaigns the related data may be held for a period of 6 years to ensure we can comply with our legal obligations.\nWhat rights do you have?\nYou have a number of rights under data protection law. Some of these rights and how you can exercise them are set out in this section, more information can be found from the Information Commissioner’s office (https://ico.org.uk/for-organisations/guide-to-the-general-data-protection-regulation-gdpr/individual-rights/). If you are based outside of the UK, the complaint should be directed to the relevant Data Protection Authority in that Country.\nWe will normally need to ask you for proof of your identity before we can respond to a request to exercise any of the rights in this section and we may need to ask you for more information, for example to help us to locate the personal data or ask for a ‘scope’ that your request relates to.\nThe right to be informed\nYou have the right to be informed as to how we use your data and under what lawful basis we carry out any processing. This privacy policy sets this information out however if you would like further information or feel that your rights are not being respected please email dataprotection@northumberland.greenparty.org.uk.\nA right to access your information\nYou have a right to ask us to send you a copy of your all personal data that we hold about you (subject to some exceptions). A request to exercise this right is called a “subject access request” and must be made in writing to: data@northumberland.greenparty.org.uk.\nA right to object to us processing your information\nYou have a right to object to us processing any personal data that we process where we are relying on legitimate interests as the legal basis of our processing. You also have the right to withdraw your consent from our processing that requires it (such as our email communications). Every communication will have an option for you to withdraw your consent directly, or you can email data@northumberland.greenparty.org.uk at any time to exercise this right.\nA right to ask us not to market to you\nYou have the right to opt-out of any marketing or personally addressed direct mailings we send to you. If the communication is electronic it will include simple links and instructions to ‘unsubscribe’. For other media please email data@northumberland.greenparty.org.uk.\nA right to have inaccurate data corrected\nYou have a right to ask us to correct inaccurate data that we hold about you. If we are satisfied that the new data you have provided is accurate, we will correct your personal data as soon as possible.\nA right to have your data erased\nYou have a right to ask us to delete your personal data in certain circumstances, for example if we have processed your data unlawfully or if we no longer need the data for the purposes set out in this Privacy Notice.\nPlease note, if your personal details are provided to us via any of the shared processes mentioned above after you have requested deletion, we can only re-add them as we will no longer know about your decision to have them deleted.\nA right to have processing of your data restricted\nYou can ask us to restrict processing of your personal data in some circumstances, for example if you think the personal data is inaccurate and we need to verify its accuracy, or if we no longer need the data but you require us to keep it so that you can exercise your own legal rights. Restricting your personal data means that we only store your personal data and don’t carry out any further processing on it unless you consent, or we need to process the data to exercise a legal claim or to protect a third party or the public.\nTo exercise any of the rights above please email data@northumberland.greenparty.org.uk.To further understand your rights please visit the website of the Information Commissioner’s Office (ICO) at http://www.ico.gov.uk.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2024_05_04_northumberland-green-party-meeting/content_12.html": "Our next regular members’ meeting will be held on Saturday, May 11th, from 2 to 4 p.m., at Hexham Community Centre, Gilesgate, Hexham NE46 3NP. If you’re not a member but interested in joining or learning more about the Green Party, please come along: you’ll be made very welcome. The Community Centre is a 5-minute walk from the train and bus stations, and details of the venue are linked here.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk/content_1.html": "Your local Green Party for all of Northumberland.\nWe’re working hard to improve your area\n🚮\nRegularly reporting fly-tipping to make the area clean and safe for local residents.\n📃\nNorthumberland County Council Budget Meeting…..\nAs always, my speech at the annual budget meeting was short and to the point..\n🌳\nProtecting local trees and encouraging more to be planted. Cleaning up the air.\nFull List of GREEN PARTY Candidates FOR Local Elections In Northumberland\nBelow is a list of Green Party Candidates standing in Northumberland, arranged alphabetically by electoral ward.\n| Alnwick Castle | Laura Hawken |\n| Alnwick Hotspur | Martin Swinbank |\n| Amble West with Warkworth | Ivor Rackham |\n| Bamburgh | Ben Brooks |\n| Bedlington Central | Geoff Hill |\n| Berwick North | Tom Stewart |\n| Berwick West with Ord | Nigel Foster |\n| Cramlington Eastfield | Paul Evans |\n| Cramlington South East | Kath Leyland |\n| Cramlington Village | Steve Leyland |\n| Hartley | Nigel Szczepaniak |\n| Haydon & Hadrian | Jon Price |\n| Hexham East | Guy Norfolk |\n| Hexham North | Paul Homer |\n| Hexham West | John McKee |\n| Humshaugh | Antonia Azocar-Nevin |\n| Longhorsley | Philip Hood |\n| Longhoughton | Rosemary Mackenzie |\n| Morpeth Kirkhill | Pete Burns |\n| Morpeth North | Jan Rosen |\n| Morpeth Stobhill | Pat Fuller |\n| Ponteland East & Stannington | Lizzie Boyes |\n| Ponteland North | Glyn Evans |\n| Ponteland South with Heddon | Eileen Sutherland |\n| Rothbury | Jenny Wallace |\n| Seghill with Seaton Delaval | Martin Williams |\n| South Blyth | Elaine Kilroy |\n| South Tynedale | Teddy Thompson |\n| Wooler | Maurice Ward |\nGREEN PARTY GEARS UP FOR ELECTION\nThere will be more Green Party names that ever on ballot papers in Northumberland this May, as dozens of nomination papers were delivered to County Hall on Monday of this week.\nTom Stewart, who is Coordinator of the Green Party in Northumberland, said “In past years we may have been met with talk of voting Green being a waste, as control swung between Labour and the Tories: this time the field is more open than ever, and no Green vote is wasted.\n“What has struck us most on the doorsteps is the loss of trust in national politics and national politicians: it is essential to use this election period to listen to our communities, rather than just to talk at them, so that trust can be rebuilt.\n“We’ve been struck by how members of the public wish to protest against the old 2-party system, but also want to resist any notion that Northumberland could drift towards control by the far right. The Green Party is never a vote for the status quo, but is a vote of positive protest rather than anger and disengagement.”\nNORTHUMBERLAND GREEN PARTY – Crowd Funding for Council Elections 2025\nWe are asking for donations to help towards electing Green Councillors to Northumberland County Council in May 2025. If you are able to contribute please follow the link below. Thank you.\nhttps://www.crowdfunder.co.uk/p/getting-greens-onto-northumberland-council-2025\nNORTHUMBERLAND GREEN PARTY – NECA TRANSPORT PLAN RESPONSE – Jan 2025\nFor the sake of public health and the wellbeing and cohesion of our communities, as well as for sustainability, the emphasis MUST be on improving short-distance travel within those communities, and strengthening local services and amenities so as to reduce the need for longer distance travel.\nFor the full response Click Here\nThe Green Party Candidates for the Northumberland County Council Election Seats have Now confirmed.\nThe voters in Northumberland will have the opportunity to vote Green in the 2025 Council election.\nWe are preparing to contest as many seats as possible in the 2025 Local Elections. We have a group of excellent Candidates in place and with more to follow . Watch this space!\nCheck out the candidates details here.\nIf you like to help doing some leafleting please contact us. Click here\nI\nLatest News\nFind out what we’ve been up to, about issues in your area, and see the work we’ve done in the past.\n- Green Party announce election candidate for new Alnwick Hotspur ward – Article in Northumberland Gazette\n- Local Sewage Spills\n- NORTHUMBERLAND GREEN PARTY – NECA TRANSPORT PLAN RESPONSE – Jan 2025\n- Cramlington Eastfields By-election Results\n- Environment Hustings\nUpcoming Events\nYou can get involved to help get Greens elected. A Green Councillor can make a world of difference to your local area.\nOur next regular members’ meeting will be held on Saturday 11th May from 2-4pm, at Hexham Community Centre, Gilesgate, Hexham NE46 3NP. If you’re not a member, but interested in joining or knowing more about the Green Party, do please come along: you’ll be made very welcome. The Community Centre is a 5-minute walk from the train station and bus station,, and details of the venue are linked here.\nPeople\nClick here to meet our Officers and Election Candidates\nGDPR Privacy Policy\nClick here to see our GDPR Privacy Policy",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_coordinator/content_16.html": "Tom Stewart\nI have been a member of the Green Party for ten years, and have lived, worked and cycled in Northumberland for thirty years. I have particular interest in improving existing housing, and in improving opportunities for young people and following generations.\nAs Local Party coordinator, I work in the background with other party officers to undertake the administrative functions that are necessary, and I act as point of contact between the local party, the North East Green Party, and the Green Party of England and Wales.\nI am a councillor on Berwick Town Council.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_donate/content_3.html": "The Green Party is funded through donations by individuals like you. We don’t take donations from businesses that are trying to sway our politics. Politics is about people, and delivering a society that puts them first. Can you donate to help us get Greens elected?",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_membership-officer/content_22.html": "Pete Burns\nHi I’m Pete,\nOriginally I’m from Glasgow but spent my youth in Alnmouth. As an adult I have lived in Newcastle, Aberystwyth, Glencoe, Southampton and have finally settled in Morpeth with my wife and our three children.\nAs the Membership officer I aim to encourage new members to join so we can strengthen the environmental agenda as a matter of urgency within local authorities and the wider community.\nI would also like to bring Green party members together through practical activities which will strengthen our bond and create a strong network of like-minded people, working to improve our planet.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2025_02_04_local-sewage-spills/content_2.html": "There is increasing public concerns about the amount of raw sewage being pumped into our rivers and threatening wildlife. This also can effect water quality on our beautiful Northumberland beaches. Attached is a map which gives an up to date interactive map which shows where spillages occur.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_nominations-officer/content_23.html": "Steve Leyland\nThe Nominations Officer role is very much an administration task ensuring that our candidates are correctly reported to Northumberland County Council’s Elections Office in a timely fashion.\nThe Nominations Officer role is very much an administration task ensuring that our candidates are correctly reported to Northumberland County Council’s Elections Office in a timely fashion.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2024_05_28_election-fundraising/content_20.html": "by Northumberland Green Party in Cramlington, Northumberland, United Kingdom\nThe General Election is way overdue, but is finally here: this is our opportunity to turn the page on fourteen years of austerity, chaos and division, and to make a bold statement on our priorities for the future – real hope and real change, so as to ensure a safe environment and a fair society for the next generation.\nUnlike the old political parties, Greens don’t have overseas oligarchs, millionaire donors or trades unions to bankroll us – we rely almost completely on the generous donations from private individuals, members and supporters like you.\nIt costs £500 per candidate to stand in a Westminster election – that means that across the four constituencies in Northumberland we will need to pay £2,000 to ensure that everyone has a Green on the ballot paper.",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_contact/content_15.html": "Skip to content\nSkip to footer\nNorthumberland\nMenu\nNews\nPeople\nGDPR Privacy Policy\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_northumberland_greenparty_org_uk_/https_northumberland_greenparty_org_uk_2024_08_28_cramlington-eastfields-by-election-results/content_7.html": "Cramlington Eastfields By-election Results\nIn June, Christine Dunbar, the incumbent Conservative County Councillor in Cramlington Eastfield ward, stood down triggering a by-election. I’m pleased to report that long-time member Paul Evans offered to stand as a paper candidate in the election.\nWe knew this seat would be heavily fought between the Tories and Labour, but we agreed it was important to stand for four reasons…\n- We need to ensure the opportunity to vote Green is there for all electors,\n- We need to make clear our intention that Green candidates will be part of all future elections in Northumberland,\n- We need to test the native Green vote in every ward, and\n- Success in County, Town and Parish elections are a critical precursor to success at national level.\nThe underlying intention here is that this election stands as the first in our run up to the May 2025 local elections. We have a major job to do over the next eight months. We must hold on to the two seats we currently have on Northumberland County Council, whilst expanding our presence by campaigning strongly in three to four other target wards. It’s a big job, but very do-able – with enough volunteers.\nThe Cramlington Eastfield election ran on the 22nd of August, with the count taking place at Cramlington Concordia the same evening.\nThe results were very much within expectations…\n| Party | Votes | Win |\n| Conservative | 513 | Yes |\n| Green | 22 | |\n| Independent 1 | 6 | |\n| Independent 2 | 67 | |\n| Labour | 371 | |\n| Lib Dem | 23 | |\n| Reform | 177 |\nThe Lib Dems were very much in the same domain as us, despite their decision to leaflet. On that basis, and coming from a standing start with no campaigning whatsoever, I feel we did well. This will feed into our intelligence for next year.\nI’d first like to thank Paul for standing, and also Pete in the Digital Team for his help and support in getting this project successfully completed😊👍\nIf you want any more information about the election, know of an impending by-election or are interested in becoming a candidate (paper or otherwise) in next year’s local elections please contact any of our local contacts or any of the NGP Council members. Remember, we need as many people as possible to ensure we have a Green candidate on every ballot.\nSteve Leyland\n28/08/2024"
}