{
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_unfreeze-our-electric-bus-fund/content_46.html": "Unfreeze our electric bus fund\n- Content Editor\n- Jul 3, 2023\n- 2 min read\nMayoral candidate Kim McGuinness and Blaydon MP Liz Twist have warned that a nearly £20m bid for green buses across the North East is being held up as ministers drag their feet on handing over the funds.\nIn August 2022 Liz Twist MP and Transport North East submitted a bid to Government, which was supported by all of the MPs in the region, to start decarbonising public transport.\nThe bid, signed off by the Department for Transport in January this year, was a £19.5m package of investment seeking to expand zero carbon options for all. It includes 52 new zero emission buses for Arriva, Go North East and Stagecoach, together with supporting infrastructure and 92 EV chargers across 36 sites straddling Park and Ride and key destinations.\nBut with inflation pushing up costs it is feared a Government delay in handing over the agreed funds could limit options for the North East. The delay is believed to be linked to new checks needed as part of the Government’s Subsidy Control Act.\nThe North East has the highest bus passenger numbers in England outside of London, per head of population, with some 112m passenger journeys a year.\nLiz Twist is now taking this issue up with ministers to work on finding a solution.\nShe said: “I’ve long campaigned for the Government to stop looking at our buses with short-term sticking plasters as a solution. This bid has the potential to strengthen our bus fleets across the region as well as helping in the fight for cleaner air. Every extra moment it takes for ministers to resolve these issues is a moment in which we can’t deliver for my constituents and people across the North East, the Government need to match our ambition and get this scheme moving.”\nKim McGuinness, standing to be Labour’s first North East mayor, has called for Government to address the red-tape putting North East transport investment at risk.\nShe said: “Public transport keeps our region going and it is vital we have a modern, green fleet. But we are faced with a Government that seems to have no answer to inflation and no sense of urgency.\n“How can it be right they have to wait nearly 12 months to see the funds for those new green buses arrive?\n“As mayor I’ll bring buses under public-control and work with our councils on the transport priorities residents here want to see delivered.\n“What this really shows us is why we need investment decisions about the North East taken in the North East. People getting on a bus here should have the final say, not Whitehall officials 300 miles away.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_women-have-been-let-down-and-we-need-to-better-at-every-level-1/content_51.html": "Women have been let down and we need to better at every level\n- ContentEditor\n- Jun 20, 2022\n- 1 min read\nThe number of violent attacks against women and girls is increasing each year, and we need a plan to deal with it.\nFigures for the Northumbria Police force area reveal there have been 42 domestic homicides since 2011. And in 209/20 alone there were 4,438 sexual assaults reported in Northumberland, Tyne and Wear.\nNationally, 1 in 3 women and girls will experience some form of sexual abuse in their lifetime.\nThe figures are shocking, and the stories behind them are heartbreaking.\nFor real change we need a Labour Government to put women's safety first and bring about radical change.\nBut until then I'm asking your opinion on what needs to be done to tackle Violence Against Women and Girls.\nThat's why I'm calling for views to shape a new Violence Against Women and Girls (VAWG) action plan for the Northumbria Police force area.\nI’m grateful to be in a position where I can drive real change forward, and I know there are many others across Northumberland, Tyne and Wear who share this aim – we want to lead the way with this. From service specialists and police officers, right through to young girls and their mams who know these crimes disproportionately affect them – people want violence against women and girls to end once and for all.\nThat's why I'm calling for views to shape a new Violence Against Women and Girls (VAWG) action plan for the Northumbria Police force area. with perpetrators and system change. The consultation survey can be completed here.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_privacy-policy/content_5.html": "Privacy Policy\nThis document outlines how we process and manage personal data submitted through this website.\n-\nIdentifies the data controller.\n-\nExplains the lawful basis for processing personal data.\n-\nOutlines the personal data held and processed.\n-\nOutlines the scope of the special category personal data held and processed.\n-\nOutlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Labour Networks Limited.\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights you should use the Contact Me section of this website\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Kim McGuinness or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. If you do not wish for us to contact you by telephone please do not provide this information. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nSome service providers are located outside of the European Economic Area (EEA) and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n-\nWhere the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n-\nA contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use.\n9. Subject access requests\nSubject access requests are dealt with in line with the guidance given by the Information Commissioner’s Office (ICO):\n-\nWe will request verification of the identity of any individual making a request, and ask for further clarification and details if needed.\n-\nWe will respond within 28 calendar days once we have confirmed it is a legitimate request.\n-\nData subjects have the right to the following:\n-\nTo be told whether any personal data is being processed\n-\nTo be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n-\nTo be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data rights\nAt any point you have the following rights:\n-\nRight of access – you have the right to request a copy of the information held about you.\n-\nRight of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n-\nRight to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n-\nRight to object – you have the right to object to certain types of processing, such as direct marketing.\n-\nRight to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n-\nRight to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n-\nInformation Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n-\nTelephone: 0303 123 1113\n-\nWebsite: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Kim McGuinness via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website is hosted by Wix.com.\nLabour Networks Limited’s privacy policy can be found here.\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_police-staff-deserve-a-fair-pay-1/content_17.html": "Police staff deserve a fair pay\n- ContentEditor\n- Aug 25, 2022\n- 1 min read\nPolice staff are a vital part of fight against crime, and it’s time the Home Secretary handed over the funds for a proper pay rise.\nLast month the Home Secretary handed a 5% pay rise to police officers but police staff received a 2.1% pay rise. Such a pay difference would be hard for staff to accept but at a time of rising inflation and a cost of living the pay division is immoral.\nA fair pay offer, fully funded by the Home Office, is the very least our police staff deserve. The Home Secretary needs to reopen pay negotiations as a matter of urgency. Both sides of the policing workforce commit to keeping us safe and fighting crime, both are struggling with rising bills and both sides deserve to be treated fairly.\nPolice support staff are vital in ensuring the service runs efficiently and effectively. They make up more than a third of the workforce and are the people that answer the 999 calls, the people who support and safeguard vulnerable victims and the people that fulfil so many other vital and equally challenging roles.\nWe need to stand up for our staff. Our officers can’t do the job without the staff supporting them – it’s as simple as that and the sooner Government accepts this and pays staff fairly, the better.\nNorthumbria Police employs 1892 police staff, which is more than a third of the entire workforce that serves a population of 1.5 million people.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_how-my-violence-reduction-unit-is-standing-by-families-and-cutting-crime-1/content_38.html": "How my violence Reduction Unit is standing by families and cutting crime\n- ContentEditor\n- Jun 20, 2022\n- 1 min read\nPoverty, deprivation and crime go hand in hand.\nWe all know criminals thrive when people are denied opportunity and we know that when households trapped in poverty are the victim of a crime, the recovery is harder.\nThat's why I'm proud that my Violence Reduction Unit is taking a radical new approach to combat violent crime in Northumberland, Tyne and Wear.\nThe Unit will work with young people and troubled families to make it clear there is an alternative to violence and crime.\nNo-one should be become the victim of violent crime. That’s why it’s so important for the Violence Reduction Unit to intervene and deter individuals from crime at the earliest opportunity. We cannot just arrest our way out the problem – instead we must continue to educate young people, upskill our professionals and provide that vital support for those individuals and families in most need.\nBy increasing the number of people who know what to look out for, we can support more people before they are exploited or get involved in crime.\nAs well as building on the positive work to date, the plan for the next year of action will include:\nEngage young people to divert them from offending and reduce their risk of being involved in crime.\nFocus on the continued importance of community-based interventions, involving individuals with lived experience in specialist help centres.\nWork direct with the whole family to tackle issues of violence, through community-based interventions.\nTarget interventions in areas of most need.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_north-east-leaders-say-families-should-be-proud-as-schools-return-in-lockdown-exit-milestone-1/content_49.html": "North East leaders say families should be 'proud' as schools return in lockdown exit milestone\n- Mar 30, 2021\n- 1 min read\nMillions of pupils went back to class on Monday morning for the first time in two months, a crucial step in the UK's roadmap out of Covid restrictions\nChildren returning to Consett Junior School in County Durham after the national Covid-19 lockdown(Image: Craig Connor/ChronicleLive)\n“We all owe a huge gratitude to teachers and all school staff. They have kept schools open for children of key workers and our most vulnerable children during lockdown, quickly adapted to virtual teaching, and carried out their safeguarding responsibilities in the most trying of circumstances.\"\nOne of the few other changes to lockdown measures from Monday is that one named person can now visit a loved one in a care home.\nThe next change in lockdown rules should come on March 29, when people will be allowed to mix outdoors in groups of up to six and the 'stay at home' rule will end.\nThe LA7 statement added: “The social care sector has certainly endured more than its share of pain at the hands of Covid-19. By providing care for some of our most vulnerable residents, care homes have experienced loss and tragedy on an almighty scale.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_launching-a-plan-for-the-north-east/content_60.html": "Launching a Plan for the North East\n- Content Editor\n- May 22, 2023\n- 3 min read\nMayoral candidate Kim McGuinness has set out her 12-point Plan for the North East to create jobs, end child poverty and power the region’s cultural sector to thrive.\nKim is bidding to be Labour’s first North East mayor with a commitment to making the region the home of real opportunity and turning regional pride into a key economic selling point for the North East.\nThe mayoral candidate said she wants to end the days of the North East being in the shadow of Manchester or Leeds and finally make devolution a reality for people in towns, villages and cities across the region.\n“We need an economy that works for everyone, where the benefits of devolution are felt across the region. This plan ensures that from big business and manufacturing jobs to high streets and transport, the economy of the North East is inclusive and thriving,” Kim said.\nKim is setting out her 12-point plan at Equinor in South Tyneside as she promises to ensure the North East seizes the offshore opportunity at a time when other regions are pushing ahead.\nSSE Renewables and Equinor have announced-world leading plans to develop offshore energy on the Dogg Bank Wind Farm with the potential for thousands of manufacturing and supply chain jobs – a vision Kim has said will be central to her time as mayor.\nThe Plan for the North East includes a promise to bring buses under public-control by 2028, child care grants for families struggling with in-work poverty and a commitment to creating thousands of green energy and offshore plans by developing the region’s ports and rivers.\nKim said: “I’m standing to be mayor of the North East because I want to create real opportunity and ensure everyone has the chance to succeed in the region I love.\n“I’m standing because I’m proud of this region and I’m fed-up of seeing us stuck behind Manchester or Leeds, let alone London. Regional pride and ambition should be central to what a mayor is about; they should be a national advocate for our great North East.\n“As mayor I will create a North East where everyone thrives, not just those already at the top. Where we go beyond net zero with climate change policies that change lives. Where there is a good home for everyone, whether you rent or own and a well-paid job enjoyed by a skilled workforce backed by strong trade unions. Where public transport is safe, reliable, affordable – and publicly-controlled.”\nShe added: “I’ll make fighting child poverty the thread that runs through my office, and introduce a Mayor’s Child Care grant and subsidised public transport to help families move out of in-work poverty and keep more of their earnings.\n“And even as I work with our councils and business to create thousands of jobs along our rivers and ports, and develop our region’s status as a global centre for offshore engineering and green energy, I’ll also work with our unions to ensure the jobs available in our region are well-paid and secure.\n“Our devolution story to date simply has not reached its potential and I want to change that, to ensure all parts of the North East feel the benefits. It's time our North East rose out of adversity with pride. I’ll be the mayor who puts our people first.”\nThe 12-point plan includes a promise to create a safer and bigger Metro system. Kim has promised to gate more Metro stations, with more staff on hand to help passengers in these stations. The proposal is part of her plan for an integrated transport system with standardised fares and a simple cross-operator ticketing system.\nKim’s transport commitments also include building the region’s vital transport infrastructure. Kim said she will back the key projects that drive the North East economy, including the new Weardale passenger railway in Durham, the reopening of the Leamside Line, the Newcastle to Blyth railway and the Washington Metro expansion. She has also committed to backing the Bowburn Bypass in Durham and the role out electric vehicle charging points and improved cycle infrastructure to ensure all communities have access to travel.\nThe 12-point plan can be viewed here and will be followed up with a full manifesto launch at a Sunderland event in June.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_kim-mcguinness-re-elected-as-police-and-crime-commissioner-1/content_43.html": "Kim McGuinness re-elected as Police and Crime Commissioner.\n- Jonathan Sabarre\n- Oct 19, 2021\n- 1 min read\nKim McGuinness was re-elected as police commissioner for Northumberland, Tyne and Wear on a promise to fight crime, prevent crime.\nThe Labour PCC received backing from across the North East following her campaign to back the police, tackle anti-social behaviour and invest in hard-hit neighbourhoods.\nIn the May 201 elections for the Northumbria PCC Kim McGuinness increased her majority from 6,000 to just over 66,000. She won 60% of the vote ahead of Tory Duncan Crute, Lib Dem Peter Maughan and independent Julian Kilburn.\nKim said: “This election result was a full on endorsement from the people of Northumberland, Tyne and Wear. They have backed my plan to see more progress on fighting crime, and more done to prevent crime.\n“I’m proud to be working hard for all our residents and showing what Labour in office can achieve for them.”\nKim will serve a three-year term until 2024 due to the year lost to Covid-19.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_our-demands-for-the-new-pm-1/content_36.html": "Our demands for the new PM\n- ContentEditor\n- Aug 19, 2022\n- 1 min read\nThroughout this summer people have been stepping up across our region to help others and support their neighbourhood.\nAs inflation soars unchecked and the impact of austerity continues to hit home more and more people have turned to foodbanks and community projects to help them cope.\nAs your Labour Police and Crime Commissioner I have used my office to support those local organisations that too many people have to rely on for help, and especially those who help keep young people out of trouble, as part of my plan to fight poverty and fight crime.\nBut for real change we need a Government that is prepared to back radical solutions to the growing threat of poverty facing the North East and the rest of the UK – from investing in public services to rebuilding the Sure Start model at a time of incredible need.\nAs part of that, our region has a chance to send a clear message to the next Prime Minister setting our exactly what is needed to change lives in the North – we cannot just let the Tories in the South dictate this to us.\nThat’s why I’m asking you for your views on what the next PM needs to focus on in the North. If you click here you can fill in a two-minute survey which will be used to select our key priorities that we’ll use to send a message to the Government.\nOur North East is at its strongest when it unites together, and I look forward to working with members on making sure their voice is heard at the highest level.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_safer-metros-safer-buses-safer-parks-1/content_26.html": "SAFER METROS, SAFER BUSES, SAFER PARKS\n- Jonathan Sabarre\n- Oct 19, 2021\n- 2 min read\nPolice Commissioner Kim McGuinness has promised to improve transport and park safety with an £800,000 investment in CCTV, Metro safety volunteers, increased lighting and a new reporting apps.\nThe police commissioner is investing in two new packages of Safer Streets funding after hearing from women, passengers and park visitors setting out the places in Northumberland, Tyne and Wear were they feel less safe.\nThe investment follows national concern at women’s safety in light of the tragic murder of Sarah Everard.\nThe first safety package will see the Commissioner work with Metro operator Nexus, bus operators and the regional transport board on a £400,000 package including:\na new reporting app to transform how all passengers report crime and anti-social behaviour;\nbody-worn cameras for transport staff;\nStreet Pastor-style safety volunteers on patrol across the Metro network, and extra CCTV linked to control rooms.\nThe second safety package sees another £400,000 go towards:\nNew CCTV cameras in parks built into help points fitted in parks, that are linked to CCTV control rooms;\nAn independent review of street lighting in the parks selected and recommendations for new street lights were needed and,Academic research into what makes a safe park, where women and girls will be invited to form a new safety steering group to help design new safety standards for parks across Northumberland, Tyne and Wear.\nInvestment will go to parks across all six council areas in Northumberland, Tyne and Wear, including Ashington’s Hirst Park, Gateshead’s Saltwell Park and Mowbray Park in Sunderland.\nPolice Commissioner Kim McGuinness said: “I want Northumberland, Tyne and Wear to have a first-class public transport network in which women and all passengers feel safe to travel. This £800,000 is a vital first step towards that.\n“When people are on a bus or a metro they should know that there is always help at hand.\nWe want to give the reporting of ASB a complete overhaul and make it so much easier for local people to get the help they need when they need it. We also want to implement practical solutions like help points and improve lighting. We want to support all this with educational campaigns to raise awareness and promote the support services that people can turn to.”\nCllr Martin Gannon Gateshead Council leader and chair of the region’s joint transport committee, welcomed the announcement.\nHe said: “It is great to see this investment to make public transport safer in the region. We recently set out a roadmap in the 2021 North East Transport Plan to build on the infrastructure in place to achieve a safer and more attractive transport network, which reflects many of the findings from the recent survey.\n“This is a big step towards making people feel safe on our streets so that there is higher take up of walking and cycling, which are the greenest and healthiest forms of travel, as well as public transport use in the region.”\nThe funding is part of the Home Office’s Safer Streets funding pot. The scheme divides £25m among bidders across the country, but the funding must be spent by spring 2022.\nKim added: “It’s great we have this investment, but one off funding pots are not going to make women safer. We have to bring about longer term change, and that means longer term funding from the government.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_winter-in-poverty-the-price-of-tory-failure-1/content_52.html": "Winter in poverty - the price of Tory failure\n- ContentEditor\n- Jan 22, 2022\n- 2 min read\nFAMILIES across the North East are being pushed to desperation as bills rise and pressure mounts.\nEarlier this year, it was reported that the North East region has the second highest rate of child poverty in the UK with 37% of all children and young people living on or below the breadline. It was also revealed nearly half children in parts of Newcastle are living in poverty.\nThat's why my office supported the charity Clothe and Feed in South Shields with donations of Christmas jumpers and children’s toys in place of secret santa gifts between colleagues this year.\nThere are kids in our region who don’t even have a winter coat never mind a tree with presents under it. Families are facing big decisions over heating or eating.\nTo think of any child having a miserable Christmas is heart-breaking but to think 1 in 3 kids in our region will be spending Christmas living on the breadline, which is many more than other areas of the country – it makes me cross and I feel disgusted the Government isn’t doing more.\nIn recent years the North East has seen a dramatic jump in the number of children growing up in poverty – if anything, we’re levelling down. What’s happening with Government’s plans to give every child the best start in life? The plans don’t seem to be making it to the North, that’s for sure.\nAnd why does this matter so much to me?\nWell apart from caring passionately about our region and our region’s future I believe we have to fight poverty to fight crime. Put really simply, to keep kids out of trouble we need to give kids the best start in life, the best opportunities.\nThe best crime prevention is increased opportunity and reduced poverty. Criminals recruit those left desperate by deprivation – they’re vulnerable, they get drawn in and they can get involved in all sorts – drugs, serious violence.\nTackling crime is about much more than law enforcement and it starts with improving lives.”\nFor four years charity Clothe and Feed have been providing struggling mums and vulnerable children living in the North East with essential items, either for incredibly low prices or free of charge.\nIn its mission to relieve clothing and food poverty for parents or carers and their dependent in local communities, the charity is now the largest baby and school clothing bank in the region with three outlet locations currently in Wallsend, Byker, South Shields and Sunderland.\nShakira Robson from Clothe and Feed, said: “This year has seen yet a further surge in the need for our services and affordable items.\n“In order to meet this increasing demand, we are appealing for donations of toys and baby equipment from our local community.\n“We were delighted and overwhelmed with the generosity shown by Kim’s office colleagues this morning. This contribution will help to make Christmas special for of the most under-priviledged children in our region.\n“We thank you for taking the time to highlight the effects of child poverty and for your support in our mission to relieve this hardship.”\nMore info:",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_my-plan-for-the-greenest-transport-in-the-uk/content_31.html": "My plan for the greenest transport in the UK\n- Content Editor\n- Apr 2, 2024\n- 3 min read\nNorth East Labour Mayoral candidate Kim McGuinness has committed to taking back control of the bus network in order to give passengers a bigger say over fares, routes and timetables.\nThe mayoral candidate was joined by Labour’s Shadow Transport Secretary Louise Haigh and Gateshead Council leader Martin Gannon, chair of the Joint Transport Committee, to set out an ambitious timetable for cheaper buses.\nKim’s promise to take buses under public control was backed by Shadow Transport Secretary Louise Haigh, who promised that a Labour Government would support Kim to take back control of buses in the North East.\nHaigh pledged that a Labour Government would break down barriers to public control of buses and would provide the support to shave years off the bus franchising process compared to the uphill struggle faced by Greater Manchester.\nKim was speaking at the launch of her wider transport manifesto in which she promised to:\n· Create a joined-up transport network in which one pass works for bus, rail and Metro.\n· More ticket gates and staff at Metro stations.\n· Order a review of all rural transport to identify urgent areas of action.\n· Introduce free travel for children and subsidised fares for those seeking work.\n· Replace all diesel buses with electric buses as part of plans for the UK’s greenest transport network.\n· Secure funding to expand the Metro, with at least three more stations on the Washington Metro loop.\n· Work to ensure the reopening of the Leamside Line railway in Durham.\n· Ensure delayed stations on the new Northumberland Line are finally opened.\n· Negotiate a new devolution deal to include public control of major train stations.\n· Create an extensive network of electric vehicle charging points to improve uptake of EVs regionwide.\n· Carry out a regionwide accessibility audit and set clear targets to improve travel for elderly and disabled passengers.\nKim McGuinness said: “The North East needs a publicly-controlled bus network that puts passengers before profit. As mayoral I’ll start this process on day one. In my first term we’ll see buses rebranded as part of an Angel Network, bringing public control of fares, routes and timetables – and we’ll do it faster than anywhere else.\n“This is part of a wider plan to have greenest transport network in the country. From Electric vehicle charging infrastructure to climate-friendly buses, we will lead the way in the North East.”\nLouise Haigh, Labour’s Shadow Secretary of State for Transport, said:\n“After 14 years of neglect, the state of transport across the North East is driving communities apart and holding them back from opportunities.\n“The North East needs public transport that works for the people that rely on it. Only Labour’s Kim McGuinness can deliver that change.\n“A Labour Government will support Kim to deliver a new Angel network for the North East, breaking down the barriers to public control and providing support to speed up the bus franchising process.”\nGateshead Council leader Martin Gannon, chair of the region’s Joint Transport Committee, said the North East had ambitious plans to grow the transport network.\nMartin Gannon said: “The Interim North East Combined Authority has ambitious plans to invest on our transport infrastructure, but we know there is more to do. The Leamside Line and Metro expansion are key to the future of public transport in our region.\n“Council leaders in the North East have been working together for many years to develop and deliver our Transport Plan, a vision for a comprehensive, green and integrated transport system that will power growth in our economy and allow everyone to access opportunity.\n“I know we can build on this with Kim as our Labour Mayor.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_feeding-families-the-frontline-in-the-fight-against-poverty-1/content_34.html": "Feeding Families - the frontline in the fight against poverty\n- ContentEditor\n- Aug 19, 2022\n- 1 min read\nFeeding Families are fighting poverty head on- so I'm running my first (and last) ever Great North Run for them.\nFeeding Families are on the frontline of support for families and individuals living in poverty.\nThey're a a charity based in North East England that offers support, hope and security to those experiencing food poverty.\nThey work closely with other organisations and agencies to ensure that thousands of families in desperate need have access to Emergency Food Boxes and support packages.\nAs they put it: \"At Feeding Families, we don’t think anyone should go hungry. We believe everyone has the right to be able to feed themselves and their children. Feeding Families offers more than just food, it shows compassion to those in crisis.\"\nWith the rising cost of living and a government that simply isn’t acting, the charity find themselves with ever higher demand but slowing donations. Support for them means support to those that need it most.\nIf you want to donate to their work you can do so here: https://www.peoplesfundraising.com/fundraising/kim-running-for-feeding-families-",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_northumbria-police-pledges-78-devices-to-laptops-for-kids-campaign-for-those-most-in-need-1/content_50.html": "Northumbria Police pledges 78 devices to Laptops for Kids campaign for those most in need\n- Mar 30, 2021\n- 2 min read\nMore than 2,500 laptops, tablets and computers have now been donated to help disadvantaged children learn during lockdown\nL to R: Northumbria Police's Head of IT Ian Woodward, Police and Crime Commissioner Kim McGuinness and Rebuyer CEO Simon Howatson (Image: Newcastle Chronicle)\nNorthumbria Police has donated 78 devices to a campaign helping North East kids who are struggling with their remote learning.\nThe force has followed in the footsteps of many others in supporting youngsters at this vital time after it emerged that around 55,000 families in the region don't have access to a laptop, tablet or computer.\nChronicleLive helped launch the Laptops for Kids campaign in January, aiming to close the digital divide among the region's disadvantaged youngsters.\nAnd we have seen a \"phenomenal\" response by the public, businesses and organisations who have now donated 2,500 unwanted devices to families who need it most.\nThe latest kind-hearted donation has come from Northumbria Police which has pledged 62 tablets, 10 computers and six refurbished laptops to the cause.\nNorthumbria Police and Crime Commissioner Kim McGuinness said: \"Whether home-schooling or not, without access to technology many young people will fall behind with their learning.\n\"This is a fantastic campaign with ChronicleLive to fight the technology struggles faced by many families and reduce the number of 'have nots' in our region.\n\"We know technology can empower and motivate young people, by donating we hope to boost their learning and boost the future prospects of local school children who need our support.\"\nLaptops for Kids is a campaign in conjunction with Northumbrian Water, the Northern Powerhouse Partnership and Sunderland-based IT firms Rebuyer and Code, bidding to make a real difference to those unable to attend school.\nDuring the Covid-19 pandemic, some pupils have been sharing devices with their siblings or trying to do their work and live lessons on mobile phones rather than computers. Others are still reliant on paper worksheets.\nSchools in England will reopen on Monday, March 8, and Education Secretary Gavin Williamson admitted that the pandemic has \"impacted\" the attainment gap between disadvantaged and non-disadvantaged pupils.\nSarah Mulholland, head of policy at the Northern Powerhouse Partnership, said: \"We want to say a huge thank you to Kim McGuinness and her team at Northumbria Police, as well as to everybody who has been able to support the Laptops for Kids campaign in the North East.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_the-government-refused-to-give-public-workers-a-pay-rise-so-i-resigned-from-their-board-1/content_44.html": "The Government refused to give public workers a pay rise - so I resigned from their board\n- ContentEditor\n- Nov 7, 2021\n- 2 min read\nIN the run up to the budget police staff and officers were told they would have to accept a 0% pay freeze.\nAnd while the Chancellor tried to fool the public with a partial pay U-turn, he refused to bring in any pay rise before this winter's crippling fuel bills hit hard working staff, or to say if he will match rising inflation rates.\nOver the course of this year I have led talks between PCCs nationally and the Home Office, but have now told the Home Secretary that if ministers won’t stand by our workers then there is no point negotiating with her.\nPolice staff have previously been the only group of emergency responders to have had a pay freeze imposed on them.\nWe absolutely want to see an end to the pay freezes, especially to police staff, who have suffered a kick in the teeth when left out of previous pay rise announcements.\nWe cannot wait until next year, these staff and officers are people who got us through a pandemic, they put their families at risk, and they did it for us.\nAnd I'm proud to be supported in my decision by UNISON.\nRegional secretary Clare Williams said: “If the chancellor doesn’t allocate extra money to government departments to fund the much-needed wage rises, the pay freeze will continue in all but name.”\n“There’s never a good time to freeze public sector pay. Doing so at the peak of a pandemic was the height of folly.\n“Staff were doing their all to keep under-pressure services running, and ministers looked like they didn’t care.\n“There can be no decent public services without the people to run them. Pay freezes don’t help employers hold on to experienced staff, nor attract new recruits.\"\nThat's why I resigned in writing as the lead negotiator for the Association of Police and Crime Commissioners regarding staff pay.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_making-our-region-the-home-of-real-opportunity-kim-s-plan-for-the-north-east-economy/content_63.html": "Making our region the home of real opportunity – Kim’s plan for the North East economy\n- Content Editor\n- Jun 3, 2023\n- 3 min read\nNorth East mayoral candidate Kim McGuinness has set out her vision for the North East economy in a keynote speech launching her full manifesto.\nThe Labour mayoral candidate told an audience of supporters at the Fire Station, Sunderland, that she planned to create an economy that works for all of the North East – not just city centres and business parks – if elected next May.\nKim has committed to making the North East the home of real opportunity with a plan to end child poverty, remove the barriers to work and invest in the foundational economy.\nSpeaking at the event, Kim said: “The North East has the potential to lead the way in both green manufacturing jobs and the digital economy.\n“But for thousands of families, those employment opportunities are simply unachievable today. If devolution is to mean something to all parts of the region then our job creation mix has to offer something for all our residents.\n“l’ll create thousands of green jobs to fuel our economy but I won’t forget that not every job can be a senior, graduate level job.\n“That challenge facing our region is especially true when we think about the child poverty crisis facing the North East. A family on the breadline today can’t feed their kids with the promise of a digital future in a city centre miles away.\n“What they need now is a good local job, a working high street, and an affordable, reliable and safe public transport system.\n“And that’s the mix I’ll work to create; I’ll turbo-charge our green manufacturing base while working with others to revive the high streets that make our towns and villages a great place to live.\n“This approach, the focus on the foundational economy, has been missing from our devolution story so far. Tory devolution deals have been designed as business support agencies, with no thought given to the wider needs of the region.”\nKim set out how she would make public transport work for the economy of the North East, with buses brought back into public control, subsidised fares for those starting work and Metro expansion.\nThe Police and Crime Commissioner has also committed to introducing an anti-harassment campaign on the Metro as well as more gated-stations and staff in a bid to make the network safer. It builds on her work as PCC in which she has secured more than £1m of transport safety investment for the region.\nKim was introduced at the event by Paul Callaghan, Chair of The Board of Trustees\nSunderland Music, Arts and Culture Trust and former chair of the now abolished Regional Development Agency One North East.\nPaul has backed Kim’s vision for a North East economy rebuilt with culture, arts and music as one of its key strengths.\nKim said: “I love our region, it shaped me and I tell people where I am from with pride.\nThat’s why I’m standing with a plan to create real opportunity, to turn our rivers and ports into the national home of green jobs and to finally put our regional pride, our culture and sports, back on the global stage.”\nAlso speaking at the event was Durham County Council Labour group leader Carl Marshall, who backed Kim to be a North East mayor who invests in Durham.\nCarl said: “This selection vote is vital. We must not settle for anything other than the very best candidate. It’s what our members expect, and most importantly it’s what the public expect.\n“That’s why I have no hesitation in backing Kim and why I look with optimism to our future as Labour Party which is in power, delivering for our residents, at every level across the North East.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_safe-haven-to-help-people-in-need-1/content_40.html": "Safe haven to help people in need\n- Mar 30, 2021\n- 2 min read\nResidents in need or distressed are being reminded their local fire station is a ‘safe haven’.\nLynsey McVay, Assistant Chief Fire Officer, and Northumbria Police & Crime Commissioner Kim McGuinness alongside one of the alarm bells / call boxes.\nTyne and Wear Fire and Rescue Service says all of its 17 community fire stations can be used to help somebody in need, where they can safely raise the alarm.\nAssistant Chief Fire Officer Lynsey McVay, of Tyne and Wear Fire and Rescue Service, said: “Our doors are always open for anyone who is seeking help or assistance.\n“We are always associated with protecting the public by fighting fires and rescuing people, but we also believe that we have an essential responsibility of keeping people safe from harm through being a safe haven for people to find solace at a time of need or distress.\n“Each fire station has a bell at the front door to alert the station crew.\n\"If the crew are out at the time, a call box can be found at the entrance to help gain assistance and support from our Fire Control Room. This team are based at our Service Headquarters, which is staffed 24-hours-a-day.\n“We will continue to work closely with our colleagues across the emergency services including the offices of the Northumbria Police & Crime Commissioner – in our quest to help keeping people safe.”\nNorthumbria Police and Crime Commissioner, Kim McGuinness, said: “Our fire stations are often a key part of what makes us feel safe in our local neighbourhood.\n\"I don’t want anyone to find themselves in a situation where they feel unsafe or need urgent help but it’s good to know that if you do, help is very much there.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_about-me/content_2.html": "North East Born and Bred\nI’m standing to be mayor of the North East because I want everyone to have the chance to succeed in the region I love.\nThis region and a Labour Government gave my family and thousands of others the help we needed to escape hardship and succeed. By empowering our communities, I know we can do that again.\nDespite my overwhelming pride in our region and its people, I’ll always be honest about the challenges we face.\nI grew up in the West End of Newcastle. My dad was a scaffolder. He worked on the shipyards on the Tyne. My mam worked part time as a secretary at a small insurance broker but was made redundant when the company went under in the recession in the early 90s.\nMy parents shielded us from how hard it was and made sure we had a carefree childhood, but my dad was made redundant every autumn, was out of work over Christmas, sometimes three months, sometimes as long as five. The benefits system, then as now, was paltry and my nana and granda helped us – because that’s what northern families had to do under Thatcher’s Tories.\nWith the Labour Government in 1997 we felt the change. There were more opportunities, and investment came into the region. I became the first person in my extended family to go to university- just like so many other working class kids of my generation.\nNow I live in Northumberland with my Husband David, a serving RAF officer and our dogs Errol and Iris.\nFor too many working class people, those dark Tory days are back. I’m standing to be mayor because I think we have to do more to help people improve those lives, to create real opportunity and stand by those households. Right now, devolution simply doesn’t mean anything to most people in our region, it brings no benefit to them.\nI want to be the mayor who puts them first. For me, it won’t be an ideological experiment and I’ll prioritise delivering Labour values and a Labour Government, not factional Labour party spats.\nAs your Labour Police and Crime Commissioner I’ve focused on relentlessly delivering for our region. I became the first in the country to make fighting the effects of poverty and deprivation central to our plans to prevent crime. I’ve delivered hundreds more police officers, invested in young people, backed youth services and healthy role models and funded the Community Hubs that are bringing back Sure Start by stealth. I know how to use the limited funds the Tories give us to invest directly in our communities.\nBut creating real opportunity, creating good local jobs, is just part of the story for why I’m standing to be mayor.\nI’m standing because my pride for this region means I’m fed-up of seeing us stuck behind Manchester or Leeds, let alone London. Regional pride and ambition should be central to what a mayor is about; they should be a national advocate for our great North East. Our region has the potential to be the UK home of culture, arts, creativity and opportunity – yet we don’t have the voice we deserve, out there, shouting about it.\nI want to be the Mayor for a North East where everyone thrives, not just those already at the top. Where we go beyond net zero with climate change policies that change lives. Where there is a good home for everyone, whether you rent or own and a well-paid job enjoyed by a skilled workforce backed by strong trade unions. Where public transport is safe, reliable, affordable – and publicly owned.\nIt's time our North East rose out of adversity with pride.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_honouring-crime-fighting-local-heroes-1/content_25.html": "Honouring crime-fighting local heroes\n- ContentEditor\n- Jun 20, 2022\n- 2 min read\nI was honoured to be standing alongside a brave Newcastle mum who has received a top recognition for her work teaching kids about knife crime.\nAlison Madgin of charity, Samantha’s Legacy, has been recognised for using her own heartache from tragically losing a child to drive her campaign to prevent other families from experiencing similar suffering.\nAlison who, along with her other daughter Carly, has dedicated her life to supporting and educating others also famously brought the impactful knife angel statue to Gateshead quayside in 2020 as part of her work with my Violence Reduction Unit.\nThe awards, held in Manchester, are a celebration of talent, role models and inspiring women from the North and Alison wasn’t the only North East success story from the night. She was joined by a long list of fellow angels of the north – all of whom work passionately to improve lives and support some of the most vulnerable people of the region.\nOne such woman was Collette Devlin- Smith who received a commendation for all her work as part of EDGE North East. In the last few years, Collette has sprung up as an instrumental figure driving a new approach to how the region prevents young people from being exploited and coerced into the evils of County Lines.\nAlso short-listed for another top award was Streetwise’s Mandy Coppin – an inspirational woman who has stood up to youth service cuts and worked tirelessly to put the young people of our region first ensuring services and support are there for those in need.\nI couldn’t be happier for Alison and all the women who work so hard to keep young people safe. They all deserv teaching kids about knife crime. ust not let the work these people do go unnoticed. This work really matters. And I’m proud that the ca to Manchester and really put the North East on the map.\nBetween them, the number of lives they’ve all changed, supported and even saved, doesn’t bare thinking about. I feel lucky not only knowing these inspirational women but to have them cracking on in our region, shifting the dial and changing lives. To all of them, I can’t give enough thanks and I know there are a lot of people out there who feel the same.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_a-lesson-for-michael-gove-if-you-want-real-levelling-up-listen-to-sam-fender-1/content_42.html": "A lesson for Michael Gove - if you want real levelling up, listen to Sam Fender\n- ContentEditor\n- Mar 9, 2022\n- 2 min read\nThis month the Government published its white paper on levelling up - and it missed opportunity after opportunity to bring real change to the north.\nFor me, one of the biggest mistakes was the failed chance to create more cultural opportunities for young people in the North East - a vital step in boosting the region’s regeneration and tackling poverty.\nSpeaking at this year’s Convention of the North in Liverpool, I made the case that if we reduce the number of families in poverty we will reduce crime. To do this we have to increase young people’s access to opportunity.\nCultural activities in our part of the world are basically two things – they are hope and they are the path back to the straight and narrow. As any police officer in my patch will tell you, we cannot simply arrest our way out of trouble. Kids need opportunities but not enough get them, especially in the North East.\nFrom football to music lessons, museums to festivals, boxing coaches to digital design, when we invest in young people we give them healthy role models and we can divert them away from the temptations of criminality.\nAnd that's were the Sam Fender lesson comes in.\nWhat a great cultural export the North Shields lad is.\nBut let’s face it, his talents almost never made it to our playlists. His lyrics share with us the full force of poverty on his family; from courts summons to benefit worries. These are real struggles experienced by real people. He saw the easy wins from the drug dealing happening around him; he came close to being swept up with it all. But he didn’t. He joined a band, and he grew as a person and just look at him now.\nWe need more young people saved, more talent uncovered, and more reason to stay and shine in the North East.\nThis really is all about investment, something the North hasn’t seen enough of for a long time. If there is one thing I hope we can get from these discussions it’s an agreement that the days of London picking the winners and losers in Rotherham or Blyth have to come to an end.\nThe people in our regions should have the only say on where investment goes; the opportunities created. It is time for an end to the bidding wars and to acknowledge that far more than a white paper needs to be done to turn around the North.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_why-im-standing/content_12.html": "Why I'm Standing\nI’m standing to be mayor of the North East because I believe that together we can reclaim our ambition, build on our proud heritage and create a region known as the home of opportunity.\nOur region has been hardest hit by Tory austerity and now faces the devastating\ncost-of-living-crisis and the highest child poverty rates in the country.\nBut we’ve been through this before and we know the solutions.\nThis region and a Labour Government gave my family and thousands of others what we needed to escape hardship and succeed. I will be the campaigning Labour mayor who gives working class people this opportunity once again.\nAs mayor I’ll bring a relentless focus on creating skilled jobs for everyone, introducing climate solutions beyond net zero, ending child poverty, investing in young adults to prevent crime and delivering a publicly-owned transport system.\nWe don’t have time for ideological experiments and we can’t continue in the shadow of Manchester and Leeds.\nWe are unashamedly proud of our region and have always succeeded against the odds.\nI have delivered for this region as Police Commissioner and I’ll build on that record as mayor - let’s give our North East the voice it needs and the opportunities we all deserve.\nKim is a dedicated champion of our region and has a track record of standing up for the people of the North East\nDame Norma Redfearn, North Tyneside Mayor\nMy Priorities\nAs your mayor I’ll bring a relentless focus on:\n✓ Creating skilled jobs for everyone\n✓ Providing climate solutions beyond net zero\n✓ Ending child poverty\n✓ Investing in young adults to prevent crime\n✓ Delivering a publicly-run transport system.\nMy Record\nAs a Labour Police & Crime Commissioner I have:\nInvested in the region’s young people.\nDelivered hundreds more local police officers.\nMade fighting the effects of poverty and deprivation central to crime prevention.\nBacked youth services and healthy role models.\nFunded Community Hubs that are bringing Sure Start by stealth.\nSupported our communities directly with funding.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_nominations/content_33.html": "top of page\nThank you for nominating me!\nI’m delighted to have broad support from across the Labour and Trade Union movement in the North East.\nThe following nominations have been made so far:\nConstituency Labour Parties (CLPs)\nBerwick\nBishop Auckland\nGateshead\nHoughton & Sunderland South\nJarrow\nNewcastle North\nNorth West Durham\nSedgefield\nSunderland Central\nTynemouth\nWashington & Sunderland West\nLabour Groups\nNorthumberland\nNorth Tyneside\nNewcastle\nSouth Tyneside\nCounty Durham\nAffiliates\nUNISON\nGMB\nCo-operative Party\nUsdaw\nCommunity\nThank you for your support!\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_cultural-change-needed-to-stop-violence-against-women-says-northumbria-crime-commissioner-1/content_35.html": "'Cultural change' needed to stop violence against women, says Northumbria Crime Commissioner\n- Mar 30, 2021\n- 2 min read\nNorthumbria Police and Crime Commissioner Kim McGuinness spoke to ChronicleLive about the 'honest, raw' outpouring of fear and grief that has followed the death of Sarah Everard\n(Image: Northumbria Police)\nThe national outpouring of grief and anger over the death of Sarah Everard must lead to real change.\nThat's the view of Northumbria Police and Crime Commissioner Kim McGuinness, who admitted she \"can't stop thinking about\" the \"devastating\" case that has kick-started a long-overdue conversation.\nThe death of Durham University graduate Sarah Everard, who disappeared in London whilst walking home, has sparked a broader discussion of women's safety and gender-based violence.\nScotland Yard has now confirmed a body found in Kent woodland is that of the 33-year-old, while a Metropolitan Police officer accused of her murder remains in custody.\nAs the country mourns the shocking death, thousands of women have taken to social media to share their experiences of street harassment, violence, and the fear so many live with.\nMany shared images of a message reading \"text me when you get home\" - a reminder of the anxiety felt for friends and loved ones completing the simple, everyday act of walking home.\nThe Northumbria Police and Crime Commissioner said: \"The whole case is absolutely devastating, what's happened to Sarah Everard is absolutely devastating, and to be honest I can't stop thinking about it, I can't stop thinking about her family and friends and how they must be feeling.\n\"But it has sparked a discussion about women's safety: not just whether women are safe but whether women feel safe, and think it's about time we had this discussion.\n\"The mood is obviously very sombre because of what's happened to Sarah, but people are sharing their stories in a way that they haven't before.\n\"Certainly every woman that I know, probably every woman you know, has made conscious judgements about their own behaviours to make themselves safe, and it shouldn't be that way.\"\nSarah Everard(Image: Evening Gazette)\n\"I think it's really got under our skin,\" she added.\n\"It's really hit home because she could be any of us, and that brings something out in you, that real concern.\n\"Those decisions that we make about what we're wearing on our feet; can we access our phone; are we taking the lightest route home; is it safer to take a bus or a taxi or a train or to walk, all of those decisions are subconscious, we make them every day without thinking about it.\n\"But the fact is that fear, that underlying concern about our own safety bubbles away, when actually it shouldn't be incumbent on women to think like that.\"\nPolice action can help, she said, highlighting Northumbria initiatives like the Darker Nights Campaign, part of which involved encouraging people to look out for the vulnerability of others and support those at risk.\nThe likes of better street lighting and increased CCTV could also boost feelings of safety.\nBut the only ultimate solution, Ms McGuinness argued, would be \"cultural change\".",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_news_page_2/content_41.html": "top of page\nLatest News\nSearch\nA HOTEL LEVY TO FUND A NEW ERA OF NORTH EAST EVENTS\nNorth East mayoral candidate Kim McGuinness has said a massive new era of North East culture, tourism and festivals could be funded by a...\nJun 19, 20233 min read\nBroad trade union & labour movement backing for Kim\nKim has received broad support for her mayoral selection campaign from across the Labour and Trade Union movement in the North East. The...\nJun 15, 20231 min read\nMaking our region the home of real opportunity – Kim’s plan for the North East economy\nNorth East mayoral candidate Kim McGuinness has set out her vision for the North East economy in a keynote speech launching her full...\nJun 3, 20233 min read\nLaunching a Plan for the North East\nMayoral candidate Kim McGuinness has set out her 12-point Plan for the North East to create jobs, end child poverty and power the...\nMay 22, 20233 min read\nA Plan for the North East\nMy plan for the North East will make the region the home of real opportunity and turn our regional pride into a key economic selling...\nMay 22, 20233 min read\nA new era with a new mayor\nA public consultation on creating a new mayor for the North East has now closed. As part of this I set out what we should do next in this...\nApr 19, 20233 min read\nGive us back our cops!\nThe Tories cut 1,100 officers from Northumbria Police - it's time we got them all back. Since austerity started in 2010, Northumbria...\nMar 30, 20232 min read\nMy devolution plan for the North East\nMaking opportunity and pride the centre of our North East vision Kim McGuinness has announced she is standing to be the Labour candidate...\nJan 26, 20233 min read\nA historic chance to win power for our region\nThe next Labour Government will pave the way for the greatest era of English devolution in living memory, taking power out of London and...\nDec 5, 20222 min read\nTogether we can reclaim our ambition\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_fighting-crime-preventing-crime-launched-1/content_58.html": "Fighting Crime, Preventing Crime Launched\n- Mar 30, 2021\n- 1 min read\nAs your Police and Crime Commissioner, I’m here to give you a voice on police and crime matters. My job is to oversee our police force because that’s what it is – our force.\nThanks to everyone who took part in my huge public consultation recently on fighting crime and preventing crime.\nWith your help, we now have a new four year plan for policing priorities in our region.\nI will make sure Northumbria Police delivers on these commitments to keeping you, your family, and your community safe.This not just a plan for the now but for future generations and has been designed to see us through a crucial period of recovery that will follow the Covid pandemic.\nThe plan was officially launched on Friday 12th February, where I was delighted to be joined by the Chief Constable to talk through the plan, what it means for our communities and what residents can expect to see locally. We committed to making more information available to the public, sharing how we were delivering the plan and answered your questions on the topics that mattered most to you. You can watch the launch here.\nAlong with my team, I look forward to working with Northumbria Police to put this plan into action and you can keep up to date with all the work that is happening via Twitter, Facebook or Instagram. You can also contact me via email enquiries@northumbria-pcc.gov.uk.\nKeep in touch,\nKim McGuinness\nPolice and Crime Commissioner for Northumbria\nUploaded 17th February 2021",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_cost-of-living-crisis-forcing-women-to-stay-with-abusers-1/content_21.html": "Cost of living crisis forcing women to stay with abusers\n- ContentEditor\n- Aug 25, 2022\n- 2 min read\nEmergency grants are desperately needed to help people escape abusive partners during the cost of living crisis.\nThat's why I’ve joined with women’s charities to call for Government action to help women escape nightmare situations.\nEmergency funding would be a lifeline to trapped survivors of domestic abuse across the North East.\nFigures released by Women’s Aid last week revealed the devastating impact the cost-of-living crisis is having on those wishing to flee abusive relationships, yet fear they lack the finances to do so.\nEarlier this year the North-East overtook London as the UK’s child poverty hotspot, with two in five children living below the poverty line. As a region with the highest levels of poverty, I believe there could be many more victims trapped in abusive relationships because they can’t afford to leave, and especially if the perpetrator controls the family finances and restricts what resources their victim has access to.\nWomen’s Aid findings show almost all survivors (96%) had seen a negative impact on the amount of money available to them as a result of cost-of-living increases. Almost three quarters (73%) said the cost-of-living crisis had either prevented them from leaving or made it harder for them to leave. They are, therefore, calling on Government for an Emergency Support Fund to help offset the impact of the cost-of-living crisis.\nRight now domestic abuse victims wishing to escape their abuser are being failed. Rising inflation and the cost-of-living crisis is making life harder for everyone, but for those living with domestic abuse every single day, the impact and consequences don’t bear thinking about, but we must and we must find solutions for these survivors.\nWith economic abuse, perpetrators control a victim’s access to finances and the things money can buy such as a phone, food, clothes, fuel, heating and so on. Perpetrators may use the cost-of-living crisis as an excuse to further tighten the economic abuse of their victims.\nThese survivors have suffered enough, poverty shouldn’t be another obstacle in their way, surely Government can’t choose to ignore the needs of people who could be in real danger any longer?\nIf you are experiencing domestic abuse, you can report an incident by ringing 101 or visiting www.northumbria.pnn.police.uk. Also, in a non-emergency situation you can text 07786 200814. In an emergency, always call 999. For free, confidential support and advice you can call the Northumbria Victims and Witnesses Service on 08000113116. For more information on Surviving Economic Abuse, click here.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_news/content_6.html": "top of page\nLatest News\nSearch\nMy plan for the greenest transport in the UK\nNorth East Labour Mayoral candidate Kim McGuinness has committed to taking back control of the bus network in order to give passengers a...\nApr 2, 20243 min read\nCHANCELLOR MUST END DEVOLUTION DIVIDE\nTHE Chancellor has been urged to sign off a new trailblazer devolution deal for the North East in his Spring Budget. Mayoral candidate...\nMar 15, 20242 min read\nCALL FOR STATION UPGRADES ACROSS THE NORTH EAST\nKim McGuinness has called on Network Rail to strengthen station improvement plans or risk forcing out elderly and disabled passengers....\nMar 15, 20242 min read\nUSE HS2 FUNDS TO REWRITE THE NORTH EAST DEVOLUTION DEAL AND UNDO DURHAM TRANSPORT SNUB\nThe Government has been urged to use money saved by scrapping HS2 to undo a multi-million pound Durham transport snub. North East Mayor...\nJan 9, 20242 min read\nTORIES MUST REVERSE THEIR LEAMSIDE SNUB AND REOPEN TRAIN STATIONS\nThe Transport Secretary has been urged to provide the £20m initial funding needed to eventually reopen at least six North East rail...\nNov 29, 20232 min read\n£20M CALL TO FUND VITAL EARLY STAGE OF RAILWAY REOPENING PLANS\nThe Government must provide £20m to fund the Leamside Line early work if it is serious about backing North East rail, a key railway...\nNov 23, 20233 min read\nCALL FOR MORE RADICAL DEVOLUTION DEAL IN AUTUMN STATEMENT\nThe Chancellor has been urged to use this week’s Autumn Statement to finally hand the North East a far more radical devolution deal and...\nNov 23, 20233 min read\nDEVOLVE STATIONS TO MAYORS AND SAVE OUR SERVICES\nTHE next North East devolution deal must see control of train stations handed back to the region to stop train companies winding down...\nAug 4, 20232 min read\nUnfreeze our electric bus fund\nMayoral candidate Kim McGuinness and Blaydon MP Liz Twist have warned that a nearly £20m bid for green buses across the North East is...\nJul 3, 20232 min read\nTogether we can reclaim our ambition\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_i-m-taking-money-off-criminals-to-fund-your-neighbourhood-project-1/content_27.html": "I'm taking money off criminals to fund your neighbourhood project\n- ContentEditor\n- Nov 7, 2021\n- 2 min read\nWHEN people come together to make their neighbourhood better, I'll back them - from boxing clubs to urban parks.\nThat's why I have launched ‘Operation Payback’, the funding pot were criminals’ cash is handed back to good causes.\nThe aim is to prevent crime and anti-social behaviour, which will ultimately improve lives for those living in neighbourhoods across Northumberland, Tyne and Wear.\nI especially want to hear from organisations in some of the more disadvantaged areas.\nThat's why grass root projects and community causes can bid from today (November 1) for a share of the £130,000 pot of funding.\nThis is what we all want to see – cash seized from criminals in the North East being put back where it belongs – into the grass roots of local communities.\nI want to see this money end up in the right hands – the volunteers, the doers, those who know the needs of their community and are doing things that make a real, positive difference to local lives. It’s about empowering local groups to find solutions that work in their community.\nThis all ties in with the aim of preventing others going down a path that leads to a life of crime, and in turn preventing there being more victims of crime.\nThe funding initiative will offer micro grants of up to £1,000 or larger grants of up to £5,000, and so the hunt is on for stand-out projects that have a really positive impact at a local level, particularly those struggling with poverty and those areas affected by high crime rates.\nThe best way we can help our police is by helping prevent crime in the first place, rather than leaving them to pick up the pieces. I want as many people as possible to know about this opportunity – it’s a chance to make good things happen in your area – to really empower those behind a worthwhile project.\nSuccessful applications will demonstrate how a project will help combat the impact of crime, reduce crime and provide diversionary activities.\nFor more information, full criteria and terms and conditions please visit the Northumbria Police and Crime Commissioner’s website.\nSince becoming Police and Crime Commissioner in 2019, Kim has awarded over £985,000 in grants to community causes across Northumberland, Tyne and Wear.\nApplications close Friday 3rd December.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_call-for-station-upgrades-across-the-north-east/content_14.html": "CALL FOR STATION UPGRADES ACROSS THE NORTH EAST\n- Content Editor\n- Mar 15, 2024\n- 2 min read\nKim McGuinness has called on Network Rail to strengthen station improvement plans or risk forcing out elderly and disabled passengers.\nBosses at Network Rail are about to embark on a new round of station and track upgrades, with the Eastern leg alone likely to see some £10bn invested.\nBut rail chiefs have only set aside £300m to make train stations more passenger friendly and step free.\nMayoral candidate Kim McGuinness said she wants devolved power to bring train stations under local, public control in order to co-ordinate improvements and invest in them that drive the locally economy.\nShe has written to Network Rail urging the organisation to do more to bring stations up to standard.\n“It’s time our public transport was owned by the public and accessible to the public, and that means everyone, not just the young and mobile,” Kim said.\nMany North East stations need substantial upgrades to make them easier for elderly and disabled users.\nIn the most recent parliamentary study into accessibility on the railway there were many areas of improvements identified for the North East, with issues to be addressed by both Network Rail and train operators.\nIncredibly, only 24% of North East stations have accessible ticket machines in place, while just 13% have a ticket offices that everyone can use. This figure drops to just 6% across Northumberland, the third lowest in the country.\nAround 16% of our stations do not have step-free access, but this figure I believe hides the true picture. Many North East stations may appear to have ramp access but a study of these has shown many actually have poor standard ramps.\nThese fall way below modern standards for accessibility and will often be too steep narrow or rough for a wheelchair to use.\nKim said: “Network Rail needs to set out how they will make every North East train station accessible to elderly and disabled users, by when and how much of this £300m pot we’ll see in the North East.\n“We cannot continue with a two-tier railway network, more needs to be done to help elderly and disabled passengers.\n“But there is a wider issue here – the North East shouldn’t have to deal with distant quangos and layers of bureaucracy to get things done. Many of the key train stations in the North should be in public hands, so we can co-ordinate public transport improvements and regenerate city and town centre locations.\n“As mayor I’ll be fighting to ensure control of our stations is handed back to the people of the North East.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_operation-payback-money-taken-from-criminals-and-handed-back-to-communities-1/content_45.html": "Operation Payback - money taken from criminals and handed back to communities\n- ContentEditor\n- Jun 15, 2022\n- 2 min read\nSometimes people ask me: “what has fighting poverty got to do with fighting crime?\"\nThe truth is, if you live in a deprived area, you are more likely to be a victim of crime. If you\nare a victim of crime and on a low income, then the cost of rebuilding is greater. And if you\nare trapped in poverty, you know it will be your kids, not those from better off families,\nbeing targeted by gangs and dealers.\nThat's why I have relaunched Operation Payback to ensure local organisations fighting poverty and inequality have the support they need.\nPayback is about getting money back into the right hands. From families to youth clubs – everyone is struggling right now and there are consequences.\nThere’s no better use for cash seized from crime than channeling it right back into communities to help prevent more crime. With the school holidays around the corner I want to help make sure there’s stuff for kids to do, places they can go.\nI’ve spoken to mams and dads who are pretty worried. They can’t afford to do the stuff they want to do – the holidays the trips out, not to mention the basics like putting all the extra meals on the table. Some parents are working hard themselves over the holidays just to make ends meet and just can’t keep their eye on the kids.\nSo I want us to use Payback to find ways to help. We’ve had people get in touch about things like running evening pizza clubs to help keep kids fed and cut ASB on the streets – things like this are a win all round. It helps improve the quality of life for everyone in our communities and reduces the number of victims.\nPeople tell me they feel intimidated by groups of youths gathering at the Metro or vandalising their local park. I want to give kids a far more attractive way to spend their time, exploring their talents – boxing, dance, football, music – you tell me. This really is a great opportunity to get that funding right where it’s needed most.\nFor further information on how to apply visit HERE.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_my-devolution-plan-for-the-north-east/content_55.html": "My devolution plan for the North East\n- Content Editor\n- Jan 26, 2023\n- 3 min read\nMaking opportunity and pride the centre of our North East vision\nKim McGuinness has announced she is standing to be the Labour candidate for the new role of North East mayor - with a plan to create real opportunity and build on the region’s powerful sense of pride and identity.\nKim said she wants to be mayor to ensure that every part of the North East benefits from devolution and has promised to work with council leaders to put people at the centre of her plans for the region.\n“The North East has been stuck in second gear for too long. Government has failed to inspire and it has failed to deliver on a promise to level up. If anything, the substance of this deal and the recent levelling up funding announcement prove this. I want to be the mayor that champions our region and makes sure Government hears our voice. I will work with a Labour Government to bring real power to the people of the North East” she said.\nHer announcement comes after seven council leaders in the region negotiated a devolution deal which creates a new mayoral combined authority. The Labour Party will now have to select a candidate for this newly created post.\nKim said that if elected her time in office would be built around a relentless focus on ending child poverty. The North East now has the highest child poverty rates in the country coupled with the highest unemployment rate.\nKim said: “I am standing to be a campaigning mayor in a region I love. If I become mayor I will work with our councils to ensure a relentless focus on creating real opportunity is the thread that runs through everything I do as mayor.\n“That means bringing the region together to end child poverty and making sure everyone has access to good homes and great jobs.\n“It means climate solutions that go beyond net zero with investment in nature and\nbio-diversity and investing in young adults to create opportunity for all.\n“And it means urgently introducing the publicly-controlled North East transport system\nthat is the key to our growth.\n“We need change and we need to fight for real power. Devolution simply hasn’t meant anything to most people in our region so far.”\nShe added: “When you hear the media or people in Westminster talk about the North, they constantly look to Manchester. We have sat back and watched as Manchester got on with the job. Manchester has become the de facto voice of the North, and I won’t stand for that any longer.\n“We need a mayor who is both proud of our region and prepared to be bold in their ambition.\n‘I’m not here to use the job as an ideological experiment. I’m standing to ensure the Labour Party brings opportunity to all parts of the North East, turning our regional pride into a powerful force for change.\n“For me, this is personal. I grew up here, my life was changed by the last Labour Government and the opportunity it gave me. I love where we live and I want to be the Labour mayor that makes this the best place in the country to be and gives the next generation all the opportunities they need to succeed.”\nThe mayoral candidate has spent her time as Northumbria Police and Crime Commissioner focussing on two key priorities: ensuring the police are supported to fight crime and backing the hardest hit communities in the battle to prevent crime.\nWith her police and crime plan, Fighting Poverty, Fighting Crime, she became the first police commissioner in the country to make alleviating entrenched poverty a key part of crime prevention.\nShe has overseen the creation of the region’s first Violence Reduction Unit and used its resources to deliver frontline community services that stand by families in difficulty. Her flagship Operation Payback scheme has seen money recovered from criminals and handed directly to local people to spend in their neighbourhoods.\nIf selected as the Labour candidate Kim will remain as Northumbria Police and Crime Commissioner until May 2024. She said “the people of the region entrusted me to deliver for them as PCC. I’m committed to that and the continued effort to fight and prevent crime across our region.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_to-end-poverty-we-must-devolve-real-power-to-those-who-experience-it-1/content_37.html": "To end poverty, we must devolve real power to those who experience it\n- ContentEditor\n- Jun 20, 2022\n- 3 min read\nPoverty in England is entrenched and it is entrenched because the people who experience it have no power to end it.\nThat’s the simple truth that undermines every government attempt to end poverty. You might be wondering why a police and crime commissioner is talking about this; it’s because I’m sick of seeing families forced into a poverty spiral, being victims of crime and powerless to change their situation.\nI’m sick of seeing their kids trapped in poverty and enticed into crime while those that grow up with better-off parents continue to do well.\nWe need a new era of real devolution to change this.\nIf you want to see the stark evidence that decades of centralising power in London has failed the UK, look no further than the poverty we see around us.\nEven before the pandemic, 4.3 million children were living in poverty – up 500,000 over the past five years. And now we know to expect to see 1.3 million more people pushed into poverty next year as bills continue to rise.\nAnd yet there was no mention of child poverty in the levelling up white paper.\nOver the last decade we’ve seen minister after minister, sitting in their Whitehall office with London-based civil servants coming up with new ideas about tackling poverty: David Cameron’s ‘big society’ and Iain Duncan-Smith’s welfare reforms to name two, both of which were a cover for cutting local services, removing the safety net and punishing the poor into ‘taking more responsibility for their lives’.\nSurely it is time we handed the powers to act back to the regions living with this poverty?\nThe North, especially the North East, needs well-paid, high-end jobs and top-class infrastructure. But the honest truth is that jobs like this are few and far between, they aren’t coming quick enough and so far they have done nothing to end poverty.\nWe have in Nissan the most productive factory in the UK. We have an offshore industry that is transforming fortunes.\nAnd that’s great.\nBut right now we have mums who can’t afford to give their kids a breakfast and struggle to feed them during school holidays. It is blindingly obvious that they are not going to be applying for a job in one of the fancy new science buildings that this government thinks are the answer.\nIf we get devolution right, maybe their kids will. But what do we do for those families now? The solution isn’t especially complicated.\nIf we are going to end poverty we need devolution deals that allow local leaders to create jobs locally, not just jobs for graduates, or the better off, or the privately educated. What is the point of us opening up another research centre if just a mile away there is a high street with only a bookies and a charity shop for work and people that live there that have relied on food banks for years?\nNobody would argue that green jobs, digital jobs and STEM jobs are not worthwhile, and we need to push for more. But a jobs focus that only sees STEM jobs as worthwhile is the direct result of rule from Whitehall. We will never reduce poverty if we only devolve power to meet Treasury targets.\nLocal councillors in the North East, in Blyth or Gateshead, can see first-hand what is needed to find good local jobs for families and a good breakfast for children. But those local decision-makers are powerless to act. Devolution and levelling up has to address this. That means handing cities and towns and rural areas the freedom to develop radical anti-poverty solutions, with the financial freedom to act on these plans. Then we’ll see more local economies strengthened, more backing for employers with a sense of community purpose and a connection to their town, more residents who take pride from a good wage at a local firm. Bringing back strong neighbourhoods is real levelling up. They reduce poverty, they drastically reduce the chance of being a victim of crime and they bring opportunity to young people who might otherwise be tempted by criminality. Until we have a national commitment to these goals, devolution and levelling up will never mean anything to the hardest hit communities.\nThis article first appeared on the Labour List website.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_news_page_3/content_9.html": "top of page\nLatest News\nSearch\nRevealed: The Tory's North South divide in police recruits\nThe Home Secretary is holding back funds to give the North the same extra police officers as the south - and Labour has the figures to...\nDec 5, 20222 min read\nPolice staff deserve a fair pay\nPolice staff are a vital part of fight against crime, and it’s time the Home Secretary handed over the funds for a proper pay rise. Last...\nAug 25, 20221 min read\nCost of living crisis forcing women to stay with abusers\nEmergency grants are desperately needed to help people escape abusive partners during the cost of living crisis. That's why I’ve joined...\nAug 25, 20222 min read\nOur demands for the new PM\nThroughout this summer people have been stepping up across our region to help others and support their neighbourhood. As inflation soars...\nAug 19, 20221 min read\nFeeding Families - the frontline in the fight against poverty\nFeeding Families are fighting poverty head on- so I'm running my first (and last) ever Great North Run for them. Feeding Families are on...\nAug 19, 20221 min read\nA fresh start for Britain\nAs Boris Johnson clung on to power and the Tories turned a blind eye to the nation's cost of living crisis, our Labour Party was setting...\nJul 12, 20222 min read\nTo end poverty, we must devolve real power to those who experience it\nPoverty in England is entrenched and it is entrenched because the people who experience it have no power to end it. That’s the simple...\nJun 20, 20223 min read\nHow my violence Reduction Unit is standing by families and cutting crime\nPoverty, deprivation and crime go hand in hand. We all know criminals thrive when people are denied opportunity and we know that when...\nJun 20, 20221 min read\nHonouring crime-fighting local heroes\nI was honoured to be standing alongside a brave Newcastle mum who has received a top recognition for her work teaching kids about knife...\nJun 20, 20222 min read\nTogether we can reclaim our ambition\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org/content_1.html": "top of page\nLet's make the North East the home of real opportunity\nAs North East Mayor I will lead the fight to end child poverty, create good jobs and ensure we lead the UK once again in arts, culture and sport.\nKim McGuinness\nIn order to enjoy a successful future the North East of England desperately needs a powerful voice speaking and campaigning on behalf of the whole region on the national stage. Kim will be an excellent spokesperson and representative for all the Great North region, as we compete for our fair share of government support.\nSir Brendan Foster CBE\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_get-involved/content_4.html": "top of page\nGet Involved\nJoin my people-powered campaign\nThere are many ways to get involved in my campaign for selection as Labour's mayoral candidate.\nContribute\nbottom of page\nThere are many ways to get involved in my campaign for selection as Labour's mayoral candidate.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_fighting-poverty-fighting-crime-1/content_54.html": "Fighting Poverty, Fighting Crime\n- ContentEditor\n- Mar 9, 2022\n- 2 min read\nI'm proud to be the first Police Commissioner to put fighting the effects of poverty on the same footing as fighting crime.\nWhen it comes too policing, my first priority will always be more officers on the beat putting more dangerous criminals in prison.\nBe that will only ever get us so far.\nWhat our region needs is radical solutions to the poverty we face around us.\nAnd my new strategic plan for crime and policing does just that.\nIt sounds obvious to say it, but if you live in an area of poverty you are far more likely to be a victim of violent crime, of anti-social behaviour or theft.\nWhen the pandemic hit, 27% of children in the north were in poverty and it’s even higher once housing costs are added on.\nSome 58% of our councils have above average rates of child poverty – compared to 19% nationally.\nAnd if you’re a parent in an area of deprivation you’re more likely to be worried your children will suffer from bad influences.\nYou’ll be more likely to see your children suffer from a lack of opportunity, from the lack of good services after years of austerity.\nSo, yes, we have an economy that is thriving in some sectors. We have new factories and university campuses.\nBut if we do not come up with radical anti—poverty solutions then we are in real danger of creating a two-tier North East,\none thriving aspiration, one of persistent poverty\nAnd we have to challenge that.\nTo kick-start the unveiling of the new approach to tackling crime, I have awarded £130,000 of cash to a range of community causes through the first round of my Operation Payback 2022 scheme.\nThe scheme uses cash seized from criminals to fund meaningful grass roots initiatives, improve local lives and repair the harm caused to communities by crime. Beneficiaries announced today include:\nNew Beginnings – Sunderland\nSports for Youth – Newcastle\nPrimrose Park Alliance – South Tyneside\nStomping Ground Forest School – Gateshead\nMindstars NE – North Tyneside\nPrudhoe Youth Project – Northumberland\nFull list available here",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_devolve-stations-to-mayors-and-save-our-services/content_13.html": "DEVOLVE STATIONS TO MAYORS AND SAVE OUR SERVICES\n- Content Editor\n- Aug 4, 2023\n- 2 min read\nTHE next North East devolution deal must see control of train stations handed back to the region to stop train companies winding down vital community assets, Kim McGuinness has said.\nNorth East mayoral candidate Kim McGuinness has said plans to close ticket stations across the region “show that neither rail franchisees nor Government ministers can be trusted to invest in our infrastructure”.\nTrain operating companies such as Northern and LNER are currently consulting on plans to close all but one North East ticket station. It is feared the move will lead to significant job losses and turn the railways in to no-go areas for those with disabilities or no regular internet access to cheaper tickets.\nKim McGuinness, Labour’s candidate for next May’s mayoral election, said the plans show how important it is for train stations to be publicly-controlled.\n“Rail station devolution needs to be in the next devolution deal, and as mayor I’ll fight to take stations out of the hands of private companies and back in to local control,” she said.\nKim was backed by Martin Gannon, chair of Transport North East and one of the council leaders to negotiate the current devolution deal with Government.\nThe Gateshead Council leader said it was important the region pushed ahead to secure greater devolution in a future deal.\nHe said: “The devolution deal we have now is just a start. We know we need more devolution from Government to our region if we are going to create real change.\n“Integrating our transport network is key to our economic success, and it’s right that councils and the mayor have a bigger say over all parts of the local network.”\nKim added: “Our train stations are community assets, but they are being run-down by train companies who would rather they were nothing more than a platform.\n“What they need is long-term investment so they can be safe, thriving stations that support small independent businesses and community groups.\n“The public should be able to elect councils and mayors who can work together to safeguard these key community assets instead of watching as train firms turn their back on them.\n“Yes, a mayor might not be able to run the actual ticket offices on behalf of the rail companies, but we can make train stations a more welcoming place to offset these cuts. So as mayor I’ll fight for real devolution that sees stations become regional economic assets under public control.”\nTaking stations into public control would also allow the North East to better align station redevelopment with wider regeneration projects, bringing in more revenue as stations become a bigger feature of the local economy.\nKim has already set out wider transport plans for the North East including bringing buses back under public control and introducing an integrated ticket policy so only one ticket or pass is needed for any journey on bus or Metro.\nAnd the mayoral candidate says she wants to see the North East have a much bigger say over local rail franchises in order to ensure better performance for passengers and greater ticket integration with the local network.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_a-fresh-start-for-britain-1/content_23.html": "A fresh start for Britain\n- ContentEditor\n- Jul 12, 2022\n- 2 min read\nAs Boris Johnson clung on to power and the Tories turned a blind eye to the nation's cost of living crisis, our Labour Party was setting out a new vision for the country.\nI was proud to introduce Keir Starmer when he came to Gateshead to set out our party's fresh start for Britain.\nAs Keir made clear: \"Only Labour can reboot our economy and end the cost-of-living crisis. Only Labour can revitalise our public services and re-energise our communities. Only Labour can unite the country and clean-up politics. It's time for a Labour government.\"\nI told the audience gathered at the Sage Gateshead that in the North of England, we see all too often the cost of 12 years of Tory austerity, the impact of Government cuts to our councils and our public services that have yet to end.\nOur wages are lower, our employment rate is higher and over 37% of kids here are growing up in poverty.\nAnd as my union Unison keep telling us, our key workers are going from the front line to the bread line and that is something we can’t tolerate.\nYet there's also a story of regional pride and Labour in power here.\nThe Sage, the Baltic next door and the beautiful Millennium Bridge are all legacies of\nthe last Labour Government and a strong labour council. The next phase of development- an international convention centre - is down to that Labour led council and their bold vision for economic regeneration.\nBut if we want to go even further, we need a General Election.\nThe fact is the Tories, regardless of who they choose as PM, have lost the plot. The cost of living crisis, with inflation and further pain for families to come as energy bills go up in the autumn, people will suffer at the hands of their negligence and God forbid, people will die, just as too many did in during the pandemic.\nWe need a General Election. This region needs a General Election and\nwe need a Labour Government now.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_a-hotel-levy-to-fund-a-new-era-of-north-east-events/content_61.html": "A HOTEL LEVY TO FUND A NEW ERA OF NORTH EAST EVENTS\n- Content Editor\n- Jun 19, 2023\n- 3 min read\nNorth East mayoral candidate Kim McGuinness has said a massive new era of North East culture, tourism and festivals could be funded by a £1-a-night levy on hotel guests.\nKim, standing to be Labour’s candidate for the new North East mayor post, said she wants to work with businesses to introduce the small additional charge which can then be used to showcase the region and turbo charge its cultural sector benefitting businesses and residents alike.\nThe North East tourism economy is the 4th biggest regional employer and saw some 90 million visits a year pre covid. But the region still receives the lowest number of domestic and international visitors and the smallest spend of any region in England – a figure Kim has vowed to change with the proceeds of the tourist levy.\nKim has made both supporting the arts and turning regional pride into an economic asset two key features of her bid to be Labour’s candidate for North East mayor.\nThe mayoral candidate has promised to invest in culture, events and visitor attractions if successful in May 2024, both as a driver of jobs in the region. Investment would also be made to give families access to culture, arts and sport through a new network of Sure Start style centres as a way of combating the effects of poverty in some of the North East’s hardest hit neighbourhoods.\nKim said: “The people in the North East are incredibly proud of all we have to offer, from arts to music to sport and more. Our cultural heritage defines us. Now it’s time to grow that. If we introduce a small tourist levy on hotel stays, like they have in other European regions, we can fund a series of major visitor events that will create jobs and put our region back on the national stage.\n“We only have to look at the positive economic impact of Sam Fender and Pink concerts in in June which brought in more than £15m to the local economy. Out region can benefit from more of that impact”\nThe levy, often applied on a per night per room basis, is common across many European cities and used to fund local events or invest in infrastructure such as public transport networks. The levy is typically set at a level that is meaningful but won’t affect demand and applies to hotels, B&Bs and short term lets.\nIn the UK overnight levies are currently only able to be applied when agreed on a voluntary basis backed by city centre businesses. These businesses then set out how to invest the money raised.\nKim said she will first work with business and business improvement districts as mayor to introduce a voluntary scheme supported by the Combined Authority.\nBut for bigger success she believes the overnight levy will need to be put on a statutory basis overseen by the mayor and council leaders at a regional level. Such a move would need new Government legislation.\nShe vowed to lobby the next government for these powers as part of the next devolution deal for the North East.\nKim added: “I want the North East to be known as the home of real opportunity, where we tackle hardship and the unfair effects of austerity head-on. Arts and culture, sports and music, we’ve seen time and again these areas be a path to success and if we invest in culture and arts we can inspire a new generation.\n“But not everyone gets the chance to succeed. We need to invest in young people and neighbourhood services in our hardest hit areas to make sure everyone has that opportunity.\n“And we need to create more well-paid, secure local jobs now so parents have the financial security to support children who might go on to be the musicians or sports stars of tomorrow.\n“My Plan for the North East brings together all these elements in a way that finally delivers the benefits of devolution to all our region.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_give-us-back-our-cops/content_62.html": "Give us back our cops!\n- Content Editor\n- Mar 30, 2023\n- 2 min read\nThe Tories cut 1,100 officers from Northumbria Police - it's time we got them all back.\nSince austerity started in 2010, Northumbria Police have lost more than 1,100 officers as a result of budget cuts worth around £148m.\nIn 2019 the Government said it would hire 20,000 new police officers - but in the Northumbria force area we got just 615.\nWith more than 500 officers still to be replaced, it's time the Government acted before rising demand places impossible pressure on our police.\nAlready, 999 calls to Northumbria’s police control rooms are rising at very high levels. December 2022 saw 13% more grade 1 calls made across Northumberland, Tyne and Wear, compared to 2021, and 52% more compared to the pre-pandemic December in 2019. Figures also show that 999 calls last year rose by 9% in contrast to the previous year.\nAs soon as a 999 call comes in we need to be getting officers out there responding to the needs of the public. And we need a well-resourced force to deliver this. It really is vital that our officer recruitment matches this growing demand. Quite frankly the targets set by Government show how out of touch they are with our needs. What they have set out to achieve is not uplift, it’s not how we fight crime and it’s not how we look after the North East\nThankfully, Labour has a plan. When our shadow Home Secretary Yvette Cooper joined me at a Labour Party members dinner this month, she set out how the next Labour Government will make our communities safer.\nLabour will hire 13,000 new neighbourhood police officers, putting dedicated local officers back in to the areas most in need.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_copy-of-why-i-m-standing/content_3.html": "My Manifesto\nWhy I'm Standing\nAbout\nNominations\nNews\nGet Involved\nContact\nMore...\nOur North East region is made up of many proud local identities united by a shared belief that if we do things our way, not London’s, we can thrive. In my manifesto I set out my plan to make this region the home of real opportunity.\nTogether we can reclaim our ambition",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_news_page_4/content_20.html": "top of page\nLatest News\nSearch\nWomen have been let down and we need to better at every level\nThe number of violent attacks against women and girls is increasing each year, and we need a plan to deal with it. Figures for the...\nJun 20, 20221 min read\nOperation Payback - money taken from criminals and handed back to communities\nSometimes people ask me: “what has fighting poverty got to do with fighting crime?\" The truth is, if you live in a deprived area, you are...\nJun 15, 20222 min read\nFighting Poverty, Fighting Crime\nI'm proud to be the first Police Commissioner to put fighting the effects of poverty on the same footing as fighting crime. When it comes...\nMar 9, 20222 min read\nA lesson for Michael Gove - if you want real levelling up, listen to Sam Fender\nThis month the Government published its white paper on levelling up - and it missed opportunity after opportunity to bring real change to...\nMar 9, 20222 min read\nFun without Fear - keeping women safe in Northumberland, Tyne and Wear.\n“FUN without fear” is a new awareness campaign backed by myself and Rape Crisis Tyneside and Northumberland. I love that cities and towns...\nMar 9, 20222 min read\nOne rule for the Tories - one rule for us\nThis month we heard the shocking but not surprising news that while the UK was in lockdown the Prime Minister was going to parties. I...\nJan 22, 20221 min read\nAffordable? Reliable? Safe? A survey for better public transport\nOn buses and Metros, across Northumberland, Tyne and Wear, passengers want a network that is afford and reliable, but they also want it...\nJan 22, 20222 min read\nWinter in poverty - the price of Tory failure\nFAMILIES across the North East are being pushed to desperation as bills rise and pressure mounts. Earlier this year, it was reported that...\nJan 22, 20222 min read\nStorm Arwen - a tale of Tory failure\nKeir Starmer joined myself and others to see first hand how families in Northumberland suffered the effects of a deadly storm - all while...\nDec 13, 20211 min read\nTogether we can reclaim our ambition\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_chancellor-must-end-devolution-divide/content_16.html": "CHANCELLOR MUST END DEVOLUTION DIVIDE\n- Content Editor\n- Mar 15, 2024\n- 2 min read\nTHE Chancellor has been urged to sign off a new trailblazer devolution deal for the North East in his Spring Budget.\nMayoral candidate Kim McGuinness has called on Jeremy Hunt to end the two-tier devolution system that has left the North East playing catch up to the likes of Manchester and London.\nShe has written to the Chancellor calling for a raft of devolution measures needed to turbocharge the North East economy and help end child poverty in the region.\nTop of these measures is a trailblazer devolution deal, currently being negotiated by the region’s seven council leaders.\nSuch a deal would hand the region a lump sum of funding similar to that enjoyed by a Whitehall department, rather than individual grants controlled decided after a bidding process to Government.\nKim has also directly lobbied the Chancellor to include in any devolution deal funds for the new film and television studios in Sunderland, after holding face to face talks with developers Fullwell 73 and industry leaders in support of Sunderland Council’s work.\nBut the Labour mayoral candidate has also urged the Chancellor to be bolder in the devolution offer to UK regions including:\n· Devolution of Homes England, Sport England and Arts Council funds to the regions and an end to the days of unelected quangos picking winners and losers in everything from local football clubs to museums and galleries.\n· Devolution of Jobcentre powers so the North East can use local knowledge to target employment support.\n· Train stations stripped from rail franchisees and handed to mayors and councils, saving ticket stations and helping co-ordinate city-centre investments.\n· Real powers to oversee northern rail services, including the power for mayors to come together and kick out failing operators such as Transpennine Express.\n· A Tourism Levy so that businesses can work together to raise money for big-scale events.\nKim said: “The Chancellor’s budget is a chance to bring real devolution to the entire North East. Right now we have to go cap in hand every time our region needs investment, and every time we do this we have to hope officials who live and work in London will agree with our North East ambitions.\n“It is time people in the North East had control of their own decision-making. I’m calling on the Chancellor to end the days of London’s centralised control and begin the process of real devolution.\n“The first step towards that is to end the days of the North East been behind Manchester and others when it comes to devolution. Hand our region real powers and let us grow.”\nKim added: “In just the last year of Labour’s regional development agencies the North East had more than £300m to invest in local job creation - we get a fraction of that now.\n“The current devolution deal given to the North East has an annual investment fund worth just a small fraction of that historic high.\n“We can’t continue pretending second-best is good enough.”\n“Our region needs someone prepared to fight for it, to be an advocate for all that is great about the North East and to secure the real devolution that will let us control our own destiny. That’s why I’m standing to be mayor.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_news_page_6/content_24.html": "top of page\nLatest News\nSearch\nFighting Crime, Preventing Crime Launched\nAs your Police and Crime Commissioner, I’m here to give you a voice on police and crime matters. My job is to oversee our police force...\nMar 30, 20211 min read\nPolice commissioner warns crime bill 'misses huge opportunity' to protect women from violence\nCritics have slammed the new Police, Crime, Sentencing and Courts Bill this week over a lack of action to protect women and a crackdown...\nMar 30, 20213 min read\n'Cultural change' needed to stop violence against women, says Northumbria Crime Commissioner\nNorthumbria Police and Crime Commissioner Kim McGuinness spoke to ChronicleLive about the 'honest, raw' outpouring of fear and grief that...\nMar 30, 20212 min read\nNorthumbria Police pledges 78 devices to Laptops for Kids campaign for those most in need\nMore than 2,500 laptops, tablets and computers have now been donated to help disadvantaged children learn during lockdown L to R:...\nMar 30, 20212 min read\nNorth East leaders say families should be 'proud' as schools return in lockdown exit milestone\nMillions of pupils went back to class on Monday morning for the first time in two months, a crucial step in the UK's roadmap out of Covid...\nMar 30, 20211 min read\nTogether we can reclaim our ambition\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_one-rule-for-the-tories-one-rule-for-us-1/content_30.html": "One rule for the Tories - one rule for us\n- ContentEditor\n- Jan 22, 2022\n- 1 min read\nThis month we heard the shocking but not surprising news that while the UK was in lockdown the Prime Minister was going to parties.\nI want to put that in to context. On the day Boris Johnson accepted an invite for a works party in Downing Street, in May 2020, Northumbria Police were notified of 229 local breaches of the covid restrictions put in place to keep us safe.\nThose were cases reported to the police because the majority of us believed in one simple idea - if we all follow the rules we can get through this.\nA lot has changed over the last 12 months, with further restrictions and boosters, but throughout we have seen people in the North East do their bit to stop the spread of covid.\nHowever, in Downing Street we saw a different story. The PM appears to have broken the law, the very laws he set in place.\nHe appears to have attended a party when doing so was illegal, and he should resign.\nTo put his actions in to some sort of context, on the day Boris Jonson was breaking the law and partying, Northumbria police were made aware of 229 covid related incidents.\nNow, those will have been delt with on a cases by case basis, and not all will have needed a fine. But we can’t have a situation where it is one rule for the Prime Minister and one rule for the rest of the country.\nWe need moral leadership from our Prime Minister, and we are just not seeing it.\nDespite that, in Northumbria we are getting on with the job.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_20m-call-to-fund-vital-early-stage-of-railway-reopening-plans/content_7.html": "£20M CALL TO FUND VITAL EARLY STAGE OF RAILWAY REOPENING PLANS\n- Content Editor\n- Nov 23, 2023\n- 3 min read\nThe Government must provide £20m to fund the Leamside Line early work if it is serious about backing North East rail, a key railway conference has been told.\nMayoral candidate Kim McGuinness has started a campaign to convince ministers to fund the Outline Business Case needed to reopen vital Northern rail infrastructure.\nSpeaking at the Rail Industry Association conference in Newcastle on Thursday, Kim said that the Government had to start the work now if it was to see economic growth in years to come, and said the minimum first step was funding the business case.\nThe conference heard that the North East needs both the Metro Washington extension and the full Leamside Line reopened to create an extensive new network of local stations on the reopened lines.\nThe outline business case Washington Metro Loop still needs £8.5m of work, with a similar amount at least expected to be needed to fund the initial stages of work preparing the case for the Leamside Line South. The two railway projects together would link up passengers in Durham through to Wearside, Tyneside and Northumberland.\nThe Prime Minister announced in his autumn conference speech that the Leamside Line would be reopened, but less than 24 hours later it had been axed from Government plans with ministers instead saying the line should be re-opened using local funds. It is estimated the total costs will vastly exceed £1bn, taking up the majority of all local transport funds on just one project.\nLabour mayoral candidate Kim McGuinness said the only way for the Government to re-establish its commitment to North East transport was to back to early work now.\nShe said: “Reopening this line is clearly vital to the North East. We know Government has u-turned on funding the full plan, but we remain ambitious.\n“That’s why today I am calling on the Government to at least now fund the business case for re-opening the line.\n“The costs are significant. The outline work for the Washington Metro Loop and the Leamside South – giving us the full Leamside Line over two projects – would easily come close to £20m.\n“If the Government is serious about backing this line, funding this Outline Business Case is a good start.\n“We know this is possible. The Northumberland line, linking Newcastle, Ashington and Blyth, is ready to reopen soon, and it did so after Government funded the detailed business case and early site work with a £34m grant. Co-incidentally, that railway line goes to a key Tory target seat.\n“We can’t have one part of the region played off against another. We need full investment in our rail infrastructure and if we can’t have that we at least need support for the early stages.”\nShe was backed by Martin Gannon, Gateshead Council leader, who said the Government had to match the region’s transport ambitions.\nMr Gannon, chair of the North East Joint Transport Committee, said: “We continue to stress with ministers the need for investment in both the Leamside Line and the East Coast Main Line in our region – unlocking the full potential of rail across the North East and beyond.\n“The North East continues to suffer from a major bottleneck on the East Coast Main Line which stifles our economic growth. Transport funding in our region is miniscule compared with the significant levels of investment in rail in the south, and we continue to make the case for national funding to help us deliver on our economic goals.\n“Investment in the ECML in the short-term would be game-changing for our residents and businesses and would release more paths to boost our rail services dramatically.\n“In the longer-term, re-opening the Leamside Line - a disused 21-mile railway running from Gateshead, via Washington, to Ferryhill in County Durham - would reduce capacity constraints on the ECML and trigger a major growth in freight. It would also allow us to build stations in communities currently isolated from the rail network.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_news_page_5/content_8.html": "top of page\nLatest News\nSearch\nKeeping people safe on public transport\nGOOD bus and Metro services are vital to our region, and it’s crucially important people feel safe on them as well. That’s why I have...\nDec 13, 20212 min read\nCall this levelling up? - Damning report shows South has twice as many youth clubs as our region\nTHE Tory Party's latest levelling up failure has been exposed in a new youth report that shows young people living in areas of...\nNov 7, 20212 min read\nI'm taking money off criminals to fund your neighbourhood project\nWHEN people come together to make their neighbourhood better, I'll back them - from boxing clubs to urban parks. That's why I have...\nNov 7, 20212 min read\nThe Government refused to give public workers a pay rise - so I resigned from their board\nIN the run up to the budget police staff and officers were told they would have to accept a 0% pay freeze. And while the Chancellor tried...\nNov 7, 20212 min read\nOur young people need urgent mental health support\nToo many young people are facing a mental health crisis , Police and Crime Commissioner Kim McGuinness has warned as she calls on...\nOct 29, 20212 min read\nSAFER METROS, SAFER BUSES, SAFER PARKS\nPolice Commissioner Kim McGuinness has promised to improve transport and park safety with an £800,000 investment in CCTV, Metro safety...\nOct 19, 20212 min read\nReverse Austerity To Back Our Young People\nA new report published by Police and Crime Commissioner Kim McGuinness calls on the Tories to urgently invest in youth services, if they...\nOct 19, 20214 min read\nKim McGuinness re-elected as Police and Crime Commissioner.\nKim McGuinness was re-elected as police commissioner for Northumberland, Tyne and Wear on a promise to fight crime, prevent crime. The...\nOct 19, 20211 min read\nSafe haven to help people in need\nResidents in need or distressed are being reminded their local fire station is a ‘safe haven’. Lynsey McVay, Assistant Chief Fire...\nMar 30, 20212 min read\nTogether we can reclaim our ambition\nbottom of page",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_a-plan-for-the-north-east/content_59.html": "A Plan for the North East\n- Content Editor\n- May 22, 2023\n- 3 min read\nMy plan for the North East will make the region the home of real opportunity and turn our regional pride into a key economic selling point for the North East.\nWe need an economy that works for everyone, where the benefits of devolution are felt across the region. This plan ensures that from offshore engineering and automotive manufacturing jobs to high streets and transport, the economy of the North East is inclusive and thriving\nI commit to:\n· End Child Poverty- This will be the thread that runs through every decision I make as Mayor.\n· Sure Start Plus – Labour transformed lives with Sure Start. We can empower a new generation with Start North East. From after-school clubs that deliver pre-apprenticeship training to youth clubs and music lessons for those in hardest hit neighbourhoods, we’ll support families and create real opportunity.\n· More Jobs, Better Jobs- I’ll focus on job creation in all locations and open dedicated North East Careers Hubs in villages and towns as well as cities to deliver skills training across our region. I’ll work with trade unions to set the standard for a great job.\n· Break Down Barriers- I’ll remove financial barriers to work and training by trialling a Mayor’s Childcare Grant and ‘travel to work’ credit for those that need it most.\n· Buses back in public hands - I’ll urgently bring buses back into public control so buses go where we need them, not just where is profitable. Travel will be free for young people and there will be subsidies for those getting back in to work.\n· A Safer, Bigger Metro - I’ll expand the Metro system and I’ll prioritise safety. You’ll see more gates in our Metro stations, as well as the staff that passengers want to see working at them. We’ll have one integrated transport system with standardised fares that everyone can use.\n· Building transport infrastructure – I’ll back the key projects we need to thrive, including the new Weardale passenger railway in Durham, the reopening of the Leamside Line, the Newcastle to Blyth railway and the Washington Metro expansion. I’ll back the Bowburn Bypass in Durham and role out electric vehicle charging points and improved cycle infrastructure to ensure all our communities have access to travel.\n· A New Era for our Rivers and Ports – Working with our councils, I’ll create thousands of well-paid green jobs, green housing, biodiversity projects and a new tourist economy on our rivers and coastline. I’ll do this by joining up our ports and rivers through a new Mayoral Development Company to boost our reputation as world leaders in offshore wind and green hydrogen energy.\n· A Great Home - We’ll build thousands of homes on brownfield land to the greenest standards in the country. I’ll use our skills budget to ensure houses are built or retrofitted by local workers trained here in the North East. We’ll set the standards for rental properties and I’ll work with local councils to seize properties from the landlords who refuse to take responsibility, so we can hand those properties over to social landlords.\n· Reimagined Highstreets – I’ll immediately launch a high streets commission to work with communities in the villages, towns and cities of the North East. We’ll revitalise our vibrant high streets to create not just jobs and retail but the social and residential spaces we can all be proud of.\n· Beyond Net Zero- Our response to the climate crisis will be built on greener jobs, better transport and new homes but we’ll improve our environment too. I’ll create a fund for biodiversity projects that increase green spaces and trees and improve water and air quality. We’ll set higher standards for new developments.\n· Our Proud Region- With our North East pride, a shared vision and a collective voice we’ll gain national and international attention. Our vibrant cultural offer is world class. I’ll grow this offer, make it accessible for everyone and together we’ll tell the world our story to grow tourism and attract investment.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_call-this-levelling-up-damning-report-shows-south-has-twice-as-many-youth-clubs-as-our-region-1/content_10.html": "Call this levelling up? - Damning report shows South has twice as many youth clubs as our region\n- ContentEditor\n- Nov 7, 2021\n- 2 min read\nTHE Tory Party's latest levelling up failure has been exposed in a new youth report that shows young people living in areas of deprivation have less access to youth clubs than those in more affluent areas.\nA report published by the National Youth Agency this week uncovered young people in England’s 10% most deprived areas have half as much access to youth services as those in the 10% most affluent postcodes.\nThe north of England is home to 90 per cent of the most deprived neighbourhoods in the UK, yet has seen cut after cut from this Tory Government.\nIt really shouldn’t matter where you live but it clearly does. I care so much about the North East and it beggars belief that the areas that need youth services the most are being deprived of them. Social inequality is rife. It makes absolutely no sense – the exact opposite of levelling up is happening and it’s just not right.\nThere will be consequences to ignoring this too. We don’t want kids hanging around on the Metro causing antisocial behaviour or setting bins on fires – so let’s give them places to hang out, things to do.\nAccording to the End Child Poverty Coallition, the North East has the second highest rate of child poverty in the UK at 37 per cent. The region also saw the UK’s biggest increase in child poverty from 2014/15 to 2019/20.\nGovernment analysis has shown that South Tyneside and Newcastle have the highest levels of child poverty in our region.\nWe have some shameful levels of poverty in our area and a shameful lack of youth services to match. South Tyneside and Newcastle have some of the highest child poverty levels in our region. Fewer youth services means young people in deprived areas are far more likely to get caught up in crime and preyed upon by criminals who draw them into crimes like County Lines.\nFear of crime also plagues the lives of the poor more than the affluent too. We know poorer people are more than twice as likely to fear becoming a victim to burglary or being attacked – this because more criminals live in the more deprived areas.\nTackling all these issues has to start with children and young people – it begins with investing in prevention. We have to fight poverty to fight crime.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_tories-must-reverse-their-leamside-snub-and-reopen-train-stations/content_28.html": "TORIES MUST REVERSE THEIR LEAMSIDE SNUB AND REOPEN TRAIN STATIONS\n- Content Editor\n- Nov 29, 2023\n- 2 min read\nUpdated: Nov 30, 2023\nThe Transport Secretary has been urged to provide the £20m initial funding needed to eventually reopen at least six North East rail stations and the Leamside Line in County Durham.\nNorth East Mayor candidate Kim McGuinness and Gateshead Council leader Martin Gannon have written to Transport Secretary Mark Harper urging him to fund the Business Case work needed to reopen key railway routes in the North East.\nThey are campaigning for both the Metro Washington extension and the full Leamside Line to be reopened to create an extensive new network of local stations.\nThe outline business case for the Washington Metro Loop still needs £8.5m of work from an expected £9.5m total, with a similar amount at least expected to be needed to fund the initial stages of work preparing the case for the Leamside Line South.\nThe two railway projects together would link up passengers in Durham through to Wearside, Tyneside and Northumberland. Potential new stations could include Ferryhill, Follingsby, Washington South, North of Washington, Fencehouses and Penshaw.\nThe Transport Secretary has been told there is an urgent need to at least prepare the early engineering reports and economic plans now, rather than further delay the project.\nLabour candidate Kim McGuinness said: “We have ambitious plans to reopen railways in the North East, creating jobs and getting people out of cars and onto a joined-up public transport network.\n“We all saw the Prime Minister announce and then U-turn on plans to reopen the Leamside Line last month, this is a chance to make up for that snub.\n“The Transport Secretary should agree to fund the Outline Business Case – the early work before a detailed project can happen – now in order to ensure the region can get moving once the funds are found for these key infrastructure projects.\n“The Government did this for the reopened railway line in South East Northumberland, we need that same commitment to Durham, Wearside and Gateshead.”\nThe Northumberland line, linking Newcastle, Ashington and Blyth, is ready to reopen after Government funded both the detailed business case and early site work with a £34m grant and the later work.\nMr Gannon, chair of the North East Joint Transport Committee, said: “We continue to stress with ministers the need for investment in both the Leamside Line and the East Coast Main Line in our region – unlocking the full potential of rail across the North East and beyond.\n“The North East continues to suffer from a major bottleneck on the East Coast Main\nLine which stifles our economic growth. Transport funding in our region is miniscule\ncompared with the significant levels of investment in rail in the south, and we\ncontinue to make the case for national funding to help us deliver on our economic goals.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_keeping-people-safe-on-public-transport-1/content_11.html": "My Manifesto\nWhy I'm Standing\nAbout\nNominations\nNews\nGet Involved\nContact\nMore...\nTogether We Can Reclaim Our Ambition",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_reverse-austerity-to-back-our-young-people-1/content_32.html": "Reverse Austerity To Back Our Young People\n- Jonathan Sabarre\n- Oct 19, 2021\n- 4 min read\nA new report published by Police and Crime Commissioner Kim McGuinness calls on the Tories to urgently invest in youth services, if they are serious about levelling up.\nKim’s research shows for the first time how youth services in Northumberland, Tyne and Wear are at breaking point after years of Tory cuts.\nOne youth worker said they know of young people who have never even heard of a youth club saying “they just don’t know what one is”.\nThis statement, along with other findings, reveal the true toll budget cuts and the Coronavirus pandemic have had on youth services.\nKim said: “Across Northumberland, Tyne and Wear the Tories have staged a full on assault on neighbourhoods, and hardest hit have been young people from poverty-hit households.\n“Our North East urgently needs investment in young people. We cannot continue in a situation where those from a prosperous background succeed and those from a poor household are left to struggle.\n“Cuts to youth services lead not just to a bigger risk of young people turning to crime, but a much wide risk of missed life chances. Our neighbourhoods deserve better, especially, the most deprived.”\nIn fact, 71% of the youth organisations surveyed have seen their funding cut or reduced since 2011. Overall there has been a 75% decrease in local authority spending on youth services in Northumbria since 2011. This means funding has been slashed by £31.5 million pounds, with Northumberland being the hardest hit. One organisation cited suffering a “100 per cent cut to funding in 2014”.\nThe report, which pulls together the views of almost 100 North East youth work organisations, has prompted the Commissioner to call on the government for an urgent rescue strategy, to save the youth sector and young people from losing their way.\nIt features a series of key recommendations on how Government, local authorities and PCCs can come together to support future generations. These include:\nThe Government should appoint a minister who has a portfolio focussed on youth services.\nYouth services should be backed with urgent Government investment in the next Comprehensive Spending Review.\nThe Government should devolve the funding and powers needed to create localised youth strategies in collaboration with young people themselves.\nPeople working with young people have shared their thoughts on topics such as funding cuts, staffing levels and concerns for future generations.\nFindings include:\n82% of respondents believe safe locations for young people to gather and meet would help prevent those involved from falling into a life of crime.\n77% stated that there needs to be an increase in youth services in their local area.\n63% said that more employment and skill development opportunities were required to prevent youth criminality.\nNorthumbria Police and Crime Commissioner, Kim McGuinness, said: “These findings spell out very clearly how young people struggle to find support throughout the North. We have charities giving their all, putting everything into making young people’s lives better but some are having to fundraise for every penny that comes in. They need real help.”\nOne organisation said: “Youth services are at breaking point. There is not enough money to support the essential services never mind the more specialised help some young people need.” While another worryingly revealed “Finances are tight and we will soon be at a point where we need to start an exit strategy, if no additional funding is found by October 21”.\nAs organisations emerge from the pandemic restrictions, there is concern about the increased vulnerabilities and needs of young people too, and the impact on youth services. 68% of respondents stated that it is very likely that referrals and service demand will increase to support the additional vulnerability amongst young people. Feedback from one organisation was that although they “tried to deliver remotely that didn’t attract those most in need”. Another reported that “200-300 young people did not return to projects that they previously attended” and they are now conducting an exercise to find out where they are.\nKim continued: “The aftermath of the pandemic is a crucial time for us to be getting things right – we can’t afford to let young people down so we all need to come together on this.\n“Resources have never been so scarce. It’s time for some serious levelling up for young people in the North not only in our towns and cities but in our rural areas. It starts with funding youth services, funding youth workers and making young people and their futures at the top of the agenda. If we invest in young people, we are investing in the future and the whole criminal justice system can reap the benefits of this. Research has shown a growing link between cuts to youth services and the country’s knife crime epidemic and we’ll need to work together to turn this around. If we improve lives we prevent crime.”\nClare Williams, Regional Secretary at Unison said “The work undertaken by PCC Kim McGuinness shows the reality behind the rhetoric of the Government which talks about levelling up when actually our young people across communities in our region have no access to youth services. This is because the Government has for the last 10 years cut local funding year on year. Unison has been calling on the Government to listen to the evidence and to provide adequate funding.”\nA separate report by the Audit Commission into the benefits of sport and leisure activities in preventing anti-social behaviour by young people estimates that a young person in the criminal justice system costs the taxpayer over £200,000 by the age of 16. But one who is given support to stay out costs less than £50,000.\nTo read the findings in full and the recommendations set out by the PCC please visit:",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_storm-arwen-a-story-of-tory-failure-1/content_47.html": "Storm Arwen - a tale of Tory failure\n- ContentEditor\n- Dec 13, 2021\n- 1 min read\nKeir Starmer joined myself and others to see first hand how families in Northumberland suffered the effects of a deadly storm - all while the Tory Government sat idle.\nLabour leader Sir Keir Starmer came to meet those who were left without power for more than a week after Storm Arwen hit.\nThousands across our region were left with no heating or power to cook food after Northern Power Grid struggled to restore services.\nI joined Keir at Hadston in Northumberland alongside Labour councillor Scott Dickinson to hear from residents about the lack of Government action in our region, and the lack of leadership from the Prime Minister\nKeir said: \"People feel very strongly that had this happened in the South East, that this would never have been the case.\n“They’re asking why it took the Prime Minister seven days to declare a major incident.\n“I don’t think the infrastructure has been strong enough and I think the response has been slow across the board.\n“There needs to be a back-up plan, if there is an emergency there needs to be a plan if there is a storm.”\nHe's right to be angry about this. The feeling throughout our region was that if this disaster had hit London or the South East we would be seeing the PM visiting families and bringing in the military on day one. Instead, nearly 300 miles away and out of sight, we were left having to make do and wait.\nIt's not good enough.\nBut there's also a lot of vital volunteer work going on in Hadston to support the local community. If you want to contribute, you can do so here.\nhttps://gofund.me/6c807e75",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_police-commissioner-warns-crime-bill-misses-huge-opportunity-to-protect-women-from-violence-1/content_29.html": "Police commissioner warns crime bill 'misses huge opportunity' to protect women from violence\n- Mar 30, 2021\n- 3 min read\nCritics have slammed the new Police, Crime, Sentencing and Courts Bill this week over a lack of action to protect women and a crackdown on protests\nPolice and Crime Commissioner Kim McGuinness (Image: newcastle chronicle)\nThe government’s controversial police bill does nothing to tackle the “day to day reality of attacks on women”, according to the Northumbria Police and Crime Commissioner (PCC).\nCritics have slammed the new Police, Crime, Sentencing and Courts Bill this week over a lack of action to protect women and a crackdown on protests.\nDespite welcoming large parts of the bill, Kim McGuinness says it “misses a huge opportunity” to address violent crimes against women and that the curbs on protesting are “worrying”.\nThe Labour PCC, who is up for re-election in May, said: \"There's a lot to support in this Crime Bill, including tougher sentences for those who target children, and also in offering more protection for our police and emergency workers, something I have called for during my time as Police Commissioner.\n\"It also stops the automatic early release of dangerous prisoners, which is a step in the right direction.\n\"But it misses a huge opportunity to address the day to day reality of attacks on women, doing nothing to make it easier for women to get justice if they have been raped, for example. \"Alongside that is a worrying crackdown on the ability to protest. We have a proud tradition of free speech, and I'm worried that peaceful protest will be shut down as a result of this bill .\"\nThe bill cleared its first hurdle in the House of Commons this week, passing a second reading after a Labour move to block it from being considered further was defeated.\nThe government's plans have attracted fierce criticism from Labour for trying to give police more power to put more restrictions on protests judged to be too noisy and thereby causing “intimidation or harassment” or “serious unease, alarm or distress” to the public.\nCritics have also attacked a proposal to make defacing statues punishable by up to 10 years in prison, theoretically a tougher punishment than for rape – for which sentencing currently starts at five years.\nMembers of the public protest against the The Police, Crime, Sentencing and Courts Bill and criticising the actions of the police at Saturday night's vigil(Image: Getty Images)\nThe row over the bill intensified after controversy over the Metropolitan Police’s handling of a vigil held last weekend at Clapham Common for Sarah Everard.\nThe bill also includes tougher sentences for child killers and those who cause death on the roads, longer jail terms for serious violent and sexual offenders, and changes to child sex abuse laws to tackle abusers in positions of trust such as sports coaches and religious figures.\nHome Secretary Priti Patel said that the curbs on protests were needed after a “significant change in protest tactics, with protesters exploiting gaps in the law which have led to disproportionate amounts of disruption”.\nIntroducing the bill this week, she said: “This bill will give police the powers to take a more proactive approach in tackling dangerous and disruptive protest. The threshold at which the police can impose conditions on the use of noise at a protest is rightfully high.\n“The majority of protesters will be able to continue to act, make noise as they do so now, without police intervention. But we are changing it to allow the police to put conditions on noisy protest that cause significant disruption to those in the vicinity. As with all our proposals, the police response will still need to be proportionate.”\nAt Prime Minister's Questions on Wednesday, Boris Johnson said the government was doing \"everything that we can\" to make the streets safer for women and that a \"cultutal and social change\" was needed to ensure women are heard and protected.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_revealed-the-tory-s-north-south-divide-in-police-recruits/content_19.html": "Revealed: The Tory's North South divide in police recruits\n- ContentEditor\n- Dec 5, 2022\n- 2 min read\nThe Home Secretary is holding back funds to give the North the same extra police officers as the south - and Labour has the figures to prove it.\nDuring the first decade of Government austerity, Northumbria Police lost more than 1,100 officers as a result of Home Office cuts. A new Government-funded recruitment campaign was set up to replace these nationally, but Northumbria Police was only allocated the funds for a maximum of 615 additional recruits.\nWhile Northumbria Police has 12 per cent fewer officers than it did in 2010, some forces, noticeably those in the south of England, are now boasting of having higher overall numbers than they had at the start of 2010.\nIt was reported last week that there are now more Essex Police officers than at any other time in the force’s 182-year history. Elsewhere in the south, Cambridgeshire Police also celebrated having more officers than ever before.\nOverall figures reveal the North East, has been the hardest hit region, with 15% fewer officers than 2010, which compares to a national difference of 7%.\nCombined, North East and North West forces have 9.8% fewer officers than 2010, whilst the South East & South West forces have only 0.8% fewer – a staggering difference and alarming evidence of regional discrepancy.\nLast week I attended a policing conference and challenged Suella Braverman directly to explain this divide - but predictably she had no answer.\nThe Government owes the people of Northumberland, Tyne and Wear another 485 officers and ministers are refusing to hand over the funds.\nThe Home Office must implement a fair system based on need, so all police forces can finally return to their pre-austerity recruitment numbers.\nMy message to the Home Secretary was clear; give us back our cops",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_fun-without-fear-keeping-women-safe-in-northumberland-tyne-and-wear-1/content_53.html": "Fun without Fear - keeping women safe in Northumberland, Tyne and Wear.\n- ContentEditor\n- Mar 9, 2022\n- 2 min read\n“FUN without fear” is a new awareness campaign backed by myself and Rape Crisis Tyneside and Northumberland.\nI love that cities and towns across our region are known for offering the best night out; this campaign is about making sure we are the safest too.\nWomen have the right to feel safe whatever they are doing; whether they are on the dance floor or walking home from work.\nThere is a real passion amongst everyone involved – this is us coming together to say that we just won’t stand for it in Tyne and Wear and Northumberland. Being grabbed, followed, touched up – whatever – it’s all very, very wrong.\nI want this campaign to make things crystal clear – these things aren’t acceptable, they should be reported and the support is there ready and waiting for you; we believe you and want to help.\nThe vibrant eye-catching campaign, supported by all six local authorities and Northumbria Police, focuses on women’s safety in the night-time economy and ensuring they are supported.\nPosters can be found in public spaces as well as digital and social media channels. It features information on how to get support as well as messages around zero tolerance and reassurance that action is being taken.\nThe project also features vulnerability training for those working in the night time economy – delivered by Northumbria Violence Reduction Unit and the expansion of Northumbria Police’s Operation Cloak, which protects vulnerable party-goers and catch offenders.\nThe campaign complements other campaigns promoting women’s safety in other public places such as on public transport or out in the region’s parks. Together, it is hoped women will be safe and feel safe throughout the region.\nFor more information about the campaign visit HERE",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_use-hs2-funds-to-rewrite-the-north-east-devolution-deal-and-undo-durham-transport-snub/content_18.html": "USE HS2 FUNDS TO REWRITE THE NORTH EAST DEVOLUTION DEAL AND UNDO DURHAM TRANSPORT SNUB\n- Content Editor\n- Jan 9, 2024\n- 2 min read\nThe Government has been urged to use money saved by scrapping HS2 to undo a multi-million pound Durham transport snub.\nNorth East Mayor candidate Kim McGuinness and Durham Labour Group leader Carl Marshall have called on the Government to finally hand County Durham the same transport funds that Northumberland, Tyne and Wear are set to receive in the North East devolution deal.\n“The Government was happy to take money meant for high speed rail to the north and use it to fix London potholes, now they need to show they can do the same for Durham,” Kim said.\nThe current Tory devolution deal offered to the North East saw six areas handed more than £147m of extra City Region Sustainable Transport Settlement.\nBut because Lib Dem/Tory coalition Leaders in Durham joined the deal too late that money was already allocated to the six other councils and Durham was blocked from accessing vital transport funds.\nPrime Minister Rishi Sunak announced last autumn he was scrapping a High Speed Rail line which was set to free up capacity on the overcrowded East Coast Main Line. He promised a raft of smaller projects to make up for the snub – including another tranche of city region transport funds.\nNow, Kim McGuinness and Carl Marshall have said its time the Government revisited their Durham snub.\nKim said: “People in County Durham shouldn’t be denied their share of vital transport funds just because the original deal froze them out. The Government has made clear it has more transport money to invest after axing HS2, especially for London. It’s time someone spoke up for Durham’s needs.\n“There’s a budget in March and we’ll be asking the Government to correct this snub.\n“First, Durham needs its share of the original transport pot. We can’t have two-tier devolution in the North East.\n“Second, we need confirmation from the Government that its next transport fund will include Durham.”\nCouncillor Carl Marshall said: “The Government froze Durham out of a key transport fund, then it scrapped investment in the North. If the Government wants us to believe there is now more money for transport then ministers should do the honourable thing and put County Durham back on a level playing field – Give Durham its fair share of transport investment.\n“That means looking again at what was on offer and calculating our share. We’re talking a multi-million pound share of a transport pot that should be available to us but was not.\n“Durham County Council should be showing leadership and challenging Government over this.”\nKim and Carl have committed to lobbying for extra transport investment as part of Kim’s campaign to be Labour’s North East mayor.\nRishi Sunak showed the lack of trust in his Government to deliver for the North when he announced he was scrapping HS2 and unveiled a list of transport projects which would replace the scheme.\nHowever, many of the projects had either already been announced or had previously been halted, including electrification of the Transpennine line, first announced in 2017, a new bypass for Blyth announced in 2018 but still not delivered, and the latest reannouncement of the on and off again plan to dual the A1.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_affordable-reliable-safe-a-survey-for-better-public-transport-1/content_22.html": "Affordable? Reliable? Safe? A survey for better public transport\n- ContentEditor\n- Jan 22, 2022\n- 2 min read\nOn buses and Metros, across Northumberland, Tyne and Wear, passengers want a network that is afford and reliable, but they also want it to be safer.\nThat's why I'm asking people across our region to tell me the changes we could make to improve public transport.\nMy safety survey is there to make sure your voice is heard. It's just one of the steps I'm taking to act on your concerns.\nI recently launched a public transport safety app, Safer Transport Northumbria, so you can let transport bosses and the police know the places you don't feel safe. And I'm backing extra Metro patrols from the likes of the incredible Street Pastors volunteers and youth workers at Edge North East.\nI'm doing this because public transport is the lifeblood of our region. It brings us all together with friends and family and gives us access to jobs, shops and all sorts of opportunities. People want transport that’s affordable, reliable and crucially, safe. The need to feel safe, and be safe.\nWith a responsibility for policing I recognise that the safety and wellbeing of all those who use our buses and metros– we are talking thousands of passengers every single day.\nAnd so what I really want from people in this new survey is the detail – which stations and stops need some extra attention and where routes are becoming a concern. All feedback will go towards updating my Police and Crime Plan, the key document that turns your priorities into actions for Northumbria Police across the region.\nGiven the size of our region, incidents of harassment and antisocial behaviour remain relatively low, but they do happen and so we must continue to build on the work already being done to keep the networks safe. Enforcement, education, engagement – it all matters and I appreciate all the insight we can get from doing this survey.\nResidents can complete the survey here: https://vru.onlinesurveys.ac.uk/pcptransportcon",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_broad-trade-union-labour-movement-backing-for-kim/content_56.html": "Broad trade union & labour movement backing for Kim\n- kim4pcc\n- Jun 15, 2023\n- 1 min read\nUpdated: Jun 18, 2023\nKim has received broad support for her mayoral selection campaign from across the Labour and Trade Union movement in the North East. The following nominations have been made so far:\nConstituency Labour Parties (CLPs)\nBerwick\nBishop Auckland\nGateshead\nHoughton & Sunderland South\nJarrow\nNewcastle North\nNorth West Durham\nSedgefield\nSunderland Central\nTynemouth\nWashington & Sunderland West\nLabour Groups\nNorthumberland\nNorth Tyneside\nNewcastle\nSouth Tyneside\nCounty Durham\nAffiliates UNISON GMB Co-operative Party Usdaw Community",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_call-for-more-radical-devolution-deal-in-autumn-statement/content_15.html": "CALL FOR MORE RADICAL DEVOLUTION DEAL IN AUTUMN STATEMENT\n- Content Editor\n- Nov 23, 2023\n- 3 min read\nThe Chancellor has been urged to use this week’s Autumn Statement to finally hand the North East a far more radical devolution deal and end Whitehall control of northern towns and cities.\nMayoral candidate Kim McGuinness has called for a dismantling of London-based quangos, a tourism levy and the power for Northern Mayors to kick out failing train firms.\n“The North East has been left with the bare minimum when it comes to devolution. We’re just too far North for Whitehall to care. So we need radical, ambitious devolution if we are to hand power back to people in our region. That’s what I’m fighting for.” Kim said.\nShe added that the budget was a chance to “reset the story of the North East”. In a letter to the Chancellor Kim warned that at present regions such as the North East were being held back with “incremental devolution deals” while the likes of Manchester and London powered ahead.\nKim called for the Chancellor to use his Autumn Statement to position the Government on path for a devolution reset and hand swathes of powers to the new North East Mayoral Combined Authority due to be created in May 2024’s elections.\n“We need to start May 2024 at least on the same footing as Manchester and London” Kim said.\nThe Mayoral candidate said a trailblazer devolution deal was expected for the North East, but to be a success it must include:\n· A dedicated North East fund to spend as the region sees fit, without needing civil servants in different departments to sign-off each local decision.\n· Devolution of Homes England, Sport England and Arts Council funds to the regions and an end to the days of unelected quangos picking winners and losers in everything from local football clubs to museums and galleries.\n· Devolution of Jobcentre powers so the North East can use local knowledge to target employment support.\n· Train stations stripped from rail franchisees and handed to mayors and councils, saving ticket stations and helping co-ordinate city-centre investments.\n· Real powers to oversee northern rail services, including the power for mayors to come together and kick out failing operators such as Transpennine Express.\n· A Tourism Levy so that businesses can work together to raise money for big-scale events.\nKim said: “I’m campaigning for a better North East, where we have real powers to make real, life-changing decisions. Right now we have to go to London to get investment decisions signed off, even under our very limited devolution to date.\n“That has to change, and we need to be more ambitious for the region and more radical in our devolution demands.”\nShe added: “The North East has so far failed to secure the ground-breaking devolution deals offered to Manchester and West Midlands, and has been at the back of the queue for real devolution.\n“In the last year of Labour’s regional development agencies the North East had more than £300m to invest in local job creation - we get a fraction of that now.\n“The current devolution deal given to the North East has an annual investment fund worth just a small fraction of that historic high.\n“We can’t continue pretending second-best is good enough.\n“Our region needs someone prepared to fight for it, to be an advocate for all that is great about the North East and to secure the real devolution that will let us control our own destiny. That’s why I’m standing to be mayor.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_a-new-era-with-a-new-mayor/content_57.html": "A new era with a new mayor\n- Content Editor\n- Apr 19, 2023\n- 3 min read\nA public consultation on creating a new mayor for the North East has now closed. As part of this I set out what we should do next in this key moment for our region.\nThe new devolution deal offers the North East the chance to look again at the purpose of devolution and refocus on supporting people rather than simply benefitting business.\nAs PCC I have delivered on a strategic plan designed to improve lives as a way of preventing crime, and the devolution deal offers the potential for the region to expand on this work.\nOur region faces different challenges to other parts of the country. We are geographically huge, with a diverse landscape; our unemployment levels and economic inactivity aren’t moving in the right direction; health inequalities are wider here than anywhere, but most importantly, our region has the highest level of child poverty in the UK.\nThis is a failure which needs to be addressed by whatever means possible. Devolution, if done right, should mean that the North East can deliver our own solutions, create our own opportunities and do things differently.\nThere are elements of the devolution deal which give the North East the tools to address these challenges.\nInvestment in the transport system allows us the opportunity to bring the benefits of devolution to all our communities, beyond just the core city and business centres, and I welcome the power to bring busses back under public control.\nSimilarly, if used correctly, the investment fund allows local residents the chance to see their priorities acted on by reviving high streets and creating the right balance of jobs in the many villages and towns of our region as well as the cities that make up the North East.\nFurther oversight of the skills agenda will allow us to put real opportunity in the hands of those seeking it and a chance to bring together education, skills and businesses so that everyone has options.\nHowever, I and others have some concerns around the scope of the deal, in terms of its reach and ambition, and there are concerns that the Government’s approach to devolving power is not radical enough to sufficiently empower the regions.\nMuch of the devolution to the North East to date has not been life changing for the people it is meant to benefit and has not led to systematic change in Whitehall’s approach to regional governance. As a region we are still desperately reliant upon competitive bidding into Government departments for funding. This is not real devolution and it is not an approach I believe in.\nAs a region, it is imperative that we that we do not allow the investment in the devolution deal to be conflated with money we’ve lost in the last 13 years through Government imposed austerity. This deal entirely fails to offset the damage done to our public services as a result.\nHaving overseen key public services on Newcastle council and as PCC overseeing one of the biggest public services in the North East, I have seen first hand the challenges our councils and NHS face trying to preserve frontline services and protect residents with reduced budgets. I know our trade unions have real concerns regarding this.\nWithout full fiscal devolution and the ability to truly invest once again in these vital, life improving services, it will be ever harder for us to reach our potential as a region. Again, this challenge is compounded by the centralised nature of public sector funding in England. Something I believe we must campaign to change.\nDespite these concerns, I do believe the devolution deal offers our region a starting point. I commend our local authority leaders and officials for securing a deal more generous than those awarded elsewhere and doing so despite the challenges of instability in central Government.\nAbolishing the existing combined authorities and starting again with a new structure is the right approach. I support the creation of a new Mayoral Combined Authority.\nThe people of the North East are known for their pride in place. Our heritage is one of innovation and ambition. This deal, while not a perfect deal, is a good step towards the devolution our residents need.",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_our-young-people-need-urgent-mental-health-support-1/content_39.html": "Our young people need urgent mental health support\n- ContentEditor\n- Oct 29, 2021\n- 2 min read\nToo many young people are facing a mental health crisis , Police and Crime Commissioner Kim McGuinness has warned as she calls on Government to urgently invest in young people and their futures\nThe mental health needs of children in the Northumberland, Tyne and Wear have been raised by PCC Kim McGuinness, as new research also shows children in deprived areas are struggling to cope.\nA national survey of more than half a million children across England revealed this week found that one in five children are unhappy with their mental health.\nThe national report comes just days after the Police Commissioner’s local services report, which pulls together the views of almost 100 North East youth work organisations, revealed that 78% of organisations are dealing with more young people displaying mental health concerns now than in 2011, following a decade of cuts to youth services.\n71% of the youth organisations surveyed have seen their funding cut or reduced since 2011. Overall there has been a 75% decrease in local authority spending on youth services in Northumbria since 2011. This means funding has been slashed by £31.5 million pounds.\nThese findings have prompted the Commissioner to call on the Government for an urgent rescue strategy, to save the youth sector and young people from losing their way and provide early mental health support for those who need it.\nNorthumbria Police and Crime Commissioner, Kim McGuinness, said: “Poverty, deprivation, poor health, mental health and a lack of youth services– it’s all interlinked with crime and becoming vulnerable to it. Anyone who says these are excuses is wrong, these are often the root causes. You leave youth services to struggle; you leave young people to struggle. They go on to struggle as adults, as families, as entire communities. It’s that simple.\n“And yet this Tory Government refuses to acknowledge its role in creating this crisis by defunding public services.\n“South Tyneside and Sunderland, and Northumberland, Tyne and Wear are amongst the worst in the country for mental health treatment waiting times. This coupled with staff shortages means youth workers are telling us they are being forced to fill the gap in trained counsellors. It’s problem after problem.\n“Youth services and mental health support need to kick in early – before kids reach the youth offending service and before they get a drug and alcohol misuse service referral. We need to prevent things getting so bad that a social worker has to step in and intervene with their lives.”\nThe Police Commissioner added: “All too often the police and their 24/7 availability are left to pick up the pieces at the end of that 999 call, coming to the aid in moments of real crisis but it’s like things are being allowed to get that bad. We have youth services bridging the gap too, some really amazing ones but it’s not – nor should it be – up to them or the police alone.”",
  "https_www_kimmcguinness_org_/https_www_kimmcguinness_org_post_a-historic-chance-to-win-power-for-our-region/content_48.html": "A historic chance to win power for our region\n- ContentEditor\n- Dec 5, 2022\n- 2 min read\nThe next Labour Government will pave the way for the greatest era of English devolution in living memory, taking power out of London and back into the hands of the regions.\nThat's why I welcomed the Future of the UK report launched by Keir Starmer and Gordon Brown as a vitally important step towards creating the real change we need.\nFor too long now, under too many Governments, the North East just hasn't had the power it needs to tackle its unique challenges.\nThe North East has the highest child poverty rates in the country. If there was a bank in London going under the Tories would set up a taskforce and hand over billions of pounds to save the City. But when children starve in homes across the North there is no solution, for a simple reason; the people who care don't have the power and the people who have the power don't care.\nAs Police Commissioner I have funded projects that fight the effects of child poverty, because if we create genuine opportunities today we solve the crime of tomorrow. But to do that I have had to bid to the Home Office for one-off funds and wait to see if an official in Whitehall thinks it's good enough for a Home Office politician who has never been to Sunderland or Northumberland or Newcastle to back.\nEvery elected representative delivering public services knows the frustration of that \"cap in hand\" approach which sees the views of an unelected official in Westminster worth more than the views of the residents in the regions.\nIt has to end, it will end. The next Labour Government will transform the power system which holdback local public services. And we’ll do this by putting people at the centre of decision making."
}