{
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_04_29_reasons-to-vote-lib-dem-on-thursday-may-2/content_49.html": "There are many positive reasons to vote Liberal Democrat this Thursday, besides getting rid of the dreadfully expensive and ineffective Conservative councillors runing Kent.\nThe Lib Dems are calling for an end to secrecy at County Hall, and would insist on more open and online meetings, during which the public could email in questions, to make them more participative and democratic. This includes local board meetings held in each borough, many of which are currently held in private. We would also reduce the number of signatures required on petitions to trigger a debate.\nMaintaining and repairing Kent’s roads is also a KEY priority, including restoring the budget cut of £1.6 million to road repairs, by cutting down on wasteful consultants, and extending the network which is gritted in icy weather conditions.\nIntroducing 20 miles per hour speed limits outside schools and hospitals, and in residential and shopping areas where residents support them.\nRaising primary school standards – Kent has some of the worst performing and most unequal schools in the country, according to an OFSTED report.\nAnd in Tunbridge Wells, we would work to get the A21 widening back on track, sort out the parking and traffic problems in the town centre by involving the public more widely in exploring alternative solutions to gridlock, and improve the pavements and street lighting.\nPlease vote for your local LIB DEM candidate ALAN BULLION on Thursday May 2 for Positive Change in Tunbridge Wells for Kent County Council",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_08_28_kent-tories-waste-more-of-your-hard-earned-money-at-county-hall/content_23.html": "Tory County Councillors have spent £5,000 of taxpayers’ money – on financial advisers to help them avoid paying tax on their travel expenses.\n“This is a disgrace,” said Alan Bullion, Liberal Democrat prospective Euro candidate and life-long Kent resident. “As leader of the council who lobbied and lobbied for the money, Paul Carter should resign. How can he possibly justify wasting public money in a legal battle to increase his expenses when he is closing children centres in our borough because of lack of funds?\n“The tax authorities had already undertaken a lengthy investigation and ruled that there was absolutely no justification in letting off county councillors from paying tax on their expenses – yet still Mr Carter pushed and pushed for the money.”\nThis shocking revelation follows the recent storm when it was revealed Mr Carter had tried to increase the mileage allowance of county councillors from 45p a mile to 67p a mile – a move exposed by Trudy Dean, leader of the Lib Dem group at County Hall. The spending hike had been backed by a motley alliance of Tory, Labour and UKIP, with the UKIP leader declaring himself behind the Tory measure “all the way”.\nThanks to Lib Dem pressure and a public outcry, Mr Carter backed down. But after this latest revelation that he used public money to feather the nest of councillors, can he survive?",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_category_uncategorized/content_26.html": "The derelict site of the former ABC Cinema in Tunbridge Wells town centre has reached its 13th year. Despite endless promises and excuses from the Conservatives running the council no real progress has been made on redeveloping the site for local people.\nLocal Liberal Democrats are pressing for decisive action to be taken by the council. They are leading the campaign to press the council into purchasing the site and developing it for the community.\n“It is just shocking and inexcusable that the Conservatives have left this prime town centre site derelict for 13 years! There are children in our town who have grown up never knowing it as anything other than a disused grotspot.” said local Lib Dem councillor, Ben Chapelard.\n“The Liberal Democrats are launching a campaign to force the Conservatives to take action. We want them to use existing powers such as a Compulsory Purchase Order to get some progress on getting the site redeveloped.\n“All we ever hear are excuses or attempts to shift the blame onto someone else. When they’re not displaying a “can’t do attitude” they’re blaming others for not using their legal powers to resolve the situation. Enough is enough! The Conservatives have let this drag on for 13 long years and it’s time to put an end to it.\n“We are asking local people to sign our petition at www.twlibdems.org.uk to put pressure on the council to act. Together we can put an end to 13 years of Conservative failure.”\nLeader of the Opposition Lib Dem Cllr David Neve added: “The whole thing is a ‘horror show’. Visitors to Tunbridge Wells are greeted, on arrival by devastation and dilapidation. What a sorry picture this presents. Tunbridge Wells deserves better from the Conservatives. Please sign our residents’ petition.”",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_category_planning/content_18.html": "Become a Member\nJoin the Liberal Democrats today from as little as £1 a month and help us fight for an open, tolerant and united Britain.\nAlan Bullion has lived in the Sherwood ward where he is standing for the past 30 years.\nHe works in London for Informa and commutes from High Brooms station, where he successfully campaigned for a second ticket machine. He is a former school governor and pupil of Tunbridge Wells Grammar School for Boys, and is still chair of its Alumni society.\nAlan has long been active over local issues in the Oak Road area of Sherwood, such as defending the recreation and sports facilities against development.\nAlan also is a great believer in life-long learning, having done degrees with the Open University and Southampton as a mature student. He is supporting the campaign to keep Open University courses affordable for all who want to continue to study.\nAlan is also an active member of the Campaign for Protection of Rural England, the Campaign for Real Ale, European Movement, and United Nations Association UK.\nPlease contact him at alan.bullion@informa.com or 07766968820 if you can help in any way with Liberal Democrat campaigns.\nJoin the Liberal Democrats today from as little as £1 a month and help us fight for an open, tolerant and united Britain.\nSherwood resident and commuter Alan Bullion has seen several incidents where train travellers have had problems with the treacherous steep staircases at High Brooms station.\n“One day I saw an elderly man lying at the bottom of the steps who had fallen as the handrail on the stairs had come away. We helped him to get an ambulance as there was no station staff on duty due to being a Sunday.”\nSimilar difficulties have been experienced by passengers with disabilities, school children, and parents with buggies and pushchairs.\n“This problem could easily be solved by building a ramp behind the down platform onto the footpath coming out by the second ticket machine, which I successfully campaigned for over many years. There is railway land available and a track where this could be constructed. For many years passengers have suffered from a lack of facilities at this busy station, with no loos, no proper waiting rooms, and stairs that are clearly dangerous for many passengers.”\nAlan is calling for urgent action from Southeastern with other commuters before another accident occurs.\nThis would also benefit commuters from St James, St Johns, and Southborough.\nAlan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_wp-login_php/content_48.html": "For security and auditing purposes, a record of all of your logged-in actions and changes within the WordPress dashboard will be recorded in an audit log. The audit log also includes the IP address where you accessed this site from.\nLost your password?\n← Go to Alan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_04_18_42/content_52.html": "Welcome to my website.\nI am standing as the Liberal Democrat County Council Candidate for Tunbridge Wells West Division on Thursday May 2.\nThis area covers Culverden, Rusthall, Langton Green, Groombridge (Kent), Speldhurst, Ashurst (Kent), and Bidborough.\nPolls will be open from 7am to 10pm.\nMore news will be published shortly.\nPlease contact me should you have any questions.\nI look forward to hearing from you.\nBest Wishes,\nAlan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2018_04_06_sherwood-commuter-alan-bullion-supports-increased-safety-measures-at-high-brooms-station/content_44.html": "Sherwood resident and commuter Alan Bullion has seen several incidents where train travellers have had problems with the treacherous steep staircases at High Brooms station.\n“One day I saw an elderly man lying at the bottom of the steps who had fallen as the handrail on the stairs had come away. We helped him to get an ambulance as there was no station staff on duty due to being a Sunday.”\nSimilar difficulties have been experienced by passengers with disabilities, school children, and parents with buggies and pushchairs.\n“This problem could easily be solved by building a ramp behind the down platform onto the footpath coming out by the second ticket machine, which I successfully campaigned for over many years. There is railway land available and a track where this could be constructed. For many years passengers have suffered from a lack of facilities at this busy station, with no loos, no proper waiting rooms, and stairs that are clearly dangerous for many passengers.”\nAlan is calling for urgent action from Southeastern with other commuters before another accident occurs.\nThis would also benefit commuters from St James, St Johns, and Southborough.\nAlan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk/content_20.html": "From: Bullion, Alan\nSent: 03 May 2018 13:01\nTo: newsdesk@timesoftunbridgewells.co.uk\nSubject: Traffic lights at the junctions of Blackhurst Lane and Halls Hole Road\nDear Sir,\nDuring the local election campaign on Sherwood, I was contacted by several concerned residents of Sandown Park and surrounding areas about the traffic lights sited at the junctions of Blackhurst Lane and Halls Hole Road.\nWhile the lights are far better than the former uncontrolled junction there is a problem with the phasing. These lights can be controlled remotely from Maidstone, so a simple change to the phasing, delaying the Halls Hole Road green light by 10-15 seconds, could be introduced quickly and easily, and we would soon see if it was effective. Also, a camera at the junction, well-advertised, would both act as a deterrent and generate revenue. When the lights were first installed, signs were placed both sides of the junction saying ‘Give way to oncoming traffic’, but they were removed after only a few weeks.\nSome local residents have also suggested a roundabout as an alternative, or one-way traffic along Halls Hole Road and Cornford Lane into Pembury. I’m aware that this issue has come up frequently over recent years as the traffic jams increase between Pembury and the Town Centre, particularly at peak hours. A newly proposed ‘retirement village’ would have further compounded the problem. A safer solution does need to be urgently found, for as one local resident said – it’s an accident waiting to happen.\nYours,\nDr Alan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_07_08_more-delays-on-tunbridge-wells-cinema-grotspot/content_16.html": "Will the old cinema site eventually get a new tenant? What are the ruling Conservatives on Tunbridge Wells Borough Council doing about the delapidated eyesore?\nFor twelve long years the residents of Tunbridge Wells have been calling for action. The answer has been one long deafening silence and a story of endless inertia.\nTunbridge Wells Lib Dems have campaigned long and hard for action, organised petitions and most importantly, asked the general public want they want to happen.\nWe will be campaigning again on the streets on Wednesday, July 17, when local South East Lib Dem MEP Catherine Bearder will also be visiting the town centre from 3 to 4pm.\nMore details here soon…\nhttps://www.facebook.com/photo.php?fbid=513318028741137&set=gm.197022033791497&type=1&theater",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_category_local-council/content_2.html": "From: Bullion, Alan\nSent: 03 May 2018 13:01\nTo: newsdesk@timesoftunbridgewells.co.uk\nSubject: Traffic lights at the junctions of Blackhurst Lane and Halls Hole Road\nDear Sir,\nDuring the local election campaign on Sherwood, I was contacted by several concerned residents of Sandown Park and surrounding areas about the traffic lights sited at the junctions of Blackhurst Lane and Halls Hole Road.\nWhile the lights are far better than the former uncontrolled junction there is a problem with the phasing. These lights can be controlled remotely from Maidstone, so a simple change to the phasing, delaying the Halls Hole Road green light by 10-15 seconds, could be introduced quickly and easily, and we would soon see if it was effective. Also, a camera at the junction, well-advertised, would both act as a deterrent and generate revenue. When the lights were first installed, signs were placed both sides of the junction saying ‘Give way to oncoming traffic’, but they were removed after only a few weeks.\nSome local residents have also suggested a roundabout as an alternative, or one-way traffic along Halls Hole Road and Cornford Lane into Pembury. I’m aware that this issue has come up frequently over recent years as the traffic jams increase between Pembury and the Town Centre, particularly at peak hours. A newly proposed ‘retirement village’ would have further compounded the problem. A safer solution does need to be urgently found, for as one local resident said – it’s an accident waiting to happen.\nYours,\nDr Alan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_05_07_many-thanks-for-voting-lib-dem-on-thursday-may-2/content_43.html": "Many Thanks to all those who voted for our Liberal Democrat candidates in Tunbridge Wells seats on Thursday May 2, as well as those who helped in different ways both during the campaign and on the day. Although UKIP gained one seat from the Conservatives, and we failed to win elsewhere, please rest assured that we will be campaigning for victory again in May 2014 and take nothing for granted from the local electorate.\nBest Wishes,\nAlan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_04_22_proposed-expansion-of-langton-green-primary-school-please-let-me-and-kcc-know-your-thoughts/content_39.html": "Public Notice\nKENT COUNTY COUNCIL AS\nLOCAL AUTHORITY\nExpansion of Langton Green Primary School (Community)\nNotice is given in accordance with section 19(1) of the Education and Inspections Act 2006 that Kent County Council intends to make a prescribed alteration to Langton Green Primary School (Community), Lampington Row, Langton Green, Tunbridge Wells, Kent, TN3 0JG from 01 September 2013.\nIt is proposed to enlarge Langton Green Primary School by 30 Reception Year places taking their PAN to 60 (2FE) for the September 2013 intake.\nThe current capacity of the school is 210 and the proposed capacity will be 420. The most recent census recorded that there were 221 statutory age pupils registered at the school. The current admission number for the school is 30 and the proposed admission number will be 60.\nSuccessive Reception year intakes will offer 60 places each year and the school will eventually have a total capacity of 420 pupils.\nThis Notice is an extract from the complete proposal. Copies of the complete proposal can be obtained from: Education Cabinet Committee, Kent County Council, Sessions House, County Hall, Maidstone, Kent ME14 1XQ, or from the KCC website.\nWithin four weeks from the date of publication of these proposals, any person may object to or make comments on the proposal by sending them to Simon Webb, Area Education Officer, Green Zone, Commercial Buildings, Gibson Drive, Kings Hill, West Malling, Kent, ME19 4QG.\nPatrick Leeson\nCorporate Director,\nEducation Learning & Skills,\nKent County Council.\nPublication Date: 14th April 2013",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_page_2/content_15.html": "The Liberal Democrat Priorities for Kent 2013\nAs the official opposition to the Conservatives over the past 4 years on Kent County Council, the Liberal Democrats have tirelessly worked to hold the council to account and speak up on behalf of local residents. Time and again we have exposed examples of waste, maladministration and badly implemented ideas.\nThe Conservatives try to claim they are an able and sensible administraion: but so many Kent residents know that is not the case. Time and again, we open our newspapers to stories of Kent County Council waste, from huge pay-offs to senior officers, to fortunes being wasted on Kent TV, and that millions of Kent Tax payers money is STILL in Iceland over 5 years after it was first put at risk through poor investment decisions.\nDuring the last 4 years, it is the Liberal Democrats that have spoken up against the Conservative administration. Labour have just three Councillors on Kent County Council: they have nort been able to offer an effective opposition. UKIP didn’t get one Councillor elected to Kent County Council in 2009.\nKent County Council seems to be shrouded in secrecy. The Liberal Democrats would work to open up our Council, make sure we open our books to local people and get residents actively involved in making decisions that affect them.\nRecord of Action\n- Over the last four years, the Liberal Democrats have challenged the Conservative leadership on huge payoffs to key officers and ex-Chief Executives.\n- The Liberal Democrats pushed successfully to get illegal payments made to Chief Executive’s for elections refunded.\n- The Liberal Democrats have fought for secret reports into KCC businesses to be made public and the businesses operations made more transparent to local residents and businesses.\n- The Liberal Democrats have fought to get more time at Council meetings to be spent discussing residents concerns through petitions by fighting for lower thresholds for petitions to be heard for debate.\nPromise of More\n- The Liberal Democrats would open up Kent County Council far more to local people.\n- The Liberal Democrats would introduce a public right to speak or ask a question at all Council and Cabinet meetings.\n- The Liberal Democrats would slash the number of signatories needed to get a petition debated at full Council, as we have argued repeatedly for years.\n- The Liberal Democrats would ensure all Committee meetings are webcast (including the currently unbroadcast Personnel Commmittee and all Local Boards) and allow input from the public into meetings via Twitter and Facebook.\n- The Liberal Democrats would take Freedom of Information seriously, and reduce the time to respond to all queries to half the current 20 days.\nMaking Local Decisions Locally\nAlthough the Conservative Administration say they want local people to be involved in local decisions, its often more lip service than action. Locality boards are meant to offer local decision making as a mix of County and district Councillors for an ear meet and discuss local issues, but in some places they don’t exist, in others they meet in private, they have no decision making powers and no money to spend.\nRecord of Action\n- The Liberal Democrats have pushed for local accountability with properly constituted Locality Boards across Kent meeting in public and agendas and minutes published.\n- The Liberal Democrats have championed participatory budgeting in their divisions, with Trudy Dean, Tim Prater and George Koowaree already giving local people their say in how local grant money is spent in their areas.\n- The Liberal Democrats have pushed for Joint Transportation Boards (specific transport “locality boards”) to have real decision making powers, for example to veto specific streetlight turn-offs.\nPromise of More\n- The Liberal Democrats would ensure that every area had a properly constituted Locality Board by taking our relationships with districts seriously. Properly constituted locality boards that met in public would have defined decision making and veto powers for decisions in their locality and a budget to tackle the issues they want to prioritise.\n- The Liberal Democrats would encourage more Councillors to promote and use participatory budgeting in their areas, giving local people a say in which organisations in their areas should receive grants.\n- The Liberal Democrats would increase the amount of money each Councillor can spend in their area on Highways projects to ensure localised problems can be tackled. We would look at ways that some of this funding could be opened up to Participatory Budgetting: giving local people a say on the Highway priorities in their area too.\n- The Liberal Democrats would give Joint Transportation Boards the right of veto and decision on projects in their area. We would also give Joint Transportation Boards a budget so they could kick-start transportation projects or repairs in their area.\n- The Liberal Democrats would make openness, tranparency and getting local residents input into decisions the over-arching priority of the council. We would make Council transparency a Cabinet member responsibility and form a Transparency Working Group (comprising councillors of all groups on the Council, local business leaders, community group leaders, residents, journalists and Youth Council members) would take ideas online, in public, and challenge the council to get them in place quickly and monitor the impact. Getting real-time feedback from the right people and acting on it effectively will save the Council money in the long-term and improve both services and the perception of them.\nKent’s Children have been let down over the past four years by the Conservatives.\nIn 2010 an Ofsted report found that Kent was failing its looked after children: children who are the most vulnerable in our society and need our help and support being let down by our County Council. It’s taken over 2 years and the investment of millions of pounds of emergency spending to turn the service around so that it is now deemed to be adequate. Our children should never be failed in this way again.\nKent’s schools have one of the worst records in the country of helping our children become the best they can be.\nKent’s Conservative adminstration have punished the brightest and best of our children by removing free to-school transport to our Grammar schools. To reward children who work hard to pass the Kent test by making them pay their own fare to school is a perverse and damaging decision.\nRecord of Action\nPromise of More\n- The Liberal Democrats would reinstate free to-school transport to our Grammar schools. The Liberal Democrats want to help and encourage our school children, not punish them for academic success. Our budget proposals for this year showed how this could be afforded.\n- The Liberal Democrats would re-instate £200,000 this year to fund sports projects across the County to help embed the Olympic legacy, and would commit to funding through to at least the Olympics in Rio 2016.\n- Making use of experienced and effective voluntary organisations to support families so they do not go into crisis\n- Work to build robust local teams, with strong local managers, to deliver\nA Fair Deal for Staff and Residents\nThe first act of the newly elected Council in 2009 was to vote through a payrise of £1,000 for every Councillor. The Conservatives pushed the rise though immediately after the last election, despite opposition from the Liberal Democrats who wanred to increase was unsustainable and unsupportable.\nTwo years later, the Conservatives finally backed down and slightly cut Councillor allowances (but not back to 2009 levels). The Liberal Democrats’ however took a cut – which we supported – of over 10% to the responsibility allowances the group receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\nDespire such a big payrise for Councillors, the council has frozen staff pay twice in the last 4 years, and given a 1% increase to staff in the last two years, whilst at the same time shedding thousands of Council posts.\nRecord of Action\n- The Liberal Democrats opposed the rise in Councillors allowances in 2009. Lib Dem Tim Prater invested his 2009-10 Allowance rise on a project in his local community funding a postage licence and equipment to allow a Sandgate shop to introduce postal services after the closure of the village’s Post Office.\n- The Liberal Democrats took a cut of over 10% to the responsibility allowances they receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\n- The Liberal Democrats have backed moves to see the lowest paid Kent staff receive a larger payrise, and have worked to ensure all Kent County Council staff are paid at least a living wage.\nPromise of More\n- The Liberal Democrats would ensure all Kent members of staff are paid at least the living wage, by abolishing KS2. We would ask all Kent schools to do the same thing.\n- The Liberal Democrats want to restore public trust in Councillors – and a part of that is to be fair about the allowances we receive. We would commit that Councillor Allowances should never rise faster than the pay of our lowest paid staff. If staff get a zero rise in pay in a year, so should Councillors.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_07_08_more-delays-on-tunbridge-wells-cinema-grotspot/content_42.html": "Will the old cinema site eventually get a new tenant? What are the ruling Conservatives on Tunbridge Wells Borough Council doing about the delapidated eyesore?\nFor twelve long years the residents of Tunbridge Wells have been calling for action. The answer has been one long deafening silence and a story of endless inertia.\nTunbridge Wells Lib Dems have campaigned long and hard for action, organised petitions and most importantly, asked the general public want they want to happen.\nWe will be campaigning again on the streets on Wednesday, July 17, when local South East Lib Dem MEP Catherine Bearder will also be visiting the town centre from 3 to 4pm.\nMore details here soon…\nhttps://www.facebook.com/photo.php?fbid=513318028741137&set=gm.197022033791497&type=1&theater",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_04_29_reasons-to-vote-lib-dem-on-thursday-may-2/content_31.html": "There are many positive reasons to vote Liberal Democrat this Thursday, besides getting rid of the dreadfully expensive and ineffective Conservative councillors runing Kent.\nThe Lib Dems are calling for an end to secrecy at County Hall, and would insist on more open and online meetings, during which the public could email in questions, to make them more participative and democratic. This includes local board meetings held in each borough, many of which are currently held in private. We would also reduce the number of signatures required on petitions to trigger a debate.\nMaintaining and repairing Kent’s roads is also a KEY priority, including restoring the budget cut of £1.6 million to road repairs, by cutting down on wasteful consultants, and extending the network which is gritted in icy weather conditions.\nIntroducing 20 miles per hour speed limits outside schools and hospitals, and in residential and shopping areas where residents support them.\nRaising primary school standards – Kent has some of the worst performing and most unequal schools in the country, according to an OFSTED report.\nAnd in Tunbridge Wells, we would work to get the A21 widening back on track, sort out the parking and traffic problems in the town centre by involving the public more widely in exploring alternative solutions to gridlock, and improve the pavements and street lighting.\nPlease vote for your local LIB DEM candidate ALAN BULLION on Thursday May 2 for Positive Change in Tunbridge Wells for Kent County Council",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_category_crime/content_6.html": "Alan Bullion has lived in the Sherwood ward where he is standing for the past 30 years.\nHe works in London for Informa and commutes from High Brooms station, where he successfully campaigned for a second ticket machine. He is a former school governor and pupil of Tunbridge Wells Grammar School for Boys, and is still chair of its Alumni society.\nAlan has long been active over local issues in the Oak Road area of Sherwood, such as defending the recreation and sports facilities against development.\nAlan also is a great believer in life-long learning, having done degrees with the Open University and Southampton as a mature student. He is supporting the campaign to keep Open University courses affordable for all who want to continue to study.\nAlan is also an active member of the Campaign for Protection of Rural England, the Campaign for Real Ale, European Movement, and United Nations Association UK.\nPlease contact him at alan.bullion@informa.com or 07766968820 if you can help in any way with Liberal Democrat campaigns.\nBecome a Member\nJoin the Liberal Democrats today from as little as £1 a month and help us fight for an open, tolerant and united Britain.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_05_08_talk-on-ukip-at-european-movement-agm/content_50.html": "UKIP – and the threat to Britain in Europe\na discussion led by\nCllr Roger Walshe\nand\nWest Kent EM Annual General Meeting\n7.30 pm on Wednesday, 5th June 2013\nin the\nJudd Room, Angel Centre, Angel Lane, Tonbridge, Kent TN9 1SF\nThe West Kent Branch of the European Movement will be holding an open meeting followed by its Annual General Meeting in the Judd Room, Angel Centre, Angel Lane, Tonbridge, Kent on Wednesday, 5th June 2013, at 7.30pm.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_04_22_proposed-expansion-of-langton-green-primary-school-please-let-me-and-kcc-know-your-thoughts/content_53.html": "Public Notice\nKENT COUNTY COUNCIL AS\nLOCAL AUTHORITY\nExpansion of Langton Green Primary School (Community)\nNotice is given in accordance with section 19(1) of the Education and Inspections Act 2006 that Kent County Council intends to make a prescribed alteration to Langton Green Primary School (Community), Lampington Row, Langton Green, Tunbridge Wells, Kent, TN3 0JG from 01 September 2013.\nIt is proposed to enlarge Langton Green Primary School by 30 Reception Year places taking their PAN to 60 (2FE) for the September 2013 intake.\nThe current capacity of the school is 210 and the proposed capacity will be 420. The most recent census recorded that there were 221 statutory age pupils registered at the school. The current admission number for the school is 30 and the proposed admission number will be 60.\nSuccessive Reception year intakes will offer 60 places each year and the school will eventually have a total capacity of 420 pupils.\nThis Notice is an extract from the complete proposal. Copies of the complete proposal can be obtained from: Education Cabinet Committee, Kent County Council, Sessions House, County Hall, Maidstone, Kent ME14 1XQ, or from the KCC website.\nWithin four weeks from the date of publication of these proposals, any person may object to or make comments on the proposal by sending them to Simon Webb, Area Education Officer, Green Zone, Commercial Buildings, Gibson Drive, Kings Hill, West Malling, Kent, ME19 4QG.\nPatrick Leeson\nCorporate Director,\nEducation Learning & Skills,\nKent County Council.\nPublication Date: 14th April 2013",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_04_25_lib-dems-win-council-pledge-to-hold-special-meeting-following-tunbridge-wells-parking-campaign/content_34.html": "At a full council meeting on April 24, Liberal Democrat group leader and county council candidate David Neve secured the promise of a long overdue meeting to discuss the difficulties and expense of parking in Tunbridge Wells, which at present puts many people off visiting and shopping in the town centre.\n“For once all the Tories, Labour, UKIP and Independent councillors (except the mayor who abstained) agreed with me and my amendment on parking, which was to hold a special meeting of planning and transportation,” said long-serving St James councillor and KCC candidate for Tunbridge Wells East David Neve.\nThis success follows a 2,000 strong petition and a campaign led by Courier contributor Sarah Bond on the many problems and pitfalls of the current payment system.\nAs Sarah rightly says in the Tunbridge Wells edition of the Courier, the ‘Pay and Display’ ticket machines fill motorists with stress, demand correct coins and don’t even give us change. And ‘Pay By Phone’ has big flaws, too.\nIn these tough times we should not have slap-happy wardens ticketing shoppers and tourists. Women have to run with wet hair from the hairdresser’s, mums have to pull children out of important eye checks, businessmen have to rush out of important meetings, musicians have to run off stage mid-set, and retailers watch in horror as customers rush off mid-sale. It’s utter madness, as many local retailers have told the Lib Dems, the Courier newspaper, and BBC Radio Kent.\nAs Alan Bullion, Lib Dem County Council Candidate for Tunbridge Wells West says: “The current system is sheer lunacy and deters many shoppers and tourists from coming into the town at all, so local retailers, restaurants and other businesses are all losing valuable revenue every day this way.”\n“It is high time to scrap the current ‘Pay and Dismay’ system and consider the merits of much fairer alternatives like ‘Pay on Exit’, as well as making the first 30 minutes free, with free parking on Sundays and bank holidays, to attract more tourists and shoppers to visit the town centre,” Alan added.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_06_18_why-i-am-backing-new-tunbridge-wells-science-park-proposal/content_9.html": "Sheridan Bowie’s plans published in the Courier for a Colebrook Science Park on the outskirts of Tunbridge Wells should be welcomed.\nWe urgently need more science and hi-tech jobs, as well as apprenticeships, and this scheme could therefore be ideal.\nProvided the A21 widening goes ahead, and this development is connected by a frequent shuttle bus with nearby High Brooms station, then I can foresee few problems with increased road traffic.\nOne of the So Make A Difference visions for the town which I backed was for a university campus.\nIf the Colebrook site could be used to develop medical breakthroughs with our local hospital facilities, as well as agricultural crop improvements with neighbouring researchers such as in Hadlow and East Malling, we could really have a campus of lasting benefit both to West Kent and beyond.\nSome years ago, Sir Bob Geldof, who also lives near Faversham, was involved in just such a proposal at Wye in East Kent.\nSadly that project failed to get planning approval, mainly due to local objections, in a time of lower unemployment, but perhaps Sir Bob and others could be approached again for financial backing by Mr Bowie?",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_04_25_lib-dems-win-council-pledge-to-hold-special-meeting-following-tunbridge-wells-parking-campaign/content_29.html": "At a full council meeting on April 24, Liberal Democrat group leader and county council candidate David Neve secured the promise of a long overdue meeting to discuss the difficulties and expense of parking in Tunbridge Wells, which at present puts many people off visiting and shopping in the town centre.\n“For once all the Tories, Labour, UKIP and Independent councillors (except the mayor who abstained) agreed with me and my amendment on parking, which was to hold a special meeting of planning and transportation,” said long-serving St James councillor and KCC candidate for Tunbridge Wells East David Neve.\nThis success follows a 2,000 strong petition and a campaign led by Courier contributor Sarah Bond on the many problems and pitfalls of the current payment system.\nAs Sarah rightly says in the Tunbridge Wells edition of the Courier, the ‘Pay and Display’ ticket machines fill motorists with stress, demand correct coins and don’t even give us change. And ‘Pay By Phone’ has big flaws, too.\nIn these tough times we should not have slap-happy wardens ticketing shoppers and tourists. Women have to run with wet hair from the hairdresser’s, mums have to pull children out of important eye checks, businessmen have to rush out of important meetings, musicians have to run off stage mid-set, and retailers watch in horror as customers rush off mid-sale. It’s utter madness, as many local retailers have told the Lib Dems, the Courier newspaper, and BBC Radio Kent.\nAs Alan Bullion, Lib Dem County Council Candidate for Tunbridge Wells West says: “The current system is sheer lunacy and deters many shoppers and tourists from coming into the town at all, so local retailers, restaurants and other businesses are all losing valuable revenue every day this way.”\n“It is high time to scrap the current ‘Pay and Dismay’ system and consider the merits of much fairer alternatives like ‘Pay on Exit’, as well as making the first 30 minutes free, with free parking on Sundays and bank holidays, to attract more tourists and shoppers to visit the town centre,” Alan added.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2018_05_09_an-accident-waiting-to-happen/content_3.html": "From: Bullion, Alan\nSent: 03 May 2018 13:01\nTo: newsdesk@timesoftunbridgewells.co.uk\nSubject: Traffic lights at the junctions of Blackhurst Lane and Halls Hole Road\nDear Sir,\nDuring the local election campaign on Sherwood, I was contacted by several concerned residents of Sandown Park and surrounding areas about the traffic lights sited at the junctions of Blackhurst Lane and Halls Hole Road.\nWhile the lights are far better than the former uncontrolled junction there is a problem with the phasing. These lights can be controlled remotely from Maidstone, so a simple change to the phasing, delaying the Halls Hole Road green light by 10-15 seconds, could be introduced quickly and easily, and we would soon see if it was effective. Also, a camera at the junction, well-advertised, would both act as a deterrent and generate revenue. When the lights were first installed, signs were placed both sides of the junction saying ‘Give way to oncoming traffic’, but they were removed after only a few weeks.\nSome local residents have also suggested a roundabout as an alternative, or one-way traffic along Halls Hole Road and Cornford Lane into Pembury. I’m aware that this issue has come up frequently over recent years as the traffic jams increase between Pembury and the Town Centre, particularly at peak hours. A newly proposed ‘retirement village’ would have further compounded the problem. A safer solution does need to be urgently found, for as one local resident said – it’s an accident waiting to happen.\nYours,\nDr Alan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_05_22_tunbridge-wells-lib-dems-welcome-a21-inquiry/content_32.html": "Tunbridge Wells Liberal Democrats welcome the public inquiry into dualling the A21 road link.\nThe long-delayed opening of the inquiry marks a much-awaited milestone in the campaign to get the A21 turned into a dual carriageway between Tonbridge and Pembury.\nThe case for dualling the road is overwhelming, despite the environmental concerns voiced by some. Over 35,000 vehicles, including ambulances and heavy lorries, use this section of the A21 every day. It is also a vital link for many with the new much-improved Pembury hospital and its A&E facilities.\nIronically, for a road linking Pembury hospital with the cottage hospital at Vauxhall Lane in Tonbridge, this stretch of the A21 is an appalling accident blackspot. Over the past five years, this section has seen 71 accidents involving people being injured, and in four of these cases fatal. In many parts, it is also a potential deathtrap for motorcyclists, cyclists and pedestrians, as I have found trying to deliver Focus leaflets to households along the route.\nThere is also the wider pollution displacement factor to consider. Because the delays on the A21 are so notorious, traffic studies have shown that more cars and lorries use the A26 through Southborough and Tunbridge Wells to avoid it. This causes congestion and exhaust fumes to blight a heavily residential area, which also has many of our local secondary and primary schools, with the result that all suffer from detiorating air quality and noise.\nWe hear the views of the Kent Green Party and the Woodland Trust, but would argue that in this case the majority view for common sense prevails.\nThe inquiry has already heard that travel times between Pembury and Tonbridge would be reduced by 69% if the A21 is dualled. There should therefore be no further unnecessary delays which cost still more lives.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_05_07_many-thanks-for-voting-lib-dem-on-thursday-may-2/content_37.html": "Many Thanks to all those who voted for our Liberal Democrat candidates in Tunbridge Wells seats on Thursday May 2, as well as those who helped in different ways both during the campaign and on the day. Although UKIP gained one seat from the Conservatives, and we failed to win elsewhere, please rest assured that we will be campaigning for victory again in May 2014 and take nothing for granted from the local electorate.\nBest Wishes,\nAlan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2018_04_17_alan-bullion-speaks-up-for-sherwood/content_5.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nΔ",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_04_18_42/content_36.html": "Welcome to my website.\nI am standing as the Liberal Democrat County Council Candidate for Tunbridge Wells West Division on Thursday May 2.\nThis area covers Culverden, Rusthall, Langton Green, Groombridge (Kent), Speldhurst, Ashurst (Kent), and Bidborough.\nPolls will be open from 7am to 10pm.\nMore news will be published shortly.\nPlease contact me should you have any questions.\nI look forward to hearing from you.\nBest Wishes,\nAlan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_10_10_how-tunbridge-wells-benefits-from-good-trading-relations-with-the-eu/content_35.html": "South East England Lib Dem European Candidate Alan Bullion has pledged his support for Britain’s continued membership of the European Union, which each year provides billions of pounds of funding across the United Kingdom.\nThis follows an important new report by respected academic Professor Iain Begg, who has worked out how many jobs rely on trade with the European Union. He has calculated that trade with the EU accounts for 4,614 jobs across the borough of Tunbridge Wells – which also includes Cranbrook and surrounding villages in the Maidstone and Weald constituency.\nFrom 2007-2012 the European Investment Bank provided €26.7 billion of loans in the UK, alongside €8.4 billion of investment. “Liberal Democrats are building a stronger economy in a fairer society. Part of that is recognising the huge benefits our membership of the European Union brings. Around 3.5 million jobs are linked to Britain’s membership of the EU. I know many people have issues with the EU, but as we climb out of a terrible recession, is this really the time to risk our membership of the world’s most valuable single market?,” said Alan Bullion.\nLiberal Democrat Leader and Deputy Prime Minister Nick Clegg has also warned of the dangers of leaving the European Union saying:\n“Our economy is finally turning a corner, but the recovery is fragile. We should be focusing on finishing the job and laying the foundations for long-term growth, not entertaining the idea of an EU exit that would throw our recovery away. Let me be absolutely clear: leaving the EU would be economic suicide. You cannot overstate the damage it would do to British livelihoods and prosperity.”",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_05_07_eu-parliament-visit/content_25.html": "EU PARLIAMENT TRIP\n28th and 29th May 2013\nWhy not join us on our fascinating two day trip to the Ancient City of Brussels and the European Parliament.\nThe trip includes:\nCoach Travel\nAn evening to explore Brussels on your own\nHotel for Bed and Breakfast\nLunch on the 29th May\nTour of the EU Parliament Building\nTour of the Committee of the Regions Building\nA Question and Answer Session with some MEP’s\nPrice £160.00 per person.\nThis tour can be booked via Marguerita Morton at 309 St John’s Road, Tunbridge Wells, Kent TN4 9XE marguerita309@yahoo.co.uk\nTel No. 01892 522756\nOr via the Eventbrite Website:-\nhttp://www.eventbrite.co.uk/event/5243728132/es2002/?rank=1&ebtv=C",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_10_10_how-the-lib-dems-deliver-greater-lasting-benefits-for-kent-pupils/content_4.html": "David Laws, Liberal Democrat schools minister, said Kent schools will benefit from a new deal brokered by Nick Clegg, Deputy Prime Minister.\nThe Liberal Democrats were able to negotiate in the coalition for an increase to the Pupil Premium, which gives additional money towards the education of disadvantaged children, and the introduction of free school lunches. Both policies are being implemented by David Laws.\n“This will really help children in Kent get on in life. It is an important step to help us build a stronger economy and a fairer society,” Laws told an audience in Headcorn.\nThe Pupil Premium allocation for 2013-2014 (this school year) is £47.8 million across 54,200 children for Kent & Medway at £900 for most children.\nDavid Laws announced that the estimated pupil premium for 2014-2015 (next year) will be £60.9 million across a similar number of children. Next year the pupil premium will remain the same for kids in secondary school but rise by a whopping 44% for primary children to £1,300.\nFree School Meals are also to be offered to all infant children, i.e. those in Receptions and Years 1 and 2, from next year. There are 59,568 kids currently eligible in Kent and Medway at around £400 for each child. This will now go to all youngsters at a total injection of an additional £23.8 million.\nThis all amounts to total increase of £132.5 million additional money for Kent schools from now until July 2015. It also amounts to a grand total of £182 million across the whole of this Parliament.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_05_22_tunbridge-wells-lib-dems-welcome-a21-inquiry/content_51.html": "Tunbridge Wells Liberal Democrats welcome the public inquiry into dualling the A21 road link.\nThe long-delayed opening of the inquiry marks a much-awaited milestone in the campaign to get the A21 turned into a dual carriageway between Tonbridge and Pembury.\nThe case for dualling the road is overwhelming, despite the environmental concerns voiced by some. Over 35,000 vehicles, including ambulances and heavy lorries, use this section of the A21 every day. It is also a vital link for many with the new much-improved Pembury hospital and its A&E facilities.\nIronically, for a road linking Pembury hospital with the cottage hospital at Vauxhall Lane in Tonbridge, this stretch of the A21 is an appalling accident blackspot. Over the past five years, this section has seen 71 accidents involving people being injured, and in four of these cases fatal. In many parts, it is also a potential deathtrap for motorcyclists, cyclists and pedestrians, as I have found trying to deliver Focus leaflets to households along the route.\nThere is also the wider pollution displacement factor to consider. Because the delays on the A21 are so notorious, traffic studies have shown that more cars and lorries use the A26 through Southborough and Tunbridge Wells to avoid it. This causes congestion and exhaust fumes to blight a heavily residential area, which also has many of our local secondary and primary schools, with the result that all suffer from detiorating air quality and noise.\nWe hear the views of the Kent Green Party and the Woodland Trust, but would argue that in this case the majority view for common sense prevails.\nThe inquiry has already heard that travel times between Pembury and Tonbridge would be reduced by 69% if the A21 is dualled. There should therefore be no further unnecessary delays which cost still more lives.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_08_28_kent-tories-waste-more-of-your-hard-earned-money-at-county-hall/content_38.html": "Tory County Councillors have spent £5,000 of taxpayers’ money – on financial advisers to help them avoid paying tax on their travel expenses.\n“This is a disgrace,” said Alan Bullion, Liberal Democrat prospective Euro candidate and life-long Kent resident. “As leader of the council who lobbied and lobbied for the money, Paul Carter should resign. How can he possibly justify wasting public money in a legal battle to increase his expenses when he is closing children centres in our borough because of lack of funds?\n“The tax authorities had already undertaken a lengthy investigation and ruled that there was absolutely no justification in letting off county councillors from paying tax on their expenses – yet still Mr Carter pushed and pushed for the money.”\nThis shocking revelation follows the recent storm when it was revealed Mr Carter had tried to increase the mileage allowance of county councillors from 45p a mile to 67p a mile – a move exposed by Trudy Dean, leader of the Lib Dem group at County Hall. The spending hike had been backed by a motley alliance of Tory, Labour and UKIP, with the UKIP leader declaring himself behind the Tory measure “all the way”.\nThanks to Lib Dem pressure and a public outcry, Mr Carter backed down. But after this latest revelation that he used public money to feather the nest of councillors, can he survive?",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_04_19_vote-lib-dem-for-a-positive-change-on-thursday-may-2/content_47.html": "Thursday May 2 is YOUR opportunity to vote Lib Dem for a positive change of county council administration.\nWhat have the Tories done with YOUR hard-earned money?\nA recent OFSTED report has placed Kent primary schools among the worst in the country for the 4th year running.\nOf 141 councils in England, Kent was rated 131st.\nAnother 100 KCC staff are expected to lose their jobs from this April. This is on top of the huge council reorganisation which has seen over 1,600 people lose their jobs.\nThis includes huge pay-offs to senior staff, investments in companies that went wrong, and spending on pet projects like Kent TV which never paid off.\nHaving sent one Chief Executive on his way with a payment of £408,000, they then appointed another only to decide two years later to do away with the position at a further cost of £420.000.\nAnother £7,400 a year is being paid to ‘Locality Board’ chairmen when these are currently little more than talking shops.\nA further £250,000 is being written off on just one of the County Council’s failed companies.\nSome £4.5 million has gone on expensive consultants, while payments have been made to the wrong bank accounts, some of which will never be recouped.\nRemember also the money KCC put in Icelandic accounts which then went belly up with the financial crisis and were frozen.\nMeanwhile, front-line services are being cut, roads and pavements badly need mending, but the media department is still hiring staff.\nThe Conservative-run County Council has money for spin but not for essential public services like libraries.\nIsn’t it time for a change from four years of Tory waste and failure at County Hall in Maidstone?\nVOTE LIB DEM on Thursday May 2\nPolling stations are open from 7am to 10pm",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk/content_1.html": "From: Bullion, Alan\nSent: 03 May 2018 13:01\nTo: newsdesk@timesoftunbridgewells.co.uk\nSubject: Traffic lights at the junctions of Blackhurst Lane and Halls Hole Road\nDear Sir,\nDuring the local election campaign on Sherwood, I was contacted by several concerned residents of Sandown Park and surrounding areas about the traffic lights sited at the junctions of Blackhurst Lane and Halls Hole Road.\nWhile the lights are far better than the former uncontrolled junction there is a problem with the phasing. These lights can be controlled remotely from Maidstone, so a simple change to the phasing, delaying the Halls Hole Road green light by 10-15 seconds, could be introduced quickly and easily, and we would soon see if it was effective. Also, a camera at the junction, well-advertised, would both act as a deterrent and generate revenue. When the lights were first installed, signs were placed both sides of the junction saying ‘Give way to oncoming traffic’, but they were removed after only a few weeks.\nSome local residents have also suggested a roundabout as an alternative, or one-way traffic along Halls Hole Road and Cornford Lane into Pembury. I’m aware that this issue has come up frequently over recent years as the traffic jams increase between Pembury and the Town Centre, particularly at peak hours. A newly proposed ‘retirement village’ would have further compounded the problem. A safer solution does need to be urgently found, for as one local resident said – it’s an accident waiting to happen.\nYours,\nDr Alan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2018_04_06_sherwood-commuter-alan-bullion-supports-increased-safety-measures-at-high-brooms-station/content_14.html": "Sherwood resident and commuter Alan Bullion has seen several incidents where train travellers have had problems with the treacherous steep staircases at High Brooms station.\n“One day I saw an elderly man lying at the bottom of the steps who had fallen as the handrail on the stairs had come away. We helped him to get an ambulance as there was no station staff on duty due to being a Sunday.”\nSimilar difficulties have been experienced by passengers with disabilities, school children, and parents with buggies and pushchairs.\n“This problem could easily be solved by building a ramp behind the down platform onto the footpath coming out by the second ticket machine, which I successfully campaigned for over many years. There is railway land available and a track where this could be constructed. For many years passengers have suffered from a lack of facilities at this busy station, with no loos, no proper waiting rooms, and stairs that are clearly dangerous for many passengers.”\nAlan is calling for urgent action from Southeastern with other commuters before another accident occurs.\nThis would also benefit commuters from St James, St Johns, and Southborough.\nAlan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_12_16_action-now-on-tunbridge-wells-cinema-grotspot/content_28.html": "The derelict site of the former ABC Cinema in Tunbridge Wells town centre has reached its 13th year. Despite endless promises and excuses from the Conservatives running the council no real progress has been made on redeveloping the site for local people.\nLocal Liberal Democrats are pressing for decisive action to be taken by the council. They are leading the campaign to press the council into purchasing the site and developing it for the community.\n“It is just shocking and inexcusable that the Conservatives have left this prime town centre site derelict for 13 years! There are children in our town who have grown up never knowing it as anything other than a disused grotspot.” said local Lib Dem councillor, Ben Chapelard.\n“The Liberal Democrats are launching a campaign to force the Conservatives to take action. We want them to use existing powers such as a Compulsory Purchase Order to get some progress on getting the site redeveloped.\n“All we ever hear are excuses or attempts to shift the blame onto someone else. When they’re not displaying a “can’t do attitude” they’re blaming others for not using their legal powers to resolve the situation. Enough is enough! The Conservatives have let this drag on for 13 long years and it’s time to put an end to it.\n“We are asking local people to sign our petition at www.twlibdems.org.uk to put pressure on the council to act. Together we can put an end to 13 years of Conservative failure.”\nLeader of the Opposition Lib Dem Cllr David Neve added: “The whole thing is a ‘horror show’. Visitors to Tunbridge Wells are greeted, on arrival by devastation and dilapidation. What a sorry picture this presents. Tunbridge Wells deserves better from the Conservatives. Please sign our residents’ petition.”",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_04_19_vote-lib-dem-for-a-positive-change-on-thursday-may-2/content_45.html": "Thursday May 2 is YOUR opportunity to vote Lib Dem for a positive change of county council administration.\nWhat have the Tories done with YOUR hard-earned money?\nA recent OFSTED report has placed Kent primary schools among the worst in the country for the 4th year running.\nOf 141 councils in England, Kent was rated 131st.\nAnother 100 KCC staff are expected to lose their jobs from this April. This is on top of the huge council reorganisation which has seen over 1,600 people lose their jobs.\nThis includes huge pay-offs to senior staff, investments in companies that went wrong, and spending on pet projects like Kent TV which never paid off.\nHaving sent one Chief Executive on his way with a payment of £408,000, they then appointed another only to decide two years later to do away with the position at a further cost of £420.000.\nAnother £7,400 a year is being paid to ‘Locality Board’ chairmen when these are currently little more than talking shops.\nA further £250,000 is being written off on just one of the County Council’s failed companies.\nSome £4.5 million has gone on expensive consultants, while payments have been made to the wrong bank accounts, some of which will never be recouped.\nRemember also the money KCC put in Icelandic accounts which then went belly up with the financial crisis and were frozen.\nMeanwhile, front-line services are being cut, roads and pavements badly need mending, but the media department is still hiring staff.\nThe Conservative-run County Council has money for spin but not for essential public services like libraries.\nIsn’t it time for a change from four years of Tory waste and failure at County Hall in Maidstone?\nVOTE LIB DEM on Thursday May 2\nPolling stations are open from 7am to 10pm",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_04_23_lib-dem-priorities-for-the-kent-county-council-elections-on-thursday-may-2-2013/content_46.html": "The Liberal Democrat Priorities for Kent 2013\nAs the official opposition to the Conservatives over the past 4 years on Kent County Council, the Liberal Democrats have tirelessly worked to hold the council to account and speak up on behalf of local residents. Time and again we have exposed examples of waste, maladministration and badly implemented ideas.\nThe Conservatives try to claim they are an able and sensible administraion: but so many Kent residents know that is not the case. Time and again, we open our newspapers to stories of Kent County Council waste, from huge pay-offs to senior officers, to fortunes being wasted on Kent TV, and that millions of Kent Tax payers money is STILL in Iceland over 5 years after it was first put at risk through poor investment decisions.\nDuring the last 4 years, it is the Liberal Democrats that have spoken up against the Conservative administration. Labour have just three Councillors on Kent County Council: they have nort been able to offer an effective opposition. UKIP didn’t get one Councillor elected to Kent County Council in 2009.\nOpening Up Kent\nKent County Council seems to be shrouded in secrecy. The Liberal Democrats would work to open up our Council, make sure we open our books to local people and get residents actively involved in making decisions that affect them.\nRecord of Action\n- Over the last four years, the Liberal Democrats have challenged the Conservative leadership on huge payoffs to key officers and ex-Chief Executives.\n- The Liberal Democrats pushed successfully to get illegal payments made to Chief Executive’s for elections refunded.\n- The Liberal Democrats have fought for secret reports into KCC businesses to be made public and the businesses operations made more transparent to local residents and businesses.\n- The Liberal Democrats have fought to get more time at Council meetings to be spent discussing residents concerns through petitions by fighting for lower thresholds for petitions to be heard for debate.\nPromise of More\n- The Liberal Democrats would open up Kent County Council far more to local people.\n- The Liberal Democrats would introduce a public right to speak or ask a question at all Council and Cabinet meetings.\n- The Liberal Democrats would slash the number of signatories needed to get a petition debated at full Council, as we have argued repeatedly for years.\n- The Liberal Democrats would ensure all Committee meetings are webcast (including the currently unbroadcast Personnel Commmittee and all Local Boards) and allow input from the public into meetings via Twitter and Facebook.\n- The Liberal Democrats would take Freedom of Information seriously, and reduce the time to respond to all queries to half the current 20 days.\nMaking Local Decisions Locally\nAlthough the Conservative Administration say they want local people to be involved in local decisions, its often more lip service than action. Locality boards are meant to offer local decision making as a mix of County and district Councillors for an ear meet and discuss local issues, but in some places they don’t exist, in others they meet in private, they have no decision making powers and no money to spend.\nRecord of Action\n- The Liberal Democrats have pushed for local accountability with properly constituted Locality Boards across Kent meeting in public and agendas and minutes published.\n- The Liberal Democrats have championed participatory budgeting in their divisions, with Trudy Dean, Tim Prater and George Koowaree already giving local people their say in how local grant money is spent in their areas.\n- The Liberal Democrats have pushed for Joint Transportation Boards (specific transport “locality boards”) to have real decision making powers, for example to veto specific streetlight turn-offs.\nPromise of More\n- The Liberal Democrats would ensure that every area had a properly constituted Locality Board by taking our relationships with districts seriously. Properly constituted locality boards that met in public would have defined decision making and veto powers for decisions in their locality and a budget to tackle the issues they want to prioritise.\n- The Liberal Democrats would encourage more Councillors to promote and use participatory budgeting in their areas, giving local people a say in which organisations in their areas should receive grants.\n- The Liberal Democrats would increase the amount of money each Councillor can spend in their area on Highways projects to ensure localised problems can be tackled. We would look at ways that some of this funding could be opened up to Participatory Budgetting: giving local people a say on the Highway priorities in their area too.\n- The Liberal Democrats would give Joint Transportation Boards the right of veto and decision on projects in their area. We would also give Joint Transportation Boards a budget so they could kick-start transportation projects or repairs in their area.\n- The Liberal Democrats would make openness, tranparency and getting local residents input into decisions the over-arching priority of the council. We would make Council transparency a Cabinet member responsibility and form a Transparency Working Group (comprising councillors of all groups on the Council, local business leaders, community group leaders, residents, journalists and Youth Council members) would take ideas online, in public, and challenge the council to get them in place quickly and monitor the impact. Getting real-time feedback from the right people and acting on it effectively will save the Council money in the long-term and improve both services and the perception of them.\nOur Children’s Future\nKent’s Children have been let down over the past four years by the Conservatives.\nIn 2010 an Ofsted report found that Kent was failing its looked after children: children who are the most vulnerable in our society and need our help and support being let down by our County Council. It’s taken over 2 years and the investment of millions of pounds of emergency spending to turn the service around so that it is now deemed to be adequate. Our children should never be failed in this way again.\nKent’s Conservative adminstration have punished the brightest and best of our children by removing free to-school transport to our Grammar schools. To reward children who work hard to pass the Kent test by making them pay their own fare to school is a perverse and damaging decision.\nRecord of Action\n- The Liberal Democrats have challenged the administration repeatedly over their failures in supporting its Looked After Children and poor record on attainment in our schools\n- The Liberal Democrats have supported local schools faced with closure and amalagamation and forced the issue into the Council agenda. Local people need to have their voice heard, not just have decisions steamrolled through.\n- The Liberal Democrats have consistently opposed the removal of free to-school transport to our Grammar Schools. We have consistently opposed the decision and brought forward costed proposals to Council to reinstate free to-school transport to all school children that need it.\n- The Liberal Democrats have pushed for more funding for school support in Kent to do more to back-up and improve school standards.\n- The Liberal Democrats pushed for more funding for school sports in Kent after the Olympics to build on and increase the lagacy left by the games. The Conservatives instead cut £200,000 sports funding for schools from this years budget.\nPromise of More\n- The Liberal Democrats would reinstate free to-school transport to our Grammar schools. The Liberal Democrats want to help and encourage our school children, not punish them for academic success. Our budget proposals for this year showed how this could be afforded.\n- The Liberal Democrats would re-instate £200,000 this year to fund sports projects across the County to help embed the Olympic legacy, and would commit to funding through to at least the Olympics in Rio 2016.\n- Making use of experienced and effective voluntary organisations to support families so they do not go into crisis\n- Work to build robust local teams, with strong local managers, to deliver\nA Fair Deal for Staff and Residents\nThe first act of the newly elected Council in 2009 was to vote through a payrise of £1,000 for every Councillor. The Conservatives pushed the rise though immediately after the last election, despite opposition from the Liberal Democrats who wanred to increase was unsustainable and unsupportable.\nTwo years later, the Conservatives finally backed down and slightly cut Councillor allowances (but not back to 2009 levels). The Liberal Democrats’ however took a cut – which we supported – of over 10% to the responsibility allowances the group receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\nDespire such a big payrise for Councillors, the council has frozen staff pay twice in the last 4 years, and given a 1% increase to staff in the last two years, whilst at the same time shedding thousands of Council posts.\nRecord of Action\n- The Liberal Democrats opposed the rise in Councillors allowances in 2009. Lib Dem Tim Prater invested his 2009-10 Allowance rise on a project in his local community funding a postage licence and equipment to allow a Sandgate shop to introduce postal services after the closure of the village’s Post Office.\n- The Liberal Democrats took a cut of over 10% to the responsibility allowances they receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\n- The Liberal Democrats have backed moves to see the lowest paid Kent staff receive a larger payrise, and have worked to ensure all Kent County Council staff are paid at least a living wage.\nPromise of More\n- The Liberal Democrats would ensure all Kent members of staff are paid at least the living wage, by abolishing KS2. We would ask all Kent schools to do the same thing.\n- The Liberal Democrats want to restore public trust in Councillors – and a part of that is to be fair about the allowances we receive. We would commit that Councillor Allowances should never rise faster than the pay of our lowest paid staff. If staff get a zero rise in pay in a year, so should Councillors.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_wp-admin/content_24.html": "For security and auditing purposes, a record of all of your logged-in actions and changes within the WordPress dashboard will be recorded in an audit log. The audit log also includes the IP address where you accessed this site from.\nLost your password?\n← Go to Alan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_feed/content_12.html": null,
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_10_10_how-tunbridge-wells-benefits-from-good-trading-relations-with-the-eu/content_19.html": "South East England Lib Dem European Candidate Alan Bullion has pledged his support for Britain’s continued membership of the European Union, which each year provides billions of pounds of funding across the United Kingdom.\nThis follows an important new report by respected academic Professor Iain Begg, who has worked out how many jobs rely on trade with the European Union. He has calculated that trade with the EU accounts for 4,614 jobs across the borough of Tunbridge Wells – which also includes Cranbrook and surrounding villages in the Maidstone and Weald constituency.\nFrom 2007-2012 the European Investment Bank provided €26.7 billion of loans in the UK, alongside €8.4 billion of investment. “Liberal Democrats are building a stronger economy in a fairer society. Part of that is recognising the huge benefits our membership of the European Union brings. Around 3.5 million jobs are linked to Britain’s membership of the EU. I know many people have issues with the EU, but as we climb out of a terrible recession, is this really the time to risk our membership of the world’s most valuable single market?,” said Alan Bullion.\nLiberal Democrat Leader and Deputy Prime Minister Nick Clegg has also warned of the dangers of leaving the European Union saying:\n“Our economy is finally turning a corner, but the recovery is fragile. We should be focusing on finishing the job and laying the foundations for long-term growth, not entertaining the idea of an EU exit that would throw our recovery away. Let me be absolutely clear: leaving the EU would be economic suicide. You cannot overstate the damage it would do to British livelihoods and prosperity.”",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2018_04_11_alan-stands-up-for-sherwood/content_7.html": "Alan Bullion has lived in the Sherwood ward where he is standing for the past 30 years.\nHe works in London for Informa and commutes from High Brooms station, where he successfully campaigned for a second ticket machine. He is a former school governor and pupil of Tunbridge Wells Grammar School for Boys, and is still chair of its Alumni society.\nAlan has long been active over local issues in the Oak Road area of Sherwood, such as defending the recreation and sports facilities against development.\nAlan also is a great believer in life-long learning, having done degrees with the Open University and Southampton as a mature student. He is supporting the campaign to keep Open University courses affordable for all who want to continue to study.\nAlan is also an active member of the Campaign for Protection of Rural England, the Campaign for Real Ale, European Movement, and United Nations Association UK.\nPlease contact him at alan.bullion@informa.com or 07766968820 if you can help in any way with Liberal Democrat campaigns.\nBecome a Member\nJoin the Liberal Democrats today from as little as £1 a month and help us fight for an open, tolerant and united Britain.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_04_23_lib-dem-priorities-for-the-kent-county-council-elections-on-thursday-may-2-2013/content_41.html": "The Liberal Democrat Priorities for Kent 2013\nAs the official opposition to the Conservatives over the past 4 years on Kent County Council, the Liberal Democrats have tirelessly worked to hold the council to account and speak up on behalf of local residents. Time and again we have exposed examples of waste, maladministration and badly implemented ideas.\nThe Conservatives try to claim they are an able and sensible administraion: but so many Kent residents know that is not the case. Time and again, we open our newspapers to stories of Kent County Council waste, from huge pay-offs to senior officers, to fortunes being wasted on Kent TV, and that millions of Kent Tax payers money is STILL in Iceland over 5 years after it was first put at risk through poor investment decisions.\nDuring the last 4 years, it is the Liberal Democrats that have spoken up against the Conservative administration. Labour have just three Councillors on Kent County Council: they have nort been able to offer an effective opposition. UKIP didn’t get one Councillor elected to Kent County Council in 2009.\nOpening Up Kent\nKent County Council seems to be shrouded in secrecy. The Liberal Democrats would work to open up our Council, make sure we open our books to local people and get residents actively involved in making decisions that affect them.\nRecord of Action\n- Over the last four years, the Liberal Democrats have challenged the Conservative leadership on huge payoffs to key officers and ex-Chief Executives.\n- The Liberal Democrats pushed successfully to get illegal payments made to Chief Executive’s for elections refunded.\n- The Liberal Democrats have fought for secret reports into KCC businesses to be made public and the businesses operations made more transparent to local residents and businesses.\n- The Liberal Democrats have fought to get more time at Council meetings to be spent discussing residents concerns through petitions by fighting for lower thresholds for petitions to be heard for debate.\nPromise of More\n- The Liberal Democrats would open up Kent County Council far more to local people.\n- The Liberal Democrats would introduce a public right to speak or ask a question at all Council and Cabinet meetings.\n- The Liberal Democrats would slash the number of signatories needed to get a petition debated at full Council, as we have argued repeatedly for years.\n- The Liberal Democrats would ensure all Committee meetings are webcast (including the currently unbroadcast Personnel Commmittee and all Local Boards) and allow input from the public into meetings via Twitter and Facebook.\n- The Liberal Democrats would take Freedom of Information seriously, and reduce the time to respond to all queries to half the current 20 days.\nMaking Local Decisions Locally\nAlthough the Conservative Administration say they want local people to be involved in local decisions, its often more lip service than action. Locality boards are meant to offer local decision making as a mix of County and district Councillors for an ear meet and discuss local issues, but in some places they don’t exist, in others they meet in private, they have no decision making powers and no money to spend.\nRecord of Action\n- The Liberal Democrats have pushed for local accountability with properly constituted Locality Boards across Kent meeting in public and agendas and minutes published.\n- The Liberal Democrats have championed participatory budgeting in their divisions, with Trudy Dean, Tim Prater and George Koowaree already giving local people their say in how local grant money is spent in their areas.\n- The Liberal Democrats have pushed for Joint Transportation Boards (specific transport “locality boards”) to have real decision making powers, for example to veto specific streetlight turn-offs.\nPromise of More\n- The Liberal Democrats would ensure that every area had a properly constituted Locality Board by taking our relationships with districts seriously. Properly constituted locality boards that met in public would have defined decision making and veto powers for decisions in their locality and a budget to tackle the issues they want to prioritise.\n- The Liberal Democrats would encourage more Councillors to promote and use participatory budgeting in their areas, giving local people a say in which organisations in their areas should receive grants.\n- The Liberal Democrats would increase the amount of money each Councillor can spend in their area on Highways projects to ensure localised problems can be tackled. We would look at ways that some of this funding could be opened up to Participatory Budgetting: giving local people a say on the Highway priorities in their area too.\n- The Liberal Democrats would give Joint Transportation Boards the right of veto and decision on projects in their area. We would also give Joint Transportation Boards a budget so they could kick-start transportation projects or repairs in their area.\n- The Liberal Democrats would make openness, tranparency and getting local residents input into decisions the over-arching priority of the council. We would make Council transparency a Cabinet member responsibility and form a Transparency Working Group (comprising councillors of all groups on the Council, local business leaders, community group leaders, residents, journalists and Youth Council members) would take ideas online, in public, and challenge the council to get them in place quickly and monitor the impact. Getting real-time feedback from the right people and acting on it effectively will save the Council money in the long-term and improve both services and the perception of them.\nOur Children’s Future\nKent’s Children have been let down over the past four years by the Conservatives.\nIn 2010 an Ofsted report found that Kent was failing its looked after children: children who are the most vulnerable in our society and need our help and support being let down by our County Council. It’s taken over 2 years and the investment of millions of pounds of emergency spending to turn the service around so that it is now deemed to be adequate. Our children should never be failed in this way again.\nKent’s Conservative adminstration have punished the brightest and best of our children by removing free to-school transport to our Grammar schools. To reward children who work hard to pass the Kent test by making them pay their own fare to school is a perverse and damaging decision.\nRecord of Action\n- The Liberal Democrats have challenged the administration repeatedly over their failures in supporting its Looked After Children and poor record on attainment in our schools\n- The Liberal Democrats have supported local schools faced with closure and amalagamation and forced the issue into the Council agenda. Local people need to have their voice heard, not just have decisions steamrolled through.\n- The Liberal Democrats have consistently opposed the removal of free to-school transport to our Grammar Schools. We have consistently opposed the decision and brought forward costed proposals to Council to reinstate free to-school transport to all school children that need it.\n- The Liberal Democrats have pushed for more funding for school support in Kent to do more to back-up and improve school standards.\n- The Liberal Democrats pushed for more funding for school sports in Kent after the Olympics to build on and increase the lagacy left by the games. The Conservatives instead cut £200,000 sports funding for schools from this years budget.\nPromise of More\n- The Liberal Democrats would reinstate free to-school transport to our Grammar schools. The Liberal Democrats want to help and encourage our school children, not punish them for academic success. Our budget proposals for this year showed how this could be afforded.\n- The Liberal Democrats would re-instate £200,000 this year to fund sports projects across the County to help embed the Olympic legacy, and would commit to funding through to at least the Olympics in Rio 2016.\n- Making use of experienced and effective voluntary organisations to support families so they do not go into crisis\n- Work to build robust local teams, with strong local managers, to deliver\nA Fair Deal for Staff and Residents\nThe first act of the newly elected Council in 2009 was to vote through a payrise of £1,000 for every Councillor. The Conservatives pushed the rise though immediately after the last election, despite opposition from the Liberal Democrats who wanred to increase was unsustainable and unsupportable.\nTwo years later, the Conservatives finally backed down and slightly cut Councillor allowances (but not back to 2009 levels). The Liberal Democrats’ however took a cut – which we supported – of over 10% to the responsibility allowances the group receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\nDespire such a big payrise for Councillors, the council has frozen staff pay twice in the last 4 years, and given a 1% increase to staff in the last two years, whilst at the same time shedding thousands of Council posts.\nRecord of Action\n- The Liberal Democrats opposed the rise in Councillors allowances in 2009. Lib Dem Tim Prater invested his 2009-10 Allowance rise on a project in his local community funding a postage licence and equipment to allow a Sandgate shop to introduce postal services after the closure of the village’s Post Office.\n- The Liberal Democrats took a cut of over 10% to the responsibility allowances they receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\n- The Liberal Democrats have backed moves to see the lowest paid Kent staff receive a larger payrise, and have worked to ensure all Kent County Council staff are paid at least a living wage.\nPromise of More\n- The Liberal Democrats would ensure all Kent members of staff are paid at least the living wage, by abolishing KS2. We would ask all Kent schools to do the same thing.\n- The Liberal Democrats want to restore public trust in Councillors – and a part of that is to be fair about the allowances we receive. We would commit that Councillor Allowances should never rise faster than the pay of our lowest paid staff. If staff get a zero rise in pay in a year, so should Councillors.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2018_05_09_an-accident-waiting-to-happen/content_17.html": "From: Bullion, Alan\nSent: 03 May 2018 13:01\nTo: newsdesk@timesoftunbridgewells.co.uk\nSubject: Traffic lights at the junctions of Blackhurst Lane and Halls Hole Road\nDear Sir,\nDuring the local election campaign on Sherwood, I was contacted by several concerned residents of Sandown Park and surrounding areas about the traffic lights sited at the junctions of Blackhurst Lane and Halls Hole Road.\nWhile the lights are far better than the former uncontrolled junction there is a problem with the phasing. These lights can be controlled remotely from Maidstone, so a simple change to the phasing, delaying the Halls Hole Road green light by 10-15 seconds, could be introduced quickly and easily, and we would soon see if it was effective. Also, a camera at the junction, well-advertised, would both act as a deterrent and generate revenue. When the lights were first installed, signs were placed both sides of the junction saying ‘Give way to oncoming traffic’, but they were removed after only a few weeks.\nSome local residents have also suggested a roundabout as an alternative, or one-way traffic along Halls Hole Road and Cornford Lane into Pembury. I’m aware that this issue has come up frequently over recent years as the traffic jams increase between Pembury and the Town Centre, particularly at peak hours. A newly proposed ‘retirement village’ would have further compounded the problem. A safer solution does need to be urgently found, for as one local resident said – it’s an accident waiting to happen.\nYours,\nDr Alan Bullion",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_12_16_action-now-on-tunbridge-wells-cinema-grotspot/content_27.html": "The derelict site of the former ABC Cinema in Tunbridge Wells town centre has reached its 13th year. Despite endless promises and excuses from the Conservatives running the council no real progress has been made on redeveloping the site for local people.\nLocal Liberal Democrats are pressing for decisive action to be taken by the council. They are leading the campaign to press the council into purchasing the site and developing it for the community.\n“It is just shocking and inexcusable that the Conservatives have left this prime town centre site derelict for 13 years! There are children in our town who have grown up never knowing it as anything other than a disused grotspot.” said local Lib Dem councillor, Ben Chapelard.\n“The Liberal Democrats are launching a campaign to force the Conservatives to take action. We want them to use existing powers such as a Compulsory Purchase Order to get some progress on getting the site redeveloped.\n“All we ever hear are excuses or attempts to shift the blame onto someone else. When they’re not displaying a “can’t do attitude” they’re blaming others for not using their legal powers to resolve the situation. Enough is enough! The Conservatives have let this drag on for 13 long years and it’s time to put an end to it.\n“We are asking local people to sign our petition at www.twlibdems.org.uk to put pressure on the council to act. Together we can put an end to 13 years of Conservative failure.”\nLeader of the Opposition Lib Dem Cllr David Neve added: “The whole thing is a ‘horror show’. Visitors to Tunbridge Wells are greeted, on arrival by devastation and dilapidation. What a sorry picture this presents. Tunbridge Wells deserves better from the Conservatives. Please sign our residents’ petition.”",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_06_18_why-i-am-backing-new-tunbridge-wells-science-park-proposal/content_10.html": "Sheridan Bowie’s plans published in the Courier for a Colebrook Science Park on the outskirts of Tunbridge Wells should be welcomed.\nWe urgently need more science and hi-tech jobs, as well as apprenticeships, and this scheme could therefore be ideal.\nProvided the A21 widening goes ahead, and this development is connected by a frequent shuttle bus with nearby High Brooms station, then I can foresee few problems with increased road traffic.\nOne of the So Make A Difference visions for the town which I backed was for a university campus.\nIf the Colebrook site could be used to develop medical breakthroughs with our local hospital facilities, as well as agricultural crop improvements with neighbouring researchers such as in Hadlow and East Malling, we could really have a campus of lasting benefit both to West Kent and beyond.\nSome years ago, Sir Bob Geldof, who also lives near Faversham, was involved in just such a proposal at Wye in East Kent.\nSadly that project failed to get planning approval, mainly due to local objections, in a time of lower unemployment, but perhaps Sir Bob and others could be approached again for financial backing by Mr Bowie?",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_category_education/content_8.html": "Alan Bullion has lived in the Sherwood ward where he is standing for the past 30 years.\nHe works in London for Informa and commutes from High Brooms station, where he successfully campaigned for a second ticket machine. He is a former school governor and pupil of Tunbridge Wells Grammar School for Boys, and is still chair of its Alumni society.\nAlan has long been active over local issues in the Oak Road area of Sherwood, such as defending the recreation and sports facilities against development.\nAlan also is a great believer in life-long learning, having done degrees with the Open University and Southampton as a mature student. He is supporting the campaign to keep Open University courses affordable for all who want to continue to study.\nAlan is also an active member of the Campaign for Protection of Rural England, the Campaign for Real Ale, European Movement, and United Nations Association UK.\nPlease contact him at alan.bullion@informa.com or 07766968820 if you can help in any way with Liberal Democrat campaigns.\nBecome a Member\nJoin the Liberal Democrats today from as little as £1 a month and help us fight for an open, tolerant and united Britain.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_category_uncategorized_page_2/content_40.html": "The Liberal Democrat Priorities for Kent 2013\nAs the official opposition to the Conservatives over the past 4 years on Kent County Council, the Liberal Democrats have tirelessly worked to hold the council to account and speak up on behalf of local residents. Time and again we have exposed examples of waste, maladministration and badly implemented ideas.\nThe Conservatives try to claim they are an able and sensible administraion: but so many Kent residents know that is not the case. Time and again, we open our newspapers to stories of Kent County Council waste, from huge pay-offs to senior officers, to fortunes being wasted on Kent TV, and that millions of Kent Tax payers money is STILL in Iceland over 5 years after it was first put at risk through poor investment decisions.\nDuring the last 4 years, it is the Liberal Democrats that have spoken up against the Conservative administration. Labour have just three Councillors on Kent County Council: they have nort been able to offer an effective opposition. UKIP didn’t get one Councillor elected to Kent County Council in 2009.\nKent County Council seems to be shrouded in secrecy. The Liberal Democrats would work to open up our Council, make sure we open our books to local people and get residents actively involved in making decisions that affect them.\nRecord of Action\n- Over the last four years, the Liberal Democrats have challenged the Conservative leadership on huge payoffs to key officers and ex-Chief Executives.\n- The Liberal Democrats pushed successfully to get illegal payments made to Chief Executive’s for elections refunded.\n- The Liberal Democrats have fought for secret reports into KCC businesses to be made public and the businesses operations made more transparent to local residents and businesses.\n- The Liberal Democrats have fought to get more time at Council meetings to be spent discussing residents concerns through petitions by fighting for lower thresholds for petitions to be heard for debate.\nPromise of More\n- The Liberal Democrats would open up Kent County Council far more to local people.\n- The Liberal Democrats would introduce a public right to speak or ask a question at all Council and Cabinet meetings.\n- The Liberal Democrats would slash the number of signatories needed to get a petition debated at full Council, as we have argued repeatedly for years.\n- The Liberal Democrats would ensure all Committee meetings are webcast (including the currently unbroadcast Personnel Commmittee and all Local Boards) and allow input from the public into meetings via Twitter and Facebook.\n- The Liberal Democrats would take Freedom of Information seriously, and reduce the time to respond to all queries to half the current 20 days.\nMaking Local Decisions Locally\nAlthough the Conservative Administration say they want local people to be involved in local decisions, its often more lip service than action. Locality boards are meant to offer local decision making as a mix of County and district Councillors for an ear meet and discuss local issues, but in some places they don’t exist, in others they meet in private, they have no decision making powers and no money to spend.\nRecord of Action\n- The Liberal Democrats have pushed for local accountability with properly constituted Locality Boards across Kent meeting in public and agendas and minutes published.\n- The Liberal Democrats have championed participatory budgeting in their divisions, with Trudy Dean, Tim Prater and George Koowaree already giving local people their say in how local grant money is spent in their areas.\n- The Liberal Democrats have pushed for Joint Transportation Boards (specific transport “locality boards”) to have real decision making powers, for example to veto specific streetlight turn-offs.\nPromise of More\n- The Liberal Democrats would ensure that every area had a properly constituted Locality Board by taking our relationships with districts seriously. Properly constituted locality boards that met in public would have defined decision making and veto powers for decisions in their locality and a budget to tackle the issues they want to prioritise.\n- The Liberal Democrats would encourage more Councillors to promote and use participatory budgeting in their areas, giving local people a say in which organisations in their areas should receive grants.\n- The Liberal Democrats would increase the amount of money each Councillor can spend in their area on Highways projects to ensure localised problems can be tackled. We would look at ways that some of this funding could be opened up to Participatory Budgetting: giving local people a say on the Highway priorities in their area too.\n- The Liberal Democrats would give Joint Transportation Boards the right of veto and decision on projects in their area. We would also give Joint Transportation Boards a budget so they could kick-start transportation projects or repairs in their area.\n- The Liberal Democrats would make openness, tranparency and getting local residents input into decisions the over-arching priority of the council. We would make Council transparency a Cabinet member responsibility and form a Transparency Working Group (comprising councillors of all groups on the Council, local business leaders, community group leaders, residents, journalists and Youth Council members) would take ideas online, in public, and challenge the council to get them in place quickly and monitor the impact. Getting real-time feedback from the right people and acting on it effectively will save the Council money in the long-term and improve both services and the perception of them.\nKent’s Children have been let down over the past four years by the Conservatives.\nIn 2010 an Ofsted report found that Kent was failing its looked after children: children who are the most vulnerable in our society and need our help and support being let down by our County Council. It’s taken over 2 years and the investment of millions of pounds of emergency spending to turn the service around so that it is now deemed to be adequate. Our children should never be failed in this way again.\nKent’s schools have one of the worst records in the country of helping our children become the best they can be.\nKent’s Conservative adminstration have punished the brightest and best of our children by removing free to-school transport to our Grammar schools. To reward children who work hard to pass the Kent test by making them pay their own fare to school is a perverse and damaging decision.\nRecord of Action\nPromise of More\n- The Liberal Democrats would reinstate free to-school transport to our Grammar schools. The Liberal Democrats want to help and encourage our school children, not punish them for academic success. Our budget proposals for this year showed how this could be afforded.\n- The Liberal Democrats would re-instate £200,000 this year to fund sports projects across the County to help embed the Olympic legacy, and would commit to funding through to at least the Olympics in Rio 2016.\n- Making use of experienced and effective voluntary organisations to support families so they do not go into crisis\n- Work to build robust local teams, with strong local managers, to deliver\nA Fair Deal for Staff and Residents\nThe first act of the newly elected Council in 2009 was to vote through a payrise of £1,000 for every Councillor. The Conservatives pushed the rise though immediately after the last election, despite opposition from the Liberal Democrats who wanred to increase was unsustainable and unsupportable.\nTwo years later, the Conservatives finally backed down and slightly cut Councillor allowances (but not back to 2009 levels). The Liberal Democrats’ however took a cut – which we supported – of over 10% to the responsibility allowances the group receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\nDespire such a big payrise for Councillors, the council has frozen staff pay twice in the last 4 years, and given a 1% increase to staff in the last two years, whilst at the same time shedding thousands of Council posts.\nRecord of Action\n- The Liberal Democrats opposed the rise in Councillors allowances in 2009. Lib Dem Tim Prater invested his 2009-10 Allowance rise on a project in his local community funding a postage licence and equipment to allow a Sandgate shop to introduce postal services after the closure of the village’s Post Office.\n- The Liberal Democrats took a cut of over 10% to the responsibility allowances they receive to help the Council balance its books. Neither the Conservatives or Labour took a similar cut.\n- The Liberal Democrats have backed moves to see the lowest paid Kent staff receive a larger payrise, and have worked to ensure all Kent County Council staff are paid at least a living wage.\nPromise of More\n- The Liberal Democrats would ensure all Kent members of staff are paid at least the living wage, by abolishing KS2. We would ask all Kent schools to do the same thing.\n- The Liberal Democrats want to restore public trust in Councillors – and a part of that is to be fair about the allowances we receive. We would commit that Councillor Allowances should never rise faster than the pay of our lowest paid staff. If staff get a zero rise in pay in a year, so should Councillors.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2018_04_11_alan-stands-up-for-sherwood/content_30.html": "Alan Bullion has lived in the Sherwood ward where he is standing for the past 30 years.\nHe works in London for Informa and commutes from High Brooms station, where he successfully campaigned for a second ticket machine. He is a former school governor and pupil of Tunbridge Wells Grammar School for Boys, and is still chair of its Alumni society.\nAlan has long been active over local issues in the Oak Road area of Sherwood, such as defending the recreation and sports facilities against development.\nAlan also is a great believer in life-long learning, having done degrees with the Open University and Southampton as a mature student. He is supporting the campaign to keep Open University courses affordable for all who want to continue to study.\nAlan is also an active member of the Campaign for Protection of Rural England, the Campaign for Real Ale, European Movement, and United Nations Association UK.\nPlease contact him at alan.bullion@informa.com or 07766968820 if you can help in any way with Liberal Democrat campaigns.\nBecome a Member\nJoin the Liberal Democrats today from as little as £1 a month and help us fight for an open, tolerant and united Britain.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2013_10_10_how-the-lib-dems-deliver-greater-lasting-benefits-for-kent-pupils/content_13.html": "David Laws, Liberal Democrat schools minister, said Kent schools will benefit from a new deal brokered by Nick Clegg, Deputy Prime Minister.\nThe Liberal Democrats were able to negotiate in the coalition for an increase to the Pupil Premium, which gives additional money towards the education of disadvantaged children, and the introduction of free school lunches. Both policies are being implemented by David Laws.\n“This will really help children in Kent get on in life. It is an important step to help us build a stronger economy and a fairer society,” Laws told an audience in Headcorn.\nThe Pupil Premium allocation for 2013-2014 (this school year) is £47.8 million across 54,200 children for Kent & Medway at £900 for most children.\nDavid Laws announced that the estimated pupil premium for 2014-2015 (next year) will be £60.9 million across a similar number of children. Next year the pupil premium will remain the same for kids in secondary school but rise by a whopping 44% for primary children to £1,300.\nFree School Meals are also to be offered to all infant children, i.e. those in Receptions and Years 1 and 2, from next year. There are 59,568 kids currently eligible in Kent and Medway at around £400 for each child. This will now go to all youngsters at a total injection of an additional £23.8 million.\nThis all amounts to total increase of £132.5 million additional money for Kent schools from now until July 2015. It also amounts to a grand total of £182 million across the whole of this Parliament.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_05_07_eu-parliament-visit/content_22.html": "EU PARLIAMENT TRIP\n28th and 29th May 2013\nWhy not join us on our fascinating two day trip to the Ancient City of Brussels and the European Parliament.\nThe trip includes:\nCoach Travel\nAn evening to explore Brussels on your own\nHotel for Bed and Breakfast\nLunch on the 29th May\nTour of the EU Parliament Building\nTour of the Committee of the Regions Building\nA Question and Answer Session with some MEP’s\nPrice £160.00 per person.\nThis tour can be booked via Marguerita Morton at 309 St John’s Road, Tunbridge Wells, Kent TN4 9XE marguerita309@yahoo.co.uk\nTel No. 01892 522756\nOr via the Eventbrite Website:-\nhttp://www.eventbrite.co.uk/event/5243728132/es2002/?rank=1&ebtv=C",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_category_health/content_11.html": "Alan Bullion has lived in the Sherwood ward where he is standing for the past 30 years.\nHe works in London for Informa and commutes from High Brooms station, where he successfully campaigned for a second ticket machine. He is a former school governor and pupil of Tunbridge Wells Grammar School for Boys, and is still chair of its Alumni society.\nAlan has long been active over local issues in the Oak Road area of Sherwood, such as defending the recreation and sports facilities against development.\nAlan also is a great believer in life-long learning, having done degrees with the Open University and Southampton as a mature student. He is supporting the campaign to keep Open University courses affordable for all who want to continue to study.\nAlan is also an active member of the Campaign for Protection of Rural England, the Campaign for Real Ale, European Movement, and United Nations Association UK.\nPlease contact him at alan.bullion@informa.com or 07766968820 if you can help in any way with Liberal Democrat campaigns.\nBecome a Member\nJoin the Liberal Democrats today from as little as £1 a month and help us fight for an open, tolerant and united Britain.",
  "http_alanbullion_mycouncillor_org_uk_/https_alanbullion_mycouncillor_org_uk_2013_05_08_talk-on-ukip-at-european-movement-agm/content_33.html": "UKIP – and the threat to Britain in Europe\na discussion led by\nCllr Roger Walshe\nand\nWest Kent EM Annual General Meeting\n7.30 pm on Wednesday, 5th June 2013\nin the\nJudd Room, Angel Centre, Angel Lane, Tonbridge, Kent TN9 1SF\nThe West Kent Branch of the European Movement will be holding an open meeting followed by its Annual General Meeting in the Judd Room, Angel Centre, Angel Lane, Tonbridge, Kent on Wednesday, 5th June 2013, at 7.30pm.",
  "http_alanbullion_mycouncillor_org_uk_/http_alanbullion_mycouncillor_org_uk_2018_04_17_alan-bullion-speaks-up-for-sherwood/content_21.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nΔ"
}