{
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns_cost-of-living/content_3.html": "Will's response to constituents about the government proposals to scrutinise bank accounts of benefit claimants.\nWill Forster has spoken out against government plans to let the DWP access benefit claimants’ bank accounts, warning of serious privacy concerns.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk/content_1.html": "Open Letter to Karin Smyth, Minister for Medicines Supply\nWill co-signs an open letter, alongside Pancreatic Cancer UK, to raise awareness over the alarming shortages of Pancreatic Enzyme Replacement Therapy.\nGet the latest news from Will Forster MP and the local Lib Dem team\nWill co-signs an open letter, alongside Pancreatic Cancer UK, to raise awareness over the alarming shortages of Pancreatic Enzyme Replacement Therapy.\nWill visited Israel and Palestine because he wanted to understand more about the conflict. \"I wanted to push for peace, and I wanted to see how both myself and the UK can help to achieve this.\"\nWill signs letter to support private and voluntary providers in early years childcare",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_search/content_12.html": "The Hilton & Sir Robert McAlpine Hilton & Sir Robert McAlpine Will Forster has been actively addressing safety concerns related to the Hilton Hotel and Conference Centre on Victoria Way, built by…\nCouncil Finance Will Forster has been instrumental in resolving Woking Borough Council's financial crisis, securing significant government support to reduce borrowing costs by £20 million…\nVulnerable Children Will Forster has been a vocal advocate for vulnerable children, particularly in the case of Sara Sharif. After her tragic death, he called for an urgent inquest to understand…\nTrains & South Western Railway Accessibility at Woking's train stations Every resident of Woking deserves the right to travel with dignity, ease, and independence. But for too many…",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns_trains/content_7.html": "Update from Will about SWR APPG\nThe APPG is a cross-party parliamentary group, that Will chairs, formed by MPs on the SWR lines to hold the company to account.\nEvery resident of Woking deserves the right to travel with dignity, ease, and independence.\nBut for too many people in our community—those with mobility challenges, parents with prams, older residents, and others—our local railway stations remain inaccessible and unwelcoming.\nWhile Woking’s main stations have reasonable access, our smaller stations—including Brookwood and Worplesdon—lack the essential facilities that make train travel possible for all. From steep staircases to the absence of step-free access, these barriers prevent too many people from using public transport, isolating them from work, education, healthcare, and social opportunities. .\nThis is unacceptable. Everyone, regardless of ability, should be able to use our rail network freely and safely.\nThis petition calls for:\nWe, the undersigned, call on South Western Railway to urgently address the accessibility failures at Woking’s smaller stations. We demand:\nThe APPG is a cross-party parliamentary group, that Will chairs, formed by MPs on the SWR lines to hold the company to account.\nLiberal Democrat MP, Will Forster, has announced that he has set up a new cross-party Parliamentary group aimed at empowering passengers by holding South Western Railway to account.\nWill chaired the Inaugural General Meeting (IGM) of the South Western Rail All-Party Parliamentary Group (APPG). The meeting brought together parliamentarians to address the future of SWR and advocate for a stronger, more sustainable rail network.\nWill Forster, Liberal Democrat Member of Parliament for Woking, has set up a cross party group in Parliament that will look at South Western Railway’s impending nationalisation and deal with issues passengers have raised.\nOur railways were once the pride of Britain, however rising fares and deteriorating service quality means this is distant memory. Commuters are increasingly finding themselves caught in a system that is unaffordable, unreliable, and unfair.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_news/content_8.html": "Open Letter to Karin Smyth, Minister for Medicines Supply\nWill co-signs an open letter, alongside Pancreatic Cancer UK, to raise awareness over the alarming shortages of Pancreatic Enzyme Replacement Therapy.\nWill co-signs an open letter, alongside Pancreatic Cancer UK, to raise awareness over the alarming shortages of Pancreatic Enzyme Replacement Therapy.\nWill visited Israel and Palestine because he wanted to understand more about the conflict. \"I wanted to push for peace, and I wanted to see how both myself and the UK can help to achieve this.\"\nWill signs letter to support private and voluntary providers in early years childcare\nWill has responded to many constituents who have gotten in touch with him over the Terminally Ill Adults (End of Life) Bill ahead of its 3rd reading in Parliament.\nWill has responded to constituents' concerns about the use of animals—particularly dogs—in scientific testing. Will calls for greater transparency, investment in alternatives, and the full recognition of animal sentience in UK law.\nWill Forster has spoken out against government plans to let the DWP access benefit claimants’ bank accounts, warning of serious privacy concerns.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns_housing-welfare/content_2.html": "Standing Up for Animal Welfare: Will Forster Responds to Calls to End Animal Testing\nWill has responded to constituents' concerns about the use of animals—particularly dogs—in scientific testing. Will calls for greater transparency, investment in alternatives, and the full recognition of animal sentience in UK law.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns_hilton-sir-robert-mcalpine/content_14.html": "Will Forster MP: “We Need Stronger Accountability for Construction Failures—Now”\nWill Forster MP is calling for urgent reforms to hold developers accountable and protect residents from ongoing construction failures in Woking and across the UK.\nWill Forster has been actively addressing safety concerns related to the Hilton Hotel and Conference Centre on Victoria Way, built by Sir Robert McAlpine.\nThe hotel has caused repeated road closures due to loose cladding panels, affecting local residents and businesses. Will has raised these issues publicly, held the construction firm accountable, and called for compensation for affected businesses.\nHe also advocated for an independent safety inspection to ensure the building's structural integrity. Will’s ongoing commitment is to ensure the safety and well-being of Woking’s residents.\nWill Forster MP is calling for urgent reforms to hold developers accountable and protect residents from ongoing construction failures in Woking and across the UK.\nWill writes about Woking's many building safety concerns to Alex Norris - Junior Minister for Building and Fire Safety.\nWill Forster MP recently visited the site to speak with the builders, push for a faster reopening, and advocate for compensation. Find out what he learned and watch the video update here.\nWill Forster, the Member of Parliament for Woking, has written to both residents and businesses in the town centre, urging them to share their stories of how the repeated closures of Victoria Way have affected them.\nWoking residents have been left battling gridlock, frustration, and delays as roadworks continue to wreak havoc on the town’s roads.\nVictoria Way has been closed once again due to falling cladding from the Hilton Hotel. I’ve written to Sir Robert McAlpine, demanding accountability, safety assurances, and compensation for the disruption caused. Woking deserves better.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns_council-finance/content_10.html": "Backing a Better Future for Surrey: Support for Three Unitary Councils\nWill joins fellow Surrey Liberal Democrats in backing plans for three new unitary councils in Surrey—offering a fairer, more efficient, and locally connected model for local government reform.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_contact/content_13.html": "Contact Will\nAs your local Liberal Democrat MP for Woking, I want to hear what matters to you. Please get in touch to let me know your priorities for our area and any issues you need help with.\nBy phone: 01483 66 29 35\nBy email: will.forster.mp@parliament.uk\nConstituency Office: Will Forster MP, One Crown Square, Church Street East, Woking, GU21 6HR\nParliamentary Office: Will Forster MP, House of Commons, London, SW1A 0AA\nSign up for email updates\nGet the latest news from Will Forster MP and the local Lib Dem team",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns_vulnerable-children/content_5.html": "Early Years and Childcare Providers\nWill signs letter to support private and voluntary providers in early years childcare\nWill Forster has been a vocal advocate for vulnerable children, particularly in the case of Sara Sharif. After her tragic death, he called for an urgent inquest to understand how authorities failed to protect her.\nWill also raised the issue in Prime Minister’s Questions, pressing for a comprehensive review of the circumstances surrounding her death.\nHe continues to push for a full inquiry, emphasising the need for systemic reforms to protect children and prevent similar tragedies in the future.\nWill signs letter to support private and voluntary providers in early years childcare\nOn 17th March 2025, Will spoke for Sara's Law in Parliament, calling for national standards in child protection.\nWill's statement on the Children's Wellbeing and Schools Bill\nWoking MP Will Forster has called for urgent reforms to child protection following the tragic death of Sara Sharif.\nThe sentencing of Sara Sharif’s father and stepmother for the horrific murder of their daughter is a moment of justice\nA powerful vigil was held in Woking to remember 10-year-old Sara Sharif, tragically taken too soon.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns/content_9.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_donate/content_11.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowWill Forster is working hard as Woking's Liberal Democrat MP. Make a contribution to Will's fighting fund today to help him campaign, stay in touch with residents and keep winning.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_about/content_4.html": "Will Forster\nLiberal Democrat MP for Woking\nWill Forster is the Liberal Democrat Member of Parliament for Woking.\nBefore being elected as Woking’s MP, Will served as Deputy Leader of Woking Borough Council and a Borough Councillor for Hoe Valley, and also the Lib Dem Group Leader on Surrey County Council and the County Councillor for Woking South.\nWill grew up in Goldsworth Park and Horsell, where he attended local schools including Horsell Church of England Middle School, Woking High School and Woking College. Will lived in Westfield for many years and he now lives by Woking Park with his sausage dog Toffee.\nWill was first elected to serve his local community as a Councillor in 2009. He is now in his fifth term as a County Councillor and fourth term as a Borough Councillor. Will was comfortably re-elected in the 2024 local elections and has the largest majority in Woking, a testament to his hard work for local residents.\nHe was delighted to become Deputy Leader of Woking Borough Council following the elections in May 2022. As Deputy Leader, Will stopped the controversial Victoria Arch widening scheme, ensured vital voluntary groups like Citizens Advice Woking and Woking Community Transport received financial support and lead the consultation about the Sheerwater Regeneration.\nIn 2018 to 2019, he was honoured to serve as the Mayor of Woking, during which time Will strongly supported the Borough's voluntary sector and raised tens of thousands of pounds for his Mayoral Charity, the York Road Project, which helps local homeless people.\nSign up for email updates\nGet the latest news from Will Forster MP and the local Lib Dem team",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_volunteer/content_15.html": "Volunteer\nHelp Will make a difference for Woking\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_willforster_co_uk_/https_www_willforster_co_uk_wills-campaigns_healthcare/content_6.html": "Open Letter to Karin Smyth, Minister for Medicines Supply\nWill co-signs an open letter, alongside Pancreatic Cancer UK, to raise awareness over the alarming shortages of Pancreatic Enzyme Replacement Therapy.\nWill co-signs an open letter, alongside Pancreatic Cancer UK, to raise awareness over the alarming shortages of Pancreatic Enzyme Replacement Therapy.\nWill has responded to many constituents who have gotten in touch with him over the Terminally Ill Adults (End of Life) Bill ahead of its 3rd reading in Parliament.\nWhen announcing their autumn budget, Labour pitched their fiscal plans as investing in our NHS. Whilst the announcement of increased funding is something that I welcome, it feels like the government has given robbed Peter to pay Paul.\nLabour budget will cost Woking’s main health service provider half a million says MP"
}