{
  "https_allisongardner_co_uk/https_allisongardner_co_uk_press/content_9.html": "Collinson Court Closure (pdf)\nNatWest Closure (pdf)\nAJM Wheelchair Provision (pdf)\nGhost Plates (pdf)\nTittensor Road Safety (pdf)\nCopyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS\nPowered by\nWe use cookies to analyse website traffic and optimise your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_allisongardner_co_uk/https_allisongardner_co_uk_about-me/content_3.html": "I previously worked with the NHS as a Senior Scientific Adviser for Artificial Intelligence. I also served as a director of 'Women Leading in AI' and worked internationally with governments and organizations such as the UN to advocate for the ethical use of Artificial Intelligence.\nBefore this, I spent over 25 years as a Science and PSHE teacher in secondary schools. During that time, I completed a PhD in Molecular Biology (for fun!) and later lectured at Keele University, where I led the Data Science Degree Apprenticeship programme.\nI spent six years as a councillor in Newcastle-under-Lyme, where I also served as Chair of the CLP. I was the campaign coordinator for the 2017 general election, achieving a remarkable victory against all odds. Additionally, I was one of the leading campaigners to save Bradwell Community Hospital and have earned respect across North Staffordshire for my passionate commitment to the area.\nAs a 'military baby,' I was born in Singapore, where my Navy father was stationed, but I was raised by my Irish mother, who worked as a factory manager. I credit my mum, who began her working life as a cleaner, for instilling in me a strong work ethic, resilience, and determination to succeed.\nChampioning equality and fairness:\nI believe we should all be treated with dignity and respect, that diversity is to be celebrated and we are all valued.\nFighting for social justice:\nI believe in standing up for the most vulnerable and tackling poverty and injustice wherever we find it.\nEmpowering communities and engaging people:\nI believe in thriving communities with the resources to work together to achieve a better quality of life for all.\nDefending and growing our public services:\nI believe in high quality, accessible services to meet the needs of our communities and our people at their heart.\nHope for all our futures:\nI believe in the politics of hope that enables people to transform their lives and our environment for a fairer, greener and happier future.\nCopyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS",
  "https_allisongardner_co_uk/https_allisongardner_co_uk_my-campaigns/content_7.html": "Every campaign is driven by your priorities, and I am committed to delivering results that benefit our community. Stay updated on my latest campaigns and find out how you can get involved to help build a brighter future for everyone.\nOur pubs are at the heart of our communities, places to gather, celebrate, and connect. That’s why I launched my pub campaign: to listen to landlords, support local businesses, and raise awareness of the challenges facing the hospitality sector.\nJoin my fight to secure an integrated care hub in Longton to help everyone get the care they deserve. One of the many Stoke South campaigns that will benefit you and your community.\nJoin me and Tittensor residents as we fight to secure a crossing across the busy A34\nCopyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS",
  "https_allisongardner_co_uk/https_allisongardner_co_uk_privacy-policy/content_2.html": "As your MP for Stoke-on-Trent South it is vital that I and my office can keep you updated and informed, work on casework and gain valuable insight into your views. At my office, we value your privacy. This Privacy Policy outlines how we collect, use, and protect your personal data when you contact us, use our website, or engage with us in relation to parliamentary duties. We are committed to handling your information responsibly and transparently in accordance with the General Data Protection Regulation (GDPR) and other applicable data protection laws.\nWhat Information We Collect\nWe may collect personal information such as your name, address, email address, and phone number to assist with your enquiries. When you seek assistance or request casework, we may also collect details related to your specific issue, which could include sensitive data. Additionally, we keep records of correspondence via email, phone, or post to ensure a seamless and effective resolution of your concerns. If you interact with our website, we may collect cookies and analytics data to improve user experience. If you subscribe to newsletters, articles and petitions you will be asked for consent to correspond with you via email, you can withdraw consent at any time.\nThe office of Allison Gardner MP will only use your personal information for the purpose of which you have provided it i.e. casework or subscribing to newsletters/petitions.\nThe electoral register for Stoke-on-Trent South is a legal entitlement as the MP, this includes full names and addresses of every registered elector. This may allow me to contact you via post about ongoing campaigns, progress and other activities as your MP. None of the data you provide will be used for decision making or profiling.\nHow We Use Your Information\nThe information we collect is used to respond to your enquiries and provide the support you require. This may include addressing issues in your local area or assisting with casework as part of our parliamentary duties. We also use your information to represent you as your Member of Parliament (MP) in parliamentary matters. In some instances, where consent has been given, we may use your details to share updates or communicate information about our work in your constituency, including newsletters, articles and petitions.\nSharing Your Information\nTo effectively carry out casework on your behalf, we may need to share relevant details with third parties. These may include government departments, local councils, health services, utility companies, or other public bodies. We ensure that only the minimum information necessary is shared and that it is done securely. Sharing your data is always with the aim of resolving your case or addressing your concerns.\nApart from the instances outlined above, your data will never be shared without your consent.\nData Storage and Security\nThe office of Allison Gardner takes all appropriate measures to protect your data, including secure systems. Your information will be stored only for as long as it is necessary to fulfill the purpose for which it was collected or to comply with legal obligations.\nIf you have subscribed to newsletters, articles or petitions your information will be stored while I am your MP, you can withdraw this at any time and you will no longer be contacted with content about my progress.\nYour Rights\nUnder data protection laws, you have several rights, including the right to access the personal data we hold about you, the right to request corrections or updates, and the right to ask us to delete your data when it is no longer necessary. You can also object to the processing of your data in specific circumstances. If you wish to exercise any of these rights, please contact us using the details provided below.\nChanges to This Policy\nWe may update this Privacy Policy from time to time. Any changes will be published on our website.\nContact Us\nIf you have any questions about this Privacy Policy or how your data is handled, please contact:\nEmail: allison.gardner.mp@parliament.uk\nAddress: 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS\nCopyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS",
  "https_allisongardner_co_uk/https_allisongardner_co_uk_in-parliament/content_6.html": "I spoke in Parliament about road safety in Stoke-on-Trent South, particularly in our villages\nI raised key concerns about Tittensor, Hilderstone Road, Beech, and Weston Coyney\nA huge thank you to all the dedicated constituents who work tirelessly on local road safety campaigns. We’ll keep fighting for safer roads for everyone\nTo the businesses and workers of Stoke-on-Trent South. I will always give you a voice in parliament. This Labour government will see that businesses thrive and grow.\nYesterday I asked the Chancellor if she would meet with me to discuss the potential of targeted investment and a growth plan to see the A50/500 corridor generate 18,000 jobs to Stoke-on-Trent.\nI was pleased to hear in response to my colleague David Williams MP’s question, about the investment in buses for Stoke-on-Trent\nEveryone in Stoke-on-Trent is determined to see our area flourish.\nStoke-on-Trent is a vital link to Crewe and Derby but we were greatly affected by the plans of HS2.\nFuture developments must not impact our vital region\nThe fight for human rights in Jammu and Kashmir is incredibly important, and we must continue to highlight their struggle and stand in solidarity with those seeking justice and peace.\nI will continue working in Parliament to ensure the voices of the Kashmiri people are heard and their rights defended. No one should be denied freedom, dignity, or justice.\nI have been working for a number of months to ensure that people get the wheelchairs they need. Today I asked the Leader of the House, Lucy Powell, if she will allow time to debate the many challenges regarding wheelchair provision.\nThe hard work of locals in Longton, including Longton Exchange Shopping Centre and Urban Wilderness CIC, has turned the quiet town into a bustling centre.\nHowever Longton deserves more investment to showcase its full glory.\nI will continue to highlight the importance of local high streets\nCopyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS",
  "https_allisongardner_co_uk/https_allisongardner_co_uk/content_1.html": "I settled in North Staffs to be near family, to continue my career as a teacher and lecturer in AI and am now proud to work with our NHS. I am determined to repay the warm welcome I was given as your effective, hard-working Member of Parliament.\nI'm local, experienced and the fresh start we need.\nI have the broad local, national and international experience that our new Stoke-on-Trent South constituency needs in its Labour MP. I have a vision for Stoke South to be a happy, healthy and prosperous place to live. We can build on our proud industrial and rural heritage to maximise our economic potential in this new technological age.\nFor the People of Stoke-on-Trent\nCopyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS",
  "https_allisongardner_co_uk/https_allisongardner_co_uk_news-1/content_8.html": "Copyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS\nPowered by\nWe use cookies to analyse website traffic and optimise your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_allisongardner_co_uk/https_allisongardner_co_uk_my-priorities-1/content_5.html": "Business, skills and secure jobs\nEducation and children's services\nBusiness, skills and secure jobs\n- Work with our retail businesses and councils to re-energise our high streets learning, for example, from the success of Longton Exchange and Stone town centre.\n- Attract investment from manufacturing and services businesses to provide secure, well-paid jobs.\n- Maximise our growing potential as a centre for green, medical and agricultural technology.\n- Build a strong focus on apprenticeships and developing social contracts with our business sector.",
  "https_allisongardner_co_uk/https_allisongardner_co_uk_contact-1/content_4.html": "My priority is supporting the people of Stoke-on-Trent South and working to improve the quality of life for everyone in our communities. If you need assistance, please reach out via email.\nFor casework, visits and press enquiries please email allison.gardner.mp@parliament.uk Write to: Allison Gardner MP, House of Commons, London, SW1A 0AA For Labour Party related campaigns and CLP allison@allisongardner.co.uk\nSign up to hear from me.\nCopyright © 2024 Allison Gardner - All Rights Reserved.\nPromoted by Barry Schofield on behalf of Allison Gardner both at 69 The Strand, Longton, Stoke-on-Trent, ST3 2NS"
}