{
  "http_www_ridgewayvillages_co_uk_/http_www_ridgewayvillages_co_uk/content_1.html": "Thank you for visiting my website for the Ridgeway Ward!\nI am Gary Sumner and I have been proud to be your Borough Councillor for the Ridgeway Ward since 2016.\nResidents were kind enough to re-elect me in May 2024 with over 55% of the vote.\nI continue to serve you both as a Borough Councillor and in Wanborough also as a Parish Councillor.\nPlease contact me by email gary@ridgewayvillages.co.uk or call me on 01793 790814 if I can help you?\nI am very proud to represent the fantastic residents of Wanborough (incliding Redlands Grove & Foxhill), Bishopstone (with Russley Park), Hinton Parva, Liddington & Badbury (incl. the GW Hospital and about 120 homes at Badbury Park, Coate).\nThere are around 1600 homes in Ridgeway Ward.\nRidgeway Ward is a Borough Council Ward within the Borough of Swindon, Wiltshire\nand I am the Conservative Member elected to represent the Ward in 2016, 2021 and 2024.\nPromoted by Gary Sumner of Swindon Conservatives, PO Box 4405, SwindonSN3 9FZ",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-ward_liddington/content_19.html": "Cllr Gary Sumner\nRidgeway Ward\nBlenheim Wanborough Swindon SN4 0AW\nTel: 01793 790814 E-mail: gary@ridgewayvillages.co.uk\nOr use our contact form.\nTweet this page",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-ward_badbury-park/content_6.html": "I was able to agree the closure of Day House Lane as part of the £17.2m Junction 15 improvements.\nThis will create a safer environment for cycling, walking and equestrian use and provides a suitable rural route as access to Coate Wate Country Park.\nI will also ensure that the access from Marlborough Road is safe and doesn't compromise this use.\nBUS SERVICES: Have gone out to tender and are likely to commence (subject to the developers helping us with a turn-around area) in July 2021.\nSPEEDING: Concerns being fed back to developers who are responsible for the roads until adopted.\nALLOTMENTS: We know you want to start digging. We need the developers management company legal agreement signed off before they are handed over. Parish Councillor William Horley lives in Badbury Park and has met with residents forming an allotment group to manage their creation/allocation.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-news/content_9.html": "The Local Government Boundary Commission have announced their final recommendations for Borough Council Ward Boundaries in Swindon.\nIn our area Ridgeway & Chiseldon becomes a two member ward, which was supported by both Labour & Conservatives. This is a logical Ward with similar villages.\nBadbury Park (the element in Ridgeway Ward) moves to a new Badbury Park, Liden & Eldene Ward.\nParish boundaries remain unchanged.\nThis will take effect from May 2026. It is subject to Parliamentary approved by May 2025.\nhttps://www.lgbce.org.uk/all-reviews/swindon#54416\nThere are a number of other changes throughout the Borough. The review was triggered by the need for councillors to represent a similar number of predicted residents in 2030.\nDanny Kruger MP is the MP for the East Wiltshire constituency which covers the Ridgeway Ward villages, the hospital and part of Badbury Park.\nContact details for your MP Danny Kruger and the Association Office:\nEast Wiltshire Conservative Association (EWCA)\n23-24 The Parade\nMarlborough\nWiltshire\nSN8 1NE\nTel: 01672 556238\noffice@eastwiltshireconservatives.org.uk\nwww.eastwiltshireconservatives.org.uk\nfacebook.com/EastWiltshireConservatives\nDanny Kruger and his team have moved to:\nSSI House\nFordbrook Business Centre\nPewsey\nSN9 5NU\nTel: 01672 551171\ndanny.kruger.mp@parliament.uk\nwww.dannykruger.org.uk\nfacebook.com/dannykrugerwiltshire\n<\nThames Water update from Scrutiny meeting where I was able to question them on their ability to serve the New Easter Villages and also progress with the Wanborough Sewage Treatment works:\nThames Water confirmed that the pumping station required to manage waste from the New Eastern Villages has gained consent from SBC. They now must work through conditions and reserved matters but anticipate being on site this winter.\nContext/ Swindon NEV - Terminal Pump Station scope:\nThe current terminal pump station scope comprises of the following elements (from source to treatment):\n▪ A common gravity main sewer section in the NEV development area to facilitate developer connections\n▪ A deep gravity sewer tunnel crossing of the A419\n▪ A new pump station including associated infrastructure\n▪ Construction of temporary & permanent operational compounds\n▪ Reinstatement/ replanting and +10% Biodiversity Net Gain betterment across the NEV development zone\n▪ A 1st phase growth rising main – to discharge to the existing network in Covingham Drive - 40m away (this first phase element will serve approximately one quarter of the NEV house-building so for now this will be enough to serve Redlands, Foxbridge, Lotmead etc.\n▪ A 2nd phase growth rising main – via Covingham Drive & the B4006, to discharge to the existing network in Greenbridge Retail Park – 2.4km away\nNote – there are no direct benefits to existing Thames Water Customers relating to this new pump station and it is to be 100% funded by infrastructure charges, paid via new housing connection agreements. However, this essential infrastructure is a fundamental enabler of the socio-economic benefits of the SBC NEV masterplan, in the area.\nThames confirmed they will fund the project and reclaim the cost from the developers in due course.\nCompletion of the new pumping station and connection to Greenbridge is anticipated Summer 2026.\nWANBOROUGH SEWAGE TREATMENT WORKS:\nAn upgrade is planned for Wanborough STW. This will improve its ability to treat the volumes of incoming sewage, reducing the need for untreated discharges in wet weather. The scheme is due to complete in late 2024. We also anticipate further work on improving effluent quality in the next asset planning period (2025 - 2030), subject to final Determination, and will provide more detailed information once the work schedule is confirmed. This will allow the works to take the temporary connection from Redlands Grove but will increase overall capacity.\nRecycling collections:\nAdditional new blue recycling bags for plastics/cans can now be ordered online (for free) as well as additional recycling boxes using the following link: https://www.swindon.gov.uk/info/20015/bins_rubbish_and_recycling/1319/changes_to_waste_and_recycling_collections\nFood waste caddies came with a limited supply of biodegradable bags but you can purchase additional ones very cheaply at supermarkets or online.\nRecycling days:\nYou can look up your recycling days using the following weblink which will tell you what to put out and when:\nhttps://www.swindon.gov.uk/info/20122/rubbish_and_recycling_collection_days\nDear Councillor Sumner,\nI am writing to inform you of the upcoming Informal consultation for your applications to introduce a 20mph Speed limit in the above locations.\nThe informal consultation will run from Monday 3rd July 2023 until Monday 24th July 2023, and all information including letters, plans and guidance will be available on the Swindon Borough Council TRO Website at:\nhttps://www.swindon.gov.uk/info/20135/traffic_management/657/traffic_regulation_orders_tros/2\nWe will use the councils social media channels and communications team to advertise the consultation to residents.\nThe number of and size of the schemes unfortunately make an individual letter drop to households commercially unviable.\nIt would therefore be helpful if you could assist in making your residents aware of the consultation through your own local communication channels. Copies of the consultation documents are attached for information.\nComments received will be via a form which will ask for the residents contact details, and whether they object or support the proposal.\nOnce the consultation has finished I will pass on a summary of the comments for us to agree the best way forward.\nThanks.\nSam Wright BEng MSc FCIHT\nSenior Transport Engineer\nDear Councillors Elliott, Jefferies & Sumner,\nThank you for your application to introduce a 20mph Speed Limit in Badbury Park. The Speed Survey results have been collected and analysed. Please find a summary slide for your schemes attached to this email showing how it scored against the various assessment criteria approved by Cabinet.\nOur records show that the streets identified within the application are not currently adopted by the council. We will need to work with our colleagues in the Highway Adoptions Team to understand the current legal status of the roads and the implications of seeking to introduce a 20mph speed limit at this stage in the development. We will update you further as to our progress in the New Year.\nAny further questions please just let me know. If you would like a meeting to discuss this in more detail then I am happy to arrange on Teams or at the Civic Offices.\nRegards,\nSam Wright BEng MSc FCIHT\nSenior Transport Engineer",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_useful-links/content_23.html": "Contact details for your MP Danny Kruger and the Association Office:\nEast Wiltshire Conservative Association (EWCA)\n23-24 The Parade\nMarlborough\nWiltshire\nSN8 1NE\nTel: 01672 556238\noffice@eastwiltshireconservatives.org.uk\nwww.eastwiltshireconservatives.org.uk\nfacebook.com/EastWiltshireConservatives\nDanny Kruger and his team have moved to:\nSSI House\nFordbrook Business Centre\nPewsey\nSN9 5NU\nTel: 01672 551171\ndanny.kruger.mp@parliament.uk\nwww.dannykruger.org.uk\nfacebook.com/dannykrugerwiltshire\nPot-holes, fallen trees, fly tipping, housing repair, faulty streetlight, blocked drain or gulley, lost pet?\nReport a problem online to Swindon Borough Council in a few easy clicks - you will then be able to choose the service area you are looking for: REPORT ONLINE TO SBC\nMissed bin collection? Click on the link below:\nOnce reported the usual advice is to leave out where possible for collection.\nDog fouling is illegal!\nReport an offender to\nSwindon Borough Council:\nHealth contacts\nCare First - 0800 174319 24 hr advice & counselling by phone\nNHS 111 – 24 hrs also for emergency dentist (although no dental treatment, only offering advice) https://111.nhs.uk/\nSwindon My Life Portal - https://localoffer.swindon.gov.uk/content/staying-healthy/staying-healthy-content/mental-health-content-pages/mental-health-services/\nThe Samaritans - 08457 909090 or jo@samaritans.org\nSANE Mental Health helpline – 0845 767 8000 - The Mental Health helpline offers emotional support and information to those experiencing mental health difficulties, their families and carers. Available 6pm-11pm 7 days per week.\nNSPCC helpline – 0808 800 5000\nNational Domestic Violence helpline – 0808 2000 247\nWillows Counselling Service ‘Support the Community’ Campaign - https://www.facebook.com/WillowsSwindon/\nMarie Curie support line - 0800 090 2309 or visit mariecurie.org.uk/support\nVolunteer and helpline services\nSwindon Support Network - www.swindonsupport.uk or call 07564 073931\nVoluntary Action Swindon. http://vas-swindon.org/ 01793 538398\nWiltshire Community Foundation. https://www.wiltshirecf.org.uk/ 01380 729284\nThe Harbour Project. http://harbourproject.org.uk/ 01793 611682\nFood Guidance List\nSwindon Food Collective – 07932 108732\nSwindon Night Shelter – 01793 613166 admin@swindonnightshelter.org.uk\nScrapstore – 01793 513982 // 07739 023290\nRoyal Voluntary Service – 07342 076383\nswindonsupportservices@royalvoluntaryservices.org.uk\nSwindon Volunteers - facebook.com/groups/swindonvolunteers/ swindonvolunteers@gmail.com\nHOW TO REPORT AN EMERGENCY and to whom should you report it? Click on the link below:\nThe response to an emergency usually involves a number of different organisations all of whom work closely together to co-ordinate an effective response.\nPlease note, in an emergency telephone 999\nThe following websites may provide useful help and advice during, and prior to, an emergency situation:\nand their website is:\nhttp://www.ramsburyandwanboroughsurgery.com/\nPlaces to stay or eat & drink - we have some fantastic places to enjoy within the Ridgeway Ward:\nhttps://helenbrowningsorganic.co.uk/royal-oak/\nhttps://www.brewers-arms.co.uk/\nhttps://villageinn-liddington.co.uk/\nhttps://www.facebook.com/newcalleyarms/\nhttps://theploughonthehill.com/\nhttps://www.bakersarmsbadbury.co.uk/\nhttps://www.burjrestaurant.co.uk/wanborough/\nWhat should the public expect from a Parish Council:\nhttp://askyourcouncil.uk/openness-and-accountability/\nand what principles should guide their decision making and conduct?\nhttp://askyourcouncil.uk/understanding-your-council/the-nolan-principles/\nClick here for Sir Robert's website\nTel: 01793 533393\nEmail: robert.buckland.mp@parliament.uk",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ward-councillor-surgeries/content_13.html": "Gary Sumner is your Ridgeway Ward Councillor: My monthly Ward Surgeries are at Wanborough Village Hall on the following Saturdays 9-10.00am\n25/01/25 9-10.00am @ Wanborough Village Hall\n22/02/25 9-10.00am @ Wanborough Village Hall\n29/03/25 9-10.00am @ Wanborough Village Hall\nNo Ward Surgery in April due to the Scarecrow Trail\n31/05/25 9-10.00am @ Wanborough Village Hall\n28/06/25 9-10.00am @ Wanborough Village Hall\nNo Ward Surgery in July\n30/08/25 9-10.00am @ Wanborough Village Hall\n27/09/25 9-10.00am @ Wanborough Village Hall\n25/10/25 9-10.00am @ Wanborough Village Hall\n29/11/25 9-10.00am @ Wanborough Village Hall\nNo Ward Surgery in November\nWard Councillor surgeries are an informal way to catch up & popular with many who want to have a chat. If it's anything more urgent then call me.\nPlease call Gary on 01793 790814\nEmail: gary@ridgewayvillages.co.uk\nWebsite: www.ridgewayvillages.co.uk\nFacebook: @RidgewayVillages",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-ward_badbury/content_22.html": "Some important Highways repairs for Spring/Summer 2021 for which I have pushed and which have been secured as part of the 'Challenge Fund 2' for Highways:\nBadbury Lane (Ridgeway Ward):\nLocation: Through 's' bends west end of village\nCondition: Significant micro wear and delamination.\nOutcome: Full carriageway width surface course replacement for approx. 150m length through 'S' bends.\nBadbury Lane (Ridgeway Ward):\nLocation: M4 overbridge to east village boundary\nCondition: Significant micro wear and delamination.\nOutcome: Full carriageway width surface course replacement for approx. 220m length.\nBadbury Park: Day House Lane will be closed from Monday 10th August - this was originally envisaged in the consent for Badbury Park and is implemented as part of the works to upgrade Junction 15 of the M4 as part of the £17.2m project.\nDuring the Junction 15 scheme I've arranged for a 'No Right Turn' from the Marlborough Road north-bound to prevent rat running from motorists seeking to avoid queues up to Jn15.\nSignage will reflect this and I hope that once the M4 Junction 15 scheme is completed we can all use this beautiful lane for safer walking, cycling and horse-riding.\nThis should cut traffic into the village of Badbury by a large amount. A small amount of inconvenience, but far more people complain about the vehicles using the village.\nGary Sumner\nYour Ridgeway Ward Borough Councillor",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-highways-news_wanborough-traffic-calming/content_2.html": "A consultation on double yellow lines and no waiting restrictions in The High Street, Wanborough was held, as part of the Wanborough Traffic Calming Scheme. The Consultation generated 14 objections - none of which were considered sufficient reason to cancel the heritage 'double primrose lines' as part of the traffic calming scheme.\nThe Scheme is now approved and implimented.\nWanborough Traffic Calming Scheme:\nThis scheme was funded as part of the Southern Connector Road project at a cost of around £600,000. It is a one-off opportunity to introduce features which will not ruin the feel of the village High Street, but will make it less appealing to 'rat runners' who we hope will use the new Southern Connector Road.\nIf the scheme didn't proceed there will be no funding available in future, apart from competing with other road safety requests across the Borough.\nThis is an unprecedented investment in road safety/traffic calming in the village and something which I personally spoke for at the time the New Eastern Villages was allocated.\nWanborough Traffic Calming Scheme update 28/1/22:\nDear Councillor Sumner,\nIn response to your email and discussions we have had today please see the below:\nThe scheme undertook a consultation process, which is in line with the Councils protocol for such events. At the time of consultation we were in the height of the 2020 COVID pandemic and as such undertook an online consultation event for six weeks. The event ran from the 6th July to 17th August 2020. Through the consultation we received up to thirty responses from local residents which were all captured and an initial response was published online. The publication is still available online now: https://www.swindon.gov.uk/info/20161/nev_transport/1165/wanborough_traffic_calming_scheme\nResidents, and members of the wider public were encouraged to participate in the online consultation. They were informed through a series of Social Media advertisements, pages in the local Wanborough Monthly Newsletter, Liaison with the Ward Councillor and Parish Councillors and hard copies available at the Civic Offices. Highlighted in the consultation, the scheme is programmed to commence in Winter 2021-22. Separate meetings were held in December 2020 between the Parish Council and Ward Councillor to present proposals and discuss feedback.\nBetween the consultation and now, we have refined the design, undertaken Road Safety Audits, completed surveys and investigations on the drainage, carriageway and utility searches. Residents directly adjacent to the High Street were notified of the survey works required for the scheme through letter dropping in July 2021. All residents who have requested on site meetings have had the opportunity to meet with Officers and yourself. Ongoing correspondence with the Parish Council and Ward Councillor has continued via email correspondence.\nThe final Road Safety Audit process was completed in December 2021 and detailed plans of the scheme were first shared with stakeholders on the 20th January 2022. The WTC scheme requires a number of new TROs, which will be advertised in accordance with the Councils policy for TRO applications starting mid-March 2022. During this consultation process residents will be able to give feedback on the scheme TRO’s. The scheme is due to be completed in August 2022. Philip or Suzanne cc’d in will be able to give you the duration of the advertisement of the TRO’s and further details if objections to TRO’s are made. I have been informed that 5 months is sufficient for the TRO’s to be processed.\nKind regards\nLaura\nDue to the developent of Redlands the Wanborough Road (as part of that consent) will be narrowed, traffic calmed and have a pavement installed.\nIt will make it a safer road that the one we have now, but the price of that safety is lighting.\nI objected, as did most of the Parish Council but the road safety audit is independently assessed - please see the email below.\nDear Councillor Sumner,\nFurther to the meeting on 6th September, we note the concerns raised in relation to the street lighting proposed for Wanborough Road and the potential impact on the village.\nAs can be seen from the attached plan, the street lighting is proposed for the primary junction with Redlands, as well as either side.\nIn terms of towards Wanborough Village, the plan illustrates the street lighting would be located between the Redlands access and just after the traffic calming chicane, rather than continuing all of the way to the village.\nThe reason behind the street lighting extending to the proposed chicane is that there would be a safety concern were the key conflict areas, such as the junction / traffic calming, to not be illuminated.\nThe guidance from Institute of Lighting Professionals refers to the ‘five second rule’ which seeks to avoid road users transitioning from lit areas into dark areas and back to lit areas – as there is a risk that drivers eyes may not fully adjust to the differing lighting conditions and this may pose a risk to pedestrians or other users in the street.\nAn independent body undertaking a review of the Road Safety Audit (RSA) also advised this approach.\nSince the meeting, Officers have reviewed potential measures to mitigate any potential impact from of the proposed street lighting. These include enabling the lights to be dimmed. Highways Officers have reviewed this and confirmed that the dimming controls outlined on the plan could be implemented in accord with safety guidance, and will be controlled by a Central Management System (CMS).\nFurther to this, Highways Officers have also investigated the use of baffles on the street lighting, which would further minimise any potential light spill. Whilst these are not used frequently due to the characteristics of LED lighting, and are only fitted in specific circumstances, Officers have requested that the developers install baffles on the proposed street lighting along Wanborough Road from the outset.\nWhilst Officers note the concerns raised, highways safety reasons have made it clear that street lighting is required by this scheme.\nHowever, to minimise any potential impact from street lighting, Officers have sought to locate street lamps only where they are essential for safety reasons, as well as secure other mitigation such as dimming and baffles.\nOn this basis, Officers will look to finalise the scheme with the developers based on the above / attached.\nWanborough traffic calming scheme\nAs part of the New Eastern Villages (NEV) development, a comprehensive access strategy has been developed to ensure that the surrounding area does not suffer from the effects of additional traffic. One such measure is a new link road, the Southern Connector Road (SCR), which will provide access to the new development from Commonhead and Pack Hill. In order to ensure there is not an increase in inappropriate through traffic in Wanborough and the surrounding villages, the junctions on the SCR have been designed to prohibit movements that could be used as rat-runs. To further discourage through traffic, the council proposes to install traffic calming measures within the village itself, these proposals are detailed below.\nTraffic calming proposals\nThe scheme aims to reduce speeds and make the route less desirable for inappropriate through traffic with the use of traditional engineering solutions and psychological traffic calming, whilst also respecting the distinct character of the village.\nChanges to the High Street include:\nChanges to Pack Hill include:\nChanges to Rotten Row include:\nChanges to The Marsh and Burycroft include:",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-highways-news/content_14.html": "Traffic movements at the new junction of SCR (Southern Connector Road) and Wanborough Road explained:\nTo explain the permitted traffic movements on the junction with Wanborough Road. This has been carefully considered to allow existing residents to travel between Wanborough and Covingham as we always have done. It will allow a left turn onto the SCR to provide good access for the new residents living at Redlands Grove and to allow them to return home without driving through the village. It will not allow traffic from Covingham to turn right onto the SCR as this would encourage more traffic along the Wanborough Road and discourage residents from Covingham and Stratton from using the improved White Hart junction and to access the A419 there.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_redlands-grove/content_21.html": "I have had some queries from new residents about GP provision as the Merchiston Surgery website was stating that Redlands Grove wasn't covered.\nI contacted the Head of Public Health and can provide the following:\nAs an update, Merchiston have now confirmed that they have changed the postcode checker on their website to the NHS checker. Staff are aware that they cover the Eastern Villages and the patients they were aware of have been notified and registered.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk/content_15.html": "Thank you for visiting my website for the Ridgeway Ward!\nI am Gary Sumner and I have been proud to be your Borough Councillor for the Ridgeway Ward since 2016.\nResidents were kind enough to re-elect me in May 2024 with over 55% of the vote.\nI continue to serve you both as a Borough Councillor and in Wanborough also as a Parish Councillor.\nPlease contact me by email gary@ridgewayvillages.co.uk or call me on 01793 790814 if I can help you?\nI am very proud to represent the fantastic residents of Wanborough (incliding Redlands Grove & Foxhill), Bishopstone (with Russley Park), Hinton Parva, Liddington & Badbury (incl. the GW Hospital and about 120 homes at Badbury Park, Coate).\nThere are around 1600 homes in Ridgeway Ward.\nRidgeway Ward is a Borough Council Ward within the Borough of Swindon, Wiltshire\nand I am the Conservative Member elected to represent the Ward in 2016, 2021 and 2024.\nPromoted by Gary Sumner of Swindon Conservatives, PO Box 4405, SwindonSN3 9FZ",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_gigabit-fibre-delivered/content_7.html": "When you get the email that you can now order your Gigabit fibre service which companies can you use:\nThe link below is to the list of providers:\nhttps://www.openreach.com/fibre-broadband/fttp-providers\nFinally we have the news we've been working towards:\nIt's happening!\nI met with Openreach this morning together with Neil Richardson (who has been working with the Chiseldon residents) and we are pleased to confirm that we have now officially moved into the build phase of the project – we did it!\nIt is definitely happening!!!!\nGigabit Fibre is definitely coming to our two communities!\nAs many of you have seen Openreach engineers have been in the area finalising their plans for the rollout and we will learn over the coming weeks the timescales for delivery, we’ll share that info with you as soon as we can. In order to claim the voucher Openreach have a 12 month period before they expire and most were pledged late last year.\nIf you live in Wanborough & Liddington or Chiseldon you could still miss out if you haven’t pledged your voucher and for those who haven’t engaged, it may not be too late.\nGo to https://www.openreach.com/connectmycommunity to pledge.\nHouseholds who haven’t pledged or been part of the scheme may have to pay to connect to the new network later so whilst there is still an opportunity to use the free Government vouchers of £1500 for a home or £3,500 for a business it makes sense to take part.\nNeil and I continue to explore ways of getting the un-validated vouchers converted and letters will be going out to these people shortly, we are also looking at a method of validating vouchers by SMS instead of email. If you haven't received your voucher please email me again as Openreach can access the vouchers again.\nI would like to personally thank Rt Hon Robert Buckland QC MP who helped start this process from the first meeting he and I had with Openreach in April 2020 and celebrate the achievement through lockdown of promoting this! We have raised nearly £2m in pledges and Neil Richardson has been a fantastic advocate in Chiseldon, promoting and sharing the benefits, organising leaflets, as well as joining me on very regular briefings and workshops to achieve this.\nThank you to local printers (ESP Colour) who produced the Wanborough Leaflet for free and those helpers who did the deliveries.\nThis has also been a great community effort with many residents being Gigabit champions online and sharing the positive news with friends and neighbours, but please keep spreading the word to your friends/neighbours so nobody misses out.\nWe still have the other villages to address, and some missing streets and we are working on what can be attached to these schemes and what will have to be done separately under a new funding application.\nGary Sumner\nNeil Richardson\nRobert Buckland\nGary Sumner\nYour Ridgeway Ward Councillor",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-ward/content_12.html": "The Ridgeway Ward comprises the villages of Wanborough, Bishopstone, Liddington, Badbury, Russley Park, Foxhill, Hinton Parva and a small area of Badbury Park just South of the Great Western Hospital.\nInternational pig racing at Bishopstone - a yearly treat to behold!\nI helped with the tree planting at Manners Wood, Pack Hill, Wanborough - in the Area of Outstanding Natural Beauty. The first 1000 trees planted with the Woodland Trust and staff from Nationwide Building Society and got children from Wanborough Primary School involved in the second wave of planting.\nThe Ridgeway Villages are very special places but they will have completely different issues for residents. Public transport, getting to school, access to services which residents in urban areas proabably take for granted. I will be here for you to make sure that you get help from the right people in the right place. The countyside experiences different types of crime and social issues including isolation for some older residents.\nOur villages have many roads and hedgerows and in these difficult economic times it can appear that maintenance is required but not forthcoming. Whilst I can't promise to change everything I will try to be your voice to identify particular problem areas and for smaller items there will be a link to report items for attention to the Borough Council.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_data-protection-policy/content_3.html": "Councillors Privacy Notice\nWho we are: An elected Councillor may use your personal data to help you with ward-related matters, or for undertaking any casework about which you have contacted them.\nOur statutory Data Protection Officer is the Council’s Information Governance Manager who can be contacted at Swindon Borough Council Civic Offices, Euclid Street, Swindon SN1 2JH. They can also be emailed at dataprotection@swindon.gov.uk\nWhy we process your data: The Council’s elected Councillors can process your personal data under the Local Government Act 1972 and the Localism Act 2011, and under the Data Protection Act 2018 Schedule 1, Part 2, 18-19 (Elected Representatives responding to requests and Disclosure to Elected Representatives).\nIf you are making a request about a relative or third party, I may ask for confirmation from them that you have permission to share their personal information.\nCouncillors may process your data for the following purposes: To allow them to answer your enquiries and for the purpose of resolving issues that you have asked them to look into on your behalf.\nWho we share your data with - They may share the information:\nwith ward colleagues,\nCabinet Members or Committee Chairs,\nCouncil Officers, and/or\nthe local Member of Parliament.\nThis would be solely for the lawful purpose of resolving any issues that you have raised.\nThey may also sometimes share your data with the following organisations:\nOther public authorities and public partnerships (e.g. councils, schools, NHS providers, Police, government departments etc.) when there is a legitimate reason for doing so.\nHow we keep your data secure - The data is stored on an email system that is password protected. Access is through a laptop/tablet/phone that is also appropriately secure.\nAs soon as practicable, your information is passed to the relevant council officer, so that your data is protected within the Council’s secure IT infrastructure.\nFor paper records, these are appropriately secured in a locked case when not in use.\nThe Council’s elected Councillors do not transfer your data to third parties in other countries outside of the European Economic Area.\nHow long we keep your data for - The Council’s elected Councillors can keep your data for up to 7 years after your issue has been resolved, or until they cease to be a Councillor, if this is a shorter period of time.\nYour rights - You have the following rights:\nTo ask for a copy of the data that Councillors hold on you\nTo ask them to delete data on you that is no longer needed\nTo ask them to correct data about you that is wrong\nTo ask them to stop processing your data temporarily if you think it is wrong until they work out what is correct\nTo ask them to let you take a copy of your data in a portable format to another organisation\nIf you only gave your Councillor your data with consent, you also have the right to withdraw that consent at any time. Please just get in touch with us.\nHow to complain\nYou can complain to the Council in relation to elected Councillors. If you are not happy with the Council’s response, you can request a review, and if, after that, you are still unsatisfied, you can then take the matter to the Information Commissioner’s Office",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-ward_bishopstone-hinton-parva/content_10.html": "BISHOPSTONE:\nAn important Highways capital repair for Spring/Summer 2021 for which I have pushed and which has been secured as part of the 'Challenge Fund 2' for Highways:\nLocation: C149 Icknield Way, Bishopstone (Ridgeway Ward) - Nell Hill slip Eastwards through bend towards New Town Lane\nCondition: Significant micro wear and delamination.\nOutcome: Full carriageway width surface course replacement for approx. 150m length through bend.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_campaigns/content_16.html": "With the assistance of residents in leafleting and pledging to take up the scheme I have delivered GIGABIT FIBRE.\nStarting in April 2021 I held a first meeting with Openreach and just over 2 years later we have Gigabit Fibre in Wanborough and Liddington with the final parts now being completed. Foxhill couldn't be included but a bid is in for further Government funding and I will know more about this in the summer of 2024.\nThe £40m Southern Connector Road - is effectively a bypass for Wanborough to allow an estimated 1/3rd of the traffic from the 8,000 home 'New Eastern Villages' develoment to get to Commonhead roundabout and the M4 without connecting via Wanborough. Opening 2024.\nAs the Ridgeway Ward Councillor I know this is a fantastic help in minimising 'rat running'. I am now also the Cabinet Member for Strategic Planning and I also recognised that this is a great advantage in bringing forward development.\nThis is a £40m road to be delivered at no cost to Swindon residents.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_ridgeway-ward_wanborough/content_4.html": "Sadly not this year - but the annual Wanborough Summer Show is always a great event.\nInlands Farm 31-10-20 - definitely some flooding issues here! This 'lake' is quite a common site here.\nInlands Farm 31-10-20 - History locally tells us that a Water-mill (the stones of which are still visible) further along\nThe Marsh was fed by water from Liddington and the course of this water still regularly floods across Inlands Farm.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_contact/content_11.html": "Ridgeway Ward\nBlenheim Wanborough\nSwindon\nSN4 0AW Phone: 01793 790814 E-mail: gary@ridgewayvillages.co.uk\nNote: Fields marked with * are required\nCllr Gary Sumner\nBlenheim Wanborough Swindon SN4 0AW\nTel: 01793 790814 E-mail: gary@ridgewayvillages.co.uk\nOr use our contact form.\nTweet this page",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_about-gary-your-councillor/content_5.html": "I am the Leader of the Conservative Group at Swindon Borough Council.\nPrior to May 2023 I was the Cabinet Member for Strategic Infrastructure, Transport & Planning from 2018 to 2023.\nI was Deputy Leader of Swindon Borough Council from 2021 to 2023.\nI continue to represent the Ridgeway Ward and work as hard as I always have to look after my residents and the villages.\nI attend monthly Parish Council meetings in Liddington, Bishopstone and Chiseldon (for Badbury).\nI hold Ward Councillor Surgeries in Wanborough Village Hall monthly but also do these on occasions in Bishopstone and Liddington - all Ward residents are welcome to each:\nAs Ward Councillor I may attend up to four Parish Council meetings a month and do my best to add value and help where requested.\nOn the whole both the Parish Councils and residents benefit from this but I am more than happy to meet residents at other times more convenient to them.",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_climate-change-ecology/content_8.html": "Just a few of the projects from the Conservative administration which led the council until 2023:\nThere will always be change and any town that has substantial developments and highways proposals will have challenges, but we are doing our very best within current legislation to deliver developments that respect the countryside and enhance biodiversity where possible.\nIn Wichelstowe, we have amphibian and wildlife highways under new roads and substantial areas set aside as protected habitats. We have delivered additional sections of canal in addition to those already delivered in East Wichel and the first in Swindon in 100 years. These sections of canal are great wildlife habitats, with ambitions by the Canal Trust to connect to the sections in Wootton Bassett and beyond.\nWe are a leader in the Natural England District Newt Licensing Scheme with applications for new ponds and habitats in Mouldon Hill, Chiseldon and Bishopstone (on the farm belonging to the Chair of the Soil Association).\nAll major developments have to carry out detailed ecological surveys and provide management plans.\nOur new roads are providing wild flower roundabouts, verges, and miles of new native hedgerow and tree planting.\nWe have participated in the new ‘Trees for Climate’ Initiative and have ambitious plans to increase tree cover to 30% in the Borough. We have substantial funds for new tree planting in the New Eastern Villages.\nWe have our ‘Urban Meadows’ scheme which is now in its second year, working with Wiltshire Wildlife Trust increasing biodiversity by additional wildflower meadow planting and improving local watercourses such as Rivermead.\nFor the New Eastern Villages (NEV) we have already purchased land and planted 4000+ Trees and wild flower plugs. New paths and cycle routes will accompany the new roads. We have a major wildlife park within Lotmead to come forward and the NEV development will feature green corridors between the development islands as well as wetland areas and one of the greenest cycling/walking networks of any new development.\nThe above are a fraction of the measures under way in the Borough and we can be proud of our commitment to creating a greener Borough than the one we inherited and where we have the North Wessex Downs AONB and the Ridgeway Trail within our Borough Boundary.\nSwindon Borough Council has committed to going carbon neutral by 2030 as councillors step up the fight against climate change\nAt a meeting of the Full Council on the 23rd January 2020, members unanimously agreed a motion committing the Council to reduce its corporate carbon emissions, with the aim of making the Council’s estate and activities carbon neutral by the end of the decade.\nMembers voted to ensure the Council’s strategic decisions, budgets and approaches to planning decisions are in line with a shift to zero carbon by 2030.\nBy taking a lead in the climate change movement, it is hoped that the Council can inspire local businesses, residents and other organisations to take a similar approach.\nIn a show of widespread unity, the motion was supported by the Council’s Conservative, Labour and Liberal Democrat Groups.\nCouncillor Gary Sumner, Cabinet Member for Strategic Planning, said: “I am extremely pleased that this important motion, which demonstrates our commitment to protecting the environment, was passed unanimously by all members last night.\n“Climate change is, justifiably, right at the top of the political agenda at the moment, and this Council recognises how important it is for everybody to do their bit for the benefit of present and future generations.\n“We sincerely hope that this significant vote will inspire other businesses and organisations to work towards full carbon neutrality. We all have a long way to go but the will and commitment is there and the target has been set.”\nThe commitment to going carbon neutral by 2030 follows a number of actions the Council has taken in recent months to play its part in protecting the environment.\nA special Climate Change Working Group was established last year and quickly began thinking of actions. New parking standards in Planning will require every new house built in the borough to include charging points for electric vehicles; further investments in solar energy have been made; the Council has bought electric vehicles for its corporate fleet; installed electric vehicle charging points on the Civic campus; is investing in LED street lighting to save energy and has introduced a food waste trial to ensure that discarded food is properly disposed of.\nImportant links with organisations such as the Woodland Trust and Wiltshire Wildlife Trust have been forged with plans to increase tree cover across the borough over the next decade.\nThere is more to do and work has already started on assessing available options, but a carbon neutral Council will be a reality by 2030.\nGary Sumner – your Ridgeway Ward Councillor",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_inlands-farm-appeal/content_17.html": "On the 24th January the Planning Inspector published his decision with the most relevant paragraphs copied below:\n95. For completeness, there is a need too to carry out an overall planning balance. In my view, the environmental costs of the proposal, in relation to the character and appearance of the area, and the setting of the AONB, and the setting and thereby the significance of designated and non-designated heritage assets, are simply too great to allow them to be outweighed by the economic and other benefits prayed in aid of the proposals, even if those benefits are taken at their absolute highest.\n96. Put very simply, a scheme of this sort would be a great economic opportunity for Swindon, and indeed the UK, but in my view, the\nsite that has been chosen for it is quite fundamentally the wrong one.\nFinal Conclusion\n97. On that overall basis, it is my conclusion that the appeal should\nfail.\nMy closing remarks submitted to the Inquiry the day before the main Public Inquiry closed.\nCllr Gary Sumner\nThe Ridgeway Ward\nThe Planning Inspector\nC/O Helen Skinner\nThe Planning Inspectorate\nTemple Quay House\n2 The Square\nBristol, BS1 6PN\n30th June 2021\nAPP/U3935/W/21/3269667\nDear Sir,\nClosing remarks\nI am sorry that I was unable to attend the ‘alternative sites’ round table due to a spell in hospital (where ironically, on the third floor of Great Western Hospital I have an outstanding view from my bed towards the appeal site, with the village of Upper Wanborough nestling atop the hill and with Lower Wanborough also visible). The features of the farmed field and pastures of the AONB are stunning and if this is not a key view of your visit, may I suggest it is included.\nHaving attended many of the sessions I have been impressed by the process and interesting disclosures, although as information has been disclosed the ‘Science Park’ is not quite the Pharma led iconic concept, but a theoretical tech park such as exists in many locations and which do not require a pharmaceutical packaging company to anchor them.\nThe case for ‘co-location’ was not well made in light of the above and as officers from SBC have confirmed (and I tend to agree) the ‘Technology Park’ element is highly speculative.\nFor example the Economic benefits on employment were provided by Wasdell, with no supporting evidence and were not challenged by Mr Amos, even though they suggested a density of jobs double the expected average for use. No evidence of any R&D evidence has been presented. The ‘LinkedIn’ profile for Wasdell is rather light on their ‘Science park’ specialism as attached and again this is relevant to ‘suitability’ to insist the proposals should sit side by side.\nBoth Robert Buckland MP and I have consistently stated that we are supportive of Wasdell but not in this location.\nThe two matters of potential users here are separate, but you sir are given the unenviable task of unpicking this.\nAny ‘’packaging & distribution” company wants to be located close to main roads, on land found as cheaply as possible. For many years land promoters and planning & commercial agents have promoted farmland on the edges of town as the sites for industrial/housing growth. Through this time, older and established industrial sites are sidelined, yet often they are more sustainably located close to their workforce.\nIn statements, Wasdell talk of over 100 suppliers (8 wrote similar letters about possible interest to co locate – none are R&D centric businesses – supplier cluster at best) and clearly logistics (rather like the Honda site) are about large functional buildings in a convenient location. The current sites for their packaging business are by Junction 16 and the A419 at Groundwell.\nIn the time that they have been ‘seeking alternatives’ (and a swift new home for Wasdell) whilst promoting this unallocated greenfield site, Panattoni have delivered a bespoke 2m sq.ft building for Amazon at the allocated employment land at Symmetry Park (Great Stall West). This obtained detailed planning consent in less than a year and a year later is close to opening (this Autumn). This will feature advanced robotics, 1500 jobs and is a sustainable building across three mezzanine levels with associated offices and parking.\nIt is the role of a local authority to deliver suitable sites for employment and housing which Swindon has done and continues to do. It is not the role of the planning system to bend to the ‘it must be freehold’ wish-lists of the appellant and the addition of a speculative park of glass house type buildings simply means that they can steer eyes away from the main blocks. Phase One & two Wasdell buildings are not a ‘Science Park’.\nA ‘Science Park’ (as we are obliged to keep calling it) may be situated in other, more sustainable locations in Swindon and as SBC officers pointed out Swindon has a new ‘Institute of Technology’ opening this autumn at North Star in Central Swindon, close to the station, close to the Universities who are clustering at the Carriage Works. Perhaps Wasdell are not the right anchor, evidence in examination certainly confirmed that the non packaging side of the business is tiny. CamSci did a report, but I’m not aware of them offering to build the required ‘hub’ speculatively and as it transpires it may not just be ‘Pharma’ led then perhaps they were the wrong experts to ask?\nFor 3-4 years Wasdell Packaging have used the planning process and threats of ‘leaving Swindon’, including definitive statements from their Chairman to this effect as well as his published promise not to appeal. Their PR representatives have placed many pieces in local and regional press citing that they wouldn’t appeal with others quoted saying the Honda site wouldn’t be available for 10 years.\nThen they decided to appeal.\nAlternative sites: The appellants have obfuscated when asked about why they couldn’t have a larger (taller) building elsewhere (to use less land) as Amazon have done with their 2m sq.ft building at Symmetry Park. They claimed during examination that ‘plant had to go on the roof’ for their sealed working environments. Then when this was questioned (as it is a detailed application for phase 1) they confirmed it would go on the side – I’m sure the inspector will wish to see that on the detailed plans.\nThe Amazon building contains solar panels the size of a football pitch. The Wasdell building has to use much of it’s roof area trying to hide its appearance in sedum. As was noted by other witnesses they have been forced to great efforts to disguise something which is alien to its location.\nThis brings me to the location:\nThe AONB boundary is Pack Hill.\nThe ‘setting of the AONB’ is acknowledged in National Planning Policy.\nIn choosing a greenfield site and then in placing the building the very largest green structure on the site immediately adjoining that AONB is rather dismissive of this part of the ‘National Landscape’ and the ‘setting’ not just a word but is a well established protection afforded to the AONB.\nTo suggest that it can be ‘concealed’ by newly planted trees (which will not be mature for 15-20 years) and which by their nature are without leaves for six months was also a point questioned and not convincingly answered – nor was the fact that the site is on a hill and clearly that affects its appearance/massing.\nSwindon Borough Council are consulting with the public on ‘art installations’ for the planned New Eastern Villages along the route of the Southern Connector Road (a road solely to serve around 1/3rd of the planned residential villages to the North of Wanborough). The largest landscape installation is at the bottom of Pack Hill adjoining the SCR roundabout (with the two Community Forest planted fields within the AONB directly behind) and this includes a series of spiral mounds from which people can take in the landscape whilst signage for the AONB is proposed. At the top of these (if we are very unlucky) both residents and visitors will have a view of the industrial landscape proposed which will operate as the appellants stated 24//7 with attendant noise and light pollution.\nThe talk today of the Honda site was dismissed by Mr Gregory (who has also been promoting the sale of two adjoining plots of land within the AONB at the bottom of Pack Hill (the signs are still visible) as not available.\nThe application from Panattoni for an opinion on an environmental impact assessment shows their intent and they have briefed local Ward Councillors on their plans, which are indeed genuine and ambitious. Honda closes next month and the most sustainable proposition for employment growth is that site.\nThe Government white paper proposes to ensure communities welcome good growth. That the planning system doesn’t stifle, but allows that good growth. However what it is not intended to do is to over-ride planning policy to deliver unplanned growth when sufficient land for ambitious growth is already proposed.\nBoth David Dewart and Ed Snook made perfectly valid points on planned growth. Swindon has allocated (including the Honda site) ambitious plans for economic growth and this was demonstrated with the Amazon application, that good growth on allocated sites is supported and numerous approvals for over half the the NEV housing sites already made.\nIn cross examination the appellants Counsel was keen to stress that Swindon Borough Council hadn’t allocated land for a ‘Science Park’. This tactic is to say that something of which they have no experience of ‘curating’ is an essential component in the siting of their two very ordinary industrial buildings, lorries and car parks.\nThere are very many credible and available alternative sites within Swindon, particularly the Honda site which is shown to be actively promoted and already within the planning process despite Honda leaving next month. It is (as with Amazon) far more likely that we will see new occupiers on this site long before a ‘Science Park’ and Wasdell appear at Inlands Farm.\nOver supply of employment sites leads to sites being ‘flipped’’ to residential and having been a resident in the village for over 20 years I have seen how residents (whilst having initial reservations) can accept planned growth in the right location accompanied by suitable facilities and mitigation.\nIf you have visited the village you will see that this speculative application is not welcomed and the poorest quality housing developments in Swindon (and most unwelcome) are those won on appeal with land value rather than quality as the driver.\nThe size of the Southern Connector Road was a fine balance as it didn’t require a dual carriageway and is designed for residential use as it does not promote through traffic – ending at a Primary School in the proposed ‘Lotmead’ village. If residents start queuing behind the additional traffic they will ‘rat run’ which is a policy requirement to prevent.\nThe time this site will take to deliver from scratch could be lengthy. We already know that utility supplies are stretched and that a new site will require a water supply in competition with the planned growth at NEV, new gas and electric connections which do not exist (has capacity been shown?) and after all of this the appellant had definitely not chosen an easily deliverable option yet the pressure has been on constantly to find Wasdell Packaging a new home.\nI sincerely hope that for myself and the residents I represent that this appeal is refused.\nThey have been extremely tolerant of massive planned growth to the north of the village (the 8,000+ homes and 40 hectares of employment land) and in return they were given the promise of the Planning Inspector of the 2015 Local Plan as an element of protection, the ‘area of non-coalescence’ to prevent the village being joined to the urban area. Because these hilltop villages have special characteristics, noted many times already I will not repeat the Heritage witnesses statements).\nThe harm outweighs the speculative benefits – both elements of this application can be located elsewhere and do not have to co-locate.\nYours sincerely\nCllr Gary Sumner\nThe Inquiry started today (15th June 2021).\nKey points:\nThe inspector introduced the plan for the three week Inquiry.\nThe QC for Wasdell made his opening speech followed by John Warr for SSPC and then the QC for Swindon Borough Council.\nIn the second session 'Interested Parties' and members of the public were invited to speak. I spoke first and confirmed that I was also representing Robert Buckland MP (my comments are added below).\nDave Hayward spoke for the Parish Council and Gordon Wilson spoke for Liddington Parish Council.\nThe QC for Wasdell asked me some questions relating to how I viewed the site in my Cabinet role and I confirmed that I remained in favour of allocated sites and was against Inlands Farm - a fact made very clear by SBC in their opposition to the application.\nThe later session was then given to the first expert witness - David Dewart a Town Planner from SBC who was questioned by SBC's QC and then questioned at length by the Wasdell QC. This questioning continues tomorrow.\nSSPG as a 'Rule 6' party are attending every day and have a couple of advocates/witnesses to assist.\nI will be speaking in the third week on 'alternative sites'.\nMy opening remarks:\nI am Gary Sumner and I have been a resident in Wanborough for some twenty years. I am the Borough Councillor for the Ridgeway Ward and I am speaking here today in that role. I have also been asked by Robert Buckland MP to state that I speak on his behalf.\nI have been the Cabinet Member for Strategic Planning at Swindon Borough Council for the past three years, working on the Local Plan review with communities across Swindon finding the most appropriate places for growth of housing and employment.\nI was previously a Parish Councillor in Wanborough and Chairman of the Parish Council.\nIn that role I attended the Examination in Public of the current local plan.\nI was involved in discussions with SBC during the preparation of that plan to move the employment allocation of the NEV to the much more appropriate site at Symmetry Park on the A420.\nThere was considerable concern at the time that the allocation of land for some 8,000 new homes would have on the village of Wanborough and as a result an area of ‘Non-Coalescence’ was proposed to respect and protect the village of Wanborough from being joined to the urban area of Swindon.\nThe Southern Connector Road has been designed for a very specific purpose – not as the entrance to an employment site, but as a discrete single carriageway road with field entrances, a safe cycle route and pavement to connect small new villages within the New Eastern Villages. Do not be misled that it is a strategic road – it ceases in the middle of the NEV and is not designed for through journeys.\nThe work on this route has removed some established trees at the Commonhead junction of Pack Hill and this work has made it very clear how the hilltop village of Upper Wanborough sits within the landscape.\nBoth Robert Buckland and I are clear that we support Wasdell Packaging and their business, but we both firmly believe that this is a highly inappropriate and sensitive location.\nOther sites are available for employment growth in Swindon which is acknowledged in the Alder King report for the appellant.\nRepeated reference has been made to Wasdell and their short term leases on sites in Swindon and they have made it clear that this was a driver for their business. Now it appears to be the Science Park.\nPlanning and the choice of sites is important and unplanned growth leads to viability issues with properly allocated employment sites.\nEvidence will be shown that there are alternative sites and that if the appellant wanted a solution for their business needs, as they have said many times in the press over recent years, they would not have chosen an unallocated greenfield site, protected by a planning policy against coalescence, immediately adjoining a nationally protected landscape.\nThe residents of Wanborough and nearby villages are not ‘nimbys’ – in the past two decades they have been surrounded by land promotion and development proposals and have accepted over 8000 homes (over half of which are being built in the Parish of Wanborough), 40 hectares of employment.\nThe Borough Council and Planning Inspector for the current local plan offered the protection of this land to guarantee that the villages would not be consumed by urban growth.\nI urge that this appeal is dismissed as inappropriate for both Wanborough, the North Wessex downs AONB and to reassure residents across Swindon that growth should be in allocated locations if Local Plans are to mean anything.\nCllr Gary Sumner - The Ridgeway Ward\nWe won!\nThe Wasdell application for an industrial /Science Park at Inlands Farm was firmly rejected at tonight's Planning Committee meetings.\nMore in the next day or two but what a reward for the efforts of SSPG, friends, supporters and all in rejecting this completely inappropriate use of a site adjoining the AONB and in an area designated (By SBC) as an area of Non Coalescence.\nVictory for our villages and Planning system today.\nI regret the threat of moving jobs elsewhere and hope that Martin Tedham speaks to us to see what can be done now to keep him in Swindon and support his Swindon employees whom he values so highly - he has our contact details and we will support him.\nLATEST NEWS: This unwelcome Planning Application will go to a\nPLANNING COMMITTEE 25th AUGUST 6pm!\nI have opposed this application as completely wrong.\nI will speak to oppose it on the 25th as Ward Councillor and I believe that it does not offer the benefits promised, it contravenes Local and National Planning Policy and with the latest updated application is even more unacceptable. As one of the professional comments notes - this is an industrial park with a 'science park' bolted on...\nThe 'employment land study' submitted for the applicant is embarrassing and genuinely makes this application less credible.\nThere isn't a site in the country which could meet the criteria.\nGary Sumner\nYour Ridgeway Ward Councillor\nComments submitted by SBC's Landscape Architect on the Inlands Farm Application:\nEN5.1 Summary:\nMy previous comments remain unchanged: ‘The application depicts a development of substantial scale, in a sensitive rural location, which would create an unacceptable urbanisation of existing countryside.\nThis would be detrimental to the rural setting of Wanborough and the protected setting of the North Wessex Downs Area of Outstanding Natural Beauty that abuts the site to the south, and the planned NEV.\nBoth phases of the application, or either phase if considered individually, are markedly incongruous in this location, presenting harmful and overwhelmingly adverse visual impacts.\nThe applicant has incorporated various techniques to minimise this impact, but visual mitigation can only achieve limited results as clearly shown by the submitted 3D views.\nComments submitted to the revised application at Inlands Farm by SBC's Conservation Officer:\nConclusion: I have given consideration to the preservation and enhancement of the character and appearance of the conservation areas and the significance of designated heritage assets, including their setting.\nOn balance, I do not consider that there is ‘clear and convincing’ justification for the harm caused as required by Paragraph 194 of the Framework.\nI have concerns from a conservation perspective regarding the principle of such a development and its impact upon the character and appearance of the conservation area and the setting of designated heritage assets.\nIn this case I would recommend refusal on the following basis:\nThe proposed hybrid application which contains full application for 33,507Sqm of industrial use and an outline application for 48,681 Sqm, a result of its siting and location on an open parcel of land within the open countryside would result in an incongruous, prominent form of new development that would have an unacceptable urbanising effect by way of visual intrusion and unacceptable encroachment into the rural landscape setting which results in harm to the setting and context of surrounding designated and non-designated heritage assets.\nThe proposal would therefore fail to provide a scheme which 2 Paragraph: 013 Reference ID: 18a-013-20190723, Revision date: 23 07 2019 Conservation Comments Masterplanning, Design & Conservation Team Planning Department, Swindon Borough Council Planning Ref: reinforces local distinctiveness, preserves or enhance the tranquillity, amenity and traditional quality of the landscape setting and fails to make a positive contribution to the locality which would outweigh the harm caused.\nThe proposal is therefore, contrary to the duties under S66 and S72 of the Planning (Listed Buildings and Conservation Areas) Act 1990, Local Plan Policy EN5, EN10 and the heritage policies of the Framework.\nNormally I would seek to suggest amendments which may overcome any objections, however on this occasion, the principle of such a scheme is clearly inappropriate from a conservation perspective.\nWhilst the scheme is presented as a ‘science park,’ in reality after Phase 1 and 2 were implemented, the science park component would contain 32,281Sqm of floorspace, roughly 40% of the entire floorspace. Realistically the site will be an industrial site which takes up 60% of the use with an ancillary ‘science park’.\nAs the proposed 'Science Park' immediately adjoins the Area of Outstanding Natural Beauty I thought I would share a useful extract from:\n'NORTH WESSEX DOWNS AONB POSITION STATEMENT'\non 'SETTING'\n(Development Affecting the Setting of the North Wessex Downs AONB)\n1. Areas of Outstanding Natural Beauty (AONBs) are designated by the Government for the purpose of ensuring that the special qualities of our finest landscapes are conserved and enhanced. In planning policy terms they have the same status as National Parks.\n2. The primary purpose of the North Wessex Downs AONB is to conserve and enhance the natural beauty of the AONB. The AONB also has secondary purposes to increase awareness and understanding of the special qualities of the AONB, to take account of the needs of agriculture, forestry and other rural industries and to foster the social and economic well being of local communities and those who live and work in the area.\n3. The setting of the North Wessex Downs AONB can be explained as being the surroundings outside the AONB and although outside its boundary its extent is not fixed and may change over time. Elements of a setting may make a positive or negative contribution to the AONB, it may affect the ability to appreciate that significance or may be neutral. For the purposes of spatial planning, any development or change capable of affecting the significance of the AONB or people’s experience of it can be considered as falling within its setting.\n4. The surroundings of the North Wessex Downs AONB are also important to its landscape character and quality. Views out of the AONB and views towards or into it from surrounding areas can be very significant. Development proposals that affect views into and out of the AONB need to be carefully assessed to ensure that they conserve and enhance the natural beauty and landscape character of the AONB.\nGary Sumner\nBlenheim\nKite Hill\nWanborough\nSwindon\nSN4 0AW\nEd Snook\nPlanning Officer\nSwindon Boroough Council\nEuclid Street\nSwindon\n05 June 2020\nDear Ed,\nRe: S/OUT/18/1943\nI am objecting to this revised application as a resident of Wanborough and as the Ward Councillor for Wanborough.\nPlanning Policy: The site remains outside of the adopted Local Plan (for development purposes) and was specifically rejected from inclusion in the Draft Local Plan, which has been through both the Regulation 18 & 19 Statutory Consultations.\nPart of the Local Plan review process was the SHELAA (Strategic Housing & Economic Land Availability Assessment) and this site was expressly rejected in that process as unsuitable.\nThe Draft Local Plan has identified sufficient land for the economic needs of the Borough and they have also taken steps to safeguard the employment use of the Honda site which will close in July 2021.\nNo Planning Policy can cater for the very specific whims of an applicant, which in this case have been drawn so tightly that only one site could every fit their criteria.\nFor Swindon Borough Council to reject their own Local Plans would be highly unusual. This site was designated as an ‘Area of Non-Coalescence’ at the 2015 ‘Local Plan Inquiry’, to mitigate the 8000 home ‘New Eastern Villages’ development. That planned allocation already included a 40ha employment site (which incidentally this applicant rejected due to tenure) but is likely to be built and occupied within 18 months.\nWhilst I am very supportive of the applicant and his business, their use is a small part of this site (although highly visible). The contrived ‘needs list’ and the ‘alternative sites’ study carried out by the landowner’s agent (rather than an independent and objective third party with suitable specialist knowledge) is meaningless.\nIt is designed around giving one possible answer. Wasdell require a much smaller site for their business. That need is not objectively assessed in the application.\nAs this proposal is not for housing, our Local Plan can be considered ‘up to date’ and is fully relevant in assessing this application.\nPhase 1: The application suggests long term maturity of planting, but it is undeniable that the ‘setting’ of both the Conservation area of the village of Upper Wanborough and the rural setting to the North Wessex Downs AONB will be changed forever.\nThis is a principle issue as the site slopes up towards Upper Wanborough and the AONB and therefore the views from and to these protected features will be a key issue.\nBecause the applicants have chosen to give certainty in only one aspect – ‘Phase 1’ then that is the visual impact we must address first.\nThe Phase 1 building will be a dark mass encircled by a HGV access road around the building - meaning that lighting (when viewed from the AONB and the Conservation area will be an issue) as well as noise.\nPlanting to the western main approach would be new. This will not hide the building for decades and that will lead to the alien building concealing the hilltop village.\nAccess: The application claims early delivery of the roundabout section at the intersection of Pack Hill and the Southern Connector Road. This road is already fully funded and the section within the application boundary was already being delivered following the CPO Inquiry.\nThe ‘claim’ to be delivering a cycle path is untrue as it already being delivered by the SCR project and fully funded.\nThe Southern Connector Road is a strategically well-planned single carriageway road with a soft edge and with cycle paths and pavements and is only planned as an access for around 1/3rd of the residential only traffic of the New Eastern Villages.\nAny additional burden on this road may lead to drivers choosing alternative routes in contravention of the Borough policy to minimise rat running in Wanborough and nearby villages.\nA 24/7 distribution and manufacturing warehouse added to the SCR will lead to many additional vehicle movements which make both the cycling and pedestrian connectivity being less attractive. Delays at Commonhead roundabout as a result of both employee traffic (the applicant suggests a doubling of existing employees to 1200) on top of the 230 suppliers delivering in and the 85% of deliveries out heading to Heathrow for export. That is only phase 1.\nThis proposal: The ‘Science Park’ is an Outline Application, but the attractive ‘green spaces’ are contained largely within that area. Views from the Marsh towards the AONB or from the Southern Connector Road are only mitigated in that 2nd phase outline which may never be delivered.\nCAM-Sci have delivered a glossy report which discussed possibilities – they have not been commissioned to deliver the Science Park themselves and alternative Science Parks away from educational institutions such as Porton Down have required tens of millions of pounds of subsidy to deliver any notable employment.\nAbout the location: Inlands Farm is established good arable farmland, rising in the East to the Upper Wanborough Conservation Area and to the South ‘Pack Hill’ which forms the boundary with the Area of Outstanding Natural Beauty (AONB). The AONB as well as the 'setting' of the AONB have national protection. For this reason, applications close to Lydiard House (for example) have been refused because often the 'setting' is as important as the designated asset.\nThe 'setting' of the hilltop village and Conservation Area of Upper Wanborough has designated significance (as evidenced in previous appeal decisions) and few people would argue that the village (when viewed from the area around 'Great Moorleaze' at the entrance to the AONB) would disappear behind the industrial building and its attendant lighting, noise and infrastructure. The Grade 1 listed church at St Andrews is the most prominent part of the skyline as well as the more distant Liddington Hill and Castle.\nAbout 80% of the site sits in the Area of Non-Coalescence designed to protect Wanborough, the AONB and other villages from coalescing with Swindon. It is an open landscape with few major trees for example meaning that anything which is built will be obvious.\nApplicants Landscape Plans: The Landscape plans indicate that in the 40m strip of land between the AONB and the building there will be a road, two sections of tree planting, a ditch and an ‘attractive’ pedestrian route.\nThe problem with trees required to hide a 14.5m building are that they grow in height and width – this means that the attractive pathway will be in shade and will need to be lit as well as the vehicular access – all adding to light pollution. They also are not in leaf all year round.\nThe landscape assessment specifically references viewings out from the Conservation area but do not address the views towards nor the ‘setting’.\nThe applicants own ‘Landscape & Visual Amenity Report states:\n• Two adjoining blocks of recently planted woodland on the south side of Pack Hill (opposite the Site) would mature to form a new woodland block on the northern edge of the North Wessex Downs AONB. This will provide substantial enclosure to the south side of the Site and separation from the AONB.\nWhat this ‘expert report’ fails to note is that those woodland blocks ARE the AONB.\nFlooding: The site is notable for ground water flooding. Water flows across the land resulting in considerable fast-moving flows at the entrance to Inlands Farm and which discharge into the roadside ditches heading North along The Marsh.\nFlooding increased in recent years due to less deep ploughing of the land and it is difficult to see how the ‘developed’ site would better this situation.\nThe Environment Agency notes that they do not record surface water flooding which occurs across this site and we have photographs from this year which inform.\nWater Supply & Sewage:\nIn a belatedly updated comment Thames Water confirms there is insufficient FOUL WATER capacity to serve a commercial building larger than 625sq.m (The Phase 1 proposal is 33,000sq.m).\nThey also confirm a water supply deficiency for Phase 1 (and any additional buildings beyond 23,000sq.m\nFor the Planning Authority the consideration should be whether this identified deficit in a basic facility to serve the development will make other Phases of the NEW EASTER VILLAGES unviable in the short term as the capacity identified for residential development may be taken away by this un-planned development.\nPOLICY DETAIL:\n1) This site is not allocated for development - housing or employment. It is largely with the SBC designated 'Area of Non Coalescence' and the 'setting' of the North Wessex Downs Area of Outstanding Natural Beauty'\nPolicy NC3 in the Local Plan states (bullet E): The character and identity of Wanborough, Bishopstone and Bourton will be protected by a principle of non-coalescence between the settlements. The land between the New Eastern Villages site boundary and the existing villages shall remain part of the countryside. However, small scale development within this area, as defined on the Policies Map, will be permitted where it retains or enhances the existing character of the countryside and involves the re-use, conversion or extension of existing buildings at a scale appropriate to their location, in accordance with the criteria specified in Policy DE1; or is an essential requirement directly related to the economic or social needs of the rural community.\n2) Policy EN2 in the Local Plan states 'Swindon Borough is set within a beautiful landscape context including the North Wessex Downs Area of Outstanding Natural Beauty'.\n3) Policy EN5 in the Local Plan states 'The North Wessex Downs Area of Outstanding Natural Beauty (AONB) is a nationally recognised area of landscape protection. Proposals within the Borough which are within and or abuts the North Wessex Downs AONB must accord with relevant criteria set out in the AONB Management Plan and paragraph 115 and 116 of the NPPF. Proposals outside the AONB should not adversely affect its setting.'\nPolicy EN5 further states 'In meeting the requirements of EN5a, applicants for development should demonstrate how they have taken into account Landscape Character Assessments and assessed the potential impact of the proposal upon the following attributes of the landscape: existing landscape form, features, topography and character; the contribution of the landscape to biodiversity and wildlife; local geology and geo-diversity; views, visual amenity and the landscape setting;\nBiodiversity - locally distinctive and characteristic pattern and species composition of natural features such as trees hedgerows, woodland field boundaries watercourses and water-bodies;\nGeology - locally distinctive and characteristic landforms and topographical features throughout the Borough such as locally important views, visually sensitive sky lines, ridges and valleys;\nViews both in and out - visually sensitive skyline, geological and topographical features; and the separate identity of settlements and the transition between man-made and natural landscapes at the urban fringe.\nI would like to remind those considering the application that SBC has obligations regarding the AONB as part of ‘our’ management plan – which we are obliged by Government to produce and to which we should have due regard in considering applications both within, and in the setting of the AONB.\nNPPF policy on AONBs:\n116. Planning permission should be refused for major developments in these designated areas except in exceptional circumstances and where it can be demonstrated they are in the public interest. Consideration of such applications should include an assessment of:\n• the need for the development, including in terms of any national considerations, and the impact of permitting it, or refusing it, upon the local economy;\n• the cost of, and scope for, developing elsewhere outside the designated area, or meeting the need for it in some other way; and\n• any detrimental effect on the environment, the landscape and recreational opportunities, and the extent to which that could be moderated.’\nHas the duty to have regard to the statutory purposes of AONBs to ‘conserve or enhance the natural beauty of their area’ been carried out? This often-overlooked legal requirement is to consider whether an AONB will be ‘enhanced’ by a proposal as well as ‘conserved’ by it.\nThe North Wessex Downs AONB lies to the south, partly within Swindon Borough. Its landscape is predominantly a chalk land landscape of scarp slopes and moulded dip slopes that reflects the underlying chalk geology.\nNational guidance has confirmed that great weight should be given to conserving landscape and scenic beauty in AONBs which have been confirmed as having the highest status of protection in relation to landscape and scenic beauty.\nAONBs are protected under the existing statutory requirements of the Countryside and Rights of Way Act 2000, specifically under Section 85 it is a legal duty for all relevant authorities to have regard to the primary purpose of AONBs to conserve and enhance the natural beauty of the area.\nThe potential for harm on the setting of the area from large-scale urban extensions is substantial. Any new uses or development proposed outside but within the setting of the area should consider the North Wessex Downs AONB Position Statement on Setting.\nProposals should include detailed measures to mitigate against harm on and into the area. Forms of mitigation may include strategic landscape buffers, restrictions on building heights, care over massing and scale, care over roofscape design, or avoidance of development in the most exposed locations.\nThe North Wessex Downs AONB Management Plan includes a policy paper on ‘settings’. The management plan is likely to be a material consideration in planning decisions.\nThe AONB ‘Setting Position Statement’ couldn’t be clearer - Paragraph 5 copied below it is difficult to see how each of these is not relevant to this application:\n5. Examples of adverse impacts on the setting of the North Wessex Downs AONB could include:\n• development which would have a significant visual impact on views in or out of the AONB;\n• breaking the skyline, particularly when this is associated with developments that have a vertical emphasis and / movement (chimneys, plumes or blades for example);\n• loss of tranquillity through the introduction or increase of lighting, noise, or traffic movement or other environmental impact like dust, vibration, spatial associations and historic relationships; • introduction of abrupt change of landscape character; • loss of biodiversity, particularly if of habitats or species of importance to the AONB;\n• loss of features of historic and natural landscape interest, particularly if these are contiguous with the AONB;\n• change of use of land such that to cause harm to landscape character; and\n• development individually or cumulatively giving rise to significantly increased traffic flows to and from the AONB, resulting in loss of tranquillity and erosion of the character of rural roads and lanes; • Increase in air and water pollution.\nNPPF paragraph 115 requires that in any decision “great weight should be given to conserving landscape and scenic beauty” in AONBs.\nThis applies not only to developments proposed within an AONB but if proposed in its setting such that the AONB would be affected.\nThe height of the hurdle to be crossed by the ‘great weight’ requirement is a matter of judgement in individual cases, but the High Court has clarified that it must be taken seriously.\nWould the development be ‘major’ development within the AONB for the purposes of applying NPPF paragraph 116? I believe it would be.\nIf the development is ‘major’, permission should be refused unless the two requirements in paragraph 116 have been met. These are that there are ‘exceptional circumstances’ to justify permission and that the development is ‘in the public interest’.\nAn interesting extract from the CamSci Report:\nSwindon Science Park Operations Model: The most successful science parks in the UK are those in single ownership with an estate-wide operations strategy that integrates development and facilitates delivery of a single vision.\nThis model is most common where the landlord funds development (directly or indirectly) and the tenant entity leases premises from the landlord. To retain control and maintain the enduring vision of the project, as well as to maximise capital value, this model grants only ground leases other than in exceptional circumstances.\nMy Comment: This is the model which Wasdell identified as a block to them moving to somewhere like Symmetry Park where ‘freehold’ and flexibility in design’ were not available.\nAs a resident of the village and as the elected representative of the residents of Wanborough, and the area in which this scheme is proposed I would urge refusal.\nThe site is not in accordance with local or National Planning policy, genuine alternatives are available if an employer is open to those alternatives. In this case we are on one hand being shown and employer who is undoubtedly important and on the other a speculative application to turn unallocated farmland into development land.\nFinally, I reserve the right to make additional comments as corrected documents are added to the planning portal and critical matters including Highways modelling remain outstanding.\nYours sincerely,\nGary Sumner\nRidgeway Ward Councillor & Resident.\nPlease check our 'NEWS PAGE' for other items",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_working-for-residents/content_18.html": "Working positively with Liddington Parish Council\nRidgeway Ward residents let me know if you have any questions:\nGary Sumner – your Ridgeway Ward Councillor\nCOMMUNITY SPEEDWATCH IN LIDDINGTON:\nAs one of a group of volunteers we give up our time to be a visible presence to speeding motorists in Liddington.\nData about speeding motorists is passed to Wiltshire Police and those motorists can expect to hear from the police.\nThe data has also helped us get permission to site movable vehicle activated speed signs on Purley Road funded by the Liddington Parish Council.\nCLEAN UP IN LIDDINGTON:\nMy son Will and I removed grafitti - cleared pavements of leaves and fallen branches and removed grass growing alongside the road on the Purley Road (B4192).\nGreat to look back and see what we achieved in doing this - a very tidy street scene afterwards.\nWe were just one part of the effort with other Liddington residents concentrating on other areas.\nWe brought in a leaf blower from home to speed the task!\nWe planted 4000 trees at 'Manners Wood', Pack Hill, Wanborough in the AONB in November 2018 & more in February 2019 and November 2019:\nTogether with the Woodland Trust, staff from Nationwide Building Society and the Landscape team at Swindon Borough Council we planted 4000 trees in land aquired by SBC alongside an existing woodland scheme in the Area of Outstanding Natural Beauty at Pack Hill, Wanborough.\nStaff and pupils from Years 3&4 at Wanborough Primary were able to join us and Nationwide were good enough to lay on the coach to get them there and back safely! They were incredibly enthusiastic planters and trees were planted so quickly that more had to be brought to site! They will watch this special new woodland grow and know they helped create it in 2019.\nGary Sumner – your Ridgeway Ward Councillor",
  "http_www_ridgewayvillages_co_uk_/https_www_ridgewayvillages_co_uk_the-new-eastern-villages/content_20.html": "The Swindon Borough Local Plan was adopted in 2015 and set out the level of housing, employment and other development needs up to 2026, where this should be located, and the infrastructure that is required to enable this development to take place.\nPrevious the Labour Government in 2009 had supported growth of some 12,000 homes in the same area, which were fortunately rejected.\nThe land on which the New Eastern Villages will be built is not owned by Swindon Borough Council. It was promoted by landowners (farmers, land agents and promoters with developers to a smaller degree) over 20 years. The area was accepted as suitable to enable sustainable growth in the Town when combined with the infrastructure required to support the development.\nFor some years the planned developments stalled and Swindon Borough Council was successful in bidding for around £75m of government funding to 'unlock' the growth by forward funding the upgrades to White Hart Junction (£30m), Gable Cross (£8m), Oxford Road/Nythe Road junction and Piccadilly roundabout at Covingham (£7m) and constructing the SCR (Southern Connector Road c.£40m).\nA SCR is a new strategic road from Commonhead to Lotmead which would accommodate traffic flows from the Southern part of the development. It acts very effectively as a bypass for Wanborough, meaning that traffic will not drive through the village to access the M4 etc. There will be a signalised junction with Wanborough Road to allow traffic from Wanborough and Covingham to continue to travel as it always has done, but to prevent traffic from the main area of the NEV (Lotmead etc) from turning left towards Wanborough). It also means that traffic can't come from Covingham and turn right onto the SCR.\nThere are two/three access points planned for the A420 to enter the NEV and the internal road layout will be designed so that these various access points do not encourage 'strategic journeys' as the roads will enter the various new 'villages'. Strategic journeys pas the NEV will use the new and vastly improved A420/White Hart route to access Swindon and the M4.\nFunding was also specifically allocated for Wanborough as 'Measures to minimise rat running' in the plan - to 'deter' through traffic and this was delivered in 2022 primarily implementing the High Street traffic calming scheme which formalised parking areas, installing 'build-outs' to slow traffic and installing heritage 'primrose' double lines to stop parking inappropriately (which would have caused issues with the new calming features).\nThe original trajectory for building the NEV was envisaged to start in the North at Rowborough/South Marston and then build towards the South (at Redlands and Foxbridge).\nThe Redlands development was promoted outside of the planned trajectory and after a succesful planning application was finally granted consent in 2019 for 370 homes and a Primary School.\nAs the development at Redlands was in accordance with the adopted Local Plan I proposed at the Planning Committee that the application be granted, but I obtained some useful concessions including camera monitoring of traffic flows, to ensure that if they exceed predicted numbers measures could be considered to stop this traffic. It was also agreed that the Wanborough traffic calming scheme would be implemented before the development took place. As a condition of the Redlands consent, the Wanborough Road will be narrowed and a pavement installed from Wanborough to Covingham as well as installing 'build outs' to slow traffic and a new priority junction with the development.\nI was keen back in 2016 that the Southern Connector Road was delivered as early as possible to start to accommodate the traffic from the new development areas. The land for the SCR was obtained through a compulsory purchase process which took some years to complete and then the route had to be carefully planned to avoid areas of high sensitivity in terms of archaeology.\nLotmead now has consent for some 2,500 homes including two primary schools and extensive sports facilities. There are also large areas of land protected for ecology, including river corridors and open spaces with public access. The SCR is the primary access point but with up to 200 homes off the Wanborough Road directly by the existing Lotmead business park entrance.\nGreat Stall East (accessed off the A420) is now consented for around 1500 homes and will provide the Eastern entrance to the NEV as welll as the 3,000 pupil secondary school, cricket and football facilities and a sports hub.\nFoxbridge North was granted consent on appeal in November 2022, having been refused by SBC as funding was not being provided at a level which could deliver the primary school. This site has access only to the SCR.\nFoxbridge South has planning consent (December 2023) but with no school!\nThe development shall provide (amongst other things):\nAt Wanborough Road - a new signalised crossroad junction. Traffic movements at this junction are restricted, as follows:\n• From north-east (proposed Lotmead village, NEV): Straight ahead towards Commonhead only.\n• From the south-east (Wanborough Road, Wanborough): Straight ahead to Covingham, and left turn onto the SCR only.\n• From south-west (proposed Foxbridge village and Commonhead): Straight ahead towards proposed Lotmead Village, and right hand turn towards Wanborough only.\n• From north-west (Wanborough Road, Covingham): Straight ahead towards Wanborough only.\nSouthern Connector Road - construction started March 2021 - it is NOT a bypass to the White Hart but it does serve as a BYPASS to Wanborough:\nA new road known as the Southern Connector Road (SCR) will provide a link between the New Eastern Villages (NEV) and Commonhead roundabout, near the Great Western Hospital.\nThe two-way single carriageway will be 1.5 miles long and design options have been assessed and put out to public consultation. The design has been informed by traffic modelling which indicates a road of this size will be sufficient to cater for demand generated by the full NEV development. A dual carriageway is not viable as there are the physical constraints of archaeology and utilities in the area.\nThis scheme was awarded £19m from the Housing Infrastructure Fund in November 2019. The scheme also has agreement in principle for £11.6m from the Local Growth Fund (LGF) and Department for Transport (DfT). This scheme is totally funded and will not require any additional borrowing for the council.\nA planning application, accompanied by an Environmental Impact Assessment, was approved by Planning Committee in December 2019.\nTo prevent rat-running, the proposed signalised junction with Wanborough Road will be designed to prevent southbound traffic on the SCR turning left towards Wanborough. It will also prevent traffic from Wanborough turning right onto the SCR. The need for traffic calming in surrounding villages will continue to be assessed as development proposals come forward.\nThe road will be designed to avoid known areas of high archaeological interest. Measures will also be put in place to safeguard wildlife, particularly endangered species. As part of the road crosses a flood zone, drainage is an important element of the design. The Environment Agency is a key partner helping us develop flood mitigation measures.\nWe considered making the SCR a dual carriageway, also adding a bus lane, but this was not feasible due to financial and archaeology constraints.\nIt is NOT a 'bypass' to the A420 but WILL take traffic from the NEV and BYPASS Wanborough.\nMost of the road will be built on privately-owned land and negotiations with landowners to acquire are completed and compulsory purchase approved.\nThe work started in March 2021 and is due to be completed in 2024.\nNew Eastern Villages: BOTH APPROVED JUNE 2020\nTwo hugely important applications came to Planning Committee on the 9th June 2020.\nAt Symmetry Park the application was for a B8 Employment use building, which at some 2.3m sq.ft will bring significant new employment (up to 1500 jobs) to the area.\nThe site is already allocated in the NEV Master-plan for employment, so is not controversial and contributes towards the £72m of highways improvements currently under way in the immediate area including White Hart Junction, Gable Cross, Southern Connector Road etc.\nContributions also include over £600,000 to the Great Western Community Forest.\nThe other major planning application is for 2,500 homes at Lotmead, Wanborough. This includes a large Sports Hub, Village Centre, two primary schools as well as connections to the adjoining development parcels. Lotmead is also an allocated site within the planned 'New Eastern Villages' of 8,000 homes and the applicants have worked closely with planners and members to address previous concerns.\nMeasures have been agreed to assist with traffic calming in Wanborough and the design of the junction between the main access (the new Southern Connector Road) and Wanborough Road is designed to prevent 'rat running'.\nBoth of these are further milestones in seeing the long planned development come to fruition.\nGary Sumner\nYour Ridgeway Ward Councillor.\nThe New Eastern Villages (NEV) is one of the largest greenfield developments in the country. It will consist of 8,000 homes, new schools, employment spaces and community and leisure facilities.\nIt will be located to the east of the A419 and is estimated to span 724 hectares, with its eastern boundary reaching the point at which the River Cole meets the A420.\nKey cycling and pedestrian routes will be incorporated in the development and there will be plenty of green spaces, including a nature reserve, playing fields and allotments.\nThe district centre and new secondary school will be particularly important in establishing a sense of place and reducing pressures on existing facilities in Swindon. A GP surgery will also be built along with a library and numerous other community facilities.\nIn order to allow the development to progress, a number of highways improvement schemes are due to take place."
}