{
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_parliament/content_3.html": "Holding estate management companies to account Tuesday, 22 April, 2025 In a Westminster Hall debate on residential estate management companies, I brought the stories I have heard from so many constituents about how these companies operate directly to the Government.\nInfrastructure must be in place before new housing Thursday, 27 March, 2025 Labour have the wrong priorities - the right infrastructure must be in place before any new housing development.\nCutting Anti-Social Behaviour Wednesday, 12 March, 2025 As well as the police, housing associations must play a full role in dealing with antisocial behaviour.\nForeign criminals must be deported Tuesday, 11 March, 2025 If a foreign citizen commits a crime here, they must be deported.\nLabour are failing small businesses Thursday, 27 February, 2025 My speech in the opposition day debate on the impact of the Government's policies on small businesses.\nBusinesses create growth, not Government Monday, 3 February, 2025 It is businesses across Broxbourne and the county that create economic growth, not the Government.\nCalling for more support for entrepreneurs Thursday, 30 January, 2025 Economies grow and jobs are created when individuals are able to take risks and invest in their ideas.\nConfidence in the SEND system must improve Tuesday, 28 January, 2025 What is the Government doing to ensure parents have confidence?\nCheshunt's asylum hotel must close Tuesday, 21 January, 2025 I spoke in a Westminster Hall debate on the re-opening of hotels for asylum seekers since Labour came into Government.\nTackling delays caused by roadworks Friday, 10 January, 2025 Long delays caused by roadworks can have a severe impact, as hundreds of you have told me over the last few months through my survey.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_campaigns_six-election-priorities/content_9.html": "I pledged to fight on 6 big issues if I was elected.\nThese now form the basis for my work as your Member of Parliament for Broxbourne.\nI pledged to fight on 6 big issues if I was elected.\nThese now form the basis for my work as your Member of Parliament for Broxbourne.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk/content_1.html": "Share your views on our bus service Your experience of traffic delays in Broxbourne My Latest News Holding estate management companies to account In a Westminster Hall debate on residential estate management companies, I… Speaking about local issues on my first podcast Discussing my campaigns to tackle roadworks, improve access to local services… My Older Persons' Fair My first Older Persons’ Fair was held on 4th April 2025, and was a great… Holding estate management companies to account 22nd April 2025 In a Westminster Hall debate on residential estate management companies, I brought the stories I have heard from so many constituents about how these companies... Speeches in Parliament Am I your MP? Enter your postcode Postcode Speaking about local issues on my first podcast 8th April 2025 Discussing my campaigns to tackle roadworks, improve access to local services and secure a Banking Hub in Cheshunt. Local News Broxbourne Constituency\nHolding estate management companies to account In a Westminster Hall debate on residential estate management companies, I…\nSpeaking about local issues on my first podcast Discussing my campaigns to tackle roadworks, improve access to local services…\nHolding estate management companies to account 22nd April 2025 In a Westminster Hall debate on residential estate management companies, I brought the stories I have heard from so many constituents about how these companies... Speeches in Parliament\nSpeaking about local issues on my first podcast 8th April 2025 Discussing my campaigns to tackle roadworks, improve access to local services and secure a Banking Hub in Cheshunt. Local News",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_westminster-trips/content_25.html": "Free guided tours of Parliament are available to constituents. The walking tour of the Palace of Westminster includes -\n- Westminster Hall, the ancient hall at the heart of the Palace where Parliament first sat and where many historic events have taken place\n- The House of Commons, including the Speaker's Chair and the famous green benches and the 'lobbies' where MPs actually vote\n- The House of Lords, including the Royal Throne\n- The Queen's Robing Room, Royal Gallery and many other fascinating parts of the Palace of Westminster\nPlease note that tours are very popular and places are limited so generally have to be booked about six months in advance.\nPlease contact us to enquire about a visit to Westminster.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_my-view-assisted-dying/content_20.html": "Today, the House of Commons voted on a Private Members’ Bill regarding assisted dying.\nOver the last few weeks, it’s been my job as your Member of Parliament to listen to the many complex moral and legal arguments, on both sides.\nI have received a broad range of letters regarding the issue, which have been helpful and informative. I have also spoken to a number of people from all walks of life and right across the constituency on the topic. I recognise the strong feelings that exist on both sides.\nI also met with several key community figures to talk about this, as well as the sponsor of the Bill, Kim Leadbeater MP.\nI believe in freedom of choice, personal autonomy and individuals taking decisions as they see fit over their lives, without interference from Government and politicians. I therefore would have liked to support a change of law if appropriate safeguards were in place, to protect against unintended consequences.\nAs legalising assisted dying would represent a huge social change for this country, Parliament must have ample time to consider the full implications. When the Bill was published, I took the time to go through it line by line.\nI have significant concerns around clause 4(2) of the Bill, which would lawfully enable a doctor to initiate a conversation with patients around assisted dying, rather than this being prompted by the patient. I raised my concerns around this with Ms Leadbeater, and after thinking long and hard, I firmly believe the process should be patient led, with the patient starting the discussion rather than the doctor.\nAfter the initial conversation, the next stage of the process set out by the Bill is a signed declaration to confirm the patient’s wishes. The Bill allows for this to be done by a proxy (ie. someone who is not the patient) and this can include a ‘person who is of good standing in the community’ who doesn’t necessarily need to know the patient. I do not believe this is right.\nI am also concerned about the lack of time that was made available to consider the Bill. When the Prime Minister was directly asked about whether the Government would give additional time for MPs to scrutinise it, he did not commit to doing so.\nMPs, and wider society, had less than three weeks from the publication of the Bill to the vote. This sort of timeframe does not allow for an adequate level of debate and discussion, nor does it ensure that legislation is robust and as tight as possible.\nAs I said to Ms Leadbeater, a short parliamentary debate of five hours, with most MPs allowed only a few minutes to make a speech, is insufficient for every Member of Parliament to fully consider this bill and all of the arguments presented. To put things into perspective, the ban on fox hunting received over 700 hours of debate in the House of Commons.\nI support improving the provision of palliative care. As people approach the end of life, they should have the best possible options open to them. In countries where assisted dying legislation like this has been enacted, palliative care has been improved alongside it. Due in part I feel to the lack of time allocated and the lack of a formal impact assessment, I have not seen the necessary proposals to the provision of palliative care that should be taking place in conjunction with this bill.\nFor these reasons I did not support the Terminally Ill Adults (End of Life) Bill. I know there will be many who will be disappointed with my decision, but I do hope this statement explains my reasoning. It was not easy getting to this point and I hope you understand that I have given this a huge amount of thought in recognition of the great importance of this vote.\nNow the Bill has passed this stage, I will continue to listen to all sides of the debate and scrutinise its progress, as is my duty as a Parliamentarian.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_category_Westminster-News/content_16.html": "Meeting the Employment Minister 4th March 2025 Ensuring local people can access good locals jobs is one of my key priorities. Westminster News\nReducing the impact of flooding 7th January 2025 Time and time again, wet weather leads to flooding across Broxbourne. I questioned the Minister responsible for flooding about what's being done to reduce the... Westminster News\nWhat Devolution means for Broxbourne 17th December 2024 The Government’s English Devolution White Paper is a political attack on local democracy. Westminster News\nLabour's Budget will make it harder for small businesses 30th October 2024 My reaction to the Chancellor's Budget. Westminster News\nMPs Call On Government To Provide Additional Support For SEND Services Across Bedfordshire And Hertfordshire 6th September 2024 I have joined with my colleague Blake Stephenson, MP for Mid Bedfordshire, to call on the Government to distribute more resources to SEND services across... Westminster News\nLabour are not being straight with you 30th July 2024 I listened extremely carefully to the Chancellor's statement to Parliament yesterday. It was deeply concerning to hear that the Government has chosen to scrap... Westminster News",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_what-can-mp-do/content_4.html": "Members of Parliament are elected to the House of Commons to represent the interests and concerns of all the people who live in their constituency, whether they voted for them at the General Election or not. They are only able to deal with issues raised by people who live in their constituency, called constituents.\nTo check if you are one of my constituents, please enter your postcode on the Parliament website.\nMPs consider and vote on legislation and use their position to ask government ministers questions about current issues.\nWe split our time between working in Parliament and working in the constituency. In Parliament, I spend my time fighting for the interests of all my constituents, attending debates, scrutinising and voting on legislation, and attending meetings. I hold advice surgeries for my constituents (where they can come and talk to me about any local issues and problems), attend meetings and community events, as well as visiting local organisations and businesses across the constituency.\nWhen a constituent writes to me, I will write to the relevant department or official or the Minister involved. Many problems are solved in this way and I always aim to respond within 10 working days although sometimes more complex cases may take slightly longer.\nAlternatively, if a constituent is happy for the issue to be made public, I can ask an oral or written question, secure a debate or even petition Parliament itself.\nOral or Written Questions\nOnce a month each minister from each government department answer questions from MPs at the Despatch Box in the Chamber of the House. There is a limit to the number of questions that can be asked but I can also table a written question to the relevant government department, which are published in Hansard.\nAdjournment Debates\nMPs may be able to raise a constituent’s issue in a half-hour Adjournment Debate. To get an Adjournment Debate, MPs must be successful in a ballot of Members of Parliament or have the subject chosen by the Speaker. The debates are usually the last business of the day and a government minister responds at the end of the debate.\nPetition\nMembers of Parliament can present a petition to Parliament on behalf of their constituents. The format and wording of the petition need to be in a particular way. For more information or guidance, please contact:\nClerk of Public Petitions\nJournal Office\nHouse of Commons\nLondon SW1A 0AA\nhttps://www.parliament.uk/get-involved/sign-a-petition/paper-petitions\nWhat I cannot do, however, is have any jurisdiction over local Council decisions. I can write to on your behalf to the council and ask them to look into a problem or to reconsider an issue. In the first instance though, constituents should contact their local council or councillor directly.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_speaking-on-politics-live/content_12.html": "This week I joined BBC 2's Politics Live to discuss immigration, Labour's family farm tax and concerns around artificial intelligence.\nI made it clear that current immigration levels are too high, and argued that Labour's plans simply don't go far enough.\nI pushed back against the Labour MP's claims that her Government's family farm tax won't impact farmers in my constituency.\nAnd I spoke about the need to strike a balance between using AI safely, while also letting UK businesses innovate and use technology to grow our economy.\nClick above to watch my full contribution.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_cutting-anti-social-behaviour/content_17.html": "Many constituents have written to me and asked for help in dealing with antisocial behaviour problems caused by their neighbours in housing association properties.\nIn Westminster Hall, I spoke about the effectiveness of Government plans to deal with this, and applauded local efforts to cut this behaviour in Waltham Cross.\nIn January alone, Waltham Cross saw more than 682 hours of additional police patrols being carried out, eight arrests were made, and two weapons were seized. That increased visibility is reassuring to residents and prevents crime before it actually occurs. In some hotspot areas in Hertfordshire, antisocial behaviour has been reduced by up to 50%.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_confidence-send-system-must-improve/content_21.html": "I know the special educational needs system is not providing the right support for all who need it.\nIn Parliament, I challenged the Minister responsible to explain what changes she is making to ensure parents can have confidence in the service.\nI will be continuing to press the Government to outline the specific steps they are taking to improve the situation for children and parents in Broxbourne.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_my-older-persons-fair/content_11.html": "Thank you to the hundreds of residents who came to my very first Older Persons' Fair last Friday.\nThe event was an incredible success, thanks to all of the brilliant exhibitors, volunteers, and our hosts at Halsey Masonic Hall.\nIt was such a pleasure to speak with so many local residents, about everything from improving our bus service to the need for a banking hub in Cheshunt.\nI look forward to hosting many more events to bring our community together in future - you can stay up to date by signing up to my newsletter.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_category_Local-News/content_26.html": "Speaking about local issues on my first podcast 8th April 2025 Discussing my campaigns to tackle roadworks, improve access to local services and secure a Banking Hub in Cheshunt. Local News\nMy Older Persons' Fair 7th April 2025 My first Older Persons’ Fair was held on 4th April 2025, and was a great success. Local News\nJoin the fight against the cut to Winter Fuel Payments 3rd September 2024 Sign my petition against the cuts. Local News\nOpening a new habitat at Hertfordshire Zoo 16th August 2024 It was a privilege to be asked by Hertfordshire Zoo to open their new, state of the art gibbon habitat today. Hertfordshire Zoo is a real gem which we're so... Local News\nLocal Jobs for Local People: Generation Broxbourne 6th March 2024 The third annual Generation Broxbourne event took place on 6 March 2024 at the Spotlight, Hoddesdon. Hundreds of students from local secondary schools and over... Local News\nBarclays Local scheme opens at the Spotlight 9th January 2024 Broxbourne Council has announced that a new Barclays Local service has opened at the Spotlight, High Street, Hoddesdon with effect from 8 January 2024. The new... Local News\nMaking a splash at John Warner Sports Centre 4th November 2023 It has been announced that John Warner Sports Centre has received almost £190,000 from the Government’s Swimming Pool Support Fund. Operating costs including... Local News\nLondon Mayor Sadiq Khan needs to rethink ULEZ expansion 31st August 2023 From 29 August 2023 London’s Ultra Low Emission Zone (ULEZ) expanded to the Borough’s southern boundary with Enfield. Any non-ULEZ-compliant vehicle is now... Local News",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_category_Speeches-in-Parliament/content_5.html": "Holding estate management companies to account 22nd April 2025 In a Westminster Hall debate on residential estate management companies, I brought the stories I have heard from so many constituents about how these companies... Speeches in Parliament\nInfrastructure must be in place before new housing 27th March 2025 Labour have the wrong priorities - the right infrastructure must be in place before any new housing development. Speeches in Parliament\nCutting Anti-Social Behaviour 12th March 2025 As well as the police, housing associations must play a full role in dealing with antisocial behaviour. Speeches in Parliament\nForeign criminals must be deported 11th March 2025 If a foreign citizen commits a crime here, they must be deported. Speeches in Parliament\nProtecting children online 7th March 2025 My speech on the Protection of Children (Digital Safety and Data Protection) Bill. Speeches in Parliament\nLabour are failing small businesses 27th February 2025 My speech in the opposition day debate on the impact of the Government's policies on small businesses. Speeches in Parliament\nBusinesses create growth, not Government 3rd February 2025 It is businesses across Broxbourne and the county that create economic growth, not the Government. Speeches in Parliament\nCalling for more support for entrepreneurs 30th January 2025 Economies grow and jobs are created when individuals are able to take risks and invest in their ideas. Speeches in Parliament\nConfidence in the SEND system must improve 28th January 2025 What is the Government doing to ensure parents have confidence? Speeches in Parliament",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_about-me/content_2.html": "I live in Broxbourne and I'm proud to call it home. I was educated here, at Wormley Primary School and John Warner Secondary School, and my first job was in Hoddesdon town centre.\nI grew up with Conservative values. My mum worked in a factory and my dad was a mechanic. They instilled in me that it was only through hard work that you could provide more opportunities and an improved quality of life for your family. My grandfather ran his own businesses, demonstrating to me the vital role small businesses play in our community.\nHaving lived here my whole life, I was honoured to be elected a local councillor in 2016, then Leader of Broxbourne Council three years later.\nPrior to becoming leader, Broxbourne was the only district in Hertfordshire to have negative economic growth. In my time in charge, this was completely transformed. In my role, I emphasised the importance of job creation and encouraged business investment by cutting bureaucracy. Broxbourne is now open for business, and I left the Council as one of the most business-friendly in the UK.\nTogether, we have attracted billions of pounds of private sector investment, including £400M for a new town centre. This will bring thousands of jobs to the area, and I'm determined to help local people develop the skills required to access them.\nFrom 2021 to 2024, I was the Deputy Police and Crime Commissioner for Hertfordshire. This role provided a unique insight into the work of our brave police force, and first-hand experience of the red tape holding back our public services.\nI have a strong track record of delivery and have gained a reputation as someone who gets things done in all the roles I’ve held. I am not afraid of working hard and, as your MP, will work tirelessly to deliver prosperity and security for everyone in Broxbourne.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_mps-call-government-provide-additional-support-send-services-across-bedfordshire-and/content_22.html": "I have joined with my colleague Blake Stephenson, MP for Mid Bedfordshire, to call on the Government to distribute more resources to SEND services across Bedfordshire and Hertfordshire during a debate in Parliament.\nLast year Hertfordshire County Council received the lowest rating possible by Ofsted and the Care Quality Commission for time it took children to be assessed and helped, with some children found to have been waiting more than 78 weeks for help. And Central Bedfordshire Council was ordered to pay a fine after failing a student with special educational needs.\nSpeaking in a Westminster Hall debate on provision across the two counties, I highlighted the importance of working cross-party and that the Government should improve funding and support for our local councils, families, and children.\nThis issue is very important to me. I have a brother and a sister who have special educational needs, so I have grown up in a family on the frontline.\nHertfordshire deserves the right funding to deal with SEND issues, which will help us to increase the workforce and deal with the capacity issues in the county.\nWhilst summing up the debate, Schools Minister Catherine McKinnell, commented: “We are acting as quickly as we can to respond to the cost pressures in the SEND system because they are causing real financial problems in some local authorities, including in Hertfordshire and Central Bedfordshire.”",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_tackling-delays-caused-roadworks/content_7.html": "Long delays caused by roadworks can have a severe impact, as hundreds of you have told me over the last few months through my survey.\nIn the Commons, I put your experiences directly to the Minister responsible, and demanded more action is taken to minimise delays.\nWhile I was pleased that the Government have listened to my campaign on this, by doubling fines for overrunning work following the debate I led in October, I'll be continuing to press for more action.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_privacy/content_19.html": "This document outlines how Lewis Cocking processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Lewis Cocking\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Lewis Cocking.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Lewis Cocking, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Lewis Cocking via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_cheshunt-asylum-hotel-must-close/content_15.html": "This afternoon I spoke in a Westminster Hall debate on the re-opening of hotels for asylum seekers since Labour came into Government.\nThe Marriott Hotel in Cheshunt has been housing asylum seekers since 2022, and I set out the impact this is having on local residents.\nLabour promised to end the use of asylum hotels, and I'll be holding them to account until they fulfil that promise - and return the Marriott to our community.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_roadworks/content_18.html": "Words can’t describe how annoyed and frustrated I get when I sit in what feels like hours of traffic, across the Broxbourne area.\nWhile I don't have the power to stop roadworks, I am taking action.\nI’ve demanded utility companies meet with me so I can make them aware of the disruption they cause and hold them to account. Work must be carried out quickly, logically and in a way that's the least disruptive to motorists.\nI led a debate on this issue in Parliament on 30 October, which you can read about here.\nI want to hear from you. I want to bring your experiences of long waits in traffic directly to those responsible, and Government Ministers.\nPlease fill in my survey below:",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_roadworks-debate/content_10.html": "After receiving hundreds of responses to my roadworks survey, I led a debate in Parliament on the disruption they cause to us all.\nI will continue to campaign on this issue, and I encourage you to share my survey with your friends and family so I can continue to build a record of disruption in our constituency: lewiscocking.uk/roadworks\nIn my speech, I set out why extra traffic is especially disruptive for us in Broxbourne:\nThe many towns and villages that make up Broxbourne are connected by two main roads, the A10 and the High Street that spans from Waltham Cross in the south to Hoddesdon in the north.\nDemand on these roads, as the main arteries between residential and urban areas, is therefore extremely high.\nAnd if there’s work taking place at any location on our roads, the standstill traffic can affect almost the entirety of Broxbourne.\nAnd the effect this has on our economy:\nThe average driver in the UK lost 61 hours due to traffic congestion in the last year. This is up 4 hours compared to 2022.\nThese delays are costing UK drivers, on average, £558 each. Staggeringly, this means the cost of traffic delays to the country overall was an eye-watering £7 and a half billion.\nPeople looking to enjoy their hard-earned cash are unable to spend as much time at local shops, and small business owners and traders struggle to make appointments on time. The less time people have to earn or spend, the harder it is for our economy to grow.\nThe Chancellor said today economic growth will be her mission for this Parliament, so I hope the Government will recognise that point.\nThe economic cost is especially damaging in Broxbourne, where more people use a car or van to get to work than the national average.\nI brought what you've told me directly to the Government:\nHundreds of my constituents have completed my survey to share their experience of the impact roadworks have on journey times.\nThey have made it extremely clear how disruptive long waits in traffic, caused by roadworks, have been on their daily lives.\nI’ve heard about delays to reach elderly parents, carers finding it difficult to carry out their vital duties and children missing out on the start of the school day.\nIt’s not just car journeys. For many of my constituents, the bus service is a lifeline. And when the roads are gridlocked and buses are inevitably delayed, pensioners in my constituency have told me they’ve simply given up even trying to go out. The knock-on effects of missing serious medical appointments or social isolation are obvious.\nAnd I set out some solutions to this problem:\nLocal authorities and utility companies must communicate much better between themselves, to coordinate works in a sensible and cost-effective way. It cannot be right that the same stretch of road has to be dug up again and again.\nAnd these organisations have to improve how they communicate with the public. It should be easier to find out why disruption is taking place and exactly how long it should be there. We can’t let it be the case that, as my constituents have experienced, residents wake up to find four-way traffic lights and diversions in place that make it hard to even leave their house.\nWe should use technology much better, and come up with innovative ways to avoid static traffic where we can.\nLane Rental schemes allow a highway authority to charge up to £2,500 per day for works on the busiest roads at the busiest times. Charges apply to works carried out by utility companies and highway authorities. This cost incentivises those organisations to move their works, carry them out at less busy times or engage in joint working with others. Around 95% of charges are avoided by taking these steps, meaning disruption for drivers is minimised without additional costs being placed on the firms responsible.\nJust 4 schemes are currently in operation, covering less than 10% of the road network in London and counties in the south of England.\nThese schemes, if expanded across the country, would raise significant funds for local authorities. As the last Government proposed, at least 50% of surplus funds should be directed to the repair of potholes, so drivers can benefit from smoother journeys.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_speaking-about-local-issues-my-first-podcast/content_6.html": "I had a great conversation with Emeka, who has founded a local news platform for our area.\nWe discussed my local campaigns, including tackling roadworks, improving access to local services and securing a Banking Hub in Cheshunt. I also shared my views on Labour's poor economic decisions, and the need to get immigration under control.\nListen to my interview on Spotify, Apple Music and Amazon.\nClick here to find out more about Broxtown.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_cookies/content_13.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_accessibility/content_14.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_news_businesses-create-growth-not-government/content_23.html": "It is disappointing that, under Labour's watch, AstraZeneca has scrapped plans to invest £450m into the UK.\nI challenged the Minister to explain what exactly his Government is doing to actually encourage businesses of all sizes to grow.\nIt is disappointing that, under Labour's watch, AstraZeneca has scrapped plans to invest £450m into the UK.\nI challenged the Minister to explain what exactly his Government is doing to actually encourage businesses of all sizes to grow.",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_buses/content_8.html": "Buses are a lifeline for so many people across the Broxbourne constituency.\nBut day after day, I'm hearing from you that the service just isn't good enough to rely on.\nI want to know how you use local bus services, and what you think needs to get better. I'll be raising these problems in Parliament and bringing your experiences directly to bus operators.\nPlease fill in my survey below:",
  "https_www_lewiscocking_uk_/https_www_lewiscocking_uk_roads/content_24.html": "I detest sitting in traffic jams caused by unnecessary road closures. Utility companies close a road for weeks causing major inconvenience to the public, with very little work taking place. Then weeks later they come along again and dig up the same stretch of road.\nThey do not receive appropriate sanctions for causing havoc on our roads. This incenses me and I will campaign for stricter controls and financial penalties for this."
}