{
  "https_voteajmal_com_/https_voteajmal_com/content_1.html": "Vote Ajmal Masroor\nFor Bethnal Green And Stepney\nContribute to Ajmal’s Campaign\nLabour has betrayed us.\nLet’s send them a message.\nAjmal’s pledges for Bethnal Green & Stepney\nStop the genocide in Palestine\nI’ll fight to end the Genocide and seek justice in Palestine.\n- I will call for an immediate ceasefire and recognition of the State of Palestine.\n- I will work for an immediate halt to all arms sales to Israel and other countries using arms to kill innocent civilians.\n- I will support the Boycott Divestment and Sanctions (BDS) movement\n- I will advocate for a unified state in Palestine-Israel where all residents can live peacefully with equal rights.\nWork with our Mayor on Homes and Schools\nI’ll work with our local mayor to secure homes for all and the best schools for our kids.\n- I believe everyone should have access to decent, safe, and affordable housing, ensuring everyone has a place to call home.\n- I will work with local authorities to start an urgent mass council home-building programme to address the housing shortage and provide secure homes for all.\n- I will campaign to build more homes for people, not empty offices or luxury apartments.\n- I am committed to bringing in rent caps, supporting policies that will lead to a reduction in rents and protect tenants by ending no-fault evictions to protect tenants.\n- I will campaign to push back against the academisation of our schools\n- I will work to address falling school rolls in parts of the constituency\nOppose Labour austerity and protect the NHS\nI’ll oppose Labour’s plans for benefits caps, tax cuts for the rich, and selling off the NHS.\n- I will call for a fair tax system where the wealthy pay their share – including a wealth tax on the richest – reducing inequality and funding essential services to ensure equal opportunities for everyone.\n- I will demand an end to austerity measures and increase funding for essential public services.\n- I will support public ownership of key services and amenities to prioritise people over profits, ensuring a better quality of life for all.\n- I will fiercely resist further NHS privatisation, ensuring it remains a public service, free from corporate influence and accessible to all.\n- I promise to work towards fully renationalising the NHS, restoring it to a true public service.\nAnswer to you, not the rich and powerful\nI’ll answer directly to you, the people, not big companies and the super-rich.\n- I will fight Westminster’s attempts to undermine our elected mayor and get the inspectors out of Tower Hamlets.\n- I pledge to invite constituents to weekly Parliament visits and regular surgeries in Bethnal Green and Stepney.\n- I will hold regular town halls and public meetings to engage with constituents and take their views into account before major votes.\n- I will shine a light on undemocratic lobby groups, push back against the corrupting influence of the super-rich, and challenge corporate power.\nDemand an Ethical and Humane Immigration Policy\nI’ll demand ethical and humane immigration and foreign policies.\n- I will oppose the unfair deportation of immigrants from any country\n- I will work for a humane and refugee policy where that ensures dignity, compassion, and care for asylum seekers.\n- Support the rights of refugees and legal immigrants to work, healthcare, and housing\n- I will seek the prosecution of war criminals at home and abroad\n- We pledge to adopt an ethical foreign policy that condemns and does not support war crimes or oppression.\n- We advocate for an end to arms sales to countries involved in civilian killings.\nChallenge racism and Islamophobia\nI’ll challenge Islamophobia, racism and discrimination.\n- I will demand the scrapping of the PREVENT scheme\n- I’ll use my salary and fundraise to fight Islamophobia in our borough with legal action.\n- I’ll work with lawyers to collect testimony and start the legal process and private prosecutions\n- I will push to have the APPG definition of Islamophobia accepted by all government bodies.\n- I will seek to have the divisive definition of ‘extremism’ dropped.\n- I speak out against racism and discrimination rife within mainstream society and the big political parties.\nProtect Our Families\nI’ll work with you to protect our families.\n- I will work with the mayor and the police to reduce knife crime and anti-social behaviour\n- I pledge to tackle child poverty, hunger, and job insecurity by calling for an adequate social welfare system and reversal of cruel benefit cuts.\n- I will strive to achieve fair wages for all, including above-inflation pay rises for nurses, teachers, and public sector workers, to ensure financial stability and support for all community members.\n- I will press for the cultural and religious sensitives of our children to be taken into consideration in schools.\nGet Ready to Vote.\nPolling Day is July 4 – you must bring Photo ID\nWhy Vote for Ajmal Masroor?\n01\nOnly an independent candidate can beat Labour\nIn the 2022 election the Independent candidate defeated the Labour Party here. We have consistently voted Independent here and we can do it again.\n02\nThe community's choice\n03\nLocal organiser and a national advocate\nVote for Ajmal Masroor and put Tower Hamlets on the right side of history\nMake History\nSupport your Independent MP by volunteering with us today"
}