{
  "https_www_thomasgravatt_org_uk_/https_www_thomasgravatt_org_uk_about-thomas/content_4.html": "Thomas Gravatt is the Liberal Democrat candidate for Southampton Test. He is the best choice to be your next MP. Thomas has worked hard over the past decade to call for improvements across Southampton.\nIn May 2024, Thomas was elected as a Southampton City Councillor in Swaythling overturning a massive Labour majority from 3rd place.\nThomas moved to Southampton in 2014 to study at the University of Southampton where he now works as a fundraiser. He lives locally with his partner Amy who is a Doctor at Southampton General Hospital. Thomas is campaigning to improve road safety in our area and to secure investment in local facilities. If elected as our MP, he will work to secure more funding for our NHS, fight against climate change, and improve Southampton for the better.\nThomas said: “I believe that politics is about people. Politicians need to be there to help local residents when they have problems, and they need to stand up for their area, and their electorate, whether that's in Parliament or in a local council chamber. I have a strong record of working hard and delivering for residents. I pride myself on getting things done, listening to others and standing up for what is right.\n\"Southampton is a fantastic place to live, but it could be so much better. We have been let down by Labour in this city. They have brought the City Council to the brink of bankruptcy, slashed local services and have wasted your money. It needs to stop.\n“Southampton deserves better and I will always stand up for local people. The Liberal Democrats have a positive plan for Southampton, we just need your support to start delivering it.”\nThe Conservative vote is collapsing across Southampton and its clear they wont win here in the General Election. The Liberal Democrats are working hard to stand up to Labour's waste, cuts and inaction in Southampton.\nThe Liberal Democrats have a strong record of success in our area. Vote for Thomas Gravatt to be the Liberal Democrat MP for Southampton Test.",
  "https_www_thomasgravatt_org_uk_/https_www_thomasgravatt_org_uk_contact-thomas/content_3.html": "Thomas Gravatt wants to hear from voters about the issues you are facing in your area. If you have any questions or ideas, please get in touch with Thomas Gravatt using the details below:\nContact Thomas directly\nEmail: thomas.gravatt@southampton-libdems.org.uk\nPhone: 07837 122739\nWhatsapp: 07837 122739\nReport abuse\nPage details\nPage updated\nReport abuse\nThis site uses cookies from Google to deliver its services and to analyze traffic. Information about your use of this site is shared with Google. By using this site, you agree to its use of cookies.",
  "https_www_thomasgravatt_org_uk_/https_www_thomasgravatt_org_uk_home/content_2.html": "Thomas Gravatt\nWorking hard for Southampton\nWorking hard for Southampton\nThomas Gravatt works hard to stand up for local people. He is campaigning to protect vital local services, and is always available when people need help. Thomas will always fight hard for our community and will stand up for local people\nClimate Change is the most important issue facing our country, and our planet. Thomas is passionate about stopping Climate Change with radical plans to reduce greenhouse gas emissions and tackle the nature and wildlife emergency by reducing pollution.\nOne of Thomas's main priorities is fixing out broken political system. Trust in politics is at an all time low and we need radical change to repair our damaged system. Securing proportional representation will help make elections fairer, and will restore public trust in politics.",
  "https_www_thomasgravatt_org_uk_/https_www_thomasgravatt_org_uk/content_1.html": "Thomas Gravatt\nWorking hard for Southampton\nWorking hard for Southampton\nThomas Gravatt works hard to stand up for local people. He is campaigning to protect vital local services, and is always available when people need help. Thomas will always fight hard for our community and will stand up for local people\nClimate Change is the most important issue facing our country, and our planet. Thomas is passionate about stopping Climate Change with radical plans to reduce greenhouse gas emissions and tackle the nature and wildlife emergency by reducing pollution.\nOne of Thomas's main priorities is fixing out broken political system. Trust in politics is at an all time low and we need radical change to repair our damaged system. Securing proportional representation will help make elections fairer, and will restore public trust in politics."
}