{
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_06_01_cllr-danny-keeling-and-the-greens-get-the-first-ever-leader-of-the-opposition-speech/content_28.html": "In May, Cllr Danny Keeling and the Greens get the first ever Leader of the Opposition speech at the inaugural meeting of the political year (for 2023/24) at Newham council.\nThe video can be viewed here\nCllr Danny Keeling giving Leader of the Opposition speechBelow is a transcript of the speech:\nGood evening council, and thank you Chair. It’s wonderful to welcome you to your new position.\nI want to thank the council officers for their exceptional dedication and special recognition to the Interim Chief Executive Colin Ansell for his invaluable support.\nI also want to acknowledge and stand in solidarity with our Ukrainian community – the largest in the country. We condemn the ongoing illegal invasion of Ukraine and we are proud of Newham residents, for their support and hospitality towards Ukrainian families. Although our campaign to host Eurovision in Newham – an event celebrating European unity – was unsuccessful, it truly was Ukraine’s party in our house.\nNewham faces a longstanding cost of living crisis, due in part to the Tory/Lib Dem choice: austerity. Public services have been decimated. The housing crisis is at boiling point, with the fastest rent increases nationwide. Temporary housing conditions, shown by the Ali family, all seven of them forced to live in a house full of mould, is disgraceful. Our air quality is lethal, and the COVID pandemic have only made things worse.\nI’m proud to stand with every striking worker fighting for fair pay and conditions, including desperate healthcare workers and even, our bin workers.\nEnough is Enough! and the Green Party are the only party to have endorsed the campaign’s demands.\nGreens have consistently opposed austerity and we know addressing the cost of living crisis is intertwined with tackling the climate and ecological crises. Meanwhile, Labour’s Sadiq Khan refuses to stop the Silvertown Tunnel. Newham Labour must now back alternatives for the tunnel – starting with supporting our motion.\nAs Greens, we represent almost 20% of voters in Newham. We have been bold and ambitious for what we can achieve – and we have delivered.\nWe have shown that where Greens lead, others follow.\nOur recent successes include overturning the misguided Public Space Protection Order that endangered sex workers. Thanks to the collaboration of Greens, residents, campaign groups, and academics.\nIt was right that the first motion we proposed was in support of Proportional Representation and Votes at 16.\nOur second successful motion affirms our commitment to trans rights. Being in Newham, which has the highest proportion of trans residents in the UK, we take pride in safeguarding their rights.\nThe Tories and the media have got to stop their relentless attacks on my community. As a non-binary councillor, I know we must also change and improve our council’s culture and I’m proud of working with the Interim Chief Executive to establish a Gender Diversity program for councillors. We must also support teachers fighting to educate young people about the wonderful diversity of our society.\nWe take our role as the Opposition seriously. We’ve supported groups like Newham City Farm and attended Beckton Masterplan events. We’ve fought London City Airport expansion where the Labour Mayor Khan is actively backing the use of private jets for the 1% in a climate crisis.\nWe opposed a budget with nearly 20 million £ in cuts whilst the council spent over £160,000 on the coronation, the second highest in the UK. Cllr Higgins blocked a budget scrutiny recommendation to increase minimum residency requirements for housing.\nStratford Olympic Park residents appreciate our regular litter picks, support on community assemblies, fighting for a new zebra crossing, and hosting a community safety meeting attended by over 150 residents.\nWe’ve advocated for residents with various local organisations, ensuring their concerns are addressed. We are proud of challenging East London Energy, achieving a year-long bill freeze and demanding better customer service, we will also continue to fight unjust park charges.\nMost of all, we have been visible. We listen. Greens work hard all year round – residents deserve nothing less!\nWe’re proud of the relentless effort we’ve put into opposing the MSG Sphere. It is an assault on democracy. After six months of Green demands, Mayor Fiaz finally acted to push her Labour colleague Sadiq Khan to take action on the Sphere.\nHowever, this year, we witnessed filibustering, agenda manipulation, and cynical copying of motions. The promised constitutional review must be prioritised now.\nWe’re ready to work constructively with the Labour Group – for Newham’s benefit. I want to be able to find common ground to improve the borough and residents’ lives. We are open to working collaboratively and constructively and I hope to do so in this coming year.\nThank you and we wish you all a lovely evening.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk/content_1.html": "Your local Green Party for all of Newham\nget involved!\nUpcoming Events\n- May 17, 2025: Stratford Olympic Park Litter Pick 17/05/25\n- May 24, 2025: Royal Victoria Litter Pick 24/05/25\n- May 29, 2025: Stratford Olympic Park Action Evening 29 May 2025\nYour local Green Party for all of Newham",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_author_robcallender/content_34.html": "Skip to content\nSkip to footer\nNewham\nMenu\nGet INVOLVED!\nNews\nAbout us\nNewham Green Party\nConstitution\nPeople\nNewham Green Councillors\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nPosts by \"robcallender\"\nrobcallender\nNewham Greens promise ‘tough but fair’ opposition to the Labour council, following announcement of Mayor Fiaz’s cabinet\n13 May 2022\nby\nrobcallender\nRead more »\nNewham Greens Commit to London Cycling Campaign’s #ClimateSafeStreets Pledge\n13 April 2022\n/\n13 April 2022\nby\nrobcallender\nRead more »\nTo top",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2024_01_08_local-green-councillor-reacts-as-msg-sphere-application-is-withdrawn/content_9.html": "Local Green councillor for Stratford Olympic Park Nate Higgins has reacted to the news that the application to build the MSG Sphere has been withdrawn, despite Michael Gove attempting to reverse London Sadiq Khan’s rejection of the projection.\nGreen Councillor for Stratford Olympic Park, Nate Higgins said: “It was always clear that the call in of the MSG Sphere was nothing more than Michael Gove’s reckless attempt to embarrass Sadiq Khan, London’s elected Mayor. Residents and every single elected representative for our area rejected the Sphere, and Michael Gove attempted to overrule us for cynical political purposes. He has failed.”\nThe Sphere was rejected by Sadiq Khan after a groundswell of opposition from residents and elected members. Local Green councillors for Stratford Olympic Park, where the Sphere had been due to be built, Nate Higgins and Danny Keeling have been consistent campaigners against the project, as well the Newham’s Mayor, the local MP Lyn Brown, and the area’s London Assembly member.\nNate Higgins added: “Sadiq Khan’s rejection of the project brought hope that people would finally be listened to. For no benefit to residents whatsoever, Michael Gove put residents through over a month of extra heartache over this completely unsuitable project. The applicants had already made clear they were no longer interested, but Gove called it in anyway. Locally elected members listened, in the end even MSG listened. Only Gove attempts to ignore what residents were saying loud and clear – that’s unacceptable.”\nThe rejection came after over half a decade of campaigning by concerned residents. Nate Higgins explained: “Nobody wants black out blinds imposed on them just for the sake of advertising screens the size of Big Ben and the London Eye, and it’s clear that is all MSG were ever interested in. Residents deserve better than that, and that’s without mentioning the chaos this project would have caused to Stratford Station and the Jubilee Line.”\nCalling for a positive outcome, Nate Higgins finished: “I’ve been saying for a long time now that it’s time for a proposal to come forward that actually contributes to solving Newham’s problems, not making them so much worse. The site can and should be used for social housing to help address Newham’s desperate housing crisis, and I’m calling on Newham Council and the GLA to work to ensure that happens.”\nENDS\nCouncillor Nate Higgins uses he/him pronouns.\nThe MSG Sphere was an application to build a new entertainment venue next to Stratford station in between two major residential developments as tall as Big Ben, which would be coated in a Sphere of LED advertising screens. It had been approved by the London Legacy Development Corporation’s Planning Decisions Committee in early 2022, despite overwhelming opposition from local representatives and residents. In November 2023 Sadiq Khan blocked the Sphere in his stage 2 decision. The Sphere was due to be built in Stratford Olympic Park ward.\nStratford Olympic Park is represented by two Green Party councillors.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2024_03_23_newham-green-party-announces-mp-candidates-as-shock-poll-finds-party-surging-into-second-place-in-all-three-constituencies/content_5.html": "- Greens reveal MP candidates amid a stunning surge to second place, topping the Tories and Lib Dems.\n- Green Party champions open selection process contrasting with Labour’s suspended local parties, ensuring candidates truly represent constituents’ voices.\n- Former Green Party Leader Natalie Bennett: “More and more people are looking for actual change. I’m confident we’re going to elect the next generation of Green MPs at the General Election.”\n- Joe Hudson-Small, candidate for Stratford and Bow: “Green policies will protect our planet, reverse decades of economic inequality, and help people who need it most. More Green MPs in Parliament will be transformative for our country (and the world) and it is time to make it happen.”\nToday at its launch party in East London, Newham Green Party has announced its candidates for each of the three Newham constituencies. This comes as a shock poll from Find Out Now has revealed that the Green Party is now in second place in every constituency in Newham[1], well above the Conservatives or Liberal Democrats. The party also came second in the 2022 local elections and elected Newham’s only opposition councillors for the first time in 16 years.\nNatalie Bennett, former Green Party Leader and Member of the House of Lords, announced the candidates to party members and supporters who assembled in the Royal Docks to celebrate the launch of the party’s General Election campaign. Natalie said: “The Green Party has had a real injection of energy and support in both Newham and Tower Hamlets in the last few years since achieving that breakthrough result in the 2022 local elections. This excellent set of candidates represent the real change that Newham and Tower Hamlets voters are crying out for.“\nThe poll was conducted using the gold standard MRP polling technique to calculate support for each party in each constituency in the country. In 2017, this technique allowed YouGov to be the only pollster to accurately call the 2017 General Election[2] as a ‘hung parliament’. The poll also found the new Stratford and Bow constituency to be the strongest constituency for the Green Party in London, and eighth in the whole country, at a massive 19%, up from a notional 4% in 2019.\nThe Green Party proudly chooses candidates using an open and competitive selection process where any member can put themselves forward and all members get a vote. This is contrasted to the local Labour Party, which has suspended all local democracy in Newham for over three years now, leaving local people with no say in who their candidates are[3]. The party is also proud that all three candidates live in their constituency.\nReacting to her selection as parliamentary candidate for the East Ham constituency, Rosie Pearce said: “I’m pleased to be selected to represent the Green Party in East Ham in the upcoming general election. It’s important East Ham has the opportunity to vote Green at this upcoming election to champion real action on inequality and climate change“. Rosie lives in Upton Park within the constituency and works in health training, saying this “has afforded me valuable insights into the reforms required to enhance local healthcare access“. She is also passionate about education, saying her “work with universities for the past six years has underscored the significance of ensuring true equitable access to education, including early years education”.\nJoe Hudson-Small, who is standing for the new Stratford and Bow constituency and lives in Stratford, said: “People deserve a real choice in this election and our message is one of hope and optimism, not U-turns and broken promises. We’re hearing that many residents are fed up with Keir Starmer’s Labour Party and they want an MP who will support an immediate ceasefire in Gaza“. Joe is a “committed activist for affordable housing and accessible public transport” and is also the party’s candidate for the City and East London Assembly constituency, which the Stratford and Bow constituency is within. The Find Out Now poll suggests Newham’s Muslim community is abandoning Labour to support a party willing to stand up against the genocide taking place in Gaza.\nThe new constituency of Stratford and Bow covers areas in both Newham and Tower Hamlets, and Joe joins Tower Hamlets Green Party’s existing candidates Cllr Nathalie Bienfait standing for Poplar and Limehouse, and Elizabeth Waight who is standing in Bethnal Green and Stepney. The constituency has already elected three Green councillors, with Cllr Bienfait representing Bow West and Cllr Nate Higgins and Cllr Danny Keeling representing Stratford Olympic Park. Joe said: “Stratford and Bow may be one of our best opportunities in London and our local Green councillors have already shown residents what voting Green can do for them.”\nRob Callender, the party’s candidate for Mayor of Newham in 2022 and who is now standing for the West Ham and Beckton constituency, said: “I’m delighted to have been selected as candidate for the constituency of West Ham and Beckton, living myself in the Royal Docks at North Woolwich. I’m passionate about our Green Party values and believe that there can be no climate, environmental and ecological justice without social, racial and economic justice too“. Contrasting his party to the incumbent Labour Party, Rob added: “A Keir Starmer Labour government, almost indistinguishable from the Tories – backtracking on their environmental, climate and social promises – will need robust scrutiny to keep them both in check. The Green Party will do that and more”.\nCommenting after the announcement and reflecting on the national contest, Natalie Bennett said: “The country under Tory rule is in crisis and Labour is promising nothing that will make a difference to the millions who are suffering. More and more people are looking for actual change, and that’s why the Green Party is rightly standing in every constituency for the first time ever to give voters that real choice. I’m confident we’re going to elect the next generation of Green MPs at the General Election“.\nENDS\nFull bios for each of the candidates are available at https://newham.greenparty.org.uk/ge2024/\n- https://www.electoralcalculus.co.uk/blogs/ec_vipoll_20240215.html\n- https://yougov.co.uk/politics/articles/18355-how-yougovs-election-model-compares-final-result\n- https://www.newhamrecorder.co.uk/news/21413087.newham-labour-slammed-party-suspends-east-ham-west-ham-clps/\nNotes for editors:\n- The party’s parliamentary candidates are Rosie Pearce for the East Ham constituency, Joe Hudson-Small for the Stratford and Bow constituency, and Rob Callender for the West Ham and Beckton constituency.\n- Stratford Olympic Park ward, which is within the Stratford and Bow constituency, had the highest average Green vote of any ward in London at the most recent local elections – https://docs.google.com/spreadsheets/d/1k1JjVuQ1TidmDa2YyDsD8XfiQafa596NPAudSNNlPZQ/edit?usp=sharing\n- The MRP poll from Find Out Now puts the Green Party on 19% in Stratford and Bow, 18% in East Ham and 12% in West Ham and Beckton, which puts the party in second place and above the Conservatives and Liberal Democrats in all three constituencies. The full results in the three constituencies are:\n| Constituency | LAB | GRN | CON | LIB | REF | OTH |\n| Stratford and Bow | 60% | 19% | 7% | 7% | 5% | 2% |\n| East Ham | 59% | 18% | 8% | 5% | 6% | 3% |\n| West Ham and Beckton | 67% | 12% | 7% | 5% | 7% | 2% |",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_10_25_newham-green-party-announce-plaistow-north-by-election-candidate-as-newham-labour-branded-too-divided-to-govern-effectively/content_17.html": "- Local mother and autism campaigner Zahra Kheyre announced as Green Party Candidate in the upcoming Plaistow North by-election\n- Recent report into council scrutiny shows poor relationships between Labour councillors are preventing Newham Council being held to account\n- Green candidate for Plaistow North Zahra Kheyre: “The Green Party is at the forefront supporting people with disabilities and the environment.”\n- Leader of the Opposition Councillor Danny Keeling: “Labour are too divided to govern effectively.”\nNewham Green Party, the official opposition on Newham Council, have today announced their candidate for the upcoming Plaistow North by-election. This by-election is due to be held after Labour councillor Daniel Lee-Phakoe resigned from his seat.\nZahra Kheyre, who is a local Mum of three, has been chosen by local Green Party members to represent them in the by-election. Kheyre is an autism campaigner, and supports other parents of children with autism after her own son was diagnosed.\nReacting to her selection, Zahra said: “I am extremely passionate about the community I live in. Children’s education and disabilities has been an area I have been campaigning for. The Green Party is at the forefront supporting people with disabilities and the environment. Representing the Green Party in this election will have a big impact on where I live and I felt it was the right thing to do. I want to achieve a better outcome for the community I represent. “\nZahra has lived in Newham for the past sixteen years and moved to the UK as a child to escape war in Somaliland. After ten years of navigating failing local SEND services, Zhara started an online autism support service, including translating information on autism to Somali and teaching aspects of autism to parents of children with autism. Zahra has organised online webinars with Doctors from America, Pakistan and many Somali professionals, and will be on the Educational Panel for the 2024 Disability Expo.\nDiscussing her family’s own experiences, Zahra said: “Newham council’s SEND services are not good enough and parents are worried their children are not getting the support they have a right to. I have had to take Newham Council to court to fight for what my child deserves. As a councillor, ensuring all children in Newham get the education they need will be a top priority.”\nLeader of the Opposition on Newham Council Councillor Danny Keeling said: “I’m really excited to see local members pick Zahra to represent us in this election. As recent news coverage has shown, Labour are clearly too divided and too busy tearing chunks out of each other to govern effectively. We urgently need more Greens elected to the council to provide the tough but fair opposition we have promised, and I know Zahra will make a fantastic representative for the people of Plaistow North.”\nLocal Green Party members selected Zahra as their candidate with over 60% of the vote with four other members standing for the position.\nENDS\nThe Green Party are Newham’s main and only opposition party elected to Newham Council. Zahra Kehyre uses she/her pronouns. Danny Keeling uses they/them pronouns.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_11_30_stratford-olympic-park-councillor-urges-gove-to-listen-to-residents-on-msg-sphere/content_13.html": "Cllr Nate Higgins, Green Councillor for Stratford Olympic Park, reacting to the Government’s recent intervention in the MSG Sphere application, said: “Every local representative at every level, representing different political parties, opposes the MSG Sphere. The local Green councillors, the Mayor of Newham, the London Borough of Newham planning committee, the local London Assembly Member and Assembly Environment Committee, the local MP Lyn Brown, and even the Mayor of London are united in our opposition to this project on behalf of the people we represent. The democratic will of the people could not be more clear here.”\n“We’ve all seen the MSG Sphere for what it is – a massive advertising billboard masquerading as an entertainment venue that would have inflicted misery on people’s lives, including blackout blinds and incredible disruption at Stratford station. Sadiq Khan was right to reject the application on solid planning grounds. These are the reasons the LLDC should have rejected this Sphere in the first place.”\n“MSG have already said they’re moving on and are selling the land, which Greens have now called to be used for social housing. Even they don’t want this to go on further, inflicting yet more heartache on residents who have lived with the uncertainty for half a decade, and costing yet more public money. For Gove to call in the application now would be an assault on democracy and I’m certain the planning inspector would only reach the same conclusions Sadiq Khan and every local representative already has.”\n“I’m hopeful this intervention is simply procedural. Khan listened, and now must Gove.”\nENDS\nCouncillor Nate Higgins uses he/him pronouns.\nThe MSG Sphere was an application to build a new entertainment venue next to Stratford station in between two major residential developments as tall as Big Ben, which would be coated in a Sphere of LED advertising screens. It had been approved by the London Legacy Development Corporation’s Planning Decisions Committee in early 2022, despite overwhelming opposition from local representatives and residents. In November 2023 Sadiq Khan blocked the Sphere in his stage 2 decision. The Sphere was due to be built in Stratford Olympic Park ward.\nStratford Olympic Park is represented by two Green Party councillors.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_about-us_councillors/content_6.html": "CLLR NATE HIGGINS\nGreen Group Leader (May 2024-Present), Former Green Group Business Manager (May 2022 – May 2024)\nNate was first elected to represent Stratford Olympic Park in May 2022. He is a Software Engineer in his professional life, and has previously served as national press officer for the Young Greens and as Newham Greens co-chair. He has lived across Newham since having to leave university due to finances in 2017 and has lived in the Olympic Park since 2020.\nNate was heavily involved in the successful campaign to Stop the MSG Sphere, a proposed concert venue in his ward which was due to be covered entirely in advertising screens, imposing black out blinds on nearby residents and risking making Stratford station even more dangerous.\nX (Twitter): @natehiggins\nFacebook: @greenatehiggins\nCLLR DANNY KEELING\nGreen Group Business Manager (May 2024-Present), Former Green Group Leader (May 2022 – May 2024), Former Leader of the Opposition (May 2022 – November 2023)\nDanny (they/them) was the first non-binary councillor elected to Newham Council, after being elected to represent Stratford Olympic Park in May 2022.\nTheir priorities are stopping cuts and increasing benefits for those in need, after experiencing needing to use a food bank themselves. Danny also focuses on mental and sexual health to ensure it is more accessible for people.\nDanny values charity work, supporting LGBTQIA+ arts charities and and being awarded Donor of the Year at the Houses of Parliament for the stem cell charity tackling cancer and leukemia Anthony Nolan.\nX (Twitter): @dannny_k\nCLLR AREEQ CHOWDhURY\nAreeq was first elected to represent Canning Town North in May 2022. Areeq is a technology policy researcher and has spent more than a decade thinking about how the internet and artificial intelligence are transforming society.\nAreeq has led the campaign to oppose the use of facial recognition technology by the Metropolitan Police in Newham, proposing the successful Full Council motion.\nX (Twitter): @AreeqChowdhury",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_author_newham-green-party_page_2/content_35.html": "27 April 2023 by Newham Green Party\nRead more »\n22 February 2023 by Newham Green Party\n23 January 2023 / 23 January 2023 by Newham Green Party\n7 April 2022 / 12 April 2022 by Newham Green Party\n5 April 2022 / 11 April 2022 by Newham Green Party",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_donate/content_2.html": "Skip to content\nSkip to footer\nNewham\nMenu\nGet INVOLVED!\nNews\nAbout us\nNewham Green Party\nConstitution\nPeople\nNewham Green Councillors\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nDonate\nDonate\nTo top",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_get-involved/content_8.html": "community activities\nSign up to come to the next community event or to be kept informed about our community activities:\nresidents survey\nTell us what matters to you:\nhelp out\nLet us know how you can help out with Newham Green Party in your area:\ngive your time:\ndonate:\nJOin:\n- May 17, 2025: Stratford Olympic Park Litter Pick 17/05/25\n- May 24, 2025: Royal Victoria Litter Pick 24/05/25\n- May 29, 2025: Stratford Olympic Park Action Evening 29 May 2025",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2022_04_13_newham-greens-backs-the-newham-housing-justice-charter-copy/content_38.html": "The Newham Green Party is pleased to announce our full support for the London Cyclists and Newham Cyclists #ClimateSafeStreets campaign.\nOur Mayoral candidate, Rob Callender, supports all five of the #ClimateSafeStreets commitments and was the first Mayoral candidate in Newham to pledge support on the LCC website. https://lcc.org.uk/campaigns/climate-safe-streets-newham/ All candidates have been asked by the London Cycling Campaign to commit to the following:1. Borough-wide Low Traffic Neighbourhoods and cycle friendly connection between them.\n2. Good quality cycle provision for the whole of Romford Road and Barking Road.\n3. A 20 mph speed limit on all borough roads.\n4. All schools to benefit from school street treatment.\n5. Effective enforcement of parking rules across the borough.\nThese commitments form a key part of Newham Green Party’s plans for improving the borough, with well planned and fairly consulted improvement projects, using infrastructure funding from developers that the council have not yet allocated.\nNewham Green Party believe that these are realistic and achievable targets. More information on these London Cycling Campaign & Newham Cyclists asks is at https://lcc.org.uk/Newham-asks\nThe Mayor of London has committed to a zero-carbon London by 2030. The government has committed to half of all urban journeys being walked or cycled by 2030. Now every London borough including Newham needs to take action to help meet these targets.\nNewham Green Party Mayoral candidate Rob Callender commented:\n“I am very pleased to and wholeheartedly commit to the five Newham Cyclists’ Asks for the 2022 local elections.\nAs well as Barking Road and Romford Roads, we also need to improve safe walking, wheeling and cycling provision in the south and south-east of the borough, which is somewhat neglected.\nI can’t afford to own a car, although I do drive, and I commute to work by bicycle from North Woolwich to Hackney, via the Greenway in the daytime, and home in the dark via the Lower Lea Crossing/Tidal Basin Roundabout and the North Woolwich Road through Silvertown. I am aware of how disjointed cycle provision is in the borough and how much improvement is needed to encourage more people to cycle for every day transport, as well as for health, leisure and sport.\nNewham has been dragging it’s feet for far too long when it comes to action on the environment and climate change. A Green mayor with Green councillors would ensure firm action is taken, with no shying away from the tough decisions needed, whilst ensuring that local residents are part of the process throughout.”",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_about-us_people/content_4.html": "Skip to content\nSkip to footer\nNewham\nMenu\nGet INVOLVED!\nNews\nAbout us\nNewham Green Party\nConstitution\nPeople\nNewham Green Councillors\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nAbout us\nPeople\nPeople\nnewham green party executive committee\nGary pendlebury\nChair\nNate Higgins\nCouncillor, stratford olympic park (Ex-officio)\nRob Callender\nsocial media & internal comms\nJoe Hudson-Small\ntreasurer\nDanny Keeling\ncouncillor, stratford olympic park (Ex-officio)\nDorothy Nalubega\nMembership officer\nrosie pearce\npress & External comms\nrajeev kumar\nwebsite & data coordinator\nmark harris\nelection agent\nareeq chowdhury\ncouncillor, canning town north (Ex-Officio)\njack pickard\nfundraising officer\nTo top",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_09_05_newham-green-councillors-demand-to-know-whats-gone-wrong-as-borough-wide-20mph-set-to-be-delivered-two-years-late/content_27.html": "- Councillor Danny Keeling (Leader of the Opposition, Green): “20mph borough-wide is the right thing to do, but we shouldn’t have to wait two years for safe streets.”\n- Councillor Nate Higgins (Green): “The Mayor promised me this would be complete by October. Councillors are told to wait for safer streets which will now be delivered two years late. Labour must answer: What’s gone wrong?”\nNewham’s Labour Cabinet has today approved a plan[1] to deliver borough-wide 20mph two years later than promised. The policy was in both the Green and Labour manifestos during last year’s local elections.\nCouncillor Danny Keeling (Stratford Olympic Park, Green), who leads the opposition at Newham Council, said: “Introducing a 20mph speed limit borough-wide is the right thing to do, and Greens unequivocally support it. That’s why both parties backed the policy in our election manifestos endorsed by almost 80% of voters. We know that collisions at this speed are significantly less likely and less fatal and that it does not substantially impact journey times. But we shouldn’t have to wait two years for safe streets – that’s not what residents voted for.”\nThe proposal was red-rated in the corporate plan back in November, which means it was at significant risk of failing to be delivered. Councillor Nate Higgins (Stratford Olympic Park, Green) quizzed Labour Mayor Rokhsana Fiaz on the timeline for delivery in a November 29th Overview and Scrutiny Committee Meeting, Mayor Fiaz responded: “My understanding of the October 2023 is that is when it will largely all be complete”.\nNow, just one month before the timeline Mayor Fiaz committed to, cabinet members have today backed a plan that won’t be complete until late 2025. Councillor Higgins said: “The Mayor promised me this would be done by October. Councillors are being told to wait when asking to make dangerous roads in our wards safer for a borough-wide plan to be in place that will now be delivered two years late. Either Mayor Fiaz was wrong when she made that commitment, or something has changed. Labour must now answer: What on earth has gone wrong to delay this plan by two years?”\nCouncillor Higgins, calling for action, added: “If Labour is going to take two years to implement safer roads borough-wide, the council must be responsive to demands for change on individual dangerous roads in the meantime. The council knows which roads are dangerous in my ward because I won’t stop telling them. It’s time for action, not yet more delays”.\nIt has now been 10 months since Mayor Fiaz made that commitment, and the Cabinet is only just now approving the implementation of the borough-wide program over a timeline of two years. Southwark[2] and Camden[3] both appear to have completed their programs within 8 months, and Tower Hamlets[4] appears to have completed their program within 2 months. London Boroughs Healthy Streets Scorecard data shows Newham has the lowest proportion of 20mph streets of any inner London borough at just 41%[5]\nGreens have long been called for 20mph speed limits borough-wide, with Councillor Higgins calling for action at his first Full Council meeting in June 2022: “Greens are delighted to see almost universal support for a 20mph speed limit across the borough. We’re calling on the council to implement this recommendation, there really can be no excuses at this point.”\nCouncillor Keeling finished: “Labour’s delays have real, human consequences. How many collisions will we see in these two years that wouldn’t have otherwise occurred? How many fatalities could have been avoided if Labour had gotten their act together more quickly? These are the questions Labour must now answer.”\nENDS\nNewham Green Party is the largest and only opposition group on Newham Council. Councillor Danny Keeling uses they/them pronouns. Councillor Nate Higgins uses he/him pronouns.\nNotes:\n- https://mgov.newham.gov.uk/documents/s166520/CAF_Cabinet%20Report_Boroughwide%2020mph_%20FINAL_250823.pdf\n- https://moderngov.southwark.gov.uk/documents/s36091/Report%20Making%20Southwark%20a%2020mph%20Borough.pdf\n- https://consultations.wearecamden.org/culture-environment/borough-wide-20mph-speed-limit/\n- https://democracy.towerhamlets.gov.uk/documents/s66263/8.1a%2020mph%20Cabinet%20Report.pdf\n- https://www.healthystreetsscorecard.london/results/results_input_indicators/#Results",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_ge2024/content_21.html": "2024 General Election Candidates\nNewham Green Party are proud to be standing in all three constituencies in Newham, to ensure every Newham resident has the opportunity to vote Green – to reject the tired politics of yesterday which has left our country broken, and to vote for change that only the Green Party are offering. Read the announcement\nRosie Pearce\nJoe Hudson-Small\nStratford and Bow MP Candidate\nRob Callender\nWest Ham and Beckton MP Candidate\nOur Top Priorities\nThe NHS, health, and social care\nThe Green Party costed manifesto will outline the detail of our offer on healthcare – what we can tell you right now is\nthat defending our NHS and making sure everyone have access to free healthcare, is a Green priority.Greens MPs in parliament will push for a properly funded NHS to bring down hospital waiting times and\nstop getting to see your GP or a dentist feel like such an uphill struggle.\nAffordability and availability of housing\nWe have already laid out some of our plans to end the housing crisis including protection for renters through rent controls, and an end to no fault evictions, along with the phase out of leasehold and transformation of the planning system so that new developments come with great community services.The Green Party costed manifesto will outline more detail of how Green MPs in parliament would lead the drive for a\nsafe, warm home for everyone.\nWater quality – sewage in the sea or pollution in rivers\nProtecting our seas and rivers – including our local rivers the Lea, Thames and Roding – from the sewage dumping caused by water companies is a priority for the Greens.Other parties are only committing to half measures on this issue.Greens MPs in parliament would push for water companies to be brought back into public hands to stop the harm being caused to our beautiful rivers and coastlines.\nStandard of living – for you and also for others less fortunate\nThe Green Party costed manifesto will give more detail on how Green MPs in parliament would push for immediate measures to help people address the alarming increase in the cost of living.Practical common sense steps like increasing universal credit by £40 a week and bringing up the minimum wage to £15 an hour for everyone over 16.\nClimate and nature\nWe know that Green MPs would keep Labour ambitious on the climate and help them to recognise now much people value the natural world – access to it and protection of it.The Green Party costed manifesto will give more on our most up to date climate commitments\nCeasefire in the Israel-Gaza conflict\nThe Green Party has consistently called for a lasting ceasefire in Gaza and safe release of the hostages.Our party co-leaders Carla Denyer and Adrian Ramsay, and deputy leader Zack Polanski, have called on both the Conservatives and Labour to throw their weight behind an “internationally arbitrated once-and-for-all settlement” so that “Israeli and Palestinian citizens can live in safety and security with their rights, at last, fully protected.”",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_10_18_green-win-newham-labour-council-forced-to-submit-to-opposition-scrutiny/content_26.html": "- Newham Council approved a report appointing a Green Party councillor to every council committee after seventeen months of shutting Greens off of vital committees\n- Green Councillor Nate Higgins: “Labour have been hiding from scrutiny for too long. Newham voted for change, and we’re going to deliver it”\n- Green Leader of the Opposition, Councillor Danny Keeling: “Greens will work hard to hold this administration to account”\nMonday’s meeting of Full Council has agreed[1] to appoint Green Party councillors to every committee on the council, including vital Audit and Chief Officer Appointment committees. This came after a seventeen-month campaign from Green Party councillors claiming the previous approach was not in line with the law.\nGreen Councillor Nate Higgins (Stratford Olympic Park), who led the campaign, reacted: “This report confirmed that the council was not acting in line with its legal obligations in shutting Green councillors off of vital committees like Audit and Chief Officer Appointments Committee as they have for the last seventeen months.”\nThe council was forced to appoint Greens to committees after legal advice confirmed Green claims that the council was not acting in line with legal obligations. Councillor Higgins said: “We should have and we could have reached this point much sooner. When we were first elected, we made the case that opposition must be represented on our committees. We were told we were wrong. Today’s report confirms they should have listened to us then.”\nDiscussing his difficult experience of campaigning for change, Higgins added: “The Labour Party should have been an ally in fighting to ensure our council met legal obligations but they refused. The abuse and gaslighting I have received from the council and from Labour for consistently making the case for the importance of proper scrutiny which is protected in legislation is unacceptable. It is beyond clear that if I was not willing to face up to and withstand the abuse and the attacks, we wouldn’t be here today. I hope I will receive apologies from those responsible. I fear I will not.”\nHiggins finished: “Last year, when Newham voters chose to have an opposition for the first time in over a decade, they told us that they wanted things to change, and no amount of abuse will stop Greens fighting for that. And now with this report the council can hide from scrutiny no more – we are one step closer to delivering that change.”\nGreen Councillor Danny Keeling, who leads the opposition at Newham Council, said: “Since our election, Greens have been working hard to scrutinise the council across the few committees Labour have allowed us to sit on. Now that legal advice have forced them to accept scrutiny, Greens will work that much harder to hold this administration to account including constitutional changes.”\nENDS\n1. https://mgov.newham.gov.uk/documents/s168579/Political%20proportionality%20-%20Council%20report.pdf\nThe Green Party are Newham’s main and only opposition party elected to Newham Council. Nate Higgins uses he/him pronouns. Danny Keeling uses they/them pronouns.\nThe Local Government and Housing Act 1989 s.15(5)(a) requires that no party can be given all the seats on any council committee. Until now the vast majority of committees have been 100% Labour councillors.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_author_newham-green-party/content_18.html": "23 March 2024 / 23 March 2024 by Newham Green Party\nRead more »\n8 January 2024 / 8 January 2024 by Newham Green Party\n30 November 2023 / 30 November 2023 by Newham Green Party\n20 November 2023 by Newham Green Party\n25 October 2023 / 29 October 2023 by Newham Green Party\n18 October 2023 / 18 October 2023 by Newham Green Party\n5 September 2023 by Newham Green Party\n1 June 2023 / 1 June 2023 by Newham Green Party\n31 May 2023 / 1 June 2023 by Newham Green Party\n14 May 2023 / 14 May 2023 by Newham Green Party",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_news/content_11.html": "Newham Green Party announces MP candidates as shock poll finds party surging into second place in all three constituencies 23 March 2024 / 23 March 2024 by Newham Green Party Read more »\nLocal Green councillor calls for social housing as MSG Sphere application is withdrawn 8 January 2024 / 8 January 2024 by Newham Green Party Read more »\nStratford Olympic Park councillor urges Gove to listen to residents on MSG Sphere 30 November 2023 / 30 November 2023 by Newham Green Party Read more »\nStratford Olympic Park local councillors celebrate as Mayor of London blocks the MSG Sphere application 20 November 2023 by Newham Green Party Read more »\nNewham Green Party announce Plaistow North by-election candidate, as Newham Labour branded ‘too divided’ to govern effectively 25 October 2023 / 29 October 2023 by Newham Green Party Read more »\nGreen win: Newham Labour Council forced to submit to opposition scrutiny 18 October 2023 / 18 October 2023 by Newham Green Party Read more »\nNewham Green Councillors demand to know “what’s gone wrong?” as borough-wide 20mph set to be delivered two years late 5 September 2023 by Newham Green Party Read more »\nCllr Danny Keeling and the Greens get the first ever Leader of the Opposition speech 1 June 2023 / 1 June 2023 by Newham Green Party Read more »\nOur candidates in the upcoming Boleyn and Wall End by-elections 31 May 2023 / 1 June 2023 by Newham Green Party Read more »\nElected Greens and Local Residents welcome Environment Committee’s call for Sadiq Khan to reject MSG Sphere application 14 May 2023 / 14 May 2023 by Newham Green Party Read more »",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_category_uncategorised_page_2/content_29.html": "27 April 2023 by Newham Green Party\nRead more »\n22 February 2023 by Newham Green Party\n23 January 2023 / 23 January 2023 by Newham Green Party\n2 August 2022 / 2 August 2022 by nathggns\n13 May 2022 by robcallender\n13 April 2022 / 13 April 2022 by robcallender\n7 April 2022 / 12 April 2022 by Newham Green Party\n5 April 2022 / 11 April 2022 by Newham Green Party",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2022_05_13_newham-greens-promise-tough-but-fair-opposition-labour-council/content_36.html": "Newham Greens promise ‘tough but fair’ opposition to the Labour council, following announcement of Mayor Fiaz’s cabinet\nNewham Greens promise ‘tough but fair’ opposition to the Labour council, following announcement of Mayor Fiaz’s cabinet\nNewham Green Party has offered congratulations to the councillors selected to serve in Mayor Rokhsana Fiaz’s new cabinet.\nCllr Nate Higgins, newly elected Green Party councillor for Stratford Olympic Park ward, said\n“We’re encouraged that Mayor Fiaz has dubbed this her “getting stuff done” cabinet, and we hope this new cabinet can live up to that name. From tackling the cost of living, to reducing air pollution, litter and flying tipping, anti-social behaviour and hate crime – there is still so much to ‘get done’ in Newham.\nCllr Danny Keeling, the other Green Party councillor elected to represent Stratford Olympic Park ward on May 5th, commented “It is great to see this new council starting to take shape, with Newham Greens as the only opposition in the council chamber. I just really hope that this is not just political rhetoric from the mayor of ‘getting stuff done’, like the Tory government does with ‘leveling up’. As they say, the proof is in the pudding.”\nThis follows the Green Party growing it’s support in the borough, winning two seats and ending Labour’s 12 year run of holding every single seat in the council chamber, making the Greens the official opposition. Overall across Newham, Labour received 100,535 votes (61.56%), whilst the Green Party achieved 27,268 votes (16.70%), now the borough’s second party, pushing the Conservatives into third place on 23,049 votes (14.11%)\nCllr Higgins added “Your Green Party councillors will be tough, but fair, not just for our ward but for all Newham residents, as we work with the new cabinet as Newham’s main opposition party. We will work hard to ensure social and climate justice for our community”.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_05_14_elected-greens-and-local-residents-welcome-environment-committees-call-for-sadiq-khan-to-reject-msg-sphere-application/content_19.html": "- London’s Environment Committee has recommended Sadiq Khan reject the proposed MSG Sphere in his stage two decision[1]\n- The MSG Sphere is a proposed entertainment venue with a ‘skin’ of over 1 million LEDs, capable of beaming adverts through the windows of nearby residential developments\n- Local Green Councillor Nate Higgins: “Sadiq Khan must listen to residents, ward councillors, the Mayor of Newham, and now the Environment Committee and reject the application.”\n- Stop MSG Sphere: “We have long argued that this development will have many detrimental impacts on residents and the local area, including from light pollution. Khan must remember he represents millions of Londoners, not big business based in the United States.”\n- Environment Committee chair Zack Polanski AM: “The MSG sphere would be hugely detrimental both for people and wildlife – and I welcome the growing political consensus in refusing this project”\nThe London Assembly Environment Committee, chaired by Green Party Deputy Leader Zack Polanski AM, has this week published a light pollution report recommending Sadiq Khan reject the proposed MSG Sphere when the application is referred to Sadiq Khan for his stage two decision. This comes after years of campaigning from local campaign group Stop MSG Sphere.\nThe Sphere is opposed by Stratford Olympic Park councillors Nate Higgins and Danny Keeling, who represent the ward it is due to be built in, as well as Newham’s Planning Authority, local Mayor, MP, and London Assembly member.\nGreen Party Councillor Nate Higgins said: “We’re incredibly thankful for the support of London’s Environment Committee in backing our residents’ opposition to the installation of massive LED advertising screens in the middle of a highly residential area. We’ve worked hard to make the voice of residents heard on this – through the press, letters, motions and speeches, and we’re delighted this now has the attention of London’s Environment committee.”\nFour years ago, thousands signed a petition[2] led by local campaign group Stop MSG Sphere. Responding to the report, a spokesperson for the campaign said: “We are delighted the Committee is recommending that the Mayor of London, Sadiq Khan, rejects the MSG Sphere planning application. We have long argued that this development will have many detrimental impacts on residents and the local area, including from light pollution. Khan must remember he represents millions of Londoners, not big business based in the United States.”\nLocal resident who lives opposite the proposed site of the Sphere, Chris Brooks said: “Like so many who live nearby, I’m worried about the damage this proposal would cause. There would be chaos at Stratford Station, which is already dangerous, and the light pollution would be harmful to residents and wildlife. I’m frustrated that the proposal could go ahead despite the opposition of my local councillors and the entire council itself. This report gives me hope that Khan will listen to us and block the Sphere.”\nGreen Party Deputy Leader and London Assembly member Zack Polanski AM, who chairs the Environment Committee, said: “Our cross party report makes clear the detrimental effects of light pollution. Unlike air and water pollution which rightly get considered – the Mayor lacks a strategy for light. The MSG sphere would be hugely detrimental both for people and wildlife – and I welcome the growing political consensus in refusing this project.”\nDespite the widespread opposition by residents and elected representatives at every level, in March 2022 the London Legacy Development Corportation’s Planning Committee recommended the Sphere for approval. It is now down to Sadiq Khan to make his stage 2 decision.\nCouncillor Higgins said: “The MSG Sphere is an assault on democracy. You don’t get this sort of unity among elected representatives in opposition to the Sphere without widespread anger among residents. Sadiq Khan must listen to residents, ward councillors, the Mayor of Newham, West Ham MP Lyn Brown, Assembly Members, and now the London Assembly’s Environment Committee and reject the application.”\nCalling for action, Stop MSG Sphere’s spokesperson added: “Join us and the Committee in urging Khan to reject the MSG Sphere by emailing mayor@london.gov.uk.”\nGreens have long opposed the MSG Sphere. In the 2021 London Mayoral Election, Green candidate Sian Berry AM signed a pledge to oppose the Sphere, and in August 2022 wrote to Sadiq Khan asking him to reject the application[3]. Green councillors Nate Higgins and Danny Keeling, who both represent Stratford Olympic Park, wrote to Sadiq Khan in December 2022[4] asking him to intervene. Greens also led a campaign from July 2022 to February 2023 calling for the Mayor of Newham to ask for Khan to reject the application, which was ultimately successful[5].\nThe application will soon be referred to Sadiq Khan for his stage 2 decision, after which Secretary of State Michael Gove MP will have the opportunity to call in the application. The campaign to Stop the Sphere will continue.\nENDS\nCouncillor Nate Higgins uses he/him pronouns. Zack Polanski AM uses he/him pronouns. Chris Brooks uses he/him pronouns.\nNotes\nThe Green Party is the main and only opposition party elected to Newham Council.\n- https://www.london.gov.uk/sites/default/files/2023-05/Environment%20Committee%20-%20Light%20Pollution%20Report.pdf (page 5)\n- https://www.change.org/p/lldc-stop-the-msg-london-sphere\n- https://www.london.gov.uk/programmes-strategies/publication-sian-berry-letter-mayor-recommending-he-refuse-planning-msg-sphere\n- https://drive.google.com/file/d/1sQxMGEP0YKtVWi7zhL-1TUALEDWHciWb/view?usp=sharing\n- https://newham.greenparty.org.uk/2023/02/22/newham-mayor-accepts-green-demands-to-intervene-on-msg-sphere/",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_ge2024_rosie-pearce-for-east-ham/content_20.html": "Rosie Pearce\nGreen Parliamentary Candidate for East Ham\nI live in Upton Park, within East Ham. I’m often found relaxing in the local green spaces, with Central Park a particular favourite.\nFor over a decade, I’ve proudly aligned myself with the Green Party, finding resonance in its values and policies that advocate for a sustainable future.\nClimate change isn’t just a distant threat; it’s a personal concern that affects each of us. However, its impact disproportionately burdens the most vulnerable among us while sparing the affluent, locally and globally.\nPoor air quality claims the lives of 96 residents annually in Newham, and inflicts irreversible harm on the developing lungs of our children. It’s an injustice that we’re compelled to breathe polluted air, especially when the cleaner alternatives to emitting activities are not only feasible but also enrich our lives.\nEncouraging active transport, such as walking and cycling, not only promotes a healthier lifestyle but also enhances local air quality and mitigates global temperature rise. Yet, the realisation of these choices necessitates safer routes and greater accessibility which requires political intervention.\nMy background and experiences equip me to advocate effectively for East Ham in Parliament. Through my education and involvement in politics and policy-making, I’ve learned how to navigate the legislative process to enact meaningful change. Recognising that the role of an MP extends beyond legislative duties, I am committed to addressing the concerns of East Ham constituents and tirelessly working to resolve their personal issues.\nMy current job in health training structures has afforded me valuable insights into the reforms required to enhance local healthcare access. Moreover, my work with universities for the past six years has underscored the significance of ensuring true equitable access to education including to early years education.\nI eagerly anticipate engaging with East Ham residents throughout the election period and beyond, amplifying their voices and championing their concerns. I will strive to enhance the quality of life for all inhabitants of East Ham, fostering a community that thrives on sustainability, equity, and opportunity.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_about-us/content_14.html": "About Us\nSince 2022, we have been Newham’s second biggest party, as the main opposition party elected to Newham Council at the last local elections. We ended 12 years of Labour one-party rule.\nThe Green Party is growing fast. We now have four MPs in Westminster and have a record number of local councillors, as well as three members of the London Assembly.\nWe’re working progressively on local issues; to improve the lives of all people in Newham, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Newham.\nClick to view our Mayoral manifesto from 2022 which drives our priorities on the council. You can also take a look at our most recent alternative budget – A Green Budget for a Fairer Newham (24/25 Budget Amendment)\nThe Green Party Political Programme sets out what Greens are in politics to do: to end the system that keeps hurting the environment and all of us who rely on it – and to build a better alternative.\nThis Programme isn’t like other parties’ manifestos, it has not been squeezed through focus groups and stripped down according to the latest polling. Instead it has been built from policies proposed and voted on by our members, looking to secure the long term future of the places and people they love.\nIt’s a vision of a better world, and together we can deliver it.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2022_04_05_newham-greens-announce-a-full-slate-of-candidates-in-the-2022-local-elections/content_24.html": "Newham Greens announce a full-slate of candidates, with aims to elect the first opposition councillors since 2006 and to beat the Conservatives\nThis slate represents the party’s most diverse set of candidates ever\nNewham Green Party has today announced it will be fielding a full slate of candidates in the 2022 Local Elections, a total of 66 candidates across all 24 wards of Newham, and a candidate for Mayor of Newham. The party aims to elect the first opposition councillors in Newham since 2006, in Stratford Olympic Park and Beckton wards, and to beat the Conservatives to become Newham’s second party.\nIn 2018, the Newham Green Party stood just 11 candidates, making this a six-fold increase in the number of candidates. 2018 itself was a six-fold increase on 2014, when the party stood just two candidates. In 2018, the party won more votes per candidate standing than any other party except Labour[1]. Standing 66 candidates places the party in a strong position to beat the Conservatives across Newham and to firmly define itself as Newham’s second party. No other currently active national party has ever succeeded in fielding a full slate of candidates in Newham, besides Labour and the Conservatives.\nNate Higgins, co-chair of the Newham Green Party, who is standing in Stratford Olympic Park said: “When I set out over a year ago to recruit the widest and most diverse slate of candidates the Newham Green Party has ever fielded, I never even dreamed we would be this successful. In one of the most diverse and young London Boroughs, I am proud we have a slate of candidates who are more like the people we wish to represent than ever before, and who share their experiences. With 66 candidates in this election, we are now in a fantastic position to beat the Conservatives across Newham for the first time ever, and to elect some opposition councillors. I know through my year-round hard work in my home ward of Stratford Olympic Park how excited people are about having the chance to vote Green for the first time, and I know we can win.”\nThis slate of candidates represents the party’s most diverse ever, with a wide range of ethnic minority, women, young, working class, and LGBTIQA+ candidates. This includes Nate Higgins and Danny Keeling in Stratford Olympic Park; Solveig Bourgeon, Karen Webb Green, and Alison McLucas in Beckton; Jacintha Christopher in Plaistow West & Canning Town East; and Sean Labode in Custom House. Rob Callender is standing to be the first Green Mayor of Newham. All of these candidates represent at least one of these diversities, and almost every ward has at least one woman or non-binary candidate standing.\nDanny Keeling, co-chair of the Newham Green Party and candidate in Stratford Olympic Park said “When the Conservative government is failing to protect people from its self-imposed cost of living crisis, pushing some of the most vulnerable people yet further into poverty, and the Labour Party has very few ideas on what to do differently, the Green Party stands ready to give Newham voters the chance to use all of their votes on a Green Party candidate for the first time ever. Greens will not let the people of Newham down like Labour and the Conservatives consistently have.”\nENDS.\nNotes\n- https://docs.google.com/spreadsheets/d/1kuZw6W7drNL3wlqiqhVrCpcWPdSNYYJKERgbgBFwx98/edit?usp=sharing\nPlease note, Nate Higgins’ pronouns are he/him and Danny Keeling’s pronouns are they/them.\nThe full list of candidates is below. Please note these are yet to be confirmed by the London Borough of Newham, which will happen this week.\n| Name | Ward |\n| Solveig Bourgeon | Beckton |\n| Karen Webb Green | Beckton |\n| Alison McLucas | Beckton |\n| Peter Bright | Boleyn |\n| Helen Lynch | Boleyn |\n| Roxana Toderascu | Boleyn |\n| Charlotte Croft | Canning Town North |\n| Oscar Lessing | Canning Town North |\n| Cassie Leanne Thomas | Canning Town North |\n| Oliver Reynolds | Canning Town South |\n| Deb Scott | Canning Town South |\n| Benjamin Ian Smith | Canning Town South |\n| Gareth Bannister | Custom House |\n| Sean Labode | Custom House |\n| Rupa Sarkar | Custom House |\n| Mark Lamptey-Harding | East Ham South |\n| Alex Mchugh | East Ham South |\n| Liam Palmer | East Ham South |\n| Tim Boxall | East Ham |\n| Maddy Catriona | East Ham |\n| Ed Toso | East Ham |\n| Gary Pendlebury | Forest Gate North |\n| Mike Spracklin | Forest Gate North |\n| Ben Beeler | Forest Gate South |\n| Kieren Jones | Forest Gate South |\n| Emma Sorrell | Forest Gate South |\n| Tassadduq Cheema | Green Street East |\n| Joe Hudson-Small | Green Street East |\n| Rose Waddilove | Green Street East |\n| Ron Harris | Green Street West |\n| Adam Mitchell | Green Street West |\n| Joseph Henry Sorrell-Roberts | Green Street West |\n| Terrence Stamp | Little Ilford |\n| Amy Wilson | Little Ilford |\n| Waleed Zuoriki | Little Ilford |\n| Deyan Atanasov | Manor Park |\n| Ros Bedlow | Manor Park |\n| Jenny Duval | Manor Park |\n| Chris Brooks | Maryland |\n| Ainsley Vinall | Maryland |\n| Elsa Malki | Plaistow North |\n| Francis Moore | Plaistow North |\n| Aki Turan | Plaistow North |\n| Nicholas Drew Dowden | Plaistow South |\n| Iain Mckeil | Plaistow South |\n| Anca Zahan | Plaistow South |\n| Jacintha Christopher | Plaistow West & Canning Town East |\n| Christopher Luke Slevin | Plaistow West & Canning Town East |\n| Peter Whittle | Plaistow West & Canning Town East |\n| Stephen Charles | Plashet |\n| Joshua Robinson | Plashet |\n| Jane Lithgow | Royal Albert |\n| Daniel Rodrigues | Royal Albert |\n| Rob Callender | Royal Victoria |\n| Gloria Goncalves | Royal Victoria |\n| Nate Higgins | Stratford Olympic Park |\n| Danny Keeling | Stratford Olympic Park |\n| Pau Ingles | Stratford |\n| Moira Lascelles | Stratford |\n| Ed Lynch | Stratford |\n| Melanie Bax | Wall End |\n| James Peter Buttress | Wall End |\n| Matthew Talbot Savage | Wall End |\n| Clare Hardy | West Ham |\n| Lyubo Ivanov | West Ham |\n| Ben Parker | West Ham |\n| Rob Callender | Mayor of Newham |",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_author_nathggns/content_32.html": "Skip to content\nSkip to footer\nNewham\nMenu\nGet INVOLVED!\nNews\nAbout us\nNewham Green Party\nConstitution\nPeople\nNewham Green Councillors\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nPosts by \"nathggns\"\nnathggns\nCllr Nate Higgins’ July Update (and Out of Office!)\n2 August 2022\n/\n2 August 2022\nby\nnathggns\nRead more »\nTo top",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_category_uncategorised/content_25.html": "23 March 2024 / 23 March 2024 by Newham Green Party\nRead more »\n8 January 2024 / 8 January 2024 by Newham Green Party\n30 November 2023 / 30 November 2023 by Newham Green Party\n20 November 2023 by Newham Green Party\n25 October 2023 / 29 October 2023 by Newham Green Party\n18 October 2023 / 18 October 2023 by Newham Green Party\n5 September 2023 by Newham Green Party\n1 June 2023 / 1 June 2023 by Newham Green Party\n31 May 2023 / 1 June 2023 by Newham Green Party\n14 May 2023 / 14 May 2023 by Newham Green Party",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_news_page_2/content_22.html": "Newham Mayor accepts Green demands to intervene on MSG Sphere 22 February 2023 by Newham Green Party Read more »\nGreen Councillors Win on Support for Trans Rights at Newham Council 23 January 2023 / 23 January 2023 by Newham Green Party Read more »\nCllr Nate Higgins’ July Update (and Out of Office!) 2 August 2022 / 2 August 2022 by nathggns Read more »\nNewham Greens promise ‘tough but fair’ opposition to the Labour council, following announcement of Mayor Fiaz’s cabinet 13 May 2022 by robcallender Read more »\nNewham Greens Commit to London Cycling Campaign’s #ClimateSafeStreets Pledge 13 April 2022 / 13 April 2022 by robcallender Read more »\nNewham Greens backs the Newham Housing Justice Charter 7 April 2022 / 12 April 2022 by Newham Green Party Read more »\nNewham Greens announce a full slate of candidates in the 2022 local elections 5 April 2022 / 11 April 2022 by Newham Green Party Read more »",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_ge2024_rob-callender-for-west-ham-and-beckton/content_10.html": "Rob Callender\nGreen Parliamentary Candidate for West Ham and Beckton\nI’m passionate about this constituency, living myself in the Royal Docks at North Woolwich.\nI want to ensure our area is clean, safe and has good public services with a built – as well as a natural – environment to be proud of, that ensures it’s residents can live healthy and happy lives.\nI’m passionate about the policies and values of the Green Party that will improve the lives of everyone. After all, there can be no climate, environmental and ecological justice without social, racial and economic justice too. This is why I have fully supported a lasting ceasefire in Gaza and the safe release of the hostages. That means, in parliament, I will fight to ensure not just equality for all but to go further – to ensure equity for all, improving the opportunities people have in their lives.\nI am a pragmatic Green. Tough decisions need to be made to ensure that we have a planet inhabitable for future generations, with a healthy ecosystem and clean air. The way we do things may need to be a little different. Those that can afford it – the top 1% of earners – should contribute more, and carbon emitting businesses making unexpected huge profits should pay pay windfall taxes.\nA Starmer’s Labour government, almost indistinguishable from the Tories – backtracking on their environmental, climate and social promises – will need robust scrutiny and a strong presence in parliament to prevent them veering ever more to the right. The Green Party will do that and more.\nI want to make a better greener West Ham & Beckton, a better greener country, a better greener world.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2022_08_02_cllr-nate-higgins-july-update-and-out-of-office/content_37.html": "Eurovision, East London Energy, Council Tax Rebate, MSG Sphere, Walking and Cycling Update (Honour Lea Avenue safe crossing), Litter, Park Charge, and Abercrombie Road\nFirst things first, I’m going to be away for a week from tomorrow. I’ve been told my council email is unlikely to work out of the country, so if you have any urgent queries, please reach out to Cllr Danny Keeling at danny.keeling@newham.gov.uk. Similarly if you have any queries with me at the moment that haven’t yet been addressed, and you need those addressing, please reach out to Cllr Keeling.EUROVISION\nThank you to those of you who talk part in discussions with me about whether you’d like to see Eurovision come to London/Newham. After it was confirmed that the BBC would be hosting Eurovision in the UK, I reached out to the Chair of Council to see if they would grant permission for an Urgent motion calling for Newham Council to support a London bid, and recognising Newham as having the highest Ukrainian-born population which was thankfully granted. Unfortunately, the Chair then pulled permission for this for reasons that aren’t particularly clear. Nonetheless, it’s fantastic to see that our calls to hold Eurovision in Newham has been covered in the press. https://www.mylondon.news/whats-on/whats-on-news/eurovision-uk-host-sam-ryder-24650582 It’s unfortunate we weren’t able to hear my motion at this Full Council, but we’ll see where we are in September. I think it’s so important we ensure Eurovision is a moment of European solidarity with Ukraine, and that we hold the most Ukrainian Eurovision possible. There are some more details including the full text of my motion on my Twitter thread at https://twitter.com/natehiggins/status/1554537064808562688?s=21&t=9n9vPfXdePQtGEtOTOkEUgEAST LONDON ENERGY\nThank you to everyone who attended our public meeting with Mayor Rokhsana Fiaz and Hackney Wick Councillors on East London Energy. There was some really helpful information coming out of that and the beginning of some plans that sound really promising. I’ll be sharing the recording as soon as I’m able to – I haven’t yet received it. Thank you to Mayor Fiaz for hosting and for agreeing to do the event together to avoid the need to duplicate work! It looks like there’s promising opportunities for contract renegotiation, and both Mayor Fiaz and myself are working on getting the full details of the contract made public. Thank you to the Chobham Manor Residents Association and particularly Nigel Godfrey for shedding some light on the pricing structure and inefficiencies in the network, which will be helpful on further action.COUNCIL TAX REBATE\nThank you to everyone who has emailed me about the council tax rebate. I’m glad I’ve been able to help in some cases, but for people still waiting to receive theirs, some of whom who will be waiting to hear back from me on this too, I wanted to provide some more information on what has been going on. I also want to apologise if you are waiting – it’s been a tricky environment to get clear information on, and I started to somewhat distrust what I was being told, and I was worried about passing on information which turned out not to be true. When the first requests started coming RE unpaid council tax rebates, I passed these on to the council, and for most of them was told that manual payments had been made in response to the complaint, and that resident would receive the money within a few days. In a large number of cases, many of these residents still did not receive the money for weeks after (and some still do not have it). I developed a real lack of trust in what I was being told by officers. I had a question to Full Council yesterday (which was postponed from the 18th of July) to try to begin to address some of what has gone on here, and have also escalated this complaint to the Chief Executive of Newham council. Through this, I have learned there has been a number of technical problems, causing delays of weeks or more, and also issues with identity verification. Communication on this has been less than ideal, leaving me and the residents I’ve been trying to help in the dark. I didn’t want to put any more residents through this stressful process where we were being promised that things would happen that then did not. But now that I have gotten to the bottom of this, I’m hoping to be able to help. For many people who pay be direct debit, if you still have not been paid, there’s a strong chance that this has been caused by an issue with identify verification. The UK Government places strict requirements on councils to verify the identity of anyone it is sending money to under this programme. If the council does not do this, then it won’t be reimbursed by the Government for the payments. Councils do this verification on a platform provided by the Government, and all payments must wait for this approval before being sent. This platform does not provide a reason when verification fails. The council’s back up plan when this happens is to credit council tax accounts with the £150 instead, which it has permission from the Government to do. Where this is due to happen, letters about this are now in the process of being sent. This letter will set out the timeline of when this will happen, which I have not been informed of. The council is still working out the technical details here. I know this isn’t ideal. I asked a further question about this at Full Council yesterday, particularly in relation to the timeline, but this wasn’t entirely clear. I’m hoping to be able to follow this. One of the main problems is where there are joint names on the bank account and not on the council tax account, or vice versa. I pressed that communication could have been clearer on this. If you’d like to see the full exchange on council tax rebates at Full Council yesterday, you can do this at https://youtu.be/q7tOYr8rbxU?t=6195 If you are still waiting to hear from me, and you urgently need support due to a lack of payment, please contact Cllr Danny Keeling at danny.keeling@newham.gov.uk or Cllr Charlene McLean (cabinet member for Resident Engagement and Resident Experience) at charlene.mclean@newham.gov.uk as I am unlikely to be able to reply within the next week. There may be something that can be done to get the support you need.MSG SPHERE\nI know many residents will be concerned about the recent approval of the MSG Sphere by the London Legacy Development Corporation. I had a motion before Full Council yesterday which aimed to get the Mayor of London to get involved. Whether you support the development or not, it cannot be okay that every elected member representing the community has expressed opposition except for Sadiq Khan, and for the sphere to go ahead. Sadiq Khan has not yet expressed a position, but he does have the power to get involved. Unfortunately, this motion was derailed after the Chair of Council refused to allow a series of votes on multiple amendments to the motion, instead aiming to combine all the votes. This led to really complex debates over amendments to amendments, which burnt all the time that we had. It will now be heard in September. My view is that the Chair’s actions were unconstitutional, and I’ll be writing to the Council’s Monitoring Officer to officially complain. It’s unclear what the motivation for making this decision was, but many attendees at Full Council also agreed that the decision to combine the votes was not allowed under the rules, and it predictably led to complete chaos wasting everybody’s time. This was completely predictable. I’m quite frustrated that this happened, and will be seeking answers. I know that some residents do support the Sphere. I have to say I think from my conversations with residents, this is a minority view, but your view is valid and respected. The issue is that the process by which it has been decided to approve it is democratically illegitimate in some many ways to so many people, that we have to fight for residents views to be heard. This kind of action undermines public consent for all kinds of development. Nobody moves to the Olympic Park expecting it to stay exactly the same, but being told to install blackout blinds or to put cyclists lives at risk at Angel Lane or to put Stratford station at further risk of fatal overcapacity issues can not be accepted. The full text of the MSG Sphere motion, and the various amendments, is available at https://mgov.newham.gov.uk/documents/s157687/Order%20Paper%20V.2.pdfWALKING AND CYCLING UPDATE (HONOUR LEA AVENUE SAFE CROSSING)\nLast week I met with LLDC’s Walking and Cycling project manager twice in an attempt to push the need for a safe crossing, and fixing of dropped kerbs, on Honour Lea Avenue. I can happily confirm that this project is very high up the list of priority projects for her, and that a decision is due to be made on funding of these projects this autumn. I came away from the meeting very satisfied that she understood just how pressing this work is. I will communicate any more I hear on this. I also understand now that a closure of Olympic Park Avenue is very unlikely due to the use of it for deliveries / transport to the Velodrome. However, the bridge at Olympic Park Avenue / Westfield Avenue may become one way, and work is being done to consider a change to the junction at Abercrombie Road / Temple Mills Lane. Both of these things will reduce the likelihood of Olympic Park Avenue being used as a rat run. I’m also convinced we will see action on Leyton Road and some surrounding streets to make these safer for cyclists. It’s important that we make safe routes for cyclists – not just to keep them safe – but to keep people safe in our mixed spaces. I know so many people are concerned about the risk to people from Uber/Deliveroo riders (who, to be clear, are being put under increasingly unreasonable delivery time expectations), and if there is safe and satisfactory cycle infrastructure, I believe this will help keep our children and elderly residents safe. I should have more to say on this in September/October.LITTER\nAnother one of my questions at Full Council yesterday was about litter, and I was able to speak to the relevant cabinet member after council too. You can see this exchange at https://youtu.be/q7tOYr8rbxU?t=6083 It’s clear that more needs doing to protect our community from the litter we see during and after the large scale events held in our community. I’m hoping to arrange a conversation between relevant partners from LLDC/TfL/Newham council to see more done on this.PARK CHARGE\nThere isn’t much to say about this just yet, except that we’ve been informed that the relevant Deputy Mayor at the Greater London Authority has started an investigation into the Park Charge with a decision on action due by the end of September. Unfortunately, submissions from residents aren’t due to be part of this investigation (I asked!) but there are a wide range of stakeholders involved including:- Barge East\n- Bobby Moore Academy\n- Chobham Manor LLP\n- Chobham Manor Residents Association\n- EastBank Partners, including UCL\n- East Wick/Sweetwater LLP\n- East Wick/Sweetwater residents\n- Get Living London\n- Greenwich Leisure Limited\n- Here East\n- International Quarter London\n- Lee Valley Regional Park Authority\n- London Borough of Newham\n- London Borough of Hackney\n- London Borough of Tower Hamlets\n- London Legacy Development Corporation\n- Mossbourne Riverside Academy\n- Westfield\n- Undertake a fact-finding review of the Fixed Estate Charge at Queen Elizabeth Olympic Park\n- Review similar models and how they operate\n- Take evidence from stakeholders on their view of the charge and funding the Park\n- Consider alternative funding approaches\n- Analyse the long-term financial sustainability of the Park\n- Make costed recommendations to the Mayor on the future of the charge.\nABERCROMBIE ROAD\nI am well aware of Abercrombie Road being used to race cars, making a huge amount of noise, creating severe danger for residents, and adding to anti-social behaviour. I discovered this was not on the council’s list for the proposed Public Space Protection Order consultation, and I have asked them to look again at whether it qualifies.All of that being said, I hope everyone has a fantastic summer and I hope to see some of you about over the next few weeks!",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_05_31_our-candidates-in-the-upcoming-boleyn-and-wall-end-by-elections/content_12.html": "We are excited to announce our candidates in the upcoming Boleyn and Wall End by-elections\nJoe Hudson-Small\nand Tassadduq Cheema.\nLast year Newham Green Party made history – finally breaking the one-party state that Labour had control of for 16 years, electing two Green councillors.\nNow Newham has the opportunity to elect two more!\nWe have two amazing committed candidates chosen by our local members:\nTassadduq Cheema in Wall End and\nJoe Hudson-Small in Boleyn.\nThese were rightly incredibly competitive selections – meanwhile Labour’s two candidates have been handpicked by Keir Starmer – shutting out local members.\nAbove all the critics, and the complacent Labour councillors, Nate Higgins and Danny Keeling won in May 2022 by 51% to Labour’s 34% – the biggest Green vote in London.\nWe overtook the Conservatives and Liberal Democrats, becoming Newham’s undeniable second party.\nIt shows that Newham wants change but they need to invest in a party they can trust and that will beat Labour.\nFor the last year Nate & Danny have been working even harder standing up for residents in Stratford Olympic Park, as well forming Newham’s first Official Opposition in almost two decades. They’ve been sitting on committees and holding the council to account at full council, with Danny even giving the first Leader of the Opposition speech in May.\nResidents are telling us how much they appreciate the hard work and visibility of our Green councillors.\nWe thought we would have to wait until 2026 to give more residents in Newham the opportunity to choose something new for their communities. But two Labour councillors have now resigned triggering two by-elections – one in Boleyn and one in Wall End.\nBoleyn itself has had 11 councillors in 10 years due to resignations and the Greens report that residents in Boleyn have told them “we feel like we are being taken for granted, people get elected then resign after a year”.\nWith the success of the Greens in the local elections where the Greens won x amounts of seats in the the 2023 elections and the first full control of a council in Mid-Soffolk, Newham Green Party are punching through to get more councillors to add to the opposition in the council.\nLeader of the Opposition, Cllr Danny Keeling says “Both Joe and Cheema would make excellent councillors, representing the best for their areas, we have proved to Newham we are electable and are the true left wing opposition. However I won’t be complacent here, we appreciate every single vote that comes our way to ensure we can hold this administration to account.”\nThe Green Party have a poll of 190 residents in Boleyn ward, stating their voting intentions are Labour on 43%, Greens on 34% and Lib Dems 13% and Conservatives on 10%.\nCandidate for Boleyn is Joe Hudson-Small who used to live in Boleyn before illegally evicted, he is standing to save Queens Market, stop cuts by Labour and to hold this council to account due to the sheer numbers that Labour usually win.\nWe have proven we can win in Newham against all the odds – and win big. We work hard, and we take nothing for granted. We are still a small party – though we may be Newham’s second party we are far from the second wealthiest, so we do rely on our members and supporters.\nHowever big or small the donation is, we appreciate it just as we do each as we do every vote and every minute of support people give us.\nBut every little helps.\nWe’re really inspired by all the people coming forward to say how much of a difference they feel Nate and Danny are making here in Newham. But with more Green councillors, we could do so much more, and we need to ensure we have the resources to make the best use of this amazing enthusiasm.\nIf you want to see more Greens in the council chamber, arguing for a truly green and people-powered future for our great borough, donate now to ensure Newham residents hear our message.\nWe know it’s a difficult time at the moment, so if you are unable to donate your money – just as important will be your TIME once we’ve spent the money we receive on election materials to get them through people’s doors to reach as many people as possible.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2022_04_07_newham-greens-backs-the-newham-housing-justice-charter/content_31.html": "The Newham Green Party fully supports the London Renters Union and the Newham Housing Justice Charter. We believe everybody deserves warm, dry, secure, and comfortable homes safe from eviction, as a basic human right. No one should be faced with having to leave their home borough, and their support networks, in order to receive that. No one should be unable to eat because they’re spending too much on rent.\nGreen councillors will demand the Labour council end the shipping of already vulnerable people out of the borough into parts of the country they have never been to and do not know anybody. We understand there is no substitute for the security that a safety network of family and friends can provide. Community has never been more essential. As part of our work on fighting for better treatment of those struggling with their mental health, we will demand this be taken seriously when assessing housing applications.\nThe Green Party at all levels have long been arguing for rent controls and better conditions for renters. As a renter herself, Sian Berry, Green London Assembly member and candidate for Mayor of London first called for a London Renters Union in January of 2016[1]. Sian has fought for a genuine living rent, and in December 2021 launched a new campaign to fight for local rent controls[2]. The Newham Green Party fully endorses Sian’s pledge to stand with renters[3], including rent controls and an abolition of no-fault evictions. Greens are fighting for a Rent Commission for London to finally put rents on a downward trajectory. Greens back calls for rent payment history to be included in mortgage affordability assessments and credit ratings, and 100% mortgages to extend housing ownership to those who want it.\nNewham must be a borough for renters. Greens will revoke the Additional Licensing designation which has all but banned young people, who are significantly more likely to form parts of Houses in Multiple Occupancy (HMO), from renting in most parts of Newham, reducing the pressure on rents in Stratford and the surrounding area, while fighting for rent controls and building more homes to ensure rents do not rise elsewhere in the borough.\nThe Newham Green Party understands that landlords make an incredible amount of money from their tenants, often with very minimal work leading to tenants suffering under terrible and often illegal conditions. The council must play their part in fighting this, by using their powers to prosecute landlords who breach licensing conditions, and Greens will ensure the council is resourced to do this. The council must not cooperate with the Government’s hostile environment as part of this.\nTemporary housing is too often nothing of the sort. People are languishing on housing waiting lists in substandard and unsuitable housing. It is not sufficient to place “affordable” or “social” housing quotas on developers – we need to build genuine council homes at a rate not seen for generations. Green councillors will add to the call for an end to the right to buy, and will fight for councils to have the power to borrow to build council housing. We will fight for a retrofit-first approach, and all demolitions must go to genuinely democratic ballots with fair spending limits on both the council and on any community opposition, as part of a wider community involvement process. Temporary housing must meet minimum safety and quality standards to ensure those waiting for permanent housing can live in safety and comfort. We will not continue to place people with temporary accommodation providers who refuse to meet these conditions.\nDisabled renters have the same right to housing as anybody else, but too often they are being failed by councils who do not consider accessibility as part of their provision. Greens believe in accessible, and transparent council services, and will ensure there are dedicated email addresses and phone numbers for services, and face-to-face meetings are available for those who need it. Long, black hole online forms are distressing and opaque and we will phase out their usage.\nFrom our Newham Mayoral candidate Rob Callender: “I share a privately rented flat with a friend. In fact I’ve privately rented shared accommodation my entire adult life. Luckily I’ve had good landlords but I know many who suffer as a result of landlords putting rents up or evicting people so they can charge someone else a higher rent. As well as rent controls, landlord licences, ending right to buy and ‘retrofit first’, we need to bring empty homes back into use and we need more homes built by the council on publicly owned land – of which there is more than enough in Newham, especially in the docks and Beckton Riverside, where much of the empty land is owned by the GLA. The council is sitting on unspent infrastructure funding that is meant to support such housing provision.\nRenters deserve better from their council, and Greens will be their champions on the council.”\n- https://www.sianberry.london/wp-content/uploads/2016/01/London_Renters_Union_Green_Party_Jan2016.pdf\n- https://www.sianberry.london/news/housing/overcharged-londoners-have-paid-25-billion-too-much-rent/\n- https://www.sianberry.london/news/housing/my-pledge-to-stand-with-renters/",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_02_22_newham-mayor-accepts-green-demands-to-intervene-on-msg-sphere/content_30.html": "- Newham Mayor Rokhsana Fiaz asks Sadiq Khan and Michael Gove to stop the MSG Sphere\n- Councillor Nate Higgins: “I’m thankful to the Mayor but it’s clear without our hard work this would never have happened.”\n- Councillor Danny Keeling: “Residents are really concerned about this and feel helpless.”\nThe Mayor of Newham Rokhsana Fiaz has written to both the Mayor of London Sadiq Khan and the Secretary of State for Levelling Up, Housing and Communities Rt Hon Michael Gove MP asking them to use their powers to refuse the MSG Sphere planning application. This comes after mounting pressure from Stratford Olympic Park councillors Nate Higgins and Danny Keeling, who represent the ward it is proposed to be built in, demanding that she do so.\nThe MSG Sphere is a proposed new concert venue next to Stratford Station with a capacity of 21,500 which will be encased in an ‘orb’ of advertising LED screens as tall as big ben. The site is surrounded on both sides by residential housing developments.\nGreen Party Councillor Nate Higgins said: “Residents don’t want the Sphere – it will overwhelm Stratford station which is already at capacity. Residents have told me they will move if it goes ahead, though many are worried about being trapped in negative equity.”\nCouncillor Danny Keeling, who leads the Green Group at Newham Council, added: “Residents are really concerned about this, they have been let down and feel helpless in stopping this project. It is frankly insulting to new homeowners and renters that black out blinds are the proposed solution to the light pollution caused by this proposal.”\nThe Mayor’s intervention comes over six months since Newham Council first considered a motion demanding this action, tabled by Green Councillor Nate Higgins, and almost a year since the application was first approved. The topic has been on the agenda of every full council meeting since, in October, November and January, but has never been voted on.\nHiggins said: “I’m thankful to the Mayor for listening to me and the residents I represent in sending these letters. There is unity at the council in opposing the Sphere. I don’t know what took her so long – Mayor Fiaz indicated back in August she was willing to write them. Since then she has repeatedly refused to until Council voted on it, while doing nothing to make that happen while her Labour colleagues actively prevented a vote being held on three separate occasions. We understand Mayor Fiaz’s hesitance to cause further friction between her and Mayor Khan, but it’s her job to represent residents on important issues like this as we have demanded, and we’re relieved she has now done so. It’s clear without our hard work this would never have happened.”\nThe Green Party has been persistently campaigning against the Sphere. In the 2021 London Elections, Sian Berry stood for Mayor of London on a platform of opposing the Sphere, and wrote to the Mayor herself demanding he refuse it in August 2022. Alongside their three different motions, Green councillors have been attempting to work cross-party to Stop the Sphere. They drafted a letter with Labour to Mayor Fiaz asking her to intervene, which they ultimately refused to sign. After receiving no response to their letter, Higgins and Keeling wrote to Mayor Khan themselves in December 2022, asking that he direct the refusal of the application.\nCouncillor Higgins finished: “Mayor Fiaz has repeatedly indicated that council colleagues would have the chance to sign her letter, including in an amendment she tabled and spoke to herself. It’s bewildering no such opportunity was given, and it’s disappointing that party political divides have prevented us working together on this. We’re delighted to have achieved this step forward and we’ll keep fighting to Stop the Sphere, which will be so damaging to the health and wellbeing of local residents.”\nENDS\nCouncillor Nate Higgins uses he/him pronouns, and Councillor Danny Keeling uses they/them pronouns.\nNotes\n- Due to Olympic Legacy planning rules, Newham Council is not the planning authority for the MSG Sphere application, and only Sadiq Khan and Michael Gove now have the powers to intervene. The Sphere was approved by the London Legacy Development Corporation, with elected councillors being overruled by unelected board members and independent appointees.\n- The Sphere will now be referred to Sadiq Khan for his stage 2 decision. As the planning authority is a Mayoral Development corporation, Sadiq Khan cannot call the application in, but he can direct the authority to refuse the application in his stage 2 decision.\n- Gove recently issued an article 31 order indicating he is considering calling it in, and final approval now cannot be granted until he makes his decision. https://www.queenelizabetholympicpark.co.uk/-/media/lldc/planning/msg-planning-documents-december-2019/230207-art-31-direction.ashx?la=en\n- Mayor Fiaz’s letter to Sadiq Khan can be found at https://drive.google.com/file/d/16VQjm9wNueemSEdqSRJ1waKS_I6rnKqp/view?usp=sharing\n- Mayor Fiaz’s letter to Michael Gove can be found at https://drive.google.com/file/d/1uoiC2RPGEEoKa0oAjoVJhbqeDtFj3Vb0/view?usp=sharing\n- Cllrs Higgins/Keeling’s letter to Rokhsana Fiaz, sent on the 15th of November, can be found at https://drive.google.com/file/d/12hgvO59QmrUoRD99h_voYABvRc6UtWzk/view?usp=sharing\n- Cllrs Higgins/Keeling’s letter to Sadiq Khan, sent on 9th December, can be found at https://drive.google.com/file/d/1sQxMGEP0YKtVWi7zhL-1TUALEDWHciWb/view?usp=sharing\n- The final version of Cllrs Higgins/Keeling’s motion on MSG Sphere can be found https://docs.google.com/document/d/1wtUSFpNlgX_5T_GMQPNY-OPMsGGl3MyDFlkUDm_0Os4/edit?usp=sharing\n- Sian Berry’s letter to Sadiq Khan can be found at https://www.london.gov.uk/programmes-strategies/publication-sian-berry-letter-mayor-recommending-he-refuse-planning-msg-sphere",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_get-involved-by-election/content_16.html": "BOLEYN and WALL END By-ELECTION – Get Involved!\nPlease select one of the options below: Help out Donate Join! Find out more about the candidates… Help out I want to help get Joe elected in Boleyn ward! I want to help get Tassadduq elected in Wall End! Donate\nLast year we made history – finally breaking the one-party state that Labour had control of for 16 years, electing our two Green councillors Nate Higgins and Danny Keeling who won by 51% to Labour’s 34% – the biggest Green vote in London.\nAbove all the critics and the complacent Labour councillors, we overtook the Conservatives and Liberal Democrats, becoming Newham’s undeniable second party.\nIt shows that Newham wants change but they need to invest in a party they can trust and that will beat Labour. Can you help? Join! Join the Green Party Find out more about the candidates… Joe Hudson-Small, Boleyn ward Tassadduq Cheema, Wall End\nOR sign up directly to one of our events here:",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_04_27_newham-greens-welcome-u-turn-on-sex-work-pspo/content_33.html": "- Newham Council has cancelled the proposed sex work Public Space Protection Order (PSPO)\n- Green Party Councillor Nate Higgins: “This u-turn from the council will be a huge relief to sex-workers in Newham. I’ve been calling for the prioritisation of women’s safety since the proposals were published. The PSPO would have put sex-workers at risk. We look forward to supporting the development of the council’s new public health strategy”\nNewham Greens have welcomed today’s announcement that the Labour administration in Newham will no longer be going ahead[1] with the proposed sex-work Public Space Protection Order[2], which would have criminalised the purchasing of sex on Romford Road.\nGreen Party Councillor Nate Higgins, who represents Stratford Olympic Park, said: “This u-turn from the council is a positive step, and will be a huge relief to sex-workers in Newham. I’ve been calling for the prioritisation of women’s safety since the proposals were published. The proposed PSPO would have put sex-workers at risk and would have made it much harder to provide the support needed”\nCouncillor Higgins added: “By building trust with sex-workers, the council will be in a much better position to help get sex-workers off the street, supporting communities impacted by the negative impacts of on-street sex work.”\nIn November, Councillor Higgins called[3] for women’s safety to be prioritised instead, saying:\n“I support efforts to protect vulnerable people being abused and trafficked in sex work and I have pressed for women’s safety to be prioritised. But that must happen by destigmatising sex work and ensuring those being abused feel confident they can not just report abuse, but take proactive action to protect themselves from that abuse – such as vetting clients or meeting in public well-lit places. Displacing women from places they may and know and feel safe in to other more isolated areas, as previous crackdowns have been shown to do, will not make women safer.”\nHiggins finished: “We welcome that the administration has listened to the widespread opposition amongst experts, sex workers themselves, support groups, and from Newham Greens. We look forward to supporting the development of the council’s new public health strategy”.\nENDS\nCouncillor Nate Higgins uses he/him pronouns.\nNotes\nThe Green Party is the main and only opposition party elected to Newham Council.\n- https://twitter.com/natehiggins/status/1651644507723558919?s=61&t=LhmIXgf3LCCVmvGKMaroCQ\n- https://www.newham.gov.uk/news/article/931/newham-council-is-consulting-on-proposals-to-clampdown-on-kerb-crawlers-who-exploit-and-purchase-sex-from-vulnerable-women-on-newham-s-streets\n- https://mgov.newham.gov.uk/documents/s160764/Minutes%20-%20Appendix%201.pdf (Question 4, page 7)",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_01_23_green-councillors-win-on-support-for-trans-rights-at-newham-council/content_23.html": "LABOUR OPPOSE AMENDMENT RECOGNISING HATE CRIME AND GENDER RECOGNITION REFORM\n- Newham Councillors passed Green Councillor Nate Higgins’ motion ‘Supporting the Transgender Community’ at January’s Full Council meeting\n- New Census data shows Newham has the most trans residents of anywhere in England and Wales\n- The motion included commitments to consider the needs of the trans community when accessing healthcare and in the Council’s homelessness and rough sleeping strategy.\n- Labour councillors rejected an amendment honouring victims of the Club Q Shooting in Colorado (including two trans victims) and supporting the Scottish Gender Recognition Reform Bill.\n- Green councillor Nate Higgins said “I’m proud of this motion and the action it has set in motion, and I look forward to working with trans residents and the administration to ensure Newham is as safe and welcoming to trans people as it possibly can be”\nNewham Council voted last week to pass a Green Group motion in support of the transgender community. In light of a concerning rise in transphobia, as well as high levels of discrimination and hostility experienced by trans and non-binary people across the UK, Newham Council have committed to substantial action to support the trans community.\nGreen councillor Nate Higgins, who proposed the motion said: “Trans people are some of the most vulnerable and discriminated against members of society and they deserve specific attention and support, especially in this transphobic climate we’re experiencing now. As a councillor, I can’t eradicate transphobia – that’s going to take national action that this Tory Government is shamefully refusing to take. But we can do our bit to make sure the council isn’t contributing to negative experiences for trans residents and staff, and to make the most of any opportunity to empower them. I’m proud of this motion and the action it has set in motion, and I look forward to working with trans residents and the administration to ensure Newham is as safe and welcoming to trans people as it possibly can be.”\nGreen Councillor Danny Keeling, who is the first openly non-binary councillor elected in Newham said “Our motion has come at an opportune time, with LGBT+ History Month in February and data from the Office for National Statistics highlighting that Newham has the highest proportion of trans people in England and Wales. The actions to be implemented by Newham Council will affirm that trans men and men, trans women are women and non-binary people are valid and exist.”\nIn their speech at Full Council, they also reflected on transphobia within the council itself and how they are often misgendered and dead-named. This motion will act as a first step to creating genuine change at Newham Council.\nDespite unanimous support for the motion, Labour councillors rejected a Green amendment updating the motion, which had first been proposed in the summer of 2022. The amendment set out to honour victims of the Club Q shooting in Colorado Springs in November, which occurred the day before Trans Day of Remembrance, and where two of the victims were trans. It also endorsed the Gender Recognition Reform Bill passed by the Scottish Parliament in December, and called on the Government not to block it. In addition, the amendment highlighted the Office for National Statistics data released this January which indicated that Newham has the highest proportion of trans people anywhere in England and Wales.\nNate Higgins said “Labour’s decision to block the amendment is truly appalling. For them to do so without any explanation is cowardly. Trans residents deserve an explanation for why Labour blocked the motion having any recognition of the Club Q mass shooting or of Newham having the most trans residents in England and Wales, and why they opposed endorsing Gender Recognition Reform which would benefit so many. Newham Labour are constantly complaining of decisions being taken out of their hands – the hypocrisy of opposing the Gender Recognition Reform Bill is stark.”\nThis motion was heard at January full council following a decision by Labour councillors to block it being heard at November full council, the day after Trans Day of Remembrance. Following that meeting, Cllr Keeling wrote to the Chief Executive complaining about their experience of transphobia at Newham council.\nNate finished: “It was the Green Party that put this motion on the agenda, and it’s clear Labour would not have taken the lead on this without our work. Above all, this shows the value of having opposition councillors at Newham for the first time in over a decade, and this is just the start of our constructive work to make Newham a Greener, fairer, safer place to live.”\nENDS\n- Motion 3 – ‘Supporting the Transgender Community’ with Green Group amendment https://mgov.newham.gov.uk/documents/b32330/Supplementary%20Agenda%2016th-Jan-2023%2019.00%20Council.pdf?T=9 (page 30)\nNOTES\nThe Green Party is the main and only opposition party elected to Newham Council.\nBoth Nate Higgins and Danny Keeling are Green councillors for Stratford Olympic Park in Newham. Nate’s pronouns are he/him and Danny’s pronouns are they/them.\nThe motion has recommended that several changes to internal council procedures should be introduced, including:\n- Training for councillors and officers,\n- A revision of council forms to be inclusive of trans and non-binary people,\n- Public statements to acknowledge Trans Day of Visibility and Trans Day of Remembrance\n- Provision of gender-neutral toilets in all Council buildings.\nActions with a broader scope were also covered by the motion. With homelessness disproportionately affecting members of the trans community, the Council has committed to explicitly consider their needs in its homelessness and rough sleeping strategy. In addition, explicit consideration of the barriers experienced by the trans community when accessing medical care will now be made, and ways in which they can be reduced.\n- The debate on the motion (including Nate’s proposal speech) is available at https://youtu.be/VInF7fh-Ptg?t=7583\n- A rough copy of Nate’s proposal speech is available at https://docs.google.com/document/d/1O3e7yODvpB2uCzpgT6hoiX3o-34CG-3yzTPliVZEa3Y/edit",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_contact/content_3.html": "Skip to content\nSkip to footer\nNewham\nMenu\nGet INVOLVED!\nNews\nAbout us\nNewham Green Party\nConstitution\nPeople\nNewham Green Councillors\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_ge2024_joe-hudson-small-for-stratford-and-bow/content_15.html": "Joe Hudson-Small\nGreen Parliamentary Candidate for Stratford and Bow\nI live in Stratford, East London and work as an IT professional alongside being a committed activist for affordable housing and accessible public transport.\nPeople deserve a real choice in this election and the Green Party’s message is one of hope and optimism.\nClimate change is one of many tough challenges we’re facing – but it’s not the only one. People are hurting – worsening inequality and the austerity agenda have been fuelling the cost of living crisis for years, and now a third of London’s children now live in poverty.\nWe need a new generation of political leaders who will stand up for what’s right – from investing in the future of our planet and in future generations by sharing out the wealth held at the top, to investing in peace in Gaza.\nLondon’s highest ever house prices demand an affordable housing revolution; soaring energy bills demand a clean energy revolution; and food prices, inflation, and corporate greed demand fair wages and an economy that’s centred on people.\nThe Green Party knows that these challenges are linked, and that Green policies will protect our planet, reverse decades of economic inequality, and invest in public services like our NHS to help people who need it most.\nI’m standing in this election because the Green Party know there are solutions to these challenges, and together we can make our vision for a fairer Britain a reality.\nI’m excited to have been chosen as the Green Party candidate for Stratford and Bow and look forward to hearing from residents in the community and to championing their concerns throughout the campaign.",
  "https_newham_greenparty_org_uk_/https_newham_greenparty_org_uk_2023_11_20_stratford-olympic-park-local-councillors-celebrate-as-mayor-of-london-blocks-the-msg-sphere-application/content_7.html": "Newham Green Party’s Stratford Olympic Park councillors have today reacted as news broke that Sadiq Khan has blocked the MSG Sphere in his stage 2 decision[1].\nGreen councillor for Stratford Olympic Park Nate Higgins, said: “Absolutely delighted to share that our campaigning on behalf of residents in Stratford Olympic Park alongside the Stop the MSG Sphere campaign has paid off, and Sadiq Khan as Mayor of London has today rejected the MSG Sphere planning application in his stage 2 decision.”\n“We would not be here today without the work of so many incredible campaigners. Because of their tireless efforts, which I have been honoured to support as the local councillor alongside Cllr Danny Keeling, residents will not have to put up with black out blinds or Stratford station becoming overwhelmed.”\n“London’s cultural venues are incredibly important, but this application was always completely inappropriate for the site and the 25 year advertising consent the applicants demanded show they were not interested in contributing to our capital’s cultural scene – only bombarding the residents of Stratford with endless advertising.”\n“We’ll have more to say in the coming weeks about what happens next, but this incredible victory goes to show the value of community organising and listening to residents. As the local councillors, we’ll never stop doing that.”\nCouncillor Danny Keeling, who also represents Stratford Olympic Park, added “In a housing crisis and in an area with multiple venues already including the London Stadium cancelling this eyesore was the correct thing to do.\nENDS\nCouncillor Nate Higgins uses he/him pronouns. Councillor Danny Keeling uses they/them pronouns.\nThe MSG Sphere was an application to build a new entertainment venue next to Stratford station in between two major residential developments as tall as Big Ben, which would be coated in a Sphere of LED advertising screens. It had been approved by the London Legacy Development Corporation’s Planning Decisions Committee in early 2022, despite overwhelming opposition from local representatives and residents. The Sphere was due to be built in Stratford Olympic Park ward.\nThe Green Party is Newham’s biggest and only opposition party elected to Newham council. Stratford Olympic Park is represented by two Green Party councillors."
}