{
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_author_norfolkgreens_page_2/content_30.html": "One of Martin’s key policies, if elected, would be to introduce a “late night levy”, which allows local areas to charge businesses that supply alcohol late into the night for the extra enforcement costs that the night-time economy generates for police and licensing authorities.\nAt the moment, we only have estimates about how much this could raise in Norfolk, but it seems clear that £100,000s could be generated by implementing this measure, given what has happened in other areas where such a levy has been introduced. Continue reading How much could be raised by introducing a Late Night Levy?",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_category_election/content_14.html": "Members on Norwich City Council last month unanimously supported a Green Party motion, which called for greater efforts to deal with the issue of single-use plastics (SUPs) in the city.\nWe were delighted to present this motion at the council’s meeting in September and reassured that all other parties supported the initiative. Our hope is that Norwich will become a pioneer as a plastic-free city and as Greens we believe that the council can take a lead on this matter. Continue reading Norwich to become a single-use plastic free city?",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_latest-news_page_3/content_41.html": "Green Party Police and Crime Commissioner candidate, Martin Schmierer, says that if elected on May 5th, he will do whatever he can to help rough sleepers, at a time when several councils have investigated plans to fine them for “antisocial activity”.\nAcross Norfolk the number of homeless has increased drastically over the last couple of years, with the number in King’s Lynn and West Norfolk almost doubling in 2015. [1] This followed a similar rise in Norwich. [2] Continue reading “Let’s help rough sleepers, not fine them,” says Green Party PCC candidate for Norfolk",
  "http_martinschmierer_co_uk/http_martinschmierer_co_uk_latest-videos/content_6.html": "Latest Videos Martin Schmierer outlines his views on how to improve Norwich market. Martin Schmierer discusses improving the Ber Street area of Norwich with local business owner. Martin Schmierer talks about improving the security in Norwich’s communal flats.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_park-runs-should-remain-free/content_23.html": "Not really to do with policing, crime or justice, but still an important issue:\nMy reaction to the decision of some local councils to charge runners in parks…\n“I was appalled at the suggestion that local authorities might charge runners for using paths in parks for their runs. This activity is good for public health and should be encouraged by councils, rather than hindered, even though local authorities are struggling financially, given the scale of the spending cuts implemented by the national government.\n“Instead, we in the Green Party would like local authorities to work together to raise money more effectively, by introducing such measures as a “city tax” or “visitor levy” on hotel stays. This is prevalent across much of Europe and Edinburgh Council has estimated that it will raise £15m by implementing this scheme. I suggest this would be a far more sensible initiative than charging runners in our parks.\n“Furthermore, extra money could and should be raised by introducing a “late night levy” on shops, bars and clubs that stay open late into the night and cost councils and society far more than the ground maintenance needed to maintain local parks and recreation areas.\nNotes:",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_this-election-could-descend-into-a-farce-warns-green-party-pcc-candidate-for-norfolk/content_29.html": "Green Party PCC candidate, Martin Schmierer, has warned that the forthcoming local elections could be marred with problems, with two different voting systems being used and added EU referendum election ballots being potentially included.\nOn May 5th voters will go to the polls across Norfolk to elect their next Police and Crime Commissioner (PCC).\nThere are also simultaneous local council elections going on in Norwich and Great Yarmouth, while the PCC elections use a form of supplementary voting system.\nThis supplementary vote works as follows:\nVoters can vote for their first and second preference on the ballot paper – or for just one candidate, if they wish. If a candidate gains more than 50% of the vote, s/he wins. If not, all candidates except the two with the most votes are eliminated. The votes cast for other candidates are redistributed to their second preference. Of the two remaining candidates, the one with the most votes is then declared the winner.\nThis means there is no such thing as a ‘wasted’ vote, since you can give your first preference to a candidate from a smaller party, knowing that if s/he is eliminated, your second preference will be counted.\nThere has already been considerable concern that turnout will be very low, with only 15% of eligible electors taking part at the last PCC elections in 2012.\nThe Green Party’s candidate, Martin Schmierer has also raised the possibility that the different voting systems may confuse some voters in the polling stations.\n“If the Scottish Holyrood elections of 2007 are anything to go by, 3% or 4% of people may not fully comprehend this voting system and this may be exacerbated by the fact that nothing has been done by the government to explain how this poll will work.”\nIn 2007, almost 150,000 votes were deemed “spoilt” because of different voting systems for the elections and the simultaneous local elections that were happening that day.\nMartin Schmierer continued:\n“This ‘spoilt ballot’ margin may well be the difference between someone winning or losing. Added to this there is also the problem that the EU referendum is looming and the postal votes for this will be dropping on peoples’ doormats soon, potentially even before polling day on May 5th”\nReturning officers who oversee the EU Referendum locally have been encouraged to send out postal votes as soon as possible to ensure that voters living abroad receive them in time to vote on 23rd June. The consequence of this is that they may well reach households before the 5th May local elections.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk/content_11.html": "My name is Cllr Martin Schmierer and I am a candidate for Norfolk Police and Crime Commissioner. I was previously the Lord Mayor of Norwich and leader of the Green Party group on Norwich City Council.\nI was previously the Lord Mayor of Norwich, which is a primarily ceremonial position, but this role allowed me to meet the many community and charity groups that work so hard to improve the lives of the most vulnerable in our society.\nI have lived in Norfolk since 1994. I am a local councillor in Norwich for Mancroft ward which covers much of the city centre.\nSince being elected in 2015, I have campaigned to make Norwich a fairer and cleaner city. It is unacceptable that, according to the last census, 41% of children in my ward live in poverty.\nI will continue to present a strong independent-minded voice who will put the needs of local residents first and will ensure that more is done to involve communities in dealing with the issues they face.\nGreen Party councillors have a history of working hard for the residents they represent. Norwich elected its first Green Party councillor in 2002 and today the Green Party is the official opposition on Norwich City Council.\nPlease have a read of my vision for Norwich for Norwich and the latest updates about my work. Please also feel free to contact me with any questions or suggestions.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_green-party-pcc-candidates-to-unveil-election-manifesto-on-policing-in-the-east/content_32.html": "This Saturday, the Green Party will be unveiling their manifesto on “Policing in the East” alongside the the party’s representative in the House of Lords, Baroness Jenny Jones.\nThe party’s proposals are set to focus on ensuring the establishment of better communication between the community and local constabularies and ensuring that the Police and Crime Commissioner’s office is more transparent to allow greater public awareness regarding what the post entails.\nSpecific plans include a greater emphasis on under-or-unreported crimes such as domestic violence and rural thefts, which the Green Party candidates have claimed is particularly important to many residents in Norfolk and Suffolk.\nThis is the first time the Green Party are putting forward candidates anywhere in the region.\nIn Norfolk, Martin Schmierer (a councillor in Norwich) is standing, while in Suffolk the candidate is Terence Carter.\nBaroness Jenny Jones, who was formerly Deputy Mayor of London explained:\n“I’m really delighted to support the Green Party’s campaign in Norwich where we optimistic about the local elections, but also across Norfolk and Suffolk in the Police and Crime Commissioner elections.\n“In my time as Deputy Mayor of London and while on the Metropolitan Police Authority I was proud to achieve improvements to traffic policing and public communication with the Metropolitan Police. This demonstrates that the Green Party can have a positive impact in regard to crime and justice related issues.\nShe continued:\n“I am confident that if elected the Green Party’s PCC candidates for Norfolk and Suffolk will be able to ensure that we have more community policing, we take action against the drug gangs not drug users and more emphasis is placed on unreported/under-reported crimes, such as domestic violence and rural thefts, as outlined in the manifesto to be unveiled on Saturday.”\nThe launch will happen at 12pm on Saturday 23rd April at:\nThe Belvedere Centre\nBelvoir Street, Norwich\nNorfolk\nNR2 3AZ",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_policing-in-the-east-manifesto-launch/content_24.html": "Last week the Green Party’s PCC candidates for Norfolk and Suffolk launched the manifesto for “Policing in the East” alongside Baroness Jenny Jones – the former Deputy Mayor of London.\nSpecific plans include a greater emphasis on under-or-unreported crimes such as domestic violence and rural thefts, which the Green Party candidates have claimed is particularly important to many residents in Norfolk and Suffolk.\nThis is the first time the Green Party are putting forward candidates anywhere in the region and are optimistic that the party’s vision for a more progressive form of policing and justice will resonate with voters on May 5th.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_author_martin/content_7.html": "Last Friday I was delighted to attend an event organised by the Polish Embassy to the UK at the Millennium Library in Norwich to celebrate 250 years of Polish / British relations. I, along with the Sheriff of Norwich, the Lord Lieutenant of Norfolk and representatives from Norfolk County Council were pleased to welcome visiting Polish dignitaries to Norwich.\nThe embassy donated a number of Polish books to the Norfolk Libraries and there was a demonstration by bestselling Polish cookery writer Zuza Zak who gave a talk about Polish cuisine and did a short cookery demonstration.",
  "http_martinschmierer_co_uk/http_martinschmierer_co_uk_more-about-the-green-party/content_2.html": "Currently the Green Party has five councillors on Norwich City Council. At the last local elections in 2018, we gained c. 20% of the popular vote across Norwich.\nTo read more about the Green Party’s policies, please click here. If you are interested in joining the Green Party, please follow this link.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_latest-news_page_5/content_39.html": "I was deeply concerned by the BBC’s recent finding that cases of UK police officers and staff taking long-term sick leave for psychological reasons had risen by 35% over the last five years.\nDespite the fact that police numbers have fallen, the number of days taken off has risen drastically. Currently there are 6,129 incidences of officers being put on sick leave for psychological reasons whereas 5 years ago the figure was just over 4,500. There was also reportedly a steady increase in overall long-term sick leave. Continue reading Tackling stress among police officers",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2018_05_truly-honoured-to-be-the-new-lord-mayor-of-norwich/content_9.html": "This week I was honoured to be elected as new Lord Mayor of Norwich. Over the course of the next 12months I look forward to meeting and supporting the many community and charity groups in Norwich who work tirelessly to support the most needy in our city.\nPlease find my acceptance speech below…\n“Ladies and gentlemen honoured guests please be seated. I’d like to begin by thanking Cllrs Raby and Maxwell for proposing and seconding me to become Lord Mayor of Norwich which is a tremendous honour as I share a great affinity and love of this very fine city and it is about my connections with this place that I would like to say a few words.\n“While I wasn’t born here, it is a city that has welcomed me since I was a child, and is one that I am incredibly proud to consider as my hometown. It is undoubtedly worthy of George Borrow’s epithet – “a fine city”, with its bussling market, its magificent cathedrals, its imposing castle, its many churches and pubs.\n“But Norwich is more than its architecture, however, impressive that might be. What makes Norwich, indeed makes any place, are its citizens. In the case of Norwich, their passion, energy, enthusiasm and warmth is palpable. One only needs to visit one of the many pubs in the city to feel that warmth or sit in the terraces of Carrow Road watching Norwich City lose (… again) to experience the passion and the witness the strength of pride people here have in their city – something which I share. So strong is that sense of community that I class Norwich as a big village, albeit it with all the cultural and social offerings of a city but one in which no one is a stranger. I am not surprised therefore that Stephen Fry once remarked “Norwich is a fine city. None finer.”\n“That is not to say that Norwich doesn’t have its issues. It is a city with still too great a divide between rich and poor. It is a city that is not immune to the ongoing scandal of homelessness, deprivation, premature mortality and poverty. But in Norwich we are blessed that we have organisations and indivdials who are working hard what they can to mitigate the effects of the social and environmental ills that blight us all directly or indirectly. It is for that reason that over the course of the next 12months I am most looking forward to meeting those many hundreds of indivduals associated with charities and community groups who are doing what they can to improve the lives of others. That’s not to say that I am not looking forward to opening the Norwich City of Ale festival later this week or joining other Norfolk dignatories on our tour of the county on Norfolk Day this summer, but what I am most excited about is meeting those who too offen get too little recognition for the work they do to ensure that this city retains the epithet “a fine city”. These are the unsung heroes in this city who today and indeed every day deserve the biggest thanks of all and I look forward to being able to express all our gratitude to them this year.”",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_lets-help-rough-sleepers-not-fine-them-says-green-party-pcc-candidate-for-norfolk/content_43.html": "Green Party Police and Crime Commissioner candidate, Martin Schmierer, says that if elected on May 5th, he will do whatever he can to help rough sleepers, at a time when several councils have investigated plans to fine them for “antisocial activity”.\nAcross Norfolk the number of homeless has increased drastically over the last couple of years, with the number in King’s Lynn and West Norfolk almost doubling in 2015. [1] This followed a similar rise in Norwich. [2]\nRough sleeping has almost doubled across England over the last six years, with an increase of 30% last year alone. [3]\nAlthough the number remains small, it has meant that some councils in other areas of the UK have investigated using “public space protection orders” (PSPO), which allows them to ban or regulate any activity in certain public spaces that is classed as “likely to have a detrimental effect on the quality of life of those in the locality”. [4]\nLast year Hackney Borough Council was criticised for threatening to issue anyone falling foul of such an order with a £100 on-the-spot penalty or a fine of up to £1,000, and a criminal record. [5]\nMartin Schmierer said:\n“Remedying the growing problem of homelessness in Norfolk will not be achieved by implementing the kind of policies discussed els\newhere, such as fining those sleeping rough on the streets.“If elected, I would like to the see the police working more closely with local authorities and charities to ensure that we reverse the growing trend of homelessness in the county and help those most in need of support.”\nENDS\nNotes\n[1] http://www.klfm967.co.uk/news/klfm-news/1898495/number-of-rough-sleepers-in-west-norfolk-has-almost-doubled/\n[2] http://www.edp24.co.uk/news/number_of_rough_sleepers_in_norwich_has_doubled_1_4113133\n[3] http://www.theguardian.com/society/2016/feb/25/homeless-number-people-sleeping-rough-england-rises-almost-a-third-in-a-year\n[4] http://www.theguardian.com/housing-network/2015/jun/03/councils-help-rough-sleepers-not-fine-them-hackney\n[5] http://www.mirror.co.uk/news/uk-news/council-threatening-homeless-1000-fines-5824287\nFor more information\nPlease contact: Martin Schmierer (martin.schmierer@eastern.greenparty.org.uk)",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_category_election_page_4/content_37.html": "One of Martin’s key policies, if elected, would be to introduce a “late night levy”, which allows local areas to charge businesses that supply alcohol late into the night for the extra enforcement costs that the night-time economy generates for police and licensing authorities.\nAt the moment, we only have estimates about how much this could raise in Norfolk, but it seems clear that £100,000s could be generated by implementing this measure, given what has happened in other areas where such a levy has been introduced. Continue reading How much could be raised by introducing a Late Night Levy?",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_latest-news_page_2/content_26.html": "A Green Party PCC would prioritize road safety policing as a matter of considerable urgency. However, it seems to me that merely adding to the overall number of road traffic officers would not be some kind of panacea and as a result it would probably not be the way we would approach this. Continue reading How to ensure we have safer roads in Norfolk…\nLatest News\nDiscussing the PCC role…\nLast night I was on Mustard TV discussing my ideas for policing in the east and what needs to be done to make Norfolk the safer county we all want to see.\nPolicing in the East – manifesto launch\nLast week the Green Party’s PCC candidates for Norfolk and Suffolk launched the manifesto for “Policing in the East” alongside Baroness Jenny Jones – the former Deputy Mayor of London.\nSpecific plans include a greater emphasis on under-or-unreported crimes such as domestic violence and rural thefts, which the Green Party candidates have claimed is particularly important to many residents in Norfolk and Suffolk.\nThis is the first time the Green Party are putting forward candidates anywhere in the region and are optimistic that the party’s vision for a more progressive form of policing and justice will resonate with voters on May 5th.\nConcentrating on Yarmouth… my responses on how to make Great Yarmouth Safer\n1) What issues in crime and policing does Great Yarmouth (town and borough) face that are unique to the area?\nAccording to recent crime figures for Great Yarmouth, the most prevalent crimes are anti-social behaviour (ASB) and violent ones. In 2013 for instance, the ASB rate in Great Yarmouth was above the national average . Similarly the number of violent and sexual crimes and the amount of of drug-related offences was well above the national average and thus more action needs to be taken to remedy these. However, it is also worth pointing out that these figures showed that vehicle crime and burglary rates were low in the town and borough. Continue reading Concentrating on Yarmouth… my responses on how to make Great Yarmouth Safer\nGreen Party PCC Candidates to Unveil Election Manifesto on “Policing in the East”\nThis Saturday, the Green Party will be unveiling their manifesto on “Policing in the East” alongside the the party’s representative in the House of Lords, Baroness Jenny Jones.\nThe party’s proposals are set to focus on ensuring the establishment of better communication between the community and local constabularies and ensuring that the Police and Crime Commissioner’s office is more transparent to allow greater public awareness regarding what the post entails. Continue reading Green Party PCC Candidates to Unveil Election Manifesto on “Policing in the East”",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_author_martin_page_3/content_15.html": "As a local councillor in Norwich and the deputy leader of the largest group of Green councillors in the UK, I constantly engage with residents and understand what it means to be accountable to the public. As Police and Crime Commissioner for Norfolk, I would act as an efficient conduit between local residents and the constabulary, and would seek to involve communities more in decision-making.\nI have lived in Norfolk since 1994 and have a good understanding of the issues facing the county. I oppose government austerity and cuts to police services; however, I would work hard within existing budget constraints to protect the services that most directly affect communities. I would work to introduce a “late night levy” for licensed premises to fund the additional policing required in areas such as Prince of Wales Road in Norwich. Continue reading Why I want to become Norfolk’s next PCC",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_author_norfolkgreens/content_22.html": "Members on Norwich City Council last month unanimously supported a Green Party motion, which called for greater efforts to deal with the issue of single-use plastics (SUPs) in the city.\nWe were delighted to present this motion at the council’s meeting in September and reassured that all other parties supported the initiative. Our hope is that Norwich will become a pioneer as a plastic-free city and as Greens we believe that the council can take a lead on this matter. Continue reading Norwich to become a single-use plastic free city?",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_concentrating-on-yarmouth-my-responses-to-how-to-make-great-yarmouth-safer/content_27.html": "1) What issues in crime and policing does Great Yarmouth (town and borough) face that are unique to the area?\nAccording to recent crime figures for Great Yarmouth, the most prevalent crimes are anti-social behaviour (ASB) and violent ones. In 2013 for instance, the ASB rate in Great Yarmouth was above the national average . Similarly the number of violent and sexual crimes and the amount of of drug-related offences was well above the national average and thus more action needs to be taken to remedy these. However, it is also worth pointing out that these figures showed that vehicle crime and burglary rates were low in the town and borough.\nAs a result the priorities, in my opinion, for the local police should be to deal with anti-social behaviour and ensure that more is done to tackle sexual and violent crimes, most notably through education and working in schools. The Norfolk Constabulary should also look to tackle the drug gangs who sell narcotics in and around Yarmouth.\nFurthermore, from speaking with local residents, specific certain areas across the borough also experience problems with the late night economy. For example there is often trouble at certain venues in Gorleston and in Great Yarmouth over the weekend – as you might expect in any large town/city with multiple clubs and bars – but local authorities working alongside the police undoubtedly could and should do more.\nAnecdotally, the one problem that regularly comes up on the doorsteps is dangerous driving, particularly on the “Acle Straight” and the high level of accidents we read about seem to bear witness to this. Too often, we hear about incidents on the stretch, and when there is an accident it causes major problems and delays.\nFinally, given the importance of tourism on the local economy in and around Great Yarmouth, it is essential that environmental crimes (even as low-level as littering) should be more closely examined, especially on the beaches and on the Broads.\n2) As the second largest population centre in Norfolk after Norwich, what additional resources are required in Yarmouth to help with these problems?\nAs a larger area Yarmouth of course requires more funding, both to support a higher number of officers needed to respond to a higher number of crimes and to ensure that services in the area are able to meet the demands associated with the complexities of a relatively high-population area. It also needs to be recognised that the make-up of Great Yarmouth is quite varied – from the built-up urban areas in the Town of Great Yarmouth, to suburban areas like Hopton and Gorleston, and even rural areas like Martham and Fleggburgh. The crimes in the areas vary between neighbourhoods, and it’s important to ensure that the local force is equipped to deal with a variety of different situations. As a result, the local police should be prepared to deal with a variety of situations, from policing the late night economy zone to dealing with traffic violations and rural thefts.\nHowever, if these issues, (in particular the violent crimes and thefts) are to be fully tackled, more needs to be done on the socio-economic level too, specifically to tackle the inequality levels, which are so often linked with higher rates of crime. Although this well beyond the remit of the Police and Crime Commissioner, it seems clear that more action must be taken to support the local economy and provide meaningful employment for all.\n3) If you are elected, what will you do to make sure that there are more uniformed police officers on the streets of Great Yarmouth?\nAs you are probably aware, the police budget is very limited (thanks to the austerity measures implemented by the government) and as a result it is unlikely that police numbers will rise dramatically, regardless of who is elected, because it’s simply not possible without jeopardising the service by drawing away from other areas. However, there are measures that can be implemented to raise funds such as a late night levy, which I have been calling for, in particular in Norwich. This levy allows local areas to charge businesses that supply alcohol late into the night for the extra enforcement costs that the night-time economy generates for police and licensing authorities.\nI would also seek to encourage community policing so that residents across Norfolk, from King’s Lynn to Great Yarmouth have a better understanding of who their police officers are. Coupled with this I would like to see residents being able to converse with their local neighbourhood teams and set priorities on the micro level, with the result that hopefully the Norfolk Police becomes that visible, reassuring presence in which we can all trust and rely.\n4) What more needs to be done to tackle anti-social behaviour in the area?\nAnti-social behaviour seems to largely be reported in the vicinity of clubs and other night-time recreational places. It’s important that the police work with the various stakeholders (local residents, elected councillors, night-time business and security personnel, etc.) to ensure that these offences are taken seriously and handled appropriately and with haste. Work also needs to be done to ensure that those working in night-time economies know when to stop serving customers and feel safe doing so. Safe drinking campaigns should continue, but they should not seek to “victim blame” as some past campaigns in Norfolk seem to have done.\nI would also like to see local SNAPs/SNTs prioritised more, with a bigger emphasis on publication so that the public actually know that they exist and know how/when to attend. By increasing community communication, we may not only increase public perceptions and trust, but we can learn more about very localised crime issues that might otherwise go undetected. For example by talking to neighbourhood watch teams, the police might learn about anti-social behaviour completely unrelated to the night-life economy. It is for this reason and several others that I would like to see more neighbourhood watch schemes and community policing in place in Great Yarmouth and indeed across the whole of Norfolk.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_category_election_page_2/content_31.html": "1) What issues in crime and policing does Great Yarmouth (town and borough) face that are unique to the area?\nAccording to recent crime figures for Great Yarmouth, the most prevalent crimes are anti-social behaviour (ASB) and violent ones. In 2013 for instance, the ASB rate in Great Yarmouth was above the national average . Similarly the number of violent and sexual crimes and the amount of of drug-related offences was well above the national average and thus more action needs to be taken to remedy these. However, it is also worth pointing out that these figures showed that vehicle crime and burglary rates were low in the town and borough. Continue reading Concentrating on Yarmouth… my responses on how to make Great Yarmouth Safer",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_tackling-flytipping-in-norwich/content_25.html": "Earlier this week I was at the manifesto launch of the Green Party. I was proud to be able to contribute to the drafting of this document.\nHelping small businesses and tackling rogue landlords were two of the pledges made by the Green Party in Norwich in its manifesto for this year’s local elections. By offering the use of shops and office space at a greatly subsidised rate, the Greens want to encourage new businesses to start up in the city.\nIf elected to take control of City Hall, the Green Party would aim to limit the number of houses rented out by the room in certain parts of Norwich, seeking to preserve stable communities and to help prevent the exploitation of people who need to rent a home.\nOne the of the other key proposals that the Green Party suggested was more amnesties on flytipping. Currently it is one of the biggest issues that comes up on the doorstep for Green Party councillors, such as myself.\nI would like to see regular “amnesties” and the venues, dates and times of these advertised at which local residents can dispose of their waste locally. The local council could then pick up and dispose/recycle of this efficiently. At the moment it is done on an ad-hoc basis and the costs are\nconsiderable – something which Norwich City Council can scarcely afford given the size of the funding cuts from Westminster.\nSimilarly I have been asking council officers to provide smaller wheelie bins in communal areas as elderly residents and the disabled sometimes have difficulties lifting the heavy lids of the larger bins.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2018_05_celebrating-250-years-of-anglo-polish-relations/content_4.html": "Last Friday I was delighted to attend an event organised by the Polish Embassy to the UK at the Millennium Library in Norwich to celebrate 250 years of Polish / British relations. I, along with the Sheriff of Norwich, the Lord Lieutenant of Norfolk and representatives from Norfolk County Council were pleased to welcome visiting Polish dignitaries to Norwich.\nThe embassy donated a number of Polish books to the Norfolk Libraries and there was a demonstration by bestselling Polish cookery writer Zuza Zak who gave a talk about Polish cuisine and did a short cookery demonstration.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_latest-news_page_4/content_42.html": "I am only one of seven Green Party Police and Crime Commissioner candidates at the next set of elections in May and I think it is vital that the Green Party did have some presence in these elections, not only because it ensures that Green members/ supporters can vote for a party they believe in, but mainly as it allows the Green Party to promote its progressive vision on issues, such as crime and justice.\nIf the Green Party were not to have stood across the UK, the party would have been denied any voice in these debates and here in Norfolk (a traditionally very conservative county), the debate would likely focus on quite reactionary policies and proposals. Instead, I am able to promote views about greater transparency in the police force, tackling issues surrounding the late night economy zone, prioritising unreported or under-reported crimes, such as domestic violence and rural thefts, dealing with mental health related issues and a host of other policies. Continue reading Why it was important the Green Party stood at this election",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_05_227/content_10.html": "A Green Party PCC would prioritize road safety policing as a matter of considerable urgency. However, it seems to me that merely adding to the overall number of road traffic officers would not be some kind of panacea and as a result it would probably not be the way we would approach this.\nWe want to see a cultural shift in policing behaviour on our roads, such that the drivers who behave in an anti-social manner are specifically targeted. This might be rural speeding on minor unclassified roads, where we would lower the default speed limit to 50mph from 60mph. It might be focusing on urban pavement parking, which can force pedestrians into the carriageway, putting them at greater risk. I would also be interested to look into lowering urban speed limits to 20mph in residential areas, especially near schools and sheltered housing, making the roads easier to cross and most importantly safer for all.\nIn Norwich we have been fortunate enough to have significant cycling ambition grants from Government to the tune of £8.5M. However virtually all of this has been spent on hard infrastructure such as cycle lanes and routes. Whilst this addresses years of underinvestment in cycling, virtually none has been allocated towards softer measures such as driver, cyclist and pedestrian education. All road user need better training in how to use the roads an streets more considerately.\nI would be inclined to also reinstate many police patrols officer on bicycles in our market towns and cities which can have a double benefit of getting police officers faster to incidents that are not directly accessible by public road, and will help ensure a fitter and healthier workforce.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_author_martin_page_2/content_18.html": "Last night I was on Mustard TV discussing my ideas for policing in the east and what needs to be done to make Norfolk the safer county we all want to see.\nAuthor: Martin\nPolicing in the East – manifesto launch\nLast week the Green Party’s PCC candidates for Norfolk and Suffolk launched the manifesto for “Policing in the East” alongside Baroness Jenny Jones – the former Deputy Mayor of London.\nSpecific plans include a greater emphasis on under-or-unreported crimes such as domestic violence and rural thefts, which the Green Party candidates have claimed is particularly important to many residents in Norfolk and Suffolk.\nThis is the first time the Green Party are putting forward candidates anywhere in the region and are optimistic that the party’s vision for a more progressive form of policing and justice will resonate with voters on May 5th.\nConcentrating on Yarmouth… my responses on how to make Great Yarmouth Safer\n1) What issues in crime and policing does Great Yarmouth (town and borough) face that are unique to the area?\nAccording to recent crime figures for Great Yarmouth, the most prevalent crimes are anti-social behaviour (ASB) and violent ones. In 2013 for instance, the ASB rate in Great Yarmouth was above the national average . Similarly the number of violent and sexual crimes and the amount of of drug-related offences was well above the national average and thus more action needs to be taken to remedy these. However, it is also worth pointing out that these figures showed that vehicle crime and burglary rates were low in the town and borough. Continue reading Concentrating on Yarmouth… my responses on how to make Great Yarmouth Safer\nNo public appetite for making policing partisan\nI am very concerned that turnout will not be much higher than last time and I think much of the blame for this must go to the government who introduced this extra layer of bureaucracy. In my experience on the doorstep, There is simply no public appetite for making policing party-political in this way. Residents want the police force to be accountable, not partisan.\nAfter speaking with many residents about this, most people do not know what this role entails. Even though the Electoral Commission, in its report on the elections, stated that the low turnout was “a concern for anyone who cares about democracy“, the lessons do not seem to have been learnt. Continue reading No public appetite for making policing partisan\nTackling flytipping in Norwich\nEarlier this week I was at the manifesto launch of the Green Party. I was proud to be able to contribute to the drafting of this document.\nHelping small businesses and tackling rogue landlords were two of the pledges made by the Green Party in Norwich in its manifesto for this year’s local elections. By offering the use of shops and office space at a greatly subsidised rate, the Greens want to encourage new businesses to start up in the city. Continue reading Tackling flytipping in Norwich",
  "http_martinschmierer_co_uk/http_martinschmierer_co_uk_latest-news/content_17.html": "Last Friday I was delighted to attend an event organised by the Polish Embassy to the UK at the Millennium Library in Norwich to celebrate 250 years of Polish / British relations. I, along with the Sheriff of Norwich, the Lord Lieutenant of Norfolk and representatives from Norfolk County Council were pleased to welcome visiting Polish dignitaries to Norwich.\nThe embassy donated a number of Polish books to the Norfolk Libraries and there was a demonstration by bestselling Polish cookery writer Zuza Zak who gave a talk about Polish cuisine and did a short cookery demonstration.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_category_election_page_3/content_40.html": "Earlier this week I was at the manifesto launch of the Green Party. I was proud to be able to contribute to the drafting of this document.\nHelping small businesses and tackling rogue landlords were two of the pledges made by the Green Party in Norwich in its manifesto for this year’s local elections. By offering the use of shops and office space at a greatly subsidised rate, the Greens want to encourage new businesses to start up in the city. Continue reading Tackling flytipping in Norwich\nAs a local councillor in Norwich and the deputy leader of the largest group of Green councillors in the UK, I constantly engage with residents and understand what it means to be accountable to the public. As Police and Crime Commissioner for Norfolk, I would act as an efficient conduit between local residents and the constabulary, and would seek to involve communities more in decision-making.\nI have lived in Norfolk since 1994 and have a good understanding of the issues facing the county. I oppose government austerity and cuts to police services; however, I would work hard within existing budget constraints to protect the services that most directly affect communities. I would work to introduce a “late night levy” for licensed premises to fund the additional policing required in areas such as Prince of Wales Road in Norwich. Continue reading Why I want to become Norfolk’s next PCC\nI am only one of seven Green Party Police and Crime Commissioner candidates at the next set of elections in May and I think it is vital that the Green Party did have some presence in these elections, not only because it ensures that Green members/ supporters can vote for a party they believe in, but mainly as it allows the Green Party to promote its progressive vision on issues, such as crime and justice.\nIf the Green Party were not to have stood across the UK, the party would have been denied any voice in these debates and here in Norfolk (a traditionally very conservative county), the debate would likely focus on quite reactionary policies and proposals. Instead, I am able to promote views about greater transparency in the police force, tackling issues surrounding the late night economy zone, prioritising unreported or under-reported crimes, such as domestic violence and rural thefts, dealing with mental health related issues and a host of other policies. Continue reading Why it was important the Green Party stood at this election\nNot really to do with policing, crime or justice, but still an important issue:\nMy reaction to the decision of some local councils to charge runners in parks…\n“I was appalled at the suggestion that local authorities might charge runners for using paths in parks for their runs. This activity is good for public health and should be encouraged by councils, rather than hindered, even though local authorities are struggling financially, given the scale of the spending cuts implemented by the national government. Continue reading Park runs should remain free!\nGreen Party PCC candidate has indicated that he will prioritise dealing with large criminal gangs that supply drugs rather than focusing on low level users of class-C drugs if he wins the Police and Crime Commissioner election on May 5th.\nHis statement follows a recent survey, which showed that there was considerable support for legalising the sale of cannabis through licensed shops. In the poll of 2,000 adults, conducted by ORB for The Independent, some 47% of people backed the idea, while 39% opposed it, with the other 14% saying they “don’t knows”. Continue reading Tackle Drug Gangs not Drug Users says Green Party PCC candidate",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_tackle-drug-gangs-not-drug-users-says-green-party-pcc-candidate/content_45.html": "Green Party PCC candidate has indicated that he will prioritise dealing with large criminal gangs that supply drugs rather than focusing on low level users of class-C drugs if he wins the Police and Crime Commissioner election on May 5th.\nHis statement follows a recent survey, which showed that there was considerable support for legalising the sale of cannabis through licensed shops. In the poll of 2,000 adults, conducted by ORB for The Independent, some 47% of people backed the idea, while 39% opposed it, with the other 14% saying they “don’t knows”.\nThese figures follow a petition calling for a change in the law in the UK, which last year gathered 220,000 signatures.\nAn increasing number of countries and US states have relaxed laws on possession and purchasing of cannabis for personal use, although the British government remains opposed to any such changes in the UK.\nIn the Netherlands, for instance, cannabis products are only sold in “coffee shops” and possession of up to 5 grams for personal use is permitted.\nIn 2012 residents in the US state of Colorado voted to legalize marijuana in 2012 and the first retail marijuana stores opened in 2014. According to a report by Drug Policy Alliance, in the first year, the state saw a decrease in crime rates and traffic fatalities and an increase in tax revenue, economic output, and jobs.\nCllr Schmierer said:\n“It is clear that the so-called war of drugs isn’t working and although Police and Crime Commissioners cannot change the law, they can set local priorities. Dealing with drug related crime is a major issue for me as a councillor, but following drastic cuts to police budgets by the national government, we will need to think and act smart to keep residents safe.\n“I feel that in Norfolk, we need to focus resources on tackling the criminal gangs who smuggle class A drugs and other narcotics, rather than on individual users of class C drugs or marijuana.”\nHe continued:\n“There are also other pressing matters, such as tackling anti social behaviour and rural crime which is often under reported in the county, but deserve far more attention than low level, end users of marijuana and class C drugs.”",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_10_258/content_8.html": "Members on Norwich City Council last month unanimously supported a Green Party motion, which called for greater efforts to deal with the issue of single-use plastics (SUPs) in the city.\nWe were delighted to present this motion at the council’s meeting in September and reassured that all other parties supported the initiative. Our hope is that Norwich will become a pioneer as a plastic-free city and as Greens we believe that the council can take a lead on this matter.\nYou can read Martin’s blog to the Environment Journal here:",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_latest-news/content_44.html": "Last Friday I was delighted to attend an event organised by the Polish Embassy to the UK at the Millennium Library in Norwich to celebrate 250 years of Polish / British relations. I, along with the Sheriff of Norwich, the Lord Lieutenant of Norfolk and representatives from Norfolk County Council were pleased to welcome visiting Polish dignitaries to Norwich.\nThe embassy donated a number of Polish books to the Norfolk Libraries and there was a demonstration by bestselling Polish cookery writer Zuza Zak who gave a talk about Polish cuisine and did a short cookery demonstration.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_thanks-for-visiting-my-site/content_33.html": "Thank you for visiting my website. I’ll be keeping this up-to-date with all the latest news about my campaign to be Norfolk’s new Police and Crime Commissioner, so please check back again soon.\nThank you for visiting my website. I’ll be keeping this up-to-date with all the latest news about my campaign to be Norfolk’s new Police and Crime Commissioner, so please check back again soon.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_tackling-stress-among-police-officers/content_38.html": "I was deeply concerned by the BBC’s recent finding that cases of UK police officers and staff taking long-term sick leave for psychological reasons had risen by 35% over the last five years.\nDespite the fact that police numbers have fallen, the number of days taken off has risen drastically. Currently there are 6,129 incidences of officers being put on sick leave for psychological reasons whereas 5 years ago the figure was just over 4,500. There was also reportedly a steady increase in overall long-term sick leave.\nIt is all very well the government saying that policing is “stressful”, but it is important that measures are taken to help those suffering from stress in all workplaces. We, in the Green Party, have long argued that local authorities should appoint a Mental Health Champion to advocate on behalf of residents.\nPersonally, I would also like to see large government organisations, such as the NHS or the Police Constabularies, offer a similar service for its employees in order to tackle this pressing issue and support the people doing vital and often traumatic public service jobs.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_category_lord-mayor/content_21.html": "Last Friday I was delighted to attend an event organised by the Polish Embassy to the UK at the Millennium Library in Norwich to celebrate 250 years of Polish / British relations. I, along with the Sheriff of Norwich, the Lord Lieutenant of Norfolk and representatives from Norfolk County Council were pleased to welcome visiting Polish dignitaries to Norwich.\nThe embassy donated a number of Polish books to the Norfolk Libraries and there was a demonstration by bestselling Polish cookery writer Zuza Zak who gave a talk about Polish cuisine and did a short cookery demonstration.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_why-i-want-to-become-norfolks-next-pcc/content_34.html": "As a local councillor in Norwich and the deputy leader of the largest group of Green councillors in the UK, I constantly engage with residents and understand what it means to be accountable to the public. As Police and Crime Commissioner for Norfolk, I would act as an efficient conduit between local residents and the constabulary, and would seek to involve communities more in decision-making.\nI have lived in Norfolk since 1994 and have a good understanding of the issues facing the county. I oppose government austerity and cuts to police services; however, I would work hard within existing budget constraints to protect the services that most directly affect communities. I would work to introduce a “late night levy” for licensed premises to fund the additional policing required in areas such as Prince of Wales Road in Norwich.\nI will continue to advocate tax increases to protect police services, especially the Police and Community Support Officers (PCSOs), who provide an important link between community and constabulary.\nIf elected, I intend to:\n-\nAward more small grants to community projects which improve safety in their local area\n-\nProtect rural policing, ensuring that resources aren’t solely focused on urban areas\n-\nEncourage the establishment of more neighbourhood watch schemes, especially in rural areas\n-\nHold surgeries across the county to ensure that residents are able to contact their PCC more easily\n-\nEnsure that more is done to tackle “hidden” crime such as domestic violence, which is often under-or-unreported, as well as revictimisation (where victims of crime are more likely to be targeted again).\nI would of course be delighted to get feedback from residents in Norfolk so that together we can ensure that our police force is a supportive, visible presence in which we can all trust.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_05_caroline-lucas-offers-her-support/content_5.html": "Today the Green Party MP, Caroline Lucas offered her support to my campaign.\n“I wish Martin the best of luck in today’s election. The Green Party’s message – of community policing, of tackling hate crime and focussing on underreported crimes – is unique in this debate. I urge people in Norfolk to vote for a real change today by voting for the Green Party.”\nThanks Caroline!",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_no-public-appetite-for-making-policing-partisan/content_20.html": "I am very concerned that turnout will not be much higher than last time and I think much of the blame for this must go to the government who introduced this extra layer of bureaucracy. In my experience on the doorstep, There is simply no public appetite for making policing party-political in this way. Residents want the police force to be accountable, not partisan.\nAfter speaking with many residents about this, most people do not know what this role entails. Even though the Electoral Commission, in its report on the elections, stated that the low turnout was “a concern for anyone who cares about democracy“, the lessons do not seem to have been learnt.\nThe Parliamentary Home Affairs committee, in their report on 2012 elections, found that “the lack of a freepost mailing for candidates” was a major cause of low turnout. I am therefore astonished that the government has not been willing to let people know what their Police and Crime Commissioners are campaigning for, by providing the candidates with an individual freepost leaflet, even though they are willing to give Norfolk’s PCC a salary of approximately £70,000 and candidates must find £5,000 just to stand.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_martin-schmierer-selected-as-green-pcc-candidate/content_36.html": "Martin Schmierer has been selected as the Green Party’s candidate for Police and Crime Commissioner in Norfolk.\nThis is the first time the Green Party will be standing in Norfolk for the Police and Crime Commissioner election.\nIn 2012 the party stood in only one area – in Cleveland in the North East of England, where they won 13.7% of the vote.\nMr Schmierer, 29, is currently a city councillor in Norwich, where he is deputy leader of the Green group – the joint-largest group of Green Party councillors in the UK.\nPrior to becoming a councillor, Mr Schmierer was researching the causes of the relatively low life expectancy in Glasgow and the impact local government can have on public health.\nHe is currently campaigning to reverse the cuts and privatisation in the police force, ensure greater transparency in policing and allow greater community participation in setting police priorities.\nMartin Schmierer said:\n“The Green Party has a distinctive voice on crime and justice which needs to be heard at this election. We see crime as part of the wider social issues that are affecting communities across the county, and we are strongly in favour of restorative justice where we work with both victims and offenders to give support where it is needed and prevent future crime. This approach has been shown to reduce reoffending rates.”\nHe continued:\n“This is obviously a very exciting time for the party as it is the first time we are standing in these elections here.\n“A vote for the Green Party at this election is a vote for a fresh approach, and a strong, independent-minded voice. If elected, I will put the needs of local residents first and will ensure that more is done to involve communities in setting the Norfolk constabulary’s priorities.”",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_how-much-could-be-raised-by-introducing-a-late-night-levy/content_46.html": "One of Martin’s key policies, if elected, would be to introduce a “late night levy”, which allows local areas to charge businesses that supply alcohol late into the night for the extra enforcement costs that the night-time economy generates for police and licensing authorities.\nAt the moment, we only have estimates about how much this could raise in Norfolk, but it seems clear that £100,000s could be generated by implementing this measure, given what has happened in other areas where such a levy has been introduced.\nNewcastle became the first local authority to implement this levy on licensed premises operating between midnight and 6am in November 2013 and over the next year generated £302,942.\nThe cost of administering this levy was £22,500 and so the net gain to the council and to the local constabulary was £280,442.\nCheltenham Borough Council also introduced a similar scheme and raised £76,889.\nConsequently if such a scheme was implemented across the whole of Norfolk, it seems clear that £100,000s could be raised, which would be vital in supporting local services, especially at a time when the police and local authorities are facing drastic central spending cuts.\nTo find out more about the Late Night Levy, please click here",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_why-it-was-important-the-green-party-stood-at-this-election/content_28.html": "I am only one of seven Green Party Police and Crime Commissioner candidates at the next set of elections in May and I think it is vital that the Green Party did have some presence in these elections, not only because it ensures that Green members/ supporters can vote for a party they believe in, but mainly as it allows the Green Party to promote its progressive vision on issues, such as crime and justice.\nIf the Green Party were not to have stood across the UK, the party would have been denied any voice in these debates and here in Norfolk (a traditionally very conservative county), the debate would likely focus on quite reactionary policies and proposals. Instead, I am able to promote views about greater transparency in the police force, tackling issues surrounding the late night economy zone, prioritising unreported or under-reported crimes, such as domestic violence and rural thefts, dealing with mental health related issues and a host of other policies.\nI appreciate why the Green Party was reticent to stand in PCC elections both in 2012 and this year. As it happens, I was not comfortable with creation of these positions and still question their necessity. Indeed, I feel PCCs have too much power and the extra bureaucratisation and politicisation of the Police Force is something which we as a party should oppose. However, without fielding a candidate it is unlikely that the Green Party would have had a platform to air these views…",
  "http_martinschmierer_co_uk/http_martinschmierer_co_uk_my-vision-for-norwich/content_19.html": "Norwich is a beautiful medieval city and I am proud to live here, but there are a number of issues that I would like to see improved.\nToo many children are living in poverty; too few people are earning the living wage; urban transport is too expensive; air pollution is too high and education outcomes across the county could be improved. In order to deal with these issues, I propose to:\n1. Campaign to ensure that all businesses in Norwich pay the real living wage to all employees regardless of age.\n2. Promote the establishment of high tech sustainable businesses in the city, particularly those which focus on the renewable energy sector.\n3. Support small and medium sized local enterprises, especially start-ups, in the city.\n4. Call for the re-regulation of the buses to ensure that they go where there is demand rather than where companies can make the most profit.\n5. Press for the renationalisation of the railways and the improvement of the existing network, in particular the key Norwich to London line.\n6. Ensure that cycling and pedestrian groups are properly consulted before schemes to improve urban transport are approved.\n7. Accelerate the replacement of key polluting vehicles, especially buses.\n8. Promote cycling and walking education programmes.\n9. Oppose the creation of new ‘academy’ schools or grammar schools across Norfolk.\n10. Tackle anti-social behaviour (ASB), notably fly-tipping by reintroducing amnesties across the city for the disposal of white goods and other large household items.\n11. Push for Norwich to become the UK’s first single-use plastic free city.\n12. Campaign to reverse the savage cuts to local government spending imposed by Westminster and, wherever possible, protect the most vulnerable in our communities from such ill thought-out measures as the ‘bedroom tax’.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_04_greens-call-for-late-night-levy-introduction/content_35.html": "The Green Party’s Police and Crime Commissioner candidate, Martin Schmierer, has called on local councils to introduce a “Late Night Levy” across Norfolk.\nIt has been estimated that £100,000s could be raised in this way, which would be split between the Norfolk Constabulary and the local councils.\n70% would go to pay the police who have to put on additional patrol in areas such as Prince of Wales Road in Norwich.\nIt is also hoped that this will curb the problems associated with late night drinking on the streets in Norfolk’s towns and cities.\nThe levy was made possible through the 2011 Police Reform and Social Responsibility Bill which could see licensing authorities charge from £300 to £4,400 depending on the premises.\nGreen Party councillor, Ben Price, whose area covers Prince of Wales Road and who is vice chair of the licensing committee on Norwich City Council said:\n“A lot of late-night activity affects the ward I represent. It’s something that Norwich City Council has considered in the past, but it’s dependent on the police and crime commissioner backing the proposal.”\nMartin Schmierer, the Green Party’s Police and Crime Commissioner candidate said:\n“I fully support the introduction of this levy. I think this measure is very fair and ensures that those businesses which benefit from the late night economy zone pay a relatively modest annual fee to ensure that this part of Norwich becomes safer and cleaner.”\nHe continued:\n“It will also help ensure that the police can deploy more resources here and the local council can put on extra street cleaning so that the impact of this area on local residents is mitigated.”",
  "http_martinschmierer_co_uk/http_martinschmierer_co_uk_about-me/content_13.html": "I am currently the Lord Mayor of Norwich which is largely a ceremonial position, but does allow me to meet the various community and charity groups that work so hard to help the most vulnerable in our society.\nI am also a local councillor in Norwich, representing Mancroft ward, which covers most of the city centre. Between 2016 and 2018 I was the leader of one of the largest group of Green councillors in the UK.\nI have lived in Norwich since 1994 and feel I know what the priorities should be for the local administration and will campaign accordingly. Since being elected as a councillor for Mancroft ward in 2015, I have been involved with preparing the Green Party’s response to the Norwich City Council budget, where we sought to mitigate cuts to local budgets by implementing such measures as a licensing levy for venues that sell alcohol late at night.\nI will continue to outline a strong anti-austerity message to the people of Norwich, including looking to increase tax revenue to ensure fewer local council cuts.\nIn 2016, I stood as the Green Party’s candidate for the role of Police & Crime Commissioner in Norfolk where I campaigned to tackle issues such as anti-social behaviour in the city, particularly along Prince of Wales Road. I have continued to press for these important issues to be addressed.\nFor updates on my current work, please click here. Similarly, if you wish to speak to me about an issue, please get in touch.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2016_05_discussing-the-pcc-role/content_12.html": "Last night I was on Mustard TV discussing my ideas for policing in the east and what needs to be done to make Norfolk the safer county we all want to see.\nLast night I was on Mustard TV discussing my ideas for policing in the east and what needs to be done to make Norfolk the safer county we all want to see.",
  "http_martinschmierer_co_uk/http_martinschmierer_co_uk/content_1.html": "My name is Cllr Martin Schmierer and I am a candidate for Norfolk Police and Crime Commissioner. I was previously the Lord Mayor of Norwich and leader of the Green Party group on Norwich City Council.\nI was previously the Lord Mayor of Norwich, which is a primarily ceremonial position, but this role allowed me to meet the many community and charity groups that work so hard to improve the lives of the most vulnerable in our society.\nI have lived in Norfolk since 1994. I am a local councillor in Norwich for Mancroft ward which covers much of the city centre.\nSince being elected in 2015, I have campaigned to make Norwich a fairer and cleaner city. It is unacceptable that, according to the last census, 41% of children in my ward live in poverty.\nI will continue to present a strong independent-minded voice who will put the needs of local residents first and will ensure that more is done to involve communities in dealing with the issues they face.\nGreen Party councillors have a history of working hard for the residents they represent. Norwich elected its first Green Party councillor in 2002 and today the Green Party is the official opposition on Norwich City Council.\nPlease have a read of my vision for Norwich for Norwich and the latest updates about my work. Please also feel free to contact me with any questions or suggestions.",
  "http_martinschmierer_co_uk/http_martinschmierer_co_uk_get-in-contact/content_16.html": "I always welcome suggestions for how I can help make Norwich a fairer and cleaner city and would be delighted to receive any feedback.\nPlease do not hesitate to get in contact with any questions or views.\nCllr Martin Schmierer\nc/o Norwich Green Party\n31 Kensington Place\nNorwich, Norfolk\nNR1 3JE\nTelephone: 01603 611909\nEmail: m.schmierer@cllr.norwich.gov.uk\nYou can also tweet me at @martinschmierer.\nPlease follow me on Facebook.",
  "http_martinschmierer_co_uk/https_martinschmierer_co_uk_2018_05_delighted-to-announce-that-this-years-civic-charity-will-be-the-feed/content_3.html": "At this week’s full council meeting, I was delighted to announce that this year’s civic charity will be The Feed which works to help the homeless in Norwich get “off the street [and] into the kitchen”. I and the new Sheriff look forward to fundraising for this very worthy social enterprise.\nPlease see my speech below about why they were selected…\n“I am sure that everyone in this chamber has been struck by the plight of the growing number of homeless in cities up and down the country and sadly Norwich is no exception. I am therefore delighted to announce that this year’s civic charity will be The Feed which works with the homeless in Norwich.\n“The Feed is a charity with the aim to get people ‘Off the street and into the kitchen’. They work with people who have been homeless, have mental health problems and other significant barriers to employment and housing. They provide training and support and use food as a way to get people involved and interested. This year they will be opening a sandwich shop and new training academy right in the heart of the city to enable them to increase the amount of people they can train and support.\n“The Feed was set up four years ago and was a spin off from Norwich Leap which was in itself a pioneering project set up by the city council acknowledging that one of the best ways to help people maintain a tenancy is to help remove the barriers to getting a job. In the last year The Feed has got 33 people work ready and eleven people into paid employment. The new training academy will enable The Feed to grow to train over 100 people a year and being the civic charity will help them to raise the funds to secure and fit out the new premises. The new premises will also be used to provide direct support to vulnerable people who need a meal and some advice on evenings and weekends.\n“This is a wonderful opportunity to make a lasting positive impact on the livelihoods of some of the most vulnerable in our society and I look forward to helping them realise their goals over the coming 12 months.”"
}