{
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_push-ahead-with-universal-basic-income-pilot-to-lift-fife-children-out-of-poverty/content_44.html": "Push ahead with Universal Basic Income pilot to lift Fife children out of poverty\n- Neale Hanvey MP\n- Jul 21, 2021\n- 2 min read\nThe only way to eradicate the “scourge of child poverty in Fife” is to introduce a Universal Basic Income.\nThat is the message of Kirkcaldy and Cowdenbeath MP, Neale Hanvey, who has called on the Scottish Government to push ahead with a proposed trial in Fife irrespective of the UK government’s refusal to support such a pilot.\nIt is imperative that we try everything possible to solve the terrible scourge of child poverty in Fife and across Scotland.\nSpeaking following a visit to The Cottage Family Centre, the local MP praised the efforts of Pauline Buchanan and her team who have teamed up with Café Inc to help with lunches during the summer holidays. Mr Hanvey described the local efforts as the “true spirit of our community”, but he added that “something is going seriously wrong when there are kids at risk of going hungry during the school holidays, particularly when you think of the wealth in our country.”\nMr Hanvey’s renewed calls for a Universal Basic Income come as a report from the TUC released today found that one in five children in the UK whose parents are key workers are currently living below the official breadline.\nThe Kirkcaldy and Cowdenbeath MP has been a vocal proponent of a Universal Basic Income since his election in 2019. In May last year, he joined a campaign of 110 parliamentarians pushing for its introduction.\nUnder a Universal Basic Income pilot, everyone in Fife would receive a monthly payment from the Scottish Government, and this would replace several existing benefits. To date, the Scottish Government has maintained that it would not be possible to run such a pilot without the support of the UK government since social security remains largely reserved to Westminster.\nCommenting, Neale Hanvey MP said:\n“Today’s report from the TUC shows yet again how children across these islands are facing horrific hardship. We’re talking about kids whose parents are in work, doing crucial frontline jobs, in a group of nations with vast natural and human resources.\n“I hear the same stories every week from organisations across the Kirkcaldy and Cowdenbeath Constituency.\n“Well, we can complain about the impact of austerity from Westminster, the fact the UK government has removed the £20-a-week Universal Credit uplift, and the lack of support for folk throughout the pandemic – or we can do something about it.\n“That’s why I’m calling on the Scottish Government to push ahead with an adapted version of the proposed Universal Basic Income pilot in Fife. It won’t be exactly as planned given the limited powers we have over social security, but we must be bold. It is imperative that we try everything possible to solve the terrible scourge of child poverty in Fife and across Scotland.”",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_local-mp-slams-mod-over-pathetic-excuses-for-further-delay-to-dalgety-bay-beach-clean-up/content_69.html": "Local MP slams MoD over “pathetic” excuses for further delay to Dalgety Bay beach clean-up\n- Neale Hanvey MP\n- Mar 9, 2021\n- 2 min read\nThe long-overdue clean-up of Dalgety Bay beach has been delayed yet again as the Ministry of Defence confirm a revised date from Spring to 1 July 2021, infuriating local MP, Neale Hanvey, who has branded promises from the MoD as “misleading at best and verging on the downright dishonest”.\nIn a stern letter to the Secretary of State for Defence, Mr Hanvey described his “serious alarm” and “concern” at the failure of the MoD to obtain the necessary licences to begin the clean-up at Dalgety Bay beach. While falling short of blaming the Minister for the misleading information, the local MP demanded an explanation for the “contradictory positions” between the MoD and the Scottish Environment Protection Agency (SEPA).\nThe furore arose following information provided to the South and West Fife Area Committee last week when SEPA confirmed that no application had been submitted to carry out the work in Dalgety Bay and that there was a projected four-month turnaround for submitted applications. This raised serious questions over the timeline for the work presented by the MoD.\nIn his letter to the Defence Secretary, Mr Hanvey pointed out that he had been informed by the Minister for Defence Procurement on 25 November that applications for the licences had been submitted. Responding on behalf of the Secretary of State, the Minister skirted the issue before confirming that “the final elements of the application” are yet to be submitted.\nCommenting, Neale Hanvey MP said:\n“After trying to spin their way out of this last week, the MoD has now confirmed, once again, that the radiation clean-up at Dalgety beach has been delayed by their own failings. The Minister even had the gall to tell me that they are looking forward to work getting underway in the summer.\n“We’ve heard it all before, so I think folk in Dalgety Bay can be forgiven for being sceptical about the MoD’s promises. Although, it must be said, this is the first time there has been such a clear inconsistency between the MoD’s claims and the truth as set out by SEPA.\n“As I said to the Defence Secretary, people in Dalgety Bay have been disregarded for too long and I will not tire in providing my constituents with the robust representation they expect and deserve.\n“The MoD must face up to its responsibilities and understand that no amount of mealy-mouthed excuses will make this issue go away.”\nImage rights: © Copyright Simon Johnston and licensed for reuse under this Creative Commons Licence.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_public-health/content_3.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_sneak-peak-let-s-get-justice-for-the-waspi-women/content_33.html": "SNEAK PEAK: Let's get justice for the WASPI women\n- Neale Hanvey MP\n- Sep 7, 2021\n- 1 min read\nRemember holidays? Back in those heady pre-Covid days, we’d squirrel away money to splash out on restaurants by the beach, theme parks in the sun, or hurtling down mountains on a couple of planks of wood in the snow. Bliss.\nNow imagine you’d been putting aside money for a big family holiday – one of those once in a lifetime adventures. But just before you were due to leave, the travel agent sends you a letter telling you that all that planning, all that saving, all that excitement had been for nought. The holiday had been rescheduled to happen in… six years.\nThis is what happened to 6,400 women in the Kirkcaldy and Cowdenbeath Constituency. Except, it’s not a holiday, it’s their state pension – all because the Department for Work and Pensions ‘failed to make reasonable decisions’ and were guilty of ‘maladministration’.\nNot my words, but those of the Parliamentary and Health Service Ombudsman who has been tasked with looking into the whole sorry affair...\nPICK UP A COPY OF THE FIFE FREE PRESS ON THURSDAY TO READ THE REST OF NEALE'S COLUMN",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_profile_craigkelly_profile/content_19.html": null,
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_opinion-the-pandemic-strikes-at-who-we-are/content_71.html": "OPINION: The pandemic strikes at who we are\n- Neale Hanvey MP\n- Feb 25, 2021\n- 2 min read\nUpdated: Mar 9, 2021\nThis column was originally published in the Fife Free Press on 25 February\nThe news that the Links Market won’t run in April will be met with shrugs from those already resigned to the disruptions caused by the pandemic. “What did you expect?’ will be a common refrain.\nSome can take change in their stride, while others will be disappointed, even a little unnerved. But for a few, the impact of the pandemic on cultural events like the Links Market can have a traumatic and dislocating affect. The postponement impacts the showmen the most, but it will be felt by every one of us.\nWe are the renewed appreciation of our local businesses. We are the folk out picking litter to clean up our parks and beaches. We are the café hiring an 82-year-old man to recognise his worth, while combating his loneliness.\nThis might sound a bit melodramatic. Aye, it’s the longest market in Europe, a fun day out for the family, and one that brings in around 300,000 visitors to the Langtoun – but, it is just The Shows, isn’t it?\nWell, I’d suggest that completely misses the point. The pandemic is tragic on so many levels, and whilst still in its grip what remains largely unexplored is its devastating strike at our sense of who we are.\nBeing a part of the Kirkcaldy community will mean different things to each of us. For some, our community might be defined by its rich history, for others our stunning location on the banks of the Firth of Forth. Our belonging might centre on our support for the Rovers, or the Flyers, or our schools, parks, theatre, library, high street, and you guessed it, being the home of the Links Market.\nSo, what does it mean to be part of the Kirkcaldy community when we have been unmoored from our cultural anchors – when the things that make us who we are have been closed, limited, or postponed? And if belonging tae Kirkcaldy is a large part of how you identify, what impact does that have on you?\nThese are challenging questions, and the temptation can be to shirk away from them. But I think that would be wrong.\nSo, this is what I think our community is showing in these trying times. We are the renewed appreciation of our local businesses. We are the folk out picking litter to clean up our parks and beaches. We are the café hiring an 82-year-old man to recognise his worth, while combating his loneliness.\nThis is us. It won’t always be this way, our events, our sport, normality will return. And we will be right behind them and once again we will know who we are.\nImage: © Copyright Bill Kasman and licensed for reuse under this Creative Commons Licence.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_gender-reform-conflicts-with-women-s-rights-and-child-safeguarding/content_29.html": "Gender Reform conflicts with women’s rights and child safeguarding\n- Neale Hanvey MP\n- Oct 3, 2023\n- 2 min read\nIf you’re sick to the back teeth of identity politics and consider the issue a major snooze-fest, now might be a good time to pay attention. In a few short weeks the Scottish Government’s Hate Crime and Public Order (Scotland) Act 2021 comes into effect and things will move from abstract debate into the real world of criminal prosecution.\nThe omission of Equality Act protected characteristics ‘sex’ and ‘belief’ means firstly, that women do not exist as a sex class for the purposes of the Act, and secondly, if you state that a woman is an adult human female in front of the wrong person, or write it in a social media post, you run the risk of being charged with a Hate Crime. Or, if you complain about a male bodied person in a traditionally female-only space and they self-ID as a woman - Hate Crime.\nAlthough the Act includes Sexual Orientation as a protected characteristic, it is silent on the definition of sex, so the same applies to lesbians and gay men who state they are attracted exclusively to same-sex partners. Seriously.\nSuch basic statements, even made in the privacy of your own home, could see you reported, arrested and charged by Police Scotland’s newly established Hate Crime Unit.\nIt goes without saying there is no place in a civilised society for any individual or public body to discriminate against any other individual or group in a way that is motivated by hostility or prejudice. So why leave women out?\nWell the Scottish Government say they are bringing forward separate misogyny legislation, but that bill also intends to include males who self-ID as women, and the Hate Crime Act will handily criminalise anyone who objects.\nThe bar for prosecution is extremely low. No witness or corroboration is required and the definition of “harassment” is poorly described and includes a wholly subjective test of “causing the person alarm or distress”. Such vague scope invites malicious complaints, prosecutions, conviction and ultimately incarceration.\nGiven my outspoken objection to this SNP and Green Party legislation I fully expect to be accused and arrested under this law. So far I’ve had repeated actions against me, I’ve suffered murderous threats and I’ve been dragged through the media for highlighting Gender Reform conflicts with women’s rights and child safeguarding.\nThose pushing this illiberal legislation claim to be on the right side of history, they’re absolutely not.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_neale-interviewed-for-documentary-on-kirkcaldy-civil-rights-campaigner-kath-duncan/content_14.html": "Neale interviewed for documentary on Kirkcaldy civil rights campaigner, Kath Duncan\n- Neale Hanvey MP\n- Sep 7, 2021\n- 3 min read\nKirkcaldy and Cowdenbeath MP, Neale Hanvey, has been interviewed for a much-anticipated documentary on radical campaigner, Kath Duncan, who spent fifteen years as a schoolteacher in the Lang Toun during the 1910s and ‘20s.\nThe documentary makers were keen to interview Mr Hanvey, not only as the MP representing Kath Duncan’s adopted home, but also because he is the first out gay MP for the Kirkcaldy and Cowdenbeath Constituency. Recent research has shown that Duncan was a lesbian and used her London home to create a safe space for lesbians and gay men during a period when homosexuality was illegal across the UK.\nIn a wide-ranging interview, the local MP drew on Kath Duncan’s story to discuss the current divisions in the LGBT movement as a consequence of the approach taken to advance transgender rights by the Scottish Government and its impact on women’s and LGB rights. Mr Hanvey spoke about his personal experiences as a gay man in the 1980s and the support the gay community received from women during the AIDS pandemic. He said that he feels a “solidarity with women trying to protect their rights” and pointed to his mother’s trade unionism and work supporting victims of domestic abuse as having a significant influence on his politics.\nNeale being filmed with documentary maker, Ray Woolford\nKath Duncan has been described as the “most important civil rights campaigner of the last century”, having been involved at the highest level in campaigns such as the 1920s hunger marches, the fight against Oswald Mosley’s fascists and her connection to the Suffragette movement. Despite her years of successful campaigning, she is not a household name in Kirkcaldy or anywhere else in the UK, and this is something that playwright, author and documentary maker, Ray Woolford, aims to change.\nFollowing up on his well-received book about Duncan, ‘The Last Queen of Scotland’, Woolford’s documentary seeks to bring the Kirkcaldy radical out of the shadows, using her story to explore modern themes of poverty, power and politics, and also current issues connected to the LGBT movement.\nFilming is due to finish later this year, with the film set for release during LGBT History month in February 2022.\nCommenting, Neale Hanvey MP said:\n“It’s sad that Kath Duncan’s powerful story is largely unknown, but it would have been a travesty if her outstanding achievements had been lost in the mists of time. Ray has rescued this amazing woman’s story and I am deeply honoured to play my part. She is exactly the sort of person that should be taught in schools – a name that should be connected to Kirkcaldy and celebrated no less than Adam Smith.\n“That’s why I wanted to take part in the documentary and why I think we need to honour Kath in some other way – perhaps through a statue or street name. We’ve got one of the most important civil rights campaigners of the last century connected to our town, yet she’s not recognised in any way.\n“The breadth of issues that Kath campaigned on reminds us that LGBT campaigning was going on long before Stonewall, and that of course all civil rights movements are fundamentally intertwined. There is much more that unites us than divides us. I think we need to be mindful of that in current debates around how we protect and respect transgender rights and women’s rights.\n“Kath stood for solidarity, for community, for fairness. These are principals I see woven through our town today and it is fitting that Kath is finally getting recognition for a life of dedicated service to advance the rights of others.”",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_contact/content_16.html": "top of page\nCONTACT\nGet in touch with Neale and his team\nIf you are a constituent and would like some help and advice, please contact Neale on:\n📧 neale.hanvey.mp@parliament.uk\n🏢 Constituency Office\nUnit 1, 206 - 210 High Street\nKirkcaldy\nKY1 1JT\nFor all press enquiries, please contact Neale's Office Manger, Lisa Young:\n📧 lisa.young@parliament.uk\n📞01592 210088.\nbottom of page",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_public-access-to-burntisland-docks/content_57.html": "Public access to Burntisland Docks\n- Neale Hanvey MP\n- Mar 1, 2021\n- 1 min read\nI speak a lot about the spirit of community that exists across the Kirkcaldy and Cowdenbeath Constituency. In these challenging times, one silver lining has been the renewed appreciation folk have for our surroundings. That’s why it’s really concerning to hear about Forth Port's plans to restrict public access to Burntisland Docks. Many people use the docks daily to go for walks, cycling, and to appreciate the marine life in the area. I get it. This is a community resource. So, it’s encouraging to see people in Burntisland come together and campaign against these proposals. This is a real community effort. At the time of writing, the petition has 2,309 signatories. I first heard about Forth Port’s plans in late January and I immediately wrote to the port manager to get more information for the community. That’s the least I can do as the local MP. I’ve also got a meeting scheduled in with Forth Ports and I’ll attend the next Burntisland Community Council meeting to keep the community updated. If you’d like to lend your support to the campaign, you can sign the petition by clicking here.\nCredit for the image: Copyright Thomas Nugent and licensed for reuse under this Creative Commons Licence.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_community/content_5.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_a-fly-in-the-ointment/content_34.html": "“A Fly in the Ointment” - independence must now be fought for as one Scotland United\n- Neale Hanvey MP\n- Jun 27, 2023\n- 2 min read\n“A fly in the ointment” is an idiom we’ve all used to explain something wrong, unwelcome, or unpleasant that gets in the way. It can range from a small defect that spoils something valuable to something unhelpful that undermines otherwise good fortune.\nSince the days after the 2014 independence referendum, the fly in the ointment of Scotland’s advance to Statehood has been the absence of a clear mechanism with which to honour the commitment given in paragraph 18 of the Smith Commission report which states without caveat; “It is agreed that nothing in this report prevents Scotland becoming an independent country in the future should the people of Scotland so choose.”\nBlaming any Prime Minister or First Minister won’t change the fact that despite the Edinburgh Agreement establishing a clear democratic process, the Scottish Parliament is a creature of the UK State and power reserved is power retained.\nTo remedy this, my Scotland Self-Determination Bill seeks to introduce equality of opportunity to the Scottish people with that currently enjoyed by the people of Northern Ireland at Section 1 of the Northern Ireland Act (1998); a referendum every seven years if one is supported by the people.\nThe obvious fly in that ointment is the recent UK Supreme Court judgement which, as well as boxing in Scotland’s Government on independence, claimed the Scottish people do not have a right to self-determination.\nWell, this past week I published an expert legal opinion from esteemed international legal expert, Professor Robert McCorquodale, and his opinion dismantles that element of the judgement.\nAccording to Professor McCorquodale “As the people of Scotland are a people for the purposes of the right to self-determination, they can exercise it. The choice of the means to exercise is for the people to decide and not for the State.” Furthermore, he explains that the UK, as a signatory to multilateral international human rights treaties has “expressly accepted that the right to self-determination is a human right… which is binding under international law on all States”.\nThis puts the UK Government firmly on notice that the people of Scotland will have their democratic say. However, the opinion supports the view that any such campaign must be fought and won, not by a single political party, but as one Scotland United. Failing to campaign this way would taint the case for independence, and that’s one fly in the ointment we must prevent.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_page_2/content_30.html": "top of page\nWEEKLY COLUMNS\nThe latest updates from Neale\nSearch\nAug 27, 20212 min read\nAug 27, 20211 min read\nAug 27, 20213 min read\nAug 27, 20212 min read\nAug 19, 20212 min read\nJul 21, 20212 min read\nJul 8, 20212 min read\nJul 7, 20213 min read\nJul 6, 20212 min read\nJun 21, 20213 min read\nbottom of page",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_former-cancer-nurse-neale-hanvey-mp-calls-for-focus-on-cancer-care/content_72.html": "Former cancer nurse Neale Hanvey MP calls for focus on cancer care\n- Neale Hanvey MP\n- Feb 16, 2021\n- 3 min read\nUpdated: Feb 17, 2021\nCancer must not become the forgotten C during the current public-health crisis. That is the message of former cancer nurse, Kirkcaldy and Cowdenbeath MP Neale Hanvey, following a virtual meeting with Cancer Research UK to mark World Cancer Day.\nMr Hanvey, who was divisional nurse director for rare cancer at the Royal Marsden Hospital prior to entering politics, has raised concerns about the profound impact Covid-19 is having on Fifers living with cancer. He said that despite the best efforts of incredibly hard-working NHS staff, there has been disruption to services that has created a backlog of cancer care, with Macmillan estimating that there are 50,000 people in the UK yet to receive a cancer diagnosis from last year.\nThis intervention comes as statistics from south of the border show that referrals for suspected lung and urological cancers were down significantly as a result of the pandemic. A report from Public Health Scotland late last year also showed a drop of 22 percent in the number of cancer patients who were referred for tests and scans or started treatment between April and June 2020.\nThis intervention is the latest in a series of campaigns run by Mr Hanvey into issues relating to cancer care and research. In November last year, the local MP coordinated a cross-party campaign, in conjunction with the leading national charity dedicated to research into childhood cancer, Children with Cancer UK, to pressure the UK government into creating a scheme designed to support medical research charities who are suffering from a severe reduction in income as a result of the pandemic.\nMr Hanvey also previously raised concerns about the cancer recovery plan with Sir Simon Stevens, Chief Executive of NHS England, at the Health and Social Care Select Committee.\nThe Kirkcaldy and Cowdenbeath MP remains the SNP member and spokesperson for the prestigious Health and Social Care Select Committee chaired by former Tory Health Secretary, Jeremy Hunt MP.\nCommenting, Neale Hanvey MP said:\n“There are a lot of stats flying around about cancer care across the UK, but what is clear is we have folk in the NHS working incredibly hard to treat and support people living with cancer. Take the Maggie’s Centres, these are open across Fife – supporting folk in person and by phone at the Victoria Hospital and beyond.\n“But clearly the public-health restrictions have an impact on all of us, and that includes people living with cancer. I know from my time supporting cancer patients that the process can be very isolating in normal times, so the restrictions are having a disproportionately negative impact on them.\n“That’s why I’m using my meeting with Cancer Research UK to speak out about the need to focus on cancer care at the same time as dealing with the pandemic. My message to Fifers is clear: if you have symptoms, get checked; if you need support, it’s open and available.\n“And thank you, again, to the amazing NHS Fife staff doing an incredible job in the most difficult of times.”\nShaun Walsh, Head of Public Affairs and Campaigning at Cancer Research UK, said:\n“A big thank you to Neale for joining us to raise awareness on World Cancer Day, even if we’re not able to do it in person this year.\n“It’s been a tough year for what the pandemic has meant not only for cancer care but also research. We’re expecting to see fundraising income decline by £160m this financial year and by £300m over three years as a direct result of the Covid-19 pandemic. Uniting to beat cancer has never been more important.\n“That’s why we want to work together with Neale in the months ahead to secure a long-term strategy to help recover, rebuild and rethink how we transform cancer services to help the patients of today and tomorrow, protect vital services and ensure we’re investing and building on years of scientific breakthroughs, not falling behind.”\nClick here to read the story covered in the Fife Free Press",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com/content_1.html": "I am not currently an MP as Parliament has been dissolved.\n12th October 2023\n“Tackling the unkempt-to-derelict appearance of some shop fronts\nis a sure-fire way to make the High Street a\nmuch more inviting destination\nfor shopping, leisure and starting a business...\"\nto read this week's Fife Today article on the meeting\nof traders, landlords and organisations which I recently hosted at Koku Shi\n08th November 2023\nStatement on the crisis in Gaza\nThroughout my life, I have taken no issue in condemning violent oppression and abuses of human rights, and this is borne out by my record of doing so wherever such abuse is perpetrated. I am also a vocal proponent of freedom of thought, freedom of expression, and religious freedom, but I draw a firm line at the monstering of a people or ethnic group, or the misuse of such identities as a means to cover for, or qualify, human rights abuses.\nHaving been born into pre-troubles Northern Ireland and living through the early years of that violent conflict I have a deep personal sensitivity to such issues. I have heard first-hand hate filed words attributed to a whole community. I have witnessed neighbours bombed from their business and home, and I have heard the indignant voices claiming moral superiority to justify those actions. I know people who were caught up in the violence, both perpetrator and victim, and I’ve heard first-hand the regrets of those who fought for a cause they now realise was a lie, and also from those who lost loved ones at the hands of violent strangers. There are no winners to violence.\nHowever aggrieved or embittered either side may be, truth, dialogue and reconciliation are the only mechanisms which can chart a route of escape from the futility of escalation and towards peace.\nMy focus since the events of October 7th has been on the civilian populations, and they remain my priority. As a result, I chose not to add my voice to the clamour of those who now find themselves attempting to row back on words uttered just a matter of days prior.\nThe position of the Alba Party was made clear in the statement issued by Alex Salmond on the 9th October, which said all that could usefully be said in public at that time. There is no advantage to the people of Israel or Palestine for any of us to inflame an already desperate situation. I have privately contacted people directly affected by current hostilities to express my sadness, offer support, and give my condolences for the tragic losses of life.\nWhilst there have been calls for further comments from voices polarised on either side of this conflict, all I can say in response to them is this: If I believed there were words I could say to calm the violence and save lives, I would offer them in a heartbeat. However, if they seek a comment to bolster a personal position then that’s simply not a priority for me. The people who are trapped in a nightmare of violence are, and I won’t risk adding to their trauma by doing anything other than endorsing my party’s continuing calls to ‘choose the path of de-escalation and ceasefire’. As Alex has said, “there can be no lasting settlement which ignores long-standing United Nations resolutions and there is no path to peace which can be initiated by violence against civilians.”\nThere is no argument that can qualify, claim equivalence, or justify the violence we are witnessing. My firm position is that we should all be campaigning for peace.\nAt my party’s recent conference, our membership reaffirmed this position and I will dedicate my focus towards those ends in the days ahead.\nFor now, our collective efforts should get behind all humanitarian organisations and I ask you to consider supporting appeals from organisations such as Doctor Without Borders, and the International Committee of the Red Cross (ICRC).\n15th November 2023\nMy question to the Prime Minister on the\nurgent need to call for a ceasefire in Gaza\n16 January 2024\n\"It is increasingly apparent that this is not a Union of equals. The UK is wilfully subverting the will of the people of Scotland by denying them their established human rights, as enshrined in the UN charter and in international treaty obligations, that the UK state entered freely.\"\nMy speech, as I reintroduced my Scotland (Self-Determination) Bill, seeking to transfer to the Scottish Parliament\nthe power to legislate for a Scottish independence referendum\n08th January 2024\n'The Bill you are consulting on will exacerbate the extant modern conversion therapy scandal\naffecting vulnerable GNC young people and others struggling with pubertal body dysmorphia.\nFurthermore, it risks embedding in statute the lie that GNC behaviour is evidence\nthat some of those young people were ‘born in the wrong body’,\nthat the normal development of puberty should be arrested with chemicals,\nand that trauma and emotional distress can be fixed with cross-sex hormones and irreversible radical surgical intervention by affirming them onto an accelerated and irreversible pathway which amounts to a policy of ‘transing away the gay’.\nThis is wrong'\nMy letter to the First Minister of Scotland, regarding the\nsafeguarding risks of a so-called ‘ban’ on conversion therapy\n6th December 2023\n\"What action can be taken to make sure that legislation is fit for purpose,\nand it matches all of the protected characteristics contained in the equality act?\"\nMy Parliamentary Question to the Women and Equalities Minister\non Gender Recognition\n6th December 2023\n\"It is not a ban on conversion therapy that the Bill proposes; rather, it is rocket fuel for radicalised ideologues, to trans away the gay, depriving a generation of young LGB people from becoming the fabulous, vibrant and unique, gender non-conforming people they have every right to be.\"\nMy speech at the debate on Conversion Practices\n29th November 2023\n\"Under Westminster's rule, Bathgate, Linwood, Methil and Irvine, are all no more.\nGrangemouth now risks being added to that sorry list,\nand with it, hope for it's role in developing carbon reduction technologies.\nWhat is HIS office doing to protect jobs, employment, and livelihoods in Scotland?\"\nMy Parliamentary Question to the Secretary of State for Scotland\non the Grangemouth oil refinery closure\n23rd November 2023\nMy Parliamentary Question on the economic impact\nof UK energy policy on the people of Scotland\n23rd November 2023\nMy Parliamentary Question on\nDavid Cameron and the Greensill scandal\n21st November 2023\n\"Will the Government provide a guarantee that they will not intervene against any\nfuture ICC investigation into war crimes perpetrated against the people of Gaza?\"\nMy Parliamentary Question to the Secretary of State for Justice\n21st November 2023\n\"Scotland urgently needs a robust strategy that overcomes\nthe Westminster denial of a democratic process\"\nMy speech on the UK Government's policy on a further\nindependence referendum for Scotland\n13th November 2023\n\"My meeting with the Fife Divisional Commander was detailed and constructive and as a matter of priority I raised concerns about call response times and in person follow up on reports made by traders and members of the public alike.\n“Following my meeting I have personally noticed an increased police presence on the High Street, particularly during market days and there has been progress made on Police Scotland’s commitment to follow up on reports.”\nto read this week's Fife Today article on\nthe work I have undertaken to tackle anti-social behaviour in Kirkcaldy town centre\n09th November 2023\nIn reply to the King's Speech\n23rd October 2023\nMy Parliamentary Question on the need\nfor Network Rail to address drainage maintenance failures\nin order to avoid further fatal accidents\n19th October 2023\nTrends in excess deaths – Andrew Bridgen MPs Adjournment debate\nI have received correspondence from a number of constituents who have asked me to attend the debate scheduled to take place tomorrow afternoon.\nIt is important to note that this is an adjournment debate rather then a full debate. Consequently, should it proceed then it will be a thirty-minute session at the end of the day’s sitting and will be an opportunity for Andrew Bridgen MP to raise the matter with the appropriate government minister. No other MPs are likely to be involved in the debate, nor will a vote take place.\nI have spent this week in the constituency, and with the severe weather from which Fife is currently suffering also being taken into account, I have to advise that I will not be travelling to Parliament for this debate.\nNonetheless, I can confirm that this is a matter around which I have much concern, and I have twice previously raised the subject of vaccine damage in Parliament. You can view my contributions here and here.\nI can also advise that I am in dialogue with Andrew Bridgen; that I will be following the debate closely online; and that I intend to further discuss the subject with Andrew Bridgen afterwards.\n22nd September 2023\nContinuing to press the UK Government to provide new financial help for WASPI women affected by State Pension age changes\nWASPI women have suffered a litany of failures at the hands of the UK Government. The Tories must come clean on their failure and offer proper transitional protection in the future, and compensate the WASPI generation both promptly and fairly. It is clear to many that their actions have robbed WASPI women of their entitled retirement.\nThat this injustice is happening in parallel with the current increase in pensioner poverty in the UK makes it abundantly clear that the Conservative Government are failing the over-60s.\nI readily confirm my steadfast support for the campaign to ensure the UK Government takes the necessary action to correct this dreadful injustice.\nto read the recent Daily Record article on my ongoing work on the WASPI campaign\n16th September 2023\n\"We must speak to the world as one movement,\nnot a single political party -\nThe SNP leadership's plan is the opposite of what needs to be done\"\nMy speech at the Scotland United for Independence rally\nGeorge Square, Glasgow\n12th September 2023\n\"First it was the two child cap, then it was the Bedroom Tax, now protecting the Triple Lock for Pensions is the latest Labour u-turn in the making. It does beg the question of ‘what is the point of Labour?'...\"\nto read my thoughts on the Labour Party's shocking refusal to commit to helping pensioners\n12th July 2023\nMy Parliamentary Question on freedom of expression\n11th July 2023\nMy Parliamentary Question on\nthe importance of ensuring a broad portfolio of vaccines\n20th June 2023\nNew Legal Opinion Outlines\nInternational Routes to Independence\nThe first detailed criticism of the Supreme Court’s ruling to block the Scottish Government from\nholding a second independence referendum.\nNeale has published a legal opinion by Professor Robert McCorquodale - of Brick Court Chambers\nand a member of the United Nations’ working group on business and human rights -\nwhich confirms that there are international legal routes through which Scotland can secure independence.\n“The legal opinion we are publishing today reinforces and supports equitable access to\nthe right to self-determination of all peoples within the current Union.\nThey also offer robust challenge to the legally flawed judgement of the UK Supreme Court.”\nto read the full article in The National\n24th May 2023\nTrident: Radiation Leaks\nThe Ministry of Defence has revealed that there have been 58 radiation leaks at Trident facilities\nin Scotland so far this year.\n“It seems that getting answers out of the Ministry of Defence is like trying to get blood out of a stone. When it comes to weapons of mass destruction in Scotland, it is clear that the UK Government will tell us as much as they have to and as little as they want to....\"\nto read my comments in The National\nThe Latest News & Opinion from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_social-security/content_24.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_opinion-we-love-our-music-and-the-world-loves-it-too/content_59.html": "OPINION: We love our music and the world loves it too...\n- Neale Hanvey MP\n- Feb 9, 2021\n- 2 min read\nThe first single I bought was Ballroom Blitz by the Sweet. While it’s no longer on my frequent playlist, its international longevity is undeniable appearing in blockbusters like Suicide Squad more than forty years after I got my primary school mitts on it.\nLike many of my contempories, that early interest in music became an obsession during my teenage years. Every school had multiple bands popping up with dreams of ‘making it big’. For most it remained a dream, for very few those dreams came true and for others their love of music, playing live and touring endures to this day. However, on New Year’s Day 2021 this became much, much harder.\nYou see, the UK government did not prioritise securing visa-free EU travel for touring musicians and performers – as a result, touring is now a costly and bureaucratic nightmare.\nIt’s not as if performers haven’t suffered enough. Work, touring and merchandise income has largely ceased during the pandemic. The construction of these additional barriers could halt the sector’s recovery and limit our access to performers from the EU – who are also now required to obtain costly visas, provide proof of savings and evidence of sponsorship.\nSome bands are already being forced to cancel tours.\nFife band Aye Hobos were due to take their impending new album Cunk It Up on tour with a reciprocal return from German band the Berlin Blackouts, but this is no longer feasible thanks to the UK government’s Brexit incompetence. This matters.\nWe love our music, and the world loves it too contributing almost £6bn to the UK economy. World class events like Celtic Connections, Edinburgh International Festival and The Mòd are huge success stories that put Scotland and our talent on the global stage.\nScotland’s international reputation as an open, welcoming and outward looking country is now at risk as our world-leading festivals’ ability to attract international guests is stymied.\nI’ve lodged an Early Day Motion calling on the UK government to correct this mess as a matter of urgency. Scotland’s music is one of our greatest exports. From Average White Band to Big Country, Biffy Clyro to Lewis Capaldi and so many others, our music is among the best.\nGlam-rockers Sweet might have seemed otherworldly to me in 1973, but frontman Brian Conolly rose from the poverty of Govanhill – an opportunity now all but gone. So much for taking back control.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_tags_2020/content_37.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_about/content_17.html": "In December 2019, Neale was elected as member of parliament for the\nKirkcaldy and Cowdenbeath Constituency. Neale was previously the SNP\nWestminster Group spokesperson for vaccine deployment and the SNP\nrepresentative on the Health and Social Care Select Committee. As of\n28 March 2021, Neale took the decision to leave the SNP and join the\nnewly-established Alba Party, a political party set up to deliver a super-majority\nfor Scottish independence at Holyrood.\nNeale was born in Belfast and lived in the north of Ireland through his early years. At the age of seven his family moved to Glenrothes New Town in Scotland.\nNeale attended Glenrothes High School before starting his career in nursing. He completed a mental health nursing qualification (RMN) in Fife. Following this, Neale completed his general nurse training (RGN) at the Western General Hospital in Edinburgh.\nMoving to London in 1993, Neale worked at University College London Hospital’s (UCLH) Clinical Haematology and Bone Marrow Transplant service. During this time Neale completed a post-registration diploma in oncology and palliative care. After successive promotions, Neale took up the post of charge nurse on the Teenage Cancer Trust Unit, at UCLH’s Middlesex site, before taking on the role of senior nurse for oncology and head and neck surgery. In 2005 Neale was appointed as divisional nurse director for rare cancer at the Royal Marden Hospital.\nNeale has been a specialist guest lecturer on adolescent cancer and sarcoma at various university courses including Great Ormond Street Hospital, South Bank University and Cambridge University. He has been a contributing author to academic textbooks and has presented primary research internationally. Neale obtained an MSc (distinction) at City University, London.\nOn his return to Scotland, Neale entered the world of politics in 2012, first as councillor for Dunfermline Central. During his time as a councillor he was the SNP spokesperson for health and social care, SNP group convener, and latterly SNP group leader. Neale led a campaign that delivered the largest SNP group ever to Fife Council.\nNeale has been MP for Kirkcaldy and Cowdenbeath since 2019. He lives with his husband and two children in Fife.\nABOUT YOUR MP\nNeale Hanvey",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_tags_brexit/content_66.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_opinion-brexit-is-a-monumentally-foolish-endeavour/content_28.html": "OPINION: \"Brexit is a monumentally foolish endeavour\"\n- Neale Hanvey MP\n- Jan 26, 2021\n- 2 min read\n“It's an ill wind that blaws naeb’die ony guid” is often used to express the belief that one person's misfortune is another person's guid luck. The phrase was first recorded by John Heywood in his 1546 book of proverbs. Even yon Shakespeare used a variation of it – “Ill blows the wind that profits nobody” in Henry VI, and while it sounds dark and foreboding it reminds us that in the worst of times, there may be unanticipated benefits.\nAnd in that vein, I think we can safely assume that this time is unlikely to feature in many highlight reels of folks’ lives. We’re in the grip of a pandemic and living under public health restrictions that were unimaginable to us this time last year. And, while the impact of the pandemic has had an incalculable human cost in terms of loss of life, distress to loved ones and the separation of so many of us from friends, family and our working lives, what can be counted is the billions of pounds of taxpayers’ money handed over to those with links to the Tory UK Government.\nI am doing my best to get to the bottom of this outrageous scandal, and I will not be fobbed off with lame excuses. This outrage shows us who the real scroungers and cheats are sucking up government cash for useless PPE, while health care and other key workers, who’ve made our survival possible, continue to receive poverty wages and suffer job insecurity. This is wrong.\nFarming and fishing industries have been betrayed; financial services face uncertainty; air and road haulage are now slowed by red tape; and living and working across Europe just become much more complicated.\nYet, the ill wind blows harder still, as Mr Johnson’s Brexiteer majority rammed through his threadbare deal. His deal is a disaster for Scotland: farming and fishing industries have been betrayed; financial services face uncertainty; air and road haulage are now slowed by red tape; and living and working across Europe just became much more complicated – and expensive!\nScotland resolutely rejected Brexit and rejected the Westminster parties. So, for that reason, and the fact that Brexit is a monumentally foolish endeavour, I voted against Johnson’s shoddy deal.\nI’ve had my share of knocks in life, but experience has taught me that even dark clouds have silver linings. The deal gives the UK government no say over Scotland re-joining the EU, and it guarantees an independent Scotland free access to the rUK market. So, let’s use this ill wind to propel us to a brighter future as a full and independent EU member state.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_tags_uk-government/content_55.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_equality-act-must-urgently-be-amended-to-restore-sex-based-rights-as-bound-to-biology/content_43.html": "Equality Act must urgently be amended to restore sex-based rights as bound to biology\n- Neale Hanvey MP\n- Nov 15, 2023\n- 2 min read\nIt’s beyond question that instead of delivering good governance and building confidence in independence, the Scottish Government surreptitiously replaced that central ambition with a blinkered focus on gender ideology.\nThis drive took a troubling turn on November 1 when the inner house of the Court of Session ruled that the definition of sex in law is no longer bound to biological reality. As of that date any trans-identifying male with a gender recognition certificate is now female. There’s no requirement for surgery, just a piece of paper is sufficient.\nThe ease of this legal fiction is a central concern of opponents to the Scottish Government’s Gender Recognition Reform (GRR) Act which seeks to make it even easier for any male to ‘self-ID’ and legally become a woman by filling in a simple form.\nSuch a process would have ensured double rapist Adam Graham, better known as Isla Bryson, was accommodated alongside vulnerable female prisoners, and silenced any public outcry.\nThe ruling has significant ramifications for everyone because no one can now be defined with any precision in law. Long understood expressions like ‘the opposite sex’ now include people of the same sex and vice versa.\nThis delivers the chaos to equalities law I warned about during June’s Westminster Hall debate on the legislative definition of sex.\nThe ruling effectively erases women as a sex class and renders their sex-based rights redundant.\nAnd if sex is not bound to biology, same-sex attracted LGB rights are now equally meaningless. The ruling also means it is illegal for women, lesbians and gay men to form associations of more than 24 members without permitting trans identifying members of the opposite sex into their groups. The women or lesbian with a penis, now has more rights than natal females.\nBut it’s not all plain sailing for the Scottish Government’s as the ruling may prove fatal to their appeal against the UK Government’s block on their GRR Act, because it has now utterly demolished their central contention that GRR has no material effect on the Equality Act. Newsflash - it does.\nThe Equality Act must urgently be amended to restore sex-based rights as bound to biology, but for how long? It is increasingly clear that any UK Labour government intend to usher in the same gender based policies as the SNP. It’s now beyond doubt, if equalities legislation is to protect anyone, it must be able to effectively describe everyone.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_commentary-uk-supreme-court-verdict-on-the-scottish-referendum-2022/content_39.html": "Commentary: UK Supreme Court Verdict on the Scottish Referendum 2022\n- Neale Hanvey MP\n- Apr 18, 2023\n- 2 min read\nIn November 2022, the First Minister’s promised independence referendum came to a shuddering halt. As disappointed as I was with the content and conclusion of the UK Supreme Court’s judgement, it would be a lie to say it was unexpected.\nAny suggestion that the UK state apparatus would willingly concede a millimetre on the current constitutional arrangements was fanciful. However, from the depths of my disappointment it is ultimately useful to the cause of independence that the dishonesty of 2014’s “Voluntary Union of equals” assertion is now fully exposed as the lie it always was.\nThis outcome can’t have been a surprise to the Scottish Government petitioners either. After all it was the SNP Scottish Government’s previous Lord Advocate James Wolffe KC who, in collaboration with the UK Government’s Advocate General, thwarted Martin Keatings’ People’s Action on Section 30 which sought to determine the matter only a year or so ago.\nIn that case the SNP Government’s position was that Keatings’ action was premature and hypothetical as the legislation necessary for the action to have legal merit had not yet been introduced. Keatings was subsequently denied right of appeal to the UK Supreme Court for the self-same reason argued for the SNP Government.\nFast forward a year and the FM has appointed Dorothy Bain KC as Lord Advocate and instructed her to take the question to the UK Supreme Court in absence of any opinion in Scots law from a Scottish Court. It’s fair to assume that the matter of constitutional competency came up during the selection process, so it is curious that the FM would choose to appoint someone unwilling to support her government’s supposed central ambition.\nIt’s not complicated. If your liberty hung in the balance would you instruct a lawyer that told you they had no confidence in your case? Of course you wouldn’t, it makes absolutely no sense. Indeed prior to deliberations the UK Supreme Court stated that any MSP could’ve introduced such legislation, and that the Lord Advocate’s approval was unnecessary.\nOn Wednesday 23rd November 2023 it became clear that the the wrong person had asked the wrong question, at the wrong time, in the wrong court.\nSo what now?\nWell, is not the time for stepping back, it’s time to push forward as one united movement. To that end, we held an open to all independence conference in Perth on 10th December (you can read more about this here).\nScotland’s future must be in Scotland’s hands.\nJoin us.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_ceasefire-vote-a-further-statement-on-gaza/content_11.html": "Ceasefire Vote: a further statement on Gaza\n- Neale Hanvey MP\n- Feb 25, 2024\n- 2 min read\nNeale Hanvey MP has confirmed he will be supporting the vote for a ceasefire taking place on Wednesday, 21st February in the UK Parliament.\nResponding to the onslaught of violence in Gaza, the Alba Party were the first political party to call for de-escalation and a ceasefire in October 2023\nOn 9th October 2023, Alba Party Leader and Former First Minister of Scotland Alex Salmond stated, “There has been a long and sorry catalogue of atrocities throughout the history of this conflict. Terrorist action against civilians can never be justified and neither can military reprisals which lead to killing and maiming of children. Both sides should be told by the international community to now choose the path of de-escalation and ceasefire. There can be no lasting settlement which ignores long-standing United Nations resolutions and there is no path to peace which can be initiated by violence against civilians.”\nAs Alba Party Westminster Leader, I have raised my concerns about the Crisis in Gaza with the Prime Minister on 15th November you can watch this here, and 21st January, you can watch this here.\nOn 18th February, Alba Party Leader and Former First Minister of Scotland Alex Salmond stated, speaking to the World Forum on the Future of Democracy in Berlin. In a session on reform of the United Nations he said’ “The Security Council veto has stopped meaningful intervention in Gaza to end the conflict even when 90 per cent and more of the General Assembly have voted to end the war and stop the killing. Despite the good work the UN carries out for peace, sustainable development, and human rights, if it is immobilised in the face of manifest injustice and suffering, then it will fall into disrepute. I propose that all member countries incorporate UN studies into their school curricula so that world popular opinion can be eventually brought to bear against the vested interests in the Security Council. In addition, the General Assembly should be empowered to override the veto if a huge majority of members vote for UN peacekeeping intervention or indeed sanctions. In this way, Gaza could be made to be the last conflict in which the International community was forced to look the other way while the innocents were slaughtered.”\nI will use every opportunity to support de-escalation and a ceasefire in Gaza. For now, our collective efforts should get behind all humanitarian organisations and I ask you to consider supporting appeals from organisations such as Doctor Without Borders, and the International Committee of the Red Cross (ICRC).",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_christina-flores-on-the-evening-show/content_65.html": "Neale Hanvey MP urges people to use mental health services if they have worries\n- Neale Hanvey MP\n- May 11, 2020\n- 1 min read\nUpdated: May 19, 2020\nWorking at home has become the norm for many people during lockdown, but it poses its own strains and these will continue after this period is over.\nNeale Hanvey MP has commented on the risk to the mental health and wellbeing of workers from the Covid-19 pandemic and highlights available local support.\nMental health and HR organisations have warned that people working from home are at significant risk of mental ill-health during and after the current Covid-19 pandemic.\n\"Fears about infection, feelings of isolation, along with concerns about job security or income loss, are just some of the knock-on effects of the pandemic that place increasing pressure and stress on everyone.\"\nA Business in the Community report found that almost half of workers in Scotland would not speak to their manager about mental health problems for fear of losing their jobs.\nCommenting, Neale said:\n“Working from home during the current lockdown has changed our day to day life utterly, and for many this is having a massive impact on their mental health and wellbeing.\n“At times like these, being able to talk about our mental health, without having to worry about how others will react, is more important than ever.\n“That’s why it’s crucial that valuable local services are continuing to offer support\".\nStory covered in the Central Fife Times, see here.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_the-prime-minister-broke-brexit-promise-to-eu-nationals/content_31.html": "The Prime Minister broke Brexit promise to EU nationals\n- Neale Hanvey MP\n- Jul 6, 2021\n- 2 min read\nI remember a public information advert shown in Scotland around fifteen years ago. It started with a guy looking to camera, I think he was Kurdish, and he spoke about his experiences of moving to Glasgow. He described his initial difficulties fitting in, and how, with time, he really felt at home in his new country.\nAs the advert ends, he is seen dropping his daughter off at the school gates while text fades onto the screen revealing that the words being spoken were actually written by a Scottish immigrant to Canada in the 1960s.\nIt was such a powerful way to show that there are common experiences for everyone moving to another country; the human stories of immigration.\nSince Brexit that sense of common humanity is fast evaporating and the UK Government’s settled status scheme closes. By the time this column appears, the deadline will have passed for EU nationals to register. Anyone who missed that deadline will automatically lose their right to work, to rent their homes, or even to access healthcare.\nThat’s why I led a cross-party letter from over 50 MPs to the Prime Minister urging him to grant automatic settled status to all EU nationals living across these islands. After all, that was exactly the promise he made during the Brexit referendum.\nIn the letter I explained that it was vulnerable EU nationals who were most at risk of missing the deadline. That includes elderly, potentially confused, residents in care homes, as well as young folk who have been in the care system.\nThe government’s response arrived on 21st June. Not from the Prime Minister, but from a junior minister. He told me that no, there would be no automatic status given to EU nationals living in the UK – but, not to worry, the process is “simple”. Oh, and to put my mind at ease, if people miss the deadline they can make a late application provided they have undefined “reasonable grounds”.\nThat’s not the welcoming global Britain Tories like to brag about; it is the voice of a narrow-minded, closed-door little Englander.\nEU nationals in Scotland are our friends, neighbours and many have joined our families. They were welcome and accepted as New Scots, yet the UK Government’s EU Settled Status Scheme has betrayed each and every one of us. However warm our welcome was, Boris Johnson has made liars of us all.\nFirst published in the Fife Free Press.\nThe UK government extended the deadline for the EU Settled Status Scheme at the last minute. You can see more here.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_women-s-rights-will-once-again-be-a-central-focus-of-my-campaign/content_54.html": "Women's rights will once again be a central focus of my campaign\n- Neale Hanvey MP\n- Sep 21, 2023\n- 2 min read\nToday marks four weeks until the 19th October 2023, the date of the “no ifs, no buts” independence referendum Nicola Sturgeon promised in June 2022.\nWhether you support independence or not, it’s a moot point; it ain’t gonna happen.\nWhile opinion polls now put support for independence at 52%, the SNP leadership are taking a proposal to their members at conference to go it alone on independence thus placing a limit on the votes they can win. Many independence supporters now refuse to lend the SNP their votes following a near-decade of false starts, empty promises and a raft of unpopular policies. And before they’ve even debated said motion, the UK Government and Labour opposition have already said they will ignore them once again.\nThis is not a road map to independence, it is another wrong turn into a constitutional cul-de-sac.\nSo if the SNP have already decided this election is not about winning the independence vote, what does that leave voters to consider?\nThe constitution will obviously remain be a key factor for many, but it’s not the only issue raising temperatures with the electorate.\nAs things stand, it looks like I will once again be the only candidate in the redrawn and renamed Cowdenbeath and Kirkcaldy constituency standing unequivocally on a platform for the protection of women, children and same sex-attracted people, and opposing Gender Recognition Reform (GRR) plans that remove safeguards allowing trans-identifying male rapists to enter women’s prisons and single sex spaces.\nOf the unionist parties, the Lib Dem’s are equally a lost cause on women’s rights and protections, and despite their recent alleged epiphany Labour’s track record on women’s rights simply can’t be trusted.\nAnd, for independence supporters like me, none of them, especially the Tories, respect the UK Governments international obligation to respect Scotland’s fundamental human right to self-determination.\nSo women's rights will once again be a central focus of my campaign. How can it not be when in Humza Yousaf’s Scotland’s women are being prevented from exercising their fundamental human rights?\nToday as I write, a ‘Women Won’t Wheesht’ hustings event planned for tonight in Rutherglen was cancelled by gender adherents.\nWith every passing day women are being systematically stripped of their dignity, liberty, and equality. If you believe in freedom of thought, opinion and conscience, freedom of expression, assembly and peaceful association then it’s time to take a stand with me.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_fife-can-be-greener-fairer-and-more-sustainable/content_50.html": "Fife can be “greener, fairer and more sustainable\"\n- Neale Hanvey MP\n- Aug 19, 2021\n- 2 min read\nThere are already “tremendous local projects” to tackle the climate crisis and these can be taken to the next level with grants available through the Scotland Loves Local Fund.\nThat is the message of Kirkcaldy and Cowdenbeath MP, Neale Hanvey, who is calling on local organisations to apply to the fund which can “supercharge” local efforts to make Kirkcaldy “greener, fairer and more sustainable”.\nDuring a visit to Greener Kirkcaldy, the local MP was briefed on community efforts to improve local sustainability, as he announced his own series of projects focused on the climate crisis in the lead up to the COP26 climate conference in Glasgow later this year.\nThese include efforts to highlight local businesses in the renewables sector, a school poster competition to engage younger members of the community, and discussions with local organisations around the transition to net zero emissions.\nMr Hanvey has been a vocal supporter of the Scotland Loves Local campaign, using his platform to encourage Fifers to shop local, think local and support local enterprises.\nCommenting, Neale Hanvey MP said:\n“The climate crisis is an enormous global challenge, but it requires a local approach. That’s why I’m using the run up to the climate conference in Scotland to promote and support the tremendous local projects in my constituency.\n“The new Scotland Loves Local Fund allows us to supercharge that activity – empowering communities and local businesses to take action that will make Fife greener, fairer and more sustainable.\n“If you think your organisation might fit the bill, get your application in before 1st October.”\nMore details about the Scotland Loves Local campaign and how to apply to the new fund, can be found at www.lovelocal.scot",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_neale-hanvey-mp-calls-for-stringent-laws-on-the-breeding-transportation-and-sale-of-animals/content_42.html": "Neale calls for stringent laws on the breeding, transportation and sale of animals\n- Neale Hanvey MP\n- Jun 9, 2021\n- 2 min read\nKirkcaldy and Cowdenbeath MP, Neale Hanvey, is leading cross-party calls for tougher animal welfare legislation to tackle the “heart breaking” rise in illicit puppy farmers and importers.\nMr Hanvey has lodged an Early Day Motion at Westminster in support of the Justice for Reggie Campaign and has received support from across the House, including from colleagues in the SNP and Labour. The motion calls for “stringent laws” to crack down on puppy farming and the “online sales of puppies by unscrupulous breeders”.\nEarlier this year the Scottish SPCA raised serious concerns about “low-welfare breeders” in Fife, highlighting that as much as a third of calls they receive about the welfare of new puppies relate to the Fife area.\nThe local MP’s parliamentary campaign comes as fifty animal welfare charities released a report urging the UK government to produce a new animal welfare strategy. The organisations, including the Scottish SPCA and Edinburgh-based OneKind, recommend a range of measures, including the introduction of primary legislation to raise the minimum age for imported puppies and kittens to six months with increased penalties for importation.\nWhile some powers over animal welfare are devolved to the Scottish Parliament, the necessary powers over trade and consumer regulation are reserved to Westminster.\nCommenting, Neale Hanvey MP said:\n“My family was one of many that decided to get a new puppy last year. It's amazing how quickly he became part of our family, so I can't begin to imagine what it's like for the poor folk who fall victim to puppy farms and face the heart-breaking experience of losing their new dog.\n“And it’s happening to far too many folk in Fife. In the last year, 10 puppies died and 35 were very poorly after being bought from breeders in Fife. Most of these animals were bought on Gumtree, which is why I want to see regulation cover the sale of animals on these online marketplaces.\n“I’m calling on the UK government to intervene in the terrible rise of puppy farms across these islands, and I believe this is the perfect opportunity for them to be bold and create a radical new animal welfare strategy.\n“If the UK government is unwilling to act, they should devolve all powers over trade and consumer regulation to Scotland so ministers in Holyrood can take the necessary bold action to protect animals, as well as folk looking to have a new pet join their family.”",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_brexit/content_13.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_neale-leads-parliamentary-calls-for-the-uk-government-to-ditch-dangerous-rapid-covid-tests/content_25.html": "Neale leads parliamentary calls for the UK government to ditch “dangerous” rapid Covid tests\n- Neale Hanvey MP\n- Jul 6, 2021\n- 3 min read\nRapid lateral flow tests imported from China are “dangerous to public health” and their use has undermined UK firms specialising in diagnostic technology.\nThat is the message of Alba MP, Neale Hanvey, who is calling on the UK government to immediately suspend the use of Innova Lateral Flow Tests. In a debate on emergency Covid contracts at Westminster last week, Mr Hanvey asked the parliamentary secretary, Julie Lopez MP, why the UK government was using “trade distorting practices to prop up” the controversial rapid tests.\nThe reality is people are going about their normal lives confident that they’ve had a negative result, all the while spreading the virus around their communities. That’s why these tests are dangerous to public health.\nMr Hanvey’s call comes after it emerged the UK government had commissioned the Defence Science and Technology laboratory at Porton Down to run analysis of the tests, despite the manufacturer's own data showing that the tests are unsuitable for asymptomatic screening and that they are not endorsed as sensitive to the prevailing Delta variant.\nThe rapid tests had been approved under a temporary Exceptional Usage Authorisation which was due to expire at the end of June, although that has now been extended until the end of August. This has led to calls from academics for the UK government and MHRA to publish the extension letter that should provide the rationale for the continued use of these rapid tests, but to date the UK government has not released the extension letter.\nEarlier this month, the US Food and Drug Agency (FDA) raised significant concerns around the accuracy of the tests, advising the US public to “stop using” the tests and return them to the manufacturer.\nMr Hanvey has repeatedly warned about the rapid tests, telling the BMJ in December that there was “a clear risk that those with a false negative result will feel overly confident about mixing with vulnerable people” [see here].\nCommenting, Neale Hanvey MP said:\n“These rapid tests are not fit for purpose. They weren’t up to the job before, and the situation is even worse now we know that the manufacturer doesn’t believe the tests can detect the Delta variant.\n“I want to understand why the UK government is so intent on standing by these tests. They’ve gone to the ludicrous lengths of trying to disprove the manufacturer’s own data so that the tests can continue to be used in the UK.\n“The reality is people are going about their normal lives confident that they’ve had a negative result, all the while spreading the virus around their communities. That’s why these tests are dangerous to public health.\n“It’s been frustrating raising the concerns of experts with Matt Hancock, only for him to insist that the tests were safe and accurate. I also did everything possible to make the case to the Scottish Government in the hope that ministers wouldn’t approve the use of lateral flow tests in schools and hospitals in Scotland.\n“But with a new health secretary at Westminster and the decision of the FDA in the US, there is now an opportunity for parliamentary pressure to finally put an end to these tests. They are dangerous, not fit for purpose, and completely unnecessary given the diagnostic manufacturing ability across these islands.”\nProfessor Allyson Pollock, Clinical Professor of Public Health and Director of the Newcastle University Centre for Excellence in Regulatory Science, added:\n“It's crucial that the DHSC and MHRA publish the extension letter for the exceptional use authorisation and provide the evidence and the basis for the decision to extend the use of Innova Lateral Flow tests from June 22nd until 28th August. There must be transparency in all government decision making to ensure public trust.\n“To date there are no published evaluations of the effectiveness of mass self-testing for children at preventing transmission, although there is accruing evidence of harms of unnecessary mass isolation resulting from mass testing.”\n<ENDS>\nNote to Editors\nThe FDA decision can be found here.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_drug-misuse-is-a-symptom-of-poverty-inequality-and-hopelessness/content_41.html": "Drug misuse is a symptom of poverty, inequality, and hopelessness\n- Neale Hanvey MP\n- Aug 27, 2021\n- 2 min read\nRarely has a policy failed quite so completely as “Just Say No” to drugs. It presents a false binary choice that ignores the complexities of substance misuse and, as I said in Westminster recently, it only serves to caricature vulnerable people as weak.\nA notable exception to this was a public-health ad from 2000. It began with a young guy being offered drugs. “What, heroin?”, he asks. “Aye, smack, you’re only smoking it”, replies his pal. The screen splits and we see the consequences of yes and no play out. The young lad who said “yes” sells his PlayStation to fund his drug habit, steals money from his dad’s coat, and suffers the pain of withdrawal. On the other side of the screen, the lad who said “no” continues to enjoy teenage life.\nBetween 2009 and 2019, there were 8,295 drug-related deaths in Scotland, 525 of those were in Fife. That compares to 7,842 people who have died from Covid across the country, 387 in Fife. But while Covid is treated with the utmost seriousness that the pandemic demands, we’ve been much slower to act on the drugs crisis.\nJust think, if it was yuppies in Glasgow Kelvin that were impacted, would the Scottish Government have let that crisis fester?\nOf course, it is the UK government that refuses to entertain safe consumption rooms, decriminalisation, or frankly any evidence-based public health approach to drugs. And it is the UK government that dismisses Scottish requests that powers be devolved to Holyrood so we can chart a different path.\nBut the blame cannot be placed solely at Westminster’s door. Decisions from the Scottish Government not to reinstate a higher 50% rate of income tax may have won votes for the SNP in Scotland’s wealthiest constituencies, but it has deprived vital services in our communities of essential funding. So, too, has the decision to persevere with council tax, despite commitments to replace it with a fairer local tax. And local services have been squeezed by the Scottish Government’s fetishization with ring-fencing local funding, restricting the agility of councils to develop local solutions to drug misuse.\nDrug misuse is a symptom of poverty, inequality, and hopelessness. Policies that keep wealth concentrated in already affluent parts of Scotland perpetuate, rather than solve, this deadly crisis.\nFirst published in the Fife Free Press",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_independence/content_9.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_ash-regan-joining-alba-is-a-game-changer/content_35.html": "Ash Regan joining Alba is a game-changer\n- Neale Hanvey MP\n- Oct 30, 2023\n- 4 min read\nAccording to the Greek philosopher Heraclitus, change is the only constant. Since devolution, Scotland has seen momentous change. But over the last five years the political turbulence has been disorientating for all of us.\nI was delighted that Ash Regan became the Alba Party’s first Member of the Scottish Parliament at the weekend. This is a game changer for Alba’s efforts to ensure the Scottish Parliament regards the need for our nation’s independence as an immediate priority.\nLike Ash, who is the first of what will be many Alba MSPs, we each have our own story to tell about the catalyst for moving to Alba. For me there were two key reasons. First and foremost was the urgent need for a serious party to put independence front and centre.\nSecondly, I wanted to give my explicit support to Alex Salmond as the only person who has ever delivered a majority in our proportional parliament and who I knew had the plan to again take Scots towards independence.\nThe SNP have abandoned any serious attempt to lead Scotland to independence. Alba stand on the cusp of becoming the leading party of that cause. That has to be our focus. We must prepare for a change in our electoral fortunes. It is coming.\nLet’s not forget what we have achieved as a party and as a group of two at the UK Parliament. We have unquestionably kept the independence dream alive and led the narrative. We have held those in power north and south of the Border to account on their many failures to deliver for the people of Scotland.\nOn energy, Alba have exposed the betrayal and the lies behind the ScotWind sale. We have challenged the Prime Minister repeatedly on the robbery of Scotland’s vast energy resources.\nMy colleague Kenny MacAskill has led the debate on standing charges, social tariffs and the obscenity of self-disconnection and has highlighted the absurdity of energy-rich Scotland and fuel-poor Scots.\nAnd we have exposed the economic vandalism supported by the Greens and Labour on North Sea oil and gas and the huge potential of carbon capture as a means to transition to a carbon-less future.\nAlba have spoken up again and again for sex-based rights, child protection and the dangers of men in women’s prisons and women’s sport.\nOn international issues, we have defended the defenceless from Iraq to India and Yemen. We have exposed the transportation of vulnerable refugees to Rwanda and the appalling conditions at Dungavel.\nOn employment, we’ve stood shoulder to shoulder time and again with the RMT and other unions in their demands for decent pay and conditions.\nUnlike what you will see in other parties that ban or sneer at their members, I joined striking NHS workers on pickets lines, calling out dangerous Tory rhetoric against dedicated healthcare professionals.\nWe’ve pressed the case on pandemic recovery and future preparedness and called out pandemic greed.\nWe have defended Scottish businesses in diagnostics and vaccine development when their own MPs were missing in action.\nIn our constituencies we’ve delivered for the people we represent, dealing with thousands of cases for constituents, businesses and community groups and we have supported local efforts to tackle the greed-fuelled inequality of Tory rule and their cost of living crisis.\nFor example, my team has put almost £105,000 back into the pockets of cash strapped constituents\nIn Parliament, we have exposed Labour as the Tory-lite false alternative they are. They offer nothing different but, should they ever win office, threaten the rights of women and the protections of children.\nWe have given voice to the humanitarian consequences of conflicts in Ukraine and the Middle East, making the case for ceasefire and de-escalation in place of violence, death and destruction.\nWe have exposed the dangers of the nuclear weapons housed in our country without our consent, control, or their safe containment.\nAnd, of course, on independence, we have led where others have given up.\nIn the UK Parliament, it has been Alba who have been the standard bearers for our national right to self-determination. We captured the attention of the world’s media, putting Scottish independence in newspapers across the globe. That’s no stunt, it is political guile.\nWe have secured compelling independent legal advice on our route to statehood from Professor Robert McCorquodale.\nIt was Alba who marked St Andrew’s day in parliamentary debate, declaration and our tabled motion.\nIt was Alba who developed a credible policy for swift access through EFTA into the EU single market. All and all, we have made a compelling case in favour of independence, done the important work charting the path to independence, and kept the dream alive that a better Scotland is possible.\nAll of the above are achievements of substance for which we should be proud. And, of course, Alba have been the only party that want to put country before parliament at the General Election.\nWhile Angus MacNeil will continue to sit as an independent MP, following his offer to work cross-party on independence, it’s only Alba who have responded, and he has now begun working with us under the shared banner of Scotland United.\nA Scotland United campaign can only make progress if those involved hold a genuine determination for Scotland to be a normal independent country. Those who choose devolution or disregard the aspirations of their voters now risk being crushed on the political rocks.\nOur movement is resilient and will regroup, driving forward to independence with or without them.\nThe movement is waking up to the reality. How we respond to them, in person or on social media, must begin with the hand of friendship. No shame, no ridicule, no 'told you so-s'. We must prepare to be the true party of independence, and we can only do that if we build confidence in ourselves and in the minds of the people of Scotland.\nChange is not easy, but it is an unavoidable part of the journey to independence.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_press-release-neale-hanvey-mp-campaigns-for-comprehensive-support-package-for-aviation-sector/content_48.html": "Neale Hanvey MP campaigns for comprehensive support package for aviation sector\n- Neale Hanvey MP\n- Jan 27, 2021\n- 2 min read\nKirkcaldy and Cowdenbeath MP, Neale Hanvey, has called on the UK government to provide a comprehensive support package for the aviation sector following the recent closure of all travel corridors.\nIn a letter to the Prime Minister, supported by 80 parliamentarians, the local MP has acknowledged that the latest restrictions were a necessary measure to protect the public from the spread of new variants of COVID-19, but highlights that aviation needs urgent support to recover from the devastating economic impacts of the pandemic.\nThe Kirkcaldy and Cowdenbeath MP has been a vocal advocate for the aviation sector throughout the pandemic, lobbying relevant ministers and calling for a clear pathway for the recovery of the sector. He is also a member of the All-Party Parliamentary Group for the Future of Aviation.\nCommenting, Neale Hanvey MP said:\n“The closure of all travel corridors was clearly the right thing to do, but it does deal another massive blow to an aviation sector which has faced the pandemic without the same levels of support that has been given to other areas of the economy.\n“The reality is that aviation has been hit really hard, and I’ve been supporting constituents who have lost their jobs as a result.\n“With Edinburgh Airport on our doorstep, there’s obviously a lot of folk in the area who work in aviation. So, the pain felt by the aviation sector has a direct result on my constituents and our local economy.\n“The UK government has no plan to help aviation bounce back once it’s safe to do so, and that risks losing jobs and skills from the sector.\n\"I’m calling on the UK government to support and protect these businesses, their supply chains, employees, and communities like ours that has borne the brunt of the near total collapse of passenger numbers.\n“Our aviation sector is running on empty. The UK government must give it the strategic direction and financial support it so desperately needs.”\nCover image courtesy of Stephen McKay / Edinburgh Airport / CC BY-SA 2.0",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_tags_economy/content_60.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_page_4/content_32.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_in-parliament/content_10.html": "NEALE AT WESTMINSTER\nYour voice in London\nWhen Parliament is sitting, Neale usually spends Mondays to Thursdays in London representing his constituents at Westminster. Following the Covid-crisis, MPs have been able to take part in some parliamentary activities remotely. This has allowed Neale to stay in the constituency more regularly while continuing his work as a parliamentarian.\nThat work has included taking part in debates, asking parliamentary questions on issues that impact the Kirkcaldy and Cowdenbeath Constituency or Scotland more generally, and submitting written questions and tabling Early Day Motions.\n-\nYou can watch videos of some of Neale's contributions by clicking here.\n-\nYou can search for the Early Day Motions Neale has tabled by clicking here.\n-\nAnd you can read his written questions by clicking here.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_between-free-speech-and-farage-an-appearance-on-gb-news/content_56.html": "Between Free Speech and Farage: an appearance on GB news\n- Neale Hanvey MP\n- May 3, 2023\n- 2 min read\n\"I disapprove of what you say, but I will defend to the death your right to say it\" is often attributed to French enlightenment philosopher Voltaire, but it was actually penned by Evelyn Beatrice Hall in her book The Friends of Voltaire as an illustration of his beliefs. Her words are often cited to illustrate the principle central to freedom of speech.\nUntil recently I thought it was a principle most people respected, but that was before the illiberal perma-offended few began to target anyone in their pursuit of thought control, fabricated outrage and censorship.\nSo, it was sadly of little surprise when the SNP’s Mike Russel impugned my defence of the case for independence on GB News as somehow unhelpful. However, in his haste to claim outrage he failed to disclose that the guest immediately prior to me was an SNP representative conveniently escaping both Mike’s attention and his haughty ire.\nThankfully my performance against Farage was welcomed by many SNP independence supporters as a necessary intervention - lest we let our opponents completely off the hook.\nThe central premise Mike and those of his ilk appear to be advancing is that I was somehow ‘endorsing’ Farage. This is such an ill-informed argument that fails the most basic of scrutiny given his own party’s regular participation on GB News. Does this mean the SNP endorses right-wing policy, or the views of its presenters? Of course, it doesn’t. That’s a banal, lazy, and ludicrous argument.\nThere have been two occasions where representative of the perma-offended have refused to share a platform with me. I am glad to say that on both occasions the organisers refused to cave to their demands, de-platforming themselves as a result. As far as I’m concerned that is the only way to deal with petted-lip politics - if you’re too precious to defend Scotland, perhaps it’s not your cause after all.\nI freely admit I get offended by reckless economic and social policies, but I’m not the one refusing to argue my case. I’m particularly offended by a prioritised focus on compelled thought and speech whilst in energy-rich Scotland our people continue to face poverty, businesses struggle to keep folk in jobs, and our vast resources are handed over for the benefit and enrichment of others.\nInevitably reader views will differ, but I celebrate and defend your right to disagree with me and to be heard.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_scottish-travel-agents-left-in-horrendous-position-must-receive-targeted-financial-support/content_40.html": "Scottish travel agents left in “horrendous” position must receive targeted financial support\n- Neale Hanvey MP\n- Aug 11, 2021\n- 2 min read\nThe ongoing restrictions to travel are “appropriate”, but they have left travel agents in a “horrendous” position. That is the claim of Kirkcaldy and Cowdenbeath MP, Neale Hanvey, who is today calling on the Scottish Government to put in place targeted financial support for travel agents.\nIn a letter to the Finance Secretary, Kate Forbes MSP, Mr Hanvey has highlighted the plight of Kirkcaldy-based Travel Your World. The company has operated over the last seventeen months with no income, all the while rescheduling bookings, arranging new holidays and paying staff.\nTravel agents are the engines that power the travel industry. Without them, there simply won’t be a full recovery for this sector.\nAccording to the local MP, this is a story replicated across Scotland, with the Scottish Passenger Agents’ Association (SPAA) and the Association of British Travel Agents (ABTA) pointing out that it is a different story south of the border. In England, travel agents can apply for an Additional Restrictions Grant which provides financial assistance directly to businesses facing the most severe restrictions.\nNow Mr Hanvey wants to see a similar commitment from the Scottish Government of funding at least “equal to that available” in England.\nThe Kirkcaldy and Cowdenbeath MP has been a vocal supporter of the aviation and travel industries throughout the pandemic, and he sits on the Westminster All Party Group for Aviation.\nCommenting, Neale Hanvey MP said:\n“Travel agents are the engines that power the travel industry. Without them, there simply won’t be a full recovery for this sector.\n“And while there has been some support available, it is not nearly enough to see Scottish travel agencies through the continued restrictions.\n“That is why I’m calling on the Finance Secretary to at least match the funding that is available in England, to join me in calling for the burden of transaction charges to be covered by large tour operators – not travel agents – and to provide assurances to travel agents that they will be supported by the Scottish Government.\n“A personal commitment from the Finance Secretary would go a long way to reassuring travel agents that they will be supported to drive the recovery of Scotland’s travel industry.”",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_page_3/content_52.html": "top of page\nWEEKLY COLUMNS\nThe latest updates from Neale\nSearch\nMar 1, 20211 min read\nFeb 25, 20212 min read\nFeb 19, 20212 min read\nFeb 17, 20212 min read\nFeb 16, 20213 min read\nFeb 15, 20212 min read\nFeb 9, 20212 min read\nJan 27, 20212 min read\nJan 26, 20212 min read\nJan 4, 20212 min read\nDec 16, 20202 min read\nbottom of page",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_has-gove-no-shame-over-unlawful-conduct/content_64.html": "Has Gove no shame over unlawful conduct?\n- Neale Hanvey MP\n- Jul 8, 2021\n- 2 min read\nMichael Gove has been accused of having “no shame” as Alba MP, Neale Hanvey, called out his “unlawful conduct” in Westminster today.\nIn a tense exchange, the Alba MP reminded the UK government that politicians have a commitment to uphold “the spirit and the letter of the law”. Answering his question, a visibly flustered Julia Lopez MP said that she disagreed with the Alba MP’s “characterisation” of Mr Gove, in an answer that Mr Hanvey described as “the type of faux outrage we’ve come to expect from UK ministers”.\nThe comments relate to a High Court ruling in June that Michael Gove broke the law by giving a Covid-contract to a communications agency run by long-time associates of his and Dominic Cummings.\nMr Hanvey’s question followed an earlier contribution from his fellow Alba MP, Kenny MacAskill, in which he remined Mr Gove about his use of emergency Covid-funding to commission anti-Scottish independence opinion polling.\nThere has been a marked shift in tone from the two MPs since joining Alba, with Mr Hanvey regularly rebuked by the chair for his forthright language in the House.\nCommenting, Neale Hanvey MP said:\n“This Tory government thinks it can misuse public money how it likes and be found by the High Court to have broken the law, and we’ll all just keep calm and carry on.\n“Well, Kenny and I have a clear message from Alba – it’s not happening. We’ll continue to use the archaic procedures of Westminster to shine a light on the plots and schemes of this government.\n“Ministers might not like it to be pointed out, but we’re talking about a UK government that has dished out contracts for PPE to small firms with absolutely no experience in manufacturing PPE, emergency Covid-money spent campaigning against Scottish independence, and borderline-useless rapid Covid tests imported from China while superior products are produced by UK-based manufacturers.\n“Scotland can do so much better than this parcel of rogues. We must take real steps to regaining our country’s independence and choosing a different kind of politics – one where ministers serve the people, not their pals and party interests.”\n<ENDS>\nNote to Editors\nNeale’s contribution can be watched here at time 09:45:40\n''Scandal' over Gove's use of pandemic research contract to test attitudes to the Union' - https://www.heraldscotland.com/politics/19391243.scandal-goves-use-pandemic-research-contract-test-attitudes-union/?ref=twtrec\nHigh Court Judgement The Good Law Project vs Minister for the Cabinet Office: https://www.judiciary.uk/wp-content/uploads/2021/06/Good-Law-Project-v-Cabinet-Office-judgment.pdf\nThe image is licensed under the Creative CommonsAttribution 3.0 Unported license.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_local-bands-wanted-for-neale-s-first-ever-radio-show/content_46.html": "Local bands wanted for Neale’s first ever radio show\n- Neale Hanvey MP\n- Aug 27, 2021\n- 1 min read\nKirkcaldy and Cowdenbeath MP, Neale Hanvey, is calling on local bands to send him their demos for his new radio show on K107FM.\nThe local MP has been invited to put together a one-off show similar to Desert Island Disks, where he will host the show, share his choice of music and highlight organisations he has met during his ongoing constituency tour.\nMr Hanvey said he was “brimming with excitement” and said this was a “tremendous opportunity” to showcase the best of the Kirkcaldy and Cowdenbeath Constituency.\nThe show is expected to be put together towards the end of the summer, airing on K107FM in late September.\nCommenting, Neale Hanvey MP said:\n“We have some incredible local bands, so I want to give them a bit of exposure. During the show, I’ll play three demos with a bit of promo chat. So, if you’re in a band or know of a good local band, drop me an email.\n“The show is building on my constituency tour. Throughout summer recess, I took the opportunity to be out and about in the constituency more than usual. It’s been a good chance to highlight the work of local businesses and organisations.\n“And now with the radio show, it’s now a chance to highlight local music. So, that’s exactly what I plan to do. Who knows, if it goes down well, this might become a more regular thing!”\nBands looking to submit a demo for consideration should email Neale on neale.hanvey.mp@parliament.uk",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_videos/content_8.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_press-alert-parliamentarians-pressure-uk-government-over-human-rights-in-india/content_49.html": "Press alert: Parliamentarians pressure UK government over human rights in India\n- Neale Hanvey MP\n- Jun 21, 2021\n- 3 min read\nToday, 21 June, 28 parliamentarians from all main parties across both houses have written a joint letter urging the Foreign Secretary to immediately request the government in India safeguard the health of an elderly Jesuit priest [letter can be found here]. The MPs are deeply concerned that by defending and promoting human rights in India, Father Swamy now finds himself held on counter-terrorism charges.\nParliamentarians say they are keen to “understand what consideration” the UK government has given to the matter and point to a statement from the Foreign Secretary earlier this month in which he clarified the UK’s commitment to protecting human rights and freedom of religious belief.\nNeale Hanvey MP, who coordinated the joint letter, said that it was “time to act on that commitment” and called on ministers to “speak to our friends in India and make clear that the UK will not stand by while political dissent is criminalised and elderly human rights campaigners are detained on ambiguous charges”.\nNeale Hanvey MP said:\n\"Father Stan has been in captivity for over 250 days. He has been consistently denied bail and his health is deteriorating at a fast pace. It’s quite unbelievable that this could happen in a democratic state.\n“That is why I tabled an early day motion calling on the UK government to do everything possible to intervene and it is why I have now organised this joint letter.\n“I’m aware colleagues have already tried to raise Father Stan’s case in Westminster and have been told that where UK ministers have concerns, they raise them with their Indian counterparts.\n“That’s fine, but the Foreign Secretary must tell us if he has raised such concerns in this case and, if so, when and with whom.\n“We cannot turn a blind eye to the deteriorating situation for human rights and freedom of expression in India simply because they are our friends. Indeed, it is to our friends we owe the greatest responsibility of telling them when something is clearly wrong.\n“The welfare of an elderly priest depends on it.”\nThe detention of Father Swamy has been met with condemnation from human rights organisations, including Amnesty International who described the arrest as “politically motivated’ [see here], and Human Rights Watch who said the case was part of the Indian government’s “widening assault on free speech” [see here].\nPrime Minister Narendra Modi has overseen the use of sweeping anti-terror laws which observers believe are mainly used to crack down on dissent. UN High Commissioner for Human Rights Michelle Bachelet has called on the Indian government to do more, in law and policy, to protect India’s civil society [see here].\nSuperior of the Jesuits in Scotland, Fr Dermot Preston SJ, said:\n“I welcome the attention being drawn to the imprisonment and poor health of my fellow Jesuit, Fr Stan Swamy SJ. Fr Swamy has spent his life fighting for the rights and liberty of some of the poorest, most marginalised people in India, so now it is right that people fight for his rights and liberty.\n“Fr Swamy’s continued imprisonment – under a draconian law which has been widely questioned internationally – adds yet another dent to the Indian Government’s claim to be the world’s largest democracy.”\nIn a statement issued by the Social Justice and Ecology Secretariat of the Society of Jesus (Jesuits) in Rome, Fr. Xavier Jeyaraj SJ said:\n“As Jesuit companions, we affirm that Stan engaged himself in the defence of adivasis (indigenous people) and other deprived communities whose fundamental rights were denied and systematically trampled upon.\n“We stand united with Stan and many other human rights defenders at this crucial juncture. We commit ourselves to continue our effort, both nationally and internationally, to bring truth and justice to light and advocate for the rights of vulnerable people in a peaceful, non-violent way.\n“This is the plight not only of Stan Swamy but also of so many other human rights defenders, students, women, farmers, intellectuals, civil society movements and anyone who has dared to oppose or critique the policies of the government in the last few years.\n“We appeal to all governments, international bodies and civil society groups and organizations to call on Indian State to repeal UAPA and release Stan and all other human rights defenders immediately.”\nFr Swamy’s legal team submitted regular and medical bail petitions to the courts in India on 17 June. The court adjourned the hearing until 3 July and ruled that Fr Swamy could continue to be treated in Holy Family Hospital until 5 July 2021.\n<ENDS>\nNote to Editors\nClick here to read the joint letter sent to the Foreign Secretary\nThe letter was signed by 28 parliamentarians from the SNP, Alba, Conservatives, Labour, Liberal Democrats, and the DUP.\nPictures of Fr Swamy and Neale Hanvey MP can be found by clicking here.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_plastic-waste/content_53.html": "Neale joins cross-party campaign against plastic waste\n- Neale Hanvey MP\n- Jun 9, 2021\n- 2 min read\nThe UK government must do more to stop plastics polluting our marine environment and entering the food chain.\nThat is the message of Neale Hanvey MP who has joined fellow parliamentarians, experts, and public figures in a campaign against plastic waste. The campaigners are seeking to put pressure on the UK government to include a global plastics treaty on the agenda at the G7 Summit meeting in June.\nThe Fife MP and his fellow signatories argue that “a globally aligned approach to tackling the plastic crisis is critical for the health of people and planet” and that the G7 is well-placed to lead efforts aimed at “tackling the scourge of plastic pollution”.\nThis comes as Mr Hanvey has been leading calls for UK ministers to follow the example of their French counterparts in requiring all new washing machines to be fitted with microfilters. In a written parliamentary question, Mr Hanvey explained that this would “help prevent synthetic microfibres from entering rivers and oceans”.\nUK ministers remain resistant to the move and have instead pledged to continue “working with industry to encourage improved environmental outcomes”.\nCommenting, Neale said:\n“We produce 300 million tonnes of plastic every year and only around 10 percent of that gets recycled. The rest ends up in landfill or, even worse, in our rivers, seas and ultimately in our food chain.\n“And while we can all play a part in reducing the amount of plastic we use, that will never be enough on its own. We need strong, interventionist environmental policies, and we need the whole world on board.\n“That’s why I’ve joined the campaign for a global plastics treaty. It’s also why I’m pushing the UK government to make microfilters mandatory in all new washing machines.\n“But I’m hitting a brick wall with UK ministers who seem more interested in placating big business than seriously tackling environmental issues like plastic waste.”\nIn the year that COP26 will be held in Glasgow, Neale has vowed to keep up the pressure on the UK government to take “meaningful action” to address plastic waste, and to also explore other avenues to address the issue.\nOne approach could be for the Scottish Government to legislate on plastic waste. While most consumer powers remain reserved to Westminster, the Fife MP believes that should not preclude the Scottish Government from seizing the initiative.\nNeale added:\n“Clearly the Scottish Government has led the way on environmental issues across these islands, with ambitious and radical policies to address the climate emergency.\n“I accept that a policy like mandatory microfilters in washing machines would be\nimpossible to impose with the current devolved powers, but there may be other ways to address the scourge of plastics on our marine environments that are within the competency of Holyrood.\n“This is yet again an example of an area where I am sure the Scottish Government would be keen to act, but ministers are hamstrung by the necessary powers being held by the UK government.\n“My message to ministers in London will be clear – if you are unwilling to act to address plastic waste, then devolve the powers to the Scottish Parliament.”",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_a-five-point-plan-to-tackle-poverty/content_36.html": "A five-point plan to tackle poverty\n- Neale Hanvey MP\n- Oct 4, 2021\n- 2 min read\nEver heard of Boris and his dead cat? No, this isn’t a joke of questionable taste, it’s a media strategy that the Prime Minister likes to follow. It goes like this: whenever you have some bad news story coming your way, do something – or say something – to distract everyone.\nHe may not be a master of many things, but like some ruffled alleyway magician, Boris excels at this cynical ploy.\naahe master cynic pulled another dead cat from his carpet bag again last week. While everyone was berating the UK Government for the cruel decision to slash Working Tax Credits and Universal Credit, the Prime Minister decided to announce a major cabinet reshuffle. Political journalists and ordinary folk alike started to discuss the who’s-in and who’s-out. Meanwhile, the latest phase of Tory austerity rolled on.\nAnd it’s no wonder the Prime Minister wanted to change the news. These cuts are ‘unconscionable’ and likely to ‘trigger an explosion of poverty’. Not my words, but those of the UN’s Special Rapporteur on Poverty.\nHere in the Kirkcaldy and Cowdenbeath Constituency, we’re going to be hit particularly hard. Over ten thousand working-age families will be impacted. In fact, outside of Glasgow, only Dundee West and Glenrothes will fare worse.\nThat’s why I used my slot at Prime Minister’s Questions to raise the issue. Unbelievably, the PM extolled feigned sympathy with the working poor, and steadfastly refused to answer my question.\nThe cut will go ahead. People will be pushed into poverty. And there is little any Scottish MP can do about it.\nThat is why the Alba party has proposed a five-point plan to tackle poverty in Scotland. We’re calling on the Scottish Government to introduce a £500 annual payment for every low-income household. We want to see free lunches and breakfasts for all nursery, primary and secondary pupils. We’re calling for free access to sports facilities for all under-18s. We’re pushing ministers to double Educational Maintenance Allowance, which would help 30,000 school and college students continue in education. And we want to see the Scottish Child Payment increased to £40 per week.\nThese are ambitious, yet affordable policies that would help stamp out child poverty across Scotland.\nOf course, I would prefer we were independent and free from increasingly brutal Tory austerity. But, while we remain at the mercy the union, the Scottish Government must find the will to support ordinary folk in my constituency and across Scotland.\nOriginally published in the Fife Free Press",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_alba-mp-hanvey-challenges-first-minister-to-come-clean-on-covid-testing-collapse/content_12.html": "ALBA MP Hanvey challenges First Minister to come clean on Covid testing collapse\n- Neale Hanvey MP\n- Sep 3, 2021\n- 2 min read\nALBA Health and Wellbeing spokesperson Neale Hanvey MP has challenged Nicola Sturgeon to give an urgent and honest appraisal of Covid testing capacity amidst evidence the system is close to collapse under a surge in cases.\nThe Kirkcaldy and Cowdenbeath MP has been pressing both government about Coronavirus tests and surveillance for over a year claiming neither are taking the matter seriously enough.\nHowever, that pressure has gained fresh impetus with evidence that Glasgow and Clyde have run into serious supply chain problems leading to multiple testing centre having to close their doors and others seeing long queues to for those waiting to get tested.\nThis concern was also amplified when usually cautious Scottish government advisor Prof. Devi Sridhar appeared to downplay the importance of testing on Twitter.\nMr Hanvey has written to his local NHS Fife Chief Executive seeking urgent reassurance on the matter, Mr Hanvey’s NHS career included senior clinical and management roles in cancer and bone marrow transplant services where infection and its effective control presents a daily risk to life.\nSpeaking about his concerns on testing Mr Hanvey said.\n“I can’t stress enough how important surveillance is to the successful management of infection. Not being able to confirm a diagnosis by an objective measure such as PCR is frankly dangerous. It means those with ambiguous symptoms could be placed in danger or place others at risk. It also means we rapidly lose track of any useful epidemiological data and enter a world of guesswork; never a useful position when you are dealing with a potentially deadly situation.\n“Ordinarily there would be a backup or continuity strategy but given the UK and Scottish Governments have failed to address the fundamental problems with the Innova Lateral Flow Device (LFD) tests, it renders them utterly useless as a fall-back strategy. This is because they only identify 40% of infective cases of Covid and are not a definitive diagnostic test.\n“I have personally spoken to an individual who has been turned away from Glasgow testing centres every day this week as capacity has been exhausted. This is totally a unacceptable. and dangerous.\n“There is some hope in the domestic diagnostics sector were their LFDs have a much higher accuracy rate and are specifically designed for home use. However, they still do not replace PCR for diagnostic purposes so identifying and fixing supply chain issues is of the greatest urgency.\n“Nicola Sturgeon and Humza Yousaf must come clean on this urgent matter of public health. If they are unable to support NHS staff with the equipment necessary for making safe diagnosis, then all other public health measures must be considered to suppress transmission of the virus urgently.\n“Such measures would need to remain in place until PCR supplies or reliable alternatives can be established. If not, we risk being back at step one before we know it.”",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_economy/content_20.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_the-climate-emergency-all-our-actions-can-add-up-to-transformational-change/content_67.html": "The Climate Emergency: All our actions can add up to transformational change\n- Neale Hanvey MP\n- Aug 27, 2021\n- 2 min read\n“Ask not what your country can do for you, but what you can do for your country”.\nIn that famous speech, President Kennedy admitted that no government can reach its goals alone.\nWhen we think of the climate crisis we face today, Kennedy’s words take on a new resonance – states, less still supranational organisations like the EU or UN, are incapable of meeting the challenge we face.\nWhen the COP26 climate conference is held in Glasgow later this year, the focus will be on these global organisations, world leaders, and states. But the steps to reduce carbon emissions must come from businesses, communities, and individuals. As the official spokesperson for COP26 admitted recently, it is local authorities, not central governments, that can deliver the change we need to halt climate change.\nPart of that is about winning local folk over, explaining that the climate crisis is not something happening elsewhere. Just look at the flooding we’re hit with every year, the increasingly warm temperatures that threaten the old and young in our communities, or the impact of unpredictable weather on local farmers and – ultimately – on the places we buy our weekly shop.\nThis doesn’t need to be all bad news. The response to the climate emergency can benefit places like Fife by bringing jobs. We have a skilled workforce, we’re close to offshore developments, and we have established fabrication facilities. This means we’re perfectly placed to be at the forefront of the marine and green renewable energy revolution. A revolution every community must be able to benefit from.\nThat’s before we even get to the need to shop local – cutting down on the emissions from transporting goods, and keeping money here in Kirkcaldy, helping our high street thrive with lots of independent local shops.\nLast week I visited Greener Kirkcaldy to launch my own programme of green projects in the run up to the Glasgow conference. I’ll speak to local businesses about the transition to net zero, run an eco-poster competition for local school kids, and I’ll shout about the fantastic local organisations, like Greener Kirkcaldy, already doing their bit to tackle climate change.\nIt’s a small contribution, but all our actions can add up to transformational change. And change we must.\nIn the words of JFK, “Change is the law of life. All those who look only to the past or present are certain to miss the future.”\nFirst published in the Fife Free Press",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_politics/content_4.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news/content_15.html": "top of page\nWEEKLY COLUMNS\nThe latest updates from Neale\nSearch\nFeb 25, 20242 min read\nDec 11, 20234 min read\nNov 20, 20234 min read\nNov 15, 20232 min read\nNov 1, 20232 min read\nOct 30, 20234 min read\nOct 3, 20232 min read\nSep 21, 20232 min read\nJul 12, 20232 min read\nJun 27, 20232 min read\nMay 3, 20232 min read\nApr 18, 20232 min read\nbottom of page",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_opinion-we-have-a-shared-responsibly-to-tackle-domestic-abuse/content_68.html": "OPINION: \"We have a shared responsibly to tackle domestic abuse\"\n- Neale Hanvey MP\n- Dec 16, 2020\n- 2 min read\nUpdated: Jan 4, 2021\nWhile we’re focused on one public health crisis, another is escalating. Domestic abuse already causes more death and disability among women between sixteen and forty-four than cancer or traffic accidents, and the restrictions designed to impede the spread of the virus have exacerbated the issue.\nDomestic abuse can happen to anyone. It doesn’t discriminate by age, neighbourhood, sex, sexuality or gender identification. Whilst most victims are female, one in six men also experience domestic abuse, and it takes many forms – it can be physical, sexual, or mental – and it increases when families spend more time together.\nSince we’ve been confined to our homes for most of 2020, referrals to support services have unsurprisingly increased. That’s why the UN’s annual sixteen days of activism against gender-based violence took on a special significance this year. During those sixteen days, along with Labour MP Sarah Owen, I sponsored an Early Day Motion at Westminster highlighting violence against women and girls. The motion also promoted the GMB Union’s Work to Stop Domestic Abuse Charter.\nBut the scale of this public-health emergency needs much more than supportive words in parliament or on social media. That’s why it was good to see the Scottish Government allocate £4.25m additional funding to frontline services. Nevertheless, some services are still struggling with the impact of the pandemic.\nOne example is Lochgelly-based Saje Scotland. The team at Saje provide courses to help women understand their abusive experiences and the traumatic impact these have on every aspect of their lives. Saje provides an opportunity for women to start their recovery process and look to the future.\nSaje had planned to apply to the Equally Safe Fund to secure their medium to long-term future. However, due to the pandemic Equally Safe paused the application process, with no new funding available until September 2021. I’ve been supporting Saje with this challenge, but the reality is they will likely run out of funding in May 2021, leaving a five-month gap of financial uncertainty.\nJust like our collective approach to Covid, we have a shared responsibly to tackle domestic abuse. We can pledge our support for campaigns like GMB’s charter. We can chat to family, friends, and colleagues about the issue. But we must also support the organisations doing this invaluable work.\nAnd on that note, Saje Scotland has set up a Crowdfunder. If you can, please donate here: https://www.crowdfunder.co.uk/help-saje-scotland",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_neale-coordinates-cross-party-campaign-against-june-eu-settlement-scheme-deadline/content_23.html": "Neale coordinates cross-party campaign against June EU Settlement Scheme deadline\n- Neale Hanvey MP\n- May 26, 2021\n- 3 min read\nKirkcaldy and Cowdenbeath MP, Neale Hanvey, has secured the support of over 50 parliamentarians from all parties across both houses for his campaign that is urging the Prime Minister to take immediate action and lift the EU Settlement Scheme deadline, which is fast approaching on June 30th [letter can be found here]. MPs and peers say the Home Office’s outreach and advertising campaign has failed to reach sufficient numbers of EU citizens amidst a pandemic that has severely disrupted support services.\nMr Hanvey and his supporters say that unless the deadline is lifted and the cliff-edge removed, significant numbers of EU citizens will be forced out of status and rights overnight. If even 1% of the estimated 4 million EU citizens resident in the UK are unable to apply, tens of thousands of people will become undocumented and left vulnerable to Hostile Environment policies, including detention and removal.\n234,000 EU citizens live in Scotland, accounting for 6.3% of the Scottish population.\nNeale Hanvey MP said:\n“Some of the most vulnerable EU citizens who chose to make the UK their home now face an utterly intolerable situation. One that the Prime Minister personally promised would not come to pass. That is why I led this cross-party letter to put pressure on the Prime Minister and his government to do the right thing for my constituents and the many EU citizens who live across these islands.\n“This issue drives to the very heart of who we want to be as a society and the relationship we hope to have with our European neighbours. The UK Government cannot claim to be extending a hand of friendship to the world when in the early days of a Brexit Scotland didn’t vote for, they remove rights and status from EU citizens who have simply missed an administrative deadline for settled status.\n“These people – our friends, family and neighbours – will become fair game for the kind of impersonal and aggressive approach of this Government’s hostile environment fostered upon them by the Home Office.\n“Last week in Scotland we witnessed the very best of community spirit when ordinary people stopped the Home Office as they attempted to remove two people from their homes in the heart of the Glasgow Muslim community during the holy month of Ramadan.\n“The more than fifty parliamentarians who have signed my letter now call on the Prime Minister to urgently remove this arbitrary and inhumane deadline and grant automatic settled status to all EU citizens resident in the UK as a matter of urgency. He must honour his promise.”\nOverwhelming research shows it is the most vulnerable EU citizens – such as looked-after children, Roma communities and the elderly – who are most likely to slip through the cracks. Recent research from the Children’s Society found that only 39% of identified EU looked-after children and care leavers have submitted applications to the EUSS, and only 28% have secured their status. As well as the most vulnerable, EU care workers and other key workers – the very people we are relying on to pull us through the COVID crisis – are in real danger of being left behind.\nSignatories to the letter warn that the Government must not ‘use the success of charities to deny the existence of the many EU citizens who remain at risk’. They further highlight that the recently published guidance on late applications to the EUSS is ‘not a solution to making people undocumented, even temporarily’. A loss of legal status, liability for criminal penalties and exposure to the Hostile Environment can create far-reaching and potentially life-ruining risks. Post-June, we could see EU citizens who have lived and worked in the UK for years being criminalised simply for turning up to work the next day.\nMarianne Lagrue, CORAM Children’s Legal Centre (one of the charities funded by the Home Offfice to provide EUSS support), said:\n“It is positive that the Home Office has provided funding for charities, local authorities and community organisations to reach some vulnerable EU citizens and family members, and that it continues for a short time beyond the EUSS deadline. However, that funding could never reach everyone. If anything, it has demonstrated to us as grant-funded organisations the high level of need that still exists with under 50 days to go. The support work undertaken by grant-funded organisations should not be used as a justification for not taking action to amend the EUSS to protect the rights of EU citizens and their families.”\nParliamentarians strongly urge Boris Johnson to keep the promises he made to Europeans in 2016 that they would be granted automatically indefinite leave to remain post-Brexit. With the deadline just weeks away, the stakes couldn’t be higher or the situation more urgent.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_neale-hanvey-mp-calls-for-older-people-to-get-help-with-fuel-bills-this-winter/content_73.html": "Neale Hanvey MP calls for older people to get help with fuel bills this winter\n- Neale Hanvey MP\n- Feb 15, 2021\n- 2 min read\nUpdated: Feb 17, 2021\nKirkcaldy and Cowdenbeath MP, Neale Hanvey, has called on the UK government to take urgent action to increase the uptake of Pension Credit so that older people in the local area can receive this life-changing entitlement, and the benefits to which it is a gateway – such as the Warm Home Discount scheme.\nThis comes as research from the charity Independent Age found that 1,042 older people missed out on more than £146,000 in Warm Home Discount across the Kirkcaldy and Cowdenbeath Constituency last winter.\nMr Hanvey has regularly spoken out about the poor uptake in Pension Credit, with a staggering £5.7 million going unclaimed across the local area last year, and in January he was part of cross-party efforts to push the UK government to come up with a clear plan on how to boost uptake.\nCommenting, Neale Hanvey MP said:\n“These new statistics from Independent Age show that during this bitterly cold winter it is more important than ever that the UK government works to get Pension Credit to the people that are missing out.\n“The lack of uptake is a long-running scandal, but it’s an even bigger issue this year while we’re stuck at home due to the pandemic. There are folk in the local area who are really struggling, facing the unimaginable choice between heating or eating, and they could be getting this helping hand.\n“We need to know why folk aren’t applying for Pension Credit and we need a clear plan on how to remedy that. That’s the simple request I have of the UK government. Surely, after all this time, it can’t be acceptable that uptake of Pension Credit is only 64 percent across these islands?\n“While the UK government drags its feet on taking real action, I would encourage everyone in our community to check what benefits they are entitled to with the dedicated calculator on the Scottish Government website, or through Age UK, Age Scotland and Citizens Advice.”\nMorgan Vine, Head of Policy and Influencing at Independent Age, said:\n“It is brilliant to have the support of Neale Hanvey MP for our campaign. We need the UK government to urgently create an action plan that addresses the low take up Pension Credit. This must include awareness campaigns, a full communications strategy, and new, high quality, up-to-date research into who is not claiming Pension Credit and why.\n“By working together to identify and overcome any barriers, we are confident we can increase uptake and ultimately, improve the lives of the up to 1 million people in later life who are facing unnecessary financial struggles.”\nClick here to read the story covered in the Fife Free Press",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_pension-reform-6-400-women-impacted-in-kirkcaldy-and-cowdenbeath-constituency/content_22.html": "Pension Reform: 6,400 women impacted in Kirkcaldy and Cowdenbeath Constituency\n- Neale Hanvey MP\n- Sep 13, 2021\n- 2 min read\nRemember holidays? Back in those heady pre-Covid days, we’d squirrel away money to splash out on restaurants by the beach, theme parks in the sun, or hurtling down mountains on a couple of planks of wood in the snow. Bliss.\nNow imagine you’d been putting aside money for a big family holiday – one of those once in a lifetime adventures. But just before you were due to leave, the travel agent sends you a letter telling you that all that planning, all that saving, all that excitement had been for nought. The holiday had been rescheduled to happen in… six years.\nThis is what happened to 6,400 women in the Kirkcaldy and Cowdenbeath Constituency. Except, it’s not a holiday, it’s their state pension – all because the Department for Work and Pensions ‘failed to make reasonable decisions’ and were guilty of ‘maladministration’.\nNot my words, but those of the Parliamentary and Health Service Ombudsman who has been tasked with looking into the whole sorry affair.\nI am currently supporting 26 of the 6,400 so-called WASPI women in our local area. Every story I’ve heard from these women is laced with frustration and a burning sense of injustice, but also with a graciousness you might not expect from people who have been so badly let down by successive UK governments.\nYou see, the issue isn’t equalising the pension age of men and women. The WASPI Campaign – which is aiming to get justice for these women – explicitly states its support for equalisation.\nThe injustice is you have 3.8 million women across the UK who had been planning for a retirement that would begin at 60, only to be told a year before it was due to begin that, actually, they’d have to hold on another five or six years. And they’re the lucky ones. Many women have never received a letter from the DWP to inform them of the change.\nI’ve joined colleagues from across the chamber to call out the disgraceful treatment of the WASPI women. But shout all we will, UK government ministers do not want to hear.\nThat’s why I held an event on Friday to give WASPI women an opportunity to share their experiences and views. I plan to use these insights to inform my next steps.\nIf you've been impacted by pension reform and would like to share your story, please send me an email: neale.hanvey.mp@parliament.uk",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_afghanistan-debate-the-speech-i-would-have-given/content_45.html": "Afghanistan debate: the speech I would have given\n- Neale Hanvey MP\n- Aug 27, 2021\n- 3 min read\nLike many, I have been out in my constituency speaking with organisations who gave so much over the past year.\nThat includes the Salvation Army, and I was delighted to celebrate the opening of their new centre in my Kirkcaldy & Cowdenbeath Constituency where I reflected on being a good neighbour and the parable of the good Samaritan.\nParable, allegory or a teaching in ethics and humanity, its instruction is clear.\nI now find myself asking: have we been good neighbours to the Afghan people?\nAre we being good neighbours to the Afghan people today?\nThat remains to be seen.\nIt is a tragedy that the final act of Operation Enduring Peace consisted of President Biden’s clumsy and chaotic withdrawal.\nA withdrawal that handed former President Trump, the true architect of this American humiliation, the perverse opportunity to demand President Biden’s resignation in disgrace.\nOur own Foreign Secretary claims he didn’t see it coming – repeating this government’s one hit wonder: hindsight is a wonderful thing.\nOf course, the real end game was indeed foreseen, not two weeks ago but twenty years ago. In the Commons debates of 2001/2, by Labour’s Tam Dalyell, as well as Peter Tapsell for the Tories, and of course by Alex Salmond, then of the SNP.\nThey all warned the Blair government of such eventualities – the danger of mission creep, and the long, hard history of military occupations of Afghanistan through the ages.\nAs I mentioned during my earlier intervention, this was entirely foreseeable and it was indeed foreseen.\nBut I worry these benches are now denuded of forthright voices. My own experience illustrates the political risks one takes of giving voice to contrary, yet valid opinions.\nIf dissident voices are to be replaced with Neo-Con ninnies begging for pretendy hawkishness, as a parliament we are truly at sea.\n3,500 coalition soldiers did not return.\n60,000 Afghani security forces are dead.\nAt least 200,000 civilians have perished.\nThat is the cost in human life.\nThe cost in dollars is also enormous.\nAccording to Brown University, the United States has spent $978 billion, the UK $30 billion, and the Germans $20 billion on military operations alone.\nA further 10 per cent was devoted to alleged reconstruction. An estimated $30 billion has been siphoned off through corruption in Western-backed regimes.\nMembers have had the opportunity to watch the Phil Grabsky film, My Childhood, My Country. Mir and his young family are no different to a young family in England, Scotland, anywhere.\nIf you can’t eat, you can’t learn; if you can’t work, you can’t live.\n£2.7trillion may have brought some rewards, but as the film demonstrates, there was no proper long-term plan and so much was wasted.\nFor a fraction of these trillions, sub–Saharan Africa could have been freed from famine or countless millions lifted out of poverty across the planet.\nYet Mir’s young family faces a very uncertain future.\nHe’s not pro or anti-Taliban: he just wants peace so he can raise his young family, drive a car, take photographs, dance, go on picnics.\nHis wife, however, is very scared by developments.\nThe Afghan people were promised so much, but it is clear from Phil’s film those promises amounted to little.\nLike the good Samaritan, we crossed the road to provide much needed help, but after 20 long years of mission creep, this chaotic departure has exposed us as nothing more than international rubberneckers.\nThose who were good neighbours to us, those who lost their lives, they trusted us at our word, we have crossed back over the road and left them to a completely foreseeable and deeply uncertain fate.\nWhen we abandon such friends and neighbours to perish, we also surrender our humanity.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_tags_covid-19/content_51.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_privacy-policy/content_6.html": "PRIVACY NOTICE Office of Neale Hanvey MP __________________________________________________________________________________ANNEX A: Privacy Notice\n1. Scope\nThis Privacy Notice relates to the personal data processed by the office of Neale Hanvey, Member of Parliament (MP) for the Kirkcaldy and Cowdenbeath constituency.\n2. Responsibilities\n2.1 The Data Controller is Neale Hanvey MP.\n2.2 Neale Hanvey MP’s staff are responsible for ensuring that this notice is made available to data subjects prior to collecting/processing their personal data and obtaining their consent to the processing of their data if required by the third parties with which the office will liaise in order to respond to constituents’ enquiries Where explicit consent is not required by third parties, the office is permitted to process data under the lawful basis of Public Task.\n3. Privacy Notice\n3.1 Regulatory Requirements\nNeale Hanvey MP and his office takes your privacy seriously. We aim to ensure that the processing of all personal data in this office meets all relevant legal and regulatory requirements, including the EU General Data Protection Regulations and the Data Protection Act 2018.\n3.2 Who are we and what do we do?\nThis office carries out the duties and functions of an elected Member of Parliament. As part of this work, we respond to enquiries from constituents and undertake casework to answer these enquiries on behalf of constituents. To do this we must process individuals’ personal data. The office may create and maintain an opt-in mailing list for sending newsletters and other information relevant to Neale Hanvey and his duties as a Member of Parliament. If you provide your express consent to receive these updates, they will be sent with an unsubscribe option which you can use to withdraw your consent at any time. On occasion Neale Hanvey MP will send out letters about issues of local concern or to publicise surgeries and public meetings to constituents in a specific geographic area or community. This will be only ever be carried out using data from the full electoral roll which is provided to Neale Hanvey in his role as a Member of Parliament.\n3.3 How do we process data?\nThe office processes constituents’ data under the lawful basis of Public Task. In instances where this lawful basis is insufficient and explicit consent is required, Mr Hanvey or a member of his staff will contact you to establish your consent. The office is committed to ensuring that any information collected and used is appropriate for this purpose and does not constitute an invasion of your privacy.\n3.4 Will we share your data with anyone else?\nIf you have contacted the office about a personal or policy issue, we may pass your personal data on to a third party in order to address your enquiry. These third parties may include but are not limited to: local authorities, government agencies, public bodies and regulators. We will clearly communicate to you any actions we are taking on your behalf. Any third parties that we share your data with are obliged to store your details securely and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they ought to dispose of the details in adherence with their own procedures under all relevant data protection legislation. The office will not share any personal information of subscribers to the Neale Hanvey MP mailing list. In any case, we will not use your personal data in a way that goes beyond your reasonable expectations in contacting us.\n3.5 How does this office use the personal data it collects?\nOur office will process (collect, store and use) the information you provide in a manner compatible with the EU’s General Data Protection Regulation (GDPR). We will endeavour to keep your information accurate and up to date.\n3.6 Under what circumstances will this office contact you?\nIf you raise an enquiry with us we will contact you to update you on the progress we are making until the issue is resolved. We undertake not to ask irrelevant or unnecessary questions and will only request and store data relevant to your case. Moreover, the information you provide will be subject to rigorous measures and procedures to minimise the risk of unauthorised access or disclosure. If you have opted into our newsletter mailing list then you will receive relevant updates on Neale Hanvey’s work as an MP.\n3.7 How long will this office keep personal data?\nUnless specifically requested by you, our office may hold your personal data for a maximum of one parliamentary term. Casework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence.\n3.8 What rights do you have to your personal data?\nUnder GDPR regulations you have the following rights in relation to your personal data held by the office of Neale Hanvey MP:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply you have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review – if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n3.9 What can I find out about the personal data that the office of Neale Hanvey MP holds about me?\nIn line with the above and at your request, we can confirm what information we hold about you and how it is processed. If we do hold personal data about you, you can request the following information:\n• Our identity and contact details.\n• The purpose of the processing as well as the legal basis for processing your data.\n• If the processing is based on the legitimate interests of the office of Neale Hanvey or a third party, information about those interests.\n• The categories of personal data collected, stored and processed.\n• Recipient(s) or categories of recipients that the data is/will be disclosed to.\n• If we intend to transfer the personal data to a third country or international organisation, information about how we ensure this is done securely. The EU has approved sending personal data to some countries because they meet a minimum standard of data protection. In other cases, we will ensure there are specific measures in place to secure your information.\n• How long the data will be stored.\n• Details of your rights to correct, erase, restrict or object to such processing.\n• Information about your right to withdraw consent at any time.\n• How to lodge a complaint with the supervisory authority.\n• Whether the provision of personal data is a statutory or contractual requirement, or a requirement necessary to enter into a contract, as well as whether you are obliged to provide the personal data and the possible consequences of failing to provide such data.\n• The source of personal data if it wasn’t collected directly from you.\n• Any details and information of automated decision making, such as profiling, and any meaningful information about the logic involved, as well as the significance and expected consequences of such processing.\n3.10 How can I contact somebody about my privacy?\nYou may contact our office by letter, email, telephone or in person using the details below. Please note that we will ask for identification should you choose to exercise any of the above rights in relation to personal data we hold; this is to ensure data is not disclosed to any unauthorised party. The office of Neale Hanvey MP accepts the following forms of ID when information on your personal data is requested: passport, driving licence or birth certificate. Our office may make take further steps or request further evidence to ensure data is only disclosed to the data subject.\nAddress:\nNeale Hanvey MP\n206-210 High Street\nKirkcaldy\nKY1 1JT\nTel: 0207 219 6877\nEmail: neale.hanvey.mp@parliament.uk\n3.11 Complaints\nIf you wish to make a complaint about how your personal data is being processed by Neale Hanvey’s office or how your complaint has been handled, you have the right to lodge a complaint directly with the supervisory authority, details below:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nSK9 5AF\nhttps://ico.org.uk/ Document Owner and Approval\nThe Data Controller is the owner of this document and is responsible for ensuring that this record is reviewed in line with the review requirements of the GDPR. A current version of this document is available to all members of staff on the office SharePoint site. Signature: Date: 18/06/20 Change History Record Version Description of Change Approved By Date of Issue 1.1 Privacy Notice created Neale Hanvey MP 18/06/20",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_self-id-is-the-greatest-social-and-medical-scandal-of-our-lifetime/content_18.html": "Self-ID is the greatest social and medical scandal of our lifetime\n- Neale Hanvey MP\n- Dec 11, 2023\n- 4 min read\nThere hasn’t been a more dangerous time for young lesbians, gay men, or bisexual people during my lifetime than now. This has coincided with an equivalent threat to women and girls. For me this is a case of history repeating itself, but the risk on this occasion has been much more profound. It has been absolute and existential.\nWhen Margaret Thatcher introduced Section 28 it made little practical difference to daily life, it merely reinforced and codified the then-ubiquitous homophobia of the UK. Following its introduction, those of us with the courage to walk out from the behind the blacked-out windows of the gay bars of Edinburgh attended nascent Pride events like Lark in the Park, with some facing the very real risk of losing their jobs should they be spotted and word get back to work. Back then we had no rights to assert.\nAnd while AIDS was still picking off young gay men who had so much to live for, some of us gay boys spent our spare time volunteering for Scottish Aids Monitor (SAM), but the greater number of my comrades on those dark days were women. Women from every social background and profession. They tended to be active in various projects from SAM to Women’s Aid and projects dealing with the drug and sexual health crisis then gripping Edinburgh.\nThis week I have found myself immersed in those memories as women and LGB people faced down threats of being erased in law, and what a week it turned out to be.\nAt the beginning of the week, I attended a private meeting with lesbians from across the UK who shared their experiences of queer theory’s impact on their ability to exist, organise, or meet as a social group, as their rights and identity are increasingly appropriated by males claiming to be lesbian. This is just one facet of LGB erasure at the hands of a corrosive movement.\nThe following day I addressed a Westminster Hall debate on a so-called conversion therapy ban. I opened my contribution citing Søren Kierkegaard “There are two ways to be fooled. One is to believe what isn’t true; the other is to refuse to believe what is true.”\nLegislation is supposed to fix a problem, not create a new one. The true scandal in our midst is the medical and surgical conversion of young lesbians and gay males by using their gender non-conforming (GNC) behaviour as evidence that they were ‘born in the wrong body’ and affirming them onto an accelerated and irreversible pathway to ‘trans away the gay’.\nIt is but one part of an assault on the sex-based rights of women and LGB people. At its heart are three legislative conceits, and each are the antithesis of what they purport to be. Self-ID is not about equality, its purpose is to erase sex as a material category from legislation and with it women’s and LGB people’s ability to define themselves with precision in law. Parallel amendments to Hate Crime legislation exerts a chilling effect on the raising of valid safeguarding concerns by criminalising them, and so-called conversion therapy bans promote the lie that vulnerable children and young people who may be GNC or are struggling with normal yet distressing pubertal body dysmorphia can fix this with hormones and irreversible radical surgical intervention.\nNone of this is coincidental, the same laws are being promoted by queer theory radicals across the world. This is the greatest social and medical scandal of our lifetime. Healthy young people are being ‘affirmed’ and, in some circumstances, coerced onto irreversible treatments with scant information and little real psychosocial support.\nSex Matters proposal for a ban on these modern conversion practices cite one young GNC man who was given an ultimatum to accept gender reassignment surgery. He goes on to say,\n“As soon as I was conscious, I knew I had made the biggest mistake of my life.”\n“My sex ha[d] been lobotomised.”\nI have no words for anyone who shrugs this off as acceptable. His bravery in speaking out is incredible, but he is far from alone.\nA few hours after that debate something momentous happened. A conservative Secretary of State, who I would struggle to agree with on much else, stood at the despatch box and spoke in defence of women and LGB people across the UK. She echoed my calls to stop ‘transing away the gay’ of a generation of young LGB people, she reasserted sex as a material category in law, she faced down the vacuous hyperbole of the Labour party and she made it clear that Stonewall does not dictate equalities legislation across these islands.\nThat they have been allowed to do so unfettered by our Scottish Government is an indelible stain on our democracy.\nWhen Friday morning rolled around, I was out and about in my constituency when a BBC report appeared in my news feed. The Scottish Government had lost their appeal to erase my sex-based rights, and those of women and other LGB people in Scotland. Gender Recognition Reform (GRR) was defeated by its own incompetence in law. Nothing more, nothing less.\nOver the last five years it has been incredibly dispiriting to have the history I lived weaponised against me by those who hid in the shadows during the hard shift of the 1980’s working alongside radicalised and self-righteous so-called-allies who haven’t the first clue about equalities, Section 28 or the lives we lost to AIDS.\nIt’s not been an easy road and the journey is far from over, but the era of no debate has ended abruptly. While many heaved a sigh of relief on Friday, the risk from a UK Labour government in thrall to the same dangerous Stonewall platform cannot be ignored.\nBut without GRR in place, the First Minister’s Hate Crime and Public Order Act has no coherent locus for its provisions – it should be repealed and plans for any so-called conversion therapy ban must also be abandoned. Likewise, the non-statutory school guidance on gender must be immediately withdrawn and those still left in government who were responsible for promoting this toxic policy platform should consider their positions given the damage they have inflicted on so many.\nIt will take time to recover but as an independence movement, recover we must. Scotland should surely aspire to be a pluralist and progressive democracy, not a radicalised pseudo-theocracy where unbelievers are rendered non-persons by a baying mob of masked inquisitors.\nTruth, justice, and equality must seek to accommodate the needs and aspiration of everyone if an independent Scotland is to truly deliver meaningful change.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_with-ash-regan-in-the-scottish-parliament-watch-alba-s-impact-grow/content_26.html": "With Ash Regan in the Scottish Parliament, watch Alba’s impact grow\n- Neale Hanvey MP\n- Nov 1, 2023\n- 2 min read\nThis weekend ALBA welcomed Ash Regan MSP as our first member of the Scottish Parliament. Like Ash, who will be the first of many Alba MSPs, we all have our own story to tell about our disaffection with Scottish politics.\nThe SNP have abandoned any serious attempt to lead Scotland to independence and are mired in failure and scandal. What Alba have achieved as a party and as a parliamentary group of two is not to be sniffed at.\nWe’ve held those in power, north and south of the border to account on their many failures to deliver for the people of Scotland.\nOn Energy, Alba have exposed the betrayal and lies behind the ScotWind sale and have challenged the PM repeatedly on the robbery of Scotland’s vast energy resources. We’ve led the debate on standing charges, social tariffs and the obscenity of self-disconnection and highlighted the absurdity of energy rich Scotland and fuel poor Scots.\nAnd we have exposed the economic vandalism of the SNP, Greens and Labour on North Sea Oil and Gas and the huge potential of Carbon Capture to transition to a carbon-less future.\nAlba Party have spoken up fearlessly for sex-based rights, child protection and the dangers of men in women’s prisons and women’s sport.\nOn employment we’ve stood on picket lines with the RMT, GMB, NHS workers and other unions for decent pay and conditions.\nI’ve pressed the case on pandemic recovery, future preparedness and challenged pandemic greed. I’ve defended Scottish businesses in diagnostics and vaccine development when their own MPs were MIA.\nWe’ve delivered for the people we represent with thousands of cases for constituents, businesses and community groups and supported local efforts to tackle the greed fuelled inequality of the cost-of-living crisis. And my office has put almost £105k back into the pockets of cash strapped constituents.\nIn parliament we have exposed Labour as the Tory-lite false alternative they are.\nWe have given voice to the humanitarian consequences of conflicts from Ukraine to the Middle East making the case for ceasefire and de-escalation in place of violence, death and destruction.\nI’ve exposed the dangers of the nuclear weapons housed in our country without our consent, control or safe containment – and of course, on Independence we have led where others have given up. All of the above are achievements of substance for which I am enormously proud.\nNow that we have a voice in the Scottish Parliament, I fully expect our impact to grow.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_calls-to-violence-should-not-be-protected-under-freedom-of-expression-laws/content_47.html": "Calls to violence are not protected under freedom of expression laws.\n- Neale Hanvey MP\n- Jul 12, 2023\n- 2 min read\nUpdated: Jul 14, 2023\nYears ago, on a nightshift tea-break a call came in to Radio Forth’s Open-Line show from a Fife man desperate to escape his abusive female partner. Chillingly his call ended abruptly just as a female voice screamed with rage in the background. As a first experience of domestic violence perpetrated by a woman against a man, unsettling would be an enormous understatement.\nI raised this during a White Ribbon Campaign debate as a Fife councillor, and back in those days there was unanimity in the chamber in condemnation of domestic violence. It would have been anathema for anyone to condone or minimise any such violence.\nSo, this weekend I was shocked to read Labour MP Clive Lewis’ attempt to press a “both sides” “she made me do it” argument on Twitter apparently justifying a call to violence against women critical of gender ideology.\nOn Saturday trans-identifying convicted criminal Sarah Jane Baker proclaimed to enthusiastic cheers from London’s Trans Pride, “If you see a TERF punch them in the f***ing face”.\n“TERF,” is an acronym for “trans exclusionary radical feminist,” and is used to dehumanise and justify violence against women who campaign to protect their sex-based rights.\nYou would think that considering the recent episodes of murderous violence against women perpetrated by serving Met police officers, the Met would pursue the matter vigorously. Well, you would be wrong.\nIn response to a police complaint, acting Met Sergeant Daniel Warner refused to progress the report claiming Barker’s call to violence was protected under freedom of expression laws. Aye right.\nAccording to the UK’s Equality Human Rights Commission (EHRC), freedom of expression covers the right to hold and express valid beliefs and opinions without government interference. But the EHRC are crystal clear “freedom of expression does not protect expression which seeks to incite violence, hatred or discrimination against others.”\nAs the trans umbrella has been distorted to include anyone with a spicy lifestyle or fetish, in Scotland campaign groups received over £3million to promote “LGBTI equality” [gender ideology] for the years 2021 to 2024.\nWell, violent criminals like Baker and gender ideologues will never speak for me.\nContrast this largesse with the withdrawal of funds for domestic violence charity Saje Scotland who were denied the £150k Scottish Government grant they needed to continue their Freedom Programme helping female and male victims of domestic rebuild their lives.\nWhat on earth has happened to zero-tolerance? None of this is okay.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_letters/content_58.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_accessible-and-accurate-testing-paves-route-out-of-pandemic/content_63.html": "Accessible and accurate testing paves route out of pandemic\n- Neale Hanvey MP\n- Feb 19, 2021\n- 2 min read\nAccurate testing will be key to containing coronavirus outbreaks for the foreseeable future and that is why testing must be accessible to everyone.\nThat is the message of Kirkcaldy and Cowdenbeath MP, Neale Hanvey, as he welcomed the new local test site at the Overton Community Centre. The local MP said that this new walk-through centre “will make it easier for many people in Kirkcaldy to access testing”.\nMr Hanvey was keen to stress that it was \"good news” that new testing centres were opening using PCR tests. The local MP has previously been critical of UK government plans to increasingly rely on rapid lateral flow tests which have been shown to be much less accurate than the PCR tests available at testing centres.\nThe walk-through testing centre at Overton Community Centre opened on 12 February. It is part of a programme of walk-through sites created to complement the regional drive through testing network, as well as the option for home testing, both of which can be booked through the government’s online portal.\nMobile Testing Units are also travelling the country, responding to increased regional demand for testing and supporting hard to reach areas.\nCommenting, Neale Hanvey MP said:\n“This is really good news for folk in Kirkcaldy. While it’s right that we’ve been spending a lot of time talking about the vaccine rollout, we must remember that accessible and accurate testing is crucial to our route out of the pandemic.\n“That’s why walk-through sites, home testing, and mobile testing units have an important role to play for the foreseeable future.\n“A lot of effort went into selecting the right site to support folk in Kirkcaldy and this is a great example of government, the NHS, and Fife Council pulling together in the face of the pandemic.\n“If you think you have symptoms of coronavirus, please remember to self-isolate and book a test.”\nClick here to read the full story in the Fife Free Press",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_surgeries/content_38.html": "top of page\nSURGERIES\nAdvice and Support from your MP\nNeale's in-person help and advice surgeries have restarted. You can still speak to Neale by phone, email, or video call, and you can now also book a face-to-face appointment.\nIf you wish to book an appointment, please contact Neale on:\nbottom of page",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_tags_aviation/content_70.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_neale-hanvey-mp-puts-pm-on-the-spot-over-discredited-rapid-covid-tests/content_21.html": "Neale puts PM on the spot over “discredited” rapid Covid tests\n- Neale Hanvey MP\n- Jul 7, 2021\n- 3 min read\nThe UK government has chosen to “prop up completely discredited Chinese tests”, despite promises to the UK diagnostics industry to use superior tests designed and made in the UK.\nThat is the claim of Alba MP, Neale Hanvey, who led on this issue at Prime Minister’s Questions today in Westminster. In a tense exchange, the Scottish MP highlighted a promise from Lord Bethell, Parliamentary Under Secretary of State at the Department of Health and Social Care, that the UK would procure 2 million lateral flow tests each day by the end of May, creating jobs and prosperity across these islands.\nBut the decision of the UK government to continue using Innova’s Lateral Flow Tests for rapid testing has meant that promise has been broken, infuriating domestic diagnostic companies. Mr Hanvey pointed to both Omega Diagnostics and Mologic as two domestic companies capable of producing superior devices to Innova’s Chinese imports.\nThe Prime Minister was caught off-guard by the question but said he did not “think it fair”, as he praised the UK’s efforts to support the domestic diagnostics industry.\nEarlier this month, the US Food and Drug Agency (FDA) published the most serious class 1 recall of the Innova tests after raising significant concerns about their accuracy, advising the US public to “stop using” the tests and return them to the manufacturer.\nThe Innova rapid tests had been approved in the UK under a temporary Exceptional Usage Authorisation which was due to expire at the end of June, although that has now been extended until the end of August. This has led to calls from academics for the UK government and MHRA to publish the extension letter that should provide the rationale for the continued use of these rapid tests, but to date the UK government has not released the extension letter.\nMr Hanvey has repeatedly warned about the Innova tests, telling the BMJ in December 2020 that there was “a clear risk that those with a false negative result will feel overly confident about mixing with vulnerable people” [see here].\nCommenting, Neale Hanvey MP said:\n“We’ll be able to safely return to normal life when most of us are vaccinated and we have accurate, fast testing. The first part of that plan is going very well, but I’m afraid to say there are serious problems with the testing.\n“That’s because for some completely inexplicable reason, the UK government is persisting with discredited Chinese tests, even though there are companies across these islands capable of making accurate rapid Covid tests, including one based in Scotland.\n“After Lord Bethell’s promise, these companies prepared themselves to increase production of these superior tests. That promise was then broken, and the domestic diagnostics industry was undermined.\n“It’s not good enough for the Prime Minister to engage in the usual bulldog optimism about the UK’s support for the domestic diagnostics industry. It might make a good soundbite, but it’s simply untrue.\n“What we need are clear answers as to why the UK government has chosen to deprive Scotland, and indeed all four nations, from the jobs and prosperity that would have come from sourcing rapid Covid tests from companies based on these islands.”\n<ENDS>\nNote to Editors",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_categories_environment-and-animal-welfare/content_27.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_opinion-there-s-a-bright-future-for-green-jobs-in-fife/content_62.html": "OPINION: There's a bright future for green jobs in Fife\n- Neale Hanvey MP\n- Jan 4, 2021\n- 2 min read\nUpdated: Jan 5, 2021\nI know many of you will want to change the conversation. Surely it’s time for some good news? This year brought us one piece of bad news after another, so much so\nthat we forgot about the other bad news we’d been fretting over before. The trepidations of a New-Year-No-deal-Brexit leaving us languishing alone outside of Europe seemed distant in the face of a global pandemic that put lives and livelihoods at risk. Yet this latest Christmas lockdown seems to have delivered more gloom already.\nAnother area of concern in 2020 was in our local energy industry. We had the marine renewables company BiFab enter administration and continued concerns about the frequency of unplanned flaring at Mossmorrran. This led to more than one opportunistic local politician spotting a local economy destroying bandwagon to jump on.\nSo enough, we all need 2021 to be a year of hope.\nJust think about the impact our small patch of the world could have on climate targets across the planet.\nAnd there is good reason to hope. We’ve yet to scratch the surface of the green energy potential of Fife. Up the road in Levenmouth, SGN’s project to deliver a domestic hydrogen heating network has begun. A world first – and putting Fife renewables on the map when attention is very much on hydrogen.\nThere is also potential in phase 5 of that project to make use of the hydrogen produced at Mossmorran and to take advantage of the pipeline between St Fergus and the Fife site for emerging carbon capture and storage industry.\nMossmorran is strategically well-sited to play a significant role in a net-zero carbon future, thus securing and expanding a skilled workforce at the plant and in the supply chain, as well as creating jobs across the decarbonisation industry and local businesses. I know patience ran thin a long, long time ago, but the improvement works are progressing and I will continue to press both operators and regulators to deliver.\nAs a by-product of existing operations, Mossmorran produces enough hydrogen to heat 140,000 homes. The Levenmouth project could see hydrogen integrate with existing networks, creating the potential for an extended decarbonised east coast network. If successful, this could ultimately lead to 170,000 miles of pipes heating homes and business across these islands.\nAll of this is beginning as the UK Government commit to creating a Hydrogen Town by 2030. As that hydrogen must come from somewhere, where better than Fife? Just think about the impact our small patch of the world could have on climate targets across the planet.\nSo, my commitment to you, after the most difficult of years, is a promise to continue to speak loud and proud about our vast potential. Having hope, focusing on the good news, is a conscious effort I’m making in 2021. Join me.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_opinion-the-art-of-disagreeing/content_74.html": "OPINION: The art of disagreeing\n- Neale Hanvey MP\n- Feb 17, 2021\n- 2 min read\nI disagree. Two words that can be difficult to hear as they are typically followed by a challenge to our views. But disagreement, considering alternative arguments, and refining our position expands our perspective, deepens our understanding, strengthens our relationships, and should always seek to improve the world we live in. Take the future of Kirkcaldy High Street, I’ve heard lots of different takes on how we make a success of our town centre – that’s healthy, no one has all the answers and I certainly don’t have a monopoly on ideas.\nAs the friendly debate over a pint fades into the past, it’s being replaced by increasingly embittered exchanges on social media. We now live in an age where groups judge one another morally depending on their stance on specific policy details.\nThat’s why I’ve met with lots of different people – local shop owners, residents, investors, councillors and council officers – to listen and get a clear idea of how I can best support the future of our town centre. There’s lots of good will, cracking ideas and energetic spirit in our town. We’re making real progress because folk have put aside political differences finding ways to disagree constructively.\nJust last week I had a frank exchange of words in the Fife Free Press with a local Tory councillor. She had criticised the pace of Covid-vaccine rollout in Fife. I was frustrated by her argument – after all, at the time of that debate 31,000 of our friends, family, and neighbours had already received a dose. That’s before we mention the thirteen new vaccine centres that began to be phased in across Fife last week.\nAnd while we might disagree, that councillor is entitled to her opinion, right to voice it and, on reflection, I do understand those concerns. We all want the vaccine rollout to accelerate. We’re all desperate for reassurance, to feel like we’re in the endgame of this pandemic.\nThe problem is that disagreeing in this spirit is a dying art.\nFolk disagree on a host of political issues, from the big constitutional question to local taxation, immigration to women’s rights. But as the friendly debate over a pint fades into the past, it’s being replaced by increasingly embittered exchanges on social media. We now live in an age where groups judge one another morally depending on their stance on specific policy details. It is a time of hubris, defamation, echo chambers and filtered news, a time when we don’t just have our own opinions, but our own “facts”. This polarisation helps nobody.\nSo, let’s all reacquaint ourselves with the noble art of disagreeing – talking less and listening more. And be kind and considerate of others views and concerns.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_newsletter/content_7.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nFor previous editions, click on the links below:\nWinter 2020",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_post_truth-and-unity-both-remain-vital-to-the-independence-movement/content_2.html": "Truth and unity both remain vital to the independence movement\n- Neale Hanvey MP\n- Nov 20, 2023\n- 4 min read\nIf you’d told me in 2019 where Scottish politics would be in 2023 I wouldn’t have believed you. However, if you had told me my appetite and determination for the cause would be undiminished, you would have been telling me the truth.\nAnd the truth matters, however unpalatable it may be.\nThroughout my NHS career I’ve had too many conversations where I have had to break news to parents and their children of the most terrible of truths.\nPerhaps this is why I have developed my forthright approach to truth telling especially when it’s clear the emperor has no clothes. Dealing with facts, however difficult they may be, is the only way to meet any challenge. One of the most invigorating aspects of the independence referendum campaign was the explosion of interest in all aspects of policy and healthy workplace, coffee house and pub debates.\nBack then, we were unafraid to have differences of opinion, to propose various solutions to decades old problems and most importantly we spoke truth to the distortions of the Unionist “Better Together” No camp. And that appetite for truth and facts is something we must now rediscover, and our movement must demand, if we are to make any progress.\nThe first issue we must come to terms with is that another independence referendum is not going to happen for the foreseeable future, and certainly won’t be achieved by sending less MPs to Westminster than before. Thanks to the folly of asking them, the UK Supreme Court made it clear a referendum on Scottish independence was a reserved matter, and a Section 30 Order to temporarily transfer those powers to the Scottish Parliament is entirely in the gift of Westminster.\nThis underscores the unavoidable fact that our Parliament is a creature of the British State and is increasingly being squeezed under the heel of Whitehall. Securing mandates to ask for a referendum only to be rebuffed is now the equivalent of the Monty Python parrot that has ceased to be; it’s stone dead as viable option.\nThe Tories have become increasingly bold, going from “now is not the time” to a straight-out “no”. They’ve also made clear they will plunder Scotland as a cash cow until the wind stops blowing. Westminster will rob our resources at their leisure.\nThere is no way – even if the First Minister was to actually ask – that Rishi Sunak would agree to an independence referendum in his final months as PM. As for an incoming UK Labour government, rebranded in as many Union Jacks as they can stuff into a photo opportunity, Sir Keir Starmer has made it clear his priority is continuity with Tory economic and social policy and he intends to persist with the robbery of Scottish assets.\nAny fantasy that pleas for more devolution will be accommodated by Labour are also pie in the sky. As reported in The National, North of Tyne Mayor Jamie Driscoll accused Starmer of censoring, diluting and striking down key recommendations contained in Gordon Brown’s report on the constitution and further devolution across the UK.\nThese attempts to prevent the “Break Up of Britain” by refusing to devolve power away from London will ultimately fuel the case for Scottish independence and Irish re-unification. Starmer’s deeds put paid to any notion that former PM Gordon Brown’s report would break new ground or offer any meaningful change within the UK to the benefit Scotland.\nBrown’s attempt to reframe the debate to one of “change within Britain versus change by leaving Britain” has been utterly dismantled by Starmer and fuelled the urgent need for independence.\nAll of this leads us to the position where Scotland urgently needs a robust strategy that not only deals with the facts of the day, but overcomes that central hurdle of the denial of a democratic process.\nThe Alba Party – and our Scotland United colleague Angus MacNeil – believe every Scottish and UK election should be used to secure majority support for independence negotiations to commence.\nThis reinstates the position of the national movement before devolution. As with all democratic expressions, the threshold would be a simple majority of votes cast for all pro-independence parties.\nThis approach is supported by the expert legal opinion of Professor Robert McCorquodale that “the people of Scotland are distinct within the UK and have a right to self-determination”.\nFurthermore, McCorquodale explains the UK, as a signatory to multilateral international human rights treaties has “expressly accepted that the right to self-determination is a human right” and “not just as an international legal principle – which is binding under international law on all States.”\nThese are not obscure or arcane points of law. They are precise and purposeful.\nI understand why the UK Government doesn’t want to hear the facts McCorquodale has set out, but I can’t comprehend why the Scottish Government and many in the SNP are steadfast in their refusal to even acknowledge this landmark legal opinion.\nThe Alba Party amendment to the King’s Speech repeated the democratic principles contained in my Scotland (self-determination) Bill. That is for the recognition of the right of the people of Scotland to self-determination by amending the Scotland Act 1998 to transfer the power to the Scottish Parliament to legislate for an independence referendum.\nThe amendment was signed by myself, Kenny MacAskill MP, Angus MacNeil MP and Welsh nationalist Jonathan Edwards. While Stephen Flynn was kind enough to explain to me why he could not personally support the amendment, I remain disappointed and bewildered that not a single other SNP MP felt this was worth putting their name to.\nFocus must again be on delivering good governance and tangible improvements for the people of Scotland. Confidence that a better Scotland is possible rests firmly on effectiveness in government. The SNP need to get back on track, in government and on independence.\nA Section 30 order is not a “gold standard”, any democratic vote in favour of self-determination is the only standard required – providing that is the clear and unclouded purpose of such a vote – unless of course the UK Government don’t want to recognise democratic elections as legitimate expressions of the will of the people? Sunak, Starmer and whichever UK PM that comes next might be able to stifle their Scottish Parliament creature, but they have no locus on the inalienable rights of the people of Scotland.\nThe independence movement must find a way to unite in the central purpose of independence. Ultimately the people are the standard bearers for Scottish independence, not politicians. Politicians must demonstrate they are true to the cause of independence for Scotland or stand aside for others with the guts and gumption to do so.",
  "https_www_nealehanvey_com_/https_www_nealehanvey_com_news_tags_ppe-scandal/content_61.html": "01592 210088\nneale.hanvey.mp@parliament.uk\nHOME\nABOUT\nWEEKLY COLUMNS\nNEALE AT WESTMINSTER\nSURGERIES\nCAMPAIGNS\nCONTACT\nMore\nThe latest updates from Neale"
}