{
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_map-locations/content_6.html": "Skip to main content\nMain navigation\nAbout John Glen\nNews\nIn Salisbury\nIssues\nIn Parliament\nContact\nSalisbury Constituency Map",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_contact/content_4.html": "Please do get in touch with me using the contact details on this page. I hold surgeries on a regular basis by appointment - to find out more please contact my office. Email is my preferred method of contact; any letter correspondence can be sent to the House of Commons address. This will be screened and rerouted to my constituency office, so may take longer to be received than other forms of communication. Please note that I can only act on behalf of individuals living within my constituency, so be sure to include your home address and postcode. If you are unsure as to whether I am your MP, please use the 'Am I your MP' search on my homepage.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk/content_1.html": "Issues Preserving the Environment Preserving the environment is not a partisan issue. The government is… Education, Skills and Jobs Our future prosperity depends on generating more high-value jobs in South… Creating a New Cultural Strategy I have always considered it one of my main priorities to campaign to improve… Find me on Twitter Am I your MP? Enter your postcode Postcode Latest news Small Business Saturday in Salisbury and South Wiltshire This weekend I had the pleasure of helping to visit and promote some wonderful… The House Magazine: Reflections on the Current Economic Situation Following four and a half years as city minister, with another year as PPS to… Tribute to Her Majesty Queen Elizabeth II I would like to pay tribute to the life of dedicated service of Her Majesty… Find me on Facebook Find me on Instagram Get in touch Constituency Office01722 323050 [email protected]Parliamentary OfficeHouse of Commons, London SW1A 0AA020 7219 7693[email protected]John on FacebookJohn on TwitterJohn on Instagram My map\nEducation, Skills and Jobs Our future prosperity depends on generating more high-value jobs in South…\nCreating a New Cultural Strategy I have always considered it one of my main priorities to campaign to improve…\nSmall Business Saturday in Salisbury and South Wiltshire This weekend I had the pleasure of helping to visit and promote some wonderful…\nThe House Magazine: Reflections on the Current Economic Situation Following four and a half years as city minister, with another year as PPS to…\nTribute to Her Majesty Queen Elizabeth II I would like to pay tribute to the life of dedicated service of Her Majesty…",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_news/content_2.html": "Small Business Saturday in Salisbury and South Wiltshire Monday, 4 December, 2023 This weekend I had the pleasure of helping to visit and promote some wonderful small businesses around Salisbury and South Wiltshire on Small Business Saturday. This included the Matthew Burt Workshop and Showroom, a family-run furniture business in Hindon, and the Blueberry Den, a zero-waste, family-run grocery shop in Salisbury. Both of these thriving independent businesses are a testament to... Local News\nThe House Magazine: Reflections on the Current Economic Situation 13th October 2022 Following four and a half years as city minister, with another year as PPS to former chancellor (now Lord) Philip Hammond, not walking into HM Treasury in... Articles\nTribute to Her Majesty Queen Elizabeth II 9th September 2022 I would like to pay tribute to the life of dedicated service of Her Majesty Queen Elizabeth II. She has been the cornerstone of our national life, the... Articles\nSalisbury Claimant Count, June 2022 20th July 2022 I am delighted to see that figures published this June show that our local economic outlook is improving, with the Salisbury claimant count down 895 people on... Articles\nEdUKaid: The Downton Based Charity Supporting Global Education 20th July 2022 I am proud to be supporting a great, local, Downton based charity with their vision to ensure that every child has the access they need to the education they... Articles\nLetter of Resignation to the Prime Minister 6th July 2022 Dear Prime Minister, After much thought and with deep regret I must inform you that I have made the difficult decision to resign from the government. It has... Articles\nHelping with the cost of living: Energy Bills Rebate 3rd February 2022 As the UK economy continues its recovery from the pandemic, we must confront the global inflationary pressures caused by the world economy finding its feet once... Westminster News\nAddressing misinformation on sewage discharge 26th October 2021 Numerous constituents have taken the time to accuse me, sometimes in pretty florid terms, of voting to pump raw sewage into rivers. Of course, I did no such... Westminster News\nSSEN - Salisbury & South Wiltshire’s transition to net zero 5th October 2021 Ahead of COP26, which will be held in Glasgow at the end of October, I met with Scottish and Southern Electricity Networks (SSEN) Distribution to discuss their... Local News\nCollective Responsibility 22nd September 2021 Occasionally, constituents profess disappointment that, as a minister, I am unable to speak from the backbenches in Commons debates. When I explain that all... Westminster News",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_campaigns_preserving-environment/content_8.html": "Preserving the environment is not a partisan issue. The government is determined that the UK will continue to be the leading major economy in reducing carbon emissions, developing modern environmental policies and setting out strategies to support sustainable living. These initiatives have been set out in the 25 Year Environment Plan. In Salisbury, local measures have also been taken to introduce e-bikes, make our streets cleaner and promote recycling. We can, and I believe we will, be the first generation to leave the environment in a better state than we inherited it.",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_accessibility/content_7.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_news_helping-cost-living-energy-bills-rebate/content_3.html": "As the UK economy continues its recovery from the pandemic, we must confront the global inflationary pressures caused by the world economy finding its feet once more.\nThe rising cost of energy is due to increased demand worldwide, which drives inflation and feeds through into pressures on the cost of living.\nThese problems are global so we must accept the limitations in the government’s capacity to deal with them.\nIn recognition of the pressures facing households, steps have already been taken such as: reducing the Universal Credit taper rate, increasing the National Living Wage, freezing fuel duty for the twelfth year in a row, and launching a £500 million Household Support Fund to help the lowest-income households with their bills.\nHowever, it is clear that we must go further to help families with the increasing cost of living, while accepting that, over time, households will need to adjust to higher energy costs.\nThe government can help ensure the adjustment to higher prices is smaller initially and spread over a longer period, thus minimising the pressures on the cost of living.\nToday, Ofgem have confirmed that the energy price cap will rise by £700 from April. In response, the government has announced a three-part plan to help with household fuel bills immediately and protect people against half of this increase.\nThis help is worth £350 per household, in a total package of support worth £8.6 billion, and is comprised of the following:\n(1) A £200 ‘smoothing’ rebate on energy bills for all households, to be paid back over the next five years at £40 per year – starting from April 2023\n(2) A non-repayable £150 cash rebate for homes in Council Tax bands A-D – equivalent to 80 per cent of all households, helping both lower and middle-income families\n(3) £144 million of discretionary funding for local authorities to support households not eligible for the council tax rebate\nThis package provides more generous support to most households faster than other proposals.\nThroughout the pandemic, the government’s policies have benefitted the poorest the most. Distributional Analysis published at Autumn Budget 2021 shows the decisions of this government over this Parliament have been highly progressive and most benefitted those on lower incomes.\nThis is also true for the government’s interventions during the pandemic, which evidence shows supported the poorest households the most.\nThe package announced today is similarly progressive, with larger payments going to lower income households as a proportion of net household income.\nAdditionally, over this Parliament we are investing over £3 billion to help improve energy efficiency in almost 500,000 low-income, fuel poor households – delivering average bill savings of nearly £300 every year.\nThis is being delivered through:\n- Social Housing Decarbonisation Fund: saving homes £270 per year, worth £3.8 billion for 250,000 vulnerable households, with no cost to the tenant as the upgrade is funded by landlord and government\n- Home Upgrade Grants: £10,000-£25,000 government grants delivered through councils, with only a one-third contribution from landlords, saving homes £350 per year for 246,000 homes\n- Boiler Upgrade Scheme: £500 million to provide nearly 100,000 households with a £5,000 grant to replace their boiler with low carbon heating technologies\nTo support households at risk of fuel poverty through their bills, the government is also providing:\n- Warm Homes Discount: £140 rebate on energy bills each for over 2.2 million low-income households. The government is continuing with plans to increase the rebate to £150 and expand eligibility by one-third to 3 million vulnerable households\n- Winter Fuel Payments: £300 for 8 million pensioners, worth £2 billion\n- Cold weather payments: £25 per week in cold weather, supporting 4 million vulnerable households\n- Energy Company Obligation: £290 saving on bills for 133,000 people in fuel poverty, worth £1 billion\nI am assured that Ofgem and the government have been working closely the energy industry and consumer groups to support customers through this difficult time and I urge anyone worried about paying their energy bills to contact their supplier and access the support available.\nThis is work in progress, but the government is committed to using the levers at its disposal to help households in the face of increasing living costs.\nI will continue to monitor developments in this area.",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_news_salisbury-claimant-count-june-2022/content_9.html": "I am delighted to see that figures published this June show that our local economic outlook is improving, with the Salisbury claimant count down 895 people on this time last year. Evidently, serious economic challenges still remain. With inflation, we will all be feeling the rise in the cost of living, from the cost of day to day products in our supermarkets, to the cost of energy bills and fuel prices, all families are feeling the squeeze on incomes. It’s why the Government took the decision when I was a Minister in the Treasury to provide a universal one off cost of living payment of £650 to every household which claims it, supporting people throughout our community. Despite this difficult period, more people remain in work than at any time in our history and I am optimistic that we will come through the other side of these challenges, stronger and better off.",
  "https_www_johnglen_org_uk_/https_www_johnglen_org_uk_campaigns_education-skills-and-jobs/content_5.html": "Our future prosperity depends on generating more high-value jobs in South Wiltshire. I am thrilled that Boscombe Down and Porton Down offer expanding opportunities in the aerospace and life sciences sectors. Organisations including Boeing, Qinetiq, DSTL and Porton Biopharma are anchor employers, presenting our young people with outstanding career opportunities, including apprenticeships. Apprenticeships are of great benefit to young people; developing vital skills, introducing individuals to work life and learning about the sector whilst training is a brilliant way to understand industries and build careers.\nIn Salisbury, the £14 million redevelopment of the Wiltshire College campus – which I heavily lobbied for – has begun and will eventually lead to an increase of 1,000 students. This expansion will help ensure that people entering the local labour force are equipped with the necessary skills for the modern economy. With an increase of students, this will create new jobs, thus encouraging employment in the local area."
}