{
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_Opinions/content_11.html": "MP pays tribute to Prince Philip 20th April 2021 Dumfriesshire, Clydesdale and Tweeddale MP David Mundell has expressed sadness at Prince Philip's passing. He said: \"He was a remarkable man who provided a... Opinions\nNew Year Message from David Mundell MP 1st January 2021 WHEN I wrote my 2020 New Year's message few of us realised that we were so close to a global health emergency which would transform all our lives. The last 10... Opinions\nFigures show Benefits of Union 31st August 2020 THE PUBLISHING of the latest Government Expenditure and Revenue Statistics (GERS) provides both sides of the independence debate the chance to give their view... Opinions\nKeeping high UK food standards secure 13th July 2020 I'M PLEASED the Government has taken steps through the creation an independent Trade and Agriculture Commission to provide additional reassurance that UK food... Opinions\nParliament changing for the Better? 5th May 2020 ONE OF the consequences of Parliament having to adapt to coronavirus is the increased use of video technology which I have been arguing for now for sometime and... Opinions\nMaking A Difference 4th May 2020 I would like to take this opportunity to praise the work of all those on our local coronavirus frontline be they NHS, key workers or in the wider care community... Opinions\nGrowing Strong in Difficult Times 28th April 2020 THERE can be little doubt that for most of us there have been few events in our lifetime that have had such an impact on everyday life as that of the Covid-19... Opinions\nChallenging Times 7th April 2020 SADLY, across the constituency, and beyond, coronavirus and the lockdown continue to dominate all our lives. My thoughts are, like those across the political... Opinions\nCoronavirus (COVID-19) 16th March 2020 THERE can be few topics dominating conversations more just now than Coronavirus (COVID-19) and that looks certain to remain the case in the weeks and months... Opinions",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_tribute-sir-alex-fergusson/content_60.html": "To me, Alex was foremost a great friend and I will miss him dearly. He was the most thoroughly decent person I have ever known.\nHe was the absolute opposite of the career politician and was guided by a sense of public duty and his core values of family, community and country, rather than party dogma.\nHis legacy was to ensure our Scottish Parliament was a Parliament for the whole of Scotland and that rural issues were given their place, never more so than during the devastating Foot and Mouth outbreak of 2001, when he was the farming communities’ voice.\nHis election as Presiding Officer in 2007 was testament to the respect in which he was held across the chamber.\nManaging the first minority government was not without its challenges, but Alex approached the job with calm and dignity that was the hallmark of everything he did.\nBut not for him were the trappings of high office -- he turned down the official car and drove himself back to Galloway every week so he could work for the constituents he always saw as his priority.\nThey, like us all, will miss him, but we can take comfort from the positive mark his public service has left on Scotland.\nImage © Scottish Parliamentary Corporate Body",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-leads-calls-further-boost-nutrition-through-international-aid/content_20.html": "David Mundell MP has this week called for further action to fight malnutrition as part of the UK’s ongoing commitment to international development programmes.\nMr Mundell, who is Chair of the All Party Parliamentary Group on Nutrition for Growth, spoke out during a debate in the House of Commons on Foreign, Commonwealth and Development Office spending, saying that the UK must use its international influence to help mobilise funding to promote good nutrition, not take actions that diminish it.\nDavid Mundell MP said:\n“Nutrition is like rocket fuel for our aid budget. Our interventions in health, education and emergency humanitarian response are all more impactful when coupled with long term interventions that improve nutrition.\n“This is because children can only develop healthy and robust immune systems if they get the right nutrition. A strong immune system is the first line of defence against illness – it is essential for a healthy and productive life.\n“According to the World Health Organisation, 45% of all under-5 deaths are linked to malnutrition. And heartbreakingly, as a result of COVID-19’s disruption to food systems, an estimated further 433 children are expected to die of malnutrition every single day.\n“Not only does malnutrition cost lives, it drives absence from school, reduces concentration and therefore prevents children from learning and reaching their full potential as adults, perpetuating a cycle of poverty. As well as the impacts this has on individuals, malnutrition prevents economic growth – and as a result, puts our aid budget under strain.\n“All of what the government says it hopes to achieve through our aid budget – be it girls’ education, women’s health, or economic development – is enabled and enhanced through nutrition.\n“As well as having exceeded their target of reaching 50 million people with nutrition interventions, the Foreign, Commonwealth and Development Office has a strong track record of reaching the most vulnerable people and delivering high impact interventions based on evidence and science.\n“By hosting the Nutrition for Growth summit in 2013 – which mobilised over £17bn for nutrition – and stepping up as a major donor to nutrition in the years since, the UK has unrivalled convening power and is able to catalyse funds for nutrition from other donors and domestic governments. We must build that influence, not take actions that diminish it.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-welcomes-chancellors-budget-measures/content_48.html": "TODAY'S Budget is good news for Dumfriesshire, Clydesdale and Tweeddale, according to local MP David Mundell, as the country continues to fight the pandemic and plan for recovery.\nMr Mundell welcomed the continuation of the furlough scheme and support for the self-employed, but particularly the extension of the Universal Credit uplift of £20 for six months.\nHe also highlighted the continuation of the cut in VAT for hospitality businesses and called on the Scottish Government to match the other business support measures the Chancellor announced for England with the Barnett consequential funding they will receive.\nMr Mundell, who has campaigned throughout his 16 years as MP to keep fuel duty rates down, thanked the Chancellor for listening to the representations he made to him and freezing fuel duty for the 11th consecutive year.\nHe said: “This is the right budget at the right time. We still need to focus on defeating pandemic and the continuing support for local people and businesses is most welcome.\n\"Thousands of people in my constituency have benefited from the furlough scheme and self-employed scheme, but I have lobbied particularly hard to persuade the Chancellor to retain the £20 uplift on Universal Credit so the most vulnerable receive the support they need.\n\"I also lobbied to keep a VAT cut for the hospitality industry which so many local businesses were in touch with me about and this will make a real difference to them as they are gradually allowed to reopen.\n\"The Chancellor announced a range of other measures to help business in England and we need to see the equivalent delivered here in Scotland -- unlike previously when the Scottish Government has sat on money it received from the UK Government and failed to distributed it quickly to businesses.\n\"I have always argued that a car is a necessity not a luxury in our rural communities and haulage fuel costs contribute significantly to the cost of living locally. That’s why I have always opposed rises in fuel duty and so I am delighted the Chancellor agrees and has frozen duty yet again.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_welcome-new-protections-free-access-cash/content_58.html": "NEW PLANS set out by the UK Government will help ensure that people and businesses are no more than three miles away from the ability to withdraw or deposit cash.\nThe financial services watchdog will be given the power to fine banks and building societies which fail to maintain standards on protecting access to cash.\nA long-time campaigner for safeguards to guarantee access to the UK cash system, despite the growing use of other transaction methods, Dumfriesshire, Clydesdale and Tweeddale MP David Mundell welcomed the steps as a “positive move to protect the ability of people in rural areas to continue to have access to traditional cash.”\nDavid Mundell said: “With the creeping withdrawal of banks and free cashpoints from smaller towns and more rural settings, I have long warned that we are sleepwalking towards a cashless society.\n“It’s clear that many people value the ability to make cashless transactions and no doubt the convenience of digital payments will continue to see them expand in future. However, the fact is that most people still want the ability to also access cash and this is being made harder, and in some cases virtually impossible, as banks and cashpoints disappear from rural and more remote areas.\n“It’s a trend that discriminates particularly against older people who are used to making cash transactions and small businesses needing to deposit cash takings.\n“So I very much welcome this announcement which sets out the minimum expectations on banks to protect services for people and businesses wanting to withdraw or deposit cash. In practice, this should help ensure that the vast majority of people and businesses are no further than three miles away from withdrawing cash.\n“This is a positive move to protect the ability of people in rural areas to continue to have access to traditional cash and I look forward to the Financial Conduct Authority making use of these new powers to help ensure the continuing provision of cash access services.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-appointed-uk-trade-envoy-new-zealand/content_28.html": "LOCAL MP David Mundell has been appointed to a key role in helping increase trade between the UK and New Zealand.\nThe former Scottish Secretary was today (Monday) confirmed as dedicated Trade Envoy to the Commonwealth country by Prime Minister Boris Johnson.\nHe is one of 10 new envoys revealed by Downing Street, also including Lord Botham, the former England cricket star, who will focus on the neighbouring Australian market.\nMr Mundell stressed that his additional unpaid duties would not detract from his primary role of serving his constituents across Dumfriesshire, Clydesdale and Tweeddale.\nHe hoped to draw on his existing contacts in New Zealand where he led a trade mission whilst in his UK Cabinet role as Scottish Secretary and met Ministers and business leaders.\nCommenting on his appointment, Mr Mundell said: \"I'm delighted to take on this new challenge. There are many potential opportunities to increase business links between our two nations with negotiations on a free trade agreement moving forward apace.\n\"I will be looking to build on our shared heritage and other existing connections to expand economic links.\n\"At the Scotland Office I promoted Scottish and UK products and services, from whisky to technology, and found a welcoming and receptive audience in New Zealand.\n\"Together, I am sure we can turn that positive attitude into real business and jobs for both countries.\"\nThe news was welcomed in Mr Mundell's home town of Moffat by New Zealand's former Honorary Consul for Scotland, Sir Neil McIntosh.\nHe said: \"I believe this is a very good appointment. David will be an excellent envoy. He established some valuable ties with New Zealand whilst he was Secretary of State.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mundell-welcomes-chancellors-spending-review/content_50.html": "Local MP David Mundell has today welcomed the Chancellor’s spending review and autumn statement setting out how the UK Government will deliver security, investment and opportunities for families and businesses locally.\nThe Spending Review delivers the UK Government’s commitment to keep the Barnett Formula, including an increase in capital funding for the Scottish Government of £1.9 billion through the block grant in addition to the Scottish Government’s ability to borrow up to £2.2 billion for capital investment.\nMr Mundell said – “This increased capital expenditure is a welcome boost for Scotland. The UK Government is delivering on its commitments, the Scottish Government now needs to deliver on projects that are shovel ready across the South of Scotland to improve roads and transport links and build new homes.”\nThe Chancellor also announced that he will provide £7 million through the Regional Air Connectivity Fund to support new air routes promoting domestic and international connectivity, including from Carlisle Airport. Mr Mundell said – “This is good news for people across Dumfries and Galloway. The new routes will stimulate jobs and growth locally, and is vital in attracting new enterprise to the region.”\nThe Scotland Bill will make the Scottish Parliament one of the most powerful devolved Parliaments in the world. It will have extensive new powers over tax and welfare. Lord Smith has fully endorsed the Scotland Bill, stating that it meets the principles set out in the cross-party Smith Agreement. The fiscal framework remains critical to the transfer of these responsibilities and constructive discussions are ongoing between the UK and Scottish Governments to ensure that Scotland genuinely sees the benefits and bears the costs of any decisions taken by the Scottish Government.\nCommenting Mr Mundell said: “This week demonstrates beyond any doubt how Scotland benefits from being part of a strong United Kingdom where we pool resources and share risks. When we spend billions of pounds to improve our defence and security, Scotland benefits from every penny that is spent. When billions more are invested in English hospitals then Scotland gets a fair share that can be spent on the NHS in Scotland.\n“The UK Government is committed to growing our economy to create opportunities for all and to fund improvements in our security and our NHS.\n“The Scottish Parliament is about to become one of the most powerful devolved parliaments in the world. This will mean more tax and welfare decisions will be made at Holyrood. It also means that Scotland still holds on to the benefits of being part of a strong UK.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-calls-more-locally-based-policing/content_21.html": "A CUT in locally-based police officers in two areas of his constituency has been condemned by Dumfriesshire Clydesdale and Tweeddale MP David Mundell.\nHe is seeking an explanation from Police Scotland after newly published figures (2018/19) showed a downward trend in most divisions across the country.\nThe number of divisional officers in Lothian and Scottish Borders has fallen by 45 to 919 compared to 964 in 2013/14, the first available figures after the SNP Scottish government created Police Scotland.\nIn the Lanarkshire Division the number of officers has come down 56 from 1465 to 1409 over the same period.\nDumfries and Galloway Division, which covers the south of Mr Mundell's constituency, has shown a small rise of 11 in divisional officers since 2013/14 from 371 to 382.\nMr Mundell stated that while centralisation of some specialist shared services may be a factor that did not compensate for a less visible police presence at community level.\nHe said: \"A recurring and growing concern at my surgeries is that there appears to be fewer officers on the ground in our communities. That situation must be reversed.\n\"A local police presence helps prevent and detect crime whilst providing welcome reassurance to the public.\"\nMr Mundell, who plans meetings with senior divisional officers, called on the SNP Scottish government to ensure Police Scotland had resources to maintain or ideally increase community-based policing.\nPhoto Ninian Reid © https://flic.kr/p/NFbe4d",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_campaigning-mp-welcomes-which-cash-access-project/content_19.html": "LOCAL MP David Mundell has backed a new initiative by consumer body Which? to protect the UK's cash network.\nThe Dumfriesshire, Clydesdale and Tweeddale representative has a track record of championing easy availability of traditional physical currency.\nHe welcomed the launch of the campaign this week and news that thousands of retailers and other businesses had already signed up to the 'Cash-Friendly' initiative.\nSoon the Which? 'Cash-Friendly' stickers will be appearing on shop doors signalling that notes and coins will be readily accepted.\nMr Mundell, who led a debate at Westminster on preserving cash infrastructure, believed the consumer organisation's intervention would boost on-going urgent efforts to prevent the premature disappearance of cash.\nHe said: \"I know from my largely rural constituency just how important convenient cash access remains, particularly for those who are vulnerable for a variety of reasons and have difficulties making digital payments.\n\"Sadly the Covid crisis appears to have accelerated the closure of bank branches, removal of cash dispensers and a reduction in the number of businesses accepting notes and coins.\n\"This causes real hardship and adds expense because of the distance some of my constituents have to travel to reach a dispenser. In some cases they then also face transaction charges to access even a modest amount of their own money.\"\nMr Mundell added that he was eager for the Government to move forward quickly with planned legislation to provide long-term protection for cash.\nAnabel Hoult, chief executive of Which?, said: “Our cash-friendly pledge will reassure consumers who rely on cash that they won't be left behind as we make the transition to digital payments.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_figures-show-benefits-union/content_22.html": "THE PUBLISHING of the latest Government Expenditure and Revenue Statistics (GERS) provides both sides of the independence debate the chance to give their view.\nIt will come as no surprise to learn that I strongly believe the latest statistics highlight the value of Scotland being part of the United Kingdom.\nThe deficit between what Scotland raised in taxes and spent on public services was over £15 billion last year, a rise of more than £2 billion from the year before.\nThat deficit is more than what the SNP Government spend on the health service north of the border.\nWhat would First Minister Nicola Sturgeon do to fund every doctor, nurse and health worker if she was to achieve her independence goal?\nKate Forbes, SNP Finance Secretary, has now also dumped the economic case for independence.\nIf the Finance Secretary cannot argue the case on those grounds, then why should anyone believe there is one?\nThe UK Government has stepped up to support Scotland throughout this pandemic with 900,000 jobs protected by the furlough scheme, over 65,000 small businesses receiving a share of £1.8 billion worth of loans and the Scottish Government given an extra £6.5 billion through Barnett Consequentials.\nThrow in initiatives like the 'Eat out to Help Out Scheme,' VAT cuts and the job retention scheme and the UK's value has been shown like never before.\nWith recovery the priority, the SNP must start delivering on their economic plans, rather than their constant misguided 'blame Westminster for everything' independence obsession.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-condemns-sturgeon-independence-referendum-plan/content_52.html": "LOCAL parliamentarian David Mundell has urged First Minister Nicola Sturgeon to drop plans to push for another independence referendum and instead focus entirely on rebuilding from the Covid-19 pandemic\nAnnouncing her Programme for Government in the Scottish Parliament on Tuesday, Ms Sturgeon revealed that the nationalist SNP-Green administration would publish an independence White Paper with the aim of holding a referendum within the next two years.\nBut Clydesdale MP David Mundell warned that continuing to combat the pandemic, growing the economy, protecting jobs and strengthening public services like health and education should instead be the Scottish Government's only priorities.\nMr Mundell told the House of Commons during Scottish Questions on Wednesday the decision was 'shameful.'\nHe said: \"Shameful and a disgrace are words that Nicola Sturgeon likes to bandy about against her opponents but they truly apply to her announcement yesterday that, while Scotland continues to have one of the worst Covid rates in Europe, she is diverting resources into another divisive independence referendum.\"\nMr Mundell asked Scottish Secretary Alister Jack to confirm that the focus of the UK Government would be to work constructively across the UK to defeat Covid, to save jobs and to restore the economy?\nMr Jack responded: \"My Right Honourable Friend is absolutely right. Our focus is on rebuilding the economy. Our focus is on restoring our NHS and I think most right-minded Scots would agree with me that using civil service resources to design a prospectus for independence is the wrong thing to be doing at this time.\"\nLater Mr Mundell said: \"With the SNP, breaking up the United Kingdom is always top of their agenda, while the issues that really matter to people in Clydesdale are sidelined.\n“We need a Government fully committed to dealing with Covid and it’s aftermath, and they should be pouring all their effort into rebuilding Scotland. Instead, the SNP/Green Government will be distracted by trying to build a new case for independence.\n“It’s time the Scottish Government got its priorities straight, put independence to one side and concentrated on improving the quality of life of communities like ours.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_working-together-great-repeal-bill/content_14.html": "In his role as Secretary of State for Scotland, David Mundell has outlined how both the UK Government and Scottish Government's can work together on the Great Repeal Bill.\nMr Mundell outlined his hopes that the bill will gain the support of MSP's with new powers being handed to Holyrood upon departure from the EU.\nCommenting David Mundell said: “We need to ensure stability and certainty for people and businesses when powers return from the EU.\n“This Bill provides a clear and practical mechanism for doing that.\n“At present, EU rules create a consistent approach across the EU in a range of areas. The Bill will replicate these common UK frameworks created by EU law.\n“At the same time, we will discuss with the Scottish Government where we need to keep these common frameworks to make it easier to do business and protect our important internal market.\n“But where common frameworks are not required, new powers and decision-making will be transferred to Edinburgh as quickly as possible.\n\"Scotland stands to gain significant new decision-making powers as we leave the EU and our two governments must work together to deliver the new post-Brexit Holyrood.\n“Discussions will intensify now the Bill has been published and I am hopeful and confident that by the end of the process the plans will win the support of MSPs.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-welcome-600-more-return-work-furlough/content_46.html": "New figures from the UK Government show that 600 furloughed employees were able to return to work across the Dumfriesshire, Clydesdale and Tweeddale constituency during the month of June, in what has been hailed by MP David Mundell as good news for local families and the local economy.\nMr Mundell says it is welcome so many employees have returned to work as restrictions have eased, while in turn critical furlough support is still in place from the UK Government.\nThe latest statistics show that at the end of June, the UK Treasury were still protecting 1,900 jobs across the Dumfriesshire, Clydesdale and Tweeddale constituency through the furlough scheme, down from 2,500 in the previous month, while a total of 13,200 have been protected since March 2020 in the constituency.\nDavid Mundell said: “As restrictions continue to ease, it is very welcome to see more employees being able to return to work. The latest figures show that 600 more people in my constituency returned to their jobs over the month of June having been on furlough, and I hope that number will increase over the weeks and months ahead in what is good news for local families and the local economy.\n“Ever since the pandemic began, the UK Government have stepped up to protect vital jobs and livelihoods through the furlough scheme and that will continue until the end of September.\n“The crisis has shown the economic strength of the United Kingdom because, as well as the furlough scheme, the UK Government have also provided support for the self-employed and billions in business loans.\n“It is now imperative that the Scottish Government ramps up the vaccination programme so that restrictions can be further eased as planned on 9 August, which will help more and more employees safely return to work locally in the coming weeks.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_campaigning-mp-welcomes-us-suspension-whisky-and-cashmere-tariffs/content_42.html": "A MAJOR breakthrough in a long-running trade dispute which has hit whisky and cashmere industry exports to the US has been welcomed.\nDumfriesshire, Clydesdale and Tweeddale MP David Mundell says the suspension of tariffs on the American market, to allow talks to proceed, was a significant boost to south of Scotland spirit and textile exporters.\nThe former Scottish Secretary has campaigned over a lengthy period for the 25 per cent tariffs to be removed, raising the issue in the House of Commons on a number of occasions.\nThey were introduced as a penalty by the US in retaliation over what were claimed to be unfair EU subsidies to the aerospace industry.\nMr Mundell said: \"I'm delighted with the breakthrough. A four months suspension of tariffs provides space and time to try to hopefully permanently resolve the dispute as part of wider trade discussions with the US.\n\"As I've repeatedly pointed out in Parliament, it seemed strange that tariffs should be applied to whisky and cashmere products when they were nothing to do with the original dispute.\n\"These unjustified tariffs have caused huge damage to these important industries, costing the Scottish malt whisky sector over £500 million alone.\"\nMr Mundell added he was pleased with the progress as the whisky industry, in particular, had expanded and created jobs in his constituency in recent years.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-welcomes-all-big-lottery-fund-roadshow/content_51.html": "MP David Mundell welcomed representatives from voluntary organisations and good causes from across his constituency to an event with Big Lottery Fund last week.\nMr Mundell asked representatives from the Big Lottery Fund to come to his constituency and give a presentation to raise awareness about funding available.\nCommenting after the event Mr Mundell said – “I am a strong believer in voluntary action. Volunteers and community groups benefit their local areas whether by giving a spare hour or by coming to a local coffee morning. I think voluntary organisations deserve as much support as possible, which is why I was keen to organise this event today.”\nThe Big Lottery Fund have already supported some groups in his constituency (Peebles High School, Moffat Community Woodland and Eastriggs and Gretna Heritage group) but the local MP wanted to raise awareness about what is available to voluntary organisations.\nLast year Big Lottery Fund distributed around £670 million across the UK. Every time a lottery ticket is bought, just over 11 pence goes to community groups and projects that support health and education as well as environmental and charitable purposes.\nMr Mundell said after the event – “I was pleased to organise this event. I wanted to thank Cath Logan and Andrew Lindsay from the Big Lottery Fund for coming down, but also to everybody who took time out to come to the event.”\nMr Mundell is already looking to organise another event next year. If you would like to come to next year’s Big Lottery Fund roadshow, and want to make sure that you get an invite, then get in touch with his office by emailing [email protected]\nFor more information on the Big Lottery Fund, what funding is available and guidance on applying for funding, go to:https://www.biglotteryfund.org.uk/funding/funding-guidance",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_growing-strong-difficult-times/content_63.html": "THERE can be little doubt that for most of us there have been few events in our lifetime that have had such an impact on everyday life as that of the Covid-19 pandemic.\nBut, as older constituents may recall from the dark days of World War Two, this spring, amidst tragedy and concern, there has again been a pulling together of communities with a common goal of supporting each other and especially those most in need.\nOur less populated rural region has naturally not experienced the mortality count experienced in more urban parts of the country but the loss of so many loved ones has been no less painful.\nMy deepest condolences go to everyone who has lost a relative or friend as a result of coronavirus.\nThere has been nothing more poignant than seeing the rainbow symbols that have appeared in windows, often the work of children, across the constituency in recent weeks.\nThey are a symbol of our respect and admiration for the valiant efforts of all our NHS teams, carers, emergency services and the army of key workers ranging from supermarket staff to those in the transport sector.\nIn my neighbourhood in Moffat and all over the constituency, the Thursday night clapping, cheers and banging of saucepans, even sometimes accompanied by a piper, have demonstrated an overwhelming outpouring of support.\nI believe, and I certainly hope, that there will be wider appreciation of the vital roles played by many in our communities and country as a legacy of this difficult and sad period.\nProtecting people from infection must remain first priority but, in time, the lockdown, which has changed all our lives will inevitably be phased out although the exact route-map and timescale are not yet completely clear.\nIt would be difficult to overstate the challenges facing businesses and other organisations of all sizes as a result of Covid-19.\nI've spoken to many local business people and guided them on where to apply for the various financial and other support available through local authorities and Scottish Government from the unprecedented emergency funding provided by the UK Government.\nThere has also been some assistance for the third sector, which, as always, has been invaluable in providing extra services and volunteers in recent weeks.\nMy hope is that as many as possible of our local firms and the self-employed successfully get back in operation as we get through, as I'm sure we will, this difficult period.\nWhilst schools may be closed, hubs for children of key workers have been in operation, and I commend everyone involved in keeping all our essential services going.\nSadly many of the colourful community events, including the Beltane Festival, St Ronan's Games and the world famous Common Ridings, will be understandably missing this summer because of the physical distancing necessary to reduce the risk of spreading coronavirus.\nBut knowing first-hand the hard work and enthusiasm of the organisers, I feel sure most of our summer attractions will return bigger and better in 2021.\nWe live, as they say, in uncertain times, and every day seems to deliver fresh challenges but, please rest assured, if I and my team can help in anyway, please contact me on 01683-222746 or by email at [email protected]\nAnd remember the UK and Scottish Government advice ... Stay at home - Protect the NHS - Save lives!",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_Local-News/content_29.html": "MP urges local residents to sign up in support of the rural economy 1st November 2024 PLANS ANNOUNCED by the Labour government in this weeks’ Budget to cap Agricultural Property Relief risk the break-up of family farms here in Dumfriesshire... Local News\nMP calls for fuel duty freeze to be continued at Budget 21st October 2024 FUEL DUTY must remain frozen at the Autumn budget, to help keep costs down for local families and businesses. That’s the view of local Member of Parliament... Local News\nNew football training facility a winner, says MP 18th February 2024 THERE were smiles all round at the home of rural football club Symington Tinto this week. Special training sessions, matches, a buffet reception and ribbon... Local News\nBelties provide ‘beacon of comfort’ on memorial quilt 8th November 2023 ONE OF the most iconic images of Dumfries and Galloway is catching the eye of parliamentarians and visitors at the heart of Westminster. Two Belted Galloway... Local News\nCutting into a new era at world’s oldest post office 28th October 2023 ALL EYES were on the world’s oldest Post Office this week when a ribbon-cutting was staged to formally welcome new proprietors to the Upper Nithsdale attraction... Local News\nMP welcomes bridge repair breakthrough 20th October 2023 Dumfriesshire MP David Mundell has welcomed the conditional decision by Crown Estate Scotland to repair and reopen the closed Gallaberry Bridge, near Lockerbie... Local News\nForces’ charity stalwart at Downing Street reception 18th September 2023 A STALWART of a forces’ charity in the Scottish Borders was amongst guests at a special reception at 10 Downing Street last week. After a rewarding RAF career... Local News\nMP and MSP welcome securing of historic Post Office future 18th September 2023 LOCAL constituency MP and MSP David and Oliver Mundell have warmly welcomed news the future of Sanquhar Post Office has been secured. They have received... Local News\nAdvice service expansion backed by MP and MSP 22nd August 2023 AN AGENCY providing valuable guidance to families and individuals facing cost-of-living challenges is urgently seeking more volunteers. Demand for independent... Local News",
  "https_www_davidmundell_com_/https_www_davidmundell_com_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_keeping-high-uk-food-standards-secure/content_53.html": "I'M PLEASED the Government has taken steps through the creation an independent Trade and Agriculture Commission to provide additional reassurance that UK food safety and animal welfare will not be compromised.\nSignificantly, the move in advance of international trade deal negotiations, has been welcomed by all three farm unions, including NFU Scotland.\nInternational Trade Secretary Liz Truss stated that a report by the Commission members would be to advise on trade policy and applying appropriate safeguards in forthcoming UK trade deals.\nThey would also consider best ways to ensure UK farmers do not face unfair competition and how to ensure that their high animal welfare and production standards are not undermined.\nThe Commission would also advise on developing a trade policy that opens up new export opportunities for UK agriculture -- in particular for small and medium sized businesses.\nFarming and food processing are vital for the UK's future, have made a huge contribution during the Covid-19 crisis and will be equally important as we move into the recovery phase.\nWe must do our utmost to support them.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-welcomes-new-scottish-conservatives-leader/content_57.html": "LOCAL MP David Mundell has welcomed confirmation of Douglas Ross as new leader of the Scottish Conservative and Unionist Party.\nThe Dumfriesshire, Clydesdale and Tweeddale representative described the Moray MP as \"a strong and able leader -- well placed to take the party and potentially the country forward in challenging times.\"\nMr Mundell said: \"With experience at Holyrood and Westminster and a period as a junior minister at the Scotland Office, Douglas is well qualified for his new role and is widely respected by fellow politicians and in the country.\n\"Representing a rural constituency, he also has a clear understanding of issues in areas like the south of Scotland as well as the major national challenges facing the country in the months and years ahead.\n\"He has the vision and ability to lead the party into a new era and the potential after next year's Scottish Parliament elections to provide the dynamic leadership Scotland needs as we recover from the Covid-19 crisis.\n\"Douglas rightfully places jobs, the economy and providing a strong voice for ALL of Scotland as a priority, rather than too much focus by the SNP on the central belt and their obsession with weakening Scotland by splitting the United Kingdom.\n\"I'm delighted that former leader Ruth Davidson has agreed to join Douglas' frontline team and she will be a tremendous asset.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_celebrating-20-years-scottish-parliament/content_7.html": "IT IS hard to believe that the first election to the devolved Scottish Parliament was 20 years ago while, on a personal level, I've reached two decades as a parliamentarian, first in Edinburgh and then Westminster.\nI was convinced at the 1999 count that I would not be in that first historic intake of MSPs. I was Conservative candidate in the Dumfries constituency coming second to Labour and, in addition, under proportional representation (PR), was fourth on the Conservative South Scotland list.\nThe PR result calculations were delayed that night and it was only when I checked the Teletext headlines on TV the next morning that I was surprised to find there were indeed four Conservatives, including myself, elected through the regional list.\nThis was the high-point of Tony Blair's New Labour premiership and there were no Scottish Conservative MPs at Westminster. In the first sitting of the Scottish Parliament on May 12 there were 18 Conservatives amongst the 129 MSPs.\nToday, with 31 Conservative MSPs, the party are the official opposition.\nI was proud being part of that first devolved Scottish Parliament at the temporary home in the Church of Scotland General Assembly Hall at The Mound. There were huge political figures in the chamber, including Donald Dewar, Winnie Ewing, Margo MacDonald and David Steel.\nIn my own modest footnote in the Parliament's history, I asked the first question when official proceedings began. It was about rural schools. Issues, it seems, rarely change!\nConservatives have worked hard to help make the Parliament a force for good and as Scottish Secretary I've played a part in devolving additional powers.\nIt is disappointing though that SNP Ministers focus on their independence agenda, rather than directing more energy to concerns such as health, roads and education.\nScottish Conservatives, including my son Oliver, the Dumfriesshire MSP, will go into the 2021 Holyrood election looking for Ruth Davidson to be elected First Minister of Scotland. That would have been unbelievable back in 1999.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_map-locations/content_31.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_Holyrood-News/content_6.html": "MP condemns Sturgeon independence referendum plan 8th September 2021 LOCAL parliamentarian David Mundell has urged First Minister Nicola Sturgeon to drop plans to push for another independence referendum and instead focus... Holyrood News\nMP welcomes new Scottish Conservatives' leader 5th August 2020 LOCAL MP David Mundell has welcomed confirmation of Douglas Ross as new leader of the Scottish Conservative and Unionist Party. The Dumfriesshire, Clydesdale... Holyrood News\nDriver training backlog raised at Holyrood and Westminster 24th June 2020 CALLS for driving lessons and tests to resume as soon as possible in rural areas like Dumfries and Galloway have been taken to the top. Concerns about a backlog... Holyrood News\nMP welcomes SNP ministers' rethink on full-time education 24th June 2020 A CHANGE of heart by the Scottish Government in which they have agreed to consider full-time education when schools reopen in August has been welcomed by... Holyrood News\nMinisters urged to go for full-time schools return 22nd June 2020 SAFELY restoring education to our young people as we hopefully continue to emerge from the worst of Covid-19 is one of a number of challenges facing the... Holyrood News\nMP calls for more locally-based policing 8th May 2019 A CUT in locally-based police officers in two areas of his constituency has been condemned by Dumfriesshire Clydesdale and Tweeddale MP David Mundell. He is... Holyrood News\nCelebrating 20 years of the Scottish Parliament 6th May 2019 IT IS hard to believe that the first election to the devolved Scottish Parliament was 20 years ago while, on a personal level, I've reached two decades as a... Holyrood News\nTribute to Sir Alex Fergusson 31st July 2018 To me, Alex was foremost a great friend and I will miss him dearly. He was the most thoroughly decent person I have ever known. He was the absolute opposite of... Holyrood News\nDavid celebrates 20 years of devolution 11th September 2017 It is 20 years on since the Scottish people took the decision to vote for a Scottish Parliament as well as voting for that Parliament to have tax raising powers... Holyrood News",
  "https_www_davidmundell_com_/https_www_davidmundell_com_parliament/content_33.html": "Syphilis: Screening | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what steps he is taking to ensure that antenatal screening for syphilis is (a) eff\nSyphilis: Health Services | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what steps he is taking to reduce the transmission of syphilis (a) among high-risk\nSyphilis: Health Services | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what steps he is taking to help reduce syphilis diagnoses among heterosexual popul\nEnergy Grid Resilience | Commons debates I did not run the London marathon and I never will, but I am hugely admiring of all colleagues who did, and particularly my hon.\nUK Airstrike: Houthi Military Facility | Commons debates I very much welcome the statement and the action, which I fully support, and I am very pleased to hear of the level of engagement by the US.\nTopical Questions | Energy Security and Net Zero | Commons debates When I was at the Scotland Office, I was regularly lobbied by retired senior executives from the electricity industry who wanted to state th\nTopical Questions | Energy Security and Net Zero | Commons debates When I was at the Scotland Office, I was regularly lobbied by retired senior executives from the electricity industry who wanted to state th\nGlobal Fund to Fight AIDS, Tuberculosis and Malaria | Foreign, Commonwealth and Development Office | Written Answers To ask the Secretary of State for Foreign, Commonwealth and Development Affairs, what recent assessment he has made of the impact of the Glo\nGlobal Fund to Fight AIDS, Tuberculosis and Malaria | Foreign, Commonwealth and Development Office | Written Answers To ask the Secretary of State for Foreign, Commonwealth and Development Affairs, what discussions his Department is having with (a) their in\nBusiness of the House | Commons debates Recently, the Bank of Scotland announced the closure of all five of its branches in my constituency.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_cookies/content_37.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-treasury-talks-safeguard-cash-system/content_8.html": "LOCAL MP David Mundell has pressed the UK Government to move swiftly to deliver on their legislation plan to protect cash use.\nThe Dumfriesshire, Clydesdale and Tweeddale representative was meeting the Economic Secretary to the Treasury, John Glen, MP, as part of a consultation process.\nMr Mundell has been at the heart of a lengthy campaign to ensure continuing access to cash across the UK despite a significant decline in usage of traditional currency, particularly during the pandemic.\nHighlighting his large rural constituency, the former Scottish Secretary proposed that the maximum distance between cash access points should not be based purely on a straight-line calculation.\nHe is seeking a requirement within the planned Access to Cash Bill that reflects rural and urban differences and other factors.\nMr Mundell said: \"Moreover, there needs to be a recognition that a small town or large village serving a large rural area has different needs, for example, to a large village located in different geographical circumstances.\"\nThe local MP also called for the Treasury and the Department for Business, Energy and Industrial Strategy (BEIS) to work together to put the Post Office network on a more sustainable footing, highlighting branches were a vital outlet for cash transactions.\nHe said: \"The closure of some 31 branches by C. J. Lang (SPAR) in Scotland and the high turnover of postmasters, show the current model is not sustainable.\"\nMr Mundell also discussed the work of the independent Community Access to Cash Pilot Board, comprising bank, businesses and customer representatives, with whom he had recently held a meeting with the chairwoman.\nIt is trialing various ways of providing public access to cash and banking services in areas with no or little bank branch access and has set up experimental banking hubs in communities across the UK, including Cambuslang, South Lanarkshire.\nMr Mundell commented he was encouraged by his latest meeting with the Treasury and he would like to see legislation brought forward as soon as possible for the significant part of the population, some vulnerable, who depend on ready access to notes and coins.\nHe added: \"As we hopefully emerge from the worst of Covid, I think it is also important to remind the public that extensive research has shown that cash remains safe to use and there is no evidence of it spreading the virus.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-seeks-climate-change-conference-dividend-south-scotland/content_47.html": "EFFORTS should be made to encourage south of Scotland communities to play a part in a major global climate change conference later this year.\nThat's the call from Dumfriesshire, Clydesdale and Tweeddale MP David Mundell ahead of the United Nations Climate Change Conference (COP26) in Glasgow from November 1 to 12.\nThe former Scottish Secretary says he wants to see engagement with community groups and businesses in his constituency and beyond so maximum benefit from the event reaches grassroots level.\nHe said this week: \"I'm delighted the UK Government is hosting the climate change conference so close to our area. It could be one of the most significant so far with far-reaching decisions being made which could effect the future of our planet.\n\"From my perspective, as a local MP, I also wish to ensure that our communities have the opportunity to play a part in some way, whether it is school projects, highlighting local climate-friendly initiatives or taking up business opportunities.\"\nWorld leaders, national delegations, officials, media, security teams and other interest groups are expected to converge on Scotland for the high-profile event focused on the SEC Centre.\nMr Mundell highlighted the possibility that the local hospitality industry, hopefully by then recovering from the impact of Covid-19, could benefit from the overflow of visitors attending the conference and fringe events.\nSpeaking in a COP26 debate at Westminster recently, Mr Mundell described the potentially high level of interest in his constituency.\nHe cited, as examples, the passion that was clear in an online discussion on climate change in which he participated at the invitation of the Peebles-based Tweed Green group and praised a small hydro scheme he was supportive of run by Keir, Penpont and Tynron community trust, near Thornhill.\nMr Mundell told fellow MPs: \"Each and every one of us owns climate change. Each and every one of us makes a difference, and if we exclude members of the public -- if they do not feel part of this event, and it feels distant and remote from them -- we are not going to achieve that.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-welcomes-snp-ministers-rethink-full-time-education/content_34.html": "A CHANGE of heart by the Scottish Government in which they have agreed to consider full-time education when schools reopen in August has been welcomed by Tweeddale MP David Mundell.\nHe had earlier called on Holyrood Ministers to think again over proposals for pupils to attend school only on a part-time basis with the rest of their learning carried out at home.\nUntil now local authorities were preparing to split the school week with only half of pupils attending at any one time.\nMr Mundell last week took up the issue on behalf of parents in his constituency concerned about the impact the greatly reduced in-school week would have on their children's education and prospects.\nParents also warned of the logistical nightmare they would face if they were unable to fulfil work commitments after the lockdown in order to care for their children at home.\nBut the local MP yesterday described the reversal announced on Tuesday by Scottish Education Secretary John Swinney as the best decision for children, their parents and the economy.\nMr Mundell said:\n\"I'm pleased the Scottish Government has finally responded to pressure and that the proposed review will look at full-time education whilst still including stringent measures to safeguard the health of pupils.\n\"Fortunately there seems to have been some progress in suppressing coronavirus and relaxing the two-metres rule, an option under consideration, seems a logical and sensible way forward.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_new-football-training-facility-winner-says-mp/content_2.html": "THERE were smiles all round at the home of rural football club Symington Tinto this week.\nSpecial training sessions, matches, a buffet reception and ribbon-cutting ceremony were part of official opening celebrations for showpiece new 3G floodlit pitches.\nA game-changing £400,000 award from the UK Government helped secure the all-weather artificial grass surface.\nOther major large backers included the SSE Clyde Wind farm and SFA Grassroots Pitch and Facilities Fund.\nThe spacious site at the village of Symington, at the foot of Tinto Hill, near Biggar, has been home to the football club for more than seven decades.\nGetting into the spirit of the event on Monday, local MP David Mundell and Scotland Office Minister John Lamont tried out the new surface and scored a few goals bringing a smile to the faces of young onlookers.\nMr Lamont also cut a celebratory ribbon watched by other guests, footballers and Symington Tinto AFC officials.\nAs well as the senior team, the spacious ground is also home to eight youth teams.\nMr Mundell praised the volunteer committee and coaches for their efforts in taking the project forward, adding the improvements were a major boost to the sporting infrastructure network across Dumfriesshire, Clydesdale and Tweeddale.\nHe said: “This is a fantastic facility and I gather from some of the local footballers it is an excellent place to improve all-round health and fitness with good coaching, combined with the inspiring sight of Tinto Hill on the horizon.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news/content_24.html": "MP urges local residents to sign up in support of the rural economy Friday, 1 November, 2024 PLANS ANNOUNCED by the Labour government in this weeks’ Budget to cap Agricultural Property Relief risk the break-up of family farms here in Dumfriesshire, Clydesdale and Tweeddale and across the rest of the UK. That’s the view of local MP David Mundell as rural bodies including the National Farmers Union and the Tenant Farmers’ Association warn that it has been “a been a disastrous budget for... Local News\nMP calls for fuel duty freeze to be continued at Budget 21st October 2024 FUEL DUTY must remain frozen at the Autumn budget, to help keep costs down for local families and businesses. That’s the view of local Member of Parliament... Local News\nNew football training facility a winner, says MP 18th February 2024 THERE were smiles all round at the home of rural football club Symington Tinto this week. Special training sessions, matches, a buffet reception and ribbon... Local News\nBelties provide ‘beacon of comfort’ on memorial quilt 8th November 2023 ONE OF the most iconic images of Dumfries and Galloway is catching the eye of parliamentarians and visitors at the heart of Westminster. Two Belted Galloway... Local News\nCutting into a new era at world’s oldest post office 28th October 2023 ALL EYES were on the world’s oldest Post Office this week when a ribbon-cutting was staged to formally welcome new proprietors to the Upper Nithsdale attraction... Local News\nMP welcomes bridge repair breakthrough 20th October 2023 Dumfriesshire MP David Mundell has welcomed the conditional decision by Crown Estate Scotland to repair and reopen the closed Gallaberry Bridge, near Lockerbie... Local News\nForces’ charity stalwart at Downing Street reception 18th September 2023 A STALWART of a forces’ charity in the Scottish Borders was amongst guests at a special reception at 10 Downing Street last week. After a rewarding RAF career... Local News\nMP and MSP welcome securing of historic Post Office future 18th September 2023 LOCAL constituency MP and MSP David and Oliver Mundell have warmly welcomed news the future of Sanquhar Post Office has been secured. They have received... Local News\nAdvice service expansion backed by MP and MSP 22nd August 2023 AN AGENCY providing valuable guidance to families and individuals facing cost-of-living challenges is urgently seeking more volunteers. Demand for independent... Local News\nWelcome for new protections on free access to cash 18th August 2023 NEW PLANS set out by the UK Government will help ensure that people and businesses are no more than three miles away from the ability to withdraw or deposit... Local News",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_Speeches/content_13.html": "Sir Alex Fergusson Memorial Service 17th August 2018 MY TRIBUTE TO SIR ALEX FERGUSSON Alex took great pleasure in winding me up about the party function where I gave a vote of thanks that lasted longer than his... Speeches\nDavid speaks at Conservative party conference 2nd October 2017 Dumfriesshire, Clydesdale and Tweeddale MP David Mundell once again called on Nicola Sturgeon to take the threat of independence off the table as he spoke at... Speeches\nDavid speaks at Conservative conference in Glasgow 8th March 2017 David Mundell's speech to the Scottish Conservative and Unionist Party conference on Saturday March 4, SECC, Glasgow “Thank you very much – I’m absolutely... Speeches\nDavid says the UK is Scotland's vital union in conference speech 5th October 2016 Dumfriesshire, Clydesdale and Tweeddale MP David Mundell says the bond of the United Kingdom is more important than ever as he spoke to the Conservative Party... Speeches\nDavid Mundell: The Case for Scotland in the European Union 15th June 2016 Local MP David Mundell has set out the case why Scotland and the United Kingdom are better off remaining part of the European Union ahead of the referendum on... Speeches\nLocal MP addresses Conservative Party Conference 29th September 2014 Dumfriesshire, Clydesdale and Tweeddale MP David Mundell spoke at the Conservative party conference in Birmingham this week. Speeches",
  "https_www_davidmundell_com_/https_www_davidmundell_com_contact/content_15.html": "If you would like me to help with an issue or want to know my views on a particular issue then please feel free to get in touch.\nI would like to be kept up-to-date by David Mundell on future issues that matter to me:",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_Westminster-News/content_3.html": "MP appointed UK Trade Envoy to New Zealand 22nd August 2021 LOCAL MP David Mundell has been appointed to a key role in helping increase trade between the UK and New Zealand. The former Scottish Secretary was today... Westminster News\nMP in Treasury talks to safeguard cash system 2nd August 2021 LOCAL MP David Mundell has pressed the UK Government to move swiftly to deliver on their legislation plan to protect cash use. The Dumfriesshire, Clydesdale and... Westminster News\nMP welcome as 600 more return to work from furlough 31st July 2021 New figures from the UK Government show that 600 furloughed employees were able to return to work across the Dumfriesshire, Clydesdale and Tweeddale... Westminster News\nMP leads calls to further boost nutrition through international aid 1st July 2021 David Mundell MP has this week called for further action to fight malnutrition as part of the UK’s ongoing commitment to international development programmes... Westminster News\nCampaigning MP welcomes Which? cash access project 13th May 2021 LOCAL MP David Mundell has backed a new initiative by consumer body Which? to protect the UK's cash network. The Dumfriesshire, Clydesdale and Tweeddale... Westminster News\nMP seeks climate-change conference dividend for south of Scotland 29th March 2021 EFFORTS should be made to encourage south of Scotland communities to play a part in a major global climate change conference later this year. That's the call... Westminster News\nLocal MP backs UK exports drive 15th March 2021 MORE than two thousand jobs across Dumfriesshire, Clydesdale and Tweeddale are partly supported through exports. This was revealed in figures from Fraser of... Westminster News\nCampaigning MP welcomes US suspension of whisky and cashmere tariffs 4th March 2021 A MAJOR breakthrough in a long-running trade dispute which has hit whisky and cashmere industry exports to the US has been welcomed. Dumfriesshire, Clydesdale... Westminster News\nMP welcomes Chancellor's Budget measures 4th March 2021 TODAY'S Budget is good news for Dumfriesshire, Clydesdale and Tweeddale, according to local MP David Mundell, as the country continues to fight the pandemic and... Westminster News",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_Articles/content_16.html": "Local MP visits Malawi and Mozambique 26th February 2016 Local MP David Mundell visited Malawi and Mozambique earlier this month in his role as Secretary of State for Scotland. Mr Mundell promoted opportunities for... Articles\nMP celebrates work of Prince's Trust with Carol Vorderman 10th February 2016 David Mundell met with Carol Vorderman MBE at the House of Commons this week to celebrate the 40th anniversary of the Prince's Trust. Articles\nNew Year, New Start 13th January 2016 It's a new year and a new start for local MP David Mundell. Articles\nDavid Mundell welcomes progress on CAP payments 7th January 2016 Dumfriesshire, Clydesdale and Tweeddale MP David Mundell has welcomed the progress on the allocation of convergence money from the Common Agricultural Policy... Articles\nMundell welcomes Chancellor's Spending Review 25th November 2015 Local MP David Mundell has today welcomed the Chancellor’s spending review and autumn statement setting out how the UK Government will deliver security... Articles\nLocal MP addresses Conservative Party Conference 12th October 2015 Dumfriesshire, Clydesdale and Tweeddale MP David Mundell spoke to delegates at the Conservative Party Conference in Manchester last week, on our United Kingdom. Articles\nMP welcomes all to Big Lottery Fund Roadshow 5th October 2015 MP David Mundell welcomed representatives from voluntary organisations and good causes from across his constituency to an event with Big Lottery Fund last week. Articles\nDumfriesshire MP visits land restoration project 25th September 2015 Dumfriesshire MP, David Mundell, visited land resotration project in Upper Nithsdale recently. Articles\nMundell calls for rural Oscar nominations 21st September 2015 Local MP, David Mundell, has called for nominations for this year’s Scottish Rural Awards. Articles",
  "https_www_davidmundell_com_/https_www_davidmundell_com_events/content_35.html": "Skip to main content\nMain navigation\nAbout David\nNews\nSurgeries & Events\nIn Parliament\nContact\nFuture Events\nSorry, we haven't got any upcoming events.\nPlease check back soon to see future events.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_coronavirus-covid-19/content_49.html": "THERE can be few topics dominating conversations more just now than Coronavirus (COVID-19) and that looks certain to remain the case in the weeks and months ahead.\nI've been reassured by the strategy implemented to deal with the outbreak by leading experts working with public representatives at various levels of Government. I would particularly like to commend those responding to the crisis from the frontline agencies, including the NHS, care organisations, local authorities and emergency services.\nThis is a fast-changing situation and I would urge constituents to keep up-to-date with the latest official advice and follow that guidance as closely as possible. This guidance can found found on the various web pages below.\nhttps://www.nhs.uk/conditions/coronavirus-covid-19/\nhttps://www.nhsinform.scot/coronavirus\nhttps://www.gov.uk/government/topical-events/coronavirus-covid-19-uk-government-response\nhttps://www.gov.scot/coronavirus-covid-19/\nAs I've mentioned before, there is great community spirit in all towns, villages and rural neighbourhoods across Dumfresshire, Clydesdale and Tweeddale and our actions should be focused in doing our utmost to protect those most at risk, particularly older people and those with underlying health risks.\nLocal Authorities are working closely with, NHS boards, the Scottish and UK Governments, and are following guidance developed and reviewed by an experienced pool of specialist advisors.\nWhilst we all hope the number of those self-isolating or requiring complex treatment for Coronavirus complications at any one time does not climb too sharply in the coming days, there are clearly massive challenges ahead in such areas as medicine, care and education.\nMore widely the public and private sector are adapting to this difficult, but temporary, situation and I anticipate that new ways of working will evolve to keep businesses and the economy functioning.\nThere has been a wide a range of support measures put in place and I stand ready to do my utmost to assist constituents with any specific issues that arise.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_david-celebrates-20-years-devolution/content_39.html": "It is 20 years on since the Scottish people took the decision to vote for a Scottish Parliament as well as voting for that Parliament to have tax raising powers.\nReflecting on the vote, David Mundell MP and Secretary of State for Scotland said: “The Scottish Parliament is now part of everyday life in Scotland, and that’s the real achievement, the real change. Twenty years ago that parliament didn’t exist, so the votes cast on 11 September 1997 have made a real difference to life in Scotland.\n“Within what is a relatively short time in Scotland’s long history, the Scottish Parliament has become an established feature of everyday life; taking really important decisions that affect us all, including on health, education and transport.\n“The Scottish Parliament is the most powerful devolved Parliament of its type anywhere in the world. The challenge now is to use those powers for the benefit of the people of Scotland.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_European-News/content_12.html": "Working together on Great Repeal Bill 13th July 2017 In his role as Secretary of State for Scotland, David Mundell has outlined how both the UK Government and Scottish Government's can work together on the Great... European News",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_making-difference-0/content_61.html": "I would like to take this opportunity to praise the work of all those on our local coronavirus frontline be they NHS, key workers or in the wider care community.\nThey truly are going above and beyond in these difficult times.\nI'd also like to mention all the individuals, volunteers, emergency services, local authority staff and businesses working so hard in different ways to make a positive difference.\nSadly, a number of people locally have lost their lives due to Covid-19 and my thoughts are very much with their relatives and friends.",
  "https_www_davidmundell_com_/https_www_davidmundell_com/content_1.html": "Latest News MP urges local residents to sign up in support of the rural economy PLANS ANNOUNCED by the Labour government in this weeks’ Budget to cap… MP calls for fuel duty freeze to be continued at Budget FUEL DUTY must remain frozen at the Autumn budget, to help keep costs down for… New football training facility a winner, says MP THERE were smiles all round at the home of rural football club Symington Tinto… Find me on Facebook Find me on Twitter Contact David Mundell CONSTITUENCY OFFICEMonro House, Duncan Drive, Moffat, DG10 9JW01683 222 746[email protected]David on FacebookDavid on TwitterDavid on Instagram Constituency See David's activity in the constituency.\nMP urges local residents to sign up in support of the rural economy PLANS ANNOUNCED by the Labour government in this weeks’ Budget to cap…\nMP calls for fuel duty freeze to be continued at Budget FUEL DUTY must remain frozen at the Autumn budget, to help keep costs down for…\nNew football training facility a winner, says MP THERE were smiles all round at the home of rural football club Symington Tinto…",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_new-year-message-david-mundell-mp/content_30.html": "WHEN I wrote my 2020 New Year's message few of us realised that we were so close to a global health emergency which would transform all our lives.\nThe last 10 months have been dominated by coronavirus which, despite the welcome development of a vaccine, will likely remain a concern for some time.\nDifficult times, however, bring out the best in people and I have been impressed and heartened by how our local communities have come together in adversity.\nIt is a great privilege live in and to represent Dumfriesshire, Clydesdale and Tweeddale where stoicism and compassion have long been evident.\nThis has been one of my busiest periods as a parliamentarian and has included helping hundreds of constituents, businesses and organisations by providing information, making contacts and, where possible, facilitating practical support.\nMy thoughts remain with those who have lost loved ones to Covid-19 or who have been touched in other ways, such as the impact on jobs, businesses and general wellbeing.\nI wish to praise the dedication of our frontline NHS staff, care community, emergency services and the army of key workers across the public and private sectors who have worked away, often in extremely difficult circumstances.\nObviously, the arrival of a vaccine so quickly was a great achievement and I hope the roll-out goes smoothly locally and nationally, so we can put the pandemic behind us, with the key task then rebuilding the economy.\nI hope the Borderlands Growth Deal I championed as Scottish Secretary can play a significant part in that by creating new jobs and businesses locally.\nFrom a political perspective the Scottish Parliament elections are due on May 6. I’ve no idea what form the campaign will take but hope there will be some opportunity to get out and about and meet people. It's that personal contact I’ve missed most this year.\nI wish everyone a Happy and, above all, Healthy New Year!",
  "https_www_davidmundell_com_/https_www_davidmundell_com_biography/content_26.html": "David was born in Dumfries and grew up in Wamphray, where his mother ran the Red House Hotel, and in Lockerbie, where he went to school. He lives in Moffat and has three grown up children, who all attended Moffat Academy.\nAs a student, he was a councillor in Annandale and Eskdale for two years and on Dumfries and Galloway Council until 1987. He trained as a lawyer, working as a solicitor before joining BT as Group Legal Adviser for Scotland and subsequently Head of National Affairs. He was the Conservative candidate for the Dumfries Constituency in the first Scottish Parliament elections in 1999 and was elected to represent the South of Scotland Region. David asked the very first question in the newly created Parliament and chose to raise issues affecting rural schools.\nHe served as an MSP until he was first elected for Dumfriesshire, Clydesdale and Tweeddale at Westminster in 2005. A well-known community campaigner, David has led a number of successful campaigns including improving train services at Lockerbie Station and has spoken out on regeneration of rural areas, road improvements and better broadband and mobile phone reception. Since first being elected David has held over 1000 advice surgeries including an annual surgery tour. David played a key role in negotiating the Edinburgh Agreement, which set out the terms that enabled the independence referendum to take place. David remains actively involved in a number of community groups and charitable organisations, recently becoming a Dementia Friend.\nFrom 2015 to 2019, David was honoured to serve in both David Cameron’s and Theresa May’s Cabinets as Secretary of State of Scotland. As Secretary of State he oversaw the implementation of Growth Deals worth over £1.3bn to Scotland, while continually making the case for the Union and Scotland’s place in it.\nDavid remains committed to safe-guarding Scotland’s place in the United Kingdom and standing up for local communities in Dumfriesshire, Clydesdale, and Tweeddale.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_david-mundell-welcomes-progress-cap-payments/content_23.html": "Dumfriesshire, Clydesdale and Tweeddale MP David Mundell has welcomed the progress on the allocation of convergence money from the Common Agricultural Policy (CAP).\nIn his role as Scottish Secretary, Mr Mundell met with representatives from NFU Scotland as well as the Agriculture Minister George Eustice in London on Thursday January 7.\nMr Mundell believes now that the new CAP policy is being implemented, there doesn’t need to be any delay in the promised review of funding.\nCommenting Mr Mundell said: “This was a very productive meeting with NFUS Scotland and the Agriculture Minister and I am confident a review of the funding can be completed by the end of this year.\n“NFU Scotland have made their voice loudly heard on this issue and with further consultation, fair allocation for Scotland and the whole of the UK in terms of payments can be found.”\nAt the meeting, repatriation of red meat levy money was also discussed with the Minister with NFU Scotland urging the Government to bring in the necessary legislation changes required to bring about the implementation.\nMr Mundell added: “In line with the Smith Commission, there is a determination to reach a resolution on this long standing issue that NFU Scotland have rightly raised on a regular basis.\n“The agriculture minister will now look at bringing the repatriation of red meat levy money into legislation.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-calls-fuel-duty-freeze-be-continued-budget/content_18.html": "FUEL DUTY must remain frozen at the Autumn budget, to help keep costs down for local families and businesses.\nThat’s the view of local Member of Parliament David Mundell, who has joined more than 70 other MPs in writing to the Chancellor to urge her to consider the impact of a rise in fuel duty on low-income families, small businesses and the logistics industry.\nConcerns have been rising over recent weeks that the fuel duty freeze which has been in place for the past 14 years may be ended by the new Labour government, with some forecasts suggesting it could rise by up to 7p a litre after the Budget.\nCommenting, David Mundell MP said: “Fuel duty is a huge issue particularly in rural areas like ours. The duty freeze kept in place for the past 14 years has helped hold down, as much as possible, the cost of filling up at the pumps against a background of global unrest and volatile oil prices.\n“Obviously because of those international factors fuel prices have indeed often continued to rise, with the freeze helping curb any increases. But there is a real danger that is now about to change, with the new Labour government refusing to commit to continuing the fuel duty freeze.\n“The added burden an increase in fuel duty would place on local motorists is why I put my name to a letter to the Chancellor last week urging her to at least maintain the existing freeze.\n“Analysis by FairFuelUK suggests the impact on family finances, if duty were to be increased by 5p, would be to add £160 to annual fill-up costs, with running a commercial van costing around an extra £500 a year. Hauliers would face a punitive extra £5,000 a year.\n“Many local people, particularly in rural and more remote areas, have no choice but to use their car for work, getting to school, shopping, accessing essential services and visiting loved ones.\n“That’s why I am strongly opposed to any increase in fuel duty at the coming budget and why I will continue to make the case to the Chancellor and government that the needs of local motorists must be taken fully into account.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_new-year-new-start/content_43.html": "New Year, new start! I have already set out my political priorities for the year and now I am setting out my personal one. Having taken one of the most important decisions of my life and resolved to come out publicly as gay in 2016, I just want to get on with it, and now, just like that, I have said it. How can it be both so easy and so hard to say a few short words?\nIn the end, it took just a couple of taps on a keyboard, yet at some points, in my mind, it was going to be harder than standing for election, speaking in the House of Commons or being cross-examined on television. I still cannot fully rationalise such feelings, but I know they are not uncommon, particularly in men of my age. Of course, everybody who gets to this point, has had their own journey. I have certainly been on mine - conflicting emotions, of doubts and fears, but ultimately positive and uplifting, with an unstoppable direction of travel. Over time, I came to understand that, for me, the only way to be truly happy on a personal level is to acknowledge in public as well as in private, who I am.\nI so admire the many people, young and old, who are doing this every day, uncertain of the reaction. I have been very fortunate and couldn’t have had more love and support from my family and friends. However, making this public is something I have had to do myself. I don’t know what the wider reaction will be, but I know it’s the right thing for me to do.\nOther than the intensely personal and positive difference it makes to me, and the way I can live my life, my hope is that my coming out doesn’t change anything else about how I go about my work or how people treat me. Gender and sexuality should make no difference whether you are a Cabinet Minister or in any other walk of life and I hope that I can, in my own way, reinforce that message.\nDavid Mundell MP",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-pays-tribute-prince-philip/content_55.html": "Dumfriesshire, Clydesdale and Tweeddale MP David Mundell has expressed sadness at Prince Philip's passing.\nHe said: \"He was a remarkable man who provided a tremendous support to Her Majesty the Queen and, like her, had a remarkable perspective on global events built up over many decades of public service.\n\"Prince Philip was a huge supporter of rural life and has been a regular visitor to my constituency both accompanying The Queen on official visits and during events at Drumlanrig Castle when pursuing his passion for horse-carriage driving.\n\"Amongst many interests, he was keen in encouraging young people to make the most of themselves and many locally have benefitted from participating in the Duke of Edinburgh's Award programmes.\"\nMr Mundell added: \"Prince Philip's sometimes mischievous personality and dry sense of humour, although occasionally controversial, also endeared him to many.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mundell-calls-rural-oscar-nominations%E2%80%8F/content_41.html": "Local MP, David Mundell, has called for nominations for this year’s Scottish Rural Awards.\nThe Scottish Rural Awards celebrate excellence in the Scottish Countryside, and aim to highlight hard work, innovation and deciation of people who run rural businesses. Nominations are considered by experts over a nine month process, with the awards ceremony taking place at Dynamic Earth in Edinburgh in March 2016.\nLocal MP David Mundell said – “The Scottish Rural Awards are a chance to nominate some of Scotland’s favourite rural businesses, and I think we’ve got some great examples of rural businesses locally.\n“We’ve had some great entries in the past, but the South of Scotland has so much to offer and I wanted to make sure that we have some great entries again this year.”\nFor more information on the Scottish Rural Awards go to: http://www.scottishruralawards.org/\nThe criteria for this year’s nominations can be found at: http://www.scottishruralawards.org/wp-content/uploads/2015/09/Scottish-Rural-Awards-Complete-Award-Criteria.pdf\nFor details on last year’s winners see: http://www.scottishruralawards.org/2015-winners/",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-urges-local-residents-sign-support-rural-economy/content_4.html": "PLANS ANNOUNCED by the Labour government in this weeks’ Budget to cap Agricultural Property Relief risk the break-up of family farms here in Dumfriesshire, Clydesdale and Tweeddale and across the rest of the UK.\nThat’s the view of local MP David Mundell as rural bodies including the National Farmers Union and the Tenant Farmers’ Association warn that it has been “a been a disastrous budget for family farmers, and especially tenant farmers” and that the capping of relief is “a shameless breaking of clear promises on Agricultural Property Relief will snatch away the next generation’s ability to carry on producing British food, plan for the future and shepherd the environment.”\nAgricultural Property Relief (APR) has been one of the most important means of allowing working farm businesses to be passed to the next generation of farmers.\nNow a campaign has been launched to oppose the new cap on ARP and convince the Labour government to change course and drop what has been branded as the ‘Family Farm Tax.”\nDavid Mundell MP said:\n“This is a very heavy blow to the farming industry and risks undermining the tradition of family farms being passed on to the next generation, along with the lifetime of experience which has been built up.\n“The Chancellor’s tax raid on farming will cause the break-up of family farms, undermine the UK’s ability to meet environmental commitments, and presents a direct challenge to the future of tenant farming where larger let estates may now have to consider disposals to remain within new property relief limits.\n“It shows we now have a government which fundamentally doesn’t understand the realities of the rural economy here in Dumfriesshire, Clydesdale and Tweeddale and across the rest of the country, and apparently doesn’t have much respect for it either.\n“I urge everyone who wants to protect our rural economy locally to sign the campaign petition at: https://www.stopthefarmtax.com and make sure the Government knows how much we value our farming industry.”\nENDS.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_parliament-changing-better/content_38.html": "ONE OF the consequences of Parliament having to adapt to coronavirus is the increased use of video technology which I have been arguing for now for sometime and I hope will still be a part of proceedings after this crisis is over.\nI’ve been able to ask questions and participate in committee meetings from my office in Moffat and along with other MPs ensure we have some form of Parliamentary scrutiny. Electronic voting is also being tested, but many MPs still have reservations about that.\nOf course, there was always glitches in the system, like when two weeks ago, I got stuck in what’s called the 'Zoom waiting room' when I was due to be asking the Prime Minster a question.\nBut I still remain positive about what technology can do to make our democracy more accessible and am sure we will see it used more after this crisis.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_david-speaks-conservative-party-conference/content_45.html": "Dumfriesshire, Clydesdale and Tweeddale MP David Mundell once again called on Nicola Sturgeon to take the threat of independence off the table as he spoke at the Conservative Party conference in Manchester.\nMr Mundell, who took to the stage as Secretary of State for Scotland also used his speech to call on the UK and Scottish Governments to work together in order to achieve the best Brexit deal.\nThe full text is below:\n“Good morning, conference.\nIt’s a pleasure to be back at conference, in this great powerhouse city of Manchester.\nEvery conference is a chance to share ideas, reflect on our achievements and look ahead.\nThat’s the main business of conference, and there will be lots to say this week.\nBut it’s also a chance to renew acquaintances and catch up with old friends.\nI hope to be doing some of that too.\nI’m glad to say conference has never been a lonely time for me - though, as Scotland’s only Conservative MP for more years than I care to mention, it could have been.\nYou all know the old joke (and thanks for reminding us yesterday, Ruth…)\n“There are more pandas in Scotland than Tory MPs.”\nNow, quite why a Chinese bear should have been adopted as the unit of measurement for Conservative success in Scotland, I’m at a loss to explain.\nBut it stuck. And I had to grin and bear it.\nNo more, conference.\nThat gag has well and truly been consigned to the dustbin of comedy history.\nHopefully, along with Alex Salmond’s one man Edinburgh Festival Fringe show.\nHow Nicola Sturgeon must wish she could dump Alex’s Benny Hill impressions in the same trash can.\nDitching a worn out old joke is a great feeling, Nicola. I can heartily recommend it.\nThe election on June 8 saw the election of 12 more Scottish Conservative MPs.\nIt has been a great pleasure to see so many talented new colleagues take their place at Westminster.\nI congratulate you all – you fought tooth and nail for those seats and I was so proud to see you win.\nFor that, there are three thank yous.\nFirst, of course, to all of you here – and to the many activists in Scotland who couldn’t join us.\nThese last 20 years have seen some dark times for us as a Party in Scotland.\nBut you put in the hours, knocked on the doors, dropped the leaflets – often for no return at all.\nYou have kept me in my seat.\nYou have kept us in the game, even when we couldn’t field a full team.\nAnd our success in the last few years has only been possible because of your steadfast support.\nSo on behalf of the Scottish Conservatives, let me say a sincere thank you.\nSecond, of course, I need to thank our Prime Minister, Theresa May.\nLet’s remember, back in March, Nicola Sturgeon was determined to plunge our country into another damaging and divisive independence referendum.\nBut faced with her unwanted demand, Theresa said simply and firmly: “Now is not the time.”\nWithout that clear decision, Scotland would be facing the prospect of an independence referendum as early as a year from now.\nJust imagine that.\nThe Prime Minister’s message was exactly what we all wanted to hear.\nIt was the message most Scots wanted to hear.\nIt was the message that won us 12 more seats in Scotland and secured our comeback.\nAnd I also have to thank Ruth Davidson.\nWe don’t have an “Oh, Ruth Davidson” song. But maybe we should…\nHer tireless energy and fearless determination have driven us on to our best General Election result for 35 years.\nWe are now the dominant party in the North East of Scotland and across the South.\nBut let me tell you today – this is just the start.\nOur come back doesn’t stop here.\nOur MSPs are working hard to build the policies and the platform for even greater success in the Scottish Parliament elections of 2021.\nAnd our new MPs have set to work in London to show the value of sending Conservatives down south.\nRuth’s speech yesterday was inspiring.\nShe spoke passionately about our remarkable Union (and I know it’s a theme our excellent Secretary of State for Wales, Alun Cairns, will pick up later in this session.)\nIt’s something we all agree on, something that goes to the heart of what makes us Conservatives.\nBut Ruth also showed a way forward for Scotland – on education, housing, the economy and more.\nPeople are asking if we have reached “peak Ruth” in Scotland.\nAll I can say is this: the people asking that don’t know Ruth as well as we do.\nSo watch out, Nicola.\nPeople are weary of the SNP: their obsession with the tired arguments of the past, their neglect of the day job.\nLet us send out a message across Scotland loud and clear.\nWE are focused on the day job.\nWE have the ideas.\nWE are the party of the future.\nThe arrival of a dozen new Scottish Conservative MPs not only buried a long-running joke, it confirmed something Ruth has been saying for a long time now.\nScotland is NOT the SNP.\nThe myth was all too easy for the nationalists to peddle when they held 56 of Scotland’s 59 seats.\nBut no longer.\nIt was never true and the election proved it.\nIndeed, the election showed just how badly out of touch Nicola Sturgeon is with public opinion.\nScotland’s First Minister…\nInstead of addressing the declining standards in Scotland’s schools…\nInstead of tackling the pressures and missed targets that dog Scotland’s NHS…\nInstead of building our way out of Scotland’s growing housing crisis…\nInstead of doing all those things…\n…Nicola Sturgeon subjected Scotland to a year of political game-playing as she sought to turn the EU referendum into an excuse for a second independence poll.\nI’m glad the election result finally forced her to put her constitutional campaign on hold.\nBut for how long?\nNicola Sturgeon is already saying she “doesn’t know” when she wants to hold another referendum.\nNot if. When.\nAnd Pete Wishart has started offering advice. (You know you are in trouble when that happens.)\nLast week, the Honourable Member for Twitter urged her to delay until after the 2021 Holyrood election – only to deny that’s what he meant.\nConfused?\nWho isn’t?\nThe truth is this.\nFor the SNP, it will always be about securing another independence referendum.\nBut we’ve had one - only three years ago.\nIt was a tough campaign but both sides respected the democratic process and agreed to respect the result.\nMost Scots do not want to return to the old arguments they settled in 2014.\nIt’s time Nicola Sturgeon ruled out a second independence referendum - clearly and unambiguously - so Scotland can get on with what really matters.\nI hope she takes the opportunity to do so at her party’s conference in a few days’ time.\nIf she won’t, we will.\nNo-one else.\nWeek in week out we see Scottish Labour flip-flopping on the constitution.\nThe way to guarantee the threat of a second independence referendum is taken off the table once and for all is to install Ruth Davidson as Scotland’s First Minister.\nConference, I’m very pleased to be addressing this session on the economy.\nBecause improving Scotland’s economic performance is at the heart of addressing the issues that really matter to people.\nThere have been encouraging signs.\nIn August, employment reached a record high while unemployment remained close to a historic low.\nBut we face real challenges, and it serves no-one to brush them under the carpet.\nGrowth lags behinds the UK as a whole, with the Scottish economy expanding by just 0.7 per cent over the past year, compared with 2.0 per cent for the UK as a whole.\nAnd the Scottish Government’s latest annual Government Expenditure and Revenue in Scotland figures have revealed a deficit of £13.3billion, or 8.3 per cent of GDP – more than three times the UK figure of 2.4 per cent.\nThese issues cannot be ignored.\nIndeed, with Holyrood now responsible for raising half the money it spends, it is more important than ever that we see higher growth and healthier tax revenues.\nWe want to build a Scotland that works for everyone.\nWe want a Scotland that is a fairer place to live and work.\nTo achieve that, the reality is that Scotland’s two governments must work together.\nAcross the UK, we are taking a balanced approach to our economy.\nWe are dealing with our debts to keep the economy strong, while investing in key public services and keeping taxes low.\nBut the Scottish Government’s powers over tax, economic development, infrastructure, education, and training mean they too hold many key levers for driving growth.\nIt makes sense for us to pull in the same direction and we’ve evidence of what we can achieve when we do.\nOur UK City Deals, backed by more than £1billion of new UK Government spending, have now been agreed or committed to for all of Scotland’s seven cities.\nThey are genuine partnerships between the UK and Scottish governments, local authorities and the business community - and they promise to transform our regional economies over the next few years.\nFrom rolling out broadband and investing in our Armed Forces…\n…to backing business with low taxes and developing a modern, UK-wide Industrial Strategy…\n…WE are using the levers we have to support jobs and help businesses grow.\nBut I would urge the Scottish Government to use their powers more effectively.\nMaking Scotland the most highly taxed part of the UK – and hinting of widening the gap even further – cannot be the right approach.\nThey must do more to provide the homes our young people need…\n…to restore our education system to its once proud position among the world’s best…\n…and to improve our transport links.\nWe also need to work together to make Scotland Brexit-ready.\nWe have put forward a common sense approach to leaving the EU.\nWe know businesses and individuals need certainty and stability.\nOur laws, rules and regulations must function on the day after Brexit just as they do now.\nWe will need common frameworks - just as we have now - to protect our vitally important UK internal market.\nBut we will also add to Holyrood’s responsibilities, as decision-making powers return from Brussels.\nThat’s what our approach will deliver – and I urge the Scottish Government to continue to work with us on these issues.\nNow is not the time for conjuring constitutional grievances.\nNow is the time for working together, constructively, as the people of Scotland expect from their two governments.\nIt is time, too, for the Scottish Government to lift their eyes above and beyond the Brexit process and consider future opportunities.\nI have just returned from a visit to Paraguay and Argentina.\nI was there to bang the drum for Scottish exports – and not just whisky.\nParaguayans may be the biggest whisky drinkers in the world - but I had the honour of launching a beer there, Innis & Gunn, brewed in Edinburgh.\nIn Argentina I met with oil executives who were keenly aware of the expertise we have in Aberdeen.\nI visited the HQ of Aggreko, based in Glasgow, and with a major operation in South America.\nOn the wall of their control centre is a row of clocks showing the time in the main territories where they operate.\nNot labelled London, New York, Paris…\n…but Buenos Aires, Dubai – and Glasgow.\nIt was a powerful symbol of the links we already have and the potential to do more.\nThese are countries that are open for business and which have deep historical ties to Scotland.\nLasting ties.\nI learned, for example, that football was first played in Argentina in 1838 at the St Andrew’s Scottish School in Buenos Aires, still one of the country’s leading schools.\nThat’s quite an export.\nI was disappointed the SNP chose to criticise my visit, so my message to them today is this:\nFor the good of the country we both govern - enough of the point scoring.\nWe have to work together, Scotland’s two governments, on getting Scotland Brexit-ready.\nConference,\nThe people of Scotland sent a clear message in June.\nThey do not want the divisive, grievance-fuelled constitutional politics of the past.\nThey want politicians who are 100 per cent focused on the day job, pulling together and delivering for Scotland on the biggest challenges we face in the future:\nWorking together, strengthening the economy and preparing to seize the opportunities ahead.\nThose are our priorities.\nThat is our focus.\nDelivering for communities.\nDelivering for businesses.\nDelivering for families.\nThat’s the job we were elected to do.\nThat’s the job we’ll get on with.\nScottish Conservatives – delivering for Scotland.”",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_mp-celebrates-work-princes-trust-carol-vorderman/content_59.html": "David Mundell met with Carol Vorderman MBE at the House of Commons this week to celebrate the 40th anniversary of the Prince's Trust.\nMr Mundell attended a reception which highlighted the success of the Prince's Trust over the last four decades, a period in which they have helped 825,000 young people into jobs, education and training.\nMr Mundell met with Ms Vorderman who has been a Trust ambassador for the last 20 years and said: \"I was delighted to meet Carol Vorderman to help celebrate 40 years of the Prince's Trust helping young people across the country.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_events_feed/content_62.html": null,
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_dumfriesshire-mp-visits-land-restoration-project%E2%80%8F/content_44.html": "Local MP David Mundell visited the Crawick Muiltiverse, a major land restoration and art project, last week. The £1 million restoration that opened in July, and employs 12 people from the Upper Nithsdale area, was designed by Charles Jencks.\nAfter being shown round the former open cast mine, commenting Mr Mundell said – “The Crawick Multiverse project is a hidden gem, which has transformed a former open cast coal mine, into a real tourism benefit for the area.\nI was so pleased to be shown round. This is a great project that employs local people from the surrounding communities. A large part of the roles will include liaising with the local community groups to ensure people from in and around Upper Nithsdale benefit from the remarkable new resource – whether for school visits, community group trips or special events, and really worth a visit.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_driver-training-backlog-raised-holyrood-and-westminster/content_40.html": "CALLS for driving lessons and tests to resume as soon as possible in rural areas like Dumfries and Galloway have been taken to the top.\nConcerns about a backlog in learning driving skills and gaining licences because of Covid-19 restrictions have been raised at Westminster and Holyrood.\nDumfriesshire MP David Mundell and constituency MSP Oliver Mundell have raised the issue on behalf of local driving instructors at ministerial level\nThe driver training industry is concerned that there is little sign of a lifting in restrictions, despite approaches to the Driver and Vehicle Standards Agency.\nIn a letter to UK Transport Secretary Grant Shapps, David Mundell outlined the impact the paralysis was having in his large rural constituency.\nHe stated in such country area vehicles were a necessity, not a luxury as was the ability to drive.\nIn some cases, Mr Mundell pointed out, his constituents were being hindered in gaining work and accessing services.\nHe said: \"I ask you to consider special provisions for driving tests and lessons to restart in rural areas as soon as possible, subject to reasonable precautions.\"\nMr Mundell added that such steps could help open up the economy and help revive communities.\nMeanwhile, at the Scottish Parliament, Dumfriesshire MSP Oliver Mundell asked the Scottish Transport Secretary Michael Matheson when he expected driving lessons to resume.\nThe Minister replied that driving tests had been ceased across the UK until further notice, with the exception of emergency tests for critical workers, but the issue was being kept constantly under review.\nMr Matheson said: \"This will be in line with maintaining physical distancing and suppressing the spread of the coronavirus.\"\nHe added: \"The timing of the resumption of driving tests is reserved to the UK Government, but any resumption of tests would have to be in line with the Scottish route map out of lockdown.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_about-rss/content_25.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_ministers-urged-go-full-time-schools-return/content_54.html": "SAFELY restoring education to our young people as we hopefully continue to emerge from the worst of Covid-19 is one of a number of challenges facing the Scottish Government.\nMinisters at Holyrood are looking to local authorities to introduce a 'blended' mix of learning, some digital, both at home and in school, whilst maintaining social distancing and other precautions.\nI've been contacted by parents deeply concerned about the part-time nature of the proposals both from the point of view of a negative impact on children's education and the disruption to their own working lives and household budget.\nI agree that a much more ambitious approach needs to be drawn up before the schools return in August and I am supporting a national online campaign advocating a greatly expanded in-school element to any plans.\nLocal authorities are currently looking at part-time options for when classes resume, as few as two days a week in some age-groups.\nNaturally parents' main worry is ensuring children of all ages are safeguarded from coronavirus and I'm sure that is everyone's priority.\nBut plans for as few as a couple of days in school each week, for what could be a lengthy period ahead, very much represent a second class education in many parents' eyes.\nWe all must accept these are difficult times.\nHowever, most of those who contacted me genuinely believe their children's prospects are being damaged and a more creative approach should be applied to ensure our young people receive as near as possible a full-time education in school.\nThere are other options. For example, I believe greater use could be made of newly qualified teachers, retired staff and supply teachers.\nWhilst many schools, particularly in rural areas, have spare space, where that is not the case there may be other options such as portable buildings, ideally located on the school campus.\nCommunity buildings, such as public or church halls, have been suggested although with strict health and safety inspections required and other considerations, I understand that is not always as straightforward a concept as one would expect, at least in the shorter term.\nIt is important that the Scottish Government ensures local authorities have the funds in place to safely increase children's in-school education at the earliest possible date.\nWe need to be ambitious, whilst accepting, that, if the virus figures spike again, we must scale back these measures.\nHowever, children's hopes and aspirations are being damaged by the prolonged shutdown of normal schooling and that must be swiftly addressed.\nIt is not good to keep young people cooped up in the house and deny them more face-to-face education with teachers and the opportunity to socialise with their peers.\nResuming full-time education also eases the logistical nightmare facing working parents. It allows them to get back to their employment or business and will reduce the long-term damage to the economy which also threatens serious social consequences.\nI understand the First Minister's caution during this difficult period but many believe she has been too slow to get detailed plans for schools in place and left local authorities without proper guidance.\nParents wishing more to be done to allow pupils to resume full-time education earlier than proposed can make their views known through an online campaign, promoted by the Scottish Conservatives, which seeks a more fuller return of Scotland's schools in August.\nIt is available online at https://action.scottishconservatives.com/back-to-school/",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_category_Speeches-in-Parliament/content_27.html": "Let's work together on Brexit 13th November 2017 Scottish Secretary David Mundell has reiterated his opposition to a second independence referendum, and urged the Scottish Government to concentrate on working... Speeches in Parliament",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_local-mp-backs-uk-exports-drive/content_9.html": "MORE than two thousand jobs across Dumfriesshire, Clydesdale and Tweeddale are partly supported through exports.\nThis was revealed in figures from Fraser of Allander Institute research commissioned by the UK Department for International Trade, which is aiming to increase post-Brexit export-driven economic growth.\nThere is already an estimated 6.5 million jobs nationally linked to overseas trade with more than two thousand in the local Westminster parliamentary constituency.\nThe study findings published this week indicate export-related jobs tend to be as much as 21-per-cent more productive and seven-per-cent better paid than many focused purely on the domestic market.\nEfforts are being stepped up in a bid to expand UK exporting worldwide, increase new jobs potential and help fuel economic recovery as the country emerges from Covid-19.\nTextiles, wholesale, fishing, whisky, aquaculture, manufacturing, quarrying, service industries, financial and accountancy are areas of export activity in Dumfriesshire, Clydesdale and Tweeddale (DCT).\nLocal MP David Mundell said: \"I have some successful very long-established exporters in my constituency but the Board of Trade, through their new report Global Britain -- Local Jobs, plan to encourage more companies to enter, or further develop, sales to overseas markets.\n\"I'm keen to ensure that local enterprises, seeking to expand through exporting, can take full advantage of any advice and support available from the UK Government. This would be good for jobs and the local economy.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_privacy/content_36.html": "This document outlines how David Mundell processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is David Mundell\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact David Mundell .\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of David Mundell , or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact David Mundell via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_local-mp-visits-malawi-and-mozambique/content_56.html": "Malawi and Mozambique are facing current challenges but have bright long term futures if the right decisions are taken now. That's my view, after short visits to both countries this month. Mozambique has seen a rise in internal political tensions and violence, whilst in Malawi, drought followed by floods, has led to a food crisis. The UK Government had already given £10million to support those affected and I was able during my visit to announce a further £4.5million to help those most in need.\nThe focus of my visit to the Mozambiquian capital of Maputo, was to help develop the links between Aberdeen and the fledgling gas industry there. Gas reserves found off the coast could make Mozambique the world’s third largest gas producer and present huge opportunities for businesses from Scotland. Discussions were encouraging and it is hoped a formal agreement will be signed later this year. The High Commissioner kindly hosted a reception for me and it was amazing to hear the skirl of the bagpipes in the African night and see scenes from Macbeth performed in her garden.\nMalawi has strong links to my constituency, through schools and hospitals. I was delighted to get the chance to visit again. I had formal meetings with the President and Vice President as well as the Speaker of the Parliament, other political leaders and businesses. I have been a supporter of the Scotland- Malawi Partnership and so it was great to meet up with its sister organisation the Malawi Scotland Partnership, which promotes links to Scotland in Malawi.\nLooking to the future, I chaired a lively video link up between the Scottish Youth Parliament and aspiring young politicians in Malawi. Although the population of Malawi is very young, the young politicians feel their voice is underrepresented in their Parliament.\nEducation is obviously key to the Malawi’s future. I helped launch phase 3 of the British Council’s Connecting Classrooms project which as the name suggests links up schools in Malawi with schools in the Uk, many here in Scotland. Teacher exchanges are an important part of the programme and it was great to meet Malawian teachers like Boneface Chilongo who felt they had benefitted so much from coming to Scotland\nMary’s Meals is a great charity that many local people support and I was not only pleased to see for myself their project at Phuti Primary School, I was humbled by the warmth of the welcome I received. From the welcoming posters the children had drawn for me to singing and cooks, who prepare the food, to the little girl who recited a poem for me, I was really moved.\nWhat was clear from the teachers, the local elders and the pupils themselves that having a meal at school really helps not just encourage children come to school but, with full stomachs, makes their time there much more productive. The UK Government is matching funds raised by Mary’s Meals themselves and after visiting Phuti primary I am even more sure it's money well spent.\nI also visited a health centre and a family planning facility supported by our aid. The latter is always harrowing with so many people looking for help. It always gives me perspective on any complaints we have about our NHS, but again UK Aid is making difference, particularly in providing much needed drugs or, like at the clinic I visited, a purpose built pharmacy store.\nSo, of course, the challenges in Africa remain great and there aren't simple solutions, but our country and ourselves can make a difference. I hope in my own small way I have done so.",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_david-says-uk-scotlands-vital-union-conference-speech/content_32.html": "Dumfriesshire, Clydesdale and Tweeddale MP David Mundell says the bond of the United Kingdom is more important than ever as he spoke to the Conservative Party Conference in Birmingham.\nMr Mundell, speaking in his role as Secretary of State for Scotland as the conference celebrated the United Kingdom also said that there would be a Team UK approach to the Brexit negotiations.\nHis full speech is below.\n\"It is an honour to have the chance to address you all, once more, as the Conservative and Unionist Secretary of State for Scotland.\n\"And I’d like to thank both Lord Dunlop and David Morris, my PPS, for their hard work and support.\n\"Our new Prime Minister spoke for all of us that day in July on the steps of Downing Street.\n\"We are the Conservative and Unionist Party.\n\"I believe with all my heart in the preservation of the Union. It is indeed a ‘precious, precious bond’. And that bond has never been more important.\n\"Because it will be the strong, stable, broad shoulders of the UK that will carry our country through the coming years.\n\"We can’t and won’t provide a running commentary on exiting the EU. But I want to be absolutely clear.\n\"We will negotiate as the United Kingdom, leave as the United Kingdom, and face the future together as the United Kingdom. A Team UK approach.\n\"Because the UK is Scotland’s vital union.\n\"Earlier this year, we passed the Scotland Act 2016. This devolves new powers on tax and spending that will see Holyrood become the most powerful devolved parliament in the world.\n\"We have delivered the Smith Commission in full and I am hugely proud to have taken the legislation successfully through the UK parliament.\n\"As these powers come in, the Scottish government will have new freedom to cut taxes or to raise them. To attract businesses in or drive them away. To trap people on benefits or support them into work.\n\"I may not like that the SNP want to tax families and businesses by £1 billion more than in England – but that is their choice and they will have to account for it to the Scottish people at the ballot box.\n\"The Scottish government will have unprecedented power and freedom to govern Scotland’s affairs.\n\"But, crucially, Scotland will retain the benefits of the UK’s broad shoulders.\n\"It is the Chancellor and the UK Treasury that can guarantee the future of Scotland's European Structural and Investment Funds projects. For Scotland, that will be worth on average £200 million every year until we leave.\n\"It is the UK’s balance sheet that keeps borrowing rates at historic lows when the Scottish Government’s deficit balloons to almost 10%.\n\"It is the UK’s pooled risk that means the Scottish Government can increase spending by over 3% when their tax revenues fall by over 5%.\n\"The UK is investing in City Deals like Glasgow, Aberdeen, and Inverness.\n\"The UK has delivered the biggest boost to the oil and gas industry in over 20 years.\n\"The UK has introduced the National Living Wage.\n\"And as we look to EU exit, remember that Scotland trades over four times more with the rest of the UK than with the EU.\n\"This is a bedrock of support that can only come from being part of the UK.\n\"Now the new powers are a huge opportunity for the Scottish government.\n\"But so far the SNP have put their obsession with independence above all else.\n\"They’ve abandoned the day job – and Scotland is paying the price.\n\"They spend their time doom-mongering about Brexit and using it as an excuse to threaten a second independence referendum.\n\"That is not what the people of Scotland want. It is a Sword of Damocles – the single biggest threat to Scotland’s economy.\n\"The SNP need to stop pursuing their own ideological agenda and start governing.\n\"They think they have a divine right to hold power and not to be held to account.\n\"We know they don’t.\n\"And they now have Ruth Davidson and her fantastic team of 30 MSPs to prove it.\n\"The Scottish Conservatives had a stunning result in May – and I want to thank everyone here who knocked on doors, made the calls, delivered the leaflets. It was a fantastic effort.\n\"We overtook Scottish Labour as the main opposition.\n\"Not surprising when you heard Jeremy Corbyn’s speech in Liverpool. He didn’t mention Kezia Dugdale. He didn’t mention Scottish Labour. He didn’t even mention the Union. The only thing he did mention was the Glasgow City Deal project that we actually put £500m into.\n\"I’m telling you, the Labour party cannot be trusted with the Union.\n\"Now, every day in Holyrood, it is Ruth and the Conservatives holding the SNP to account.\n\"So we are now a strong opposition at Holyrood and a strong government in Westminster.\n\"Together, we are standing up for the Union.\n\"For its people who are working hard and just managing.\n\"For those with a job but no job security.\n\"For those whose very start in life, whose skin colour, whose sex, whose poverty have denied them the opportunities enjoyed by the privileged few.\n\"And we do this because we are driven by a simple vision.\n\"A United Kingdom that supports anyone, whoever they are, to go as far as their talents will take them.\n\"That is what this government and this Party are about – and it is a privilege to play my part.\"",
  "https_www_davidmundell_com_/https_www_davidmundell_com_news_challenging-times/content_17.html": "SADLY, across the constituency, and beyond, coronavirus and the lockdown continue to dominate all our lives. My thoughts are, like those across the political spectrum, with Prime Minister Boris Johnson and his partner Carrie, in his battle with the disease.\nMy deepest sympathy goes to those who have lost a relative or friend as a result of the outbreak or have had their lives touched in other ways by this dreadful global pandemic.\nIt was moving last week that so many local people clapped, supporting doorstep tributes, in towns and villages to honour NHS staff, carers, pharmacy staff and the army of other individuals helping deal with the infection.\nAlso worthy of praise are frontline council workers, those in transport, supermarket and other essential sectors such as the volunteers helping deliver essential goods to vulnerable people being shielded or in self-isolation at home.\nElsewhere, companies like Cochran at Annan are on call round-the-clock to maintain or provide boiler equipment at key NHS sites, other firms in the constituency are doing their bit to manufacture much-needed supplies and, of course, media workers, like the DnG team at Annan, are working hard to keep us informed.\nMeanwhile, many local events, including Dumfries Show, have understandably been cancelled and so it will be a very different summer ahead, but I remain confident that all our local events will be back, bigger and better next year.\nWe still have a long way to go on our Covid19 journey and new issues are cropping up daily. If you think I can be of help in any way please contact me by email at [email protected] or call 01683 222746."
}