{
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_wearitpink-campaign/content_11.html": "Recently, I joined fellow MPs in wearing it pink to encourage people across the UK to get involved and support those affected by breast cancer.\nEvery year 50,000 women are diagnosed with breast cancer in the UK, and sadly around 11,500 women and 80 men will lose their lives to the disease.\n#wearitpink raises close to £2 million for Breast Cancer Now each year which helps to fund world-class research. This research is aiming to tackle the disease from all angles, to ensure that, by 2050, everyone that develops the disease will live.\nAnyone can take part in #wearitpink, whether at work, at home or at school. This year the event will take place on Friday 21 October, all you have to do is wear something pink and donate what you can. For more information or to register, visit www.wearitpink.org.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_hs2/content_19.html": "On this section of my website you can read about the latest news concerning HS2 as well as more about the work that I am doing to support those who are affected by the route.\nWhere do I stand on HS2? I believe high speed rail lines should follow existing transport corridors. I think there is a good argument for a high speed rail network as a better and greener transport option than short-haul flights, which would free up scarce landing slots at our airports for flights to long-haul destinations we can reach no other way, but I think HS2 would be better routed along motorways or railway lines we already have, not across open Warwickshire countryside.\nI promised to argue for this when I was elected in 2010 and I have done so. I also promised to devote time and energy to the detail of HS2 and I have kept that promise too. I have worked with individuals affected and action groups set up to campaign against HS2 and of course continue to do so. The challenge now is to minimise the disruption which the construction phase of the project will cause and I am working with Councillors and Community groups to achieve that.\nIf you think that I might be able to assist you with issues relating to HS2, please click here to get in touch.\nHS2 Ltd has developed a website with more information about HS2 in Warwickshire:\nhttps://www.hs2.org.uk/in-your-area/local-community-webpages/hs2-in-warwickshire/",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_transport-questions/content_29.html": "On Thursday during Transport Questions, I asked the Minister of State for Transport what steps he is taking to help ensure those adversely affected by HS2 are compensated fairly.\nThe full Hansard entry for my speech can be accessed here\nOn Thursday during Transport Questions, I asked the Minister of State for Transport what steps he is taking to help ensure those adversely affected by HS2 are compensated fairly.\nThe full Hansard entry for my speech can be accessed here",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_construction-commissioner/content_20.html": "The High Speed Two (HS2) Independent Construction Commissioner’s role is to provide independent decisions and mediate, between the project and individuals or bodies, in unresolved disputes about HS2 Phase One construction work.\nFor more information, go to: https://www.gov.uk/government/collections/hs2-independent-construction-commissioner",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_hs2-natural-england-licenses/content_37.html": "Skip to main content\nMain navigation\nHome\nAbout Jeremy\nNews\nIn Parliament\nHS2\nContact\nHS2 Natural England Licenses\nTweet\nOn this section of my website, please find details of Natural England Licenses and Reports.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_victory-europe/content_17.html": "Eighty years ago on 8 May 1945, Victory in Europe (VE) Day marked the end of the Second World War in Europe, a moment of collective relief and jubilation after nearly six years of devastating conflict. In London, over a million people flooded the streets, celebrating beneath Union Flags, whilst the King and Prime Minister addressed the nation. Yet amid the celebrations, there was mourning too for the millions lost, the families fractured and the lives changed forever.\nThis year marks the eightieth anniversary of that historic day. It is a poignant milestone that could likely be among the last major anniversaries where we can honour living veterans of the war. Across our nation and the Commonwealth, communities are gathering in remembrance and gratitude. From tea dances and commemorative services to parades and moments of reflection, these events are not merely ceremonial but are acts of collective memory.\nOver the coming days, I will have the privilege of attending several such gatherings in our local area, which will feature the lighting of beacons to symbolise the ‘light of peace’ that emerged from the darkness of war, and the ringing of church bells in remembrance of the celebrations eight decades ago. Across the country, communities will be taking part in similar acts of remembrance, coming together to honour the past and preserve the stories and values that have shaped our shared history.\nThe significance of VE Day extends beyond historical remembrance. It serves as a reminder of the resilience and unity that can emerge from adversity. In light of contemporary political and economic challenges, the spirit of VE Day inspires us to uphold the principles of freedom, democracy and peace. By engaging in these commemorations, we not only honour those who served but also reaffirm our commitment to the values they fought to protect.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_parkinsons-uk-parliamentary-drop-2025/content_5.html": "Recently I met representatives of Parkinson’s UK during their Parliamentary Drop-in Briefing to discuss how we can tackle this condition.\nOn World Parkinson’s Day it’s important to highlight the work they do to help those who live with this terrible condition. Parkinson’s is the fastest growing neurodegenerative condition in the world and affects around 153,000 people in the UK, predicted to reach 172,000 people by 2030.\nUntil a cure is found, the work of charities like Parkinson’s UK is critical, offering a wide range of services and advice for those living with the condition and the wider communities.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_meeting-daniel-eite/content_10.html": "I have recently had the opportunity to meet Kenilworth resident, Daniel Eite, to discuss his plans to become the first British man in history with Tourette’s to summit Mount Everest. He is also hoping to become the first British disabled man in history to summit 2, 8,000m peaks in one season.\nAt our meeting, Daniel explained that he has suffered with Tourette’s since the age of 10 and this has affected all aspects of his life through childhood, and into adulthood. He wants to show not only the people in our local area, but the world, that someone like he can change the world, and inspire millions to chase their dreams in changing their lives for the better.\nDaniel’s Grandad inspired him to climb Mount Everest and he is hoping to raise a minimum of £100,000 for Alzheimer's based charities. He is also supporting a charity that aims at getting young people away from knife crime and gang culture.\nFurther information about Daniel and his expedition can be found here: Linktr.ee/danieleite",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_safer-internet-day-2025/content_7.html": "Today is Safer Internet Day – an initiative to raise awareness about online safety and how we can better protect people in the digital space.\nThe internet is a powerful tool that connects us, provides access to vital information, and can offer critical support to those in need. However, it also presents real risks. A 2017 study found that harmful online content was linked to over a quarter of all suicides in young people. This is deeply concerning, and it is why organisations like the Samaritans are calling for stronger protections online.\nI have long believed that freedom of speech should be freedom for everyone, but those exposed to harmful content or relentless abuse online are not enjoying that freedom, and regulation has a role to play in restoring it. The Online Safety Act was a significant step forward, but we must continue to strike the right balance between online freedoms and the protections necessary to keep people safe.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_a46-closure-hs2-construction/content_26.html": "Closure Details\n- Duration: 19 days (with a three-week window)\n- Start: 8 PM, Friday, April 11, 2025\n- End: 6 AM, Thursday, May 1, 2025\n- Contingency Date: Friday, May 16, 2025 (only if needed)\n- Location: A46 near Kenilworth, between Stivichall Interchange (Festival Island) and Thickthorn Island\n- Access Restrictions: No access from B4115 Ashow Road at Chesford Grange junction to protect residents.\n- Post-installation: Lane restrictions in both directions until July 31, 2025, for final works.\n- More Information: hs2.org.uk/A46-box-structure",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_visit-thwaites-0/content_8.html": "Last week I met the team at Thwaites, where I had the opportunity to see their impressive new factory facility – a strong sign of their continued commitment to local manufacturing and jobs. With over 80 years in the area, its exciting to see the business growing and looking to the future.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_birmingham-airport-visit/content_25.html": "I was delighted to tour Birmingham Airport and hear its plans for the future, including a new air-rail link to HS2 and an updated passenger security facility set to be delivered by June 2024. The airport is a significant contributor to the local economy, supporting 34,400 jobs and £2.1 billion in economic activity by 2033.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_accessibility/content_4.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_parliament/content_33.html": "Electoral Commission: Freedom of Information | Speaker's Committee on the Electoral Commission | Written Answers The Electoral Commission responded to the internal review request on 30 April.\nClause 1 - Sentencing guidelines about pre-sentence reports | Sentencing Guidelines (Pre-sentence Reports) Bill | Commons debates I think—in gratitude to all those who have spoken—that we have got to a place where the Minister has told the House that there is some terri\nClause 1 - Sentencing guidelines about pre-sentence reports | Sentencing Guidelines (Pre-sentence Reports) Bill | Commons debates I take on board the Minister’s warning, and I am not sure whether this will make it any better.\nClause 1 - Sentencing guidelines about pre-sentence reports | Sentencing Guidelines (Pre-sentence Reports) Bill | Commons debates I accept that the Minister is trying to give us clarity, so for the purposes of clarity is it the Government’s view that all personal charac\nClause 1 - Sentencing guidelines about pre-sentence reports | Sentencing Guidelines (Pre-sentence Reports) Bill | Commons debates It is worthwhile at the outset of all debates on this Bill to restate that it is about pre-sentence reports that give information to sentenc\nClause 1 - Sentencing guidelines about pre-sentence reports | Sentencing Guidelines (Pre-sentence Reports) Bill | Commons debates My hon.\nClause 1 - Sentencing guidelines about pre-sentence reports | Sentencing Guidelines (Pre-sentence Reports) Bill | Commons debates Yes, I think the right hon.\nClause 1 - Sentencing guidelines about pre-sentence reports | Sentencing Guidelines (Pre-sentence Reports) Bill | Commons debates I beg to move amendment 1, page 1, line 6, leave out “different personal characteristics of an offender” and insert “an offender’s membershi\nIrish Republican Alleged Incitement | Commons debates I know that the Minister will agree that part of the service that my right hon.\nIrish Republican Alleged Incitement | Commons debates I know that the Minister will agree that part of the service that my right hon.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_reopening-a46/content_18.html": "Tweet Wednesday, 30 April, 2025 Articles I was pleased to learn that last night, the A46 between Kenilworth and Coventry reopened.\nVictory in Europe Friday, 2 May, 2025 Eighty years ago on 8 May 1945, Victory in Europe (VE) Day marked the end of the Second World War in Europe, a moment of collective relief and jubilation after nearly six years of devastating conflict.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_about-jeremy/content_28.html": "My parents were both teachers. My brother and I went to the local primary school, and then I won a scholarship to Taunton School. From there, I went on to read Law at Exeter University.\nAs a family, we were not party political, but we always talked about current affairs, so I became interested in politics.\nAfter university I pursued a career in the law because I had always wanted to be an advocate. I have always derived great satisfaction and a sense of fulfilment from helping someone to make their case, but I began to think how much better it would be if, rather than just representing one person as a barrister, I could represent thousands of people as their Member of Parliament.\nThat led to me seeking selection as a prospective parliamentary candidate for the Conservatives. I was delighted to be chosen to represent the party in Rugby and Kenilworth in 2003 and even more delighted to win the seat back from Labour in 2005. Following a Boundary Review, I have been elected as MP for Kenilworth and Southam in 2010, 2015, 2017, 2019 and 2024.\nIn Opposition, I was a member of the Justice Select Committee, and I founded the All-Party Parliamentary Group (APPG) on Dementia. I chaired the group until 2010, when my appointment to the Government, as a Whip, meant that I could no longer continue in this role.\nIn 2012 I was appointed to the position of Parliamentary Under-Secretary of State at the Ministry of Justice with responsibility for the prison service, probation, rehabilitation and sentencing.\nIn the Government reshuffle in July 2014, I was promoted to be Attorney General, chief legal adviser to the Government. The role also oversees the Crown Prosecution Service, the Serious Fraud Office and Her Majesty’s Crown Prosecution Service Inspectorate.\nI then served as Secretary of State at the Department for Digital, Culture, Media and Sport from 9th July 2018 until the new Prime Minister took office on 24th July 2019.\nFrom November 2019 to November 2022, I was a member of the Committee on Standards in Public Life.\nI was knighted in the Queen’s 2022 Birthday Honours for political and public service.\nI chaired the APPG on Digital Regulation and Responsibility from November 2019 - July 2024 and was a member of The Intelligence and Security Committee of Parliament (ISC) from February 2022 to May 2024. I returned to serving on the Committee in December 2024 and am now its Deputy Chairman.\nI served as Shadow Attorney General from July 2024 to November 2024 and since November 2024 I serve as Deputy Chairman of the Speaker’s Conference on the safety of Candidates and MPs, as a member of the Speaker’s Committee on the Electoral Commission and of the Steering Group on AI in Parliaments. I have also been appointed to the House of Commons Panel of Chairs.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_my-appearance-politics-midlands/content_9.html": "In case you missed it, I was on BBC Politics Midlands this weekend discussing changes to local government, flooding and the West Midlands Pension Fund. You can watch it back here:\nEighty years ago on 8 May 1945, Victory in Europe (VE) Day marked the end of the Second World War in Europe, a moment of collective relief and jubilation after nearly six years of devastating conflict.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_his-royal-highness-prince-philip-duke-edinburgh/content_30.html": "His Royal Highness the Duke of Edinburgh lived a life of great service to this country. All our thoughts and sympathies will be with Her Majesty the Queen, to whom he has been a source of immense support for many decades, and with the rest of the Royal Family.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_cdn-cgi_l_email-protection/content_31.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk/content_1.html": "Victory in Europe 2nd May 2025 Read full article HS2 Reopening of A46 30th April 2025 Read full article My Map London Marathon 2025 27th April 2025 Read full article Am I your MP? Enter your postcode Postcode",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_contact/content_13.html": "The quickest way to get in touch with me is to send a message by completing the form below.\nIt is also helpful if you provide a contact telephone number.\nI would like to be kept up-to-date by Jeremy Wright on future issues that matter to me:",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_happy-easter-1/content_27.html": "Victory in Europe Friday, 2 May, 2025 Eighty years ago on 8 May 1945, Victory in Europe (VE) Day marked the end of the Second World War in Europe, a moment of collective relief and jubilation after nearly six years of devastating conflict.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_surgeries-0/content_21.html": "I have regular surgery appointments available for constituents.\nI want to stress that, whatever the problem is, my team and I will try to help in any way that we can. Where we cannot or unable, we will be transparent and honest.\nIf you would like to a request an appointment, please email me at [email protected] or contact my office on 01926 853650.\nStrict Parliamentary protocol states that I can only deal with constituents of Kenilworth and Southam, so please include your full name, address (including postcode) and contact details in the email. Please also include details of the issue you would like to discuss. This will all be kept fully confidential.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_category_Articles/content_3.html": "Victory in Europe 2nd May 2025 Eighty years ago on 8 May 1945, Victory in Europe (VE) Day marked the end of the Second World War in Europe, a moment of collective relief and jubilation after... Articles\nReopening of A46 30th April 2025 I was pleased to learn that last night, the A46 between Kenilworth and Coventry reopened. Articles\nLondon Marathon 2025 27th April 2025 I wish the best of luck to all my constituents participating in the London Marathon today, whether you're running for a cause, a loved one, or the challenge. Articles\nHappy St. George's Day 23rd April 2025 Happy St. George’s Day to all my constituents in Kenilworth and Southam. Articles\nSteel Industry (Special Measures) Bill 17th April 2025 Last Saturday, Parliament was recalled to debate the future of UK steelmaking. While there’s wide agreement that action is needed to protect virgin steel... Articles\nMeeting with Daniel Eite 16th April 2025 I have recently had the opportunity to meet Kenilworth resident, Daniel Eite, to discuss his plans to become the first British man in history with Tourette’s to... Articles\nVisit to UKBIC 15th April 2025 This week I visited UKBIC to learn more about how they help companies develop new battery technologies for the automotive and other markets. I also sought... Articles\nParkinson's UK Parliamentary Drop-In 2025 11th April 2025 Recently I met representatives of Parkinson’s UK during their Parliamentary Drop-in Briefing to discuss how we can tackle this condition. On World Parkinson’s... Articles",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_about-constituency/content_14.html": "The constituency of Kenilworth and Southam is geographically one of the largest in the West Midlands.\nThe constituency forms a 'donut' encircling Warwick and Leamington and was created for the 2024 election from parts of the oversized constituencies of Rugby, Warwick and Leamington, and Stratford and covers mostly rural and semi-rural parts of the local government districts of Rugby, Warwick and Stratford.\nIts largest town is Kenilworth, with a population of around 23,000. The only other town in the constituency is Southam.\nIt covers many villages though, including Chessetts Wood, Lapworth, Lowsonford, Kingswood, Deppers Bridge, Harbury, Knightcote, Northend, Temple Herdewyke, Ratley, Little Kineton, Kineton, Radway, Bishop's Itchington, Lighthorne, Lighthorne Heath, Gaydon, Wasperton, Wellesbourne, Ashorne, Moreton Paddox, Moreton Morrell, Upper Tysoe, Middle Tysoe, Lower Tysoe, Whatcote, Oxhill, Butlers Marston, Combrook, Hatton Green, Hatton, Shrewley, Little Shrewley, Baddesley Clinton, Rowington, Rowington Green, Stoneleigh, Baginton. Ashow, Leek Wootton, Five Ways, Beausale, Cubbington, Ryton-on-Dunsmore, Bubbenhall, Hampton on the Hill, Hampton Magna, Ufton, Barford, Norton Lindsey, Sherbourne, Burton Green, Priors Marston, Priors Hardwick, Ladbroke, Farnborough, Wormleighton, Fenny Compton, Shotteswell, Warmington, Avon Dassett, Willoughby, Flecknoe, Broadwell, Napton on the Hill, Stockton, Cawston, Draycote, Thurlaston, Grandborough, Dunchurch, Birdingbury, Leamington Hastings, Long Itchington, Bourton on Dunsmore, Frankton, Princethorpe, Stretton-on-Dunsmore, Marton, Nuthurst, Finwood, Bushwood, Rookery, Holywell, High Cross Chesterton, Chesterton Green, Arlescote, Burton Dassett, Little Dassett, Knowle End, Edgehill, Sun Rising, Walton, Chadshunt, Newbold Pacey, Haseley, Great Pinley, Oldfield Pinley Green Stareton, Wroxall, Haseley Knob, Haseley Green, Hill Wootton, Bascote Heath, Lower Norton, Littleworth, Marston Doles, Stoneton, Nethercote, Lower Shuckburgh, Sawbridge, Chapel Green, Kites Hardwick, Hill, and Bascote.\nWhile the area might at first glance appear to be a mix of dormitory towns and commuter villages, it is an area of diverse interests and activities. Agriculture is very significant, not only in terms of local farming but also because the constituency is home to the Royal Agricultural Society of England (RASE) at Stoneleigh and the headquarters of the National Farmers Union.\nVital transport links criss-cross the constituency, with the M40 motorway snaking from north to south and the Grand Union Canal crossing from east to west. Baginton airport is in the north of the constituency. The constituency is also home to key research and development sites, in particular Jaguar and LandRover at Gaydon, which is also home to Aston Martin, and Warwick University’s administrative and research facilities north of Kenilworth.\nSoutham cement works is a landmark which can be seen for miles around, and the area has a rich history, with many historic houses, including four National Trust properties- Baddesley Clinton, Packwood, Upton and Farnborough; the nationally-acclaimed art gallery at Compton Verney, beautiful old churches and pubs and, of course, Kenilworth Castle, all of which make it a popular destination for tourists and day trippers and a desirable area to live.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_visit-ukbic/content_12.html": "This week I visited UKBIC to learn more about how they help companies develop new battery technologies for the automotive and other markets. I also sought assurance that work is ongoing to erect acoustic fencing to mitigate a noise issue for neighbouring residents.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_category_Media/content_6.html": "Safer Internet Day 2025 11th February 2025 Today is Safer Internet Day – an initiative to raise awareness about online safety and how we can better protect people in the digital space. The internet is a... Media\nMy appearance on Politics Midlands 9th February 2025 In case you missed it, I was on BBC Politics Midlands this weekend discussing changes to local government, flooding and the West Midlands Pension Fund. You can... Media\nHis Royal Highness, The Prince Philip, Duke of Edinburgh 9th April 2021 His Royal Highness the Duke of Edinburgh lived a life of great service to this country. All our thoughts and sympathies will be with Her Majesty the Queen, to... Local NewsMediaWestminster News\nReflections: General Election 2017 20th June 2017 It is a huge honour to represent in Parliament the place where you live, and the voters of the Kenilworth and Southam constituency have given me that honour... Media\n#WearItPink Campaign 22nd September 2016 Recently, I joined fellow MPs in wearing it pink to encourage people across the UK to get involved and support those affected by breast cancer. Every year 50... Media",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_useful-links/content_34.html": "The official government website, a 'one stop shop' for all enquiries relating to government services.\nOfficial website which offers information about the House of Commons and the House of Lords.\nThe Citizens Advice service helps people resolve legal, money and other problems by providing free, independent and confidential advice.\nHundreds of new jobs are advertisied here each week for you to search through.\nProviding health advice and information on NHS services in your area.\nWebsite for the Crimestoppers Trust that operates the 0800 555 111 hotline, this can be used to pass on information about crime anonymously.\nEmail for Rural Payments Helpline. Phone 03000 200 301\nEmail for Cattle Tracing. Phone 0345 050 1234",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_category_European-News/content_23.html": "Solidarity with Ukraine 24th February 2023 A year ago today Russia invaded Ukraine. We can be proud of our country’s military, humanitarian and economic support for Ukraine, amounting to nearly £4... European News",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_about-rss/content_35.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_privacy/content_16.html": "This document outlines how Jeremy Wright processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Jeremy Wright\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Jeremy Wright.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Jeremy Wright, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Jeremy Wright via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news/content_2.html": "Victory in Europe Friday, 2 May, 2025 Eighty years ago on 8 May 1945, Victory in Europe (VE) Day marked the end of the Second World War in Europe, a moment of collective relief and jubilation after nearly six years of devastating conflict. In London, over a million people flooded the streets, celebrating beneath Union Flags, whilst the King and Prime Minister addressed the nation. Yet amid the celebrations, there was mourning too for... Articles\nReopening of A46 30th April 2025 I was pleased to learn that last night, the A46 between Kenilworth and Coventry reopened. Articles\nLondon Marathon 2025 27th April 2025 I wish the best of luck to all my constituents participating in the London Marathon today, whether you're running for a cause, a loved one, or the challenge. Articles\nHappy St. George's Day 23rd April 2025 Happy St. George’s Day to all my constituents in Kenilworth and Southam. Articles\nSteel Industry (Special Measures) Bill 17th April 2025 Last Saturday, Parliament was recalled to debate the future of UK steelmaking. While there’s wide agreement that action is needed to protect virgin steel... Articles\nMeeting with Daniel Eite 16th April 2025 I have recently had the opportunity to meet Kenilworth resident, Daniel Eite, to discuss his plans to become the first British man in history with Tourette’s to... Articles\nVisit to UKBIC 15th April 2025 This week I visited UKBIC to learn more about how they help companies develop new battery technologies for the automotive and other markets. I also sought... Articles\nParkinson's UK Parliamentary Drop-In 2025 11th April 2025 Recently I met representatives of Parkinson’s UK during their Parliamentary Drop-in Briefing to discuss how we can tackle this condition. On World Parkinson’s... Articles\nVisit to Thwaites 9th April 2025 Last week I met the team at Thwaites, where I had the opportunity to see their impressive new factory facility – a strong sign of their continued commitment to... Articles",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_cycling-kenilworth-and-southam/content_24.html": "Last week I was able to view progress on the new Kenilworth Secondary School building and it will be an impressive building, offering excellent facilities for learning to generations of students to come. Those involved in the project have been working tremendously hard to get the new school ready to welcome pupils in the Autumn and I thank them all. We hope that many of those pupils will cycle to their new school and the development plans seek to make the immediate environment of the school safe for cycling, but of course some students (and staff) will be cycling through other parts of town and indeed further afield.\nFor their benefit and for the benefit of others who want to cycle in our area, we need to improve cycling infrastructure, and we are. The ‘K2L’ project will make it easier and safer to cycle between Kenilworth and Leamington. New stretches of cycleway like the Lias Line are providing attractive alternative commuter and leisure routes. It is important though that we do not just have several individual pieces of the puzzle, but rather a coherent and connected cycle network as the completed jigsaw. That is why I have been meeting local Councils, Sustrans and others to ensure we deliver maximum collective benefit from the individual projects being planned and built. HS2 is also a factor here and HS2 Ltd have been attending these meetings. It is possible that, among all the disruption it brings, HS2 could also deliver some tangible benefits to our active travel infrastructure in the longer term, including by use of some of what are now haul roads for the project, as well as in the shorter term by delivering some cycleways as the railway is built.\nOf course, National Government has a part to play too and you may have heard about a reduction in planned active travel funding. Although understandable in the context of pressures on all Government spending at the moment, this is still disappointing. I have written to Ministers to point out that, both because of the impact of HS2 on this area and the potential for HS2 to contribute to active travel infrastructure, the case for central money that enables us to complete networks here remains strong. It is however important to understand that this is a reduction of a proposed increase, so there will still be more money available than there is now, and it will come on top of what has already been spent. £850 million has been invested in active travel nationwide since 2020/21, with at least another £100 million of capital funding to come, which will mean some £3 billion will be spent over this Parliament.\nIn any event, we can and should make improvements locally. They will not all have universal support. I know that some are concerned about cycling in Kenilworth’s Abbey Fields for example, and it will clearly be important to ensure that cyclists and others can share what may be narrow spaces safely, but the reality of Kenilworth’s geography means that excluding Abbey Fields from cycle route networks makes those networks less useable, and less safe, for cyclists of all ages.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_cookies/content_22.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_category_Opinions/content_32.html": "Brexit 16th May 2017 For those of you interested to know my views on Brexit, here they are: I voted remain in the EU, so I am disappointed by the outcome, but I believe strongly... Opinions\nEU Referendum 1st February 2017 I voted to remain in the EU, so I am disappointed by the outcome of the referendum, but I believe strongly that it must be respected. A clear majority of the... Opinions\nEU Referendum 24th February 2016 On 23rd June, the people of the United Kingdom will be making the most significant political decision most of us will ever make – whether we should remain... Opinions\nSyrian refugee situation 9th September 2015 The present situation in the Mediterranean is intolerable. Recent photos are clearly shocking and harrowing. This is why we continue to be at the forefront of... Opinions\nMy views on the Assisted Dying Bill 27th August 2015 I can think of very few policy issues on which my position has been as hard to reach as that of so-called “Assisted dying”. The House of Lords has already... Opinions",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_steel-industry-special-measures-bill/content_15.html": "Last Saturday, Parliament was recalled to debate the future of UK steelmaking. While there’s wide agreement that action is needed to protect virgin steel production, I raised concerns about rushed legislation and granting unnecessarily sweeping powers to the Government, including the ability to seize assets, enter premises by force, and impose criminal penalties.",
  "https_www_jeremywright_org_uk/https_www_jeremywright_org_uk_news_happy-st-georges-day-0/content_36.html": "Tweet Wednesday, 23 April, 2025 Articles Happy St. George’s Day to all my constituents in Kenilworth and Southam.\nVictory in Europe Friday, 2 May, 2025 Eighty years ago on 8 May 1945, Victory in Europe (VE) Day marked the end of the Second World War in Europe, a moment of collective relief and jubilation after nearly six years of devastating conflict."
}