{
  "http_www_jacobreesmogg_com_/https_www_jacobreesmogg_com_contact/content_4.html": "top of page\nContact Details for Jacob Rees-Mogg\nIf you wish to contact Jacob about a media opportunity, please email mbrewerpa@gmail.com.\nIf you wish to contact Jacob regarding his GBNews programme, please email mailmogg@gbnews.com.\nIf you wish to contact Jacob regarding his Substack, this can be done from within the Substack website or app.\nbottom of page",
  "http_www_jacobreesmogg_com_/https_www_jacobreesmogg_com/content_3.html": "top of page\nJacob Rees-Mogg\nWelcome to my website and thank you for visiting.\nI have recently launched a Substack. You can access it here.\nSubstack is an online platform where I will be writing weekly articles on the current political situation. There will also be monthly articles on topics such as the constitution, US Politics and significant historical figures. Some articles will be freely available and some will only be available to paid subscribers. I hope you will want to join me.\nbottom of page",
  "http_www_jacobreesmogg_com_/https_www_jacobreesmogg_com_about/content_2.html": "Jacob was born in May 1969 and is married to Helena with whom he has six children. He was educated at Eton before reading History at Trinity College Oxford; he then moved into finance being based in Hong Kong and later moving back to London. He set up his own company in 2007 with a group of Partners; it was called Somerset Capital Management (SCM) and specialised in investment management in global emerging markets for institutional clients.\nJacob was the Member of Parliament for North East Somerset from 2010 to 2024. In 2019 he was appointed Leader of the House of Commons and Lord President of the Council, a post he held for two and a half years under Boris Johnson. He was then the Minister for Brexit Opportunities and Government Efficiency before serving as Secretary of State for Business, Energy and Industrial Strategy in Liz Truss' administration. Jacob lost his seat in the 2024 election.\nJacob now presents 'State of the Nation' on GBNews, which runs from Monday to Thursday from 8-9pm. He also writes a regular Substack, which can be accessed at letters.jacobreesmogg.com.",
  "http_www_jacobreesmogg_com_/http_www_jacobreesmogg_com/content_1.html": "top of page\nJacob Rees-Mogg\nWelcome to my website and thank you for visiting.\nI have recently launched a Substack. You can access it here.\nSubstack is an online platform where I will be writing weekly articles on the current political situation. There will also be monthly articles on topics such as the constitution, US Politics and significant historical figures. Some articles will be freely available and some will only be available to paid subscribers. I hope you will want to join me.\nbottom of page"
}