{
  "http_www_markpritchard_com_/http_www_markpritchard_com_about-wrekin/content_13.html": "The beautiful Wrekin constituency forms a horseshoe shape to the east, north and west of Telford, in Shropshire.\nThe constituency is named after a 1,335ft high volcanic hill which dominates the Shropshire landscape and is the most visited tourist attraction in Shropshire.\nAlthough The Wrekin is a mostly a rural constituency, most of its residents live in the market towns of Wellington, Newport and Shifnal, and the rural parish of Albrighton. The constituency lies partly within the jurisdiction of Shropshire Council and partly within the jurisdiction by Telford & Wrekin Borough Council.\nMany local residents work in the agriculture, manufacturing or tourism sectors. The constituency is also home to Harper Adams University – one of the world's best agricultural colleges.\nFor decades this part of Shropshire has had a military presence. RAF Cosford, the Defence College of Aeronautical Engineering, MOD Donnington, the Defence Storage and Distribution Agency, and the Army Base Repair Organisation are all located in The Wrekin constituency.\nThe Princess Royal Hospital, part of the Shrewsbury and Telford Hospital NHS Trust, also lies within The Wrekin parliamentary boundaries.",
  "http_www_markpritchard_com_/http_www_markpritchard_com_news_mark-supports-farmers-protest-against-governments-inheritance-tax-family-farms/content_9.html": "Today, farmers have come to Westminster to protest against the Government's inheritance tax on family farms.\nMark said:\n\"I have been fighting Labour's family farm tax since it was announced in the Budget. It is a tax which threatens the survival of family farms and the health of the rural economy. It also undermines efforts to achieve greater self-sufficiency in food production. When a vote was held in Parliament last November, I voted against the Government's plans to charge Inheritance Tax on family farms.\n\"I was one of 116 Conservative MPs and Peers who signed a letter to the Chancellor calling on her to reverse her decision. That letter was delivered to the Chancellor before Christmas. I have also written to the Exchequer Secretary to the Treasury to convey my concerns about the family farm tax, and those concerns expressed to me by my farming constituents.\n\"As the Member of Parliament for a constituency with an important farming sector, I will keep lobbying Ministers to scrap this harmful and ideological policy.\"",
  "http_www_markpritchard_com_/http_www_markpritchard_com/content_1.html": "Mark Pritchard I'm Mark Pritchard, Member of Parliament for The Wrekin constituency in Shropshire. Here you can stay updated on my work in our constituency and in Westminster, as well as my campaigns on important issues. Protecting Our Countryside 24/7 Emergency Care Services Staying at PRH More Funding For Local Schools Championing Defence Jobs for The Wrekin Improving animal welfare Improving Roads & Public Transport Campaigns Protecting Our Countryside I have joined thousands of local residents to oppose Telford & Wrekin… 24/7 Emergency Care Services Staying at PRH The PRH will retain 24 hour, 7 day a week emergency care services. … More Funding For Local Schools The last Conservative Government confirmed that schools will receive … Latest News Mark Meets with Heart Valve Voice Charity in Parliament It is #WorldHeartMonth, and Mark was pleased to meet with Heart Valve Voice, a… Mark Meets with Pulmonary Fibrosis Charity in Parliament Mark was pleased to meet with representatives of the Action for Pulmonary… Mark Meets Radiotherapy UK Charity in Parliament Mark was pleased to meet with Professor Pat Price, Chair of Radiotherapy UK, in… The Wrekin Find me on Twitter Find me on Facebook Coronavirus Advice Get email updates Leave this field blank Stay informed on the latest news. Your email First name Last name Postcode Address ID Address 1 Is Mark your MP? Enter your postcode Postcode Get in touch Constituency Office25 Church Street, Wellington, TF1 1DG01952 256 080[email protected]Mark Pritchard on FacebookMark Pritchard on Twitter\n24/7 Emergency Care Services Staying at PRH The PRH will retain 24 hour, 7 day a week emergency care services. …\nMore Funding For Local Schools The last Conservative Government confirmed that schools will receive …\nMark Meets with Heart Valve Voice Charity in Parliament It is #WorldHeartMonth, and Mark was pleased to meet with Heart Valve Voice, a…\nMark Meets with Pulmonary Fibrosis Charity in Parliament Mark was pleased to meet with representatives of the Action for Pulmonary…\nMark Meets Radiotherapy UK Charity in Parliament Mark was pleased to meet with Professor Pat Price, Chair of Radiotherapy UK, in…",
  "http_www_markpritchard_com_/http_www_markpritchard_com_news_category_Written-Questions-News/content_11.html": "Mark Questions Ministers About Collapse of Football Index 28th June 2021 Mark has asked Culture, Media and Sports Ministers in the House of Commons, what plans they have to reform the governance of oversight and due diligence of the... ArticlesWestminster NewsWritten Questions News\nMark Questions Church Commissioners on Support for Rural Parishes 24th May 2021 Mark submitted a written parliamentary question to ask the Church Commissioners what steps the Church of England is taking to support the dioceses of Hereford... Local NewsWritten Questions News",
  "http_www_markpritchard_com_/http_www_markpritchard_com_cookies/content_12.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_markpritchard_com_/http_www_markpritchard_com_cdn-cgi_l_email-protection/content_14.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_markpritchard_com_/http_www_markpritchard_com_news/content_7.html": "Mark Meets with Heart Valve Voice Charity in Parliament Friday, 14 February, 2025 It is #WorldHeartMonth, and Mark was pleased to meet with Heart Valve Voice, a UK charity dedicated to raising awareness, providing support, and improving treatment for heart valve disease. Heart valve disease is a progressive heart condition associated with ageing, where the heart valves become damaged through wear or disease and cease to function properly. If left untreated, it can lead to heart... ArticlesLocal News\nMark Meets with Pulmonary Fibrosis Charity in Parliament 13th February 2025 Mark was pleased to meet with representatives of the Action for Pulmonary Fibrosis charity in Parliament. Pulmonary fibrosis (PF) is a terminal lung disease... ArticlesLocal News\nMark Meets Radiotherapy UK Charity in Parliament 12th February 2025 Mark was pleased to meet with Professor Pat Price, Chair of Radiotherapy UK, in Parliament to discuss their campaign to expand the availability of radiotherapy... ArticlesLocal News\nMark supports farmers' protest against the Government's inheritance tax on family farms. 10th February 2025 Today, farmers have come to Westminster to protest against the Government's inheritance tax on family farms. Mark said: \" I have been fighting Labour's family... ArticlesLocal News\nFootball: Mark calls for lifetime bans for people convicted of threats of violence against referees and players 7th February 2025 This week in Parliament, Mark called on the Minister for Sport to hold discussions with the Home Office and the FA about introducing lifetime club bans for... ArticlesLocal News\nMark Meets UK Dementia Research Institute in Parliament 31st January 2025 I was pleased to meet with Professor Siddharthan Chandran, CEO of the UK Dementia Research Institute (DRI) in Parliament to discuss their latest research on... ArticlesLocal News\nMarking Holocaust Memorial Day 27th January 2025 This week in Parliament, Members of Parliament have the opportunity to sign the Holocaust Educational Trust (UK) Book of Commitment. Signing the Book of... ArticlesLocal News\nMarks Holds Policing Summit in Newport 11th January 2025 Mark was pleased to welcome two of West Mercia Police's most senior leaders - Acting Chief Constable and John Campion 4 West Mercia Police & Crime Commissioner... ArticlesLocal News\nMark Calls for Improvements in RAF Cosford Accommodation 2nd January 2025 Mark has recently received several reports of less than satisfactory accommodation at RAF Cosford - in particular the family housing. Before Christmas, Mark... ArticlesLocal News\nMark Meets Asthma + Lung UK Representatives in Parliament 19th November 2024 Mark met representatives on Asthma + Lung UK in Parliament to hear about their new 'Mission for Lung Health'. They call for action to cut air pollution, faster... ArticlesLocal News",
  "http_www_markpritchard_com_/http_www_markpritchard_com_news_mark-pritchard-backs-wwf-campaign/content_10.html": "Wrekin MP, Mark Pritchard, has backed WWF's Earth Hour campaign to help restore the natural environment.\nHimself a longstanding environmentalist, Mr Pritchard said: \"Humans are the leaseholders of our beautiful planet not the freeholders. Earth is a shared space with nature. I am happy to support this important WWF campaign\".",
  "http_www_markpritchard_com_/http_www_markpritchard_com_campaigns_improving-animal-welfare/content_2.html": "Ever since he was first elected in 2005, animal welfare has been high on Mark's agenda.\nMark has introduced several animal welfare Bills and motions aimed at strengthening our animal welfare laws, including...\n- Sale of Endangered Animals on the Internet Bill\n- The Sale of Primates as Pets (Prohibition) Bill\n- The Protection of Common Birds Bill\n- The Ending of Wild Animals in Circuses (Motion)\nThe last Conservative Government had an excellent record on animal welfare and is already a world leader in this area.\n- The Animal Welfare (Sentience) Act enshrined in domestic law the recognition that animals are sentient and creates an expert Animal Sentience Committee, which will advise the Government on how policy decisions should take account of animal welfare.\n- The Animal Welfare (Sentencing) Act introduced tougher sentences for animal cruelty, increasing maximum sentences.\n- The Ivory Act came into force in 2022 and has recently been extended to cover five more endangered species.\nFinally, the Conservative Government supported a series of Bills which will deliver important reforms on animal welfare. These include the Hunting Trophies (Import Prohibition) Bill, which will ban the import of hunting trophies for specific species; the Shark Fins Bill, which will ban the import and export of shark fins; and the Animals (Low-Welfare Activities Abroad) Bill, which will ban the sale and advertising of activities abroad which involve low standards of welfare for animals.",
  "http_www_markpritchard_com_/http_www_markpritchard_com_campaigns_improving-roads-public-transport/content_6.html": "Get Those Potholes Fixed!\nThe last Conservative Government has announced massive new funding to help Shropshire Council and Telford & Wrekin Council repair local roads.\nTransport Ministers had already promised to provide £8.3 billion of extra roads resurfacing funding for English local councils between 2023/24 and 2033/34 - all paid for with savings delivered by the Prime Minister’s decision to cancel HS2 Phase 2.\nAll the money that would have been spent on HS2 in the Midlands will still be spent in the Midlands, but on other transport projects which can be delivered faster.\nNow, the Department for Transport has confirmed the specific allocation of additional funding which Shropshire Council and Telford & Wrekin Council will receive between 2023/24 and 2033/34. Over that period, Telford & Wrekin Council will receive an additional £32,035,000 and Shropshire Council will receive an additional £153,072,000.\nThis massive extra funding for road repairs in Shropshire, Telford & Wrekin is more than enough to transform the state of local roads for the better.\nIt is now up to the local councils to use the money wisely for the benefit of residents. Too often, we hear Labour-run Telford & Wrekin Council blaming their own transport failings - from damaged roads to closed bus routes - on what they claim is a lack of government funding. With an additional £32 million given to them by the Conservative government to spend on local roads, there can be no more excuses. I will be keeping a close eye on progress with road repairs across the borough.\nProtecting Local Bus Services\nThe last Conservative Government confirmed an extra £243 million of investment to improve local transport in Shropshire, Telford & Wrekin.\nThe reallocated HS2 funding is providing local authorities in the Midlands with extra money to improve public transport, reduce congestion and upgrade local bus and train stations.\nIt is the first transport budget of its kind that is specifically targeted at smaller cities, towns and rural areas and which empowers local people and local leaders to invest in the local transport projects that matter most to their communities.\nAs part of the Conservative Government’s latest funding decision, Shropshire Council will receive an extra £136,443,000 and Telford & Wrekin Council will receive an extra £107,018,000.\nLocal authorities will receive funding from April 2025, giving them time to develop their funding proposals properly. Over the seven years as a whole this funding will be on average at least nine times more than local authorities currently receive through the local integrated transport block, which is the current mechanism for funding local transport improvements in their local areas.\nThis funding increase is for the Midlands and the North because most HS2 savings are from those regions. Every penny of the £9.6 billion committed to the Midlands leg of HS2 will be reinvested in the Midlands.\nThe last Conservative Government provided £650,938 to Telford & Wrekin Council last year as part of the Bus Service Improvement Plan, plus a further £1.05 million using money saved by scaling back the HS2 project. That means Telford & Wrekin Council has received an additional £1.7 million from the Conservatives to provide more regular and reliable bus services and/or cheaper fares.",
  "http_www_markpritchard_com_/http_www_markpritchard_com_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_markpritchard_com_/http_www_markpritchard_com_campaigns/content_5.html": "Protecting Our Countryside I have joined thousands of local residents to oppose Telford & Wrekin Council’s draft Local Plan, which would see countryside bulldozed and hundreds of trees...\n24/7 Emergency Care Services Staying at PRH The PRH will retain 24 hour, 7 day a week emergency care services. About 80% of the A&E services currently provided at the PRH will still be provided there...\nMore Funding For Local Schools The last Conservative Government confirmed that schools will receive £2 billion of additional funding during both the 2023-24 and 2024-25 academic years. That...\nChampioning Defence Jobs for The Wrekin Conservatives are strong on defence. The last Conservative Government proved this locally by its ongoing investment into local defence jobs and multiple...\nImproving animal welfare Ever since he was first elected in 2005, animal welfare has been high on Mark's agenda. Mark has introduced several animal welfare Bills and motions aimed at...\nImproving Roads & Public Transport Get Those Potholes Fixed! The last Conservative Government has announced massive new funding to help Shropshire Council and Telford & Wrekin Council repair...",
  "http_www_markpritchard_com_/http_www_markpritchard_com_news_mark-meets-radiotherapy-uk-charity-parliament/content_8.html": "Mark was pleased to meet with Professor Pat Price, Chair of Radiotherapy UK, in Parliament to discuss their campaign to expand the availability of radiotherapy across the country.\nWhilst the Government has announced £70 million of funding for new radiotherapy machines, Radiotherapy UK says this is not enough to update all the machines which are becoming out-of-date.\nMark said: \"The Government’s upcoming 10-Year Plan for the NHS must recognise the priority of reducing waiting times for cancer treatment across the country.\"",
  "http_www_markpritchard_com_/http_www_markpritchard_com_coronavirus-advice/content_3.html": "Information about COVID-19 - 26th March\nIf you're reading this on a mobile further menu options are available at the bottom of the page. If on a desktop menu options are to the left of this page.\nAll government advice on coronavirus can be found here .\nHow serious is COVID-19?\nMost people who get the virus have make a full recovery, but the virus can cause severe symptoms and death. This is particularly true those over 70, and for those with long term conditions like diabetes, cancer and chronic lung disease.\nThe more people who become infected - the more our NHS will not cope - so you should stay at home to protect our NHS and save lives.\nA lot of false information about this virus is being shared - it’s very important that you make sure that the information you use comes from a trusted source - all of the information on this page has been sourced from the NHS.\nWhat are the symptoms?\nIf you are infected you experience a range of symptoms but the two symptoms to look out for are:\n- A new continuous cough\n- A fever or high temperature\nWhat should I do if I have either of the above symptoms?\n- Protect others - don't call NHS 111\n- Protect others - don't call, or go to your GP\n- Protect others - don't go to your local hospital\nIf you live alone - stay at home without any visitors (self-isolate) immediately for 7 days\nIf you live with others - you should all isolate yourselves at home for 14 days - this 14-day period starts from the day the first person in the home noticed the symptoms.\nYou staying at home for 7 or 14 days will stop you causing other people to get sick and possibly die - don't risk it.\nFor anyone in your home who starts displaying symptoms, they need to stay at home for 7 days from when the symptoms appeared, regardless of what day they are on in the original 14-day isolation period.\nIf at-risk people share your home - such as those who are older and those with underlying health conditions - ideally they should move out, perhaps to stay with friends or family for the whole isolation period. If they can't move out, they must keep as much distance as possible from others in the home during this period. Use disinfectant to keep surfaces clean, wash hands and keep them away from your face.\nFor further information read this government advice on staying at home and isolating.\nWhat should I do if self-isolation is difficult?\n- You can't manage with your symptoms at home\n- Your conditions get worse\n- Your symptoms do not get better after 7 days\nYou should use the online 111 service or if you can't use the online service call 111\nHow can you avoid getting and spreading the virus?\nScientists think the virus spreads via droplets from coughs and sneezes and we know it spreads easily and can stay on surfaces for a while. Follow the advice below to reduce your risk and the risk to others.\n- Avoid non-essential contact with others - work from home if you can and don't socialising with others - if you do go out keep 6 feet (2 metres) distance.\n- Wash your hands - with soap and water often, for at least 20 seconds. Do this before leaving home and after returning home, before eating and drinking, and after coughing or sneezing.\n- Cover your mouth and nose - with a tissue or your sleeve (not your hands) when you cough or sneeze - tissue in the bin and wash, or disinfect, your hands immediately.\n- Don't touch your face - especially your eyes, nose and mouth.\n- Clean surfaces - disinfect surfaces around you - especially mobiles, computers, keyboards, worktops, desks, handles...\nKeep up-to-date with government emails about coronavirus (COVID-19) here ."
}