{
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk/content_1.html": "Campaigns Sir Robert Buckland MP Leads Joint Campaign to Call for North Wessex Downs Area of Outstanding Natural Beauty to Become National Park South Swindon MP Sir Robert Buckland is leading a joint campaign to call for… Creating Jobs and Growing the Economy Honda Redevelopment To Bring 7,000 Jobs I know how important it is for… Justice - Law and Order Campaign Throughout the course of my career, I have seen the justice system from many… Latest News If Ofwat doesn’t change course, it could bankrupt the entire water industry The taxpayer faces a huge bill, if we don’t address regulators’ shortcomings… Lecture at the Institute of Engineers to the Law and Liberty Circle LAW AND LIBERTY CIRCLE ADDRESS: 08/10/24Many of you will have heard me before,… A message of thanks from Sir Robert Buckland I would like to thank every single person who has taken the time to contact me… On Twitter\nSir Robert Buckland MP Leads Joint Campaign to Call for North Wessex Downs Area of Outstanding Natural Beauty to Become National Park South Swindon MP Sir Robert Buckland is leading a joint campaign to call for…\nCreating Jobs and Growing the Economy Honda Redevelopment To Bring 7,000 Jobs I know how important it is for…\nJustice - Law and Order Campaign Throughout the course of my career, I have seen the justice system from many…\nIf Ofwat doesn’t change course, it could bankrupt the entire water industry The taxpayer faces a huge bill, if we don’t address regulators’ shortcomings…\nLecture at the Institute of Engineers to the Law and Liberty Circle LAW AND LIBERTY CIRCLE ADDRESS: 08/10/24Many of you will have heard me before,…\nA message of thanks from Sir Robert Buckland I would like to thank every single person who has taken the time to contact me…",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_campaigns/content_10.html": "Sir Robert Buckland MP Leads Joint Campaign to Call for North Wessex Downs Area of Outstanding Natural Beauty to Become National Park South Swindon MP Sir Robert Buckland is leading a joint campaign to call for the North Wessex Downs Area of Outstanding Natural Beauty to Become a National Park...\nCreating Jobs and Growing the Economy Honda Redevelopment To Bring 7,000 Jobs I know how important it is for people in Swindon to have access to well paid and skilled jobs in the local area, so you...\nJustice - Law and Order Campaign Throughout the course of my career, I have seen the justice system from many angles – as prosecution and defence counsel, as a part-time Crown Court judge, as a...\nStanding up for Swindon's Schools One of my key priorities has been making sure that Swindon delivers high quality education services and support to all of its children, from pre-school through to college and beyond.\nWorking to create Apprenticeships in South Swindon Sir Robert Buckland MP Celebrates 9,980 Apprenticeship Starts in South Swindon Since First Becoming MP in 2010 Since 2010, the Conservative Government have...\nSupporting and highlighting the work of Swindon's Charities Here in Swindon we are extremely lucky to have so many excellent local charities, with dedicated staff and volunteers who work hard to support members of our...\nClosing the employment gap for autistic people and those with other neurodivergent needs During my time as an MP, I have campaigned hard for the rights of those with autism and other neurodivergent individuals, so I was very pleased to be appointed...\nSir Robert Buckland and Cllr Suresh Gattapur Campaign for the reopening Of the West Swindon Post Office Update: 26th July 2023 Along with Cllr Suresh Gattapur, I have been campaigning on behalf of local residents for the reopening of the West Swindon Post Office...\nSir Robert Buckland MP's Campaign to tackle Loneliness in Swindon Robert and Swindon Seniors Forum have been working together over the past five years on a local campaign to tackle loneliness, with the aim of bringing together...\nSir Robert's Laptops for Local Schools and Charities Campaign Update - 28th June 2023 I am delighted to announce that Nationwide Building Society has donated £2K to Swindon Charity Threshold Housing Link as part of my...\nSir Robert Buckland MP's Campaign to raise awareness of Dementia in Swindon Update: 11th April 2024 Please do join me at this excellent event! The Swindon Dementia Action Alliance are proud to be organising an information Expo style...\nTurn on the Subtitles Campaign - Sir Robert Buckland MP Teams up with Sandi Toksvig & Stephen Fry Robert Buckland QC MP Joins Sandi Toksvig & Stephen Fry And Calls On Parents To Turn On The Subtitles To Improve Literacy COVID has, unfortunately, meant that...",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_sir-robert-asks-question-parliament-psni-data-breach/content_9.html": "As a member of the Northern Ireland Affairs Committee, I asked Secretary of State Chris Heaton-Harris about the handling of Freedom of Information requests in light of the PSNI Data Breach.\nThe taxpayer faces a huge bill, if we don’t address regulators’ shortcomings writes Sir Robert Buckland for The Daily TelegraphThe Government is right to prioritise growing the UK’s economy, but if it wants to really tackle the issues preventing it from prospering, it needs to address the way our re",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_sir-robert-buckland-mp-post-office-scandal/content_7.html": "The taxpayer faces a huge bill, if we don’t address regulators’ shortcomings writes Sir Robert Buckland for The Daily TelegraphThe Government is right to prioritise growing the UK’s economy, but if it wants to really tackle the issues preventing it from prospering, it needs to address the way our re",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_category_Westminster-News/content_4.html": "Sir Robert Buckland MP Welcomes New Government Funding To Help Victims Of Domestic Abuse Leave Their Abusers 12th January 2024 Sir Robert Buckland MP has welcomed new Government funding, which means that hundreds of domestic abuse victims will receive lifeline payments to help them to... Westminster News\nState Opening of Parliament on 7th November 6th November 2023 Tomorrow, 7 November, is the State Opening of Parliament. His Majesty the King will visit Parliament for his first State Opening as monarch. You can watch the... Westminster News\nSir Robert attends the Conservative Party Conference 5th October 2023 Sir Robert Buckland MP attended the Conservative Party Conference in Manchester this week. His schedule included ... 🏦 Talking to Barclay's about the work they... Westminster News\nSir Robert meets with river campaigners 14th September 2023 South Swindon's MP Sir Robert Buckland met with campaigners from the Women's Institute earlier this week to discuss what more can be done to keep our rivers... Westminster News\nSir Robert Asks the Prime Minister about international collaboration on AI safety 12th September 2023 Yesterday I asked the Prime Minister about international collaboration on AI safety. Westminster News\nSir Robert Buckland Attends Alzheimer's Research UK's Event in Parliament on the Future of Dementia 6th September 2023 Sir Robert Buckland MP attended Alzheimer's Research UK's event in Parliament on the #FutureOfDementia. With over half of us knowing someone affected by... Westminster News\nSir Robert Attends Western Gateway APPG Event in Parliament 6th September 2023 It was great to speak to Rail Minister Huw Merriman MP at today's Western Gateway APPG event in Parliament. The Minister recognises that rail is so important to... Westminster News\nSouth Swindon MP joins Mencap to mark Learning Disability Week 20th June 2023 South Swindon MP and Chair of the All-Parliamentary Group on Learning Disability, Sir Robert Buckland, joined the charity Mencap to mark Learning Disability... Westminster News\n“Victims Of Crime Must Know That Their Voice Will be Heard,” Says Sir Robert Buckland MP Reacting To Government Clamp Down On Grooming Gangs 4th April 2023 “Victims of crime must know that their voice will be heard, that they will be taken seriously, and they won’t be marginalised because of who they are, or where... Westminster News",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_sir-robert-buckland-mp-swindon-and-western-gateway-western-rail-link-heathrow-airport-debate/content_11.html": "The taxpayer faces a huge bill, if we don’t address regulators’ shortcomings writes Sir Robert Buckland for The Daily TelegraphThe Government is right to prioritise growing the UK’s economy, but if it wants to really tackle the issues preventing it from prospering, it needs to address the way our re",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_about-rss/content_2.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_category_Speeches-in-Parliament/content_5.html": "Sir Robert Buckland MP on Swindon and The Western Gateway in Western Rail Link to Heathrow Airport Debate 30th April 2024 I was very pleased to speak about Swindon and The Western Gateway in the Western Rail Link to Heathrow Airport Debate in Parliament today. Speeches in Parliament\nSIr Robert Buckland MP Speaks in Hospice Debate 24th April 2024 I was very pleased to have the opportunity to speak in Parliament as part of the planned hospice debate. I have worked very closely with the dedicated team at... Speeches in Parliament\nSir Robert Buckland MP Speaking at the 2nd Reading Of The Pet Abduction Bill 19th January 2024 As a nation of pet lovers, the Pet Abduction Bill is very important to protect our beloved pets and I was pleased to speak at the 2nd reading in Parliament. Speeches in Parliament\nFlooding in Swindon 9th January 2024 Yesterday, I was asked Minister Robbie Moore about flooding in Swindon. Speeches in Parliament\nSir Robert Buckland MP Asks Lord Chancellor If Emergency Legislation Could Be Used To Help Overturn The Wrongful Convictions Of Sub-postmasters 9th January 2024 Yesterday in Parliament, I asked Minister Kevin Hollinrake whether emergency legislation could be used to help overturn the wrongful convictions of sub... Speeches in Parliament\nSir Robert Buckland MP On The Post Office Scandal 9th January 2024 Today I asked Minister Kevin Hollinrake about whether legislation could be used to help overturn the wrongful convictions of sub-postmasters. Speeches in Parliament\nSir Robert asks a question in Parliament on the Letby Inquiry 5th September 2023 Earlier today I asked the Secretary of State for Health and Social Care , The Rt Hon Steve Barclay, about the importance of maintaining open justice in the... Speeches in Parliament\nSir Robert asks a question in Parliament on the PSNI data breach 5th September 2023 As a member of the Northern Ireland Affairs Committee, I asked Secretary of State Chris Heaton-Harris about the handling of Freedom of Information requests in... Speeches in Parliament\nSir Robert Buckland MP Speaking in the Debate on the Economic Activity of Public Bodies (Overseas Matters) Bill 5th July 2023 Sir Robert Buckland MP speaking in Parliament as part of the debate on the Economic Activity of Public Bodies (Overseas Matters) Bill. Speeches in Parliament",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_category_Assembly-News/content_8.html": "Sir Robert's Monthly Newsletter - April 2023 20th April 2023 The Buckland Review of Autism Employment As part of my ongoing work to close the employment gap for autistic people and those with other neurodivergent needs, I... Assembly News",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_sir-robert-buckland-mp-asks-lord-chancellor-if-emergency-legislation-could-be-used-help/content_6.html": "Yesterday in Parliament, I asked Minister Kevin Hollinrake whether emergency legislation could be used to help overturn the wrongful convictions of sub-postmasters. Such legislation would help to right a clear wrong, and it would help to support the victims and their families who have been enduring this horror for too long.\nToo many sub-postmasters have already died without seeing justice being done, so there is no more time to be lost.\nToday I have spoken to the Lord Chancellor, who is in discussion with the judiciary about these matters. I will continue to make my feelings known very clearly in Parliament to ensure that there is no barrier to making sure we can legislate in the way I have described.\nI asked a question of the Lord Chancellor in the Commons and I am reassured that he is working hard to achieve a just and swift solution.",
  "http_www_robertbuckland_co_uk_/http_www_robertbuckland_co_uk_news_message-thanks-sir-robert-buckland-0/content_3.html": "I would like to thank every single person who has taken the time to contact me over the past few hours, as well as to offer my congratulations to our new Member of Parliament for Swindon South, Heidi Alexander.\nI would also like to pay tribute to my brilliant and dedicated team for all their hard work over the past 14 years.\nIt has been the honour of my life to represent you as your Member of Parliament since 2010.\nI didn’t come into politics to just talk, I came into politics to do things, and I believe that we’ve done that here in Swindon.\nWe’ve come so far together since 2010, investing record amounts in our health services, including a brand new £26m Emergency Department at the Great Western Hospital, which is due to open very soon, and an £18m Government investment in the Radiotherapy Unit, which avoids the need for that journey to Oxford for anybody who requires that vital treatment.\nThe railways made Swindon great, which is why I am glad that the Government has invested in the electrification of the Great Western mainline.\nWe have upgraded major interchanges in Swindon, including the M4 junctions 15 and 16, and a host of other important roads.\nServing our town as your MP, and in my former Ministerial role as Justice Secretary and Lord Chancellor, I am proud to have passed laws to make sure that serious, violent, and sexual offenders stay in prison longer and made the sentencing system simpler and more straightforward. Plus, reforms to the law of domestic abuse and child cruelty.\nHere in Swindon, I have worked closely with local residents, the Police and Crime Commissioner, Philip Wilkinson and our policing teams to make our town a safer and better place to live.\nI’ve also fought hard to help restore our much-loved industrial heritage in the town, including securing £5m from the Conservative government’s Towns Fund to start the refurbishment of the Health Hydro, and restoration of our community assets in the Railway Village and, of course, the Carriage Works as well.\nI share the concerns of local residents about the future of our town centre, which is why I am proud to have secured £26m in investment for the regeneration in and around Fleming Way.\nI am also pleased to have secured money through the Conservative government’s Towns Fund for the regeneration of our weekly market, which is another example of the success we have achieved.\nI would urge all local residents to continue to shop in our town centre and to support the many wonderful independent local businesses that we have here in Swindon.\nI would also like to pay tribute to the many wonderful local charities that we have here in the town, whom I have worked closely with over the past 14 years. There are many ways in which you can become involved and support our local charities and I would urge local residents to continue to do so.\nI am proud to have recently helped to secure the massive Panattoni redevelopment at the former Honda site, which is well underway. This project is expected to be worth over £1 billion to Swindon and will bring around 11,000 new jobs for local residents.\nWorking closely with North Swindon MP Justin Tomlinson, I am also proud to have secured £21 million of Conservative government funding to build one of the first 12 Institutes of Technology in the country here in Swindon.\nThe new state-of-the-art IOT means that local residents no longer have to travel out of the area to gain a university-level qualification, bringing local, affordable opportunities right here on our doorstep and helping to raise local aspirations.\nWe’ve come a long way as a town and a community since I was first elected as your MP, and I can only hope that our new Member of Parliament works as hard as I have to support the wonderful people of Swindon South."
}