{
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_campaigns_5-championing-defence/content_9.html": "Rebecca is proud to represent many serving personnel, veterans and 42 Commando Royal Marines at RM Bickleigh as the Member of Parliament for South West Devon and is an outspoken champion for Britain's Armed Forces in Parliament.\nBorn and raised in the historic naval city of Plymouth, she has fond memories of watching warships set sail from Plymouth Sound as a girl. Before being elected in July 2024, Rebecca spent more than six years working for the Commonwealth War Graves Commission (CWGC) in the South West, sharing its vital work preserving the memories of the fallen through walks and talks. She continues to support and raise awareness about the organisation in Parliament, chairing the CWGC and Commemorations All Party Parliamentary Group (APPG). The South West Devon MP also attends Remembrance services in towns and villages across the constituency every year, laying wreaths on behalf of her constituents.\nRebecca was the only Plymouth MP to speak out against the Government's decision to axe HMS Albion and Bulwark based at HMNB Devonport in November 2024. She has put significant pressure on the Government to provide a timeline for their replacements, quizzing the Defence Secretary in Parliament.\nView recent articles on Rebecca's work to champion defence in South West Devon below.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_about-rss/content_6.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_campaigns_2-driving-transport-investment/content_2.html": "Since her election in July 2024, Rebecca has fought tooth and nail to secure more transport investment for the Southwest. Making the three and a half-hour journey to London and back each week to represent South West Devon in Westminster, the Plymouth-born MP is keenly aware of how aging transport infrastructure holds back the region.\nDelivering her maiden speech during a debate on the Passenger Railway Services (Public Ownership) Bill, Rebecca spoke at length about improving the area's rail network. The South West Devon MP addressed the need to complete the remedial works at Dawlish, prevent disruption caused by HS2 works, have Crosscountry trains call at Ivybridge and deliver the Plymouth Metro. She continues to push for these landmark investments in private meetings, Parliament speeches and media interviews.\nIn October 2024, Rebecca was selected as one of only two Conservative MPs on the cross-party Transport Committee. She has vowed to use her position on the important committee to demand answers from the Government on rail travel in South West Devon.\nRebecca secured her first major transport investment in January 2025, welcoming a new bus link from Plympton to Plymstock which includes the new crematorium and a link to Langage from Plymstock, via Sherford. The newly-elected MP campaigned hard to deliver a positive result for her constituents, conducting a local survey and lobbying Plymouth Citybus and the Cabinet Member for Transport on Plymouth City Council.\nView recent articles on Rebecca's work to drive transport investment in Southwest below.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_news_rebecca-explores-mclarens-sustainable-fuel-innovations/content_7.html": "It was a real privilege to visit the Mclaren Technology Centre recently as part of the All Party Parliamentary F1 group and see first-hand how one of the UK’s most iconic engineering firms is investing in the future of sustainable transport. As a lifelong fan of F1, it was especially inspiring to witness how McLaren is using its racing heritage to lead the way in sustainable transport!\nMcLaren’s investment in sustainable fuel technologies is particularly exciting. For rural areas in my constituency, where EV charging infrastructure is still patchy, cleaner fuel alternatives offer a more realistic route to cutting emissions.\nWhile the Government’s recent announcement to support carmakers is welcome in principle, we need to go further. Investment must be matched with a practical, place-based approach that recognises the unique transport needs of rural and coastal communities.\nMcLaren’s work on high-performance, low-emission fuels is a great example of how British industry can lead the charge toward greener transport without leaving communities like ours behind.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_news_category_Local-News/content_8.html": "Rebecca demands improvements from FirstPort 3rd March 2025 South West Devon MP Rebecca Smith has written a stern letter to the Managing Director of FirstPort property management company, demanding improvements for long... Local News\nDoctor will see you now 24th February 2025 Rebecca visits Beacon Medical Group in Plympton I thought you might be interested to know that I recently met with the leadership team at Beacon Medical Group... Local News\nRebecca meets with First Port Property Management 9th December 2024 At the end of November I met with representatives from First Port Management Company to raise concerns on behalf of affected leasehold and freehold residents... Local News\nRebecca Smith MP responds to the budget 31st October 2024 Rebecca Smith MP responds to Labour’s 2024 Budget The Chancellor has delivered the Labour Government’s budget, outlining their spending plans for this... Local News\nRebecca backs British Farming 11th September 2024 Today was Back British Farming Day. Farming is a key part of the South West Devon constituency, and those who steward the land need strong voices speaking up... Local News\nRebecca Smith MP condemns Labour Government for voting to cut Winter Fuel Payments this winter 11th September 2024 Rebecca Smith MP condemns Labour Government for voting to cut Winter Fuel Payments this winter Around 21,980 pensioners in South West Devon will now lose up to... Local News\nRebecca sticks up for pensioners 10th September 2024 As promised to my constituents, I refused to back Labour’s cruel choice to rob pensioners of their winter fuel allowance. Thanks to the Labour Government, this... Local News\nFighting to keep Winter Fuel Payments in South West Devon 9th September 2024 Rebecca Smith MP to vote against Labour’s plan to cut winter fuel payments for 21,980 in South West Devon after Conservatives force Labour u-turn on vote in... Local News\nSherford Survey - share your views before 6th September 31st August 2024 New Member of Parliament for South West Devon, Rebecca Smith, is keen to hear from residents of the new town of Sherford. Much has been said in recent weeks... Local News",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_campaigns_share-your-firstport-experience/content_5.html": "Rebecca has secured a further meeting with the Managing Director of First Port to discuss ongoing service issues.\nIf you live on a First Port-managed development, Rebecca would be very grateful if you would share your recent experiences with her in a short survey below:",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_news_baton-passed-plymptons-new-stannator-and-youth-ambassador/content_10.html": "A wonderful evening at Harewood House celebrating the investiture of Plympton's new Stannator and Youth Ambassador.\nHuge thanks to Dave Partridge and Christopher Turner for their outstanding service last year. Your leadership has made a real difference.\nCongratulations to Cathy Loft and Grace Nicholls and I look forward to working with them as they both lead and inspire our community!",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_news_rebecca-successfully-campaigns-new-plympton-plymstock-bus-link/content_11.html": "After a successful 12-month campaign, Rebecca Smith MP welcomes Plymouth City Council’s new bus service connecting Plympton and Plymstock. The Council have announced that the vital bus link will be instated on Sunday, 30th March and also serve the new crematorium, The Park.\nThe announcement follows months of dedicated efforts by Rebecca, who conducted a local survey with hundreds of responses and met with Plymouth Citybus and the Cabinet Member for Transport on Plymouth City Council to make the case for a bus link between Plympton and Plymstock.\nResponding to the announcement, Rebecca Smith MP, Member of Parliament for South West Devon, stated:\nI have been pushing hard for a bus link between Plympton and Plymstock, with a local survey, meeting with local bus company chiefs and senior council leader about improving connectivity between these two key communities and linking to the new crematorium.\nTherefore, I am so pleased that the Council have listened to my representations and today announced that a new bus link, which will also serve the new crematorium, will be funded from the spring. Many living in Plympton and Plymstock shop, visit family and access key services across both towns. This new route will make this easier.\nDriving transport investment in our region is a key priority. I will continue to lobby the Government locally and nationally for our fair share.\nRebecca is committed to driving up transport investment in her constituency and the wider region. The population of Plympton is 26,481 and Plymstock is 24,103, creating a combined population of over 50,000. The new Plympton-Plymstock bus link is a significant step forward in fulfilling that objective. The South West Devon MP will now turn her attention to ensuring that Plymouth City Council complete the bus shelter replacement programme.\nThe service, which will be operated by Stagecoach Southwest, is one of 17 that will be financially supported by the Council following a recent retendering of the city’s ‘non-commercial’ routes. It will run as Number 19 roughly every 75 minutes from 9.30am to just after 5pm every day (except Christmas Day, Boxing Day and New Year’s Day). The Number 4 will also be extended beyond Plymstock Broadway to serve Plympton Ridgeway via Sherford and Sandy Road, providing new links for workers at Langage and for pupils travelling to and from school.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_news_update-labours-bus-fare-hike/content_3.html": "Update on Labour's bus fare hike\nMany constituents have shared their concerns with me about the Government's planned 50% hike to the national bus fare cap. Bus services provide a lifeline for many in South West Devon, linking rural communities to key services in Plympton, Plymstock and beyond. The £3 cap will cost regular bus users in my constituency hundreds of pounds.\nI have been clear that this poorly timed policy will do little to encourage people to use public transport or tackle the cost-of-living, especially when considering that many of my constituents on lower incomes rely on our local bus network.\nThe first inquiry of the Transport Committee which I sit on is well-timed and of special interest to South West Devon, investigating the importance of England’s buses services in connecting rural communities with neighbouring towns and suburban areas.\nLocally, I have been campaigning for a bus service between #plympton and #plymstock. I will continue to argue for better, more affordable public transport links in our area and look forward to sharing the committee's findings.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_news_london-inn-crowned-best-pub-south-west-devon/content_4.html": "I was delighted to congratulate Landlord Simon, Assistant Manager Jeannine and the rest of the team at The London inn Plympton for being crowned the best pub in South West Devon!\nWith more than 500 votes for my competition to find the best pub in South West Devon, The London Inn came out on top with stiff competition. It is clear from reading all the submissions how much locals value the welcoming staff, friendly atmosphere, selection of drinks and live entertainment at the pub. Also loved the new garden and the amazing renovation by former Stannator, Andy Cooper!\nThank you to everyone who took part in my pub competition. We have so many great pubs in South West Devon that are feeling the squeeze at the moment; my support for our publicans is unwavering.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk/content_1.html": "Work experience\nRebecca is passionate about unlocking opportunities for young people and offers a range of work experience options for constituents in South West Devon. Click the link below to find out more about this scheme and how you can apply.\nEnter your postcode\nRebecca is passionate about unlocking opportunities for young people and offers a range of work experience options for constituents in South West Devon. Click the link below to find out more about this scheme and how you can apply.",
  "https_www_rebecca-smith_org_uk_/https_www_rebecca-smith_org_uk_cdn-cgi_l_email-protection/content_12.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}