{
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_my-take-english-devolution/content_4.html": "ENGLISH DEVOLUTION - Do you want people living in England to have their say on improving local services & spending more of government money in our local communities?\nDo you want to help shape where new roads are built, new houses, leisure centres & schools?\nDo you want young people to have a choice of employers and industries to pick from?\nIf so, English devolution will help to deliver this and most importantly ensure that Hampshire, Portsmouth, Southampton and the Isle of Wight doesn’t get left behind.\nPls click on the link below to complete the 2 min survey. Please share",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk/content_1.html": "Latest News\nFind me on Facebook\nContact\nPolice and Crime Commissioner's Office\nUnit 1, The Long Barn, Dean Estate, Wickham Rd, Fareham PO17 5BN\nHampshire and Isle of Wight Conservatives\nOffice 1, Folly Hill Farm, Itchen Stoke, Alresford SO24 9TF\nI'm Donna Jones and I'm the Conservative Police and Crime Commissioner for Hampshire and the Isle of Wight. Here you can find my news, what I stand for and more about me.\nIf you wish to contact me in my role as PCC, please do so online:\nhttps://www.hampshire-pcc.gov.uk/contact-us\nI'm here to help, so please don't hesitate to get in touch.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_police-desks-district-council-offices-gets-thumbs/content_28.html": "It’s great news that police officers serving the New Forest West Area are now based in the District Council offices in The Avenue, Lymington.\nSpending less on buildings means more can go on fighting crime. Not only that, once COVID restrictions allow, members of the public will be able to report crimes and anti-social behaviour face-to-face Monday to Friday during office hours.\nThe police in Hampshire have a good record of working collaboratively with local authorities and the fire service. This move is yet another example of that.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_pcc-commits-freeing-police-officer-time-mental-health-specialists-control-room/content_22.html": "The Police and Crime Commissioner, Donna Jones, has introduced a Mental Health Deployment Coordinator role to make sure callers experiencing a mental health crisis get the right support.\nThe new position will ensure vulnerable people who call the police are professionally assessed by a specialist working in the control room to identify the right agency to support the person.\nFor a long time, police have attended to people in a mental health crisis which has taken them away from front line duties. The new position, which is funded by the Police and Crime Commissioner, is being piloted in collaboration with South Central Ambulance Service with the aim to reduce the demand on policing by freeing up officer hours to ensure fighting crime and building safer communities can remain the police’s core focus.\nThe introduction of the role coincides with Mental Health Awareness Week which runs from Monday 13 to Sunday 19 May 2024.\nPCC Donna Jones said: “The rise in the number of calls coming in that are related to people who are experiencing a mental health crisis is growing every year. That’s putting a lot of pressure on police resources and police time.\n“A trained mental health coordinator working in the control room will triage calls swiftly to identify the right agency to support the person in need thereby allowing more police time to be available to respond to the crimes.\n“The police are seldom the appropriate first agency to respond to those suffering mental health episodes. My ambition is to free up police time, increasing their ability to respond to crimes whilst ensuring those in need receive compassionate support from health professionals.”\nThe post supports the Right Care Right Person (RCRP) initiative that was introduced in July 2023 as part of a national partnership agreement rolled out across England and Wales. The approach involving the local NHS, ambulance trusts and local authorities is predicted to save around one million police officer hours nationally each year.\nPCC Donna Jones added: “As Police Commissioner, it’s my job to oversee and support the delivery of the Right Care Right Person initiative in Hampshire and the Isle of Wight. This mental health deployment role is a vital step in providing that correct care by being a vital link to coordinate the responses of police, ambulance and mental health services.”\nThe effectiveness of the role will be tracked to determine the impact on freeing up police time and officer hours.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_welcome-new-fund-fight-burglaries/content_19.html": "Donna Jones welcomes additional Safer Streets Funding\nHampshire and the Isle of Wight is set to benefit from new government funds to help tackle crime and to stop offences that blight communities and cause misery to victims from happening in the first place.\nThe money, from the Safer Streets Fund, is aimed at improving security in areas particularly affected by acquisitive crime, such as burglary, vehicle theft and robbery. These offences are the crimes that the public are most likely to encounter, and they are estimated to cost society billions of pounds every year.\nThe £549,991 of new funding will go towards measures proven to cut crime. These include simple changes to the design of streets such as locked gates around alleyways, increased street-lighting and the installation of CCTV. The funding will also be used to train community wardens, deliver local crime prevention advice to residents and establish Neighbourhood Watch schemes.\nThis additional funding comes alongside the Government’s commitment to recruit 20,000 additional police officers over the next three years, and the £1.1 billion funding boost for the policing system for 2020-21.\nCommenting, Donna Jones, the Conservative candidate to be the Police and Crime Commissioner for Hampshire and the Isle of Wight said:\n“This Government was elected on the promise to crack down on crime and make our streets safer, and the cash announced today for Hampshire & the IOW will help deliver that.\n“This new money will help fund proven crime cutting measures, such as increased street lighting, CCTV and locked gates around alleyways – and I am confident that this will prevent and reduce crimes such as burglary and robbery in the areas that need it most.\n“I want people everywhere to feel secure in their communities and be able to live their lives free from the threat of crime, and this extra funding for Hampshire Police will help make that possible.”",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_category_Articles/content_18.html": "A plan for dog thefts 24th February 2021 Lockdown has driven up the demand for pets. This has meant higher prices, which in turn has driven up the profitability of pet theft. The number of reported... Articles\nPolice desks in District Council offices gets the thumbs up 16th October 2020 It’s great news that police officers serving the New Forest West Area are now based in the District Council offices in The Avenue, Lymington. Spending less on... Articles\nDonna launches Hampshire and IOW crime survey 18th August 2020 Police and Crime Commissioner candidate, Donna Jones, has launched a new crime survey. The more responses she gets, the more information she will have on what... Articles\nwelcome for new fund to fight burglaries 18th August 2020 Donna Jones welcomes additional Safer Streets Funding Hampshire and the Isle of Wight is set to benefit from new government funds to help tackle crime and to... Articles",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_events_feed/content_12.html": null,
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_privacy/content_8.html": "This document outlines how Donna Jones processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Donna Jones\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Donna Jones.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Donna Jones, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Donna Jones via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_dont-buy-e-scooter-and-enable-your-child-break-law/content_23.html": "The Police and Crime Commissioner, Donna Jones, has urged parents not to buy electric scooters for their children for Christmas.\nIt is legal to buy an e-scooter in the UK however insurance is required and it is not currently possible to get insurance for these devices. This means it is illegal to use them on the road or in public spaces such as parks, street pavements, and shopping centres.\nIn contrast to privately owned e-scooters, the official rental schemes are regulated and subject to controlled use in the local area hosting the trials. In order to use a rental electric scooter, riders must hold a provisional or full driver’s license with the rental company insuring the scooter.\nPCC Donna Jones said: “As Police Commissioner, it is my priority to ensure the safety and security of our communities. Too often we see people on privately-owned e-scooters riding dangerously on roads and pavements, breaking the law, being involved in anti-social behaviour, and putting other road users and pedestrians at risk.\n“If you buy your child an e-scooter, you are encouraging them to break the law and putting them at risk.”\nIn Hampshire and the Isle of Wight, e-scooter data reveals there have been two fatalities and 20 serious injuries dating back to 2021. The following year there were 33 serious injuries and in 2023 28 serious injuries. January to April this year saw a total of 14 serious injuries. Nationally, there were 1,292 collisions involving e-scooters last year and six fatalities.\nIn February this year, the Police Commissioner Donna Jones signed a contract to enable Hampshire & Isle of Wight Constabulary to enhance its powers and use existing legislation giving them the option to destroy any e-scooter or e-motorcycle that is being used in crime as part of Operation Crush.\nPCC Donna Jones said: “Since being elected as the Police Commissioner in 2021, the public have consistently told me they want the police to do more to crack down on e-scooters.\n“I continue to encourage the police to crack down on illegal scooter use, recognising this is a growing problem which clearly continues to cause concern for the public.\n“Whilst many people use e-scooters as environmentally friendly travel, there are clear dangers and privately owned e-scooters remain illegal to ride on the road and are often being used to commit crime.\n“Operation Crush sends a clear message. By removing illegally-operated e-scooters from circulation, criminal activity will be disrupted, the risk of injuries is reduced, and our streets will be safer. I’m looking forward to visiting the force’s Operation Crush site in the new year.”",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_category_Local-News/content_14.html": "My take on English Devolution 20th February 2025 ENGLISH DEVOLUTION - Do you want people living in England to have their say on improving local services & spending more of government money in our local... Local News\nHighest number of police officers for Hampshire & Isle of Wight Constabulary in a decade 31st January 2025 Police and Crime Commissioner Donna Jones has announced 90 more police officers for Hampshire and Isle of Wight Constabulary. The 90 extra roles will mean the... Local News\nCriminals dealt crushing blow as e-scooters and electric motorcycles destroyed 21st January 2025 More than 100 vehicles have been crushed by police in Hampshire and the Isle of Wight in the first year of the force’s crackdown on the illegal use of e... Local News\nDon’t buy an e-scooter and enable your child to break the law 19th January 2025 The Police and Crime Commissioner, Donna Jones, has urged parents not to buy electric scooters for their children for Christmas. It is legal to buy an e-scooter... Local News\nPCC and Chief Constable reopen another police station to the public 26th November 2024 Yateley Police Station has reopened to the public providing a significant boost to police visibility in the north of the county. The Police and Crime... Local News\nPolice and Crime Commissioner invests in new CSI facility 10th October 2024 Hampshire and Isle of Wight Police and Crime Commissioner Donna Jones has invested in a specialist new forensic facility to support crime scene investigations... Local News\nA new blue-light era in Portsmouth begins with the opening of the new Cosham Fire and Police Station 4th October 2024 The brand-new Cosham Fire and Police Station was formally opened today (4 September) with a ceremony at the impressive Portsmouth site. Fire crews have moved... Local News\nPolice and Crime Commissioner Donna Jones commends police officers at national bravery awards 12th July 2024 Police and Crime Commissioner Donna Jones has extended her heartfelt congratulations to the courageous police officers who have been honoured at the national... Local News\nPolice and Crime Commissioner Donna Jones calls on communities to help shape policing 10th June 2024 Police and Crime Commissioner Donna Jones has today (June 10) opened a public consultation to develop her next Police and Crime Plan. After being re-elected in... Local News",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_gallery/content_16.html": "Please find here a collection of pictures of Donna and her campaign. The campaign gives permission for any of these to be used by newspapers, radio and TV channels and by websites associated with the aforementioned. Permission may be withdrawn at anytime.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_donna-launches-hampshire-and-iow-crime-survey/content_29.html": "Police and Crime Commissioner candidate, Donna Jones, has launched a new crime survey. The more responses she gets, the more information she will have on what Hampshire and Isle of Wight what concerns people have about public safety and therefore the more she will be able to do to ensure police services match expectations.\nYou can take part by clicking here.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_police-and-crime-commissioner-invests-new-csi-facility/content_25.html": "Hampshire and Isle of Wight Police and Crime Commissioner Donna Jones has invested in a specialist new forensic facility to support crime scene investigations, forensic analysis, and evidence collection.\nThe Commissioner and the Chief Constable visited the new site the Police and Fire Strategic Headquarters in Eastleigh earlier this week.\nThe force’s scientific services department and CSIs, work in the new modern, fit-for-purpose building, alongside the Forensic Collision Investigation Unit and Serious Collision Unit – teams which investigate complex road traffic collisions.\nThe building has been named after Edmond Locard, a French criminologist and a pioneer in forensic science who became known as the ‘Sherlock Holmes of France’. He formulated the basic principle of forensic science, that ‘every contact leaves a trace’.\nThe new facility provides specialist teams with state of the art forensic labs and crime scene investigation kits for collecting physical evidence such as blood, hair, fibres, and soil. The laboratories will assist officers with initial DNA, fingerprint analysis and chemical examination, and a new digital forensics lab allows officers to analyse computers, mobile phones, and other digital evidence.\nThe building has been purpose built to ensure it meets the standards set by the Forensic Science Regulator (FSR).\nThe Commissioner and the Chief Constable met with the Head of Forensic Services Sam Howard, and the Head of Criminal Justice Matt Bourne to be given a tour of the building.\nDetermined to ensure Hampshire & Isle of Wight are at the forefront of policing, PCC Donna Jones, said: “This new forensic facility is a significant investment in the future of policing for Hampshire and the Isle of Wight. By providing forensic teams with cutting-edge tools and a purpose-built environment, I am enabling the force to operate at its very best. This modern, fit-for-purpose building will enhance the force’s ability to investigate and solve crimes, ensuring that officers and staff have the tools to uphold the highest standards of justice.”",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_newslettersubscribe/content_5.html": "Tweet Complete this form to join the email newsletter, delivering the latest news straight to your inbox.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_accessibility/content_2.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_about-rss/content_6.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news/content_20.html": "My take on English Devolution Thursday, 20 February, 2025 ENGLISH DEVOLUTION - Do you want people living in England to have their say on improving local services & spending more of government money in our local communities? Do you want to help shape where new roads are built, new houses, leisure centres & schools? Do you want young people to have a choice of employers and industries to pick from? If so, English devolution will help to deliver this and... Local News\nHighest number of police officers for Hampshire & Isle of Wight Constabulary in a decade 31st January 2025 Police and Crime Commissioner Donna Jones has announced 90 more police officers for Hampshire and Isle of Wight Constabulary. The 90 extra roles will mean the... Local News\nCriminals dealt crushing blow as e-scooters and electric motorcycles destroyed 21st January 2025 More than 100 vehicles have been crushed by police in Hampshire and the Isle of Wight in the first year of the force’s crackdown on the illegal use of e... Local News\nDon’t buy an e-scooter and enable your child to break the law 19th January 2025 The Police and Crime Commissioner, Donna Jones, has urged parents not to buy electric scooters for their children for Christmas. It is legal to buy an e-scooter... Local News\nPCC and Chief Constable reopen another police station to the public 26th November 2024 Yateley Police Station has reopened to the public providing a significant boost to police visibility in the north of the county. The Police and Crime... Local News\nPolice and Crime Commissioner invests in new CSI facility 10th October 2024 Hampshire and Isle of Wight Police and Crime Commissioner Donna Jones has invested in a specialist new forensic facility to support crime scene investigations... Local News\nA new blue-light era in Portsmouth begins with the opening of the new Cosham Fire and Police Station 4th October 2024 The brand-new Cosham Fire and Police Station was formally opened today (4 September) with a ceremony at the impressive Portsmouth site. Fire crews have moved... Local News\nPolice and Crime Commissioner Donna Jones commends police officers at national bravery awards 12th July 2024 Police and Crime Commissioner Donna Jones has extended her heartfelt congratulations to the courageous police officers who have been honoured at the national... Local News\nPolice and Crime Commissioner Donna Jones calls on communities to help shape policing 10th June 2024 Police and Crime Commissioner Donna Jones has today (June 10) opened a public consultation to develop her next Police and Crime Plan. After being re-elected in... Local News\nPCC commits to freeing up police officer time with mental health specialists in control room 17th May 2024 The Police and Crime Commissioner, Donna Jones, has introduced a Mental Health Deployment Coordinator role to make sure callers experiencing a mental health... Local News",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_contact/content_17.html": "Skip to main content\nDonna Jones\nPCC for Hampshire\nMain navigation\nHome\nAbout\nMore Police, Safer Streets\nGallery\nNewsletter\nContact\nDonna Jones\nPCC for Hampshire\nContact\nLeave this field blank\nPolice and Crime Commissioner's Office\nUnit 1, The Long Barn, Dean Estate, Wickham Rd, Fareham PO17 5BN\nMedia Enquiries\nUnit 1, The Long Barn, Dean Estate, Wickham Rd, Fareham PO17 5BN\n[email protected]\nHampshire and Isle of Wight Conservatives\nOffice 1, Folly Hill Farm, Itchen Stoke, Alresford SO24 9TF\n[email protected]\nDonna on Facebook\nDonna on Twitter\nDonna on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_about-donna-jones/content_7.html": "Donna Jones was born in Portsmouth and still lives in the city with her husband Neil and their two sons. She attended local schools and went to college in the area.\nDonna was first elected as the Hampshire & Isle of Wight Police and Crime Commissioner in 2021 and then was re-elected in 2024. Donna has delivered on her priorities including reopening local police stations and front counters, bringing back local bobbies, and providing 650 more police officer on our streets.\nAfter travelling around Europe, Donna started working for the Halifax Building Society (now part of the Lloyds Banking Group). She completed her professional banking and investment exams and worked for the bank until she was elected on to Portsmouth City Council in 2008.\nDonna is the only woman to have served as Leader of Portsmouth City Council (2014-2018). She received national recognition for the unique approach she adopted in pursing an income generation strategy to mitigate reductions in public spending.\nDonna has been a Magistrate for fifteen years and was the youngest member of the judiciary in England and Wales when appointed in 2005.\nShe sits on the board of the National Museum of the Royal Navy and the national Children’s Charity, A world of Friends. She is a Non-Executive Director of Portico Ltd (formerly MMD Shipping).",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_plan-dog-thefts/content_26.html": "Lockdown has driven up the demand for pets. This has meant higher prices, which in turn has driven up the profitability of pet theft. The number of reported crimes has risen sharply. That cannot be allowed to stand.\nDonna Jones is calling for stiffer penalties and greater police action. This will need legislative changes as well as local police action. She wants:\n- the government to change the law so that the theft of a pet is treated more harshly than the theft of an inanimate object of the same value\n- the police locally to deploy greater resources in the fight against pet theft\nShe said “Dogs and cats aren’t just property, for many people they are family members. We need to stamp out pet theft. Hampshire Constabulary is growing in size. Some of the extra capacity that these extra officers will bring should be used to stop and reverse the huge increase in pet theft that we have seen.”\nThe price of puppies has risen by 131% and thefts by 51%\nYou can read more about the campaign to protect pets at https://www.pettheftreform.com or take Donna's survey at https://www.donnajones.org.uk/form/dogtheft-survey",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_police-and-crime-commissioner-donna-jones-commends-police-officers-national-bravery-awards/content_15.html": "Police and Crime Commissioner Donna Jones has extended her heartfelt congratulations to the courageous police officers who have been honoured at the national police bravery awards.\nSgt David Gibbs, PC Tim Clarkson, PC Scott Thomson, PC Nathan Fulton and PC Emma Davies from Hampshire & Isle of Wight Constabulary won the South East region award at the annual Police Federation event last night (Thursday 11 July).\nThe officers demonstrated exceptional valour and commitment to public safety, earning them well-deserved recognition, after they were confronted with a man holding a gun and armed with two explosive bags in Gosport last year.\nThe officers had gone to the man’s address to make an arrest regarding an un-related matter. When they entered the property the man was holding a gun. The man then activated explosive bags strapped to his body which began omitting smoke. Thankfully the makeshift bomb did not detonate properly and the officers were valiantly able to apprehend the man using a Taser.\nThe bravery awards recognise officers who have faced significant risks and challenges in the line of duty. The ceremony honoured officers up and down the country for various acts of heroism, including life-saving interventions, confronting armed suspects, and handling dangerous situations with exceptional skill and bravery.\nHonouring their commitment to outstanding public service and personal sacrifice, PCC Donna Jones said: “Their actions have not only protected lives but also reinforced the public’s trust in the police force.\n“These officers were confronted with a terrifying situation. In imminent danger which is incomprehensible to most of us, they went above and beyond in the line of duty to protect the community.\n“Their acts of bravery are a testament to their dedication and the incredibly high standards of the Constabulary. These awards rightly highlight the extraordinary lengths police officers will go to ensure the safety and security of the public.”\nAttending the event, PCC Donna Jones said: “I was delighted to watch the officers receive this national recognition. They are truly inspiring and rightly remind us of the critical role that our police force plays in maintaining peace and order.\n“We owe them a debt of gratitude for their unwavering commitment to our safety.”",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_new-blue-light-era-portsmouth-begins-opening-new-cosham-fire-and-police-station/content_21.html": "The brand-new Cosham Fire and Police Station was formally opened today (4 September) with a ceremony at the impressive Portsmouth site.\nFire crews have moved 200 yards up the road from the previous site in Wayte Street, to the state-of-the-art, three-storey building shared with Hampshire & Isle of Wight Constabulary on Northern Road.\nFirefighters moved into their new home in mid-August, giving them time to settle into the larger site and take advantage of the modern facilities on offer. Neighbourhood Policing Teams, Neighbourhood Enforcement Teams and new Missing Locate Teams will work from the new building alongside fire and rescue colleagues.\nChief Fire Officer Neil Odin and Police and Crime Commissioner Donna Jones welcomed the Lord Lieutenant Nigel Atkinson to open the building in a ceremony held earlier today (4 September).\nPolice and Crime Commissioner, Donna Jones, who unveiled the Constabulary’s plaque, said: “This new station puts policing in the heart of north Portsmouth and marks my commitment to investing in the safety of the community. It’s paramount for policing to be in the right place, and work from modern, fit-for-purpose buildings which help them do their job and serve the public.\n“As Commissioner, I am on a mission to transform the police estate to support the Chief Constable’s operational model and deliver exceptional neighbourhood policing. The teams located here are ready to bring a blue-light visibility into the community and respond to calls from members of the public.”\nThe new station will bring an increased police visibility to the north of Portsmouth. Officers and staff from the Eastern Police Investigation Centre on Airport Service Road and Medina House will be moving into the new building, placing police teams in the heart of the community ready to respond to calls from members of the public.\nThe building is fit-for-purpose with improved IT and conference facilities, aligning with the operational policing model and Police and Crime Commissioner’s vision for the police estate, ensuring that police are in the right space and right place to serve communities.\nFollowing approval from the Fire Authority to go ahead with the project, the ground was broken back in February last year, before a topping out ceremony took place last October.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_feed/content_10.html": null,
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_pcc-and-chief-constable-reopen-another-police-station-public/content_24.html": "Yateley Police Station has reopened to the public providing a significant boost to police visibility in the north of the county.\nThe Police and Crime Commissioner, Donna Jones, and the Chief Constable Scott Chilton presided over the official opening today (Tuesday 26 November 2024).\nA brand new front counter with public access is now open at the police base on Royal Oak Close. Members of the public will be able to go in and report a crime, get updates, share information, or seek help and support.\nThe front counter will be open to the public on Tuesdays and Thursdays from 9:30am to 3pm, and on Saturdays from 9am to 2:30pm.\nYateley is the latest police station to open as part of the Commissioner’s pledge to reopen 10 more police stations and front counters to drive up visibility and connect the public to their police force once more.\nPCC Donna Jones said: “I was pleased to be in Yateley today to reopen the police station’s front counter alongside Chief Constable Scott Chilton. Police officers and staff have always worked in the building but it was closed to the public in 2012. From today, its doors will be open to welcome residents, businesses and visitors once more.\n“I am absolutely delighted to deliver this for the people of Yateley who have unequivocally told me they want to see their police station open for business.”\nYateley Police Station is the sixth police station this year to be opened by the Police and Crime Commissioner. By the end of 2024, seven will have been unveiled. More police stations are due to be opened in Hampshire to the public next year.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_criminals-dealt-crushing-blow-e-scooters-and-electric-motorcycles-destroyed/content_11.html": "More than 100 vehicles have been crushed by police in Hampshire and the Isle of Wight in the first year of the force’s crackdown on the illegal use of e-scooters, e-motorbikes and more.\nThe illegal use of privately owned, powered, two-wheel vehicles such as e-scooters and off-road electric motorcycles is an issue which has been a blight on many of our communities in recent years.\nThis growing issue has also seen a rise in these vehicles being used to commit serious crimes while also putting the riders of these vehicles and other road users at risk of serious injury, due to the careless and dangerous manner in which they are often used.\nRecognising the steady increase in the popularity of these vehicles and the risk they pose to our communities, last year the Police Commissioner and Crime Commissioner, Donna Jones, signed a contract to enable the force to enhance the powers of its officers by using existing legislation to give them the option to destroy any e-scooter or e-motorcycle that is being used in crime.\nKnown as Operation Crush, this targeted campaign has already been a success. In 2024, Hampshire & Isle of Wight Constabulary seized 105 of these vehicles, an increase from 41 in 2023. These were all used illegally or were involved in another crime and have since been destroyed so they don’t end up back in the hands of criminals.\nMore than 50 of the vehicles seized in 2024 were e-scooters. While all privately-owned e-scooters are currently not road legal, we are primarily focused on targeting our enforcement activity on the vehicles used in crime, anti-social behaviour and dangerous driving. The e-scooters we seized including several involved in road traffic collisions and some used by riders who were under the influence of drink or drugs.\nElectric motorbikes and off-road petrol-powered motorcycles are a significant risk to our communities because these are often linked to more serious crime. Knives and drugs were also seized alongside these vehicles last year and they were often used in a persistently dangerous manner, putting the lives of the riders and other innocent road users at risk.\nOfficers seized 26 e-bicycles in 2024. These are sometimes referred to as Electrically Assisted Pedal Cycles (EAPCs) and are road legal. However, there are several rules around these vehicles and the ones we seized were all modified so they could propel the rider to dangerous and illegal speeds. In some instances, they were even ridden on major routes such as the A27 and the M3 at great risk.\nTackling the illegal use of e-scooters is a key priority in the Police Commissioner’s new Police and Crime Plan ‘More Police, Safer Streets 2’. Over 55% of the 10,362 people who responded to its public consultation said they wanted the police to do more to tackle the dangers of e-scooters.\nPCC Donna Jones added: “Since being elected as the Police Commissioner in 2021, the public have consistently told me they want the police to do more to crack down on e-scooters. Too often we see people on privately owned e-scooters riding dangerously on roads and pavements breaking the law. I have seen a number of dangerous collisions, particularly on pavements, which have resulted in people suffering significant injuries, some of them life changing.\n“Whilst many people use e-scooters as environmentally friendly travel, residents and road users have a right to be concerned about the dangers of privately owned e-scooters which are illegal to ride on the road and are often being used to commit crime.\n“My message is absolutely clear – if you choose to operate an e-scooter illegally you will face the consequences and to the criminals and drug gangs using them, they will be seized and destroyed.”",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_highest-number-police-officers-hampshire-isle-wight-constabulary-decade/content_9.html": "Police and Crime Commissioner Donna Jones has announced 90 more police officers for Hampshire and Isle of Wight Constabulary.\nThe 90 extra roles will mean the Commissioner has enabled the force to increase its police officer numbers by 815 since 2020. Once recruited, it will mean the force will have the highest number of police officers in over a decade.\nThis decision came after the Police and Crime Panel supported her 2025/26 budget proposal on Friday 31 January which outlined funding for 50 more police officers through an increase in council tax. The extra 40 police officers has been made possible following the government’s announcement to provide forces with an extra £100 milllion to boost neighbourhood policing. The Constabulary’s share of the £100 million equates to £2.6 million per year allowing the Commissioner to pledge 90 more officers to serve communities.\nSpeaking on the announcement, the PCC Donna Jones said: “The year-on-year increase in police officer numbers and falling crime rates is a testament to Chief Constable Scott Chilton’s back-to-basics approach to crime fighting, supported by sound financial management.\n“Hampshire & Isle of Wight Constabulary is one of the fastest improving forces in the country. We are leading the way in neighbourhood policing with the successful implementation of my Local Bobby scheme; we now deliver one of the best performing 101 and 999 services nationally; charge rates have gone up by 34%, crime has gone down by almost 7,000 crimes a year, and the force’s response to shop theft has been heralded as one of the best in the country by retailers.\n“We also have one of the largest reductions in knife crime nationwide, anti-social behaviour has plummeted by over 50% since 2021, and we have opened seven more police stations to the public over the last 12 months.\n“It has been another transformative year. The Chief and I agree, this momentum must continue. As part of the extra 90 police officers announced today there will be 15 officers added to my Local Bobby scheme to drive up police visibility in rural areas.”\nYear-on-year police officer recruitment\n- 2020 – 2023 + 600\n- 2023 – 2024 + 50\n- 2024 – 2025 + 75\n- 2025 – 2026 + 90\n- TOTAL = 815 additional police officers funded",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_cookies/content_3.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_news_police-and-crime-commissioner-donna-jones-calls-communities-help-shape-policing/content_27.html": "Police and Crime Commissioner Donna Jones has today (June 10) opened a public consultation to develop her next Police and Crime Plan.\nAfter being re-elected in May, the Commissioner is keen to begin gathering feedback from the public on how she can work with the Chief Constable over the next four years to deliver a best-in-class police force.\nThe Commissioner’s duty as an elected official is to listen to public concerns and set the local policing priorities on the public’s behalf.\nEach priority in the new plan will be designed based on direct feedback from residents.\nPolice and Crime Commissioner Donna Jones said: “As your Commissioner, I represent you and your concerns. My role enables you to have a direct say on policing in your area and holding your police force to account.\n“Being re-elected as your Police and Crime Commissioner for a second term is an overwhelming endorsement of the work I’ve delivered to date, specifically the recruitment of 650 additional police officers, bringing back named and contactable Local Bobbies for every community and opening 10 more police stations and front counters. What’s next? That’s up to you.\n“Now, I want get started on the next four years. By hearing from you, I can develop policies and initiatives that resonate with the unique needs of where you live.\n“Your views will form the bedrock of my new Police and Crime Plan which is why I want to hear from as many people as possible.”\nThe Commissioner fulfilled all of the public’s pledges in her previous Police and Crime Plan More Police Safer Streets.\nThe survey to inform the next plan will be open for 10 weeks from June 10 – August 19.\nThe results will be published in the autumn.\nIn developing the Police and Crime Plan, the Police and Crime Commissioner has a statutory duty to obtain the views of local people and victims of crime on matters concerning policing in the area, and obtain the views of local people and victims of crime on the plan itself. The Home Secretary sets the Strategic Policing Requirement which includes current national threats and the national policing capabilities required to counter them. National Policing Priorities are also identified. The job of the Police and Crime Commissioner is to listen to communities and set the local policing priorities on the public’s behalf.",
  "https_www_donnajones_org_uk_/https_www_donnajones_org_uk_cdn-cgi_l_email-protection/content_13.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}