{
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-west-mp-refuses-to-back-bill-to-stop-puppy-smuggling-and-pet-theft/content_91.html": "Reading West MP refuses to back bill to stop puppy smuggling and pet theft\nAlok Sharma MP has refused to back a bill to end puppy smuggling, pet theft and live animal exports from the UK.\nOn the 21st of June, the opposition attempted to force the Government to bring back the Animal Welfare (Kept Animals) Bill. Weeks earlier the Government had dropped the Bill, breaking a manifesto promise to put an end to puppy smuggling, pet theft and live animal exports.\nThe Liberal Democrats re-tabled the Government puppy smuggling bill and called on Conservative MPs to honour their manifesto pledge. But the Tory MPs including Alok Sharma refused to back the motion and instead launched yet another consultation.\nReading Liberal Democrats have criticised this move, accusing the government of breaking another manifesto promise, turning their back on puppies and allowing traffickers to exploit the pet market.\nThe party has launched an online campaign and petition to end puppy smuggling and is urging pet owners and residents of Reading to sign at libdems.org.uk/puppy\nLeader of the Liberal Democrats on Reading Borough Council, Councillor James Moore said:\n“The Conservative party promised to deliver this Bill in their election manifesto, and the Government even drafted the wording of the new law. It is shameful that Alok Sharma has broken the party’s promise to protect animals from cruel smuggling gangs.\n“Alok Sharma and this Conservative Government have left pet owners, animal welfare charities and residents of Reading rightfully angry.\n“The Liberal Democrats want to see greater protections for puppies, with criminals who target our beloved pets handed harsher punishments.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-lib-dems-call-for-carers-minimum-wage-as-vacancies-spiral-to-330/content_57.html": "Reading Lib Dems call for Carers’ Minimum Wage as vacancies spiral to 330\nThe Liberal Democrats are calling for a higher minimum wage for care workers in Reading, to tackle chronic staff shortages in social care.\nIt comes as the latest figures reveal Reading has 330 job vacancies in the social care sector, meaning there is a vacancy rate of around 9.2%.\nThese chronic staff shortages are leading to patients being left stuck in hospitals waiting for social care, contributing to record-breaking waits in A&E and dangerous treatment delays.\nUnder the Liberal Democrat plans, social care workers would be paid at least £2 an hour more than the current minimum wage, bringing their pay up to at least £11.50 an hour today - and £12.42 from this April. The proposals would benefit up to 3,100 people working in the social care sector in Reading.\nCommenting, Liberal Democrat Councillor for Tilehurst, Anne Thompson said:\n“The social care crisis is having a devastating impact on vulnerable people’s wellbeing, and contributing to record long waits at A&E, and terrible delays in receiving treatment.\n“Too many people in Reading are stranded in hospital beds because there simply aren’t enough care workers to look after them at home or in a care home.\n“The first step to fixing this mess is to pay those working in social care more, to prevent the exodus of workers to supermarkets and other better paid jobs. I have seen first-hand the incredible job that care workers do day in and day out. This is a skilled and crucial job and it should be paid more.”\nCommenting, Leader of the Liberal Democrats Ed Davey added:\n“It is heart-breaking that millions of elderly and vulnerable people across the country are struggling to get the care they need and deserve. Our NHS is collapsing and social care is completely broken after years of broken Conservative promises.\n“The Conservatives’ neglect of social care services has caused an exodus of staff to better paying jobs. Our plan for a Carers' Minimum Wage would tackle these chronic staff shortages in social care, and help take pressure off the NHS.”",
  "http_www_readinglibdems_org_uk_/https_www_readinglibdems_org_uk_about_people_councillors/content_34.html": "Our Councillors\nThe Liberal Democrat councillors on Reading Borough Council work hard for their communities all year round, not just at election time. All three are engaged with the work of the council, holding both Reading's Labour local government and the national Conservative government to account and demanding a fair deal for Reading.\nCouncillor James Moore (right) is the leader of the Liberal Democrats on Reading Borough Council, representing Tilehurst. He works for a well-known toy company and is a former chair of the Reading Campaign for Real Ale.\nCouncillor Anne Thompson (centre) is the deputy leader of the Liberal Democrats on Reading Borough Council, representing Tilehurst. She is a professional translator between English and a variety of Eastern European languages.\nCouncillor Meri O'Connell (left) is the whip of the Liberal Democrats on Reading Borough Council, representing Tilehurst. She is a popular teacher in a nearby secondary school.\nContact James: james.moore@readinglibdems.org.uk\nContact Anne: anne.thompson@readinglibdems.org.uk\nContact Meri: meri.oconnell@readinglibdems.org.uk",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-3/content_24.html": "Lib Dems announce plans for free school meals for over 3,000 more primary school children in Reading\nThe Liberal Democrats have announced their ambition to extend free school meals to all primary school children, beginning with all children in poverty across both primary and secondary schools.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-announce-five-year-plan-to-give-patients-in-reading-west-mid-berkshire-the-right-to-see-a-gp-within-a-week/content_54.html": "Lib Dems announce five year plan to give patients in Reading West & Mid-Berkshire the right to see a GP within a week\nThe Liberal Democrats have announced that their five-year plan to give patients in Reading a legal right to see a GP within a week, or in 24 hours if in urgent need, will be in their General Election manifesto.\nLast year there were over 546,000 appointments in Berkshire West, where patients had to wait for more than two weeks, equating to around 1 in 5 of all appointments. This included a staggering 131,000 where patients had to wait longer than a month, almost 1 in every 20 appointments.\nThe number of disturbingly long waits in our area has been getting worse. In 2022, there were over 465,000 where patients waited over two weeks, or around 1 in 6 of all appointments. Last year this shot up drastically to over 546,000.\nThe Liberal Democrats have said that under their plans, patients will no longer be left waiting for an appointment and risk their conditions getting worse.\nThe party will deliver the plan by:\n- Increasing the number of full-time equivalent GPs by 8,000, half by boosting recruitment and half from retaining more experienced GPs.\n- Freeing up GPs’ time by giving more prescribing rights and public health advisory services to qualified pharmacists, nurse practitioners and paramedics.\n- Introducing a universal 24/7 GP booking system.\n- Removing top-down bureaucracy to let practices hire the staff they need and invest in training.\n- Reading Liberal Democrats said that this Conservative government had “abandoned local health services” and called for a “fair deal for this community's patients”.\nHelen Belcher OBE, Liberal Democrat candidate for Reading West and Mid Berkshire, said:\n“This Conservative government has driven our area’s local health services into the ground. Thousands of patients in Reading and the surrounding area are facing agonisingly long waits, often in terrible pain whilst waiting to see their GP.\n“The Conservative party have proven themselves totally unfit to run our NHS. They have abandoned local health services and it is patients bearing the brunt of their neglect.\n“Many conversations with local people show that many are now afraid of falling ill, fearing that they won’t be able to access the healthcare they need.\n“It should not be too much to ask for patients to be able to see their GP when they need to. That is why the Liberal Democrats have committed to a fair deal for this community’s patients and legal right to see a GP within a week.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_cutting-second-class-deliveries-would-be-a-slap-in-the-face-for-local-residents/content_28.html": "Cutting second-class deliveries would be a “slap in the face” for local residents\nReading Liberal Democrats have slammed proposals that would allow Royal Mail to significantly reduce the deliveries of second-class post, including scrapping Saturday delivery and only delivering on alternating days during the week. They say small businesses and residents will be “dismayed.”\nMany Reading residents rely on postal services to obtain details of medical appointments, manage their finances, and receive correspondence from loved ones.\nCommenting on the news, Leader of the Liberal Democrats on Reading Borough Council, Councillor James Moore said:\n“This is a slap in the face for all those who rely on the post. Many residents in Reading will be disappointed about the prospect of cuts to postal services, after facing years of ever-rising costs due to mismanagement by Royal Mail executives.\n“Many small businesses in Reading will also be dismayed by this news. They have already had to endure a crippling National Insurance hike and this would add even more pressure on them.\n“We cannot let standards slip even further by lowering delivery targets instead of fixing our postal services. These recommendations must be urgently reconsidered.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_over-140000-children-not-seen-by-an-nhs-dentist-in-buckinghamshire-oxfordshire-and-berkshire-west-over-the-past-year/content_61.html": "Over 140,000 children not seen by an NHS dentist in Buckinghamshire, Oxfordshire and Berkshire West over the past year\n- 747,618 of Buckinghamshire, Oxfordshire and Berkshire West’s adults not seen by an NHS dentist in the past 2 years\n- Lib Dems call for boost to NHS dentistry so that no one is forced to pay hundreds of pounds for private care, along with cut to VAT on children’s toothpaste\nA total of 143,840 children in Buckinghamshire, Oxfordshire and Berkshire West have not been seen by an NHS dentist for at least a year, shocking new figures published by the Liberal Democrats have revealed.\nThe research, commissioned from the House of Commons Library, estimates the number of children who weren’t seen by an NHS dentist in the year to June 2023, based on the latest data from the health service.\nIt also revealed the proportion of children not seen by an NHS dentist in Buckinghamshire, Oxfordshire and Berkshire West. For the previous year, a staggering 41% of children had yet to be seen by an NHS dentist.\nThis is despite the NHS recommending that under-18s see a dentist at least once a year because their teeth can decay faster, compared to two years for adults. Tooth decay is also the leading cause of hospital admissions for children aged 6-10.\nIn Buckinghamshire, Oxfordshire and Berkshire West, 60.7% of adults have not been seen by an NHS dentist in the past two years. That equates to 747,618 people who went without dental care in the last 24 months.\nIt comes as the Liberal Democrats adopted their pre-manifesto at their autumn conference this year, including a commitment to reform NHS dentistry so that no one is forced to pay hundreds of pounds for private care\nThe party is also calling for an emergency rescue plan for NHS dentistry, including spending any funding that has gone unspent in recent years to boost the number of appointments as well as the removal of VAT on children’s toothbrushes and toothpaste.\nReading Liberal Democrat Councillor Meri O’Connell said:\n“Every parent knows how important it is to ensure that their children can see a dentist when they need to. Leaving children in pain can disrupt their eating, sleeping and learning.\n“This Conservative government has shown a total disregard for every aspect of our health service and the people of Reading are bearing the brunt of it. Wherever you look, the NHS is crumbling.\n“This has to act as a wake-up call for the government. A rescue package for Reading’s dentistry is urgently needed. That means reforming NHS dentistry to boost the number of appointments along with removing VAT on children’s toothbrushes and toothpaste.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_campaigns_tilehurst-car-parks/content_6.html": "Bring back the free half hour!\nAfter a hard-fought victory for Tilehurst in 2012 when its Lib Dem councillors got the first half-hour free for users of the Recreation Road and Dunstall Close car parks, Reading Labour have now unilaterally SCRAPPED it on weekdays, without any consultation.\nTilehurst's Lib Dem councillors say this is a disgrace - the free half-hour is a vital lifeline for local businesses and a real boost to local residents. We demand better for Tilehurst - and we're demanding the Council restore the free half-hour.\nPetition: Save Tilehurst's Free Half Hour\nWe, the undersigned, call on Reading Borough Council to reverse their undemocratic decision to scrap the free first half hour at the Dunstall Close and Recreation Road car parks without any vote or consultation, and to restore the free first half hour on weekdays.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-6/content_71.html": "Helen Belcher slams Government dental plan as \"too little too late\"\nDental plan “too little too late” for 144,000 children not seen by an NHS dentist in Berkshire West's integrated care board area\nDental plan “too little too late” for 144,000 children not seen by an NHS dentist in Berkshire West's integrated care board area\n- Reading Lib Dem Cllr James Moore calls on water firm to crack down on excessive pay - Lib Dem is “shocked” at no mention of sewage crisis in King’s Speech - Base pay and pension payouts for executives in England & Wales water industries rise to ne\nAlmost £70 million is needed to clear The Royal Berkshire Hospital repair backlog, new analysis by the Liberal Democrats has found.\nThe Labour Party opened selections for over 200 constituencies across the country which they do not consider to be “battleground seats”. Reading West and Mid Berkshire is the only one of the three seats in Reading Borough which is included on the list.\nThe Liberal Democrats have announced their candidates for the three new constituencies covering Reading for the next General Election\nReading Lib Dems slam Thames Water as “taking the mickey” for announcing price hikes after sewage, floods and service disruptions",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-west-mp-votes-to-cover-up-dangerous-school-buildings/content_112.html": "Reading West MP votes to cover up dangerous school buildings\nThe Liberal Democrats have condemned Alok Sharma MP after he voted to hide detailed data on crumbling school buildings in Reading.\nOn the 23rd of May, 296 Conservative MPs, including Reading West MP Alok Sharma, voted against publishing detailed information regarding the condition of every school building in the country.\nThe Department for Education was given the data following the Condition Data Collection survey conducted between 2017 and 2019.\nAfter pressure from Liberal Democrat Education spokesperson Munira Wilson, the Government revealed parts of the survey data, including that:\n- 7,158 schools in England contain at least one building component, such as a roof, door or light fittings, deemed to be “life expired and/or at serious risk of imminent failure”;\n- Almost nine in 10 schools have at least one building component that has a “major defect” or is “not operating as intended”.\n- Overall, more than 240,000 fixtures and fittings were found to be defective.\nHowever, the Government has still refused to confirm if schools in Reading have these defects and today voted to keep the information concealed despite a previous pledge to publish the data in full.\nReading Liberal Democrat Councillor Meri O’Connell said:\n“It is an absolute disgrace that Alok Sharma would vote to cover up whether our school buildings are built with dangerous or ‘life-expired’ materials.\n“Parents in Reading deserve to know whether their child is being sent to a school that is safe and fit for purpose, or to a school liable to collapse at any moment.\n“Reading Liberal Democrats believe that investing in education is investing in our future generation. Every crumbling school is a concrete sign of years of Conservative neglect of our public services. Parents, staff and pupils have all had enough of being taken for granted.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_gp-retirement-time-bomb-in-berkshire-west-revealed-with-22-nearing-retirement/content_108.html": "GP “retirement time bomb” in Berkshire West revealed with 22% nearing retirement\nThe Liberal Democrats have warned of a “GP retirement time bomb,” after new research by the party reveals more than 2 in 9 family doctors are nearing retirement age.\nIn Berkshire West, 22% of GPs are nearing retirement age, and 22 are over 60 years old.\nNationally, the analysis of NHS figures shows that almost 8,000 fully qualified GPs are over 55, making up 22% of the total. Of these, 3,700 (10%) were aged 60 or more while 1,470 (4%) were aged over 65. It comes as previous polling has found that almost half (47%) of GPs said they intend to retire at or before 60.\nThe Conservatives have failed to recruit the extra GPs that were promised in their 2019 manifesto. Instead, the number of fully qualified and full-time GPs has fallen by 2,165 since September 2015.\nReading’s Liberal Democrats are calling for a legal right for patients to see a GP within a week, or within 24 hours if in urgent need. This would be achieved through increasing training places for GPs, introducing reforms to retain experienced doctors and staff, and launching a recruitment drive to encourage those who’ve left the NHS to return.\nReading Liberal Democrat Councillor Meri O’Connell said:\n“Reading is facing a GP retirement time bomb that would make it even harder to get an appointment when you need one.\n“The Government has neglected our local health services and broken their promise to recruit more GPs. Their inaction has left far too many people in our community struggling to see their GP and get the care they need.\n\"The Liberal Democrats have set out a clear plan to ensure everyone can see their doctor within a week, or 24 hours if in urgent need. There is no time to waste in finally recruiting the extra GPs this government promised before this crisis gets even worse.\"",
  "http_www_readinglibdems_org_uk_/https_www_readinglibdems_org_uk_about/content_82.html": "A Fair Deal for Reading\nReading needs a change: a change from failure, a change from complacency. Reading deserves better than its current leadership locally and nationally - and the Liberal Democrats are demanding a fair deal for Reading.\nLiberal Democrats offer that change through our commitment to the environment, to the freedoms and duties that strengthen our society, to getting a better deal on public services, cutting crime, and radical policies to return power to local communities.\nWe offer a positive agenda – but it is change that we want to see, to match our ambition for the area.\nLiberals and Liberal Democrats have been working hard for Reading and winning elections here since the 1850s, including in Tilehurst, which has been represented by Liberals and Liberal Democrats continuously since the days of Jim and Paddy Day in the 1960s, right up to now.\nOur Values\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nAs Liberal Democrats, we believe that power should be dispersed into communities, rather than concentrated anywhere. We believe that communities and individuals should have the power and resources to make the best of themselves and society as a whole. Safeguarding the environment, and safeguarding and expanding our hard-won civic rights and freedoms (particularly for disadvantaged groups), are at the heart of what we believe.\nWe allow evidence to lead us and our beliefs to guide us: Liberal Democrats are often more willing to work with others to achieve our aims; if someone has a good idea, we will listen, and we will approach issues and decisions on their merits.\nThe Liberal Democrats rely on small donations from our hundreds of thousands of supporters across the country - we aren't bankrolled by big buisiness, shady elites, or trades unions. Our only vested interest is in the community we serve - and in our case, that's Reading. We live here, we love our town, we want to see it, its people and its communities thrive - and we think our approach is the best way to make that happen.\nThat's why we do what we do.\nIf you want to find out more about what Lib Dems believe, the Preamble to the Federal Constitution is the best expression of our values; if you want to find out how we'd put those values into practice in Reading, have a look at our most recent manifesto; or go here if you'd like to see how we'd do that nationally. If you'd like to know how we run our local party, you can find out about our people and read our own local constitution below too.\nAnd if you like what you see - why not join us?\nRemember: Conservatives want to concentrate power in the elite and do things to you;\nLabour want to concentrate power in the state and do things for you;\nbut Liberal Democrats want to give power back to the people and do things along with you.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-4/content_52.html": "Thank you from the Reading Lib Dems\nThank you to the thousands of people who voted for us in the 2024 local elections!\nThank you to the thousands of people who voted for us in the 2024 local elections!\nReading Lib Dems slam the council's closure of the Station underpass for the entire summer - and call for a better solution than the filthy Vastern Road underpass.\nTilehurst councillors voice outrage over scrapping of the weekday free half hour at Dunstall Close and Recreation Road car parks, without any vote\nThe Reading Lib Dems have launched their local election manifesto for 2024, including a headline 'six to fix' - and say Reading deserves better than Labour, the Conservatives, and Thames Water\nLib Dems vote to hold Thames Water to account for colossal failures - while Conservatives abstain and hide in the bathroom\nThree doctors, two young mums, and a reverend: the Lib Dems announce their 2024 candidates for Reading Borough Council",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-call-for-a-return-to-proper-local-health-services-as-figures-show-a-surge-in-patients-per-gp-in-berkshire-west/content_96.html": "Lib Dems call for a return to “proper local health services” as figures show a surge in patients per GP in Berkshire West\nThe analysis shows that there are now an eye-watering 2,475 patients for every GP in Berkshire West, an area that covers Reading, Wokingham and Newbury.\nAt the last election, the Conservative Party promised to recruit more GPs. However, today’s analysis reveals there are now almost 2,000 fewer fully qualified GPs in England compared to 2016. This includes a fall of 97 GP surgeries in the wider South East region over that period.\nSeparate figures uncovered by the Liberal Democrats have found that there are 547 fewer GP surgeries in England compared to 2019. This includes a fall of 97 GP surgeries in the South East over that period.\nLiberal Democrat Leader Ed Davey has pledged that the party would recruit more GPs and give patients a legal right to see a GP within 7 days, or 24 hours in an emergency. This would be achieved through increasing training places for GPs, a programme to retain experienced doctors and staff, and launching a recruitment drive to encourage those who’ve left the NHS to return.\nThe party is also calling for a rescue plan for social care, including setting a higher minimum wage for carers to tackle staff shortages and ensuring no one has to sell their home to pay for care.\nCommenting, Tilehurst Liberal Democrat Councillor Meri O’Connell said:\n“We need a return to proper local health services. People in Reading just want strong local health services but years of Government neglect have caused a GP shortage crisis, leaving people unable to see their local doctor when they need to.\n“Liberal Democrats would guarantee people a right to a GP appointment within one week so people can get the care they deserve. Boosting GP numbers would not only help people get appointments, but it would also reduce pressure on our hospitals and paramedics, saving crucial time and money elsewhere in the NHS.”\nLiberal Democrat Leader Ed Davey MP added:\n“Patients are paying the price for years of neglect under this Conservative Government, who have broken their promise to recruit more GPs. It shows ministers are taking local communities for granted.\n“It’s time these out-of-touch ministers made good on their promises to hire more doctors, cut waiting times and cleared the backlog.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_sewage-dumps-by-thames-water-more-than-double-in-the-last-year/content_107.html": "Sewage dumps by Thames Water more than DOUBLE in the last year\nSewage dumps by Thames Water more than DOUBLE in the last year\nNew figures released by the Environment Agency have shown that Thames Water, which covers Reading West and Mid Berkshire, discharged sewage a staggering 16,990 times last year, a 112% rise compared to 2022 - more than doubling the number of discharges.\nThe Liberal Democrats in Reading West and Mid Berkshire are calling for tougher action against sewage dumping in local rivers, including replacing OfWat with a tougher regulator. The party has also called for a ban on bonuses for water company bosses whose firms have dumped sewage into waterways and are allowing it to flood out again.\nConservative MPs have consistently voted against measures which would have helped to tackle the crisis, including MP for Reading West, Alok Sharma, MP for Newbury, Laura Farris, and MP for Wokingham, John Redwood.\nOn the 26th of March, West Berkshire Council voted to hold Thames Water to account for this scandal. Disappointingly, despite the shocking increase in sewage discharges in our area, Conservatives on West Berkshire Council abstained on the Liberal Democrats' motion, including their leader Cllr Ross McKinnon and other Conservative councillors in Reading West and Mid Berkshire, one of whom even went to hide in the toilets instead.\nLiberal Democrat candidate for Reading West and Mid Berkshire, Helen Belcher, said:\n“Is nothing sacred? It is a complete scandal that sewage is being pumped into West Berkshire’s rivers and waterways again and again and again.\n“Our communities should not be forced to put up with this any longer – nor should they put up with the Conservatives' pathetic response. The Conservatives have repeatedly voted to let Thames Water off the hook and against tougher action on sewage dumping.\n“And to add insult to injury, Thames Water shareholders have now decided that, rather than digging into their own pockets to fulfil their responsibilities, they want customers to pay again for the improvements that are desperately needed.\n\"Here in Reading West and Mid Berkshire, the Liberal Democrats have been leading the way in holding water companies to account and have called for tougher action to stop sewage being dumped in the Pang, the Kennet, and the Thames. Local Lib Dem councillors Matt Shakespeare and James Moore have been leading these calls and taking action, on both West Berkshire and Reading Councils - while the Conservatives, locally and nationally, have just sat on their hands.\n\"Thames Water and OfWat need to answer for this. Residents in Purley, East Ilsley, Hampstead Norreys, Sulhamstead and other affected communities need action now. We need a regulator who will take action, and a ban on bonuses for water company bosses whose firms have pumped sewage into our waterways, damaging our environment, endangering our wildlife. We need to make sure our local communities are protected.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-liberal-democrats-slam-thames-water-for-demanding-higher-bills-for-failing-services-and-calls-for-struggling-water-regulator-to-be-replaced/content_15.html": "Reading Liberal Democrats slam Thames Water for demanding higher bills for failing services, and calls for struggling water regulator to be replaced\nReading Liberal Democrats have criticised Thames Water for asking the water regulator for permission to charge their customers even more for failing services.\nThames Water are one of six firms asking the water regulator to allow them to dish out even higher bills for their customers. This means that people across Reading could have even more expensive water bills.\nCustomers of Thames Water are already set to see bills rise by £151 this April, an increase of 31%, all whilst they fill our seas and rivers with disgusting sewage.\nReading Liberal Democrats say it is not good enough, and that it is time for Ofwat to be replaced with a new regulator for failing to hold these greedy water companies accountable.\nLiberal Democrats across the country are campaigning to protect customers from failing water companies.\nLiberal Democrats Parliamentary Spokesperson for Reading Central, Henry Wright said:\n“It is scandalous that debt-ridden water companies demand higher bills from customers, whilst they continue to pump gallons of disgusting sewage into British seas and rivers.\n“Ofwat has failed to hold water companies accountable for their financial and environmental mismanagement. The government must knuckle down and replace Ofwat with a new regulator that has real power to ensure customers are not having to foot the bill for water company failures.\n\"Liberal Democrats will fight tooth and nail to protect customers from failing water companies like Thames Water and urge the government to reform the defunct water industry so that it works for customers, companies and the environment.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-borough-council-backs-carers-leave/content_111.html": "Reading Borough Council backs Carer's Leave\nReading Borough Councillors unanimously backed a motion calling for people in employment who also have caring responsibilities to be given a right to unpaid leave.\nA parliamentary Bill, the Carer's Leave Bill, proposed by Lib Dem MP Wendy Chamberlain is currently going through the House of Lords. Under the bill, carers who work will be able to take up to a week's unpaid leave per year flexibly in small amounts – from half days up to the whole week.\nThe motion was passed at the last full Council meeting of Reading Borough Council on Tuesday 28th February.\nReading Lib Dem Councillor Anne Thompson proposed a motion calling on the Council to support the Carer's Leave Bill. Anne said \"Over two million people in the UK including thousands of people here in Reading are in paid work whilst providing unpaid care.\n\"Unpaid Carers in work save the taxpayer a considerable amount of money in care costs. The least we can do is help them to balance their work and care responsibilities by giving them a week's unpaid leave.\n\"I'm glad the Borough Council unanimously supported the Carer's Leave Bill and I hope it passes through Parliament and into law.”\nWendy Chamberlain MP said \"I’m delighted to see Lib Dem representatives getting behind this new law. For the first time, carers will have their own employment rights, helping them to balance working and care. The Liberal Democrats have long fought for carers' rights and I look forward to working with the Reading Liberal Democrat group on this and other campaigns in the future.\"\nJames Moore, Lib Dem Councillor for Tilehurst said \"The burden placed on unpaid carers has left many overwhelmed and in need of more help and support for themselves, especially those providing long-term care for those living with chronic physical and mental health issues.\n\"This bill aims to reassure those working carers that if they need to take time off, they can do so without the fear of repercussions. Unpaid carers do so much to protect our underfunded care system and it is vital we support them in any way we can.\n\"Issues in the NHS are being exacerbated by chronic underfunding of social care. Liberal Democrats are coming up with innovative solutions to reduce the burden on the social care sector by supporting unpaid carers to do this vital work.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_the-liberal-democrats-will-put-childrens-mental-health-first-in-reading/content_88.html": "The Liberal Democrats will put Children’s Mental Health first in Reading\nReading Liberal Democrats are demanding that more is done to support children with mental health problems.\nThe number of children requiring mental health support has risen sharply during the last two years. The BBC have reported that those needing specialist help has risen by 77% while the 349,449 under-18s in touch with NHS psychiatric services in October 2021 was the highest on record.\nAt the same time spending on children’s mental health services has stagnated and the average waiting time for an appointment in Reading is 27 days.\nLocal Lib Dem campaigner Anne Thompson said;\n“Lockdown has had a lasting impact on many local children. The severe disruption children suffered during lockdown, and the adjustments they have had to make since, has led to a mental health crisis amongst children.”\n“The Conservative Government’s response to this crisis has been wholly inadequate. Overall only £79.70 is spent per child on children’s mental health services in Reading – compared to £225 across the country for each adult. To deal with the mental health crisis in schools they want to train existing staff who are already overstretched.”\n“The Lib Dems are calling on the Government to invest properly in children’s mental health by putting a trained and dedicated mental health professional in every school – and by introducing maximum waiting times for mental health services.”\n“The Lib Dems have previously called for a Children’s Catch Up fund to provide each school child in Reading with vouchers of at least £200 to catch up on education or experiences that were lost during lockdown.”\n“In many cases children have been the ones who have lost the most during lockdown. The Lib Dems want to put children front and centre of Britain’s covid recovery”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-13/content_67.html": "Call for Sewage Tax on Thames Water after £488.8m profit revealed\nReading Liberal Democrats have called for a ‘Sewage Tax’ on water companies to fund the cleaning up of rivers polluted by sewage dumps.\nReading Liberal Democrats have called for a ‘Sewage Tax’ on water companies to fund the cleaning up of rivers polluted by sewage dumps.\nThe Liberal Democrats have accused the Conservatives of leaving pensioners in Reading with a “hole in their pocket” after breaking a manifesto promise to protect the state pension.\n- Liberal Democrats call for fare freeze as cost of living crisis worsens - Annual season ticket for Reading commuters forecasted to reach £5044 for the first time - London travelcards for tube and bus services set to be scrapped for Reading passengers - 10% of people in Reading regularly commute by train\nAs Liberal Democrats, we believe in internationalism, democracy, and the right of people to live without fear. Ukraininan President Volodymyr Zelenskyy’s party is our sister party, and we are proud to stand alongside him and promote our shared values. Our party is pushing for the fiercest possible sanctions on the Russian Government. Lib Dem leader Ed Davey, who urged BP to pull out of Russian oil company Rosneft, is calling on all other British companies to follow suit. Our priority is to help the Ukrainian people. The Lib Dems are asking the British Government to resettle Ukrainian refugees in the UK without preconditions. Anything less would be a failure of moral leadership and leave thousands at risk.\nLots of you have contacted us about the land around the Kentwood Hill allotments, that is being put up for sale by the Tilehurst People's Local Charity. The Charity wants to use the proceeds to increase the financial support they can offer to Tilehurst residents during these times of ever-increasing living costs that are forcing people into poverty. Tilehurst Lib Dem Councillor Meri O’Connell says: “The Lib Dems believe that green spaces like this are precious assets which need protecting. The pressure to over-develop our area is having a major impact on our wildlife, our schools and our health services. We will oppose any development on our woodlands and parkland.\nThe Conservative Government is failing to deliver the promised 609 more police officers for Reading and the Thames Valley area.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-8/content_62.html": "More than three-quarters of all burglaries in the Thames Valley go unsolved\nMore than three-quarters of burglaries went unsolved in the Thames Valley in the 2022/2023 financial year - an average of 16 a day, new analysis has revealed.\nMore than three-quarters of burglaries went unsolved in the Thames Valley in the 2022/2023 financial year - an average of 16 a day, new analysis has revealed.\nThe Liberal Democrats have condemned Alok Sharma MP after he voted to hide detailed data on crumbling school buildings in Reading.\nAlok Sharma MP has refused to back a bill to end puppy smuggling, pet theft and live animal exports from the UK.\nAlmost three-quarters of car thefts (73.3%) in the Thames Valley went unsolved in 2022, analysis by the Liberal Democrats has revealed. Meanwhile, just 3.3% resulted in a charge or summons.\n404 children in Berkshire are stuck on NHS waiting lists for specialised dental care, including some with severe tooth decay or other serious dental problems, shocking new figures uncovered by the Liberal Democrats have revealed.\nNew analysis commissioned by the Liberal Democrats has revealed that in 2022, 3,696 bike theft cases in the Thames Valley were closed without a suspect being identified - a shocking 89.7% of total reported cases.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_make-sure-this-tory-government-dont-take-your-right-to-vote/content_90.html": "Make sure this Tory government don’t take your right to vote!\nLeader of the Liberal Democrats on Reading Borough Council, Councillor Meri O'Connell talks about voter ID in her latest 'From the Chamber' piece, also in Reading Today:\nMany people are unaware that for the first time they will be required to show photo ID in order to cast their ballot in May’s upcoming local elections. If they forget to bring ID or don’t have any that the electoral staff are allowed to accept – they will be refused the right to vote.\nDespite there being just 1 conviction and 1 caution for voter fraud across the entire UK in 2019, this current shambles of a Conservative government are pushing to spend an estimated £40 million over the next decade getting everyone to take ID to the polling station.\nWe in the Lib Dems are strongly opposed to this waste of time and money and are calling for the law to be repealed. The government’s own statistics on voter fraud show that photo ID is unnecessary and creates a barrier to residents exercising their democratic right to vote, particularly among marginalised groups and younger voters.\nFor the Conservatives to put such a tremendous amount of energy into this during a cost-of-living crisis, putting even more pressure on Reading Council’s budgets to implement it, is infuriating. It shows the Tory policy agenda does not match the priorities of local people and the massive challenges we collectively face.\nIn 2021 the average turnout in England’s local elections was just 35.9% of those registered to vote. I suspect this low turnout isn’t because people are content with how things are, but rather because they feel their vote won’t make any difference. With many voters feeling this fed up with politics, the last thing we need is another obstacle to taking part.\nOn the 1st of February this year only 10,000 people across the UK had actually applied for voter ID. According to an FOI from the Liberal Democrats, in Reading, only 35 people had applied! If you don’t have a driver’s licence, passport or bus pass with a photo on it, you should go onto the government’s website and look up ‘apply for photo id certificate’ (https://www.gov.uk/apply-for-photo-id-voter-authority-certificate). It’s free, and all you need is a recent digital photo and your National Insurance number. Alternatively you can register for a postal vote on Reading Borough Council’s website and cast your vote from the comfort of your own home (https://www.reading.gov.uk/the-council-and-democracy/elections-and-voting/register-to-vote/) - this is also free to do.\nHowever you prefer to vote – make sure that this Conservative government don’t take away your democratic right to participate in May’s local elections.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_about_constitution/content_13.html": "If you're viewing this on a mobile, you may need to tap the button to download the document in order to view it.\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-commit-to-triple-lock-to-protect-pensioners-in-reading/content_101.html": "Lib Dems commit to triple lock to protect pensioners in Reading\nThe Lib Dems have become the only major party to commit to the triple lock on pensions, supporting the 29,693 pensioners living in Reading East and West.\nThe party has committed to the triple lock in its draft manifesto for the next General Election adopted at its Autumn Conference this year. The commitment would ensure pensions rise in line with inflation, wages or 2.5% – whichever is highest.\nIt means the Liberal Democrats are the only major party to commit to maintaining the triple lock in future years, with both the Conservatives and Labour refusing to do so.\nThe Liberal Democrats said the policy would protect pensioners facing sky-high bills from the cost of living crisis, adding that pensioners deserve to have the security of knowing that the triple lock will be there to support them in future years.\nThe Liberal Democrats brought in the triple lock whilst in government, lifting 300,000 pensioners out of poverty. However, one in seven pensioners nationally still live in absolute poverty.\nReading Liberal Democrat Councillor Anne Thompson said:\n“Many pensioners in Reading are already worried sick about how to pay the bills, as the cost of heating and eating goes through the roof.\n“Now the refusal of both the Conservatives and Labour to commit to protecting pensions in future is causing even more anxiety for those struggling to get by.\n“The Liberal Democrats are proud that we brought in the triple lock, lifting thousands of pensioners out of poverty. We are committed to keeping the triple lock in place, giving people the security of knowing it will be there to support them in future years.\n“Pensioners should not be made to pay the price for years of economic chaos under the Conservative Party.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-slam-readings-labour-mps-for-supporting-tax-increase-on-gps-and-care-homes/content_10.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down a Lib Dem amendment which would have exempted health and care providers from the rise in employers’ national insurance.\nAs a result of the Government’s decision, local care homes, pharmacies, GPs and dentists face a national insurance tax hike despite the health service already being in crisis, and many of these providers are already on the brink of bankruptcy.\nReading Lib Dems said that our local Labour MPs had voted to burden GPs, care homes and pharmacies in Reading with a “health tax” and far from fixing local health services, they risked adding to already immense pressures.\nLocal Lib Dems called on the Chancellor to U-turn on this \"disastrous\" policy, so patients don’t have to pay the price of fewer health and care services.\nLiberal Democrat Councillor for Tilehurst, Meri O’Connell, said:\n“Our local Labour MPs have voted to hit GPs, pharmacies and care homes in Reading with a health tax, and patients in our area will pay the price.\n“After years of beyond shameful Conservative neglect, health services in our area are at breaking point, with many suffering on endless waiting lists.\n“Now the Labour government risks adding to those pressures. This disastrous jobs tax means that many GP surgeries and care providers will be hit with bills they simply cannot afford, leaving our community without the care we deserve and many more suffering through awful pain.\n“The Chancellor needs to see sense and reverse this health tax by exempting health and care providers from this foolish policy.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_thames-valley-bike-theft-practically-decriminalised-as-almost-90-of-thefts-go-unsolved/content_119.html": "Thames Valley bike theft practically ‘decriminalised’ as almost 90% of thefts go unsolved\nNew analysis commissioned by the Liberal Democrats has revealed that in 2022, 3,696 bike theft cases in the Thames Valley were closed without a suspect being identified - a shocking 89.7% of total reported cases.\nMeanwhile, only 67 bike thefts reported in the Thames Valley last year resulted in a suspect being charged or summonsed - just 1.6% of the total 4,119 cases recorded.\nReading’s Liberal Democrats warned these figures showed the Government was effectively ‘decriminalising’ bike theft, letting criminals off the hook for the stealing of thousands of pounds worth of property.\nThe party has accused the Conservative Government of neglecting neighbourhood policing. Police Community Support Officer (PCSO) numbers have also plummeted under the Conservative Party’s watch, with over 4,000 PCSOs being taken off the streets since 2015.\nLiberal Democrats are calling for a return to proper community policing, where officers are visible and trusted, with the time to focus on tackling local crime.\nCommenting on the figures, Reading Liberal Democrat Leader on Reading Borough Council, Councillor James Moore said:\n“Bike theft is personal. It has not been taken seriously and this must change. To see so many go unsolved in Reading is appalling.\n“These figures show the Government is effectively decriminalising bike theft in our local communities - our Tory Police and Crime Commissioner and ministers in Westminster seem content to let it continue.\n“We need to see a return to proper community policing, making our streets safer and ending this free-for-all for criminals.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_call-for-sewage-tax-on-thames-water-after-pound4888m-profit-revealed/content_69.html": "Call for Sewage Tax on Thames Water after £488.8m profit revealed\nReading Liberal Democrats have called for a ‘Sewage Tax’ on water companies to fund the cleaning up of rivers polluted by sewage dumps.\nIt comes as the Liberal Democrats have revealed Thames Water made a staggering £488.8m in operating profits last year. The figures, taken from Company House records, also show the water firm made £2,106.70m in revenue.\nThe local Liberal Democrats have demanded a new tax on water companies’ profits after repeated sewage dumps in the River Thames. The ‘Sewage Tax’ of 16% on water companies would create an emergency fund for cleaning up rivers. The policy was officially backed by the Liberal Democrats at their Spring Conference in March.\nNew analysis by the Liberal Democrats has revealed Britain’s nine water companies made a total £2.8bn in combined operating profits last year.\nThe move follows outrage at water companies discharging sewage into rivers over 400,000 times in 2020, according to the Environment Agency. Only 14% of England’s rivers are in good ecological health, according to the Rivers Trust.\nReading Liberal Democrat campaigner James Moore said:\n“These profits are absolutely scandalous. Our treasured local rivers have been polluted by disgusting sewage yet Thames Water is raking in massive profits without taking any action.\n“People around here are furious at how badly Thames Water treat our local environment\n“It is time our local Conservative MP Alok Sharma finally stood up to the Government and Thames Water, especially after he chaired the recent COP26 climate conference. We need a MP willing to take action against these sewage dumps in our river.”\nLeader of the Liberal Democrats Ed Davey MP said:\n“An environmental disaster is taking place in our towns, cities and villages, yet the Government shows no signs of taking action.\n“Last year the Government initially refused to ban sewage dumps in rivers, then they let water companies carry on as normal by failing to set meaningful timescales and targets. The very least they could do now is to force water companies to clean up their mess.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_seven-car-thefts-a-day-went-unsolved-by-police-in-the-thames-valley-last-year/content_72.html": "Seven car thefts a day went unsolved by police in the Thames Valley last year\nAlmost three-quarters of car thefts (73.3%) in the Thames Valley went unsolved in 2022, analysis by the Liberal Democrats has revealed. Meanwhile, just 3.3% resulted in a charge or summons.\nThe analysis, based on the latest Home Office statistics on crime outcomes, showed that a grand total of 2,667 car theft cases in the Thames Valley were closed in 2022 without a suspect even being identified - equivalent to 7 car thefts going unsolved every day.\nIt follows previous research from the Liberal Democrats which showed that police failed to even attend 3 in 4 car thefts last year.\nNationally, just one in thirty (3.4%) car thefts resulted in a suspect being charged.\nReading’s Liberal Democrats warned that the government is overseeing a “car theft epidemic”, as criminals act with impunity while victims are denied justice.\nThe party has slammed the Government for these figures, arguing that years of unnecessary Conservative cuts and putting resources in the wrong places has decimated community policing. Since 2015, the Conservatives have also taken over 4,000 Police Community Support Officers off the streets.\nLiberal Democrats are calling for a return to proper community policing - where officers are visible and trusted, with the time and resources to focus on preventing and solving crimes.\nCommenting on the figures, Councillor James Moore, Leader of the Liberal Democrat Group on Reading Borough Council, said:\n“These new figures are terrifying for people in Reading. It shows the extent of a car theft epidemic that the Conservatives are totally failing to tackle.\n“People just want to know that if their car is stolen or house broken into, the police will turn up and properly investigate it. But this Conservative government and the Tory Thames Valley Police & Crime Commissioner have decimated community policing, leaving victims of crime to fend for themselves.\n“The Liberal Democrats want to see a return to proper community policing, making our communities safer.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_campaigns_refurbish-meadway-rec/content_4.html": "Refurbish the Meadway Rec play area\nA lone swing, an empty space where the zip line used to be, and an ageing slide – this is the children’s playground at the Meadway Rec in Tilehurst. The play area desperately needs some attention. It serves five local schools – two of them for children with special needs from across our town – and is easy to reach by bus or car. Playgrounds all over Reading have had a revamp, but this part of Tilehurst has been left behind. I/we the undersigned call upon Reading Borough Council to refurbish the dilapidated play area at the Meadway Recreation Ground in Tilehurst. Our children deserve better.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-10/content_47.html": "Lib Dems call for a return to “proper local health services” as figures show a surge in patients per GP in Berkshire West\nThe Liberal Democrats have called for a return to proper local health services after new figures revealed a fall in the number of GPs in Berkshire West while patient numbers rise.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_introducing-our-2022-local-election-candidates/content_74.html": "Introducing our 2022 Local Election Candidates\nThe Reading Liberal Democrats are proud to introduce our team of candidates for the 2022 Reading Borough Council elections.\nCandidates have been confirmed across all 16 wards for the 2022 local elections here in Reading. The Local Government Boundary Commission for England has re-drawn the map of wards within Reading Borough Council, so we will be electing a whole new council this year - everyone will get three votes rather than the normal one. You can find out which of the new wards you're in here.\n20 Lib Dem candidates from all walks of life are standing as your local champions, from Abbey to Whitley. Each of our candidates will be a powerful voice for their local communities. Many of them already have strong reputations for working hard all year round.\nCouncillor Meri O'Connell, Liberal Democrat Group Leader on Reading Borough Council, said:\n“I'm so proud that we're announcing such a strong slate of candidates this year. People across Reading are telling us it's time for a change, and with the whole council up for election, we have a great opportunity, not only to send a message to the Conservatives nationally, but to send one to the Labour Party locally too.\nResidents have been telling us of their disgust at the behaviour of Boris Johnson and the Conservatives lately, whether it's the scandal around parties during last year's Coronavirus lockdowns, the Conservatives voting to allow water companies to keep spewing sewage into our rivers, or the shocking lack of action from the Home Office on settling Ukrainian refugees in the UK.\nBut equally, Reading has been run by the Labour Party for all but one of the last thirty years, and residents are fed up with them as well. With this slate of Lib Dem candidates, everyone in Reading has the opportunity to elect a real local champion for their neighbourhood.”\nSir Ed Davey MP, Leader of the Liberal Democrats, said:\n“This Liberal Democrat election campaign is all about your community. How we can help your community build back. How we can help local businesses on your high street, closed for months, to re-open, survive and thrive. How together we can make your community fairer, greener and more caring.\nSo, on the 5th of May, people have a fantastic opportunity to back their community, by backing people who believe in their community, people who will act for and with their community – their Liberal Democrat candidate.\nVote Liberal Democrat on the 5th of May and you’ll get a local champion who will get things done in your community. You’ll get a cleaner, greener neighbourhood where recovery comes first and local people are listened to.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_campaigns_royal-berkshire-hospital-rebuild/content_32.html": "Save the Royal Berks rebuild!\nThe Royal Berkshire Hosital was built in 1839 and has served as our area's main hospital since then. Parts of the main building still date back to that time, and the hospital was on the list of 40 hospitals on the previous government's 'New Hospitals' programme.\nOn Monday the 29th of July, Labour Chancellor Rachel Reeves announced a pause and review of this programme. In September, Labour Health Secretary Wes Streeting removed the RBH from the list of schemes that would progress with delivery.\nThe people of Reading deserve a hospital fit for the 21st Century, not the 19th. We think, whatever the outcome of the review, it's urgent that the Royal Berkshire Hospital rebuild is prioritised by the new Labour Government.\nPetition: Save the Royal Berkshire Hospital rebuild\nWe, the undersigned, call on the Labour Government to prioritise the urgently-needed rebuilding of the Royal Berkshire Hospital in its review of the New Hospitals programme.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_almost-49000-people-in-reading-waited-more-than-four-hours-in-ae-last-year/content_50.html": "Almost 49,000 people in Reading waited more than four hours in A&E last year\nThe number of patients waiting more than four hours in Reading’s A&E has risen by 152% compared with four years ago, Liberal Democrat analysis of House of Commons Library research reveals.\nThe data showed that in Reading, almost 49,000 people waited over four hours in 2023, almost 30,000 more than in 2019, a 152% increase.\nIn England as a whole, there were nearly 6.5 million waits of over four hours in 2023, up nearly 3 million since 2019. This comes as Liberal Democrat research revealed that the NHS budget is facing a £4.7 billion cut this year when inflation is taken into account.\nConditions can worsen significantly for patients who are not promptly seen, and the Royal College of Emergency Medicine has previously estimated that there were 23,003 excess patient deaths in England in 2022 associated with long waits.\nThe Liberal Democrats are calling on the government to reverse its nearly £5 billion of real terms cuts to NHS funding over this year and next, and invest more in local health services including A&E.\nLiberal Democrat Prospective Parliamentary Candidate for Earley & Woodley, Tahir Maher said:\n“Every year A&E delays keep getting worse under this Conservative government as hospitals in our area are starved of the funding they need, despite hard-working and over-stretched front-line workers.\n“These appalling delays are leaving often vulnerable and elderly patients in our area waiting for hours on end in overcrowded A&Es.\n“It is simply unthinkable that Rishi Sunak is now choosing to slash funding for the NHS further, while appalling figures like this are emerging. This will just pour petrol on the flames of the NHS crisis.\n“Reading deserves so much better than this Conservative government that is ignoring the suffering of patients and driving our health service into the ground. Every vote for the Liberal Democrats is a vote to fix the NHS and ensure people can access the care they need.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-mps-fail-to-support-motions-to-fix-health-and-care-crises/content_45.html": "Reading MPs fail to support motions to fix health and care crises\nReading’s Labour MPs have rejected two parliamentary motions to tackle the health and care crises.\nTabled as part of the Liberal Democrats’ first Opposition Day since 2009, the first proposal focused on the Carer’s Allowance repayments scandal, calling on the Government to write off existing overpayments and conduct a full review of support for unpaid carers.\nThe second motion urged Ministers to boost access to community healthcare, lambasting the current wait times for GP, NHS dentist and local pharmacy appointments. Shocking recent data uncovered by the Liberal Democrats revealed that in the last year, 45% of Brits have tried and were unable to get an NHS appointment. The statistics further indicated that 1 in 4 people have been unable to work because of this lack of access to appointments.\nThe Liberal Democrats’ proposal called for new healthcare mandates which would give everyone the right to see a GP within 7 days (or within 24 hours if in urgent need) and guarantee emergency access to an NHS dentist.\nDespite the huge strain on the NHS as we head into the winter months, Labour MPs voted against the motions. Reading Lib Dems criticised their decision as “deeply disappointing.”\nCommenting on the vote, Liberal Democrat Councillor for Tilehurst, Meri O’Connell said:\n“I’m deeply disappointed to see that the Labour Government opposed these motions.\nWhat was even more disappointing was to see our local MPs fail to support motions in Parliament that would see more support for health and care services in our community.\n“The state of local healthcare is dire and the carers’ overpayment scandal is a national disgrace. Families and pensioners across Reading are in desperate need of a fair deal.\n“That’s why Liberal Democrat MPs threw their support behind these measures - voting to rescue our GPs, NHS dentists, community pharmacists and of course our carers.\n“Locally, we’ll keep putting pressure on our local Labour MPs to do the right thing. Health and social care must be their top priority.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_511-people-in-reading-left-waiting-two-months-to-start-cancer-treatment/content_118.html": "511 people in Reading left waiting two months to start cancer treatment\nNew research from the House of Commons Library, commissioned by the Liberal Democrats has revealed that 511 people were stuck waiting for more than two months before receiving treatment at the Royal Berkshire NHS Foundation Trust after receiving urgent cancer referrals from their GPs.\nThese figures meant, in 2022, 34% of patients had to wait more than two months for treatment to start.\nThe Royal Berkshire NHS Foundation Trust has not hit the target of 85% of patients receiving a first treatment for cancer within 62 days of an urgent GP referral since 2019.\nLiberal Democrats in Reading have called these new figures “horrifying”, with long waits to see GPs compounding the problem.\nNationally, more than 66,000 patients were forced to wait more than two months for their first treatment last year after a referral.\nAhead of the local elections, Liberal Democrats are calling for the Government to hire more staff, especially specialist cancer nurses. The party is also calling for a comprehensive strategy to ensure all those who have been left behind are offered timely cancer diagnosis and treatment and that targets be met as soon as possible. They are also calling for patients to have a new right: to see a GP within 7 days, or within 24 hours if they urgently need to.\nThe Government must get a handle on this crisis so cancer patients get the urgent care they need to give them the best chance of survival and recovery.\nCommenting on cancer waiting times in Reading, local Liberal Democrat Councillor Anne Thompson, said:\n“The Government has been driving our local health services into the ground and taking patients for granted for years, Reading deserves better.\n“Delays to cancer diagnoses and treatments are incredibly distressing for those with cancer and those who fear they may have it.\n“This Conservative Government has its head in the sand over staff shortages and no real plan to fix it.\n“They must get a handle on this crisis so cancer patients get the urgent care they need to give them the best chance of survival and recovery.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_a-fair-deal-for-reading-lib-dems-launch-local-manifesto/content_64.html": "A Fair Deal for Reading: Lib Dems launch local manifesto\nA Fair Deal for Reading: Reading Lib Dems release their local election manifesto\nThe Reading Liberal Democrats have released their manifesto for the local election on May the 2nd. Voters all the way across Reading will have the chance to vote for a Liberal Democrat candidate - but with no elections scheduled for next year, the next chance Reading will have to vote for councillors will be in 2026.\nAlongside key policy areas, the Liberal Democrats have announced a 'six to fix' list of specific pledges, including introducing kerbside glass recycling, ensuring that every young person in Reading has an after-school club or youth centre they can go to, joined-up cycle lanes, bus services to all areas of the Borough, safeguarding local library, arts and culture services, and standing up to Thames Water on river pollution, sewage, and the state of the water network.\nCommenting, James Moore, leader of the Reading Lib Dems on Reading Borough Council, and candidate for Tilehurst ward this May, said: \"All across Reading, people are telling us they are tired of excuses from the Labour-run Council and the Conservative Government. They are tired of hearing what’s not possible, and having to pay more for it.\n\"The Liberal Democrats go into these elections as the largest party in Berkshire, leading every local authority surrounding Reading - after decades of Labour control, Reading is crying out for a fresh start. We love our town and want to make it the best it can be, whether that's by ensuring that young people have spaces for them to be, that the town's bus and cycle networks make sense, or that we finally bring in kerbside glass recycling. These are all things residents are crying out for, and they're all clearly achievable.\n\"Reading deserves better than Labour, the Conservatives, and Thames Water. This Manifesto describes how voting Liberal Democrat in the local elections this May will make a difference to you and your family. It’s time to end the excuses. It’s time for a fair deal for Reading.\"\nThe full manifesto document can be found here.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-call-for-two-month-cancer-treatment-guarantee-to-support-patients-in-reading/content_79.html": "Lib Dems call for two-month cancer treatment guarantee to support patients in Reading\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease.\nThe latest NHS figures show that, in the last year, 544 cancer patients in the Royal Berkshire NHS Foundation Trust area waited more than 62 days to start treatment after being referred. This means only 67% of patients in the area were treated within two months, below the government target of 85%.\nLiberal Democrat Leader Ed Davey used his Autumn Conference speech to set out proposals to invest an extra £4 billion in NHS cancer treatment over the next five years,\nThe Liberal Democrat plan includes new radiotherapy machines, cutting the time for new medicines to reach patients, a new cancer research law, and better support for cancer patients and their families.\nThe new policy builds on existing proposals from the party on health such as introducing a right to see a GP within a week and expanding NHS dentistry so people aren’t forced to pay for private dental treatment.\nReading Liberal Democrat Councillor Meri O’Connell said:\n“Everyone knows someone whose life has been turned upside down by cancer.\n“Far too many people are still waiting far too long for a diagnosis, or to start treatment after being diagnosed. We must do right by them and get them the care they need when they need it.\n“The Liberal Democrats would give cancer patients a new legal right to treatment within two months of an urgent referral, to make sure they get the care they deserve.\n“This forms part of our ambitious plan to end unacceptable cancer delays and boost survival rates.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_liberal-democrats-select-candidate-for-reading-west-mid-berkshire/content_68.html": "Liberal Democrats select candidate for Reading West & Mid Berkshire\nLiberal Democrats ready to take the fight to Conservatives across Berkshire as they fire the starting gun in the new Reading West & Mid Berkshire constituency\nThe Liberal Democrats have announced their candidate for the hotly contested new Reading West & Mid Berkshire seat, with Helen Belcher positioned to take the Blue Wall seat.\nHelen was joined for the announcement by Clive Jones who is fighting to win Wokingham, and Lee Dillon who is fighting to win Newbury and is the Leader of West Berkshire Council.\nThe party is clear that the fight for the new seat is a “two-horse race” after this May’s local elections, which made the Liberal Democrats the largest party across Berkshire. The sprawling new constituency has more Liberal Democrat Councillors than any other party, with Labour a long way behind.\nHelen Belcher, the new Candidate, was born in west Reading and grew up in Burghfield Common. She has represented the Liberal Democrats in other recent elections in Berkshire and Wiltshire, and is “delighted to have this amazing opportunity”.\nShe has campaigned for years on the importance of good local services and schools, and against environmental damage, including the sewage crisis facing our rivers caused by the Conservative Government. Repeatedly recognised as a leading campaigner, she was appointed OBE in the New Year’s Honours List in 2023, for services to the transgender community.\nCommenting on her selection as Parliamentary Candidate, Helen Belcher said:\n“I grew up in this constituency, so in many ways this is a homecoming for me. I’m delighted to have this amazing opportunity to represent this beautiful area.”\n“For too long people in our area have been abandoned by the Conservatives, with public services cut to the bone, threats to close our ticket offices, difficulty accessing timely healthcare, and sewage streaming into the Pang, the Kennet and the Thames. The people of Reading West & Mid Berkshire need a local champion who is vocal and visible, addressing the issues they care about - not more Conservative chaos, creating invisible enemies to distract from their many failures.”\nCommenting, Cllr. Lee Dillon (Lib Dem candidate for Newbury and leader of West Berkshire Council) said:\n“The huge Liberal Democrat victories this May were a sign that Conservative dominance of Berkshire is coming to an end. Helen is a fantastic candidate and with her in place, all across central and West Berkshire, we can tell this appalling Conservative Government: enough is enough.”\nFind out more about Helen and her campaign here.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_conservatives-cant-add-up/content_77.html": "Conservatives can’t add up\nA huge error by the Conservative Government has left local schools in Reading with over a million pounds less than promised.\nSchools had initially been told they would receive a 2.7% budget rise for the 2024/25 school year in July. However in October it was revealed schools would only get a 1.9% rise. The difference is equal to roughly £50 per pupil.\nAcross all the schools in Reading this equates to a £1,078,000 loss.\nLib Dem Prospective Parliamentary Candidate for Reading West & Mid-Berkshire, Helen Belcher said:\n“This blunder just shows up the staggering incompetence of this Conservative Government. Just a few weeks after the RAAC concrete scandal, the Conservatives have shown yet again that we cannot trust them to look after our schools.”\n“Schools have spent 2 months expecting to receive significantly more funding than they will actually get next year. The Government has not even given them their correct funding figure yet.”\n“As a result schools may have to redraw their budgets for the upcoming year.”\n“Yet another Conservative blunder has caused a lot of unnecessary work and stress for our already over-stretched schools and teachers.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_about_manifesto/content_30.html": "A Fair Deal for Reading\nThe manifesto of the Reading Liberal Democrats for the local elections in 2024\nA Fair Deal for Britain\nLooking for our General Election manifesto? Click here to read about how we're fighting to get a Fair Deal for Britain on July the 4th.\nIf you're viewing this on a mobile, you may need to tap the button to download the document in order to view it -\nor scroll down to read our manifesto on the website:\nWhy do we do what we do?\nThe Liberal Democrats are unlike Labour and the Conservatives: we aren't bankrolled by trades unions or by big elites or corporations - instead, we rely on small donations from hundreds of thousands of individual supporters. And we believe power should be dispersed back to the people and their communities, rather than concentrated centrally in the hands of the state or the elite. We stand up to bullies and stand with the community, the people and the marginalised.\nFind out more about our beliefs and why the Reading Liberal Democrats do what we do here.\nYou can find out more about the national party's beliefs here.\nLooking for our national manifesto?\nYou can find out more about the national party's plan for the country here.\nOur Manifesto\nOur Six to Fix for Reading\nSix simple, achievable things the Liberal Democrats will seek to do with power, if elected to Reading Borough Council:\n- Joined-up cycle lanes\n- Kerbside glass recycling\n- Bus services to all areas\n- Protected library services\n- An after-school club or youth centre for every young person\n- Telling Thames Water \"no\": stop sewage dumping and fix our water supply\nIntroduction by James\nAll across Reading, people are telling us they are tired of excuses from the Labour-run Council and the Conservative Government.\nIt cannot be right that glass recycling is only done via bottle banks, relying on people to carry heavy bags long distances. Cyclists should not be riding along a cycle path that then dumps them in the middle of heavy traffic. People in Caversham and Emmer Green have a right to expect a bus service as reliable as every other part of the town.\nPeople love their libraries, sports centres and museums: they are tired of limited opening hours, and being told they have to travel across town because their local service has been cut.\nWhen they report a problem, they want it fixed. When their kids need support at school, or their elderly relatives need help from the Council, they expect that help to be available. They are tired of hearing what’s not possible, and having to pay more for it. And when Thames Water dumps sewage in local water ways or cuts off drinking water to half the town for days on end, they want a Council that stands up for them.\nThis Manifesto describes how voting Liberal Democrat in the local elections this May will make a difference to you and your family.\nIt’s time to end the excuses. It’s time for a fresh start.\nIt’s time for a fair deal for Reading.\nHealth and care for all\nPeople expect to live fuller and longer lives. They expect to be active, have more control over their care, and live in their own homes.\nWe will make sure that elderly and disabled people receive the highest standards of care. Services need to be tailored to individual needs and personal independence.\nHelp must be accessible both in-person and online - nobody should be left isolated.\nHelping children and young people\nChildren and young people are the future of Reading.\nWe will provide the support they need to do well in school. Once the school day is over, we will give them somewhere to go, with properly funded after school clubs and youth centres - if we want them to spend less time online, we must make spaces for them to be themselves in the real world.\nReading's Children's Services, now outsourced to a private company, must improve: we will make sure the Council does better for those children and young people most in need of help.\nMaking communities safer\nPeople have a right to live in their communities without worrying about their safety or that of their families or properties. People are tired of nuisance behaviour linked to alcohol and drugs.\nWe will drastically improve the support the Council gives to people experiencing antisocial behaviour. We will help safer neighbourhood forums improve links with the Police. And we will make sure that residents’ and tenants’ associations have the resources they need to tackle crime and nuisance in their areas.\nWe will be sure to hold the new Police and Crime Commissioner to account, as well.\nBuilding sustainable communities\nPeople want a high quality environment in their local areas. They expect their Council to tackle problems with recycling and pollution, and ensure there is a decent mix of affordable housing.\nWe will bring in kerbside recycling for glass. We will make sure that Thames Water is stopped from dumping sewage in local water ways, and that it provides a reliable supply of safe drinking water.\nWe will make sure tackling air quality is a priority, establishing a comprehensive monitoring system and ensuring polluters are compelled to take action. We will hold developers to account to provide affordable housing, and make sure they build homes that meet the highest environmental and quality standards.\nImproving local transport\nPeople rightly expect safe, affordable and accessible transport choices, especially in a compact borough like Reading.\nWe will make sure there is a bus service that works for everyone in Reading: everyone should have access to reliable, reasonably priced bus transport which runs at the times they need it, somewhere close to them.\nWe will make sure cycle lanes are properly joined up: cycling in Reading must become safer. We will make sure rail service providers are held accountable: it is high time that rail commuters from Reading, who pay some of the highest fares in the country, receive a decent rail service.\nProtecting culture and leisure services\nPeople rely on cultural and leisure facilities like libraries, sports centres and swimming pools, not only for their quality of life, but to stay healthy, in touch, and mentally, physically, and socially active. Cultural and leisure facilities have a massive impact on quality of life.\nWe will protect library services: no more closures, no more strange or shorter hours. We will make sure that Council-run library, arts and sports venues, including Reading Museum, South Street, and Palmer Park, are properly funded and continue to provide services that enrich the lives of the people of Reading.\nA message from Sir Ed Davey\nVote Liberal Democrat on the 2nd of May, and you’ll get a local champion who will get things done in your community. You’ll get a cleaner, greener neighbourhood where recovery comes first and locals are listened to.\nThere are over three thousand Liberal Democrat councillors already hard at work serving their communities - people who go the extra mile to get things done, for their communities. Liberal Democrats are brilliant community volunteers and have been working hard all year round.\nDid you know that every local authority bordering Reading has been led by Liberal Democrats for the last year?\nGoing into these local elections, the Liberal Democrats are the largest party in Berkshire, and that lets us deliver for hundreds of thousands of people all year round.\nOur election campaign is all about your community. How we can help your community stay resilient and protect its people and services. How we can help local businesses to survive and thrive - and how we can help children in your area to get the best possible future. If you want that here in Reading, vote Liberal Democrat.\nSo, on May the 2nd, you have a fantastic opportunity to back your community, by backing people who believe in their community, people who will act for and with their community – your Liberal Democrat candidate.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_thank-you-from-the-reading-lib-dems-le2024/content_105.html": "Thank you from the Reading Lib Dems\nThank you to the thousands of Reading residents who voted for our candidates in this year's local elections.\nThis year's local elections saw Reading Liberal Democrat leader, Councillor James Moore, re-elected in Tilehurst with a thumping 52.5% share of the vote, and good results in other wards across the Borough. Outside Reading, the Liberal Democrats knocked the Conservatives into third place, winning more council seats and control of more councils than the Conservatives.\nEvery local authority around Reading remains led by Liberal Democrats, who solidified their position as the largest party across Berkshire and across Oxfordshire as well.\nReacting to this year's local election results in Reading, James Moore, the newly-re-elected Councillor for Tilehurst, said:\n\"I'm delighted to have been re-elected for a full four-year term to stand up for Tilehurst and for the Liberal Democrats on Reading Borough Council. Across Reading, residents told us they were desperate for a change, from a tired Conservative government in London and a tired Labour administration at Reading Borough Council. I've loved the two years I've already had on Reading Borough Council - I can't wait to get started on the next four. Thank you to the more than fifteen-hundred people in Tilehurst who voted for me - and to everyone who didn't, I'll be there standing up for you, too.\"\nJames and his council colleagues Meri O'Connell and Anne Thompson were straight back to work the day after the count finished, holding their regular councillor surgery in Tilehurst.\nThe Liberal Democrats were also the only party to make significant gains in the new Reading West and Mid Berkshire constituency, with their votes increasing by more than a hundred and fifty in the three Reading wards of the constituency. Meanwhile, Labour stood still despite the national polls, only increasing their votes by seventeen - while the Conservative vote plummeted by over four hundred.\nReacting, Helen Belcher, the Liberal Democrat candidate for Reading West and Mid Berkshire said:\n\"These results and James's emphatic re-election in particular, reinforce the picture in Reading West and Mid Berkshire, that only the Liberal Democrats are advancing in this constituency. We already know Labour can't win outside the Reading area. I'd also like to congratulate Marie French on an excellent, hard-fought campaign in Norcot. Residents responded very well to her campaign and I'm looking forward to seeing her on the council in future years. In the meantime, I look forward to taking the fight to this awful Conservative government and helping to change Britain for the better.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_thames-water-pumps-over-298000-hours-worth-of-sewage-as-reading-lib-dems-warn-ofwat-must-go/content_21.html": "Thames Water pumps over 298,000 hours worth of sewage as Reading Lib Dems warn ‘Ofwat must go’\nLast year, Thames Water pumped over 298,000 hours worth of sewage into waterways, according to new data published recently.\nIn Reading, residents are increasingly concerned about the spoiling of our waterways, such as the River Thames.\nThe Liberal Democrats are calling for the government to replace Ofwat with a new regulator with proper enforcement powers to hold water companies accountable and stop the sewage scandal.\nCouncillor James Moore, Leader of the Liberal Democrats on Reading Borough Council, said:\n“Here in Reading, residents are appalled by what’s happening to our local waterways whilst facing sky-high water bills.\n“The Government should act now to get a new regulator in place to protect British rivers and seas from being pumped with disgusting sewage. Ofwat must go.\n“I and the Liberal Democrats will continue to protect our local waterways and fight for much tougher regulation of a water industry which is profiting from pollution.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_thank-you-lib-dem-gain-in-tilehurst/content_100.html": "Thank You - Lib Dem GAIN in Tilehurst!\nThank you to the thousands of you who voted for us this year, and to all our candidates and campaigners for our best result in years!\nThe Reading Liberal Democrats are delighted to announce our victory in Tilehurst this year, where sitting Councillor Meri O'Connell was returned with a huge majority, and long-time campaigners Anne Thompson and James Moore were elected to join her on the council. Our candidates across Reading had a good night, with increased vote shares in many areas. This came on the back of a strong night for Liberal Democrats across the country: in neighbouring Wokingham, the Liberal Democrats were able to knock the council into no overall control, while further afield, Liberal Democrats won majority control of councils as far afield as Kingston-upon-Hull, Somerset, Westmorland, and Gosport.\nThe boundary review here in Reading saw our first all-up elections in 18 years, which along with our wins in Tilehurst delivered a seismic change for our Borough: the Conservative group halved in size, leaving the Green Party as leaders of the Opposition to Reading Labour.\nNewly re-elected Councillor Meri O'Connell said: \"We are humbled to have been given such a strong mandate by the people of Tilehurst, and encouraged to have seen an upwelling of support in many areas across the Borough. I am excited to be heading back to the Council chambers with an expanded Lib Dem group, where we will keep speaking up for our residents, and for the values of liberty, equality and community. I look forward to collaborating with new and returning Council members from all parties to help improve our town and demand better for Reading.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_over-11-thousand-over-80s-at-risk-of-losing-winter-fuel-payments-in-reading-as-lib-dems-calls-on-govt-to-change-course/content_41.html": "Over 11 thousand over 80s at risk of losing Winter Fuel Payments in Reading as Lib Dems calls on govt to “change course”\nReading Liberal Democrats have called on the new government to “change course” in the face of these new statistics saying that ministers must “protect vulnerable pensioners” with thousands at risk of having to choose between heating and eating this winter.\nAnalysis of the new data shows that in Reading, over 11 thousand pensioners aged over 80 are not in receipt of pension credit and will lose their Winter Fuel Payment they were previously entitled to unless they receive other benefits.\nAll those aged over 80 were previously entitled to £300 each to help with their energy bills to stay warm during the winter months but many will now lose this money.\nIn total, last year those aged over 80 in Reading received £3.25 million in support with £7.6 million given out to all pensioners in the constituency. This figure will drastically fall this winter following the withdrawal of support by the government for the vast majority of pensioners.\nIn total, just over 40 thousand pensioners in Reading do not receive pension credit and are also at risk of losing support due to the government’s cuts.\nAge UK has previously said that 2.5 million pensioners will “be in serious trouble” this winter due to the cutting of the payments. Reading Lib Dems called on the government to “reverse these proposals and protect vulnerable pensioners” this winter.\nLeader of the Liberal Democrats on Reading Borough Council, James Moore said:\n“Thousands of pensioners here in Reading are desperately worried about how they will make it through this winter. We are especially concerned about vulnerable older pensioners, and these figures are deeply worrying.\n“We have heard countless stories from those who now say they will have to choose between staying warm or putting food on the table as a result of this government’s decision.\n“Cutting these payments for thousands of my constituents, including many that are just barely getting by, is the completely wrong thing to be doing.\n“It is not too late for this new government to change course, reverse these proposals and protect vulnerable pensioners here in Reading this winter.”",
  "http_www_readinglibdems_org_uk_/https_www_readinglibdems_org_uk_about_manifesto/content_106.html": "A Fair Deal for Reading\nThe manifesto of the Reading Liberal Democrats for the local elections in 2024\nA Fair Deal for Britain\nLooking for our General Election manifesto? Click here to read about how we're fighting to get a Fair Deal for Britain on July the 4th.\nIf you're viewing this on a mobile, you may need to tap the button to download the document in order to view it -\nor scroll down to read our manifesto on the website:\nWhy do we do what we do?\nThe Liberal Democrats are unlike Labour and the Conservatives: we aren't bankrolled by trades unions or by big elites or corporations - instead, we rely on small donations from hundreds of thousands of individual supporters. And we believe power should be dispersed back to the people and their communities, rather than concentrated centrally in the hands of the state or the elite. We stand up to bullies and stand with the community, the people and the marginalised.\nFind out more about our beliefs and why the Reading Liberal Democrats do what we do here.\nYou can find out more about the national party's beliefs here.\nLooking for our national manifesto?\nYou can find out more about the national party's plan for the country here.\nOur Manifesto\nOur Six to Fix for Reading\nSix simple, achievable things the Liberal Democrats will seek to do with power, if elected to Reading Borough Council:\n- Joined-up cycle lanes\n- Kerbside glass recycling\n- Bus services to all areas\n- Protected library services\n- An after-school club or youth centre for every young person\n- Telling Thames Water \"no\": stop sewage dumping and fix our water supply\nIntroduction by James\nAll across Reading, people are telling us they are tired of excuses from the Labour-run Council and the Conservative Government.\nIt cannot be right that glass recycling is only done via bottle banks, relying on people to carry heavy bags long distances. Cyclists should not be riding along a cycle path that then dumps them in the middle of heavy traffic. People in Caversham and Emmer Green have a right to expect a bus service as reliable as every other part of the town.\nPeople love their libraries, sports centres and museums: they are tired of limited opening hours, and being told they have to travel across town because their local service has been cut.\nWhen they report a problem, they want it fixed. When their kids need support at school, or their elderly relatives need help from the Council, they expect that help to be available. They are tired of hearing what’s not possible, and having to pay more for it. And when Thames Water dumps sewage in local water ways or cuts off drinking water to half the town for days on end, they want a Council that stands up for them.\nThis Manifesto describes how voting Liberal Democrat in the local elections this May will make a difference to you and your family.\nIt’s time to end the excuses. It’s time for a fresh start.\nIt’s time for a fair deal for Reading.\nHealth and care for all\nPeople expect to live fuller and longer lives. They expect to be active, have more control over their care, and live in their own homes.\nWe will make sure that elderly and disabled people receive the highest standards of care. Services need to be tailored to individual needs and personal independence.\nHelp must be accessible both in-person and online - nobody should be left isolated.\nHelping children and young people\nChildren and young people are the future of Reading.\nWe will provide the support they need to do well in school. Once the school day is over, we will give them somewhere to go, with properly funded after school clubs and youth centres - if we want them to spend less time online, we must make spaces for them to be themselves in the real world.\nReading's Children's Services, now outsourced to a private company, must improve: we will make sure the Council does better for those children and young people most in need of help.\nMaking communities safer\nPeople have a right to live in their communities without worrying about their safety or that of their families or properties. People are tired of nuisance behaviour linked to alcohol and drugs.\nWe will drastically improve the support the Council gives to people experiencing antisocial behaviour. We will help safer neighbourhood forums improve links with the Police. And we will make sure that residents’ and tenants’ associations have the resources they need to tackle crime and nuisance in their areas.\nWe will be sure to hold the new Police and Crime Commissioner to account, as well.\nBuilding sustainable communities\nPeople want a high quality environment in their local areas. They expect their Council to tackle problems with recycling and pollution, and ensure there is a decent mix of affordable housing.\nWe will bring in kerbside recycling for glass. We will make sure that Thames Water is stopped from dumping sewage in local water ways, and that it provides a reliable supply of safe drinking water.\nWe will make sure tackling air quality is a priority, establishing a comprehensive monitoring system and ensuring polluters are compelled to take action. We will hold developers to account to provide affordable housing, and make sure they build homes that meet the highest environmental and quality standards.\nImproving local transport\nPeople rightly expect safe, affordable and accessible transport choices, especially in a compact borough like Reading.\nWe will make sure there is a bus service that works for everyone in Reading: everyone should have access to reliable, reasonably priced bus transport which runs at the times they need it, somewhere close to them.\nWe will make sure cycle lanes are properly joined up: cycling in Reading must become safer. We will make sure rail service providers are held accountable: it is high time that rail commuters from Reading, who pay some of the highest fares in the country, receive a decent rail service.\nProtecting culture and leisure services\nPeople rely on cultural and leisure facilities like libraries, sports centres and swimming pools, not only for their quality of life, but to stay healthy, in touch, and mentally, physically, and socially active. Cultural and leisure facilities have a massive impact on quality of life.\nWe will protect library services: no more closures, no more strange or shorter hours. We will make sure that Council-run library, arts and sports venues, including Reading Museum, South Street, and Palmer Park, are properly funded and continue to provide services that enrich the lives of the people of Reading.\nA message from Sir Ed Davey\nVote Liberal Democrat on the 2nd of May, and you’ll get a local champion who will get things done in your community. You’ll get a cleaner, greener neighbourhood where recovery comes first and locals are listened to.\nThere are over three thousand Liberal Democrat councillors already hard at work serving their communities - people who go the extra mile to get things done, for their communities. Liberal Democrats are brilliant community volunteers and have been working hard all year round.\nDid you know that every local authority bordering Reading has been led by Liberal Democrats for the last year?\nGoing into these local elections, the Liberal Democrats are the largest party in Berkshire, and that lets us deliver for hundreds of thousands of people all year round.\nOur election campaign is all about your community. How we can help your community stay resilient and protect its people and services. How we can help local businesses to survive and thrive - and how we can help children in your area to get the best possible future. If you want that here in Reading, vote Liberal Democrat.\nSo, on May the 2nd, you have a fantastic opportunity to back your community, by backing people who believe in their community, people who will act for and with their community – your Liberal Democrat candidate.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-call-for-rail-fare-freeze-as-readings-residents-face-price-hike-next-year-of-up-to-pound480/content_93.html": "Lib Dems call for rail fare freeze as Reading’s residents face price hike next year of up to £480\nThe Liberal Democrats have called for rail fares to be frozen for the next 5 years after ministers have refused to say how much rail tickets will rise by next year. The price of a season ticket in Reading to London could go up by £480, according to Lib Dem analysis.\nThe rise comes despite disrupted services over the past year due to industrial action and the Government’s plans to close ticket offices at stations around the country.\nThe party is also calling for a rethink over planned ticket office closures and for the Government to finally resolve the strike action disrupting services.\nCouncillor James Moore, Leader of the Liberal Democrats on Reading Borough Council said:\n“Liberal Democrats are fighting for a fair deal for Reading’s commuters and families who will be left forking out even more for train journeys in the middle of a cost of living crisis.\n“Ministers cannot keep turning a blind eye to these problems, especially given people are paying more for less on our rail network with more delays, cancellations and their failure to deal with the strikes. The loss of ticket offices would be a further blow.\n“We should be making clean forms of transport cheaper and easier to access, yet this Conservative Government is determined to make rail more expensive and harder to use than ever before.”\n“If this Government had even a shred of decency they would freeze rail fares immediately to help families struggling here in Reading under the cost of living crisis the Conservatives created.\n“We should be making clean forms of transport cheaper, yet this Conservative Government is determined to make rail more expensive than ever before.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_over-130000-four-week-waits-for-a-gp-appointment-in-berkshire-west-last-year/content_39.html": "Over 130,000 four-week waits for a GP appointment in Berkshire West last year\nBerkshire West saw a 31% rise in four-week waits for GP appointments last year when compared to 2022, House of Commons Library research commissioned by the Liberal Democrats has revealed.\nThe NHS data measures when the appointment was booked and when it took place. It showed that the number of appointments that saw patients wait two weeks or longer in Berkshire West has spiked by 17% to over 546,000 people in 2023, up from 465,000 people the previous year.\nIt means the proportion of appointments where a patient waited two weeks or longer in Berkshire West (which comprises the Reading, West Berkshire and Wokingham local government areas) has risen to 19%, up from 16% in 2022.\nReading Liberal Democrats have criticised the Conservative government for letting the community down with their neglect of local health services.\nThe Liberal Democrats are calling for a legal right to get a GP appointment within seven days, or 24 hours if in urgent need.\nThe policy would enshrine this right in the NHS Constitution, putting a duty on the government and health service to make sure it happens. It would be achieved by increasing the number of GPs, nurses and pharmacists fully qualified to prescribe day-to-day medicines.\nCommenting, Tahir Maher, Liberal Democrat Parliamentary Candidate for Earley and Woodley said:\n“Far too many people in Reading are struggling to get a GP appointment when they need one. It is causing people huge anxiety because they can't be confident any more about getting the care they need.\n“It shows our community has been abandoned by this government when it comes to local health services.\n“Being able to see a GP when you need to should not be too much to ask, but even on this measure, people are being failed after years of neglect by this Conservative government.\n“That is why the Liberal Democrats are calling for a legal right for all patients to see their GP within seven days or 24 hours if in urgent need.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-housing-in-crisis-1-in-5-reading-renters-hit-by-pound1300-annual-increase/content_46.html": "Reading housing in CRISIS: 1 in 5 Reading renters hit by £1,300 annual increase\nRecent data published by the Office for National Statistics (ONS) shows renters in Reading are facing skyrocketing increases in rent leaving them spending 40% of their income on housing.\nThe ONS has announced that Reading residents are some of the worst affected by rising housing costs in the whole of England and Wales. Not only are more households than elsewhere facing an increase in rent, but these increases also tend to be higher.\nThis comes on the heels of a series of broken Conservative party promises on housing - failing to build any of 200,000 promised starter homes, failing to abolish unfair evictions and failing to build replacement homes for those lost from Right to Buy.\nAs part of a raft of proposals, the Liberal Democrats are calling for 380,000 new homes to be build nationwide and 150,000 new council houses to lower prices and rents and get the housing crisis under control.\nLiberal Democrat candidate for Reading Central, Henry Wright, said:\n\"These figures only confirm what so many people in Reading are struggling with on a month by month basis - the cost of housing is already too high and rises show no sign of slowing.\n\"The Conservative government's record of failure in this area is clear - failure on leasehold reform, failure on rent reform and failure to keep mortgage prices in check\n\"I am clear that the only way out of this crisis is to build more homes, and ensure more of what we do build is affordable. The Conservative party has failed on housing and the General Election provides an opportunity to vote for a liberal pro-housing alternative.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_britains-political-system-is-broken/content_80.html": "Britain’s political system is broken\nThis is down to our broken voting system.\nAt the last General Election, the Conservatives received just 43% of the vote. But that gave them 56% of the MPs in Parliament and 100% of the power! They can neglect and ignore huge parts of the country and people are powerless to do anything about it.\nLeader of the Liberal Democrats on Reading Borough Council, Councillor James Moore is calling for our unfair voting system to be replaced once and for all;\n“In Reading East and Reading West alone a total of 64,856 votes were wasted at the last General Election.”\n“We need a proportional voting system to make sure every vote counts equally - giving everyone a meaningful say in who represents them - and the power to hold them to account.”\n“The Lib Dems are leading the call for fair votes. With your support at the next election the Lib Dems can give the strongest fight possible to fix our politics once and for all.”\nYou can sign our petition for fairer votes at https://www.libdems.org.uk/fairvotes\nYou can find out more about the grassroots campaign to reform our electoral system at www.makevotesmatter.org.uk/grassroots",
  "http_www_readinglibdems_org_uk_/https_www_readinglibdems_org_uk_about_people/content_26.html": "Meet the Reading Liberal Democrats\nOn this page you can find out more about who's who in the Reading Liberal Democrats, our councillors, and committee.\nOn this page you can find out more about who's who in the Reading Liberal Democrats, our councillors, and committee.",
  "http_www_readinglibdems_org_uk_/https_www_readinglibdems_org_uk/content_11.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_royal-berkshire-hospital-loses-528-bed-days-to-social-care-backlogs/content_104.html": "Royal Berkshire Hospital loses 528 bed days to social care backlogs\nNew research published by the Liberal Democrats has revealed the impact of the social care crisis on the NHS and the Royal Berkshire Hospital, with medically fit patients left stuck in hospital beds waiting for care.\nThe figures reveal that 528 bed days were lost to delayed discharges from hospital in May. Of these, the majority of bed days lost involved patients who had been stuck in hospital for three weeks or more.\nDelayed discharges take place when medically fit patients are unable to leave hospital, often due to a lack of social care. Across the country, the NHS lost over 128,800 bed days to delayed discharges from hospital, up 32% on the same period last year.\nThe Liberal Democrats warned that the government’s failure to tackle the social care crisis was having a “disastrous” impact on local NHS services, piling pressure on hospitals while elderly and vulnerable patients are left waiting for the care they need. The party is calling for the introduction of a Carer’s Minimum Wage, set at £2 above the minimum wage, to help address the huge number of job vacancies in social care.\nReading Liberal Democrat Councillor Meri O’Connell said:\n“These worrying figures show the disastrous impact the social care crisis is having on our local health services.\n“Far too many elderly and vulnerable people are ending up stuck in hospital when they are ready to leave, because there simply isn’t the care available for them at home or in the community.\n“This is causing unneeded pain and distress while piling even more pressure on our already overstretched hospitals,\n“The Liberal Democrats know that you can’t fix the crisis in the NHS without fixing the crisis in social care. We want to see the Government start valuing carers properly by bringing in a Carer’s Minimum Wage. This would help reduce soaring vacancies in social care and tackle the crisis facing the NHS.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_64-of-crimes-in-tilehurst-go-unpunished/content_48.html": "64% of crimes in Tilehurst go unpunished\nOfficial statistics from the police have shown that, across Tilehurst, only 3% of crimes committed in the past year have resulted in a conviction or a caution.\nDuring this time 1,405 recorded crimes were committed in Tilehurst, with the most frequent being violence and sexual offences, anti-social behaviour and theft.\nHowever, only 3% of these crimes resulted in a charge or caution being given. In most cases a suspect was not identified, or there was insufficient evidence to charge a suspect. The remaining 33% of crimes had local resolution, are still under investigation or pending a court outcome, or further investigation was not deemed in the public interest.\nLiberal Democrat Councillor for Tilehurst, James Moore said:\n“This is simply not good enough. Conservative cuts have taken 1000 Police Community Support Officers of the streets in the past year alone. The Conservative Police and Crime Commissioner has sat back and let this happen on his watch.”\n“Everyone knows that the local police team in Reading work extremely hard and do an excellent job. But they are overstretched and under-resourced.”\n“We need a properly funded police force with the resources to prevent more crimes, and to investigate those which are committed more effectively.”\n“The Liberal Democrats have called for an urgent meeting with the Chief Constable and the Police and Crime Commissioner to call for more resources to fight and punish crime in Tilehurst.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_conservatives-have-neglected-roads-across-reading-and-let-the-community-pay-the-price-say-lib-dems/content_86.html": "“Conservatives have neglected roads across Reading and let the community pay the price” say Lib Dems\nThe Liberal Democrats have set out new proposals to fix Reading’s roads.\nThe party has set out a national £300 million plan that will see investment to fix potholes over the next Parliament, which could equate to around 1.2 million potholes being filled each year.\nData reveals that in the 12 months between April 2021 and March 2022 there were almost 2,000 potholes across Reading, some being left for 46 months before being fixed.\nThe Liberal Democrats would redirect some of the money in the existing budget for new roads to local councils to ensure road maintenance and improvements are properly funded.\nLiberal Democrat Candidate for Reading Central, Henry Wright, said:\n“The Conservatives have driven us to a desperate place - roads are crumbling and motorists are suffering as a result.\n“It isn’t fair on families across Reading to be paying the price for this shambolic Conservative Government, who have completely failed to maintain our roads.\n“The Conservatives have overseen cuts to our transport network, maintenance works delays and the decline in the state of our roads across the board. For all of their lip service to motorists, it's clear the Conservatives do not care about drivers in Reading.\n“Only the Liberal Democrats have a real plan to fix the state of our roads by giving the money to local councils, who know their roads and are best placed to fix them.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_helen-belcher-slams-government-dental-plan-as-too-little-too-late/content_83.html": "Helen Belcher slams Government dental plan as \"too little too late\"\nDental plan “too little too late” for 144,000 children not seen by an NHS dentist in Berkshire West's integrated care board area\nReading and West Berkshire’s Liberal Democrats have slammed the Government’s new dental plan as figures show 144,000 children in our integrated care board area had not been seen by an NHS dentist in 12 months. The local integrated care board incorporates Buckinghamshire, Oxfordshire, and Berkshire West, which includes Reading and West Berkshire councils.\nThe research, commissioned from the House of Commons Library, estimates the number of children who weren’t seen by an NHS dentist in the year to June 2023, based on the latest data from the health service.\nIt shows a staggering four in ten children (41%) who had not been seen by a dentist in our area over the twelve month period. In the same area, 6 in 10 adults (61%) had not been seen by an NHS dentist in the two years to June 2023. That equates to 748,000 people who went without NHS dental care over a 24 month period.\nThe Government’s new Dental Plan will see cash incentives for NHS dentists, mobile dental services and dental teams visiting schools and nurseries.\nIt has previously been estimated that the NHS budget was underspent by a record £400m last year, due to dentists not finding it \"economic\" to take on NHS work.\nThe Lib Dems are calling for a dental healthcare rescue plan to boost the number of appointments. The Liberal Democrats are also calling for reforms to guarantee access to an NHS dentist for everyone needing urgent and emergency care, ending DIY dentistry and “dental deserts”, and the removal of VAT on children’s toothbrushes and toothpaste.\nCommenting, Liberal Democrat candidate for Reading West and Mid Berkshire, Helen Belcher, said:\n“The government’s plans are too little, too late for local families who have been left waiting in pain struggling to get a dentist appointment.\n“It is appalling that so many children in our area are struggling to see an NHS dentist when they need to. We know that if children can’t access dental healthcare it can disrupt their eating, sleeping and learning.\n“Instead of these half-baked reforms, we need a proper rescue package for dental healthcare. That means guaranteeing access to an NHS dentist for everyone needing emergency care, boosting the number of appointments and removing VAT on children’s toothbrushes and toothpaste.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_get-involved/content_14.html": "Sign up\nfor email updates\nDonate\nto fuel our campaigns\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_announcing-our-2023-local-election-candidates/content_84.html": "Announcing our 2023 Local Election candidates\nReading Liberal Democrats launch their local election campaign with candidate announcement for the 2023 Local Elections\nThe Reading Liberal Democrats have launched their local election campaign with an announcement a full slate of candidates for this year's elections to Reading Borough Council. From Abbey to Whitley, the Liberal Democrats are standing to demand a fair deal for Reading.\nThe local party’s campaign will focus on both national and local issues; highlighting the deteriorating funding and ever-more alarming rhetoric from the country's Conservative government, as well as the need for change after 35 years of Labour running the Reading Borough Council.\nThe seventeen Liberal Democrat candidates for the Reading Council believe there is another way, using the examples of Liberal Democrat-led councils across the country, from York to Torbay and even elsewhere here in the Thames Valley, with better roads, better environments, better public services and better, more affordable houses than Reading's. The top six councils in the country for recycling are all led by Liberal Democrats, including our neighbours in South Oxfordshire.1 These prospective Councillors believe Reading deserves this kind of leadership.\nThe Reading Liberal Democrats are also urging voters to remember to bring valid voter ID to the polling station with them on May the 4th, and to check the Electoral Commission website to see what forms of ID are valid and how you can get them for free. The Reading Liberal Democrats deplore this Conservative government's pointless waste of public funds on voter ID, which has the potential to rob thousands in our area of their democratic voice.\nThe Liberal Democrat leader on Reading Borough Council, Councillor Meri O'Connell (Tilehurst) said:\n\"Now more than ever, it's vital to have Liberal voices on our council. Every Liberal Democrat elected this May will be a champion for their local area who will work tirelessly all year round for their communities.\n“I see first-hand the incredible work my Lib Dem colleagues put in on the council, and on councils nearby which we lead, like Wokingham and South Oxfordshire. Reading is a progressive town crying out for Liberal voices and hard-working community champions. I'm proud of the range of ages, experience and backgrounds our candidates bring to these elections - and will bring to the Council, if they're elected.\"\nYou can find out everything you need to know about the 2023 Local Elections at our Election Hub, including a full list and details of our candidates, read our manifesto, and find out more about what we believe. You can also find out which ward you live in, where your polling station is, and what types of voter ID will be accepted.\nVote Liberal Democrat on May the 4th, and help us get the fair deal Reading deserves.\n1 The source for local council recycling rates is Let's Recycle, here: https://www.letsrecycle.com/news/three-rivers-tops-2021-22-recycling-table/",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_readings-lib-dems-back-robin-hood-tax-on-energy-giants-to-support-families-with-heating-bills/content_36.html": "Reading's Lib Dems back “Robin Hood tax” on energy giants to support families with heating bills\nReading's Liberal Democrats have today written to the Secretary of State for Energy Kwasi Kwarteng demanding that he backs the party’s call for a “Robin Hood” tax on the super-profits of oil and gas firms, to raise money to support local families facing soaring energy costs.\nThe proposed one-off levy could raise over £5 billion to help support families in Reading as their energy bills sky-rocket.\nThe Liberal Democrats say the money raised through this “one-off” tax could fund a substantial package of emergency support to help thousands of people facing higher bills.\nThis would include doubling the Warm Homes Discount and extending it to all those receiving Universal Credit or Pension Credit, giving 19,096 households in Reading £300 each off their heating bills this year.\nThe party is also calling for winter fuel allowance to be doubled, benefitting 48,380 pensioners in the area and helping them keep their homes warm. On top of this, funding would be spent on helping people insulate their homes to slash heating bills in the long term.\nLiberal Democrat Spokesperson James Moore for Reading said:\n“It can’t be right that a few energy firms are making millions from record gas prices while millions of people can't even afford to heat their homes as the cost of living crisis hits Reading hard.\n“A one-off Robin Hood tax on gas and oil bosses would provide vital funding to support families in our area who are facing crippling energy price hikes.\n“For years the Conservatives have ignored this problem and failed to take the bold action we need to reduce fuel poverty. The Government cannot look the other way any longer while families struggle to get by.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_27-of-children-in-reading-below-reading-standards/content_76.html": "27% of children in Reading below reading standards\nNew figures uncovered by the Liberal Democrats have revealed 27% of 11 year old children have a reading age below 11. The research reveals almost 167,960 11 year olds across the country and 758 in Reading as being below the standard reading age.\nThe shocking figures were published recently by the Department for Education in response to a Parliamentary Question tabled by Liberal Democrat Education Spokesperson Munira Wilson.\nThe latest figures held by the Department are from 2019 as testing was suspended over the pandemic. This means that the numbers are likely even higher after children have faced consistent disruption to their education over the last two years.\nLiberal Democrats in Reading have urged the Department for Education to:\n- Fund the full £15 billion catch up programme put forward by their own Education Recovery Commissioner\n- Publish any new data they have from during the pandemic.\n- Commission an urgent review into reading ages across the country.\nThe party said that the recent figures were just the “tip of the iceberg” with thousands of children hit hard by lost learning during the pandemic.\nThe research comes as the Liberal Democrats are calling for an extra £10 billion to go towards catch up, including £5 billion to be put directly into the hands of parents as a catch up voucher for every child. The policy was backed by the Liberal Democrats at their Spring Conference in March. The voucher could be used to empower parents to help improve their child’s reading age outside of school.\nResponding to these figures, Liberal Democrat Leader on Reading Borough Council, Meri O'Connell said:\n“These figures reveal a reading crisis in our schools and they’re just the tip of the iceberg. The Government must get a grip of this issue by commissioning an urgent review into reading ages for pupils.\n“The pandemic has had a huge effect on our children, and with reading ages already below standards for many before the crisis, the case now could be terrible for thousands of children across the country.\n“Parents, teachers and pupils have not had a fair deal throughout this pandemic. No child should leave primary school unable to read at the standard level for their age - they need a chance to catch up.\n“The Liberal Democrats would invest an extra £10 billion to tackle lost learning, including £5 billion going directly to parents and commission a review into our children's reading crisis.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-liberal-democrats-condemn-governments-delays-in-rebuilding-royal-berkshire-hospital/content_27.html": "Reading Liberal Democrats Condemn Government's Delays in Rebuilding Royal Berkshire Hospital\nThe Reading Liberal Democrats have expressed deep frustration over the government's protracted timeline for the much-needed rebuilding of the Royal Berkshire Hospital. Despite previous commitments, the project has faced continuous delays, exacerbating the strain on local healthcare services and impacting patient care.\nRecent reports indicate that the hospital's redevelopment, initially slated to commence in 2024, has been postponed yet again, with no definitive start date in sight. This postponement comes at a time when NHS waiting lists in Reading for basic diagnostic tests, including MRI and CT scans, have grown by 26% between June 2019 and July 2023, reaching 6,855.\nJames Moore, Councillor for Tilehurst and leader of the Liberal Democrats on Reading Borough Council, said:\n\"The government's repeated delays in initiating the Royal Berkshire Hospital's rebuild are unacceptable. Our community deserves timely access to modern healthcare facilities. These postponements not only undermine public trust but also jeopardise the health and well-being of Reading residents.\"\nThe Reading Liberal Democrats are calling for immediate action and transparency from the government regarding the hospital's redevelopment timeline. They urge local MPs to hold the government accountable and prioritise the health needs of the community.\nMeri O’Connell, Liberal Democrat Councillor for Tilehurst, added:\n\"It's disheartening to see Reading’s MPs fail to support motions in Parliament that would address the healthcare crisis. The state of local healthcare is dire, and the continuous delays in the hospital's rebuild only exacerbate the situation. We need our representatives in Reading to follow the example of Wokingham MP Clive Jones, who seizes every opportunity to push for improvements to the NHS and especially the Royal Berkshire Hospital. His first official letter as an MP was to Health Secretary Wes Streeting calling for the urgent rebuild of the RBH, while he used his maiden speech in the House of Commons to raise the issue again.\"\nThe Reading Liberal Democrats remain steadfast in their commitment to advocating for improved healthcare services and holding the government accountable for its obligations to the community.",
  "http_www_readinglibdems_org_uk_/https_www_readinglibdems_org_uk_about_people_committee/content_22.html": "Our Executive Committee\nThe 2024 Executive Committee for the Reading Liberal Democrats was elected at our 2023 AGM. Our key office holders can be contacted below:\nChair: Dr John Grout - chair@readinglibdems.org.uk\nSecretary: Pieter De Boiserie - secretary@readinglibdems.org.uk\nTreasurer: Chris Dodson - treasurer@readinglibdems.org.uk",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-9/content_58.html": "GP “retirement time bomb” in Berkshire West revealed with 22% nearing retirement\nThe Liberal Democrats have warned of a “GP retirement time bomb,” after new research by the party reveals more than 2 in 9 family doctors are nearing retirement age.\nThe Liberal Democrats have warned of a “GP retirement time bomb,” after new research by the party reveals more than 2 in 9 family doctors are nearing retirement age.\nNew research published by the Liberal Democrats has revealed the impact of the social care crisis on the NHS and the Royal Berkshire Hospital, with medically fit patients left stuck in hospital beds waiting for care.\n437,093 GP appointments in Berkshire West in the last year lasted less than five minutes, new research by the Liberal Democrats has revealed.\nLiberal Democrats in Reading call to allow all qualifying foreign residents to vote in next year’s local elections.\n182 children’s operations have been cancelled at the Royal Berkshire Hospital over the last five years, many due to a shortage of staff and beds, shocking figures uncovered by the Liberal Democrats have revealed.\nReading’s Liberal Democrats have accused the Conservatives of letting their communities down as new analysis reveals that just 2% of car thefts in the Thames Valley result in a charge.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-7/content_51.html": "Waiting list for diagnostic tests in Reading reaches almost 7000\nNHS waiting lists in Reading for basic diagnostic tests - including MRI and CT scans - grew by 26% between June 2019 and July 2023, up to 6,855.\nNHS waiting lists in Reading for basic diagnostic tests - including MRI and CT scans - grew by 26% between June 2019 and July 2023, up to 6,855.\nThe Lib Dems have become the only major party to commit to the triple lock on pensions, supporting the 29,693 pensioners living in Reading East and West.\nA total of 143,840 children in Buckinghamshire, Oxfordshire and Berkshire West have not been seen by an NHS dentist for at least a year, shocking new figures published by the Liberal Democrats have revealed.\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease.\nThe Liberal Democrats have called for rail fares to be frozen for the next 5 years after ministers have refused to say how much rail tickets will rise by next year.\nThe Liberal Democrats select Helen Belcher as their Parliamentary Candidate for the new Reading West & Mid Berkshire constituency",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_vote-liberal-democrat-today/content_94.html": "Vote Liberal Democrat Today!\nVote Liberal Democrat in Reading today, and help us demand better for Reading!\nMay the 5th 2022 is polling day in Reading's local council elections. For the first time in 18 years, the entire council is up for election at once. Voters across Reading have a chance to vote for the great team of 20 candidates which we have standing across the Borough, and for the measures in our 2022 Manifesto.\nPolling stations are open from 7:00 am until 10:00 pm - you can find your polling station here - remember that the boundaries have changed, so your polling station may be different this year. Polling stations have been made Covid-safe, and if there's a queue, if you're in it by 10:00 pm you will still be able to vote. Remember to bring a pencil, your mask, and your polling card - you don't need your polling card to vote, but it will make it quicker for the polling station staff, and safer for everyone.\nReading deserves better. Demand better for Reading - and vote Liberal Democrat today.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_almost-pound70-million-needed-to-fix-crumbling-royal-berkshire-hospital/content_103.html": "Almost £70 million needed to fix crumbling Royal Berkshire Hospital\nAlmost £70 million is needed to clear The Royal Berkshire Hospital repair backlog, new analysis by the Liberal Democrats has found.\nThe national hospital repair bill reached a record high of £11.6 billion, last year, rising by over £1 billion. It comes as the NHS budget was slashed by £5 billion in real terms following the Autumn Statement.\nAt the same time, surgery and treatment waiting lists are near record highs at 7.7 million.\nThis is in addition to the announcement last year that a new Royal Berkshire Hospital that was originally promised by the Conservative Government by 2030 will now be delayed well into the following decade.\nReading’s Liberal Democrats are calling for the government to provide urgent investment in local hospital buildings to ensure they are safe and can function effectively.\nReading Liberal Democrat Councillor Meri O’Connell said:\n\"This Conservative government has let our community's hospitals fall apart. The backlog of repairs is putting the patients and staff in Reading at risk. It is completely unacceptable and utterly disgraceful that it has been allowed to come to this.\n\"People in Reading deserve to know that they can go and get the treatment they need in a safe environment, not having to worry that they are being treated in a place that is collapsing around them.\n\"The Conservative party cannot be trusted with our NHS and cannot even be trusted to ensure the basic safety of staff and patients.\n\"Their neglect of our local health services is unforgivable.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_local-conservative-mps-vote-against-criminalising-water-companies-for-sewage-spills/content_33.html": "Local Conservative MPs vote against criminalising water companies for sewage spills\nLocal MPs Farris and Redwood vote against law to criminalise water companies for sewage spills - and Sharma and Rodda don't even show up!\n- A Liberal Democrat amendment in Parliament would have seen water companies in court for the worst sewage offences\n- The Environment Agency backs calls for water company bosses to face criminal action\n- Conservative MPs voted down “justice for swimmers, wildlife and our natural environment” - and Labour MPs abstained\nOn Wednesday evening, Conservative MPs including local MPs Laura Farris and John Redwood voted against a new law which would have seen water companies in court for sewage spills.\nThe vote in Parliament took place on the same day a BBC report found sewage had been illegally dumped in the UNESCO protected Lake Windermere in the Lake District. Meanwhile sewage continues to blight communities in our area, including Hampstead Norreys, East Ilsley, Sulhamstead and others.\nThe new law, opposed by Conservative MPs, would have created criminal offences for failing to meet pollution performance commitment levels, ensuring the polluting firms would go to court and face punishments including fines.\nThe Environment Agency has previously called on water company Chief Executives and board members to face criminal charges, including court imposed fines.\nDespite cross-party support for the amendment, over 250 Conservative MPs voted against it, including Laura Farris, the MP for Newbury (which on the abolished boundaries includes most of the Pang Valley), and John Redwood, MP for Wokingham. Alok Sharma, the current Conservative MP for Reading West, and Matt Rodda, the Labour MP for Reading East, both abstained - along with the entire rest of the Labour party.\nHelen Belcher, Liberal Democrat candidate for Reading West and Mid Berkshire said:\n“It is shocking that Conservative MPs in our area have voted against this tough action on polluting water firms - and that Alok Sharma and Labour didn't even vote.\n“This is a national scandal which has blighted our own community. Water companies should have their day in court for environmental vandalism.\n“This law would have delivered justice for swimmers, wildlife and local rivers, yet Conservative MPs shamelessly opposed it and Labour didn't have the courage to even turn up. They simply don’t care about our environment and protecting swimmers and residents from the blight of sewage spills.\n“Our community in Reading West and Mid Berkshire needs a new MP who will get tough on water firms rather than protect them from the consequences of their own shortcomings. At the next General Election, I will pledge to stand up for our environment and vote to get a grip on polluting companies.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_statement-on-the-international-day-against-homophobia-biphobia-and-transphobia-2024/content_38.html": "Statement on the International Day Against Homophobia, Biphobia and Transphobia 2024\nThe 17th of May every year is a day to reflect on how far we’ve come in the fight for equality, and how far we have yet to go. We believe no-one should be enslaved by poverty, ignorance, or conformity. No-one should be left behind; freedom, equality and justice should be enjoyed by all.\nWe’re proud to stand with the LGBT+ community and its allies in Reading and across the UK and the world, today and every day.\nNever stop being yourself. Never stop learning. Never stop being kind. And always have hope.\n- the Executive of the Reading Liberal Democrats",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-set-out-legal-right-to-timely-cancer-care-as-figures-show-732-patients-in-reading-waiting-more-than-two-months-to-start-treatment/content_87.html": "Lib Dems set out legal right to timely cancer care as figures show 732 patients in Reading waiting more than two months to start treatment\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease.\nThe latest NHS figures show that, in the last year, over 100,000 cancer patients in England were left waiting more than 62 days to start treatment after an urgent referral. This includes 732 cancer patients in the Royal Berkshire NHS Trust area.\nThis means only 28% of patients in the area were treated within two months, below the government target of 85%.\nWithin the Liberal Democrat election manifesto, Liberal Democrat Leader Ed Davey has set out proposals to invest an extra £8.4 billion a year in the NHS and social care.\nThe Liberal Democrat plan to boost cancer survival rates includes increasing the number of radiotherapy machines across the country, cutting the time for groundbreaking new medicines to reach patients, a new cancer research law, and improved support for cancer patients and their families.\nThe policy builds on existing proposals from the party on health, including introducing a right to see a GP within a week and expanding NHS dentistry so people aren’t forced to pay for private dental treatment.\nLiberal Democrat Parliamentary Candidate for Earley & Woodley, Tahir Maher said:\n“Everyone knows someone whose life has been turned upside down by cancer.\n“Far too many people are waiting far too long for a diagnosis, or to start treatment after being diagnosed. We must do right by them and get them the care they need when they need it.\n“The Liberal Democrats would give cancer patients a new, legal right to treatment within two months of an urgent referral, to make sure they get the timely care they deserve. This forms part of our ambitious plan to end unacceptable cancer delays and boost survival rates.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_cut-vat-to-save-families-in-reading-pound33300000-say-local-lib-dems/content_117.html": "Cut VAT to save families in Reading £33,300,000 say local Lib Dems\nReading Liberal Democrats have demanded an emergency cut to VAT to protect local families from soaring bills and the Conservatives' worsening cost of living crisis.\nThe Liberal Democrats are calling for the standard rate of VAT to be reduced from 20% to 17.5% for one year, a move that would save households in Reading an average of around £600 each. This would mean putting around £33,300,000 back in the pockets of 55,500 families in Reading.\nThe plans were set out by Liberal Democrat Leader Ed Davey at the party’s Spring Conference in March and have been backed by Liberal Democrat Group Leader on Reading Borough Council, Meri O'Connell\nIt comes amid warnings that the war in Ukraine will worsen the cost of living pressures facing households, with energy, food and fuel bills all expected to rise. Inflation is also forecast to reach 8% in April, its highest level in decades.\nThe Lib Dem plans would support the economy by boosting spending at local high streets. The proposals would also be expected to keep inflation down by making the prices of everyday items lower than they would have been.\nThe emergency change to VAT could be introduced quickly and easily by the Chancellor for one year. Reading’s Liberal Democrats have said he should have used the Spring Statement on March 23 to bring forward the change as well as scrapping the Conservative’s National Insurance tax hike, to bring much-needed respite to local families.\nLiberal Democrat Meri O'Connell said:\n“The Conservative cost of living crisis is hitting families hard and it is about to get worse. People across our community are worried about how to make ends meet as bills go through the roof.\n“An emergency cut to VAT would offer a massive boost to people in Reading feeling the pinch by putting £33,300,000 back into their pockets. It would also support our treasured shops, cafes and restaurants by boosting spending on the high street.\n“This is crunch time for the Chancellor and the Conservatives. Will they act or just inflict more financial pain on families by clobbering them with another unfair tax hike?”\nLiberal Democrat Leader Ed Davey said:\n“This is a once-in-a-generation crisis, and the government must step up to help struggling households and businesses on the brink.\n“Instead of clobbering struggling families with a tax hike, the Chancellor should be putting money back into their pockets.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-lib-dems-slam-thames-water/content_75.html": "Reading Lib Dems slam Thames Water\nReading’s Liberal Democrats have slammed Thames Water for their shocking performance in recent weeks. Barely three weeks into 2024, Reading residents have seen flooding, sewage leaks, road disruptions, and now water shortages and school closures, all courtesy of Thames Water – which is now proposing raising customers’ bills by almost £15 per month despite paying tens of millions of pounds in dividends to its parent company in recent years.\nJames Moore, Councillor for Tilehurst and leader of the Liberal Democrats on Reading Borough Council, said:\n“For three days now, residents across Reading and into West Berkshire have been suffering from no or low water pressure. After this latest issue on Sunday, west Reading residents have been left in the lurch, with the emergency water stations closing when people most needed them, and very slow to reopen the next day. A neighbour called Thames Water when the water went off completely on Sunday evening, only to be told by the operator to go and buy water from a shop!\n“Thames Water are taking the mickey with this new proposal to increase customers’ bills. If they need to raise money, they need to look closer to home before raiding residents’ wallets during a cost-of-living crisis.”\nHelen Belcher, Liberal Democrat candidate for Reading West and Mid Berkshire at the upcoming General Election, said:\n“Right across our area, residents are telling me that Britain feels broken – nothing encapsulates this better than the chaos and disruption caused by Thames Water over the last few weeks. The floods around the new year were made worse by incessant sewage dumping. [5] Last week, some residents were swamped by too much water. Now, residents don't have anywhere near enough.\n“Thames Water need to get their house in order. So far this year, they have flooded residents’ homes and parks with sewage, caused traffic chaos by digging our roads up, and cut or reduced their water supply for days on end. Asking residents to pay ever more for such a shockingly bad service, after paying millions of pounds of dividends, only adds insult to injury.\n“Liberal Democrats in Parliament have a plan to turn Thames Water into a public benefit corporation, forcing it to reinvest in its network before paying out dividends. I urge everyone to support Tim Farron’s bill and see an end to this utter shambles.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-5/content_37.html": "Lib Dem candidates issue rallying cry to save Reading FC\nWearing a Reading FC strip at the Lib Dem Conference in York, Henry Wright joined Clive Jones and called for Reading FC to be saved.\nWearing a Reading FC strip at the Lib Dem Conference in York, Henry Wright joined Clive Jones and called for Reading FC to be saved.\nFour-week waits for a GP appointment in Berkshire West reached over 130,000 last year\nFunding for GP practices in Buckinghamshire, Oxfordshire and Berkshire West has been slashed by over £20m in real terms since 2019\n- There has been a 152% rise in patients in Reading waiting more than four hours in A&E since 2019 - In Reading, almost 49,000 people waited over four hours in 2023\nOfficial statistics from the police have shown that, across Tilehurst, only 3% of crimes committed in the past year have resulted in a conviction or a caution.\nA huge error by the Conservative Government has left local schools in Reading with over a million pounds less than promised.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-2/content_42.html": "Over 11 thousand over 80s at risk of losing Winter Fuel Payments in Reading as Lib Dems calls on govt to “change course”\nOver 11 thousand of those aged over 80 in Reading are at risk of losing their Winter Fuel Payments due to the government’s cuts, the latest official statistics have revealed.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_figures-reveal-gp-funding-slashed-in-reading-and-west-berkshire-since-2019/content_49.html": "Figures reveal GP funding slashed in Reading and West Berkshire since 2019\nFunding for GP services across Buckinghamshire, Oxfordshire and Berkshire West has been slashed by over £20m in real terms since 2019, research commissioned by the Liberal Democrats has revealed.\nThe House of Commons Library analysis looks at funding for General Practices over the past four years once inflation is taken into account. It shows that funding per patient across the local NHS Integrated Care Board area, including Reading, has fallen by 11% since 2019, once inflation is taken into account. This is the worst affected area in the country outside London, with funding per patient effectively unchanged from 5 years ago, despite rampant inflation over that time.\nThis real-terms cut comes despite growing demand for GP services and patients often having to wait weeks to get an appointment.\nNationally, GP practices have received a 7% real terms cut in funding per patient since 2019, whilst NHS hospital waiting lists are near record numbers at 7.6 million.\nReading Liberal Democrats are calling for patients to be given a legal right to see their GP within seven days, or 24 hours if in urgent need. This would be achieved by increasing the number of fully qualified GPs by 8,000 with an initiative to boost recruitment and retain more experienced doctors.\nHelen Belcher, Liberal Democrat Parliamentary Candidate for Reading West and Mid Berkshire said:\n“Every day I hear stories about families and pensioners across Reading and Mid Berkshire struggling to see their GP despite requiring medical advice. People are waiting in pain or simply anxious about not getting the care they need.\n“It is not right that our community is suffering the consequences of this Conservative government’s neglect of our local health services.\n“Rishi Sunak and his failing government are totally out of touch with people’s concerns. Conservative MPs are so busy trying to deflect blame from themselves that they cannot deliver the health services that we so desperately need and rely on.\n“Seeing your GP should be at the heart of our NHS. That is why the Liberal Democrats are calling for a legal right to see a GP within seven days - or 24 hours if in urgent need.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_kentwood-hill-land-sale-concerns-residents/content_109.html": "Kentwood Hill land sale concerns residents\nLots of you have contacted us about the land around the Kentwood Hill allotments, that is being put up for sale by the Tilehurst People's Local Charity. The Charity wants to use the proceeds to increase the financial support they can offer to Tilehurst residents during these times of ever-increasing living costs that are forcing people into poverty.\nTilehurst Lib Dem Councillor Meri O’Connell says: “The Lib Dems believe that green spaces like this are precious assets which need protecting. The pressure to over-develop our area is having a major impact on our wildlife, our schools and our health services. We will oppose any development on our woodlands and parkland.\n“We need more housing in Tilehurst, but the Lib Dems say we must have the type of housing we need in the places it is needed. We need affordable, energy efficient 2 and 3 bedroom houses, not whatever makes most profit for developers, and not on our green spaces.”\nResidents who feel passionately about the threat of development here can appeal directly to the charity, and there will be a chance to express your views when developers submit planning permission to the Council. Residents who are concerned can also visit Keep Kentwood Green to share their views.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_more-than-three-quarters-of-all-burglaries-in-the-thames-valley-go-unsolved/content_89.html": "More than three-quarters of all burglaries in the Thames Valley go unsolved\nMore than three-quarters of burglaries went unsolved in the Thames Valley in the 2022/2023 financial year - an average of 16 a day, new analysis has revealed.\nThe figures, from official Home Office statistics, show that, between April 2022 and March 2023, a total of 5,895 burglaries in the Thames Valley were closed without a suspect being identified, accounting for 76% of all cases. Meanwhile, just 6% of Thames Valley burglaries resulted in a suspect being charged or summonsed.\nThe national figures paint a similarly dire picture. Across England and Wales, nearly 77% of all burglaries went unsolved in that same time period.\nReading’s Liberal Democrats have slammed the Government for these figures. Since 2015, the Conservatives have taken over 4,000 Police Community Support Officers off the streets. And as of last year, fewer than one in eight of officers across England and Wales were assigned to frontline neighbourhood policing teams.\nThe Liberal Democrats are calling for a return to proper community policing, where officers are trusted and visible in their neighbourhoods, with the time and resources to focus on tackling local crimes like burglaries. The party is also calling for a new “Burglary Response Guarantee” under which all domestic burglaries would be attended by the police and properly investigated.\nCommenting, Liberal Democrat Group Leader on Reading Borough Council, Councillor James Moore, said:\n“Everyone deserves to feel safe and secure in their own homes. But under this terrible Government, so many burglars are getting off scot-free. These figures will bring little comfort to the people of Reading.\n“It’s a disgrace that our local communities are paying the price for the Conservative Government’s failures to get tough on burglaries.\n“The Conservatives must finally bring back proper community policing and back the Liberal Democrats Burglary Response Guarantee so all burglaries are attended by the police. It’s the only way to reverse these shocking figures.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_about_people/content_9.html": "Meet the Reading Liberal Democrats\nOn this page you can find out more about who's who in the Reading Liberal Democrats, our councillors, and committee.\nOn this page you can find out more about who's who in the Reading Liberal Democrats, our councillors, and committee.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-commuters-hit-with-pound187-hike-in-rail-fares/content_95.html": "Reading commuters hit with £187 hike in rail fares\n- Liberal Democrats call for fare freeze as cost of living crisis worsens\n- Annual season ticket for Reading commuters forecasted to reach £5044 for the first time\n- London travelcards for tube and bus services set to be scrapped for Reading passengers\n- 10% of people in Reading regularly commute by train\nThe cost of an annual season ticket for Reading commuters will rise by the most in a decade despite the cost of living crisis worsening.\nAnnual season ticket prices between Reading and London Paddington will rise by a staggering £185 to £5044.\nBy 2026, the annual season ticket price for Reading commuters is forecasted to be £5,567 if the Government does not freeze rail fares. The rise comes despite reduced services compared to pre-pandemic timetables.\nDaily travelcards for those travelling on national rail services to London are also set to be scrapped, meaning passengers will pay more for tube and bus services in the capital.\nThe Liberal Democrats are calling for rail fares to be frozen for five years and for pre-pandemic timetables to be restored.\nJames Moore, Liberal Democrat campaigner for Reading, said:\n“It is outrageous to hike rail fares in the middle of a cost of living crisis. This Conservative Government is completely out of touch.\n“Tax rises are coming, energy bills are skyrocketing and now rail fares are set to rise for people in Reading.\n“I am calling for a fair deal for people in Reading with a fare freeze and the Government to cancel all tax hikes. The cost of living crisis is getting worse by the week and Boris Johnson is too busy trying to save his own job”\n“We should be making green forms of transport cheaper, yet this Conservative Government is determined to make rail more expensive than ever before.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk/content_1.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_search/content_16.html": "News\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care…\nView\nNews\nLast year, Thames Water pumped over 298,000 hours worth of sewage into waterways, according to new data published recently.\nIn Reading, residents are increasingly concerned about the spoiling of…\nView\nNews\nReading Liberal Democrats have criticised Thames Water for asking the water regulator for permission to charge their customers even more for failing services.\nView\nNews\nReading Liberal Democrats have slammed proposals that would allow Royal Mail to significantly reduce the deliveries of second-class post, including scrapping Saturday delivery and only delivering on…\nView\nNews\nThe Reading Liberal Democrats have expressed deep frustration over the government's protracted timeline for the much-needed rebuilding of the Royal Berkshire Hospital.\nView\nNews\nReading Liberal Democrats have criticised local Labour MPs for their decision to vote against rescuing community healthcare and end the carer's repayment scandal\nView\nNews\nOver 11 thousand of those aged over 80 in Reading are at risk of losing their Winter Fuel Payments due to the government’s cuts, the latest official statistics have revealed.\nView\nPage\nSave the Royal Berks rebuild!\nThe Royal Berkshire Hosital was built in 1839 and has served as our area's main hospital since then. Parts of the main building still date back to that time,…\nView\nNews\nThe Reading Lib Dems call for the government to guarantee rebuilding the RBH\nView",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news/content_19.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_about/content_5.html": "A Fair Deal for Reading\nReading needs a change: a change from failure, a change from complacency. Reading deserves better than its current leadership locally and nationally - and the Liberal Democrats are demanding a fair deal for Reading.\nLiberal Democrats offer that change through our commitment to the environment, to the freedoms and duties that strengthen our society, to getting a better deal on public services, cutting crime, and radical policies to return power to local communities.\nWe offer a positive agenda – but it is change that we want to see, to match our ambition for the area.\nLiberals and Liberal Democrats have been working hard for Reading and winning elections here since the 1850s, including in Tilehurst, which has been represented by Liberals and Liberal Democrats continuously since the days of Jim and Paddy Day in the 1960s, right up to now.\nOur Values\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nAs Liberal Democrats, we believe that power should be dispersed into communities, rather than concentrated anywhere. We believe that communities and individuals should have the power and resources to make the best of themselves and society as a whole. Safeguarding the environment, and safeguarding and expanding our hard-won civic rights and freedoms (particularly for disadvantaged groups), are at the heart of what we believe.\nWe allow evidence to lead us and our beliefs to guide us: Liberal Democrats are often more willing to work with others to achieve our aims; if someone has a good idea, we will listen, and we will approach issues and decisions on their merits.\nThe Liberal Democrats rely on small donations from our hundreds of thousands of supporters across the country - we aren't bankrolled by big buisiness, shady elites, or trades unions. Our only vested interest is in the community we serve - and in our case, that's Reading. We live here, we love our town, we want to see it, its people and its communities thrive - and we think our approach is the best way to make that happen.\nThat's why we do what we do.\nIf you want to find out more about what Lib Dems believe, the Preamble to the Federal Constitution is the best expression of our values; if you want to find out how we'd put those values into practice in Reading, have a look at our most recent manifesto; or go here if you'd like to see how we'd do that nationally. If you'd like to know how we run our local party, you can find out about our people and read our own local constitution below too.\nAnd if you like what you see - why not join us?\nRemember: Conservatives want to concentrate power in the elite and do things to you;\nLabour want to concentrate power in the state and do things for you;\nbut Liberal Democrats want to give power back to the people and do things along with you.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_conservatives-asleep-at-the-wheel-as-just-4-of-burglaries-in-the-thames-valley-result-in-a-charge/content_65.html": "Conservatives “asleep at the wheel” as just 4% of burglaries in the Thames Valley result in a charge\nReading Liberal Democrats have slammed the Conservatives for being “asleep at the wheel” on tackling community crime after damning new revelations show that almost all burglaries in the Thames Valley go unresolved.\nAnalysis of official Home Office data by the Liberal Democrats revealed that just 133, or 4%, of domestic burglaries in the Thames Valley resulted in a criminal charge or summons in the first three quarters of 2022. Across the country, the figure was also a dismal 4%.\nIn the same time period, a startling 2,359 burglaries went unsolved, amounting to 69% of all burglaries in the Thames Valley.\nReading Liberal Democrats have slammed the Government for these stark figures, saying the Conservatives have left police forces up and down the country overstretched and underfunded.\nThe party is calling for a return to proper community policing - where officers are visible and have the time to focus on preventing and solving crimes - so that criminals can no longer act with impunity.\nCommenting on the figures, Reading Lib Dem Leader Councillor Meri O'Connell said:\n“This Conservative Government's inaction has led to thousands of burglaries going unresolved - and thousands of families waiting endlessly for the justice system to take them seriously”\n“Everyone deserves to feel safe in their homes. The Government must make that possible by giving police forces the officers, time and resources they need to tackle domestic burglaries.”\n“To do this, Conservative Ministers must finally recruit the extra 20,000 police officers they have promised but failed to deliver.”\nReading Lib Dem Deputy Leader Councillor James Moore added:\n“These are shocking figures, compounded in our town by the Tory Police and Crime Commissioner who has slashed the community policing budget for areas like Reading while increasing it for Tory-voting areas like Bracknell, which have a much lower crime rate than Reading.\"\n\"Liberal Democrats are calling for a fair deal for Reading where the allocation of policing resources is driven by the needs of our communities and not the electoral interests of the Conservatives.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_page-1/content_25.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_volunteer/content_2.html": "Sign up to help\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_police-community-support-officers-in-thames-valley-cut-by-171/content_98.html": "Police Community Support Officers in Thames Valley cut by 171\nThe number of Police Community Support Officers (PCSOs) on the streets has fallen dramatically by 37.3% since 2015. Analysis of new Home Office statistics commissioned by the Liberal Democrats from the House of Commons Library has shown the drastic cuts to PCSOs in the Thames Valley.\nA total of 288 full-time equivalent PCSOs were employed in the Thames Valley as of September 2022. This is in stark contrast to the 459 that were employed in March 2015 - meaning there have been 171 PCSOs cut from Thames Valley Police in that time.\nThe Liberal Democrats have accused the Conservative Government of letting communities in Reading down by taking Police Community Support Officers off the streets, leading to more crimes going unsolved and victims going without justice.\nThe same trend is being seen up and down the country, with the number of active PCSOs falling by an average of 33% in England and Wales since 2015. Nationally, England and Wales have lost 4,068 PCSOs since 2015.\nReading Liberal Democrats have slammed the Conservatives for this move, which means that fewer officers are visible on the streets, building relationships - and trust - with local people. The party has called for a return to proper community policing.\nResponding to the figures, Councillor Meri O'Connell, Liberal Democrat Group Leader on Reading Borough Council, said:\n“These shocking figures prove that Conservative Ministers are yet again failing to prevent crime in Reading. They should be ashamed.\n“Police Community Support Officers play a vital role in keeping our communities safe. The Government should be empowering them to do their job, not slashing their numbers into oblivion.\n“Liberal Democrats are calling for a return to proper community policing, where officers are visible, trusted and known personally to local people. We will build communities where people are safe - and feel safe, too.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_donate/content_12.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowHelp us get a fair deal for Reading. The Lib Dems aren't in the pockets of big business or trades unions - all our funding comes from our members and supporters. Thank you so much for your support!\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_childcare-desert-in-reading-as-over-six-hundred-places-lost-since-2019/content_43.html": "Childcare desert in Reading as over SIX HUNDRED places lost since 2019\nChildcare desert: Reading sees over SIX HUNDRED childcare places lost since 2019.\nThere has been a 654 fall in the number of childcare places in Reading since 2019, House of Commons Library research commissioned by the Liberal Democrats has revealed.\nIt comes as applications opened yesterday (13th of May) for parents to register for 15 hours of free childcare from September for children from 9 months old. The Liberal Democrats said the fall in the number of childcare places and providers was putting the government’s plans into doubt and leaving parents “without options.” The party is calling on the Government to review the rates paid to providers for free hours to ensure they cover the actual costs of delivering high-quality childcare.\nIn Reading, 654 childcare places have been lost since 2019, falling from 4,697 to 4,043. It equates to a 14% fall in the number of places. The number of childcare providers in Reading has also seen a decline, with their now being 51 fewer than in 2019, a 26% fall.\nNationally, the number of childcare providers, including nurseries and childminders, has dropped by a fifth since 2019, from 61,162 to 48,143. Every area in the country but one has seen a fall in the number of childcare providers since 2019, leaving parents with less choice as to where they can get childcare.\nLast month the National Audit Office criticised the Government’s roll out saying that dates for the scheme were decided without the Department for Education or the Treasury understanding whether the sector would be able to provide the number of places needed. It recommended the DfE continuously review the expansion in case it needs to relook at the timeline due to concerns about place numbers and staffing.\nLiberal Democrat candidate for Reading Central, Henry Wright, said:\n“Childcare in Reading has been driven to the brink by years of neglect from this Conservative Government. Local parents have been left completely without options.\n“Free hours are no good if parents can’t find a nursery or childminder for their child – and thanks to this Conservative government's underfunding, many parents in Reading now face a near impossible task of finding childcare.\n“The government urgently needs to review the rates it pays providers to ensure they cover the actual costs of delivering high-quality childcare and early years education.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_campaigns_puberty-blockers/content_35.html": "End the ban on puberty blockers!\nLabour’s decision to defend the ban on puberty blockers is immoral, unjustified by evidence, and puts trans health care at risk. It is not supported by the evidence or by the recommendations of the Cass Review.\nPetition: End the Ban on Puberty Blockers\nWe, the undersigned, call for the immediate reversal of the ban on puberty blockers, for proper funding of all stages of trans healthcare, and for decisions on treatment to remain between doctors and their patients.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_contact/content_23.html": "Get in touch:\nYou can get in touch with us by any of the means below - we're looking forward to hearing from you:\nEmail: info@readinglibdems.org.uk\nFacebook: /ReadingLibDems\nInstagram: ReadingLibDems\nTwitter: @ReadingLibDems\nYouTube: ReadingLibDems\nPost: Write Freepost READINGLD on the envelope, and it'll get to us - you don't even need a stamp\nAre you a member of the press wanting to get in touch? Please email us on press@readinglibdems.org.uk\nWant to find out who we are? Click on the image, or here.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lower-energy-efficiency-standards-cost-owners-of-new-homes-in-reading-pound763200-since-2016/content_70.html": "Lower energy efficiency standards cost owners of new homes in Reading £763,200 since 2016\nHouseholds in Reading were slapped with an extra £763,200 in energy bills after Conservatives scrapped home efficiency measures in 2016. This has been made worse, as this April the Ofgem price cap increased by 54%, potentially devastating news for many households.\nAnalysis from the Lib Dems has found that the Conservative Government's decision to scrap the Zero Carbon Homes Standard in 2016 has added a total of £763,200 to energy bills in Reading. Under the scheme, bills would have been £300 cheaper per year.\nSince scrapping the scheme, 2,544 new builds have been built with lower efficiency standards and higher energy bills. The alarms come as the energy price cap is set to increase, causing bills to increase by 54%. Additionally, the Government is mooting scrapping more home efficiency measures such as the Energy Company Obligation (ECO) - a levy on energy bills that pays for energy efficiency measures for people on low incomes.\nThe Liberal Democrat Climate Change Spokesperson Wera Hobhouse MP commented:\n“The Conservatives have slapped hundreds of pounds onto people’s energy bills by scrapping energy efficiency standards for new homes. This shameful record has left over 1.2 million more people living in poorly insulated homes across the UK. This is making them even more vulnerable to soaring energy prices. The fact that ministers are now considering cutting more energy efficiency measures is yet another indication of their lack of commitment to reaching net zero and to real ‘levelling up’ for the less well-off.”\nLeader of the Liberal Democrats on Reading Borough Council, Meri O'Connell is leading the campaign for better homes and lower bills:\n“Families throughout Reading are facing sharp increases in the cost of living, made worse by the Government’s failure to show ambition and leadership in building better homes. The Conservatives have demonstrated many times over that they haven’t grasped the harsh realities that so many are facing.\nIn Reading, 2,544 homes have been built since the Conservatives scrapped the Zero Carbon Homes Standard. That’s 2,544 households facing £300 in extra energy bills every year. 2,544 households at risk of ill health in the winter. We demand more from our government.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-1/content_29.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-announce-plans-for-free-school-meals-for-over-3000-more-primary-school-children-in-reading/content_40.html": "Lib Dems announce plans for free school meals for over 3,000 more primary school children in Reading\ncrisis in a generation”.\nThe Liberal Democrats have launched their ambition to extend free school meals to all primary school children, funded by a new share buyback tax.\nThe government currently only provides meals for all children in reception, year 1 and year 2. In year 3 and above, the government has set stringent conditions on family income for children receiving free school meals.\nCurrently in Reading, just under 2,000 (21%) of primary school children in year 3 and above receive free school meals. In government, the Liberal Democrats would ensure 100% of primary school children receive free school meals.\nThe party’s plan also includes an immediate extension of free school meals to all 900,000 children living in poverty who currently miss out across both primary and secondary school. This is estimated to be 150,000 in the South East, who would all be covered under the Liberal Democrats’ plan.\nAnalysis by PWC found that every £1 spent on free school meals for the poorest children generates £1.38 in health and earnings benefits, including improvements to children’s health, education and future working life opportunities.\nThe new policy will make the Liberal Democrats the most ambitious party on free school meals.\nThe manifesto pledge would be funded by a 4% levy on the share buybacks of FTSE 100 listed corporations, similar to the excise tax on buybacks implemented by President Biden in the US, which could raise around £1.4bn a year.\nShare buybacks occur when companies use profits to inflate their own share price, a practice which critics have warned can come at the expense of productive investment in the economy.\nThe sectors using share buybacks the most are oil and gas giants, banks and large corporations that own a number of food and consumer goods brands. This suggests the practice is being driven by companies profiting from soaring prices during the cost of living crisis.\nLiberal Democrat Parliamentary Candidate for Reading Central, Henry Wright said:\n“Across Reading, there are too many children expected to learn on empty stomachs with no guarantee of a hot meal when they get home.\n“Conservative MPs should hang their heads in shame at a legacy of children going hungry in the worst cost of living crisis in a generation.\n“It is time for change. Every vote for the Liberal Democrats in Reading is a vote for a local champion who will fight for the wellbeing of children and their futures.\n“I am proud the Liberal Democrats have the most ambitious plan for free school meals of any party, which would save parents money and transform the future for millions of children.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_page-2/content_3.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_car-thieves-getting-away-with-it-as-almost-10000-cases-go-unsolved-in-the-thames-valley-since-last-election/content_59.html": "Car thieves “getting away with it” as almost 10,000 cases go unsolved in the Thames Valley since last election\nReading Liberal Democrats have accused the Conservatives of letting their communities down as a new analysis of Home Office statistics reveals that almost 10,000 car thefts have gone unsolved in the Thames Valley since the last election.\nThe data shows around 1 in 20 of car thefts in the Thames Valley Police area resulted in a suspect being charged or summonsed.\nNational figures paint a similarly bleak picture, with 3 in 4 of car thefts going unsolved since the last election. The number of unsolved car thefts has also soared in this period, with a 42% rise from 76,333 in 2020 to 108,934 last year.\nReading Liberal Democrats have slammed the Conservative Party for these stark figures, arguing that years of ineffective resourcing have decimated frontline policing. This includes their decision to take over 4,500 Police Community Support Officers (PCSOs) off the streets since 2015.\nThe Liberal Democrats are calling for Police and Crime Commissioners to be abolished and the savings invested into frontline policing instead - a move that could generate around £170 million over the course of the next Parliament.\nThis will help enable a return to proper community policing - where officers are visible, trusted, and have the time to focus on preventing and solving neighbourhood crimes - so that criminals can no longer act with impunity.\nCommenting on the figures, Liberal Democrat Candidate for Reading West & Mid-Berkshire, Helen Belcher said:\n“Criminals are getting away with almost every car theft in Reading - which is an outrageous failure from the Conservative Government.\n“These thieves have brought misery to our communities, and must be caught but the local police are too overstretched to actually do it. By slashing community officer numbers, the Conservatives are only benefiting the criminals.”\n“We need a return to proper community policing, with visible officers who are preventing and tackling crime.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dem-candidates-issue-rallying-cry-to-save-reading-fc/content_44.html": "Lib Dem candidates issue rallying cry to save Reading FC\nHenry Wright, Lib Dem candidate for Reading Central, spoke passionately at the Lib Dem Spring Conference in York on Saturday, calling on the Government and the EFL to intervene to save Reading FC from collapse - and in support of Lib Dem proposals to increase support for grassroots sport and widen availability of televised sports coverage so more people can enjoy it.\nHenry has joined Clive Jones, Lib Dem candidate for Wokingham, in backing Sell Before We Dai's calls to save Reading FC for the town. Clive's intervention on the same day as Henry's speech highlighted a planning stipulation that the Bearwood training ground may only be used by Reading FC, helping forestall attempts by Reading FC's owner to strip the world-class facility from the club and sell it off.\nAddressing the Conference wearing a Reading FC strip, Henry said, \"You might have noticed this shirt I'm wearing - what does it mean? Well, to me it makes me part of a community that has existed in one way or another in Reading since 1871. It is of course the shirt of my beloved Reading Football Club. It unites people from across my town, from different areas, different backgrounds, different views, in their love of the sport. But I have to say - sport is a powerful thing, but it is at its weakest when we give too much power to corporations and big money.\n\"Today, my beloved Royals are on the verge of collapse thanks to the very greed we seek to address. The EFL have allowed the club to be bought by an irresponsible owner, Dai Youngge; he's selling our training ground, he's not paying our staff, he is ruining the club, and he is potentially going to rob this sporting asset from the town - so if anyone from the EFL or DCMS is watching, we must save Reading Football Club.\n\"And it's this feeling of people across Reading which illustrates why me must support Lib Dem proposals to open up sport for the people - and support people who are supporters, players, athletes, trainers and back-office staff. I work for the NHS and I know that increasing our activity would increase our health. I hope this illustrates the plight of my club - the plight of my town - and the feelings these proposals create. Sport is for the people, and we should support these proposals.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_campaigns/content_8.html": "Our Campaigns\nFind out about the big issues we're campaigning on, locally and nationally\nRebuild the Royal Berkshire Hospital\nThe Reading Liberal Democrats are calling on Chancellor Rachel Reeves and Health Secretary We Streeting to guarantee the rebuild of the 19th Century Royal Berkshire Hospital and to reinstate it in the list of projects that will continue.\nEnd the Ban on Puberty Blockers\nThe Reading Liberal Democrats are joining national calls to end the Conservatives' cyncial and destructive ban on puberty blockers, which the Labour Government has decided to continue.\nSave Tilehurst's Free Half Hour\nTilehurst's local councillors and the Reading Liberal Democrats are campaigning to overturn Labour's scrapping of the free half-hour parking window in Tilehurst car parks, and retain them for Tilehurst residents and businesses.\nSave Tilehurst's Last Bank\nAnne Thompson and the Liberal Democrats are campaigning to save Tilehurst's last bank and retain local banking services for Tilehurst residents and businesses.\nNational Campaigns\nBack our national campaigns on everything from the environment and the cost of living to saving our NHS and fixing our broken politics.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-14/content_31.html": "Reading's Lib Dems back “Robin Hood tax” on energy giants to support families with heating bills\nReading's Liberal Democrats have today written to the Secretary of State for Energy Kwasi Kwarteng demanding that he backs the party’s call for a “Robin Hood” tax on the super-profits of oil and gas firms, to raise money to support local families facing soaring energy costs.\n4 Feb 2022",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_29081-pensioners-in-reading-left-out-in-the-cold-as-broken-triple-lock-promise-creates-pound628150-cost-of-living-black-hole/content_120.html": "29,081 pensioners in Reading left out in the cold as broken triple lock promise creates £628,150 cost of living black hole\nThe Liberal Democrats have accused the Conservatives of leaving pensioners in Reading with a “hole in their pocket” after breaking a manifesto promise to protect the state pension.\nIn the wake of inflation hitting a thirty year high of 5.5% in January, a typical pensioner in Reading is set to see their income fall by £171.60 this year in real terms. This is a total loss of income of £4,990,300 between 29,081 pensioners in Reading due to the Conservative government’s decision to break a key manifesto promise and scrap the triple lock on pensions.\nAnalysis by the Liberal Democrats has shown this broken promise will wipe out the “paltry support” being offered by the government to help pensioners cope with soaring energy bills. Even those pensioners who qualify for a council tax rebate will be left over £20 poorer in real terms, while those on the New State Pension will be left short-changed by £76.20. It means retirees in Reading are facing down a £628,150 gulf between their lost pension income and support, with that only gulf only set to widen further with the Bank of England forecasting inflation in April of 7.25%.\nReading Liberal Democrats are calling on the Government to row back on their broken promise and guarantee a fairer increase to the state pension. The party is also calling for a doubling and expansion to the Warm Home Discount, giving 19,096 households in Reading £300 each off their heating bills this year & a doubling of the Winter Fuel Allowance, to the benefit of 48,380 households.\nLiberal Democrat Spokesperson for Reading, Meri O'Connell, said:\n“These figures expose a black hole in the Government’s cost of living package for pensioners.\n“In breaking their manifesto promise and failing to protect the state pension, the Conservatives have plunged older people in Reading into the depths of a cost of living crisis. Their paltry support doesn’t even begin to cover the additional costs people are facing during this cold and bitter winter.\n“Pensioners are among the most vulnerable people in Reading. This out of touch Government has left them out in the cold, with a hole in their pocket and even harsher days ahead.\n“It’s high time the Government showed some common sense and ensured a fair increase to the state pension. But we also need to see something much more ambitious to help pensioners in Reading. Doubling the Warm Home Discount and Winter Fuel Allowance, funded through a Robin Hood tax on the super-profits of oil and gas giants, would be a good place to start.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_waiting-list-for-diagnostic-tests-in-reading-reach-almost-7000/content_53.html": "Waiting list for diagnostic tests in Reading reaches almost 7000\nNHS waiting lists in Reading for basic diagnostic tests - including MRI and CT scans - grew by 26% between June 2019 and July 2023, up to 6,855.\nThe research from the House of Commons Library, commissioned by the Liberal Democrats, shows that the proportion of people waiting over six weeks for a diagnostic test is well above the NHS target of less than 1%. The percentage of people waiting more than six weeks has spiked since 2019 by 28%.\nReading Liberal Democrats are calling for an expansion of community diagnostic centres to bring services closer to where people live and ensure they can be seen far quicker.\nThe party is also calling for the right for everyone to see their GP in seven days by increasing the number of appointments and the number of GPs by 8,000. The Lib Dems have also called for investment in new hospital equipment to ensure that patients get the first-class treatment that they deserve.\nLeader of the Liberal Democrats on Reading Borough Council, Councillor James Moore said:\n“What this Conservative government has done to the NHS is nothing short of a national scandal. Thousands of patients in Reading are forced to wait in pain and discomfort, anxiously wondering when they will get a diagnosis, let alone treatment.\n“Ministers are missing in action in this NHS crisis, and it’s patients in Reading who are suffering. We need urgent action to get on top of this mess, end these appalling delays and ensure our community gets the local health services that we deserve.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-11/content_66.html": "Lib Dems say \"Save the last bank in Tilehurst!\"\nThe last bank in west Reading is slated for closure - sign the Lib Dem petition to save it!\nThe last bank in west Reading is slated for closure - sign the Lib Dem petition to save it!\nReading Borough Councillors unanimously backed a motion calling for people in employment who also have caring responsibilities to be given a right to unpaid leave.\n140 businesses in Reading are facing a huge £353,895 energy bill increase once Government support is slashed in April, new analysis from the Liberal Democrats has revealed.\nLeader of the Liberal Democrats on Reading Borough Council, Councillor Meri O'Connell talks about voter ID...\nThe number of Police Community Support Officers (PCSOs) on the streets has fallen dramatically by 37.3% since 2015.\nHouseholds in Reading were slapped with an extra £763,200 in energy bills after Conservatives scrapped home efficiency measures in 2016. This has been made worse, as this April the Ofgem price cap increased by 54%, potentially devastating news for many households.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_scrap-the-two-child-limit-on-benefits-say-local-lib-dems/content_78.html": "‘Scrap the Two Child Limit on Benefits’ – say local Lib Dems\nReading Liberal Democrats are calling for the two-child limit on benefit payments, introduced by the Conservative Government in 2017 and supported by the current Labour Government, to be scrapped.\nThe two-child limit affects over 1.5 million (or one in ten) children across the UK. In Reading alone, almost 4,000 local children are affected and many live in poverty as a result.\nWith Labour and the Conservatives supporting the cap, the Lib Dems are the only major UK-wide party committed to scrapping it. They set out how to pay to scrap the limit in their recent General Election manifesto by reversing the Conservative cuts to big bank taxes, restoring Bank Surcharge and Bank Levy revenues to 2016 levels in real terms.\nLeader of the Liberal Democrats on Reading Borough Council, Councillor James Moore said:\n“The two-child limit on benefits is a heartless and harmful policy that has had no impact other than to help plunge over 1,000 local families into poverty.”\n“The Liberal Democrats have consistently opposed this cap both locally and nationally. We have moved a motion to Reading Borough Council calling on the whole council to signal its opposition to the Labour Government.”\n“It’s shameful that Sir Keir Starmer and his Labour Government are committed to keeping this cruel Conservative policy. There really is very little difference between Labour and the Conservatives, but the Lib Dems are on local people’s side.”\n“Cancelling the two-child limit on benefit payments will immediately lift 250,000 children out of poverty in the UK, and significantly reduce poverty for a further 850,000 children. It would help thousands of local families as the cost of living continues to rise. It’s simply the right thing to do.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_labour-admit-reading-west-and-mid-berkshire-is-not-a-battleground-seat/content_115.html": "Labour admit Reading West and Mid Berkshire is not a “battleground seat”\nThe Labour Party recently opened selections for over 200 constituencies across the country which they do not consider to be “battleground seats”. Reading West and Mid Berkshire is the only one of the three seats in Reading Borough which is included on the list.\nHelen Belcher, the Liberal Democrat prospective parliamentary candidate for Reading West and Mid Berkshire, commented, “It’s a relief to see that the Labour Party are admitting, at last, that the contest for Reading West and Mid Berkshire is between the Liberal Democrats and the Conservatives. The Liberal Democrat campaign is already underway - we are serious in wanting to win this seat.”\nDr John Grout, the chair of the Reading Liberal Democrats, added, “We are already seeing the benefit of being the first party to select a candidate for Reading West and Mid Berkshire. We are finding so many voters wanting a change of government, and willing to vote for us. Helen will be a marvellous MP, and has already shown she’s working hard to win the seat.”\nBelcher continued, “It’s clear that Liberal Democrats have a real chance of winning here. May’s local elections clearly showed us in contention across the seat, with more Lib Dem councillors elected than either Conservative or Labour. That’s real votes, not models or projections. Conversations across the constituency confirm that local voters are taking us as serious contenders. And all the time the Conservative government is making itself more and more unpopular, throwing huge amounts of money at its pet schemes while ignoring the pressures on household budgets, the NHS, and council funding.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_save-the-last-bank-in-tilehurst/content_114.html": "Lib Dems say \"Save the last bank in Tilehurst!\"\nThe Tilehurst NatWest branch on School Road is under threat of closure. After other banking closures in recent years, this would leave Tilehurst and all of west Reading without any banks, forcing residents to travel into Reading town centre to access banking services in person.\nLocal Lib Dem councillor Anne Thompson has called for NatWest to think again – and launched a petition calling for Tilehurst's last bank to remain open.\nAnne said: “Many people in our area rely on this bank. Losing the last branch of any bank in our area will have a devastating impact on our local high street. Residents and businesses will be forced to travel into Reading town centre instead.”\nAnne has also written to the bank to express her concerns about the plans. They are encouraging local people to get in touch and back the petition – which can be found here.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_over-400-children-in-berkshire-waiting-for-specialised-dental-care/content_116.html": "Over 400 children in Berkshire waiting for specialised dental care\n404 children in Berkshire are stuck on NHS waiting lists for specialised dental care, including some with severe tooth decay or other serious dental problems, shocking new figures uncovered by the Liberal Democrats have revealed.\nOn average, children in the area are waiting 12 weeks for specialised dental treatment under General Anaesthetic after a referral.\nThe Liberal Democrats said the figures were “heartbreaking” and called for urgent action to tackle long waiting times and ensure children can access the emergency dental care they need.\nThe figures were released by the NHS in response to a Freedom of Information request by the Liberal Democrats. They show that across the country, 27,000 children were waiting for a routine assessment for community dental services in January 2023.\nCommunity Dental Services provide treatments to a range of patients that need specialised care because they have specific needs. This can include children with severe untreated tooth decay, those with physical or learning disabilities and those who need specific treatment for complex dental problems.\nThe Liberal Democrats are urging the government to take immediate steps to address this dental crisis. The party is calling for the £400 million of NHS dental services funding that went unspent last year to be immediately deployed to bring waiting times for community dental services down, and increase the number of NHS dental appointments.\nThe party’s plans also include providing additional resources for mobile dental units to visit schools, community centres and care homes, and the removal of VAT on children’s toothbrushes and children’s toothpaste.\nReading Liberal Democrat Councillor Meri O’Connell said:\n“It is heartbreaking to think that children in our community are being left waiting in pain for the specialised dental care they need.\n“We need urgent action to give every child access to the dental care they need.\n“NHS community dental services are a crucial lifeline for vulnerable patients across our society, from children to older people.\n\"The government must take urgent action to address this dental crisis, including tackling staff shortages and reforming the broken system that has driven dentists away from offering NHS appointments.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_car-thieves-getting-away-with-it-as-just-2-charged/content_85.html": "Car thieves “getting away with it” as just 2% charged\nAnalysis of official Home Office data by the Liberal Democrats has revealed that In the first three quarters of 2022, 2,699 car thefts were reported in the Thames Valley. Only 53 cases resulted in a charge or summons.\nMeanwhile, 1,876 cases were closed without a suspect being identified - equivalent to 7 car thefts going unsolved every day.\nNational figures paint a similarly grim picture, with only 2% of all car thefts in the first three quarters of 2022 resulting in a charge - down from 4% in that same period in 2022.\nReading’s Liberal Democrats have slammed the Conservatives for the stark figures after years of their cuts have left police forces overstretched and under-resourced.\nThe party is calling for a return to proper community policing - where officers are visible and have the time to focus on preventing and solving crimes - so that criminals can no longer act with impunity.\nCommenting on the figures, Liberal Democrat Group Leader on Reading Borough Council, Councillor James Moore said:\n“The Government is asleep at the wheel. Criminals are getting away with almost every car theft in the Thames Valley - which is an outrageous failure.\n“These thieves have brought misery to our communities and must be caught and punished. But the local police are too overstretched to actually catch the criminals. By slashing community officer numbers, the Conservatives are only benefiting the criminals.\n“We need a return to proper community policing, with visible officers who are preventing and tackling crime.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_campaigns_tilehurst-bank/content_17.html": "Save Tilehurst's Last Bank!\nAfter years of bank closures, NatWest have announced the closure of Tilehurst's last bank, the NatWest branch on School Road. This is the only bank for miles in west Reading - it will leave residents and businesses in Tilehurst, Purley, and Kentwood without local banking services - they will have to go into Reading town centre. Anne Thompson, Janine Lewis, Simon Billows, and the Liberal Democrats are calling on NatWest to reverse their decision to close Tilehurst's last bank, and to retain banking services for local residents and businesses in Tilehurst now and into the future.\nThank You!\nOver 400 people have signed our petition to save the last bank in Tilehurst - thank you all so much.\nWe will shortly be presenting our petiton to NatWest and to LINK, the UK's inter-bank network, to show the strength of feeling in our community for retaining in-person banking services. The closure of the Tilehurst NatWest will mean there are no banks between Newbury town centre and Reading town centre. Councillor James Moore has already met with LINK to explore setting up a banking hub in the area, and we will keep residents updated as things progress.\nThank you for helping us demand a fair deal for our community. We will not stop fighting for you.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-lib-dems-fight-for-right-to-vote-for-all-residents/content_113.html": "Reading Lib Dems fight for right to vote for all residents\nLib Dem Group Leader Cllr James Moore called a vote to back the “Our Home Our Vote” campaign, submitting a motion that was passed by the majority of Councillors on the Tuesday 27th June 2023 meeting of Reading Borough Council.\nAround 38,000 people in Reading were not born in the UK according to the last census. However, despite their contribution to life in Reading, and unlike in Wales and Scotland, not all foreign residents have the right to vote in local elections. This is a result of England’s uneven election laws allowing only a select group of foreign nationals the right to vote.\nRecent changes made by the Conservative Government will exacerbate this issue as from next year’s local elections certain EU citizens will have their vote taken away from them. If a resident didn’t move to Britain before 1 January 2021, and is not from Ireland, Malta, Cyprus, Spain, Portugal, Luxembourg or Poland, the resident will be unable to vote.\nLiberal Democrat Group Leader Cllr James Moore’s motion would take action by:\n- Writing to the Government, asking for the vote to be given to all qualifying foreign residents - not just a select group\n- Ensuring the Council communicates with residents about the changes - ensuring everyone who still has a vote knows their rights\n- Putting a strategy in place to avoid the wrongful removal of EU residents as the council implements these changes\nReading Lib Dem Group Leader Cllr James Moore says:\n“Too many Reading residents could lose their voice in next year’s local elections if action is not taken.\n“The Liberal Democrats will continue to fight for everyone’s right to vote, while the Conservatives keep their heads in the sand. They abstained on the motion, claiming it 'went against the will of Brexit voters' which was patently untrue.\n“Without action on this matter, there will be no one left to challenge the Conservatives’ Trumpian voter policies. I'm pleased that the majority of Councillors in Reading supported our motion, sending a clear message.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_tilehursts-councillors-slam-labour-for-scrapping-free-30-mins-parking-without-a-vote/content_55.html": "Tilehurst's councillors slam Labour for scrapping free 30 mins parking without a vote\nTilehurst's councillors slam Labour for scrapping free 30 mins parking without consultation or a vote\nTilehurst's councillors have voiced their outrage after the Labour portfolio holder for transport on Reading Borough Council unilaterally scrapped the free 30 minute weekday parking window at the Dunstall Close and Recreation Road car parks - without any vote or even a consultation with councillors.\nThe decision is all the more puzzling as councillors were told in December that Council income from car parking is continuing to rise and is now almost back (p.10) to pre-Covid levels. There is no mention of increased car-parking charges in the budget documents for 2024-2025 either - the only reference to car parking is to the concession rate at the Mereoak Park & Ride Site (Appendix 9).\nCouncil officers have now confirmed in writing to the Reading Lib Dems that the decision was taken solely by Labour's transport portfolio holder - and that no Tilehurst councillors were even consulted before the change. Tilehurst's councillors have launched a petition to reverse the move.\nReacting, Tilehurst councillor Meri O'Connell, deputy leader of the Liberal Democrats on Reading Borough Council, said: \"Labour have reached a new low with this one. The free half-hour window was a hard-fought win for the Lib Dems back when I first started out on the council twelve years ago. Since then, local businesses have told us it's been a lifeline that's helped keep the village centre thriving. This latest change comes just as footfall is picking up again after the double whammy of Covid-19 and the closure of all Tilehurst’s banks and building societies. It’s a hammer blow to local businesses and our community as a whole.\n\"For this to be done without any vote or even the courtesy of discussing with local councillors, is an absolute disgrace. I assume they knew we'd oppose it, which is why they snuck it in behind closed doors. We're glad to see the free half hour is still there on weekends, but this awful decision needs to be reversed and the discussion needs to be had.\n\"Tilehurst residents deserve better than this, and frankly, we know Labour can do better. We've been fighting for a fair deal for Tilehurst for many a long year now - and we've won on this before. Labour clearly think there's a case for this change: they should have the courage of their convictions and put it to residents and councillors, rather than hiding behind bureaucracy. I hope everyone affected by this change signs our petition to overturn it.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_140-hospitality-businesses-in-reading-face-cost-of-living-cliff-edge/content_81.html": "140 hospitality businesses in Reading face cost of living cliff edge\n140 businesses in Reading are facing a huge £353,895 energy bill increase once Government support is slashed in April, new analysis from the Liberal Democrats has revealed.\nThe analysis shows that the average bill increase per business is likely to be £2,528.\nAccording to official statistics, in Reading there are 140 pubs, restaurants and cafes at risk, facing a rise in energy bills by thousands of pounds.\nThe Government initially capped the cost of business energy, but from April they are replacing that scheme and will instead just pay a small proportion of businesses' increased costs. This means many pubs, cafes and restaurants will see a 90% cut in help from the government.\nThe Liberal Democrats are calling for the government to think again. Businesses across the country are worried about the high costs they’re facing this year and Ministers need to listen to businesses about the risks they are facing before they withdraw support.\nCommenting, Councillor James Moore, Deputy Leader of the Liberal Democrats on Reading Borough Council said:\n“Countless businesses in our area are looking down a bleak path this year. Our pubs, restaurants and cafes have endured so much already, people will be devastated to see any more harm to our local high streets.\n“The Conservative Government needs to give businesses around here the support they need to endure this energy bill catastrophe.\n“Ministers must not wait a moment more. Liberal Democrats are calling for them to intervene and think again about this change - if they don’t we could see thousands of businesses, including pubs, restaurants and cafes going bust. This could rip the heart out of our communities.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_over-400000-gp-appointments-in-berkshire-west-lasted-less-than-5-minutes/content_60.html": "Over 400,000 GP appointments in Berkshire West lasted less than 5 minutes\n437,093 GP appointments in Berkshire West in the last year lasted less than five minutes, new research by the Liberal Democrats has revealed.\nThe party warned that the government’s failure to recruit more GPs has meant patients are “waiting for weeks to get an appointment only to be rushed through in a matter of minutes.”\nIn Berkshire West (an area that covers Reading, Wokingham and Newbury), 16.7% of all GP appointments between March last year and February this year were 5 minutes or less, meaning a total of 437,093.\nThe Liberal Democrats are calling on the government to recruit 8,000 more GPs and have set out plans to give patients a legal right to see a GP within 7 days.\nThe Commons Library analysis is based on NHS figures for the year between March 2022, when the data was first published, and February 2023. It provides a figure for the first time on the number of five-minute GP appointments over an entire year, broken down by local area.\nNationally, the figures show that overall, almost one in six (17.2%) GP appointments in England in the past year lasted less than five minutes. However, in some areas, the number of patients being rushed through rapid appointments was far higher.\nCommenting, Reading Liberal Democrat Councillor Meri O’Connell said:\n“Many patients in Reading need time to properly talk through their symptoms with a GP, especially when they have complex health problems.\n“But the government’s failure to recruit the extra GPs they promised has meant doctors are being forced to cram in more and more short appointments. People are being left waiting weeks to get an appointment only to be rushed through in a matter of minutes.\n“Entire communities are paying the price for years of neglect under the Conservatives, who have driven local health services into the ground.\n“Reading’s Liberal Democrats have set out a plan to boost GP numbers and guarantee people a right to an appointment within one week, so people can finally get the care and attention they deserve.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-lib-dems-announce-2024-local-election-candidates/content_56.html": "Reading Lib Dems announce 2024 Local Election candidates\nThree doctors, two young mums, and a reverend: the Liberal Democrat candidates for Reading Borough Council\nThe Reading Liberal Democrats have announced their candidates for the 2024 elections to Reading Borough Council on the 2nd of May. They will be fielding a full slate of candidates for all 16 wards of Reading Borough Council, from Abbey to Whitley.\nCommenting, Cllr. James Moore, leader of the Liberal Democrats on Reading Borough Council, and Lib Dem candidate in Tilehurst ward on May the 2nd, said: \"I'm delighted to have such a strong team of candidates joining me in the local election campaign this year. Our candidates are all passionate about our communities here in Reading and are determined to stand up for the liberal values that underpin our town.\n\"With a decade of underinvestment and mismanagement by the government, and over three decades of almost-unbroken Labour control here in Reading, it's time for a change. The Conservatives are running out of everyone's money and patience, and Labour are running out of ideas - Reading needs a fresh start.\n\"With this strong team of candidates, and a clear vision for our town to follow in our manifesto, the Liberal Democrats are determined to fight for the fair deal we all know Reading deserves. If you spend five minutes voting for a Liberal Democrat candidate on May the 2nd, they will spend the next four years fighting hard for you and your community.\"\nA full list of the Liberal Democrat candidates for Reading Borough Council, along with profile pictures and brief biographies, can be found on the Reading Lib Dems Local Election hub here.\nThe 2024 Reading Liberal Democrat local election manifesto will be announced in the coming days.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_page-3/content_7.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_lib-dems-slam-16-week-duration-of-reading-station-subway-closure/content_97.html": "Lib Dems slam 16 week duration of Reading station subway closure\nTown centre and Caversham residents left facing dirty diversion as Reading station underpass closed for 4 MONTHS.\nRecently, Labour-controlled Reading Borough Council has announced a 16-week closure of the public subway beneath Reading station to make repairs and fully finish works to remove the often-vandalised ceiling tiles. Though the improvements are long overdue, the timing and length of the closure, and lack of a suitable diversion route, make the impact on town centre and Caversham residents unacceptable.\nThe proposed works take place just before Reading Festival - any delay risks chaos for festivalgoers and an unwelcoming arrival to the town centre. The diversion route is over FOUR TIMES as long as the subway route it replaces, and takes people on a winding journey underneath the filthy, loud and cramped Vastern Road underpass, which is in desperate need of deep cleaning.\nReading Liberal Democrats are calling for:\n-\na shorter, cleaner, diversion route for all, using the Reading station overbridge\n-\na shorter period of works to reduce the risk of collision with Reading Festival.\nLiberal Democrat candidate for Abbey ward and Reading Central parliamentary candidate, Henry Wright, said:\n“There is finally light at the end of the tunnel for improvements to the Reading station underpass, however the diversion and closure show, once again, Reading Labour's disdain for walkers and cyclists, and users of the town centre.\n\"The length of this closure and the unpleasant diversion route would never be foisted upon motorists in the same way. I am demanding the council think again - reduce the length of the closure and put in place a much nicer diversion route for visitors and residents of Abbey ward alike.\"\nLiberal Democrat candidate for Thames ward, Jo Ramsay, said:\n\"It is great that work is now being planned to upgrade the tunnel, and not before time. As someone who lives on the Caversham side of Thames Ward and commutes by foot through the underpass every day, I have been shocked to see ceiling plates falling off and netting hanging down from the roof in there without urgent action to fix.\"\n\"But 16 weeks is a shockingly long period for the tunnel, which is now a main thoroughfare for pedestrians and cyclists, to be out of action. The council needs to explain what work is planned in there and work with the contractors to minimise the time the tunnel is out of action for residents north and south of the river.\"\nLiberal Democrat candidate for Emmer Green, Pieter De Boiserie, said:\n\"While I am pleased to finally see the council get to action on a crucial piece of infrastructure to aid vulnerable road users to pass safely into the town centre, it speaks again of Labour's inability to get things done. How something like this can take 16 weeks and cost up to £400,000 is incomprehensible to many residents.\n\"On top of this, the slightest delay with this project will mean it will clash with Reading Festival and cause unprecedented amounts of chaos around the station. I urge the council to review this and try to reduce the time and cost of this project as much as possible - and create a better alternative diversion route away from the dangerous Vastern Road underpass.\"",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_we-stand-with-ukraine-1/content_99.html": "We stand with Ukraine\nAs Liberal Democrats, we believe in internationalism, democracy, and the right of people to live without fear. Ukraininan President Volodymyr Zelenskyy’s party is our sister party, and we are proud to stand alongside him and promote our shared values. Our party is pushing for the fiercest possible sanctions on the Russian Government. Lib Dem leader Ed Davey, who urged BP to pull out of Russian oil company Rosneft, is calling on all other British companies to follow suit.\nOur priority is to help the Ukrainian people. The Lib Dems are asking the British Government to resettle Ukrainian refugees in the UK without preconditions. Anything less would be a failure of moral leadership and leave thousands at risk.\nReading has a proud history of standing up for victims of war and aggression overseas. We are sure that like us you are wondering how you can help. Many charities are working to provide emergency aid to Ukraine. They include:\n- The British Red Cross Ukraine Crisis Appeal\n- The British branch of the UN Refugee Agency's fund for Ukraine (part of the Disasters Emergency Committee that brings together 15 member charities)\nHere in Reading the Ukrainian Community Centre (21, Sidmouth Street) has been so overwhelmed with donations of clothes and other goods that they have temporarily paused collections. They are open on Saturday the 5th of March to receive items that well-wishers have already collected, but encourage other supporters to make financial donations to the Red Cross and other funds instead. The RUCC regularly updates their Facebook page (Reading Ukrainian Community Centre) and website.\nA well-attended vigil for peace in Ukraine was held between 18.00 and 19.00 on Friday 4th March at Queen Victoria’s statue outside the Old Town Hall in Reading, and it was heartening to be joined by so many Reading residents there. Vigils will be held at the same time and place every Friday for the foreseeable future.\nOver the coming days and weeks, the Lib Dems will do everything in their power to pressure our Government to live up to the liberal values that characterise Britain at its best.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_thames-water-slammed-as-execs-rake-in-almost-pound25-million-in-pay-perks/content_102.html": "Thames Water slammed as execs rake in almost £2.5 million in pay & perks\nLocal Liberal Democrat Councillor James Moore has slammed “eye-watering payouts” as the party reveals Thames Water paid their executives almost £2.5 million in pay and perks last year.\nNew analysis of Companies House records has revealed the country’s water industry paid out a staggering £10 million in executive salaries last year, the highest on record.\nThames Water has rewarded their 3 executives with a whopping £1.5 million in base pay, bonuses and pensions. This is despite the firm pumping raw sewage into the local area, including the River Thames.\nSince 2020, executives at the water firm have paid themselves over £8.5 million in pay and perks.\nThe local Liberal Democrats have called for a ban on all CEO bonuses within the water industry, as well as the firms to be reformed as “public benefit companies”. The reforms would put an end to companies putting profit before the environment and ensures their boards include environmental experts.\nLeader of the Liberal Democrats on Reading Borough Council, James Moore said:\n“Our local waterways are being pumped full of disgusting raw sewage, we are encountering water shortages here in Reading, all whilst the water firm hands themselves massive pay-outs. The whole thing stinks. These salaries and perks have reached eye-watering levels, yet Conservative Ministers refuse to act.\n“It is time to rip up Thames Water so it no longer puts profit before the environment. The firm is clearly not working how it should be and is not listening to local concerns on sewage discharges.\n“This country’s water industry has become a gravy train where sewage and money flows freely. This is a scandal and happening on this government’s watch.\n“When will Conservative Ministers finally get tough on these polluting and profiteering firms?\n“These bonuses and perks need to be banned as long as the sewage scandal continues. Bonuses should be a reward for success, not for committing environmental crimes.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_182-childrens-operations-in-reading-cancelled-over-the-past-five-years/content_73.html": "182 children’s operations in Reading cancelled over the past five years\nThese figures show that 74 children’s operations were cancelled in 2022, an increase of 100% compared to the year before.\nThe Liberal Democrats are urging the government to devise a rescue plan to bring health services back from the brink. This would include bringing in a proper plan to tackle workforce shortages in the NHS, investing in newer equipment and increasing bed capacity at local hospitals.\nThe figures, obtained by the Liberal Democrats through Freedom of Information requests, show that 42 children’s operations have been cancelled due to a lack of beds and 27 due to staff shortages since 2018. Another 9 were cancelled due to equipment problems, such as machines being faulty or not being available.\nThe data suggests that some children at the local NHS trust were left waiting up to 300 days for an operation.\nCommenting, Liberal Democrat Councillor for Tilehurst, Anne Thompson said:\n“Behind these shocking figures are countless children and parents in our community having to wait in pain and distress.\n\"Years of neglect by this government have led to chronic staff shortages and a lack of hospital beds, and now local families are paying the price.\n“The Liberal Democrats are calling for a rescue plan now to bring local health services back from the brink. That must include increasing bed capacity and tackling staff shortages so people aren’t left waiting so long for the care they deserve.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_page-4/content_18.html": "Lib Dems slam Reading's Labour MPs for supporting tax increase on GPs and care homes\nLabour’s 3 Reading MPs, Matt Rodda (Reading Central), Olivia Bailey (Reading West and Mid-Berks) and Yuan Yang (Woodley and Earley), have been slammed for voting down exempting health and care providers from the rise in employers’ national insurance.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_reading-lib-dems-say-rebuild-the-royal-berkshire-hospital-now/content_20.html": "Reading Lib Dems say rebuild the Royal Berkshire Hospital now!\nReading Liberal Democrats are calling on the UK Government to guarantee the rebuild of the Royal Berkshire Hospital after recent news that it was in scope for a review which could lead to delay or cancellation of the scheme.\nLib Dem Parliamentary Spokesperson for Reading Central, Henry Wright said:\n“After so vocally supporting the new hospital for Reading at the recent General Election, it is shocking to see a Labour Health Secretary put Reading’s new hospital at risk of delay, shrinkage or cancellation.\n“Our hard-working NHS staff and local residents deserve better - they need a hospital building which is fit for purpose and fit for the future, rather than quite literally cracking round the edges. Local people cannot afford any more hold-ups to the programme.\n“I am calling on our Labour MPs to keep to their election promises and save the Royal Berkshire Hospital rebuild. It must be removed from the scope of this review and allowed to continue without delay.”\nWhen the Royal Berkshire Hospital submitted its Outline Business Case in December 2020 they identified five clear reasons for rebuilding our hospital. Several of these are well known by hospital visitors - a building in poor condition, operating at capacity and hindering the delivery of modern healthcare. It was also identified that the rebuild would boost local economic growth and be much more environmentally sustainable.\nAt the recent General Election, the rebuild of our hospital enjoyed the support of candidates from all political parties, including our Liberal Democrat candidates and the eventual Labour MPs for Reading Central, Earley and Woodley and Reading West and Mid Berkshire.\nHowever, the Labour Secretary of State for Health and Social Care, Rt. Hon. Wes Streeting MP, has recently announced a review of new hospital construction, including the Royal Berkshire Hospital. This will result in recommendations which could result in change in scope, size, timing and does not even rule out cancellation.\nThe Reading Liberal Democrats urge Reading’s three Labour MPs to honour the promises they made to voters in the General Election, and fight to ensure the Royal Berkshire Hospital is rebuilt as soon as possible.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_liberal-democrats-announce-general-election-candidates-for-reading/content_110.html": "Liberal Democrats announce General Election candidates for Reading\nThe Liberal Democrats have announced their candidates for Parliamentary seats across Reading, with their candidates for Reading Central, Earley and Woodley, and Reading West and Mid-Berkshire all now in place for the next general election.\nFor Reading Central, local NHS worker Henry Wright has been selected by members in the constituency. Born in the Royal Berkshire Hospital, Henry grew up in Spencers Wood before moving back to Reading to train as a teacher, and then changing careers to work for the NHS. He stood for the Liberal Democrats in Park Ward in last year's local elections.\nFor Earley and Woodley, former Mayor of Earley Tahir Maher has been selected by local members. A trained accountant, Tahir now works in projects and transformation for Transport for London. A long-standing Earley resident, Tahir has represented Earley as a Town, and previously Borough, Councillor for many years.\nLast autumn, Liberal Democrat local members selected their candidate for the hotly-contested Reading West and Mid Berkshire constituency, as the party hopes to put another hole in the Conservatives’ Blue Wall. National campaigner Helen Belcher OBE will be fighting the two-horse race for the party. Born in Battle Hospital, Helen grew up in Burghfield Common, and has stood for the Liberal Democrats before in Berkshire and neighbouring Wiltshire.\nThe Liberal Democrats will be campaigning to be local champions for Reading and the surrounding area at Westminster, fighting to protect our vital local services and keep sewage out of our rivers.\nReading Central candidate Henry Wright said:\n“Labour in Reading have taken their eye off the ball and allowed local people’s services to crumble on their watch. People are telling me they want change, and having run the council in Reading for decades, it's clear that Labour can't bring that change.\n“It’s time for a Liberal Democrat candidate to take the stage and get our people and our services the fair deal we know they deserve.”\nEarley and Woodley candidate Tahir Maher said:\n“I am ready to work tirelessly for my community in the new Earley and Woodley seat, as I have done for the people of Earley and Wokingham Borough over the last twenty years. We need to stand up for our local services, our environment, and our democracy, and I will do just that. I am also standing to bring back a caring society and one that values all residents.\n“I want to be a hard-working and considerate MP for our area, which has been left behind for too long by the national government.”\nReading West and Mid Berkshire candidate Helen Belcher said:\n“I have been speaking to people across Reading West and Mid Berkshire since my selection in the autumn. Their anger with our government is palpable, but it's clear they don't feel Labour has the solutions either. They are crying out for change - and with Henry and Tahir in place beside me, we can give them that change right across Reading.\n“They deserve local champions who will fight for our NHS, for cleaner rivers, and for saving public services - instead of yet more Conservative chaos.”",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_page-12/content_63.html": "Thank You - Lib Dem GAIN in Tilehurst!\nThank you to the thousands of you who voted for us this year, and to all our candidates and campaigners for our best result in years!\nThank you to the thousands of you who voted for us this year, and to all our candidates and campaigners for our best result in years!\nVote Liberal Democrat in Reading today, and help us demand better for Reading!\nThe Reading Liberal Democrats are proud to introduce our team of candidates for the 2022 Reading Borough Council elections.\nReading Liberal Democrats are demanding that more is done to support children with mental health problems.\nNew figures uncovered by the Liberal Democrats have revealed 27% of 11 year old children have a reading age below 11. The research reveals almost 167,960 11 year olds across the country and 758 in Reading as being below the standard reading age.\nReading Liberal Democrats have demanded an emergency cut to VAT to protect local families from soaring bills and the Conservatives' worsening cost of living crisis.",
  "http_www_readinglibdems_org_uk_/http_www_readinglibdems_org_uk_news_article_conservatives-breaking-police-officer-promise-for-reading/content_92.html": "Conservatives breaking police officer promise for Reading\nThe Conservative Government is failing to deliver the promised 609 more police officers for Reading and the Thames Valley area.\nAnalysis of Home Office statistics by the Liberal Democrats has shown that the Thames Valley’s officer numbers fell by 29 in the last year.\nA total of 229 extra officers have been recruited by Thames Valley Police under the Government’s campaign that started in September 2019.\nThams Valley Police has so far recruited just 8 more officers per month under the scheme. To meet the Conservatives' own target of 609 by March 2023, that rate would have to increase to 25 per month over the next 15 months.\nReading’s Liberal Democrats have slammed the government for failing to keep their promise to communities, adding that there needs to be a return to full and proper community policing.\nResponding to the figures, James Moore, Liberal Democrat spokesperson for Reading, said:\n“People in Reading are being let down and taken for granted by this Conservative Government. With so many local crimes going unsolved, we desperately need more police on our streets and in our communities.\n“Liberal Democrats are calling for a return to proper community policing, where officers are visible, trusted and known personally to local people.”\n“The Conservatives’ pledge to boost police officer numbers looks set to become yet another of their broken promises. They are letting down victims of crime and our communities right across our area.”"
}