{
  "https_www_zenatode_org_uk_/https_www_zenatode_org_uk/content_1.html": "My name is Ian Gregory and this is my website. Over the years I have created accounts with a lot of websites and here is a list of my profiles. I have worked in Engineering, Physics and IT and am now a self-employed gardener. In 2005 I helped organise the G8 Bike Ride which lead to me becoming part of a collective called Bicycology and building a soundsystem called Son of Pedals. In December 2011 my mother and I became joint owners of Ware Park Wood. I live in Hatfield, Hertfordshire and I have been involved in local cycle campaigning since 2009. Currently I am:\nAn active member of WelHatCycling, leading occasional local rides\nSecretary of CycleHerts, which I helped set up in 2011\nDeputy Chair and cycling representative on the Hertfordshire Local Access Forum\nAn East Herts route maintenance volunteer with Sustrans\nA member of the Green Party since November 2014 - see note\nFeel free to send me a message using this form:\nHere are some other organisations which I support:\nICAN International Campaign to Abolish Nuclear Weapons, winner of 2017 Nobel Peace Prize\nFreedom from Torture supports survivors of torture\nExtinction Rebellion UK doing something about the ecological crisis\nRepublic campaigning in the UK for abolition of the monarchy\nHumanists UK bringing non-religious people together\nFreedom From Religion Foundation promoting non-theism, with 30k members it is the largest freethought association in North America\nNORML UK working to reform Britain's cannabis laws\nThe Free West Papua Campaign strives to end the Indonesian Occupation of West Papua\nFree Tibet campaigns for an end to the Chinese occupation of Tibet\nDignity in Dying campaigns for an assisted dying law in the UK\nThe Open Rights Group is the UK's leading voice defending freedom of expression, privacy, innovation, consumer rights and creativity on the Internet\nPalestine Solidarity Campaign is a community of people working together for peace, equality, and justice and against racism, occupation and colonisation.\nCAAT Campaign Against Arms Trade is a UK-based organisation working to end the international arms trade\nCampaign for Better Transport works towards a vision of a country where communities have affordable transport that improves quality of life and protects the environment\nAbortion Rights the UK pro-choice campaign\nMake Votes Matter is a UK movement for proportional representation\nIndex on Censorship campaigns for and defends free expression worldwide\nYes campaign for an independent Scotland\nIrish Border Poll Working towards Irish unity\nHope Not Hate Combatting the spread of hatred and division in the UK\nIPv6 hosting from Mythic Beasts - IPv6 ADSL from Andrews & Arnold",
  "https_www_zenatode_org_uk_/https_www_zenatode_org_uk_sop_index_html/content_3.html": "This page exists to provide basic design notes and documentation for a 12V bicycle-towed soundsystem that came to be known as Son of Pedals. It was designed and built by Ian Gregory for Bicycology in 2007 and was loosely based on a tried and tested system called Pedals that was put together by Curly Tony for the 2005 G8 Bike Ride. The system is mounted on the chassis of a child trailer which can easily be towed by almost any bike. Easily is perhaps not the right word when hills are involved, since the system weighs in at about 70 kg. If there is a danger of hills then it is nice to have the extra pulling power of a tandem - which has the added advantage of allowing the stoker to double up as DJ.\nSon of Pedals (like Pedals that came before) is designed to be able to play high volume bass-heavy music on the move so it is not practical to produce the required electrical power by pedalling. Human power moves the system from place to place but the music is driven by a 12V 85AH leisure battery. Of course the battery can (and has been) recharged using a pedal generator (or wind turbine or solar panel) but that is not covered here. Even deep-cycle lead acid leisure batteries survive much longer if you don't draw them down to less than about 50% capacity so that gives about half a kilowatt hour to play with. If you want to have a decent party on a single charge you might need to play for five hours, which means you only get to use an average of 100W. That might not sound much when people often talk about multi-kilowatt rigs but if you design with efficiency as a high priority it is surprising what can be achieved. Compared to running a typical home stereo off an inverter, Son of Pedals can achieve the same sort of volume using perhaps less than 2% of the battery power!\nIf you just want a PA system for making announcements then things are simple but if you want to play music that people are going to get up and dance to then you are going to need bass - lots of it. You can only do that by moving bucket loads of air back and forth and that soaks up power, so it is in the bass department that you really need to concentrate on efficiency. Son of Pedals uses a 6th order bandpass box and a Class D car subwoofer amplifier to achieve this. The bass box (or bin as it is sometimes called) was built from 18mm plywood screwed and glued together with a grab adhesive. Acoustically it consists of two ported chambers separated by a partition in which the bass driver is mounted. The driver is the 4 ohm version of the P Audio SN-15B - a 15\" 300 W PA driver with a neodymium magnet for light weight (4.23 kg).\nThe equations for designing a 6th order bandpass box are a bit hairy so a computer program called WinISD from LinearTeam was used to make things easy. The program can be downloaded for free but only runs on Microsoft Windows. Fortunately there is an online version called ISD Online. Unfortunately there is (as of 2007-10-31) an error in it. Fortunately it is easy to work around. The whole design process involves a bit of trial and error but is not too difficult if you have already chosen your driver. You need to look up and enter some of the so called Thiele-Small parameters for the driver (for the SN-15B they are Vas = 208 l, Qts = 0.16, Fs = 39 Hz). You also need to have an idea of what frequency range you are looking to cover. Son of Pedals starts kicking at about 70 Hz and the mid range driver starts taking over from the bass bin at about 200 Hz. Then it is just a question of trying out different chamber volumes and resonant frequencies and looking at the resulting response plots. What you want is a nice high level in the desired frequency range with no really sharp peaks. You also want to keep the total chamber volume reasonably small - it is no good having a great frequency response if you need a box the size of a wardrobe.\nThe error in ISD Online is that the fields where you enter the chamber resonant frequencies are labelled the wrong way round so Ff is actually the rear chamber frequency and Fr is the front chamber frequency! This was the cause of much confusion but eventually the chamber volumes and frequencies were chosen. Son of Pedals has an 80 l front chamber tuned to 70 Hz and a 40 l rear chamber tuned to 140 Hz - the response plot is shown below (yes it is a bit lumpy but that is the price to pay for high efficiency - with something like an iPod you can always selectively boost or cut frequency bands to flatten the response). Given the chamber volumes and resonant frequencies the ISD Online Vent Calculator can be used to help design the vents (ports). The rear chamber needed a very short large diameter port which could be created simply by making a 30 cm diameter circular hole in the 18 mm ply. The correct resonant frequency for the front chamber could have been achieved with a port 14 cm long and 24 cm in diameter but in fact the final design used two 14 cm long downward facing rectangular ports.\nThe bass box must be rigid to create a good sound. Basically the panel resonances should be much higher than the highest frequency the box is required to reproduce. Rapping the box with your knuckle it should sound tight, not boomy. You don't want any gaps in it either because the pressure fluctuations inside the box will force air through them and probably create a whistling sound. If the box is airtight (apart from the ports) then it will also be watertight, which means that it is a good place to keep the electronics. With Son of Pedals the amplifiers and battery are in the front chamber and there is a clever hatch on top with a lid that clamps in place but can easily be removed to lift the battery in and out for charging (being by far the heaviest single component, the battery is positioned as low as possible to lower the centre of gravity of the system). The lid actually incorporates a third 14 cm long port, much smaller in cross-sectional area than the main downward facing ones. The three ports taken together are designed to achieve the 70 Hz chamber resonance but the one in the lid is really only there to allow hot air to escape. One thing to remember when designing a box is that anything inside a chamber that takes up space needs to be accounted for when calculating the volume. It is the volume of air enclosed in each chamber that counts - and that doesn't include the volume of air in the ports.\nThe bass amplifier is a Kenwood KAC-8103D Class D unit rated at up to 1000 W. In practice it should be able to push 300 W RMS into a 4 ohm load so it is a good match to the P Audio driver. Being Class D the amplifier is very efficient, which not only means less battery drain but also less waste heat. The amplifier incorporates a low pass filter with a cut-off frequency that can be set anywhere from 50 to 200 Hz - obviously it was set to the maximum because the box is designed to go up to 200 Hz.\nOnce the bass is sorted it is relatively easy to add mid and top. Note that Son of Pedals is a mono system designed to take a mono input. Playing stereo while on the move would be kind of crazy but if you really wanted to do it then it would probably be best to build two mono systems and send one channel to each by radio.\nAlthough a lot of the power is used in generating the bass it is still important to look at efficiency in the higher frequencies and for efficiency over a wide frequency range you can't beat a horn. They are not practical for really low frequencies purely because they need to be so big but for 200 Hz up they are a good bet. Son of pedals uses an HD-5080 horn which has a sensitivity of 109 dB, can handle 50 W RMS and goes from 200 Hz up to 7 kHz. For the top end a PST-535 tweeter was chosen, giving 112 dB sensitivity, 75 W RMS power handling and a frequency range stretching from 1.5 kHz right up to 20 kHz. Both these speakers were obtained from P Audio but they had to order the horn from Italy which took several months. The tweeter in particular is very directional which can be an advantage in some situations and a problem in others. To put sound out in all directions you would need multiple tweeters. The tweeter is mounted above the horn with both attached to the removable lid of the bass box, allowing them to be quickly removed for ease of carrying and storage. Ideally the tweeter would be above head height so that people standing near the system don't block the sound, but since it weighs 2 kg it is not practical on a trailer that has to take corners.\nThe amplifier chosen for mid and top was a DLS CA22 stereo unit - one channel for mid and one for top. This allowed the use of an active crossover where the signal is split between the two speakers at line level rather than after amplification. Again this has an efficiency benefit because some power is always dissipated in a traditional passive crossover. DLS amplifiers are well respected and the CA22 will drive 2 x 60 W into 4 ohm speakers with very low distortion. There are now Class D amplifiers that work right up to 20 kHz but they don't seem to be used in car audio amps so the DLS unit is a traditional, less efficient design. Because it dissipates a fair amount of power as heat this amp has to be placed somewhere where air can easily circulate around it.\nThere are plenty of commercial active crossover units available which are highly configurable in terms of crossover frequencies, slopes, phase shifts etc. The problem is that they can be quite bulky and complex so for this project it was decided to build a custom circuit. After some research it was decided to use a 24 dB/oct Linkwitz-Riley design which is documented on the Active Filters page at Linkwitz Lab. The active components of active crossovers are op-amps, in this case LM358N dual op-amps in 8 pin DIL packages that fit in standard 8 pin sockets. A balanced power supply is required and +-5 V is sufficient for line level signals. Fortunately there are cheap 1 W DC-DC converters available that can provide a regulated +5/0/-5 V supply from a 12 V source. The circuit was assembled on strip board and starts with a buffer stage followed by a high pass filter with a crossover frequency of about 250 Hz (this is just the high pass half of a standard crossover circuit). The output from the high pass filter then feeds a crossover set at about 4 kHz. The high and low outputs are connected to trimming potentiometers to allow for balancing between the mid and top speakers (the CA22 amp has no balance control). The only external connections to the circuit board are 12 V power, mono audio input and mid and top output to a standard stereo phono lead. The actual component values chosen were C = 0.15 uF R = 3 kohm to give 250 Hz and C = 0.022 uF R = 1.3 kohm to give 3932 Hz.\nThere were lots of little details to work out but the basic wiring was fairly simple. Lengths of red and black jumper cables were used to take power through a large fuse from the battery and distribute it to the two amps. The main fuse is not shown in the photo - it should be as close to the battery as possible. The battery leads are just long enough to drop out through a port and connect up to an external battery if required. Power is also supplied to a two slot blade fuse holder. One of these fuses goes to a cigarette lighter socket (to power accessories) and the other goes to an on/off switch that supplies power to the crossover, a volt meter, and the control connections on the amps which turn them on. The volt meter is used to keep track of battery condition and is operated by a push-to-test button (with a capacitor across it to suppress the tiny spark which would otherwise occur when it is released). A vent pipe on the battery drops out through one of the downward facing ports in an effort to eliminate corrosive acid mist from the box. The speakers are wired up with nice fat speaker cable. There is a Speakon four pole socket on the underside of the lid which goes to the mid and top speakers. The matching Speakon plug on the cables from the stereo amp can be quickly and easily unplugged to separate the top unit from the bass box.\nThat is about it really. A mini jack to mono phono cable was built to do passive mono using a couple of resistors and a potentiometer for volume control. This provides a simple way to connect an mp3 player or whatever to the system. For more complex setups a 12 V mixer can be used to mix multiple devices and microphones down to mono. All that remained was to set the input sensitivities on the two amps to get a sensible sound level and the right amount of bass. At this point the mid/top balance has not been adjusted - it sounds about right but a little bit of tweaking is in order.\nSon of Pedals made its debut at June 2007 Critical Mass in London, even though it was not quite finished. It then had a busy summer including the Bicycology tour, the Big Green Gathering, the Camp for Climate Action and the Disarm DSEi protests. It returned to base in October for repair and refurbishment and will be out and about again very soon in its new green livery.",
  "https_www_zenatode_org_uk_/https_www_zenatode_org_uk_myprofiles_html/content_2.html": "My profiles on various web services that I use\nianji.wordpress.com\npinboard.in/u:ianji\nwe.riseup.net/ianji\nwww.facebook.com.ianji33\nwww.youtube.com/ianji\nwww.ted.com/profiles/view/id/177258\nwww.linkedin.com/in/ianji\nmyworld.ebay.co.uk/recycle2012\ntwitter.com/ianji\nvimeo.com/ianji\nwww.setlist.fm/user/ianji\ndiscussions.apple.com/profile.jspa?userID=794313\nwww.bbc.co.uk/blogs/profile.shtml?userid=721753\nwww.guardian.co.uk/discussion/user/ianji\nwww.dmoz.org/public/profile?editor=ianji\nen.wiki.aktivix.org/User:Ianji\nwww.archive.org/bookmarks/ianji\nen.wikipedia.org/wiki/User:Ianji\nwww.amazon.co.uk/gp/pdp/profile/A3O9D2QWV4GV9Q\nwww.pandora.com/people/ianji\nsoundcloud.com/ianji\ncosmoquest.org/forum/member.php/5093-ianji\nwww.change.org/members/ianji\ngravatar.com/ianji\ndisqus.com/ianji\nwww.blogger.com/profile/06698048980105291999\nwww.ctc.org.uk/ianjiuk-user-profile-20121225\nbandcamp.com/ianji",
  "https_www_zenatode_org_uk_/https_www_zenatode_org_uk_bicycology_html/content_6.html": "In June 2005 a group of approximately seventy cyclists, myself included, set off from London to ride to the G8 Summit in Scotland. To the outside observer this G8 Bike Ride may not have achieved any obvious political goals but it was certainly an important and empowering event in the lives of those who took part. Consequently, in November 2005 a number of participants gathered in Nottingham and formed an organisation called Bicycology to keep the dream alive.\nIn 2006 Bicycology organised a tour from London to Lancaster and on to the first Camp for Climate Action in Megawatt Valley near Leeds. Like the G8 Bike Ride this tour was leaderless, organised on anarchist principles, and used no motorised support vehicles. In 2007 there was another tour from Aylesbury to Exeter (two of the six so-called Cycling Demonstration Towns) and then in 2008 Bicycology organised a week-long festival of cycling and sustainability in Lancaster and Morcambe.\nFor the next few years Bicycology carried on as a fairly active organisation, getting involved in a number of social and environmental campaigns and having a presence at various festivals and green fairs. In the end though, with members spread around the country and getting more involved in their own projects, local campaigns, etc it seemed like Bicycology was drifting apart. There was an attempt to pull things back together in 2012 with a mini-tour of the Midlands around the slogan \"Parking the Car ... For Good!\" but I didn't take part and although it apparently went quite well it turned out to be Bicycology's swan song.\nI managed a lot of Bicycology's online presence and the task of gracefully shutting things down seems to have fallen on me. I will be keeping the bicycology.org.uk domain registered for the forseeable future and have basically archived the website under my own personal hosting account. I will also keep the blog alive for now but other things like our organising wiki and announcement list will be shut down in due course. The following links may be of interest.",
  "https_www_zenatode_org_uk_/https_www_zenatode_org_uk_ian_navigation_xhtml/content_5.html": "I stopped updating these pages on 2010-02-15 but they remain as an archive. Organised into 34 topics, the 193 pages consist of a total of 4084 dated entries from 1999-06-29 to 2010-02-02 and include links to 5463 unique external URLs (many of which may well be broken). Feel free to browse, but if you are interested in what I am doing now then you should check my homepage.\nwww.zenatode.org.uk Ian Gregory 2010",
  "https_www_zenatode_org_uk_/https_www_zenatode_org_uk_key-revocation-2021_asc/content_4.html": null
}