{
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_winter-fuel-allowance-cuts/content_62.html": "My Letter to the Chancellor of the Exchequer regarding Labour's winter fuel allowance cut.\nI write to you regarding the Government’s decision to means-test the Winter Fuel Allowance – effectively taking it away from millions of pensioners and plunging them into fuel poverty\nIn Wokingham Borough a high proportion of residents are retired. In Wokingham Borough scrapping winter fuel allowance will affect 29,194 pensioners, of which only 1,417 are in receipt of pension credit.\nI am concerned that as a result of the Government’s changes to the Winter Fuel Allowance poorer pensioners will struggle to heat their homes this year and beyond.\nResidents in my ward have contacted me saying that they will have to choose between heating and eating.\nAs I am sure you will be aware Age UK have expressed their concern, saying, “it is the wrong policy choice” and “will potentially jeopardise the health as well as the finances of millions of older people this winter.”\nThere are a number of problems with this policy which was not in Labour’s manifesto before the election.\nThe first is that for older people it is a medical necessity.\nThe NHS recommends that people over 65 should heat their homes to 18 degrees because they are more vulnerable to cold weather. Aging weakens the immune system making older people more susceptible to respiratory infections. Taking away the Winter Fuel Allowance for so many older people is not just harsh and unfair, it is also dangerous.\nWe would like to know what assessment was done of the impact withdrawing the Winter Fuel Allowance will have on the NHS.\nSecondly, it has been estimated that there are up to a million pensioners who are eligible for pension credit but have not claimed for it. These older people are not online and some will be suffering from age-related conditions that would make it difficult to apply, such as sight loss or dementia. While there has been a reported increase in applications for pensions credit it is likely that some extremely vulnerable eligible pensioners will still miss out. As such, pension credit is simply not a reliable measure of how well-off an older person is.\nThirdly, the threshold to qualify is extremely low. Pension credit is only available to pensioners with a weekly income to £218.15 or a joint weekly income to £332.95 for a couple.\nThis is a very low income for anyone to manage on and by comparison is around half the full-time annual salary of someone on the minimum wage.\nWhy, if Winter Fuel Allowance is to be means tested, is there no taper as there is with other benefits such as Child Benefit?\nLastly, this Government seemingly always wants to pursue universalising benefits – for example, introducing free breakfasts for all primary school children irrespective of household income. But when it comes to pensioners, the Government’s objective is to penalise one age group by restricting a benefit to a tiny proportion of those who were previously eligible. It seems to me, and to many residents I speak to, that this policy is discriminatory.\nThat being the case, what equality and other impact assessments were carried out, and what were the conclusions?\nThis policy is ill thought out and will risk the health of many vulnerable older people. At the same time, you have spent £10 billion on inflation-busting pay increases for some public sector workers such as train drivers.\nI would strongly urge you to rethink this decision before the consequences are disastrous for pensioners but also for the NHS.\nYours sincerely,\nCllr Pauline Jorgensen\nMember for Hillside, WBC",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_category_Opinions/content_20.html": "Cllr Pauline Jorgensen: Keep democracy local 21st April 2025 Despite the challenges facing households across the country, particularly thanks to Labour’s disastrous budget, you might think the Government would drop plans... Opinions\nLabour fails to deliver on their promises 7th April 2025 The UK has now had a Labour Government for 9 months. In that short time, things have got significantly worse for people, including those of us living in... Opinions\nEducation, Education, Education 23rd March 2025 While many people may not have a direction connection to schools, we all have some kind of interest in education. It should be a source of concern for all of us... Opinions\nPauline comments on the Hall Farm Development scoping study 6th January 2025 My comment on the scoping study for Hall farm (following on from my video before xmas on the local plan impact) I am very concerned about the viability and... Opinions\nLib Dem Parking Chaos on the Horizon 14th November 2024 The LibDems plan to introduce car parking charges at School Green, Shinfield. The plan was revealed at a recent Council Meeting following a question from the... Opinions\nWinter Fuel allowance cuts 30th October 2024 My Letter to the Chancellor of the Exchequer regarding Labour's winter fuel allowance cut. I write to you regarding the Government’s decision to means-test the... Opinions\nFrom the Wokingham Paper - Cllr Pauline Jorgensen: Conservatives will act where Lib Dems fail 23rd October 2024 In the last few weeks there has been much about the new Labour Government’s first hundred days in office. Having been elected in July, despite their promises of... Opinions\nCllr Pauline Jorgensen: Labour Government not a good start 15th August 2024 Now Parliament is in recess over the Summer, it’s a good time to step back and review how the first few months of a Labour Government has impacted on our... Opinions\nTime to take action on housing 23rd April 2024 The Liberal Democrats’ record in Wokingham Borough on housing is one of over-promising and a total failure to deliver. If we’re elected to run the Council on... Opinions",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_ps2-bus-fare-cap-extended/content_28.html": "I am pleased with the Conservative Government’s decision to extend the £2 bus fare cap, bringing cheaper journeys to people across the Earley and Woodley constituency\nThe bus fare cap had been due to rise to £2.50 but thanks to the Conservative Government’s decision to reinvest HS2 funding in ‘Network North’, it will remain at £2 across most of England until the end of December 2024.\nThis extension is only possible due to £36 billion of funding being redirected from HS2, funding the ‘Network North’ plan.\nThis plan takes the total government investment to keep bus fares down to nearly £600 million – with over 140 operators signing up to continue offering the cap across more than 5,000 routes.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_calling-yuan-yang-stand-our-countryside/content_72.html": "I have called on Yuan Yang to distance herself from Labour Party policy on housing and law and order, following Sir Keir Starmer and Rachel Reeves’s pledge to mandate housing development to local authorities, and release prisoners early.\nOnly days after the election, Keir Starmer and the Labour Party are committing to mandating housing development on local authorities, including on green belt areas.\nI’ve lived in Earley and Woodley for 40 years, and represented the constituents on Wokingham Borough Council for 16, and know the strength of feeling the people of this area have on unsustainable development. I am calling on Yuan Yang to state whether she supports the Labour Party’s policies around mandated housing development in this constituency.\nLabour and the Liberal Democrats have done nothing to halt the development during their coalition of convenience in Wokingham Borough Council.\nI trust that Yuan Yang can do the right thing and stand up for the people of Earley and Woodley and tell her leader what the people of this constituency feel about unsustainable development and the need to protect our countryside.\nIt is also vital that Yang stands up to the Labour Government - and pledges not to support the dilution of law and order in this constituency. We have huge problems with anti-social behaviour in the area - an issue I pledged to combat were I elected to Parliament. Now that Yuan Yang has taken her place in Parliament, I trust that she will stand up against her Government’s plans to release convicted criminals back onto our streets.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_cllr-pauline-jorgensen-keep-democracy-local/content_8.html": "Despite the challenges facing households across the country, particularly thanks to Labour’s disastrous budget, you might think the Government would drop plans to scrap local councils in favour of massive remote ones. Unfortunately, they are ploughing on, and ultimately, it’s us who’ll lose out.\nWhat is being proposed by Angela Rayner is a top-down reorganisation of local government forced on communities. This could see Wokingham Borough disappear into a monster council covering a vast area, with the wishes of our small towns and villages, like Earley, Woodley or Twyford, ignored in favour of larger, urban areas, and Council Tax paid by our residents potentially spent on services in areas such as Reading and Slough and other big towns.\nThe Labour Government and its supporters, including in our area, have tried to promote supposed ‘benefits’ of their plan to swallow up Wokingham Borough, which they try to convince us is devolution. They simply aren’t credible.\nJim McMahon, the Minister of State responsible for Local Government, has said it will put “power into the hands of local people that know their areas best”. This is laughable.\nWokingham Borough was created with a desire to remove the inefficiencies of duplication from district and county councils, and ensure decisions were made as close as possible to local people. The kind of council the Government wants to create could see people’s local areas run from Council offices significant distances away. Councillors and officers would make decisions about areas they’ve never been to, of which they know nothing.\nThis also has a serious effect on participation in democracy. Residents who want to visit Council offices to raise an issue or attend a meeting would face journeys of an hour or more, especially if they depend on public transport.\nWhile residents could at least watch a meeting online, you need to attend a meeting in person as an elected councillor. Working people could be put off standing for election, knowing they can’t fit travelling such long distances around their job.\nThe Government ministers who have dreamed up these ideas simply don’t understand the geographical scale needed to meet the population requirements they’ve plucked out of thin air. Hardly surprising given, like Angela Rayner, they tend to represent Labour-run city areas with population densities many times that of Wokingham.\nSupporters of the Government’s plans also say it will reduce costs and processes. Part of Labour’s plans could see the creation of a new Mayor, adding a whole new level of bureaucracy. Nor can we expect savings from economy of scale – the needs for social services, for example, will not change just because there is a bigger council. We cannot even expect savings from reducing the number of councillors. When Buckinghamshire scrapped all its local councils in favour of one big council, it ended up with 147 councillors, almost three times the number in Wokingham Borough.\nSome people may not remember, but we’ve seen this all before. Berkshire County Council was remote and fixated on larger towns, rather than areas like towns and villages in our area. BCC was scrapped in 1998, with more powers given to smaller councils like Wokingham Borough.\nLocal Conservatives are strongly opposed to Labour’s plans. We want to keep democracy local. At a Council meeting in January, my proposal to ensure Wokingham Borough would oppose any unfavourable top-down reorganisation was backed by the Council’s Liberal Democrat administration. We will continue fighting against any Labour schemes that would see your local voice lost.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_cdn-cgi_l_email-protection/content_23.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_week-earley-and-woodley/content_52.html": "Back into the council work:\n🌧️ Flooding – Raised residents' concerns about local flooding,\npushing for better drainage and quicker responses.\n📋 Planning – Chased up several planning issues in my ward, making sure residents’ views are heard.\n📜 Constitution – Reviewed the new constitution and challenged proposals to remove safeguards on councillors questioning officers at full council. Transparency and accuracy matter – this is our only tool to ensure executive answers in meetings are correct, and I suspect that may be why the ruling group would like to remove it.\n🚲 Road Safety – Queried the design of the High Tree Drive exit onto Church Road after an accident involving a cyclist and a car.\n🚗 Parking – Continued to chase incidents of dangerous parking in Marefield – safety must come first.\n🔒 Parks & Open Spaces – Escalated issues with contractors failing to lock gates after grass cutting – basic security.\n🏫 Education – Escalated the sudden announcement of almost immediate closure of Maiden Erlegh Playschool. I’ve now been told by officers that it will remain open until the end of the summer term.\n🌳 Green Spaces – Backed local efforts to protect green spaces – no to overdevelopment, yes to sustainable growth.\n🧾 Casework – Continued helping residents with housing, planning, and local issues.\nI’m here to be your voice and stand up for common sense, value for money, and a better deal for our community.\n📅 What’s coming up?\nSitting on the panel to interview candidates for the next Director of Public Health – always interesting to meet a range of candidates and think about how we’ll work with the selected person.\nAttending committee meetings to scrutinise council spending.\nMeeting with Matt Barber, Police and Crime Commissioner, to raise local concerns and priorities.\nRegular meeting with WBC Chief Executive to raise strategic and local issues directly.\nExtraordinary meeting to review the new contract for waste collection and street cleaning.\nFollowing up on unresolved casework and flooding hotspots.\nContinuing to challenge any attempts to limit councillor accountability powers.\nContinuing to oppose development plans for Hall Farm in Shinfield – especially the impact on traffic and our countryside.\nDrop me a message if you need help with anything or want to raise a local concern.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_pauline-jorgensen-discussing-progress-asb-and-shoplifting-thames-valley-police-and-crime/content_32.html": "Shopkeepers and residents told me they are concerned about ASB and shoplifting. Pauline took Matt Barber too Woodley Precinct and asked him how his Crimefighters strategy was going and what difference it would make to residents across the constituency. He told me that shoplifting arrests have almost doubled since the strategy had been launched, working very closely with shops. He has also provided funds from proceeds of crime to help pay for new CCTV in the precinct.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_wokingham-paper-cllr-pauline-jorgensen-conservatives-will-act-where-lib-dems-fail/content_41.html": "In the last few weeks there has been much about the new Labour Government’s first hundred days in office. Having been elected in July, despite their promises of change, not much has happened – and what has been delivered has not been good.\nSo far, their main achievements seem to be scrapping the winter fuel allowance and doubling the number of homes that will need to be built in Wokingham Borough.\nNationally, there is a need for new housing, something all the major political parties agreed on at the General Election. However, our Borough has built its fair share of houses over years, and while ours is doubling, strangely Labour have decided London should build fewer.\nLabour have said that they want to see house prices become more affordable. Clearly by that logic, London, the most expensive place in the country to buy a house, should be building more. Yet, at the same time rents are going up as landlords exit the private rental market put off by the threat of tax rises ahead of the budget and a promised increase in red tape.\nUnder the Liberal Democrats the Council’s housing companies, created by the previous Conservative administration to provide much needed council housing, have been allowed to drift, not delivering their full potential.\nSo far building more homes has not prevented house prices from continuing to rise in Wokingham Borough and across the country, even during the recent period of high interest rates.\nWhen the Conservatives ran the Council, we worked with the then-Conservative Government to introduce a more sensible and sustainable target for new homes for the Borough.\nThat’s why at Full Council this week my Conservative colleague Cllr Charles Margetts has put forward a motion calling on the Council to launch a campaign to reduce housing numbers. We also want to see the Council to write to the Government setting out the case for why Wokingham Borough’s housing target should be lower.\nWhat must be baffling for residents is that the Council’s Liberal Democrat administration isn’t doing these things already. Time and again, it’s been left to the Conservative Opposition to press for action when none is forthcoming from the party in power.\nIt’s not just in the area of housing development where we’re seeing a lack of urgency on the part of the Liberal Democrats. At this week’s Council meeting, I have a motion calling on the administration to raise awareness locally on financial support available to pensioners impacted by scrapping the winter fuel payments for most older people. I’m also asking the Council Leader to write to the Chancellor ahead of the Budget, urging her review the decision on these payments, which will affect 28,075 in Wokingham Borough.\nThe Liberal Democrats running the Council should be offering leadership. Instead, all we get is dither.\nWhere the Liberal Democrats choose not to act, your local Conservatives will. These housing numbers will affect the future of our Borough. The Liberal Democrats need to act now and they need to do more than respond to statuary consultations.\nWhen it comes to winter fuel payments, we will continue pressing local MPs, including the Labour MP for Woodley and Earley, to go back to the Government and tell them to think again.\nSomeone needs to stand up for Wokingham Borough, and your local Conservatives will do just that.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_pauline-reports-update-ecmwf-relocation-university-readings-whiteknights-campus/content_18.html": "I have just received the following update which will be of interest to local residents. Construction is set to begin in February 2025 on the new European Centre for Medium-Range Weather Forecasts (ECMWF) facility at the University of Reading’s Earley Gate site. This follows a lease agreement signed between the University and the Government Property Agency (GPA) in December.\nKey points:\n- The site preparation, including demolishing the former School of Art building, is complete.\n- Mace is the appointed construction company, with the building targeted for completion by December 2026 and ECMWF staff moving in 2027.\n- Traffic management plans aim to minimise disruption, limited to the Earley Gate campus entrance.\nThis state-of-the-art facility will strengthen research collaboration, support economic growth, and provide cutting-edge forecasting capabilities.\nFor further details, you can refer to the University of Reading news page. https://www.reading.ac.uk/news/2025/University-News/Weather-centre-cons…",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_feed/content_74.html": null,
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_another-liberal-and-labour-mess-horizon/content_49.html": "A busy full council meeting yesterday, on the agenda was the delegaton of the tender of waste collection, street cleaning and litter bin emptying to the executive member and a senior officer. This is one of the largest and most important of the Boroughs contracts and we must get it right.\nI have become increasingly concerned with this tender and whether it is ready to commence. Originally the proposal was meant to go to scrutiny before it went to full council but this visit was scrapped because of the general election. Instead of bringing it to scrutiny now the ruling group decided to plough on with the project. We had an officers briefing at Conservative group about the plans on Monday and it transpired that the Council still hadnt ensured the list of roads to be cleaned and litter bins to be emptied as part of the project was accurate. This incidentally may explain the unemptied bins and weeds in gutters we see around the Borough.\nNow the first rule of contracting in my experience is to know the scope of what you are tendering, but no, the Lib Dem group, supported by Labour as usual, think that they know better and insisted on rushing on ignoring my proposal to take the plan to scrutiny so that we could actually be sure of what was being bid for. Given the new contract isn't required until 2026 I am at a loss to understand the rush - unless its driven by a desire to get the service levels and scope out of the public eye.\nHere is my speech setting out our objection:\nGiven our experience to date with issues with unemptied litter bins and weed-infested roads throughout the Borough, not to mention last year's litter bin debacle where bins were slated for removal with no consultation and subsequently left unemptied as the process descended into chaos we cannot support this proposal.\nThis project has not been to scrutiny as was originally proposed because of the general election and I feel it is premature to delegate authority to the exec member and officers and sally forth without such a review.\nThe council has previously admitted that the lists of bins and streets they have are not complete and had promised to do a survey and ensure that they were accurate before the tender progressed. This seems not to have happened and we were sent lists yesterday of known bins and streets to verify before the end of August.\nIncredibly, the Council do not yet know where their litter bins are and they also do not seem to have a full list of streets despite being responsible for maintenance.\nBecause of these omissions, I believe it is very risky to charge off down the procurement path without having a complete view of the scope of the service being tendered, I would request that the tender be delayed long enough to be reviewed at scrutiny and for a proper audit of bins and streets to be completed as was promised.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_cookies/content_4.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_week-earley-and-woodley-and-wokingham-borough-cllr-pauline-jorgensens-update/content_2.html": "Holding the Lib Dems Accountable – Delivered a strong speech exposing their financial mismanagement, wasteful spending, and failure to deliver key projects.\nFighting for Residents – Highlighted the disastrous £5.5 million California Crossroads project, dangerous road designs, and broken promises on housing and infrastructure.\nProtecting Your Money – Challenged the council’s use of reserves and the alarming and unforecast DSG deficit, rising fees, and lack of financial planning. A Conservative administration would restore responsibility!\nEnsuring Oversight on Major Spending – Met with the Lib Dem deputy leader and Labour leader to secure agreement that contracts over £5 million will still require full council approval.\nPushing for Safer Roads – Pressing the council to confirm the installation date for the long-awaited Shinfield Road pedestrian crossing.\nImproving Council Services – Met with Wokingham Borough’s Operations Director to progress a project aimed at improving the Council’s responsiveness and service delivery for residents.\nEnsuring Fair & Transparent Funding – Fed back on the review I commissioned through scrutiny to examine funding and resource allocation to voluntary services, ensuring alignment with Council priorities, fairness, appropriateness, and transparency.\nDefending Local Education – Arranged to meet the Headmistress of Trinity School, which is threatened with closure due to Labour’s VAT on school fees. The policy risks harming educational choice and putting pressure on local state schools.\nListening to YOU – Engaging with residents, addressing concerns about local developments, and standing up for better services.\nWokingham deserves better. It’s time for real leadership. Support the Conservatives for a stronger, more accountable council.\n#Wokingham #LocalPolitics #Accountability #Conservatives #Leadership #SaferRoads #BetterServices #FairFunding #EducationMatters",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_issues-oakbank-school-escalated/content_75.html": "This afternoon I went to Oakbank school to listen to residents and try and see what I could do to help. I heard about classes with 70 pupils; poor teaching and supply teachers who did not last for more than one lesson. I also heard some good things; the school has a great community; people like being at a local school; children pull together and they want to stay in the school if the education improves. The view was it has nose dived in quality in the last year and a half.\nThe first immediate issue is stabilising the education provided and ensuring the pupils have consistent teachers and the curriculum is covered. This is particularly urgent for Year 11 pupils as they approach their GCSEs.\nFollowing talking to parents I briefed the CEO of Wokingham Borough on what I had heard and talked to her of the urgency of doing something for year 11s in particular.\nI also told her that there was concern over the school buildings and that people were asking where developer's contributions had been spent.\nFinally I mentioned the need to ensure the new trust taking on the school is a good fit.\nThe council CEO understood the issue and the urgency for year 11s in particular and promised to investigate what could be done. She has agreed to ask the Director in charge of Education to brief me on the actions they will take asap.\nTalking to parents and pupils and feeding the comments back was very useful. Hopefully we will see some rapid action!",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_campaigns/content_25.html": "Support a new Royal Berkshire Hospital after Labour delay project for over a decade We want your opinion. Please contribute to our resident survey and tell us what you think.\nStop the LibDems introducing car parking charges at School Green, Shinfield We want your opinion. Please contribute to our survey on the LibDem plans to introduce car parking charges at School Green. And tell us what you think.\nStop the Lib Dem plan for 3,900+ new houses at Hall Farm. We want your opinion. Please contribute to our resident survey and tell us what you think.\nScrap the parking charge increases Please hop across to Earley and Woodley Conservatives and sign our petition https://www.earleyandwoodleyconservatives.org.uk/campaigns/scrap-parkin…...\nSave Wokingham Borough litterbins Black bags have appeared covering litter bins across the Borough. More than a hundred bins are slated for removal and the Lib Dem Executive member has announced...",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_events/content_9.html": "Skip to main content\nMain navigation\nHome\nAbout Pauline Jorgensen\nNews\nOur Plan\nCampaigns\nContact\nBold Voices, Real Talk: Conservatives Unfiltered\nLabour's Broken Promises\nFuture Events\nSorry, we haven't got any upcoming events.\nPlease check back soon to see future events.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_leading-fight-against-shoplifters/content_42.html": "Following my conversation with the Thames Valley Chief Constable and Matthew Barber the Police and Crime Commissioner I am pleased to report that Matthew unveiled a new approach to tackling retail crime this week.\nDeveloped jointly with retailers, business groups and Thames Valley Police, the PCC’s Retail Crime Strategy sets out tangible actions to tackle shoplifting, retail crime and violence towards shop workers.\nThe strategy aims to support businesses and create a hostile environment for those who commit crimes in the local economy by focusing on 6 key pillars – Intelligence, Enforcement, Partnership, Prevention, Justice and Reassurance.\nMatthew said \"Many people see retail crime as a victimless crime, but it has a profound impact on retail staff, customers and the wider economy.\n“My new Retail Crime Strategy sets out a series of tangible actions to help redress the balance. It includes the creation of a Business Crime Team within Thames Valley Police to improve investigations and identify prolific offenders and, with the rollout of Operation Purchase, the Force’s operational response to retail crime, increasing the visible presence of police officers and PCSOs in retail spaces as well as improving the officer response to reports, particularly incidents involving violence towards staff.\n“A core aim of the strategy is to enhance the collaboration between businesses and the police to better tackle retail crime in addition to the policing response. To help facilitate this my office will soon be providing access to Disc – an online information-sharing and reporting platform which allows retailers to report and access information about crime such as shoplifting and anti-social behaviour (ASB). The system, which can be accessed as an app, also makes reporting to the police faster and more efficient as users can submit a crime report directly through the platform, removing the need to call 101.\n“Taken together, I hope these measures will deliver a more visible, targeted and robust response to retail crime, increase the security and confidence of local businesses and help make high streets and retail spaces across the Thames Valley safer for us all.”\nMatthew has been engaging with local, regional and national retailers and business groups for several months to better understand the challenges they face in relation to retail crime and today also marks the creation of the Thames Valley Strategic Retail Crime Forum which will build upon that engagement and strengthen the partnership between the police and businesses in tackling retail crime.\nChristian Bunt, Assistant Chief Constable for Thames Valley Police, said: “Thames Valley Police is supporting the launch of the Retail Crime Strategy alongside the Police and Crime Commissioner, Matthew Barber. Over the last few months TVP has developed operational plans which will be led by our neighbourhood policing teams and our new Business Crime Team who will specialise in retail crime investigations.\n“We understand the frustrations of the retail sector and hope that by introducing this new strategy, we can continue to work collaboratively with our partners and wider criminal justice system to bring offenders to justice.”\nJames Lowman, Chief Executive of the Association of Convenience Stores (ACS), said: “We are delighted to see the Police & Crime Commissioner prioritising retail crime and making it clear that shop theft and violence against shop workers will not be tolerated.\n“Partnership working and information sharing are the keys to making this strategy work, and we want all retailers to engage with the police, report all crime and work together to identify and apprehend the prolific repeat offenders who blight communities.”\nNicki Juniper, Head of Security and Shrinkage at John Lewis Partnership, said: “We’re really pleased to see this important progress. Retail crime is not victimless, it has an emotional and financial impact on retail workers and customers. Whilst there is no single solution for tackling retail crime, we look forward to working collaboratively with Thames Valley Police, and others in the sector, to keep our Partners and customers safe.”\nJason Towse, Managing Director, Business services at the UK’s largest security provider, Mitie, added: “Partnerships between the police, the public and private sector enable us to combine valuable industry knowledge, establish a standard of best practice and rapidly tackle retail crime at its source, so the new Retail Crime Strategy is a welcome initiative.\n“We’re proud to be amongst the partners of the initiative and will work closely with Thames Valley police, retailers and business groups to achieve our shared goal of combatting retail crime and creating a safer community.”\nToday’s launch took place at Three HQ in Reading.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_cllr-pauline-jorgensen-labour-government-not-good-start/content_73.html": "Now Parliament is in recess over the Summer, it’s a good time to step back and review how the first few months of a Labour Government has impacted on our communities and local government.\nThe announcements that have come from the Government so far have been disappointing. Programmes for local investment are being scrapped, money is being taken away from pensioners, and communities are not being considered as Labour reverts back to its worn-out tradition of top-down targets imposed from Westminster.\nThe Chancellor of the Exchequer, Rachel Reeves, has announced that the hospital building programme put in place by the previous government is being put under review, and that includes plans for a new Royal Berkshire Hospital. This has effectively killed off Government funding for a new local hospital, despite a clear need and money already spent on planning and consultation by the Foundation Trust. And it completely contradicts the promises made by local Labour MPs that their party would deliver a new hospital.\nAt the same time, Labour have said that they will take away payments to help 10 million pensioners heat their homes in the Winter. The End Fuel Poverty Coalition has warned that this will disproportionately affect older people living in rural areas like those in Wokingham Borough, and has branded the move “particularly cruel”.\nLabour’s claim that they need to do this because they’ve discovered a fictitious black hole in the public finances has already been rubbished by the Institute for Fiscal Studies. All the while, we’ve watched as Conservative plans to reduce the numbers of civil servants which had increased to deal with the pandemic have been scrapped.\nHaving warned that a Labour Government would mean more houses being built across Wokingham Borough, it is again no surprise that they are going ahead with plans to build more and shake up the planning system including allowing building on the Green Belt.\nWhat might be a surprise is that, while leafy areas like Wokingham are going to see centrally imposed targets skyrocket over the next five years, London and other major cities are seeing theirs reduced.\nUnder the Labour Government London will be expected to build 80,000 homes per year, down from a target of 100,000 under the previous Government.\nAs a result, many London MPs such as Keir Starmer, David Lammy and Wes Streeting – coincidentally the Prime Minister, Foreign Secretary and Health Secretary – are seeing targets in their area reduced. But it’s not just in London. Labour’s new Secretary of State for Work and Pensions, Liz Kendall, is also seeing housing targets in her Leicester constituency reduced.\nResponding to criticism of the new targets Deputy Prime Minister Angela Rayner said “some areas might appear to get a surprising target - well, no method is perfect…”\nResidents are not asking for a perfection. They are asking for a system that makes sense. What Labour has delivered instead fails to produce higher targets where the need for new housing is highest, and proposes to take away local decision-making.\nThe Liberal Democrat administration running Wokingham Borough Council have completely abandoned the field. Despite previously promising lower housing numbers and a change to where new houses will go, they’ve instead rolled over and are meekly stating they will go ahead with the old draft Local Plan – having wasted two years on hand-wringing. We also fear that they will not take the opportunity to change the plan based on feedback obtained in the period up to them gaining control of the Council on the promise of saving the Borough from unsustainable development. Meanwhile, we hear nothing from the Liberal Democrats on what they’re doing to get funding back for a new hospital, or how they intend to support struggling pensioners once the weather turns cold.\nAs for local Labour MPs and councillors, you can expect nothing, as they throw their full support behind the Government, all while blaming someone else.\nYour local Conservatives, however, will continue fighting for our area. We’ll continue making the case for a sensible number of new homes in the right places, and we will bring whatever pressure we can to overturn these poor decisions on a hospital and payments for pensioners. I urge other local parties to put Wokingham Borough first, and join us in our fight.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news/content_27.html": "This week in Earley and Woodley Monday, 21 April, 2025 Back into the council work: 🌧️ Flooding – Raised residents' concerns about local flooding, pushing for better drainage and quicker responses. 📋 Planning – Chased up several planning issues in my ward, making sure residents’ views are heard. 📜 Constitution – Reviewed the new constitution and challenged proposals to remove safeguards on councillors questioning officers at full council. Transparency... Reports\nCllr Pauline Jorgensen: Keep democracy local 21st April 2025 Despite the challenges facing households across the country, particularly thanks to Labour’s disastrous budget, you might think the Government would drop plans... Opinions\nLabour fails to deliver on their promises 7th April 2025 The UK has now had a Labour Government for 9 months. In that short time, things have got significantly worse for people, including those of us living in... Opinions\nEducation, Education, Education 23rd March 2025 While many people may not have a direction connection to schools, we all have some kind of interest in education. It should be a source of concern for all of us... Opinions\n📰 This Week in Earley and Woodley and Wokingham Borough – Cllr Pauline Jorgensen’s Update 🏡📢 1st March 2025 Holding the Lib Dems Accountable – Delivered a strong speech exposing their financial mismanagement, wasteful spending, and failure to deliver key projects... Local News\nBREAKING: Inflation Rises to 3% Under Labour! 19th February 2025 Labour Fail Labour's tax-and-spend chaos is driving up prices, hitting families hard. Inflation is now HIGHER than expected—higher than France (1.8%) and... Local News\nIssues at Oakbank School Escalated 5th February 2025 This afternoon I went to Oakbank school to listen to residents and try and see what I could do to help. I heard about classes with 70 pupils; poor teaching and... Local News\nPauline Slams Labour Betrayal on Royal Berkshire Hospital Rebuild 21st January 2025 Labour have delayed the build of a new state-of-the-art Royal Berkshire Hospital until 2035 at the earliest. This is despite Yuan Yang’s promises and assurances... Local News\nPauline reports Update: ECMWF Relocation to University of Reading's Whiteknights Campus 20th January 2025 I have just received the following update which will be of interest to local residents. Construction is set to begin in February 2025 on the new European Centre... Reports\nScrutiny report - Wokingham Borough Council 15th January 2025 Last night a very long (3.5 hour) overview and scrutiny management committee. I thought you might like a flavour of what we cover at these meetings First up... Local News",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_RoyalBerksHospital/content_3.html": "Tweet We want your opinion. Please contribute to our resident survey and tell us what you think. Survey on delay to a new Royal Berkshire Hospital Current Royal Berkshire Hospital National Issues Get involved Your details Leave this field blank The Labour government have announced that work to replace the Royal Berkshire Hospital will not begin for at least a decade and could be as late as 2039.Labour made a new hospital a top priority in their election campaign locally. During a debate on BBC Radio Berkshire, the now Labour MP for Earley & Woodley Yuan Yang criticised Conservatives for not moving fast enough and promised that under a Labour Government replacement of the RBH would begin in this parliament.We now know that her party never had any intention to deliver on this pledge.Labour’s plan was always to get themselves elected and then say there was not enough money to proceed with the RBH and other hospitals.When Labour came to power, they found money to hand out massive pay increases to train drivers and others costing over £9 billion. We now know that this was funded, in part, from money earmarked for ‘capital expenditure’ that was intended to pay for building works or new equipment (courtesy: the i Paper 6th March 2025). A brand-new purpose built RBH is desperately needed. By the time this Government plans to start rebuilding, parts of the current hospital will be almost two centuries old. A purpose-built hospital, fit for now and into the future, would be able to provide care for more patients. It would also enable better access and parking.Local Conservatives support a new hospital. It would mean more space and the ability to deploy the best equipment and new technologies. We will continue to lobby for bringing forward this project.Let us know what you think. Do you agree with Labour's decision to delay a new Royal Berkshire Hospital until 2037 at the earliest? Yes, I agree with Labour's decision to delay the build of a new hospital until 2037 at the earliest No, I disagree with Labour's decision to delay the build of a new hospital until 2037 at the earliest",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_insightful-visit-addington-school/content_76.html": "Just back from a very interesting tour round Addington School and a chat with the Headmaster and Chair of the trust. Very very useful with clear messages to take back to the council about how we could help them help us and our residents and the impact of government policies on them.\nThe recent employer's NI increase will have a significant effect on them and they have a lot of staff, I have already written to the Chancellor to point this out as it relates to Council services and social care and the same applies to Addington.\nThe school is lovely and such a happy and caring environment, I was particularly touched to be befriended in one of the classrooms by a little girl who was singing christmas songs and wanted to show me her learning plan.\nVery worthwhile visit. Next stop licencing appeals.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_wokingham-borough-taxpayers-money-wasted/content_54.html": "To deliver the best for residents, it’s important that the Council gets the best value for money. Sadly, under two years of Liberal Democrat and Labour administration into Wokingham Borough, this has rarely been the case.\nThe previous Conservative administration delivered a transformative and award-winning redevelopment of Wokingham town centre. A new square was created in Peach Place, with spaces for cafes and restaurants. Elms Field – in the face of Liberal Democrat opposition – became a new open space with a playground, with shops, a cinema and new homes replacing Council car parks and office buildings. And Carnival Pool leisure centre was completely rebuilt with a brand-new facility, with space to relocate Wokingham library, next to a new multi-storey car park.\nThe final part of the redevelopment inherited by the Liberal Democrats when they took power two years ago was a development of flats next to Carnival Pool. This site is intended to deliver 55 new homes.\nOnce complete, it is expected that the entire regeneration of Wokingham should generate up to £2million a year to start with, and then up to £6million a year once building costs have been paid off. This money can then be redirected into other Council projects and services.\nFlats at Carnival Pool have now sat empty and half-finished for almost two years.\nIn that time, the project has seen two contractors go bust. A construction company going into administration can of course happen with these kinds of projects, and it happened when the Conservatives ran the Council. What is unacceptable is the achingly slow pace at which this Liberal Democrat administration moves.\nThe first contractor carrying out the work went into administration in July 2022. It took until March of this year, and after Conservative councillors raised the issue, for the Liberal Democrat administration to get its act together and find a new contractor.\nIn March an article in this paper proclaimed: “Full steam ahead for Carnival Hub apartments”. In a carefully worded statement Leader of the Council, Cllr Stephen Conway, made no reference to the significant delays and said he was “delighted” to see the contractor had been “appointed to take this project forward”. Sadly, the steam, and one assumes the delight, rapidly ran out as the new contractor went into administration the very next month.\nThe delay in getting these flats finished will have eroded all profit the Council could have expected on them, assuming borrowing costs at 4%. Money is being squandered. Furthermore, these flats should have been available for people wanting to get on the housing ladder in one of the most desirable places to live in the country.\nThis lack of action on the part of the Liberal Democrat administration, who are propped up by Labour, is a far cry from their rhetoric when they were in opposition. When work was delayed for a mere 2 days while Conservative ran the Council on part of the Peach Place development following a contractor going into administration the Liberal Democrats appalled. Their then Leader claimed it was a “shambles”, showed a “cavalier approach”, and was “very expensive with the potential for significant delays”, potentially costing he estimated “an additional £1 million may be more”.\nIt all sounds rather hollow now. As in so many ways, Wokingham Liberal Democrats’ words in opposition do not match their actions in power.\nUnfortunately, the Liberal Democrats have form when it comes to failing to make the most out of what the Council owns. The Conservatives have previously raised the fact that the Council has vast areas of space in its offices that are sitting empty, gathering dust. The administration could choose to rent the space to businesses, other public sector organisations or to charities. Or it could look to consolidate other Council services or equipment at Shute End, freeing up other vacant sites for further use. Instead, at great expense and involving a project that will take years, the Liberal Democrats want to move the Council to the old Marks and Spencer building – despite the challenges of access for the public and the lack of proper facilities for Council and committee meetings.\nYour Conservative councillors carry on challenging the Liberal Democrats over their waste of your money. While the Liberal Democrats continue to claim they need more money, we will be fighting to ensure they are delivering value for taxpayers, before they demand more from you in Council Tax and charges.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_contact/content_11.html": "Hi, I would love to hear from you, please drop me a message if I can help with anything or you have any questions....\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_pauline-jorgensens-motion-maintain-winter-fuel-payments-was-pased-overwhelming-majority/content_17.html": "My Winter Fuel motion was passed tonight, Labour voted against but Liberals supported me. The motion (with minor amendments) was the Council:\n1. Will bring forward a Council-led local awareness campaign to alert those eligible of Pension Credit with local charities and community organisations to help with access to the Winter Fuel Payment for those most in need;\n2. Instructs the Leader of the Council to write to the Chancellor of the Exchequer, urging a review of the decision to means-test the Winter Fuel Payment to protect vulnerable pensioners, particularly those who do not claim Pension Credit, from fuel poverty; and\n3. Will sign the ‘Save the Winter Fuel Payment for Struggling Pensioners’ petition being run by Age UK and write to all members offering them the opportunity to sign the petition themselves.\nMy speech was:\n“Colleagues, I would like to ask you for your support for my motion calling on the Labour Government to rethink its decision to remove the winter fuel payment and to lead an awareness campaign to ensure that people are alerted to the need to claim pension credits and assisted in making claims.\nThe decision to scrap the fuel credit payments will impact some of the poorest people in the country, who are also most in need of heating. This need is firstly because older people are more sensitive to the cold.\nNHS advises people over 65 should heat the rooms they use to at least 18 degrees to stave off respiratory infections and other illnesses.\nAlso, older people are often at home for longer periods, and some are less able to go out.\nIn Wokingham Borough scrapping winter fuel allowance will affect 29,194 pensioners of which only 1,417 are in receipt of pension credit.\nThe threshold for pensions credit is a mere £11,343 a year, roughly half the annual full-time minimum wage.\nWould you like to eat and heat your home on that small amount of money?\nIn stark contrast Rachel Reeves, the architect of this raid on pensioners, has claimed £3,700 of public money in the past 5 years to pay for her heating, on top of a generous MPs salary. Sir Keir Starmer appears to need donations to pay for his clothes and recreation, on top of a salary of £167k and generous expenses.\nLet us remind ourselves that Labour introduced this allowance in 1997 following criticism of their below inflation increase of £2.45 in the pension. This was of course before Conservatives introduced the triple lock. It could therefore be considered as part of the basic pension.\nMany pensioners affected by this change have worked all their lives and paid tax to support them in their retirement, they have not claimed benefits and often are reluctant to do so. They deserve to retain the pension payments and winter fuel allowance which they have contributed to throughout their working lives.”",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_adult-social-care-under-attack-labour/content_13.html": "Last week I wrote to the chancellor of the exchequer and the shadow Secretary of State regarding the impact of NI increases on Wokingham Borough Council and Adult Social Care in the constituency as a whole. The letter to the Shadow Secretary of state was as follows:\nI write to you regarding the Government’s increase in employers’ National Insurance.\nFor Wokingham Borough the combination of the National Insurance rise with the increase in National Living Wage is projected to increase pressure to the Council’s budgets by £3.5 million.\nWe are particularly affected by these changes, more so than other Councils.\nWith an ageing population, the cost of adult social care has increased significantly as a proportion of the Council’s budget.\nUnder the previous Government, additional funding of £1.6 million was provided to meet the rising demand for statutory services including adult social care, on top of another grant increase. By contrast, Council officers have said that the provisional Local Government Finance Settlement for 2025/26 will reduce the Council’s grant funding by £1 million.\nMore than any other unitary authority, almost all the Council’s funding comes from local taxpayers rather than Government grants. We are dependent on increasing Council Tax to properly fund adult social care services. Nevertheless, the cap on Council Tax increases means this can only be raised so far.\nSo, it is not an option to place the additional high burden of taxation on residents, nor do local people want to see other essential services being cut.\nHowever, these changes will result in our Council having to cut funding for adult social care, at a time when it is essential such services are properly funded. Without the proper improvements to adult social care, more pressure will be placed on the NHS.\nThese changes put local authorities in an impossible position and will result significant damage to adult social care services across the country, where councils have no other means to cover the increased costs, including in Wokingham Borough.\nI have written to the Chancellor of the Exchequer urging her to listen to councils who are calling on her to think again. I would be grateful if you could use your position shadowing the Secretary of State for Health and Social Care to make our case to the Government.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_six-months-review/content_61.html": "Looking Back on 2024: A Year of Hard Work and Achievements\nAs 2024 comes to a close, I’m reflecting on what we’ve achieved over just the past six months (12 months would be just too many things):\nCommunity Improvements\n- Shinfield Road crossing will now go ahead after a long fight.\n- Lib/Lab U-turn on scrapping litter bins following our call-in to scrutiny.\n- Agreement to our motion for WBC to resist the massive, undeliverable increase in housing targets from the new Labour Government.\n- Happy to get Jackie Rance elected in the Shinfield By-Election.\n- Parking restrictions in Dunaways Close reached formal consultation after a 2+ year campaign.\n- Earley Town noticeboard and bollards replaced at Hightree Drive.\n- Liberals supported our motion on Winter Fuel Allowances (Labour didn’t).\n- We proposed a motion to encourage schools to keep uniforms simple and reduce costs for parents, which was unanimously agreed. Local charities report increased school queries on uniform issues.\nSorted out a closed path in Shinfield.\nConstructive Challenges\n- Pushed Lib Dems to rethink plans to charge for free car parks.\n- Wrote to the Chancellor on National Insurance increases and winter fuel payments.\n- Scrutinized WBC’s budget and council plans to emphasize value for money.\n- Challenged Hall Farm development proposals in the LD Local Plan.\n- Questioned the LD exec member on Marefield parking, securing the promise of a temporary solution by year-end and a permanent one later. (24 hours to go!)\n- More drug patrols in Whitley.\n- Encouraged LinkedIn recruitment, and reduce use of expensive agencies, saving WBC money on hiring costs.\nAlso supported/attended some fun Community Events\n- Christmas school carol concert\n- Parliament Day Debate at Madejski Academy.\n- Shinfield Charity Cricket Prize Giving.\n- Sonning Show\n- Earley Green Fair.\n- Visits to the RE3 Recycling Centre and Earley Repair Café\n- Addington tour and conversation with the Head and Chair of Governors (enlightening and touching)..\n- Unveiling of the Earley quilt\n- Laurel park FC community day\n- Cultural celebrations like Srinivasa Kalyanam, Ratha-yatra Festival, and more.\nThank you to everyone who supported these efforts or invited me to attend. Together, we’ve made a difference, and I’m looking forward to building on these achievements in 2025!\n#CommunitySupport #WorkingForYou #2024Reflections\nIn addition this year I have dealt with more than 6,000 council emails and very roughly 1,500 cases.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_accessibility/content_58.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_tough-action-against-retail-crime/content_69.html": "Enough is enough for shoplifters and those who abuse our hardworking shopworkers! The Prime Minister is taking decisive action:\n👊 Assaulting retail staff will become a standalone criminal offense. ⚖️ Tough punishments: up to 6 months in prison, unlimited fines, and bans from shops. 🛑 Serial offenders will wear tracking tags. 👮♂️ Police to use facial recognition to catch and prevent crimes.\nLet's protect our communities and support our local shops! #EnoughIsEnough #ProtectOurRetailWorkers",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk/content_1.html": "Our news\nOur Plan for Earley and Woodley constituency\nThe new Earley and Woodley Constituency\nIs Pauline your parliamentary spokesperson?\nEnter your postcode to confirm that Pauline Jorgensen is your candidate.\nI'm Pauline Jorgensen, the Conservative Parliamentary spokesperson for Earley and Woodley. Here, you can find my latest news, campaigns and more about me. I'm here to help, so please don't hesitate to get in touch.\nLabour said little about their policies during the last General Election, now they are in power we are seeing the few promises they did make being systematically broken.\nEnter your postcode to confirm that Pauline Jorgensen is your candidate.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_time-take-action-housing/content_64.html": "The Liberal Democrats’ record in Wokingham Borough on housing is one of over-promising and a total failure to deliver.\nIf we’re elected to run the Council on 2nd May, the Conservatives are committed to ending Liberal Democrat mismanagement that has seen housing being built in the wrong places and the wrong numbers, and no action being taken on targets.\nWhen the Liberal Democrats took control of the Council, they promised to reduce the Borough’s housing numbers. Much was made by the Liberal Democrats of their previous leader Clive Jones bumping into Michael Gove at a conference. But nothing has been achieved. Whereas the previous Conservative administration managed to cut the Borough’s housing target in half, under two Liberal Democrat leaders in two years, no progress has been made.\nLiberal Democrat inaction on housing goes further. Having torn up the previous draft Local Plan, which decides where new housing will go in future years, the administration has spent the better part of 24 months sitting on their hands.\nThe result? A complete loss of control over the planning system where developers have managed to win appeals for more new housing in completely inappropriate places. This is all because the lack of a new Local Plan from the Liberal Democrats means there is no five year land supply – so inspectors will continually rule in developers’ favour. Worse still, the Council is choosing to actively not defend planning appeals, knowing that there isn’t a five year land supply.\nUnder the Liberal Democrats, a site at 6 Johnson Drive, in a rural area of Finchampstead, was recommended for approval to the Planning Committee, having previously been defended by the Council for many years. Another developer won an appeal to build 32 houses on a rural site off Nine Mile Ride in Finchampstead.\nWe know that the Liberal Democrats are finally going to publish a draft Local Plan but they’re not letting residents see it until June, after this May’s local elections. And nearly two years before you will next get the chance to vote again. This is a breath-takingly cynical attempt to avoid backlash from residents and ensure that it’s all done before you get the chance to vote again.\nNext month’s elections are your last chance to stop the Liberal Democrats. Every seat on the Council is up for election this time, meaning it’s possible to change control in one go.\nThe Conservatives have a clear plan for housing if we are elected. We would get on with the Local Plan, but based on clear principles. We will oppose building on green fields, including at Hall Farm near Arborfield. Instead, we would prioritise building on brownfield sites, of which there are many across the Borough, but that’s not all.\nCrucially a Conservative administration would also continue its campaign to cut the Borough’s housing numbers to a sustainable level. We’ve previously worked with local Conservative MPs to make the case to a Conservative Government. That’s why it’s so important that we avoid a Labour Government at the next General Election. Sir Keir Starmer has made clear that if he were Prime Minister, he would have local housing targets set by Whitehall – taking the power out of your hands.\nUnlike the Liberal Democrats, a Conservative administration would also vigorously fight planning appeals, stopping developers dumping the wrong types of homes in unsuitable places. At the same time, we will hold developers to account for actually putting in place the infrastructure they promise.\nAfter two years of the Liberal Democrats, housing and planning are out of control. The developers are in charge, while the administration is hoping to sneak through the elections without you noticing.\nYou can change this. On 2nd May, vote Conservative to put local people back in charge, and deliver a housing system that works for Wokingham Borough.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_education-education-education/content_12.html": "While many people may not have a direction connection to schools, we all have some kind of interest in education. It should be a source of concern for all of us, then, that the Labour Government seems determined to pursue changes to our education system that will make it worse.\nOne of the key reforms to schools under the last Conservative Government was to allow them to set their own curriculum, but with safeguards to ensure children were learning important essentials. This included primary school pupils being tested on times tables, phonics, grammar, punctuation and spelling.\nThe results speak for themselves. Between 2009 and 2022, England went from 21st to 7th in international rankings for maths, 19th to 9th in reading, and in science from 11th to 9th. In Labour-run Wales, the country went backwards in science, from 21st to 29th. Scotland, under the SNP, dropped 10 places in maths, and went from 11th to 26th in science.\nTrade union leaders have decided that these reforms have to go. A review into the curriculum launched by the Government has been seized on by unions as an opportunity to unpick previous reforms. The Association of School and College Leaders thinks too many exams are damaging to young people. There are also calls, including from Labour MPs, to ‘decolonise’ the curriculum.\nThis current Government has already shown it takes it marching orders from trade union leaders. Upon entering office, Labour ministers declared there was no money, but still managed to hand out inflation-busting pay rises to highly-paid public sector workers, like train drivers. Ministers in the Department for Education (DfE) managed to hold 33 meetings with trade unions in just the first 3 months after the General Election. So, we have no faith that Labour’s curriculum review will end up siding with parents and children over unions.\nLabour attempt to claim that their decision to charge VAT on private schools will create a net benefit for state school pupils. Instead, it is doing precisely the opposite.\nMany schools simply can’t absorb the VAT they are now being charged. School fees have risen by 13%, according to the Office for National Statistics. This is higher than the impact the Government claimed.\nParents are already withdrawing their children from private schools and putting them into state schools, increasing the pressure on the state system. Councils have received 3,000 applications for state school places from private school pupils, and it is estimated by the Institute for Fiscal Studies that the number could be as many as 40,000.\nMeanwhile, a dozen private schools have closed or are due to close as a result of Labour’s VAT raid. According to the DfE, since Labour announced its policy to charge VAT on fees in October 2023, 77 private and independent specialist schools have shut down.\nLabour’s claims their policy will raise £1.5 billion for state schools were based on fee increases being lower and schools staying open. This means their policy will not generate this much. Meanwhile, more pupils are being crammed into state schools, costing the taxpayer an additional £8,000 per pupil to educate. Any additional money for state pupils will be absorbed by private school pupils added to the state system.\nThe Conservatives are opposed to Labour’s damaging attacks on education. While the Government continues to make things worse for pupils, your local Conservatives will continue to fight for better outcomes for schools and more transparency for parents.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_faster-simple-and-fairer-our-plan-recover-and-reform-nhs-dentistry/content_68.html": "The Department of Health and Social Care and NHS England have today published Faster, Simple and Fairer: Our Plan to Recover and Reform NHS Dentistry.\nOur new plan will help patients can get the dental care they need when they need it and support NHS dentistry to deliver 2.5 million more appointments for patients.\nThe plan will address the series of challenges facing NHS dentistry which affect patients’ oral health and ability to access the care they need, as well as workforce recruitment and retention. Our plan will deliver faster, simpler and fairer access to NHS dentistry. The new measures being announced include:\n- Offering a New Patient Premium to support dentists to take on new NHS patients\n- Introducing dental vans to deliver care to under-served areas\n- Attracting dentists into areas of need with ‘Golden Hello’ payments\n- Launching our ‘Smile for Life’ programme to focus on prevention and good oral health from birth so that every child includes toothbrushing as part of their daily routine by the time they reach primary school. We are keen to embed good oral health habits at an earlier stage, given the evidence that doing so later - for example, through supervised toothbrushing programmes in the later school years - will have less impact on outcomes but add administrative burdens to primary school teachers.\n- Streamlining and tackling bureaucracy to support and maximise the effectiveness of our entire dental workforce\n- Expanding dental training places by 40% as set out in the NHS Long Term Workforce Plan\n- The full plan can be found here http://www.gov.uk/government/publications/our-plan-to-recover-and-reform-nhs-dentistry\nThe plan is backed by £200 million across the next year and will immediately introduce the new bonus payment scheme for dentists taking on new NHS patients from March. As well as reforming NHS dental contracts to make NHS work more attractive and encouraging practices to take on new patients, the government is also boosting the number of dentists. There were 1,352 more dentists doing NHS work in 2022/23 compared to 2010/2011, and the NHS Long Term Workforce Plan will expand dentistry training places by 40% by 2031/32.\nThe plan also includes new measures to attract dentists to work in the NHS, including supporting more graduate dentists to work in NHS care. We will consult on a ‘tie-in’ to explore whether dentists should be required to work in the NHS for a period upon completion of their training.\nIn 2022, 46% of new dentists joining the General Dental Council's (GDC) register were from overseas. A lack of flexibility in international registration processes can create unnecessary delay to overseas-qualified dentists providing NHS services. That is why we are making it easier and simpler for NHS practices to recruit dentists from overseas by reducing bureaucracy and streamlining systems.\nGeographical variation in access to dental care remains a challenge across the country, particularly in rural and coastal areas. To make access fairer, ‘golden hello’ financial incentives will be brought in for dentists who commit to working for three years in areas of need, and mobile dental vans will be rolled out to bring care and treatment to the most isolated and under-served rural and coastal communities later this year.\nTooth decay is a significant, yet largely preventable public health problem and is the most common oral disease affecting children and young people. In the plan we have set out a new emphasis on prevention and embedding good oral health in all parts of society, particularly babies and the youngest children, where outcomes are best, through an ambitious new programme called “Smile for Life”. The government will support nurseries and early years settings to incorporate good oral hygiene into children’s daily routines by the time children get to primary school and provide advice to pregnant mothers and expectant parents on how to protect their baby’s gums and teeth. This will include dental teams going into primary schools in areas of need and applying fluoride varnish to children’s teeth.\nWe will also consult on expanding water fluoridation, initially to the northeast of England, to protect more people from the risk of tooth decay. The northeast of England was chosen based on a combination of factors including the oral health needs of the region and water company experience operating schemes.\nOur recovery plan is ambitious, with immediate impact on access through the new patient payment which will start from the 1st March, alongside proposals to deliver improvements through the rest of this year and beyond.\nOur ambition is for everyone who needs an NHS dentist to be able to access one and today’s announcement puts us on the right path to achieving this.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_ParkingCharges/content_15.html": "We want your opinion.\nPlease contribute to our survey on the LibDem plans to introduce car parking charges at School Green.\nAnd tell us what you think.\nWe want your opinion.\nPlease contribute to our survey on the LibDem plans to introduce car parking charges at School Green.\nAnd tell us what you think.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_about-me/content_31.html": "I was born in a small Council estate in Northern Ireland, my Dad, having left the Army, moved from Wales and got a job as a mechanic in a textile factory. My mum was a School Secretary. We moved houses quite a bit over the years as employment in the textile industry shrank and our family finally moved to England in the 1970s. Despite there not being much money around my parents sacrificed a lot to make sure I got a good education and encouraged me to work hard and believe nothing was out of reach.\nI was the first person in my family to go to University and did a degree in Zoology at Dundee University. I worked in IT, Cyber Security, Airline Operations and HR for British Airways for 39 years, having held many senior management roles including Group Head of Information Security, Head of People Services and Head of Recruitment.\nDuring the COVID pandemic, I organised two international aid flights which enabled UK charities to send oxygen concentrators and masks to India where people were dying because of shortages. I now volunteer as a trustee and chair a charity fund looking after current and former employees in financial distress.\nI have an MBA and I am a Fellow of the Royal Aeronautical Society. I have a strong business background with particular expertise and interest in information technology, international security, defence and transport.\nI believe passionately in maximising opportunities for all and the importance of providing the best education for children and young people. We couldn't afford to buy books when I was at primary school and, as a result, I understand how important Libraries are, especially to families. As a councillor, I expanded the local library service by reducing their running costs to be able to increase opening hours. I also opened the first seven-day-a-week library service in Woodley Library making it easier for parents who both work to help their children and borrow books.\nI am truly a local candidate, having lived with my husband in Earley for almost 40 years, we have a grown-up son who is a medical research scientist.\nIn that time, I have been delivering for residents on Earley Town Council and Wokingham Borough Council and I now lead the Conservative Group.\nMy record for our area includes securing investment and improvements for parks and leisure centres in Earley and Woodley, investing in repairing and building new roads, and delivering sustainable numbers of new council and affordable homes.\nAs your MP, I will work with the Government to secure greater investment in local services and infrastructure for our community and to make sure good local schools are available to give every person the best chance in life. I will also use my experience, working in a major international company to ensure the government make the changes required to help business and individuals thrive.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_pauline-still-pushing-labour-government-work-commence-rbh/content_77.html": "Following news reports that a decision is close, and a conversation with the RBH project team, I can confirm that I am still pushing our Labour MP hard to deliver on the promise she made in our BBC Berkshire debate to replace the RBH in this parliament.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_help-us-protect-royal-berkshire-hospital/content_44.html": "I am concerned by the apparent Labour u-turn on Royal Berks Hospital programme. During the election Conservatives were criticised by Yuan for not moving fast enough on the project.\nI have written the attached letter to our new MP to ask if she will support the hospital rebuild and ensure that it is not delayed. This letter was sent at the end of July but I have yet to receive a reply.\nIf you agree that we need to get on with the replacement please sign our petition\nhttps://surveys.conservatives.com/campaigns/protect-royal-berkshire-hos…",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_wokinghams-finances-exposing-liberal-incompetence/content_65.html": "In my column in Wokingham Today on 2nd February, I said:\n“It’s right that any administration continues to make the case for more funding for their area.”\nI certainly want to see more money for Wokingham.\nWhen the Conservative councillors ran the Council, we routinely lobbied the Government for a fairer funding settlement for Wokingham. We regularly met with local MPs to discuss this issue, including the former Prime Minister. Crucially, we took our message to Westminster and secured meetings in Westminster with Ministers including the Secretary of State for Local Government. This campaign had some success in securing changes to the formula for calculating Government funding to avoid negative revenue support grant.\nWe would do exactly that again if we were elected to run the Council.\nHowever, there is a difference in the funding the Council gets from the Government and the total revenue money they have to spend, that includes other forms of income such as Council tax; this is known as Core Spending Power.\nWokingham’s Core Spending Power is more per household than any other Council in Berkshire except Slough and more than most Unitary authorities in England.\nThis year our Core Spending Power rose by 7%. More than the average increase in England.\nSince the Conservatives left office, Wokingham’s Core Spending Power has increased by £23.8 million. We didn’t cut resident services, so with more money, the Liberal Democrats shouldn’t be cutting services either. But they are.\nAs a result of the funding formula, Wokingham is more reliant on Council Tax than other areas. The Council should be straight with residents who pay that tax.\nIn communication with residents, Liberal Democrats have not been clear on the difference between Government funding and the total money the Council has to spend on services.\nCouncillors should all lobby Government for our area, but it is wrong to mispresent the Council’s overall financial position to residents. And it is not right to cause alarm to residents and staff with casual references to bankruptcy and redundancy.\nLast year, when voters were going to the polls, Wokingham Liberal Democrats promised residents they would “offer financial competence and compassion.” They have done neither.\nThe previous Conservative administration delivered the first school to be built in the Borough for half a century and we were on track to deliver the new Sixth Form. When the Liberal Democrats inherited the plans, they said they were committed to delivering the extra places and new Sixth Form, yet, efforts stalled and costs mounted. They failed to deliver Bohunt Sixth Form, and only told pupils at the eleventh hour in July that they would need to find alternative Sixth Form places for September.\nBusinesses have repeatedly said that they believe the Liberal Democrats hike in parking charges is affecting trade in our town centres. But the Liberal Democrat Executive Member proudly announced they were funding free bus travel in December, with the Council paying for shoppers to spend their money in other towns outside of the Borough.\nFlats at Carnival Hub have sat empty and half-finished for a staggering 18 months. This delay has destroyed the profit the Council was set to make. By failing to finish these flats, the Council is letting down those people who are trying to get on the housing ladder. After this issue was raised by Conservative councillors, work has started again and they will now be finished in 2025, EIGHTEEN MONTHS LATE.\nThese are not examples of competence or compassion. They are a failure to act, failure to take responsibility, and failure to support Wokingham Borough residentsThis year, their budget, like last year’s, offers residents less but will cost you more. While inflation is currently at 3.4%, the Council’s fees and charges will increase on average 8%.\nThe cost of parking is again increasing, most notably in our country parks, expect it to cost you 15% more.\nIn May, residents will get their chance to bring about change. They will have the choice to elect a Conservative administration that will always put the community first, will restore sound administration of the Council’s finances, and will deliver the best for Wokingham Borough.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_pauline-slams-labour-betrayal-royal-berkshire-hospital-rebuild/content_60.html": "Labour have delayed the build of a new state-of-the-art Royal Berkshire Hospital until 2035 at the earliest. This is despite Yuan Yang’s promises and assurances to residents during the general election campaign. She said that she had spoken to Rachel Reeves and that the new hospital would be built during the next parliament after Labour took office. We now have confirmation that the new hospital will be delayed by a decade.\nIt is clear this is not just another Labour broken promise. This is a complete betrayal of residents, the Hospital Trust, and our local communities.\nConservatives will continue to support the NHS Trust and Building Berkshire Better. We will continue to campaign in the interests of residents for a new state-of-the-art Royal Berkshire Hospital.\nNow I know why our Labour MP wouldn’t answer my recent questions about their hospital programme review. She insisted that the Royal Berkshire Hospital rebuild wasn’t cancelled. But this decision to defer it to at least three governments in the future was clearly something that she didn’t want to own up to.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_yuan-yang-votes-labour-and-scraps-pensioners-winter-fuel-allowance/content_37.html": "So now we have it, Labour has voted to scrap the winter fuel allowance.\nOur MP Yuan Yang voted in favour of scrapping the allowance, but to their credit 53 Labour MPs, including some new MPs, had the guts to abstain.\nEither our new MP believes in the policy to take money from vulnerable pensioners or she has her eye fixed on the greasy pole of political progression.\nHer Leaflets pledged to help keep our houses warm through a plan for extra insulation. Pensioners expected helpwith heating costs, they didn't expect the removal of their winter fuel allowance.\nThe vote was 228 against stopping the payment and 348 in favour.\nLet's remember this policy wasn't in the Labour manifesto. I wonder if the result in Earley and Woodley would have been different if they had been honest about their intentions?",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_privacy/content_24.html": "This document outlines how Pauline Jorgensen processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Pauline Jorgensen\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Pauline Jorgensen.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Pauline Jorgensen, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Pauline Jorgensen via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_about-rss/content_22.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_meeting-prime-minister-rishi-sunak/content_48.html": "As Conservative group leader at Wokingham Borough Council, Pauline was invited to 10 Downing Street to Meet Rishi Sunak. This gave her the chance to talk to him about some of the issues facing Earley and Woodley Constituency and things the government can do to help.\nPauline says, \"It was great to meet the Prime Minister and talk about then new Constituency and some of the issues facing Earley and Woodley. I talked about the problems high levels of development caused when infrastructure provision like roads, schools and health facilities lag behind development. This includes the increasing pressure on school places, home-to-school transport and doctor's surgeries. If I am elected as the MP for Earley and Woodley I will make it one of my priorities to ensure development targets are manageable and developments are in sustainable locations with good infrastructure\".",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_myplan/content_5.html": "Resisting unsustainable development\nAs a local councillor, I understand the pressure development can put on existing infrastructure, roads and schools. I will continue to campaign against excessive development and oppose development in the green belt and countryside.\nCracking down on crime\nThis Conservative Government has recruited an extra 784 police for Thames Valley. I'm working with Matthew Barber PCC to ensure residents priorities are top of the agenda when it comes to tackling crime.\nTackling local NHS waiting lists\nOur GP, hospital and dentistry waiting lists need to be improved. I'm speaking to local providers, hospital support groups and the health authority to find out what more we can do, so you and your family can access world class healthcare when they need it most.\nTop quality education\nSince 2019 we have increased education funding and commissioned two new SEND schools. I will ensure schools in our area have the resources and support they need, for our children and grandchildren. I am also helping local charities support families with children.\nHigher quality services\nI am determined to ensure your money is put to good use. That's why I am putting pressure on our councils to deliver better value for money in the services they offer. So you can keep more of your hard-earned money.\nSupporting employment\nI know how important job security is to families. I will work with local businesses, aspiring entrepreneurs and the government to make sure barriers to working or running your own business are removed.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_labours-broken-promises/content_16.html": "2025\n20th January - Labours Budget of broken promises - Royal Berkshire Hospital Rebuild - Number 7\nDuring the election, Labour promised they would rebuild the RBH in this parliament, Yuan Yang criticised the Conservative government for not moving fast enough and said Labour would do better, rebuilding RBH was apparently her first priority. Following the election she refused to be drawn on her campaigns on RBH but categorically stated that the project had not been cancelled.\nWhat has actually happened....\nOn 20th January Wes Streeting announced that the much-needed project to rebuild the RBH would be deferred until 2035-39, that's at least 3 Parliaments away, its likely Labour will be a distant nightmare by then, thats as good as a cancellation. A complete betrayal of the people of this area following a cynical campaign to gain votes by promising action.\n3rd January - Labours Budget of broken promises - Energy Bills - Number 6\nDuring the election, Labour promised they would cut energy bills for good. Labour announced proposals to “set up Great British Energy, a publicly-owned clean power company”, and in the run-up to the election, prominent Labour politicians claimed that this would cut bills by up to £300 a year.\nWhat has actually happened....\nOn 1 January the latest Energy Price Cap came into effect – this is the second time energy bills have risen despite a clear promise by the government to cut energy bills – another broken promise which we are paying the price for.\n1st January - Labours Budget of broken promises - Smash the criminal boat gangs - Number 5\nDuring the election, Labour promised they would smash the criminal boat gangs.\nWhat has actually happened....\nRecently released figures show the number of small boat arrivals has increased by nearly 29 per cent since Labour came to power. Between 5 July and 31 December 2024, there have been 23,242 arrivals by small boat, a 29 per cent increase on the same period in 2023.\n2024\n30th October - Labours Autumn Budget of broken promises - Working people - Number 4\nKeir Starmer told the country that they could trust Labour’s promises not to raise taxes and not to unleash a borrowing spree. In the House of Commons on 9th October this year he said STARMER: ‘We made an absolute commitment to not raise tax on working people. Rachel Reeves said a rise in National Insurance was a ‘tax purely on people who work’. (Hansard 19 Oct 2021)\nWhat actually happened....\nLabour have done just that and more. They fiddled the fiscal rules, increased borrowing by billions of pounds, and raised taxes on businesses – which they have now admitted will leave working people worse off.\nThe Office of Budget Responsibility have said an increase in employer National Insurance will be passed through ‘entirely’ onto working people\nOctober 30th - Labours Autumn Budget of broken promises - for Farmers - Number 3\nKeir Starmer, Steve Reed and the Labour Party told farmers that Labour respects them, would protect their livelihoods and promised that they would not change Agricultural Property Relief for farmers. (Feb 23 NFU conference, November 23 NFU statment, CLA conference reported in the FT, December 23 )\nWhat actually happened...\nIn the 2024 Autumn Budget, Labour broke their promise to farmers – reducing the relief and imposing inheritance tax rates on farmland – which will devastate family farms and pose a serious risk to domestic food security and food prices.\nThe 2024 Autumn Budget reduced Inheritance Tax relief on combined agricultural and business assets after the first £1 million from 100 per cent to 50 per cent (HM Treasury, Autumn Budget 2024, p. 48, 30 October\nAmongst Labour’s Budget of broken promises, Labour have made the political choice to target family farms and the consequences will be felt by thousands of farms and families across the country.\nSeptember 10th - Broken promise number 2\nIn Yuan Yang's election campaign in July 2024 - she said she wanted to\nHelp people with their fuel bills and keep homes warm with an insulation plan\nWhat actually happened...\n10th September, 86 days after the election, Yuan Yang our MP voted to scrap the pensioner's winter fuel allowance. Pensioners expected help with heating costs, they didn't expect the removal of their winter fuel allowance.\nYuan Yang and Labour taking money from vulnerable pensioners.\nJuly 28th - Broken promise number 1 *updated*\nIn Yuan Yang's election campaign in July 2024 - she said her first priority in the campaign was to\nBuild a New Royal Berks Hospital\nOur NHS staff at the Royal Berkshire Hospital are working very hard to deliver care for their patients. But staff and patients alike are being let down by the out-of-date facilities and cramped conditions.\nWe cannot wait any longer for an NHS that's fit for purpose. Labour will deliver a new RBH fit for the 21st century,\nWhat has actually happened...\n28th July, 24 days after the election, the Labour Chancellor announced a review of the whole new Hospital programme, RBH said “More delays to providing facilities that are fit for the future will be disappointing news for our patients, staff and our wider community.\" On the 20th September the paper confirming this was sneaked out without announcement.\nWe call on Yuan Yang to keep her promises, stand up to her party and stand up for residents, and join with us and fight for a new hospital to replace the RBH.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_category_Articles/content_6.html": "Wokingham's Finances: Exposing Liberal Incompetence 27th March 2024 In my column in Wokingham Today on 2nd February, I said: “It’s right that any administration continues to make the case for more funding for their area.” I... Articles\nTalking to residents in Fairwater Drive Woodley 16th August 2023 Pauline Jorgensen and a Conservative team were out in Woodley talking to residents with Laura Blumenthal the Conservative ward councillor. Many residents were... Articles",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_category_Reports/content_10.html": "This week in Earley and Woodley 21st April 2025 Back into the council work: 🌧️ Flooding – Raised residents' concerns about local flooding, pushing for better drainage and quicker responses. 📋 Planning –... Reports\nPauline reports Update: ECMWF Relocation to University of Reading's Whiteknights Campus 20th January 2025 I have just received the following update which will be of interest to local residents. Construction is set to begin in February 2025 on the new European Centre... Reports\nAdult social care under attack by Labour 3rd January 2025 Last week I wrote to the chancellor of the exchequer and the shadow Secretary of State regarding the impact of NI increases on Wokingham Borough Council and... Reports\nWokingham Borough taxpayers money wasted 24th May 2024 To deliver the best for residents, it’s important that the Council gets the best value for money. Sadly, under two years of Liberal Democrat and Labour... Reports\nCareers advice session for BAME families 6th April 2024 Very enjoyable afternoon as keynote speaker at a career advice session at Wycliffe Baptist Church. Thanks to Moses Iyengunmwena for inviting me. I hope I was... Reports\nHong Kong national security proposals - Article 23 23rd March 2024 This afternoon I was invited by my Hong Kong friends to visit their stall in Reading Town Centre raising awareness of the actions of the government in Hong Kong... Reports\nMatthew Barber calls on four major retailers to stop the sale of illegal e-scooters 28th February 2024 Matthew Barber, Police and Crime Commissioner for Thames Valley, has written to four major retailers to ask them to reconsider the sale of e-scooters. Matthew... Reports\nShinfield Safety Boost: New Motorcycle Barrier Tackles Reckless Riding Concerns 24th February 2024 Happy to share great news from Shinfield! This morning, I received an email from a local resident expressing gratitude for the new motorcycle barrier we've... Reports\nLeading the fight against shoplifters 25th January 2024 Following my conversation with the Thames Valley Chief Constable and Matthew Barber the Police and Crime Commissioner I am pleased to report that Matthew... Reports",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_category_Real-Talk/content_40.html": "Conservative Party Chairman visits Earley and Woodley 11th January 2025 As part of our regular session of insightful conversation, Lord Dominic Johnson, Conservative party Chairman, came to Sonning's Pearson Hall to talk to us and... Real Talk\nJacob Rees Mogg, a conversation in our Conservatives Unfiltered series 25th October 2024 Sir Jacob Rees Mogg entertained us with a fascinating talk on the future of the Conservative party and answered lots of questions. His humourous style and... Real Talk\nAn evening with Tom Tugendhat - part of our Conservatives Unfiltered Programme 4th February 2024 Great event with Tom Tugendhat this week. Really interesting chance to hear the latest on his security portfolio and also ask lots of questions. Wide ranging... Real Talk",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_labour-fails-deliver-their-promises/content_36.html": "The UK has now had a Labour Government for 9 months. In that short time, things have got significantly worse for people, including those of us living in Wokingham Borough.\nOn Tuesday, the cost of bills like energy, water, broadband, and TV licences all went up. At the same time council tax bills, capital gains and vehicle taxes have also risen. The additional cost of these increased bills means that the cost of living is expected to rise by £1,191. On top of this, the increases in National Insurance contributions for 940,000 employers across the country take effect from this Sunday, leading to higher prices and jobs losses.\nLabour has quickly become fond of blaming everyone but themselves for their choices. However, these decisions can all be traced back to Sir Keir Starmer and the Chancellor of the Exchequer, Rachel Reeves.\nBack in October, the Chancellor announced she would increase National Insurance contributions for employers, breaking a Labour manifesto commitment not to put up this tax. The Office for Budget Responsibility (OBR) estimates that 60 percent of the higher costs to employers will be passed on to consumers and workers, with tens of thousands of jobs cut as a result. The Chancellor has also refused to exempt some public sector organisations, meaning that in Wokingham Borough, the Council will need to spend millions of pounds more just to hand to the Government in tax on social services.\nDespite Labour’s claims that they want to help people get on the housing ladder, they’re actually making it harder and more expensive. The threshold at which stamp duty kicks in has dropped from £425,000 to £300,000 for first-time buyers, and from £250,000 to £125,000 for those who already own a home. This comes at the same time as Angela Rayner, the Deputy Prime Minister, wants to take away councillors’ abilities to stop unsustainable development. Under Labour, it’s pay-day for developers.\nAlongside the direct taxes that Labour are putting up, there are also costs that are increasing because of the party’s broken promises. During the election, Starmer and Ed Miliband told the public that under a Labour Government, their policies would mean that energy bills would be cut by £300. Energy bills are now expected to rise by an average of £111. Thames Water bills are also expected to go up by £204.\nLabour promised that they would ‘freeze’ Council Tax. However, the Liberal Democrat administration running Wokingham Borough Council have increased the WBC element of the average Band D Council Tax bill by £91.78 for the year. This adds a further cost.\nLast week, the Chancellor had to deliver a number of changes to the policies she set just 6 months ago, after it became clear they wouldn’t raise as much money as she claimed. It is also forecast that the UK’s growth will now be a tiny 1%.\nAll this indicates that there is more to pain to come. When the next Budget comes along in October, we can expect to see even higher taxes and cuts to public services. You pay for the consequences of Labour’s decisions.\nLocally, your Conservative councillors believe Council services should be getting better, and the impact on residents should be minimal. We will continue making the case for better and more efficient services delivered with value for money.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_rbh-bombshell-sneaked-out-under-cover-suitgate/content_50.html": "On Friday (Friday 20 September) the Labour Government published the terms of reference for the review of the New Hospitals Programme.\n\"Given the terms of reference have been published in silence, on a Friday afternoon, ahead of Labour Party Conference, I imagine it will be an open and shut review, aimed at shutting down a Conservative Party initiative to build 40 new hospitals across the country, whilst at the same time giving bumper pay deals to their union friends.”\nCllr Jorgensen continued\n“The Royal Berks Hospital has been named in scope for the review, so will be under threat - if it has not already been cancelled by the Chancellor and the Health Secretary.\n“Much like the promises she made around the Royal Berks Hospital, Yuan Yang MP has gone missing since the election.\n“I call on her to respond to my open letter from 30th July, regarding the Royal Berks Hospital, and to publish any communications she has had with the Chancellor and her colleagues in the Labour Government regarding the Royal Berks Hospital, and prove to the people of Earley and Woodley that she is actually working on their behalf.”",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_shinfield-residents-concerned-about-school-provision/content_57.html": "We were out talking to residents in Shinfield on Thursday. we met quite a few people who knew Pauline having previously lived in Earley or having been members of Earley Residents Discussion board on Facebook.\nThe main issues they told us about were the lack of school places with the local primary school not accepting older pupils yet, and the inevitable grass cutting. Residents told us they faced large vet bills because the uncut grass heads got into their dog's ears. They were also concerned by the lack of litter and dog waste bins, in one large estate there seemed to be only one solitary bin.\nThe team, which included Cllr Jackie Rance a Shinfield Councillor and Cllr Pauline Jorgensen Conservative Group leader and Parliamentary candidate for the area took away lots of items to follow up on and resolve. It was a worthwhile evening hearing first-hand what issues residents face.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_campaigns_save-wokingham-borough-litterbins/content_26.html": "Black bags have appeared covering litter bins across the Borough. More than a hundred bins are slated for removal and the Lib Dem Executive member has announced that remaining bins will be emptied less frequently. Already, waste is piling up around overflowing bins.\nConservatives have challenged the decision-making process and Council officers have agreed that changes will be put on hold until the decision is considered at the Borough Executive meeting. This gives us all an opportunity to make our views known.\nLitter bins are important.\nNone of us wants litter piling up around the streets. footpaths and children's play areas. We don't want to see dog poo bags abandoned in hedgerows. Discarded plastics, cans and bottles can injure wildlife. Bins are important to ensure our children are brought up to dispose of their litter properly and they need to be emptied regularly.\nIf you want Wokingham Borough Council to keep its network of litter bins and empty them frequently, please support our campaign and sign our petition\nhttps://www.wokinghamconservatives.org.uk/campaigns/save-wokingham-boro…\nPlease also complete the consultation ( launched 14 August) Project • Proposed changes to street cleaning and grounds... (wokingham.gov.uk)\nWBC say they will take amended proposals and the findings from the consultation to the council's Community and Corporate Overview and Scrutiny Committee on 2 October for consideration.\nA final decision will be made by the Executive Committee ( all Lib Dem lead members) on 26 October.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_labours-political-housing-numbers/content_63.html": "In July, the new Labour Government revealed its plans to almost double the numbers of houses being built in Wokingham Borough. This comes despite our area having built its fair share of new homes for years. Yet Labour isn’t interested in hearing it.\nNationally, there is a need for new housing, something all the major political parties agreed on at the General Election.\nUnderstandably there is demand for housing in our area. Under two decades of Conservative administration, Wokingham Borough was frequently ranked one of the best places in the country to live, work and raise a family.\nLabour have said that they want to see house prices become more affordable.\nYet, building more homes has not prevented house prices from continuing to rise in Wokingham Borough and across the Country, even during the recent period of high interest rates.\nJust in the last year alone, house prices in Wokingham rose on average by £4,000.\nDevelopers have been able to exploit the planning system, hoarding land while demanding more planning permissions, knowing that their failure to build means councils will have to approve more applications and controlling the supply on new homes coming on the market. In the meantime, some use existing outline planning permissions on land to sell it on for profit – meaning the buyers who then build will charge more for the houses.\nWhen the Conservatives ran the Council, we worked with the then-Conservative Government to introduce a more sensible and sustainable target for new homes for the Borough.\nHowever, since Labour came into Government, they have proposed a radical shake up of the planning system which will leave residents without a say. And they have reintroduced centrally imposed targets.\nLabour is proposing not a modest increase, but to double the Borough’s housing target. And while they seek to carpet our communities with inappropriately sized dwellings in the wrong places, they have no plan to force developers to build the houses they already have permission for, or ensure that the necessary infrastructure is in place before the new homes arrive.\nThere’s another odd feature at the heart of Labour’s plans. Green and rural areas like Wokingham Borough have its targets massively increase. But England’s major cities, particularly London, are having their housing targets decrease. The capital, with its Labour Mayor and many Labour councils, will see the Labour Deputy Prime Minister reduce its annual housing delivery numbers by 20%. Coincidentally, the Prime Minister, Foreign Secretary and Health Secretary all happen to have constituencies where housing targets are now going to reduce. Outside London, other MPs in the Government stand to benefit – for example housing targets will now be reduced in the Leicester constituency of Liz Kendall, who also happens to serve as Labour’s Work and Pensions Secretary.\nLabour’s system is political, and broken before it’s even properly started. Instead of putting new houses in areas where demand is high, like big cities, Labour want the houses to go in more rural areas without the local employment or necessary infrastructure to support such significant increases in the local population.\nLabour’s political housing targets are currently open to consultation. Wokingham Borough Council will be submitting a reply, and I, on behalf of the Conservative Group, have suggested an addition be made around developers failing to build existing permissions.\nAt the same time, we’re calling on our local MPs, including the Labour MP for Woodley and Earley, to go back to the Government and tell them to think again.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_cutting-tax-27-million-working-people/content_38.html": "Cutting National Insurance contributions for 27 million people in January 2024, saving the average worker £450 a year.\nFrom Saturday 6 January 2024, the main rate of National Insurance contributions will be cut from twelve pence to ten pence. This delivers an annual average tax cut of £450 to 27 million workers, rewarding hard work across the country.\n- A senior nurse with five years of experience on £42,618 will receive an annual gain of £600.\n- An average full-time nurse on £38,900 will receive an annual gain of over £520.\n- An average police officer on £44,300 will receive an annual gain of over £630.\n- A typical junior doctor on £63,000 will receive an annual gain of over £750.\n- A cleaner working night shifts on £21,000 will receive a gain of £170.\n- A typical self-employed plumber on £34,400 will receive an annual gain of £410.\n- An average teacher on £44,300 will receive an annual gain of over £630.\n- A family with two earners on the average earnings of £35,404 will be £900\nLater this year, we will abolish an entire class of NICs and cut the rate of the NICs top rate from nine per cent to eight per cent for the self-employed – with an average total saving of around £350 for someone earning £28,000 a year.\nLabour refuse to rule out tax rises to fund their £28 billion green spending plan. (GB news 1/12/23)",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_pauline-comments-hall-farm-development-scoping-study/content_39.html": "My comment on the scoping study for Hall farm (following on from my video before xmas on the local plan impact)\nI am very concerned about the viability and suitability of this site, I would ask you to consider firstly the risk of flooding. Most of the site is in flood zone 1 and 2 and some is in zone 3, access roads are recognised as being likely to flood but the mitigation of road elevation will not resolve issues in particular at the Loddon Bridge roundabout which regularly floods and causes significant issues. This forms a key access point to the roads proposed for access to the site. The bridge to LE way is recognised as a key access point for the development and yet flooding of LE way or Mill Lane roundabout has not been sufficiently addressed.\nSecondly the traffic impact of this development has not bee adequately reviewed, assumptions made in traffic modelling assume Reading is the major access hub and yet accessibility to Reading itself has not been addressed. The assumptions of employment on site need to be reviewed due to the relatively low level of employment in Shinfield studios and the extent of current development which may already exceed the need. The transient nature of many roles in the film business may necessitate more commuters than permanent employees living in the area. I would like to see a deeper analysis of the jobs provided within the site and their nature and tenure to assess if the assumptions of people being able to walk or cycle to work are valid.\nCurrently, Lower Earley Way is expected to take a large proportion of the traffic from the development, this is regularly gridlocked between 7:30 and 10 am and 5 and 7 in the evenings with the current traffic volume and even with enhancements will not cope with increased volumes. In addition, extra traffic will seriously impact nearby local residents in areas such as Barn Croft Drive and to the south of Chatteris Way by eating into the vegetation screen and open countryside protecting them from the M4 and vastly increasing noise and pollution. The bridge over the river to access will be relatively high level and make this worse in my view.\nArborfield Church Lane is an important consideration for traffic and access planning in the Hall Farm/Loddon Valley development. This drive is currently a quiet, rural route, but its proximity to the proposed development raises potential concerns about increased traffic flow, safety, and environmental impact.\nIn summary, I think that the traffic impact has been underestimated and the employment within walking distance overestimated. The poor links to Reading, with the lack of nearby rail or adequate bus routes, have not been properly considered. This will lead to a significant, unacceptable, and unsustainable increase in car use.\nYou can add your comments here.\nhttps://planning.wokingham.gov.uk/FastWebPL/detail.asp?AltRef=243188&ApplicationNumber=243188&AddressPrefix=&Postcode=&KeywordSearch=&Submit=Search",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_category_Westminster-News/content_14.html": "RBH Bombshell sneaked out under the cover of 'Suitgate' 21st September 2024 On Friday (Friday 20 September) the Labour Government published the terms of reference for the review of the New Hospitals Programme. \"Given the terms of... Westminster News\nLabour’s Political Housing Numbers 18th September 2024 In July, the new Labour Government revealed its plans to almost double the numbers of houses being built in Wokingham Borough. This comes despite our area... Westminster News\nYUAN YANG VOTES WITH LABOUR AND SCRAPS PENSIONERS WINTER FUEL ALLOWANCE 10th September 2024 So now we have it, Labour has voted to scrap the winter fuel allowance. Our MP Yuan Yang voted in favour of scrapping the allowance, but to their credit 53... Westminster News\nHelp us protect the Royal Berkshire Hospital 15th August 2024 I am concerned by the apparent Labour u-turn on Royal Berks Hospital programme. During the election Conservatives were criticised by Yuan for not moving fast... Westminster News\nCalling on Yuan Yang to stand up for our countryside 11th July 2024 I have called on Yuan Yang to distance herself from Labour Party policy on housing and law and order, following Sir Keir Starmer and Rachel Reeves’s pledge to... Westminster News\nTough Action Against Retail Crime! 10th April 2024 Enough is enough for shoplifters and those who abuse our hardworking shopworkers! The Prime Minister is taking decisive action: 👊 Assaulting retail staff will... Westminster News\nFaster, Simple and Fairer: Our Plan to Recover and Reform NHS Dentistry 15th February 2024 The Department of Health and Social Care and NHS England have today published Faster, Simple and Fairer: Our Plan to Recover and Reform NHS Dentistry. Our new... Westminster News\nCutting Tax for 27 million working people 6th January 2024 Cutting National Insurance contributions for 27 million people in January 2024, saving the average worker £450 a year. From Saturday 6 January 2024, the main... Westminster News\n£2 Bus fare cap extended 1st November 2023 I am pleased with the Conservative Government’s decision to extend the £2 bus fare cap, bringing cheaper journeys to people across the Earley and Woodley... Westminster News",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_HallFarmSurvey/content_29.html": "Tweet We want your opinion. Please contribute to our resident survey and tell us what you think. Resident survey on the planned Hall Farm development Current Hall Farm Development National Issues Get Involved Your details Leave this field blank The Lib Dems have voted to concrete over our countryside with 3,900+ new houses at Hall Farm (also now known as Loddon Garden Village). This massive new development will join Shinfield with Earley, Barkham & Arborfield, and Winnersh.The new houses could destroy the designated local Heritage site. It would destroy our countryside and build over farmland. Thousands of trees will be lost. The development may also increase the risk of local flooding.There are also concerns about the lack of supporting infrastructure. It would be many years before a new school could be built and there are already issues with local sewage capacity. The significant increase in traffic is a major concern. This traffic would impact on neighbouring roads, particularly at the key access points to the new development. Studies carried out to predict the levels of traffic appear flawed. Amazingly they are based upon data from the Covid period, when vehicle numbers were much lower.Also we have seen no plan for sustainable transport to take residents to and from existing centres, such as Wokingham and Reading.Conservatives in the Earley & Woodley constituency remain opposed to the Hall Farm development. But we want your opinion. Do you agree with the planned development at Hall Farm? I am opposed to the Hall Farm development I support the Hall Farm development I am undecided Why are you opposed to the Hall Farm development? Destruction of our countryside Development on local farmland Development on a designated local Heritage site Houses not needed to meet local demand Impact on neighbouring roads Inadequate sewage capacity Incorrect assumptions on levels of traffic Increased urbanisation of local area Lack of sustainable transport Loss of thousands of trees Possible risk of flooding Significant increase in local traffic Select as many options as you wish. We welcome any further comments that you may have on the Hall Farm development. Why do you support the Hall Farm development? What further information do you require? Please consider the following statement... Future local development should be built on brownfield land first, to protect our countryside. It should have supporting infrastructure and be distributed fairly across Wokingham Borough. I agree with the statement I disagree with the statement I am undecided",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_jacob-rees-mogg-conversation-our-conservatives-unfiltered-series/content_71.html": "Sir Jacob Rees Mogg entertained us with a fascinating talk on the future of the Conservative party and answered lots of questions. His humourous style and encyclopedic knowledge of Parliament and history, combined with good company and excellent refreshments, made this a fascinating and entertaining evening",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_campaigns_scrap-parking-charge-increases/content_33.html": "Please hop across to Earley and Woodley Conservatives and sign our petition\nhttps://www.earleyandwoodleyconservatives.org.uk/campaigns/scrap-parkin…\nPlease hop across to Earley and Woodley Conservatives and sign our petition\nhttps://www.earleyandwoodleyconservatives.org.uk/campaigns/scrap-parkin…",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_breaking-inflation-rises-3-under-labour/content_30.html": "Labour Fail\nLabour's tax-and-spend chaos is driving up prices, hitting families hard. Inflation is now HIGHER than expected—higher than France (1.8%) and Germany (2.8%)!\nMore expensive shopping bills\nHigher mortgage payments\nWages crushed by rising costs\nMel Stride MP: “Labour were warned that their tax spending and borrowing spree would drive up inflation. It means higher prices in the shops, and interest rates staying higher for longer, causing mortgage misery for millions —This Chancellor is out of her depth, and we're all paying the price.”\nLabour’s Jobs Tax lands in April—expect things to get WORSE. Time to stop the damage.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_category_Speeches/content_7.html": "Pauline Jorgensen's motion to maintain the winter fuel payments was pased by an overwhelming majority at Wokingham Borough Council 24th October 2024 My Winter Fuel motion was passed tonight, Labour voted against but Liberals supported me. The motion (with minor amendments) was the Council: 1. Will bring... Speeches\nAnother Liberal and Labour mess on the horizon? 26th July 2024 A busy full council meeting yesterday, on the agenda was the delegaton of the tender of waste collection, street cleaning and litter bin emptying to the... Speeches",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_scrutiny-report-wokingham-borough-council/content_67.html": "Last night a very long (3.5 hour) overview and scrutiny management committee. I thought you might like a flavour of what we cover at these meetings\nFirst up important discussions focused on proposed changes to the constitution. While this might sound like a dry topic, it’s actually crucial for ensuring fairness, transparency, and democracy in how the council operates.\nOne key item I raised was the need to ensure that deputy executive members don’t scrutinise areas they are responsible for. This could lead to conflicts of interest and undermine impartiality. I’m pleased to report that this proposal was agreed upon.\nAnother area of concern was a proposal to remove the option for minority reports from scrutiny committees. The reasoning given was that minority reports might undermine political impartiality, but this didn’t add up. Removing them entirely would essentially allow the majority group to silence any opposition, stifling important alternative viewpoints.\nWhile minority reports are rarely used, they play an important role in certain circumstances. For example, during the boundary review, a minority of people felt that single-member wards representing distinct communities should be maintained. This wasn’t a political stance—it was a matter of representation. After discussion, it was agreed that minority reports should remain an option in exceptional circumstances. I hope the Constitution Review Committee will reflect this feedback and amend the proposal accordingly.\nLastly, I highlighted the proposal that statutory Diocesan church co-opted members having the exclusive right to sit on overview and scrutiny committees related to education. This arrangement limits influence to representatives of Christian denominations, excluding other faiths and non-religious perspectives. This imbalance is tied to national legislation, we were told that legislators have been resistant to change this due to the historical link between bishops and their seats in the House of Lords.\nI suggested the council write to the government, urging them to modernise this outdated legislation. Representation should reflect our diverse society, ensuring fairness for all, regardless of faith or belief.\nThese debates may not make headlines, but they’re critical for ensuring a balanced and democratic council.\nAnother key focus at scrutiny last night was reviewing the Key Performance Indicators (KPIs)—an 81-page report covering crucial aspects of council performance. Here's what stood out:\nProperty Portfolio Occupancy & ROI\nI raised concerns about the occupancy rate figures for WBC’s property portfolio. The report didn’t account for all council-owned properties, meaning it doesn’t fully reflect unused spaces. Similarly, the Return on Investment (ROI) data only included properties in the investment fund, potentially painting a rosier picture than reality. Clarity in reporting is vital to ensure we have an accurate view of how assets are performing.\nAnti-Social Behaviour Service Requests\nThe number of service requests was significantly above target, which I queried. It turns out this was largely due to increased fly-tipping around bottle banks and bins. While the council has issued numerous fixed penalty notices and installed cameras at hotspots, I suggested publicising these efforts more widely to discourage further fly-tipping. Let’s make it clear that this behaviour won’t be tolerated!\nPlanning Appeals\nPlanning appeals had a mixed performance—reasonably successful in Q1 but dropping to an unacceptable 55% success rate in Q2. While the planning committee should always act based on what’s right for the community rather than chasing numbers, it’s a trend we need to monitor.\nCustomer Satisfaction\nCustomer satisfaction with the council’s website and services dropped below target, attributed to the unpopular waste changes and the California Crossroads situation. We need to address these issues to improve residents’ experience.\nHealth & Adult Social Care\nHealth and adult social care KPIs weren’t discussed in detail as they have their own dedicated scrutiny committee. This ensures they get the focused attention they deserve from officers and members who specialise in these critical areas.\nReviewing these KPIs is a lot of work, but it’s essential for holding the council to account and ensuring we’re delivering for residents. we will keep pushing for improvements where they’re needed.\nThe final substantive item on the agenda was the report on the council’s future headquarters. While no decisions were made, we focused on narrowing down options that didn’t make sense and ensuring thorough scrutiny moving forward.\nKey points:\nCaution on Expenditure\nGiven the ongoing local government review, we need to be cautious about committing funds, as this might affect future plans for future council offices.\nFlexibility on Leasehold vs Freehold\nIt was agreed that the executive should be asked to keep both leasehold and freehold options on the table to maintain flexibility.\nWorking Group for Option Review\nWe recommended setting up a working group to review the scoring of individual options and the assumptions behind them. For those with experience in property moves and refurbishments, the assessments didn’t seem consistent.\nThis cautious and detailed approach ensures that decisions on such a significant investment are well-informed and aligned with long-term needs.\n#CouncilMatters #FuturePlanning #Transparency #Accountability#CouncilMatters #FairRepresentation #Transparency #Modernisation #DiversityAndInclusion #CommunityFirst #ImprovingServices",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_evening-tom-tugendhat-part-our-conservatives-unfiltered-programme/content_45.html": "Great event with Tom Tugendhat this week. Really interesting chance to hear the latest on his security portfolio and also ask lots of questions. Wide ranging talk from Hong Kong to Russia and the position in Gaza. Very enjoyable and educational.\nGreat event with Tom Tugendhat this week. Really interesting chance to hear the latest on his security portfolio and also ask lots of questions. Wide ranging talk from Hong Kong to Russia and the position in Gaza. Very enjoyable and educational.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_careers-advice-session-bame-families/content_55.html": "Very enjoyable afternoon as keynote speaker at a career advice session at Wycliffe Baptist Church. Thanks to Moses Iyengunmwena for inviting me.\nI hope I was able to provide some useful information from my experience having had a very varied career in BA including several years running recruitment. I was also able to talk about apprenticeships from my recent meeting with the Education Secretary Gillian Keegan and Virgin Media/O2.\nYou also learn lots from these events and I was very interested to hear the latest hints and tips for exam preparation now that marking is automated - enlightening.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_lib-dem-parking-chaos-horizon/content_35.html": "The LibDems plan to introduce car parking charges at School Green, Shinfield. The plan was revealed at a recent Council Meeting following a question from the Conservatives.\nThe local community uses the car park at School Green to visit the community centre, the local café, the doctor's surgery, the pharmacy, the care home, and the nearby sports pitches.\nIntroducing car parking charges would cause huge disruption in the local area. It would add further cost and inconvenience to hard-working families. And would lead to chaos with cars parking on neighbouring roads.\nThe LibDem plan for Shinfield is becoming clear. They will concrete over our countryside with 3,900+ new houses at Hall Farm. They have closed the Community Flat on Frensham Green. They are backing Labour's decision to stop the Conservative plans for a new Royal Berkshire Hospital. And now they will introduce car parking charges at School Green.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_lib-dems-avoid-litter-bin-debate-again/content_43.html": "Lib dems talked out Norman Jorgensen's motion on litter bins for a second time tonight at Wokingham Borough Full council. They obviously are not interested in residents views or doing the right thing.\nThey cant escape a discussion forever....\nThanks to more than 1800 residents the petition I submitted tonight, entitled save our litterbins, forces a debate so far up the agenda even the Liberals and their Labour friends cant talk it out.\nGiven that some of their executive have missed an alternative career on 'just a minute' although the leaders speech would have been buzzed up for hesitation, I have never heard him speak so slowly to get to 10:45 when we ran out of time!",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_campaigns_help-us-cut-crime-earley-and-woodley-constituency/content_53.html": "We have recruited 784 new police for Thames Valley Police. What do you want them to focus on?\nWhen this government was elected, we promised to recruit 20,000 extra police officers for the country.\nThanks to the support of people like you, we’ve now recruited every single one — including an extra 784 new police for Thames Valley, making more than 5,000 in total. And we’re working with the police to make sure that every burglary and theft is investigated and drug dealing is dealt with. So we’re making progress. But there’s more to do. And it’s important that your next MP is ready to get to work on day one.\nAs you may know, at the next general election the Parliamentary boundaries are changing. That means your area will now be in a new constituency called Earley and Woodley.\nSo I’ll be standing to be your next Conservative MP. And I’m keen to work with you so that we can hit the ground running in tackling your priorities.\nThat’s why I’m asking you to share your priorities for our new police officers.\nWhile you should still contact the current MP for official matters, I want to start working with you now on your priorities. The sooner we get to work, the bigger an impact we’ll have.\nWe can't trust Labour to be tough on crime.\nI’ll go through every survey response with my team — and I’ll discuss your answers at my next meeting with Matthew Barber our Police and Crime Commissioner.\nIt takes just sixty seconds to fill in the survey, and you can send it back using the freepost envelope provided\nLook forward to hearing your views\nPauline",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_talking-residents-maiden-erlegh/content_66.html": "Pauline and local Conservative Councillors were out in Maiden Erlegh today, we missed most of the rain and had a good chat with many Maiden Erlegh residents...now in the middle of chasing up issues they raised, namely:\n- obstructed pavements\n- litter bin debacle and the daft proposals to remove litter bins which are in use\n- car parking charges\n- road resurfacing issues",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_hong-kong-national-security-proposals-article-23/content_19.html": "This afternoon I was invited by my Hong Kong friends to visit their stall in Reading Town Centre raising awareness of the actions of the government in Hong Kong which has passed a new tough security law restricting freedom of speech in breach of the Sino-British joint declaration.\nThe Sino-British Joint Declaration promised 50 years of autonomy for Hong Kong, safeguarding its rights and freedoms. The UK, as a co-signatory, must ensure this commitment is upheld.\nHowever, recent legislative proposals by the Hong Kong government raise concerns. These include harsh penalties for speech crimes, risks to international organizations being labelled as 'foreign interference,' and vague terms threatening legitimate diplomatic activities. Lack of oversight and clarity on detention procedures are also worrying. The UK has called for reconsideration and genuine consultation with Hong Kong's people, stressing the importance of democratic legitimacy in national security legislation. The Government has said that monitoring of these developments will continue closely.\nThe full text of the Government statement can be seen here https://www.gov.uk/government/news/uk-statement-on-hong-kong-national-security-proposals",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_conservative-party-chairman-visits-earley-and-woodley/content_46.html": "As part of our regular session of insightful conversation, Lord Dominic Johnson, Conservative party Chairman, came to Sonning's Pearson Hall to talk to us and answer questions. It was a very enjoyable evening, and we also celebrated the belated New Year with a delicious lemon drizzle cake. It was good to see Dominic, who is an old friend and used to live locally. He gave us an overview of what he had found after only 8 weeks in the job and outlined what he would be doing in terms of CCHQ support and policy formulation.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_map-locations/content_34.html": "Skip to main content\nMain navigation\nHome\nAbout Pauline Jorgensen\nNews\nOur Plan\nCampaigns\nContact\nBold Voices, Real Talk: Conservatives Unfiltered\nLabour's Broken Promises\nMy map",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_events_feed/content_56.html": null,
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_category_Local-News/content_47.html": "📰 This Week in Earley and Woodley and Wokingham Borough – Cllr Pauline Jorgensen’s Update 🏡📢 1st March 2025 Holding the Lib Dems Accountable – Delivered a strong speech exposing their financial mismanagement, wasteful spending, and failure to deliver key projects... Local News\nBREAKING: Inflation Rises to 3% Under Labour! 19th February 2025 Labour Fail Labour's tax-and-spend chaos is driving up prices, hitting families hard. Inflation is now HIGHER than expected—higher than France (1.8%) and... Local News\nIssues at Oakbank School Escalated 5th February 2025 This afternoon I went to Oakbank school to listen to residents and try and see what I could do to help. I heard about classes with 70 pupils; poor teaching and... Local News\nPauline Slams Labour Betrayal on Royal Berkshire Hospital Rebuild 21st January 2025 Labour have delayed the build of a new state-of-the-art Royal Berkshire Hospital until 2035 at the earliest. This is despite Yuan Yang’s promises and assurances... Local News\nScrutiny report - Wokingham Borough Council 15th January 2025 Last night a very long (3.5 hour) overview and scrutiny management committee. I thought you might like a flavour of what we cover at these meetings First up... Local News\nPauline is still Pushing the Labour Government for Work to Commence on RBH 11th January 2025 Following news reports that a decision is close, and a conversation with the RBH project team, I can confirm that I am still pushing our Labour MP hard to... Local News\nSix months in review 3rd January 2025 Looking Back on 2024: A Year of Hard Work and Achievements As 2024 comes to a close, I’m reflecting on what we’ve achieved over just the past six months (12... Local News\nPauline meets pupils in Parliament week 19th December 2024 I was delighted to meet a group of pupils and their parents from HSS who held a debate during Parliament week. The group met in Madjeski Academy and debated... Local News\nInsightful Visit to Addington School 16th December 2024 Just back from a very interesting tour round Addington School and a chat with the Headmaster and Chair of the trust. Very very useful with clear messages to... Local News",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_shinfield-safety-boost-new-motorcycle-barrier-tackles-reckless-riding-concerns/content_21.html": "Happy to share great news from Shinfield! This morning, I received an email from a local resident expressing gratitude for the new motorcycle barrier we've installed on a community path. This is a perfect example of how we're actively responding to your concerns.\nFor too long, residents like him were troubled by youths recklessly riding motorbikes, sometimes wearing balaclavas, along this path. Your safety and peace of mind are paramount. That's why, upon hearing these concerns, whilst out on our regular street surgery, we acted swiftly.\nThis barrier is just one step towards ensuring our public spaces are safe and enjoyable for everyone. It's a testament to our commitment to listening to you and taking action. Remember, I'm here to help make Earley and Woodley a better place for all of us.\nIf you have similar concerns or suggestions, don't hesitate to get in touch. Together, we can continue to make our community a safe and pleasant place to live. #Shinfield #CommunitySafety #ListeningAndActing",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_talking-residents-fairwater-drive-woodley/content_59.html": "Pauline Jorgensen and a Conservative team were out in Woodley talking to residents with Laura Blumenthal the Conservative ward councillor. Many residents were annoyed with the massive hike in car parking charges imposed by the Liberal Democrats despite a 4,500 signature petition we presented at full council opposing the changes. Other issues we are following up on are speeding on the main road and people with unsilenced exhausts, plus a recent rash of e-scooters being ridden on pavements.",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_matthew-barber-calls-four-major-retailers-stop-sale-illegal-e-scooters/content_70.html": "Matthew Barber, Police and Crime Commissioner for Thames Valley, has written to four major retailers to ask them to reconsider the sale of e-scooters.\nMatthew Barber has written to four major retailers (Argos, Currys, Decathlon and Halfords) in an effort to prevent the sale of illegal e-scooters.\nIn his letter to retailers, Matthew Barber said: “The use of privately owned e-scooters in public places is currently illegal. E-scooters are classed as motor vehicles, requiring insurance, which is currently not available. I know that you are aware of this fact, as you include a disclaimer on your website, yet you continue to offer these products for sale.\n“Of course, I entirely accept the sale of e-scooters is perfectly legal as they could be used on private land, and indeed in due course the legal position may well change. I also appreciate as a commercial entity you are entitled, and indeed obliged to deliver profit for the business. Nevertheless, I would ask if you consider the continued sales to be consistent with being a responsible corporate citizen.\n“Approved e-scooter pilots only operate in limited areas, provide insurance, and require a driving licence. Despite your disclaimer, you are well aware that the vast majority of these products sold in your stores and online will be used illegally. This is not just a technical point of law, but also one of risk to your customers and the wider public. Encouraging the use of these vehicles leads to uninsured, unlicensed riders on our roads, often without any safety equipment such as helmets.\n“I fully understand that there is nothing to prevent you selling these products, but I would ask you to consider if it is responsible to continue to do so. No doubt, you feel the disclaimer gives you protection by having informed your customers, but we both know that this is a bureaucratic nicety. I would ask if you would be content for your children to ride an e-scooter illegally, potentially putting themselves and others at risk and urge you to reconsider your position.”",
  "https_www_paulinejorgensen_uk_/https_www_paulinejorgensen_uk_news_pauline-meets-pupils-parliament-week/content_51.html": "I was delighted to meet a group of pupils and their parents from HSS who held a debate during Parliament week. The group met in Madjeski Academy and debated topics including whether Social Media should be more controlled to reduce social pressure and bullying. We helped the teams prepare their arguments and pitches and Laura Blumenthal, Cllr Rebecca Margetts and I also provided some advice on debating and public speaking and answered questions from the audience. It was an excellent event and enjoyable to meet and chat with the pupils."
}