{
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_breakfast-clubs-launched-in-seven-hull-north-and-cottingham-schools/content_3.html": "Breakfast Clubs Launched in Seven Hull North and Cottingham Schools\n- Diana Johnson\n- Apr 23\n- 1 min read\nOn Monday the 22nd of April, Breakfast Clubs opened in seven schools in Hull North and Cottingham as part of Labour's Pilot Scheme. These will improve children's readiness to learn and life chances, whist offering parents more flexibility to work and saving them money. The Labour Government hopes to offer breakfast clubs to every school across the country and they are being piloted in 750 schools across the country at the moment including Kingswood Parks Primary, St Vincent's VC Academy, St Mary Queen of Martyrs, Endsleigh Holy Child VC Academy, St Nicholas Primary School, Thorpepark Academy and St Charles VC Academy in Hull North and Cottingham.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_blog_tags_constituency/content_13.html": "Diana Johnson MP\nFighting for everyone in Hull North and Cottingham\nHome\nAbout\nAdvice\nContact\nNewsletters\nNews\nMore",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_government-announces-funding-to-build-willowfield-school/content_19.html": "Government announces funding to build Willowfield School\n- Diana Johnson\n- Apr 1\n- 1 min read\nAlong with fellow Hull MPs, I’ve been talking to the Department for Education about Special Educational Needs provision in Hull.\nMinisters have now confirmed Government investment in 125 extra SEND school places for Hull at the new Willowfield Free School.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_nhs-dentistry-in-crisis/content_33.html": "top of page\nNHS Dentistry in Crisis\nDiana Johnson MP\n07/02/24, 00:00\nIn the House of Commons today, I raised the case of a constituent being told they would have to wait 8 years for an NHS dentist - or pay “just £74 (£39 for under 17s)\" to go private.\nI asked the Government for a dental school for Hull to train the NHS dentists we need. Watch here.\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_my-letter-to-the-foreign-secretary-about-gaza/content_26.html": "My letter to the Foreign Secretary about Gaza\nDiana Johnson MP\n15/11/23, 00:00\nPlease find a copy of my letter to the Foreign Secretary Lord David Cameron below.\nDear David,\nFirst of all, can I congratulate you on your appointment yesterday as Foreign Secretary.\nOver the last month I have been contacted by hundreds of constituents expressing their grave concerns about the developing humanitarian situation in Gaza.\nIt is very clear to everyone that Gaza is now a humanitarian emergency. The whole world has been shocked and appalled by the numbers of innocent lives lost over the last few weeks in Israel and Gaza. It is imperative that the international community do more to address the crisis – and that Britain uses its influence to be a voice for peace.\nCould you therefore please set out what the UK is doing to increase humanitarian aid to Gaza and to work with international partners to give UN agencies the long-term resources they need?\nWe all agree that Israel has a right to defend itself, like any other country, to keep its people safe and bring the more than 200 hostages still being held captive in Gaza home. However, I am sure you will agree with me that Israel’s operation must be conducted within international law. Civilians must not be targeted and innocent lives must be protected.\nCould you please set out the meetings the Government has had with Israel about ensuring all operations are conducted within international law?\nUltimately, we need a lasting peace – a political solution that lays the groundwork for a meaningful, permanent ceasefire. MPs across the House are committed to a two-state solution where Israeli citizens live free from the fear of terrorist attacks, and a future for the Palestinian people where they and their children enjoy freedoms and opportunities we take for granted.\nWhilst I am pleased by the Government’s support for a two-state solution, there needs to be far more active diplomacy and pressure from key players to achieve this. The international community has been falling short in its attention to resolving the conflict.\nCan the Government outline what practical steps it has been taking towards achieving a two-state solution?\nI look forward to hearing from you.\nYours sincerely,\nRt Hon Dame Diana Johnson",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_hull-royal-infirmary-visit/content_27.html": "top of page\nHull Royal Infirmary visit\nDiana Johnson MP\n08/05/24, 00:00\nIt was a pleasure to visit the Hull Royal Infirmary last week and meet with members of their portering team.\nIt is a testament to their hard work & dedication that they won the ‘Portering Team of the Year’ award.\nGreat to see Hull leading the way on improving efficiency\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_news-archive/content_17.html": "top of page\nNews Archive\nInfected Blood Open Letter\nThursday, 29 February 2024\nAs you know, Sir Brian Langstaff, Chair of the Infected Blood Inquiry, published his final recommendations on compensation on 5 April 2023. The report made 18 detailed recommendations on who should receive compensation and how it should be delivered. ….\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_2024-july-report-for-residents/content_25.html": "2024 July Report for ResidentsDiana JohnsonJul 31, 20241 min readPlease find below a copy of my latest newsletter.2024 Diana Johnson report July (1).pdfDownload PDF • 1.65MB",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_commemorate-sacrifice-of-forgotten-service-personnel/content_32.html": "top of page\nCommemorate sacrifice of forgotten service personnel\nDiana Johnson MP\n10/11/23, 00:00\nThe Commonwealth War Graves Commission have recovered the names of over 9,000 personnel who died serving alongside British & Commonwealth troops during WW1 but have never been commemorated by name.\nRead my article here with Philip Dunne in the House Magazine as Commissioners on the Commonwealth War Graves Commission.\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_blog/content_15.html": "top of page\nNon-contact Sexual Offences in the Crime and Policing Bill\nLibby Squire’s murder in Hull in 2019 shocked the nation. In the years since I’ve supported Lisa Squire's campaign to toughen the law on...\nDiana Johnson\n5 days ago1 min read\nMonthly Newsletter\nAs challenging as it is contending with the state of the country inherited last July, the Labour Government continued to make progress...\nDiana Johnson\nApr 2412 min read\nBreakfast Clubs Launched in Seven Hull North and Cottingham Schools\nOn Monday the 22nd of April, Breakfast Clubs opened in seven schools in Hull North and Cottingham as part of Labour's Pilot Scheme. These...\nDiana Johnson\nApr 231 min read\nThree School Based Nurseries Announced for Hull\nIt is great new that three Schools in Hull North and Cottingham are among the first to recieve funding to provide school- based...\nDiana Johnson\nApr 91 min read\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_about/content_16.html": "About Diana\nDiana has been the Labour MP for Hull North since 2005 - the first woman elected to Westminster representing a Hull seat. Since the 2024 General Election, Diana now represents the new seat of Kingston upon Hull North and Cottingham.\nFollowing Labour’s victory at that same General Election, Diana is currently the Minister of State for Policing and Crime Prevention at the Home Office.\nDiana was born in the North West of England and read Law at Queen Mary College, London University. She qualified as a Barrister and worked for many years in Community Law Centres. Before entering Parliament, Diana had served as a local councillor and as a Non-Executive Director in the NHS.\nUnder the Labour Government between 2005 and 2010 Diana was a Parliamentary Under Secretary of State in the Department of Children, Schools and Families and a Government Whip. Since 2010, Diana has held a variety of Labour Opposition Front Bench posts, including in Home Affairs, Foreign Affairs and Health.\nDiana was Chair of the Home Affairs Select Committee from December 2021 to May 2024. Alongside this, she served on the Liaison Committee and the Joint Committee on National Security Strategy. Previously Diana was a member of the Intelligence and Security Committee.\nIn addition, Diana served as a member of the Independent Commission for the Integration of Refugees and from 2019 to 2024 was one of the Parliamentary representatives on the Commonwealth War Graves Commission.\nBefore joining the Government in July 2024, Diana played an active role on the British American Parliamentary Group and has Chaired several All-Party Parliamentary Groups (APPGs). These include APPGs on Haemophilia and Contaminated Blood, Friends of the University of Hull, Human Rights, Left Behind Neighbourhoods, Sexual and Reproductive Health and Commercial Sexual Exploitation.\nDiana has a reputation of standing up for her Hull constituents at Westminster. Notable local successes include campaigning for Siemens to locate to Hull, supporting the expansion of the Hull-York Medical school, working cross-party on reducing Humber Bridge tolls, supporting Hull’s bid to be UK City of Culture 2017, and the building of a new pumping station at Bransholme after the 2007 floods.\nDiana is patron of the Hull and East Riding RSPCA, the National Civilian World War Two Memorial Trust, the Haemophilia Society and Hull and East Riding Breast Friends, a local breast cancer charity.\nDiana was named Backbencher of the Year in 2018 for her work to secure a Public Inquiry into the NHS contaminated blood scandal and in December 2023 her campaigning led to the only Commons defeat for the then government on the issue of compensation for those infected and affected. In the 2020 New Year’s Honours, Diana was appointed as a Dame Commander for her charitable and political work and in 2021 joined The Privy Council.\nWhen not out and about in Hull North and Cottingham or at Westminster, Diana is a fan of crime novels, cinema, chocolate cake, strong tea and black Labradors.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk/content_1.html": "top of page\nDIANA JOHNSON MP\nDiana Johnson has represented Hull North since May 2005 - Hull’s first female MP. Elected in 2024 for the sixth time, Diana now represents Hull North and Cottingham. Diana is currently Minister of State for Policing and Crime Prevention in the Home Office. From December 2021 to May 2024 Diana was Chair of the Commons Home Affairs Select Committee. Diana was appointed a Dame in the 2020 New Year's Honours List.\nWelcome to the website of\nSubscribe to my newsletter\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_small-business-award-winners-announced/content_22.html": "Small Business AWard Winners Announced\nDiana Johnson MP\n07/12/23, 00:00\nTo mark Small Business Saturday, Hull North MP Diana Johnson announced the result of her competition to find the best Hull North small businesses for 2023.\nOver 3,000 online votes were cast by local people from the 57-strong shortlist of independent businesses in Hull North that had been nominated in October.\nThe winners were:\n1st Place winner:\nMen Only, Beverley Road\nRunners up:\nBed Boutique, Newland Avenue\nBarleys Delicatessen, Newland Avenue\nE.K.Stitch, Cottingham Road\nFirst held in 2013, Small Business Saturday seeks to promote independent small businesses in local high streets and communities.\nHull North MP Diana Johnson said: “Congratulations to Men Only on Beverley Road for being voted by local people as my Hull North Small Business Saturday winner. Well done too to those businesses who were runners-up in a very tight contest.\n“Independent small businesses are the beating heart of our local community. They give excellent service all year round, providing choice for local shoppers and valuable jobs.\n“With the cost-of-living crisis hitting Hull hard, many of our local businesses in every part of Hull North have gone the extra mile in challenging circumstances to serve local people.”",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_asb-survey/content_6.html": "Diana Johnson MP\nFighting for everyone in Hull North and Cottingham\nHome\nAbout\nAdvice\nContact\nNewsletters\nNews\nMore\nTick here if Diana can contact you about news and campaigns by email.\nYou can opt out at any time. You can find Diana’s privacy statement on https://dianajohnson.co.uk/legal",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_homes-not-hospitals/content_31.html": "top of page\nHomes Not Hospitals\nDiana Johnson MP\n12/03/24, 00:00\nToday in Parliament I met the British Association of Social workers to hear about their Homes not Hospitals campaign.\nToo many people with learning disabilities are put into inappropriate care settings.\nI am pleased to support this campaign to ensure everyone has the right support, in the right place, at the right time.\nRead more at: https://new.basw.co.uk/about-basw/social-work-around-uk/basw-england/campaigns/homes-not-hospitals.\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_access-to-dentistry/content_29.html": "Access to dentistry\nDiana Johnson MP\n19/04/24, 00:00\nI have heard from far too many Hull North constituents who are unable to find an NHS dentist and are struggling to get the care they need.\nThe chronic underfunding of dentistry has caused a real crisis. Although I have been raising the issue of dentistry with the Government repeatedly over the past few years, we are yet to see the action needed.\nI have long been running a campaign for a new Hull-York Dental School. It is clear to me that in the longer term, developing a dental school in Hull to train our own dentists and create a bigger network of NHS dental practices locally will be essential to solving the problems we face.\nYesterday I met with the Humber and North Yorkshire Integrated Care Board, alongside Emma Hardy MP, to discuss how we can get better dentistry provision for our constituents. We discussed the possibility of a new dental school and other measures that might help to ease the crisis we have currently.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_about-hull-north-and-cottingham/content_28.html": "About Hull North and Cottingham\nThe Kingston upon Hull North and Cottingham Parliamentary Constituency was created before the 2024 General Election and covers most of the old Kingston Upon Hull North Constituency, East and West of the River Hull, and the village of Cottingham.\nThe Constituency contains the Hull local government wards of Kingswood, West Carr, Beverley and Newland, Orchard Park, University, Bricknell, Avenue and Central; plus the East Riding of Yorkshire wards of Cottingham North and Cottingham South.\nThe West of the Constituency includes the village of Cottingham, the large housing estates of North Hull, Bricknell and Orchard Park as well as the Newland, Sculcoates and Avenues areas. Beverley Road provides a central spine for the Constituency going North out of Hull City Centre.\nThe Constituency’s Southern tip includes Hull Paragon Station and Hull Royal Infirmary in Hull City Centre, while its North Western edge reaches as far as Cottingham’s Castle Hill Hospital.\nThe Northern edge of the Constituency extends through Dunswell and East of the River Hull to include parts of the Bransholme housing estate and the newer housing, shopping and leisure developments of Kingswood on the North Eastern edge of the Constituency.\nThe University of Hull is centrally located in the Constituency and the areas off Cottingham Road, Inglemire Lane, Beverley Road and Newland Avenue have a substantial student population for most of the year.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_three-school-based-nurseries-announced-for-hull/content_2.html": "Three School Based Nurseries Announced for Hull\n- Diana Johnson\n- Apr 9\n- 1 min read\nIt is great new that three Schools in Hull North and Cottingham are among the first to recieve funding to provide school- based nurseries. This is part of Labour's plans to provide families with 30 hours a week of funded childcare- giving children the best start to life. The Schools that will benefit from the scheme will be:\nSt Anthony's Voluntary Catholic Academy\nSt Mary Queen of Martyrs VC Academy\nBricknell Primary School",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_access-to-dentistry-petition/content_7.html": "Diana Johnson MP\nFighting for everyone in Hull North and Cottingham\nHome\nAbout\nAdvice\nContact\nNewsletters\nNews\nMore\nYour contact details:\nTick box if Diana can email you about campaigns and news. You can opt out at any time. Please find Diana's privacy statement here",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_2024-march-report-for-residents/content_12.html": "2024 March Report for ResidentsDiana JohnsonMar 31, 20241 min readPlease find below a copy of my latest newsletter.2024 Diana Johnson report March.pdfDownload PDF • 1.78MB",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_war-graves-week/content_24.html": "top of page\nWar Graves Week\nDiana Johnson MP\n16/05/24, 00:00\nI was honoured to lay a wreath at the Kranji War Cemetery in Singapore.\nMore than 4,000 Second World War dead are buried at Kranji, with over 24,000 names on the Singapore Memorial.\nI also attended the Parliamentary debate marking War Graves Week.\nIt is a huge privilege to be a Commonwealth War Graves commissioner on behalf of Parliament, and I pay tribute to everyone at Commonwealth War Graves who works to ensure all those who paid the ultimate sacrifice will never be forgotten.\nYou can watch my contribution here.\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_contact/content_21.html": "top of page\nContact Diana\nYou can contact Diana in any of the following ways:\nE-mail: Johnsond@parliament.uk\nWrite: Dame Diana Johnson MP, House of Commons, Westminster London SW1A 0AA\nHull Constituency Office phone number: 01482 319135\nPlease always provide your full address and postcode\nYou can also keep up to date with my work by following me on:\nFacebook: https://www.facebook.com/DianaJohnsonHullNorth\nTwitter: https://twitter.com/DianaJohnsonMP\nInstagram: dianajohnsonhull\nPlease note I do not respond to casework via social media, please contact me as above if you have an issue to raise.\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_school-of-pharmacy/content_35.html": "School of Pharmacy\nDiana Johnson MP\n16/03/24, 00:00\nSince 2015, the Humber has lost 15% of its community pharmacies. Recruitment and funding problems are leaving community pharmacy unsustainable and threatening vital health services.\nHumber MPs have written to Government Minister Andrea Leadsom, making the case for a School of Pharmacy in Hull.\nRead the letter in full below:\nMarch 2024\nDear Dame Andrea,\nWe welcome the recent introduction of the Pharmacy First scheme and pay tribute to the hard work of yourself and others to get this scheme off the ground. It is clear that this scheme will lessen GP pressures and transform easy access to treatment.\nHowever, in our area there remain significant challenges facing the pharmacy sector and we are writing to ask for your support in obtaining a school of pharmacy based at Hull University.\nSince 2015, the Humber LPC has lost 33 pharmacies - 15% of its community pharmacies.\nWorkforce shortages and recruitment issues are rapidly making community pharmacy unsustainable in the Humber.\nThere are several factors about our location and infrastructure that create challenges for the pharmacy sector and that a school of pharmacy would help to address. A large one is our geography, motorways don’t even go all of the way to Hull, York, or Grimsby. Our local people have to leave here to train, and they do not always come back.\nEven with a school of pharmacy in Huddersfield starting in 2008 and Lincoln in 2014, recruitment problems have not improved, with both of these schools mainly feeding their graduates into the West Yorkshire and Midlands areas.\nWe hope that a school of pharmacy at Hull University would aid retention locally and lay the foundations for lifelong inter professional relationships that would enable a genuinely integrated primary care team to better deliver patient services.\nWithin the last few years, an entirely new pharmacy sector has been born but without an increase in supply, that sector being pharmacists working in GP practices or PCNs. That new cohort of people were sourced from the hospital trusts and community pharmacies, further worsening an already fraught situation.\nNational workforce data shows that in 2021 the average number of pharmacists per pharmacy was 1.8 FTEs, just the following year that had fallen to 1.6 and anecdotally we imagine those numbers to be even worse in the Humber. NHS England data on unplanned closures show the ICS as a significant outlier nationally with much of the closures caused by inability to obtain locums, and get them here, with supply & demand pushing up locum rates further impacting the financial viability of community pharmacies. Something a school of pharmacy would drastically, and positively, impact.\nNationally between 2021 and 2022 the number of FTEs in community pharmacy dropped by 13% with community vacancies jumping 300% in FTE terms.\nThis has real-world impact on the ability of pharmacists to provide much needed services to the people of the Humber. When in 2023 the ability for 100hr extended opening community pharmacies to drop their hours to 72hrs came in, and it was brought in as a support measure to keep them afloat, across the Humber we lost 18 of our original 19 100hr sites. That equates to 896hrs per week of pharmacy availability lost.\nAt the same time as the Humber has been losing community pharmacies, losing pharmacists to practices and being asked to provide more services to assist primary care access, we have also seen the prescription volume rise. Between 2020 and 2023 that dispensing growth locally was 12%, with fewer pharmacies, fewer pharmacists and with more to do away from the dispensing bench and static, but eroding, funding.\nThere was a previous attempt to gain a school of pharmacy at Hull in the early 2000’s which ended in 2008 due to the global financial crash. At the time, we were within 48 hours of the school reaching the point of no return and its creation being locked in.\nThis attempt was initiated by the Hull & East Riding Pharmacy Development Group and had widespread support from the local NHS hospital trusts, the local councils, Yorkshire forward, industry, and many others including the community pharmacy employers, with Boots and Lloyds both putting funding behind their support to assist the University with developing the school, £50k each.\nA huge amount of work was done to develop the curriculum and secure student placements. All of this was done to address the workforce shortages felt at the time which, in the 16 years since, have only worsened.\nAn influx of locally qualified pharmacist would drastically improve many of these issues, help viability and drive down some costs while enabling enhanced access and delivery of much needed health services to the people of the Humber.\nWe would appreciate the chance to meet with you to further discuss these issues and the potential for creating a new School of Pharmacy.\nKind regards,\nRt Hon Dame Diana Johnson DBE MP\nMember of Parliament for Kingston upon Hull North\nRt Hon David Davis MP\nMember of Parliament for Haltemprice and Howden\nRt Hon Sir Greg Knight\nMember of Parliament for East Yorkshire\nEmma Hardy MP\nMember of Parliament for Kingston upon Hull West and Hessle\nKarl Turner MP\nMember of Parliament for Kingston upon Hull East\nMartin Vickers\nMember of Parliament for Cleethorpes\nLiz Nici MP\nMember of Parliament for Great Grimsby",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_non-contact-sexual-offences-in-the-crime-and-policing-bill/content_8.html": "Non-contact Sexual Offences in the Crime and Policing Bill\n- Diana Johnson\n- 4 days ago\n- 1 min read\nLibby Squire’s murder in Hull in 2019 shocked the nation.\nIn the years since I’ve supported Lisa Squire's campaign to toughen the law on ‘non-contact’ sex offences.\nNow our Crime and Policing Bill will make this happen. In the most recent Committee Session of the Crime and Policing Bill, Alex Davies Jones, Parliamentary Under-Secretary of State for Victims, outlined how this will work and paid tribute to the campaign by Libby's Mother Lisa Squire on this.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_newsletters/content_4.html": "Diana Johnson MP\nFighting for everyone in Hull North and Cottingham\nHome\nAbout\nAdvice\nContact\nNewsletters\nNews\nMore",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_2024-april-report-for-residents/content_10.html": "2024 April Report for ResidentsDiana JohnsonApr 30, 20241 min readPlease find below a copy of my latest newsletter.2024 Diana Johnson report April.pdfDownload PDF • 2.52MB",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_monthly-newsletter/content_11.html": "Monthly Newsletter\n- Diana Johnson\n- Apr 24\n- 12 min read\nAs challenging as it is contending with the state of the country inherited last July, the Labour Government continued to make progress over the past month. Many Bills are regularly starting their progress through Parliament, some of which I have detailed below.\nWe also had the Spring Statement on 26 March, in which the Chancellor continued the work of turning round the £22bn in-year Black Hole in public finances and facing challenges, such as on defence spending and international trade, caused by events on both sides of the Atlantic.\nThis report is a brief account of my work during March in Hull and at Westminster. I have also included wider developments at Westminster that I think may be of interest. To stay in regular touch in ‘real time’ with my Home Office, Parliamentary and Constituency work, please follow me on social media and see https://www.gov.uk/government/organisations/home-office and https://members.parliament.uk/member/1533/contributions.\nYou can find details of my work below.\nThe Bill\nAlongside the Neighbourhood Policing pledge to deliver 13,000 more police and PCSOs into our communities over the course of this Parliament, the Bill forms the centrepiece of our Safer Streets Mission to reduce serious harm and increase public confidence in policing and the criminal justice system.\nThe Bill started it passage through Parliament on 10th March with its Second Reading. This the first opportunity MPs have to debate the main principles of the Bill.\nThe House of Commons is now going through line-by-line scrutiny of the Bill – its Committee Stage. This began on 27 March with an Evidence Session. We heard from many expert witnesses and stakeholders with an interest in the Bill.\nThese included the National Police Chiefs Council; the Police Superintendents Association of England and Wales; the Police Federation of England and Wales; the USDAW union; the Co-op; British Retail Consortium; the Victims’ Commissioner; the Suzy Lamplugh Trust; Action for Children; the Internet Watch Foundation; the Spike Aware campaign against spiking; the Local Government Association; the Association of Police and Crime Commissioners; the National Farmers Union; and senior lawyers.\nIn the later part of the day, I even appeared as a witness as one of the Home Office Ministers piloting the Bill through Parliament.\nThe Bill Committee of MPs from both sides of the House will now be going through the Bill on Tuesday and Thursday morning and afternoon each week, apart from during the Commons Easter Recess, up to 13 May.\nThese sessions can be followed live at https://www.parliamentlive.tv/Commons.\nWhat will the Crime and Policing Bill do?\nThe Crime and Policing Bill contains the biggest, boldest and most ambitious package of measures on crime and policing for decades, with 50 new laws to cut crime, protect our communities and make our streets safer.\nThis includes:\nTackling the blight of anti-social behaviour that we have seen locally causing misery across different parts of Hull North and Cottingham by introducing tough new Respect Orders for over-18s. My recent crime and anti-social behaviour survey in Central, West Carr, Kingswood and Cottingham, has confirmed that anti-social behaviour is an everyday problem for many constituents.\nGiving Police more powers to seize vehicles such as off-road bikes. In recent years we have seen the misery that their anti-social use causes, from Orchard Park and the North Hull Estate through to Kingswood and Bransholme.\nTaking forward the new Government’s aim of halving knife crime in a decade. Knife Crime is a major national concern, with many lives lost and ruined. The Bill contains new powers to seize, retain and destroy bladed articles found on private property, increases the maximum penalty for the sale of dangerous weapons to under-18s and creates a new criminal offence of possessing a bladed article with the intent to cause harm. We are also introducing Ronan’s Law in honour of Ronan Kanda who was 16 when he was tragically killed with a ninja sword in 2022 in a case of mistaken identity near his home in Wolverhampton. The weapon had been bought online and we are introducing a range of new laws on the online sale of knives, including stronger age verification checks.\nProtecting shopworkers by introducing a new standalone offence for assaulting a retail worker. In Hull we have seen horrific cases such as that of Navin Sharda in Beverley Road – see https://www.bbc.co.uk/news/articles/cj91y0nmlelo. The Bill also undoes changes made under the previous government that made shop theft of goods worth below £200 a summary-only offence, meaning that much shop theft was regarded as less serious and often not investigated by police. The new Government is sending a clear message that any level of shop theft will be taken seriously.\nProtecting adults and children with a range of measures on children’s safety and child’s sexual abuse and exploitation, implementing the recommendations of the Independent Inquiry into Child Sexual Abuse (IICSA).\nTaking forward the Government’s aim of halving violence against women and girls within a decade, there are new measures to tackle spiking, stalking and consent. This follows recent Government action to start putting rape and domestic abuse specialists into every 999 control room.\nGiving the Police new powers to tackle serious organised crime, including economic crime and fraud – a growing area of crime in recent years.\nIntroducing new public order and safety powers. This includes clamping down on the possession of fireworks, flares and other pyrotechnics at protests, powers to ban use of face coverings to conceal identity at specific protests and action to protect war memorials from vandalism.\nReforming the Independent Officer of Police Conduct’s (IOPC) investigative processes to improve the timeliness and fairness of police misconduct investigations. This is an important aspect of restoring public confidence in policing following the scandals of recent years.\nThe progress of the Crime and Policing Bill can be followed at https://bills.parliament.uk/bills/3938 and Bill Committee sessions watched at https://www.parliamentlive.tv/Commons.\nOther work as a Minister\nAside from work on the Bill, I also attended many meetings and events in my Policing Minister capacity during March.\nThis included meeting the Home Office Special Constabulary Network to discuss the important work of Special Constables. I also discussed with Police Chaplains at a meeting in March the valuable support they give to frontline officers.\nOn 17 March, I visited Wembley Stadium before the Carabao Cup Final to see the Met’s policing operation in action at one of our major sporting events, keeping fans and the wider public safe.\nIt was a pleasure too to visit those involved in the national charity Neighbourhood Watch in Vauxhall. I also attended the annual dinner of the Community Security Trust who help protect the UK’s Jewish community from racist attacks.\nIn the Commons during March, aside from the Bill Committee, I was on the Government Front Bench for Home Office Oral Questions on 31 March, answering a range of questions from MPs on issues such as violence against shopworkers, live facial recognition and rural crime.\nI also represented the Government in a number of Parliamentary debates. The topics of these included the use of stop and search powers, anti-social behaviour and the misuse of off-road bikes that the Government is clamping down on in the Crime and Policing Bill.\nAt the start of March, I was in Sheffield to participate, as Policing Minister, at the Yorkshire and Humber Labour regional conference’s panel on crime and anti-social behaviour.\nThe work of change\nIn March we had the Spring Statement from the Chancellor and the statement from the Work and Pensions Secretary about the Green Paper on welfare reform.\nThe Chancellor’s Spring Statement on 26 March sought to build on the changes announced in last October’s Budget to bring stability to the economy, put public finances on a sustainable footing and set the conditions for economic growth and the decade of national renewal that we certainly need around the Humber.\nWith public debt max-ed out and the highest overall tax burden in 70 years left by the previous government, only a growing economy can deliver the better public services we need and reverse the decline in living standards that happened from 2010.\nGiven the £22bn in-year Black Hole in public finances left by the previous government and the uncertainty on transatlantic trade as we awaited President Trump’s ‘Liberation Day’ announcement on tariffs, bringing change will clearly be challenging. Tough choices are having to be made, but progress is being made.\nThis includes:\n· Interest rates being cut three times,\n· NHS waiting lists going down for five months in a row\n· A pay rise for three million workers.\nAs promised, the Spring Statement did not contain any further tax increases for April 2025, following those announced last October. However, when working people are still struggling with the cost-of-living crisis, it cannot be right that others are still evading and avoiding what they rightly owe in tax. That is why further action was announced to cut down on tax evasion – to raise a further £1bn.\nThe new Government has begun to fundamentally reform the British state, driving efficiency and productivity. We are reducing the costs of running government by 15% by the end of the decade. There will be £3.25bn of investment to deliver the reforms that our public services need, through a new Transformation Fund.\nOverall, day-to-day spending will grow by an average of 1.2% a year, compared to the 1.3% forecast in the Autumn. In the Spending Review Period, apart from the reduction in overseas aid to redirect an extra £2.2bn of funding to necessary increases in defence spending, day-to-day spending across government has been fully protected. This additional defence investment is not just about increasing our national security, but strengthening our economic security and industrial base.\nWe are pursuing the most ambitious set of planning reforms in decades to get Britain building, alongside the Government action to promote private investment that started last October with the £63bn secured in the record-breaking International Investment Summit.\nThe Office for Budget Responsibility (OBR) have concluded that these reforms will boost growth to the tune of an additional £15.1bn in our economy within the next ten years. As a result of these changes, living standards will rise twice as fast in this Parliament compared to the last.\nWelfare Reform\nAhead of the Spring Statement, on 18 March the Secretary of State for the Department for Work and Pensions (DWP) set out a welfare reform package in her Green Paper.\nThe Government believes that those who can work, should work; and that those who genuinely cannot should be supported. We inherited a broken social security system - with one in eight young people, nearly a million nationally, not in employment, education or training (the NEETs). This represents a massive loss of potential economic growth and a waste of talent – not least in places such as Hull.\nSince the COVID pandemic total spending on incapacity and disability benefits for working-age adults has soared from around £30 billion to around £50 billion, an increase of almost two-thirds. This is unsustainable.\nThe OBR estimate that the package announced will save £4.8bn in the welfare budget, liberating resources to invest £1.4bn into programmes that help people back to work. Our investment in cutting NHS waiting lists and in childcare is also of vital importance in supporting people off welfare and into work that pays.\nThe welfare reform measures announced include:\nAn additional £1 billion a year for work, health, and skills support through a new “Pathways to Work” offer. This is one of the largest ever investments in support to increase opportunities to work for sick and disabled people. Building on existing provision, this will create a pathway to work, unlike now when so many are left on the scrapheap with no support.\nRebalancing payments in Universal Credit to address perverse incentives and protect those with the most severe conditions.\nScrapping the Work Capability Assessment (WCA) entirely – it's failing people, unhelpfully labelling them as either ‘can’ or ‘can’t’ work, when the reality is that health conditions fluctuate, and many want support to work.\nShift the balance towards more of benefits reassessments being face-to-face, while stopping them for those who will never be able to work.\nI know that some of the detail of welfare changes will be controversial and subject to discussion in coming months.\nOther Government Bills\nMeanwhile at Westminster during March, a number of other Government Bills were still going through their Parliamentary stages.\nThese include the Children’s and Wellbeing Bill, with its various measures on breakfast clubs, school uniform costs and safeguarding measures; the Planning and Infrastructure Bill, and its range of measures to get Britain building and support economic growth; the Tobacco and Vapes Bill, to move forward the public health gains from ending smoking addiction; and the National Minimum Wage (Amendment) Regulation 2025.\nAs a result of this, April began with three million workers getting an increase in the National Minimum Wage – helping to make work pay and benefiting 320,000 workers across the Yorkshire and Humber region.\nHowever, I would draw attention to a few key highlights. I am pleased to report that the Water (Special Measures) Bill became law – an Act of Parliament – during March. This strengthens the ability of the Environment Agency to bring criminal charges against executives of water companies, bans the payment of bonuses to executives of water companies and we hope this Act will mark a step forward in starting to clean up our waterways.\nAmong Bills that will become law soon is the Employment Rights Bill. This upgrades protections against unfair dismissal, boosts sick pay, ends the misuse of zero hours contracts and bans fire and rehire. We all remember the mass dismissal of British workers by P&O Ferries in Hull a few years ago.\nThe progress of all Government Bills can be followed at https://bills.parliament.uk.\nSisters Act\nAs the first woman ever to represent Hull in the House of Commons, I always make it a priority each year to engage fully in events in Hull and at Westminster around International Women’s Day (IWD) on 8 March. This year was no exception.\nIn Hull, I spoke on the IWD panel at the Wilberforce Institute on the theme of life for women in Hull. I took part in a Wyke College IWD event held on the theme of what it’s like to be a woman in politics, sharing my experiences and answering questions from students who were clearly keen to get involved in politics.\nIt was also a pleasure to be out in the early Spring sunshine to join my second ‘Headscarf Hustle’ walk across the Humber Bridge. This is part of the ongoing fundraising campaign for a fitting memorial in Hull to the Headscarf Revolutionaries – the women whose campaign in 1968 led to safety improvements on the trawlers.\nIn Westminster, I was honoured to be named again this year as one of the 100 most influential Women in Westminster for 2025 by the House Magazine. It's a privilege to be included alongside so many inspiring women working in many roles in Parliament, Whitehall, the media, thinktanks and the unions.\nOne aspect of IWD is highlighting women’s health issues and I met the ‘Coppafeel’ charity in Parliament to learn more about their important work raising awareness of the signs and symptoms of breast cancer. Checking for breast cancer is vital – it saves lives. See more information at https://coppafeel.org.\nInvesting in Hull and the Humber\nIn March I took part in a number of other events in or near the constituency on issues that hold the key to our region’s future.\nOn 21 March, it was a pleasure to speak at Future Humber’s business event at Hull Truck. I outlined the key role of the Humber Energy Estuary in kickstarting UK economic growth and achieving Net Zero. Much has been achieved in the decade since we attracted the Siemens wind turbine factory to Hull, but I set out the argument that we need to go much further to transform our regional economy so that the Humber can make the contribution that we need to in order to help boost UK economic growth.\nI highlighted the potential of the ‘M62 Growth Corridor’ across Northern England – but pointed out that developing this potential depends on getting investment, blocked under the previous government, in improving our infrastructure, especially our transport connectivity.\nAlong with Emma Hardy MP and Energy Secretary, the Rt Hon Ed Miliband, I took part in an event organised by Hull and Humber Chamber of Commerce to host potential investors in the green energy sector, carbon capture and other green initiatives around the Humber Estuary.\nThere is the potential of unlocking some £15bn of private investment for the Net Zero projects in our region - subject to a number of decisions happening in Whitehall. The problem of our creaking transport infrastructure across the North holding back growth and productivity was also raised at this event.\nThe Prime Minister came personally to Yorkshire on 28 March to announce £1.7bn of new transport investment this year, with more than double as much money per head on local transport in North than the South coming under the new Government. However, the long-running cross-party campaign for Hull rail electrification will need to continue until this investment is finally confirmed - as part of the high-speed upgrade of the rail network across the North.\nAnother notable constituency event I attended during March was the opening of the new Changing Futures Hub in Beverley Road. This Hub brings local services together to improve outcomes for adults with multiple problems such as homelessness, addiction, mental health, domestic abuse and contact with the criminal justice system. This is exactly the sort of ‘joined up’ working we need in improving our public services.\nAs well as my work around the constituency, it is always a pleasure to meet Hull North and Cottingham people when they visit Westminster. One such visit in March was from Adam Loubani, promoting National Supported Internships Day. These supported internships provide pathways into jobs for people with learning disabilities, autism and neurodiversity. Adam completed one such internship and it was great to hear that he is now doing well in his career.\nGovernment announcements for Hull North and Cottingham\nThe shortage of Special Educational Needs (SEND) provision in Hull is a serious issue that Hull MPs have been discussing with Education Ministers in the new Government since last Autumn. I was pleased in late March to receive news that central government funding has been confirmed for the long-planned new SEND school at Willowfield, off Endike Lane.\nWe also had the good news at the start of April that three schools in Hull North and Cottingham are in the first wave of those receiving new Government investment to provide school-based nurseries. These are at St Anthony’s Voluntary Catholic Academy, St Mary Queen of Martyrs VC Academy and Bricknell Primary School.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_infected-blood-open-letter/content_34.html": "Infected Blood Open Letter\nDiana Johnson MP\n29/02/24, 00:00\nDame Diana Johnson MP & Sir Peter Bottomley MP\nCo-chairs, APPG on Haemophilia and Contaminated Blood\nHouse of Commons\nLondon\nSW1A 0AA\nRt Hon Jeremy Hunt MP\nChancellor of the Exchequer\n1 Horse Guards Road\nWestminster\nLondon\nSW1A 2HQ\nSent by email Thursday 29th February\nDear Chancellor,\nAhead of next week’s Budget, we are writing to seek assurance that you are planning to announce the allocation of sufficient funds to deliver full compensation to victims of the infected blood scandal, in line with the recommendations of the Infected Blood Inquiry.\nAs you know, Sir Brian Langstaff, Chair of the Infected Blood Inquiry, published his final recommendations on compensation on 5 April 2023. The report made 18 detailed recommendations on who should receive compensation and how it should be delivered. In particular, Sir Brian stated that interim compensation payments should be extended to bereaved parents and children.\nYou will recall that in July 2022 you signed a letter with Rt Hon Matt Hancock MP and Rt Hon Andy Burnham calling on the Government to make the initial tranche of interim payments. You said at the time, “We should do it right away. We’ve waited far too long. Successive governments, which I was part of one, didn’t act as quickly as they should have and we need to recognise this as a terrible, terrible injustice.”[1] We agree – and we hope that you will now apply the same sense of urgency to children who lost parents, and parents who lost children.\nFurthermore, the Commons voted in December 2023 to move forward with full compensation for those infected and affected by the contaminated blood scandal by establishing an Arms Length Body, as recommended by Sir Brian. We now understand that the Government plan to respect the vote by Members from both sides of the House and are taking steps in the Lords to make sure the Victims and Prisoners Bill covers the whole of the United Kingdom.\nGiven that Government have had the recommendations of the Infected Blood Inquiry on compensation for over 10 months, we understand that preparations for its delivery should be at an advanced stage. We therefore look forward to you announcing on 6 March the allocation of funds to fully compensate victims of the infected blood scandal – the biggest treatment disaster in the history of the NHS.\nWe also ask you to provide reassurance in advance of the Budget to all those infected and affected by this appalling scandal that your Statement will explicitly address the contaminated blood scandal and enable the urgent delivery of compensation.\nYours sincerely,\nDame Diana Johnson MP Sir Peter Bottomley MP\nCo-chairs of the All-Party Parliamentary Group on Haemophilia and Contaminated Blood\n[1] Ex-health secretaries call for immediate payouts to UK blood scandal victims | Contaminated blood scandal | The Guardian: https://www.theguardian.com/uk-news/2022/jul/30/infected-blood-uk-government-urged-to-compensate-victims-immediately\nSupported by:\nDiane Abbott MP\nDebbie Abrahams MP\nDr Rosena Allin-Khan MP\nPaula Barker MP\nRt Hon Dame Margaret Beckett MP\nClive Betts\nPaul Blomfield MP\nSteven Bonnar MP\nRt Hon Sir Ben Bradshaw MP\nDeidre Brock MP\nAlan Brown MP\nRt Hon Nick Brown MP\nRt Hon Robert Buckland KC MP\nRichard Burgon MP\nDawn Butler MP\nIan Byrne MP\nRt Hon Liam Byrne MP\nDan Carden MP\nSarah Champion MP\nDouglas Chapman MP\nJoanna Cherry KC MP\nRt Hon Greg Clark MP\nDaisy Cooper MP\nRt Hon Jeremy Corbyn MP\nNeil Coyle MP\nStella Creasy MP\nTracey Crouch MP\nJudith Cummins MP\nRt Hon Sir David Davis MP\nMarsha De Cordova MP\nJonathan Djanogly MP\nAllan Dorans MP\nPeter Dowd MP\nRosie Duffield MP\nDame Angela Eagle MP\nColum Eastwood MP\nSarah Edwards MP\nClive Efford MP\nJulie Elliott MP\nTim Farron MP\nStephen Farry MP\nMarion Fellows MP\nYvonne Fovargue CBE MP\nMary Kelly Foy MP\nBarry Gardiner MP\nPatricia Gibson MP\nPaul Girvan MP\nPeter Grant MP\nFabian Hamilton MP\nPaulette Hamilton MP\nClaire Hanna MP\nRt Hon Harriet Harman MP\nCarolyn Harris MP\nRt Hon Sir Oliver Heald MP\nSir Mark Hendrick MP\nDame Meg Hillier MP\nWera Hobhouse MP\nDame Margaret Hodge MP\nSharon Hodgson MP\nKate Hollern MP\nAdam Holloway MP\nRachel Hopkins MP\nRt Hon Sir George Howarth MP\nDr Rupa Huq MP\nChristine Jardine MP\nDame Andrea Jenkyns MP\nKim Johnson MP\nBen Lake MP\nIan Lavery MP\nEmma Lewell-Buck MP\nClive Lewis MP\nRebecca Long Bailey MP\nTim Loughton MP\nCaroline Lucas MP\nKenny MacAskill MP\nAngus MacNeil MP\nRachael Maskell MP\nJason McCartney MP\nDame Siobhain McDonagh MP\nAndy McDonald MP\nStewart McDonald MP\nRt Hon John McDonnell MP\nAnne McLaughlin MP\nGrahame Morris MP\nAnne Marie Morris MP\nCharlotte Nichols MP\nRt Hon Caroline Nokes MP\nKate Osamor MP\nKate Osborne MP\nKirsten Oswald MP\nSarah Owen MP\nJess Phillips MP\nDr Dan Poulter MP\nYasmin Qureshi MP\nChristina Rees MP\nBell Ribeiro-Addy MP\nMarie Rimmer MP\nLloyd Russell-Moyle MP\nJim Shannon MP\nAndy Slaughter MP\nCat Smith MP\nRt Hon Chloe Smith MP\nAlex Sobel MP\nRt Hon John Spellar MP\nChris Stephens MP\nGraham Stringer MP\nZarah Sultana MP\nAlison Thewliss MP\nRt Hon Sir Stephen Timms MP\nDerek Twigg MP\nRt Hon Valerie Vaz MP\n<p style=\"margin:0cm;font-size:15px;font-fami",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_arrange-an-appointment/content_14.html": "Diana Johnson MP\nFighting for everyone in Hull North and Cottingham\nHome\nAbout\nAdvice\nContact\nNewsletters\nNews\nMore\nYour contact details\nTick here if you would like Diana to update you about campaigns and news",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_import-646_hull-'devolution'/content_18.html": "top of page\nHull 'Devolution'\nDiana Johnson MP\n23/11/23, 00:00\nIn House of Commons Business Questions today, I pointed out that Whitehall's over-hyped Hull 'Devolution' Deal, announced in the Autumn Statement, goes nowhere near even replacing the Government funding cut from Hull since 2010.\nClick here to watch.\nClick here to watch.\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_blog_tags_newsletter/content_23.html": "Diana Johnson MP\nFighting for everyone in Hull North and Cottingham\nHome\nAbout\nAdvice\nContact\nNewsletters\nNews\nMore",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_blog_tags_news/content_30.html": "Diana Johnson MP\nFighting for everyone in Hull North and Cottingham\nHome\nAbout\nAdvice\nContact\nNewsletters\nNews\nMore",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_legal/content_20.html": "top of page\nPrivacy\nLegal information and privacy\nPrivacy statement\nPersonal data\nUnder the EU's General Data Protection Regulation (GDPR) personal data is defined as:\n\"any information relating to an identified or identifiable natural person ('data subject'); an identifiable natural person is one who can be identified, directly or indirectly, in particular by reference to an identifier such as a name, an identification number, location data, an online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity of that natural person\".\nHow we use your information\nThis privacy notice tells you how Diana Johnson MP's office will collect and use your personal data.\nWhy does Diana Johnson MP need to collect and store personal data?\nIn order for us to deal with casework for constituents and to keep residents updated about campaigns and local issues we need to collect personal data. We are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nThe lawful basis for processing casework data has been identified as public interest.\nIn terms of being contacted for marketing purposes/campaigning Diana Johnson MP's office would contact you for additional consent.\nWill Diana Johnson MP's office share my personal data with anyone else?\nWe may pass your personal data on to third-party service providers in the course of dealing with you, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the purpose they were provided. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures. If we wish to pass your special categories of personal data to a third party we will only do so once we have obtained your consent, unless we are legally required to do otherwise.\nDiana Johnson MP's office contracts third parties to undertake work that involves our data: casework software maintenance, data entry, website hosting and maintenance, email management software and shredding. Our contractors are either EU based or based in countries deemed \"adequate\" by the EU for data protection terms. In all cases contractors and sub-contractors have signed contracts which guarantee that appropriate technical and organisational measures are in place to protect the data.\nPersonal Data and the website of Diana Johnson MP\nOur website uses Google Analytics to track our visitors. This process uses Cookies to recognise returning visitors. For full terms of the Google Analytics process see http://www.google.com/analytics/en-GB/tos.html.\nCookie\nA cookie is a tiny text file that is stored on your computer. We may use cookies in order to tailor your experience on our site according to the preferences you have specified.\nHow will Diana Johnson MP's office use the personal data it collects about me?\nDiana Johnson MP's office will process (collect, store and use) the information you provide in a manner compatible with the EU's General Data Protection Regulation (GDPR). We will endeavour to keep your information accurate and up to date, and not keep it for longer than is necessary. Diana Johnson MP's office is required to retain information in accordance with the law, such as information needed for income tax and audit purposes. How long certain kinds of personal data should be kept may also be governed by specific requirements and agreed practices. Personal data may be held in addition to these periods depending on individual needs.\nUnder what circumstances will Diana Johnson MP's office contact me?\nIn order to process casework it may be necessary to contact you in order to get further information from you or to feedback any responses we receive.\nIf you have provided consent to be contacted about local campaigns and news we will contact you when required. You will always have the option of withdrawing consent.\nCan I find out the personal data that the Diana Johnson MP's office holds about me?\nAt your request, Diana Johnson MP's office can confirm what information we hold about you and how it is processed. If Diana Johnson MP's office does hold personal data about you, you can request the following information:\n- Our identity and the contact details.\n- Contact details of the data protection officer.\n- The purpose of the processing as well as the legal basis for processing.\n- If the processing is based on the legitimate interests of Diana Johnson MP's office or a third party, information about those interests.\n- The categories of personal data collected, stored and processed.\n- Recipient(s) or categories of recipients that the data is/will be disclosed to.\n- If we intend to transfer the personal data to a third country or international organisation, information about how we ensure this is done securely. The EU has approved sending personal data to some countries because they meet a minimum standard of data protection. In other cases, we will ensure there are specific measures in place to secure your information.\n- How long the data will be stored.\n- Details of your rights to correct, erase, restrict or object to such processing.\n- Information about your right to withdraw consent at any time.\n- How to lodge a complaint with the supervisory authority.\n- Whether the provision of personal data is a statutory or contractual requirement, or a requirement necessary to enter into a contract, as well as whether you are obliged to provide the personal data and the possible consequences of failing to provide such data.\n- The source of personal data if it wasn't collected directly from you.\n- Any details and information of automated decision making, such as profiling, and any meaningful information about the logic involved, as well as the significance and expected consequences of such processing.\nContact the data controller Diana Johnson MP by using the details listed below.\nWhat forms of ID will I need to provide in order to access this?\nDiana Johnson MP's office accepts the following forms of ID when information on your personal data is requested: passport or driving licence.\nContact details of the Data Controller\nContact Name:\nDiana Johnson MP\nAddress:\nHouse of Commons\nLondon\nSW1A 0AA\nEmail:\njohnsond@parliament.uk\nTelephone:\n020 7219 5647\nHow to make a complaint\nIn the event that you wish to make a complaint about how your personal data is being processed by Diana Johnson MP Office (or third parties as described in 3.4 above), or how your complaint has been handled, you have the right to lodge a complaint directly with the supervisory authority and Diana Johnson MP (the data controller).\nThe details for each of these contacts are:\nSupervisory authority contact details\nInformation Commisioner;s Office\nAddress:\nWycliffe House\nWater Lane\nWilmslow\nSK9 5AF\nWebsite:\nhttps://ico.org.uk\nTelephone:\n01625545745\nbottom of page",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_post_future-humber-roundtable-event/content_5.html": "Future Humber Roundtable Event\n- Diana Johnson\n- Mar 26\n- 1 min read\nIt was a pleasure to speak at the Future Humber roundtable event on Friday at Hull Truck Theatre. I outlined the key role of the Humber Energy Estuary in kickstarting UK economic growth, achieving Net Zero and the potential of the ‘M62 Growth Corridor’ across Northern England.",
  "https_www_dianajohnson_co_uk_/https_www_dianajohnson_co_uk_advice/content_9.html": "Can I Help\nAs your MP, I represent everyone who lives in Hull North and Cottingham.\nI am always happy to help constituents who need assistance in dealing with Government departments, such as the DWP or the Home Office. However there are some things MPs cannot do, such as give legal advice or secure preferential treatment for constituents.\nYou can find out more about what an MP can and cannot do here: https://www.parliament.uk/get-involved/contact-an-mp-or-lord/contact-your-mp/.\nMuch of the time my small team in Hull can help you with any issues. But if you do need to speak to me my team will be happy to book an appointment on the\nphone or online, whichever you prefer.\nPlease note that MPs can only respond to those living within their constituencies, so please provide your full name, address including postcode and telephone number.\nAs your Member of Parliament, I am not part of Hull City Council or the East Riding Yorkshire Council and am not responsible for their actions.\nIf your problem is about council services, such as bin collections, in the first instance you should contact your Ward Councillors. You can find your local Councillors’ contact details in the following ways:\nFor Hull City Council:\n• Call: 01482 300300\n• Visit: www.writetothem.com\n• Visit: Hull City Council website\nhttp://www.hull.gov.uk/council-and-democracy/councillors/your-councillors.\nFor the East Riding of Yorkshire:\n• Call 01482 393939\n• Visit: www.writetothem.com\n• Visit: East Riding of Yorkshire council website"
}