{
  "http_www_elizabethtruss_com_/http_www_elizabethtruss_com/content_1.html": "Ten Years to Save the West is now out in paperback, including new chapters reflecting on why the Conservatives lost the general election and how the right must now regroup.\nIn Ten Years to Save the West, Truss, who as Prime Minister sought to champion limited government and individual freedom, argues that the rise of authoritarianism around the world and the adoption of fashionable ideas propagated by the global left give us barely a decade to preserve the economic and cultural freedom and institutions that the West holds so dear.\nPeppered with newsworthy anecdotes from Truss’s time in public life – such as her memorable last meeting with Queen Elizabeth II, her challenges to Vladimir Putin and Xi Jinping as Foreign Secretary, her encounters with the Trump administration as Trade Secretary, and her dismay at the political class’s attempt to betray Brexit – Ten Years to Save the West also offers a timely warning about the perils facing conservatism in the years ahead.\nIn it, Truss warns that too many of her fellow conservatives have allowed themselves to be captured by the left-wing influences that set the agenda and frame the debate in so many institutions from the media to academia and the corporate world.\nShe also calls for a return to the alliances built by leaders such as Reagan, Thatcher and others in another era when Western values were under siege. Only if the West recommits to building both strong societies and strong economies, unhampered by big government and regulation, Truss argues, can we guarantee voters a free and meaningful choice in their destiny.\nLiz served as the 56th Prime Minister of the United Kingdom and continuously held ministerial office for more than ten years between 2012 and 2022.\nThe paperback edition of Liz Truss’ Sunday Times Bestseller, Ten Years to Save the West, is out now. This updated edition includes new chapters reflecting on why the Conservatives lost the general election and how the right must now regroup."
}