{
  "http_www_semmoema_london_/http_www_semmoema_london/content_1.html": "Home\nSupporters\nContact\nFind campaign events\nSelect Page\nFollow\nFollow\nFollow\nSem Moema website upgrade\nThings are happening behind the scenes!\nMORE SOON",
  "http_www_semmoema_london_/http_www_semmoema_london_elementor-15_contact/content_2.html": "Got a question about me or my campaign? Fill out the form below, and I’ll get back to you as soon as I can!",
  "http_www_semmoema_london_/http_www_semmoema_london_supporters/content_3.html": "“I’m Meg Hillier and I’m currently the Member of Parliament for Hackney South and Shoreditch but I was previously Mayor of Islington and I represented Islington on the London Assembly.\nI’m backing Sem Moema to do the same job on the London Assembly that I did because she’s a doughty campaigner and a woman who knows how to put her ideas into action. She’s been a huge champion for private renters’ rights and not just championing them but delivering where she’s a cabinet member, in Hackney. I know that, if she gets to City Hall, she knows how to push for delivery, not just words.\nSo, back Sem Moema for the London Assembly.”\n“I’m really passionate about this community and I really care about its future. I’ve seen, over the past years, the difference that the London Assembly and the London Mayor can make. That’s why it’s really important that whoever we choose to succeed Jennette Arnold understands the issues in this area. And that’s why I’m backing Sem Moema to be our next London Assembly representative. I’ve worked with Sem on housing issues over the years, so I know she gets the housing crisis that we have here but, like me, she’s also really passionate about tackling knife crime and making sure that we hold TfL to account so that we get the trains and buses that we need in our area. She’ll also help to tackle the climate change that we increasingly know is testing our city. I hope you will give her support too when it comes to selecting your next GLA member. ”\n“I’m endorsing Sem Moema as our Labour candidate for North East London. We need a campaigner who’s committed to going to City Hall and fighting for us. Fighting for us on air quality, on private renter’s rights or making sure we deliver the real council housing that we need. And also that we continue to tackle gun and knife crime here in our capital.\nWe aren’t going to do that without people like Sem standing with Sadiq Khan in May’s election and we need to make sure that she is our candidate for North East London.”\n“Housing remains the top issue for Londoners and it is important that we have a committed campaigner working with our excellent Labour Mayor and the team of Labour Assembly Members.\nI know that Sem has the experience to address this, along with the Tory hostile environment that has impacted so profoundly on multiple BAME communities.\nSem will be a great Labour Assembly Member.”\n“I have known Sem Moema for about 10 years, her practical approach, and willingness to listen to residents problems set her apart from the other candidates. I am writing to endorse her candidacy for the London Assembly. It’s my intention to vote for her and spread the word about her abilities and competence.”\n“I first met Sem when I was the youth officer for my local CLP. And the support and encouragement that she gave me and that sense of empowerment to carry out that task, and put on events to engage with our young members was really appreciated and really beneficial and just goes to show Sem’s commitment to developing young people, her passion and her determination to ensure that all voices, however marginalised are heard. And that’s why I want Sem to represent the North East in the London Assembly.”"
}