{
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-nottingham-east/content_55.html": "Labour members in Nottingham East CLP have backed Claire Ward for East Midlands Mayor.\nThis means that all three Nottingham CLPs have declared their support for Claire’s campaign. Earlier in the day, the city council Labour Group also endorsed Claire for Mayor.\nClaire said: “I’m incredibly humbled to have been backed by this huge constituency party, both in size and ambition. That now means every CLP in Nottingham is supporting my Mayoral bid.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_glossops-bus-pass-campaign/content_39.html": "I’m hugely supportive of a campaign calling for cheaper bus passes for 16 to 18-year-olds in High Peak.\nParents have highlighted frustrations that young people over the border in Manchester are able to access cheaper fares to travel to college, whilst those who travel from inside the Derbyshire border cannot access the same support.\nI will be speaking at a public meeting at Glossop Labour Club this Saturday (September 30th) at 9.30am, alongside Labour’s parliamentary candidate for High Peak Jon Pearce and Councillor Damien Greenhalgh (Glossop and Charlesworth). If I’m elected East Midlands Mayor next May, I would work to solve the issue once and for all.\nI have already raised this campaign with Greater Manchester’s Andy Burnham, and we’ll take this forward together with the families.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_gedling-councillor-backs-claire/content_59.html": "As well as being councillor for Daybrook Ward in Gedling, Kyle Robinson-Payne is a dedicated trade unionist and volunteer.\nKyle said: “Claire is an energetic campaigner; I’ve seen it first hand on the doors in Gedling. The new Mayor will have a huge job of starting from scratch and I know that Claire has the vision and drive to make it happen. She will be a great Labour Mayor.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-high-peak-clp/content_63.html": "Yet another constituency Labour party have chosen to nominate Claire Ward for East Midlands Mayor, as members in High Peak have backed her vision for Derbyshire and Nottinghamshire.\nClaire said: “Rural communities have been starved of investment, and I’m acutely aware of High Peak’s difficult position on the periphery of the region. That’s why I’m so grateful that they trust me to fight their corner.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_our-vision/content_5.html": "A Connected Vision for the Future\nAs your Labour candidate for East Midlands Mayor, I see a future where our communities are more connected, our economy is thriving, where every person has the opportunity to succeed and a region that leads the way in innovation, sustainability, and cultural richness.\nTogether, we can build a future that offers better jobs, affordable homes, and a healthier environment for all. It’s about more than just policies; it’s about building a future for our children, supporting our businesses to innovate and grow, and ensuring everyone has the chance to live a fulfilling life. As Mayor I will be dedicated to make this a reality.\nTo achieve this, our actions must be purposeful, connected and see the bigger picture. We’ll need to work together, cross political divides, explore new ideas and put in the effort.\nThese visions aren’t just dreams; they’re my commitments to you and to our future. With your support, we can make the East Midlands a place where everyone has the opportunity to thrive. Vote for me, Claire Ward, and let’s build a brighter future together.\nGet a grip of our roads, buses and trains\nI will deliver bus, rail and roads to make travelling easier and cheaper.\nInvest in quality road resurfacing and work with councils to fill those potholes.\nWork with bus companies to increase services and routes. If no progress is made we will take them back into public control.\nIntroduce integrated ticketing, tap-and-go and fare caps across the region.\nSupport active travel to get more people walking and cycling.\nRoll out more charging points to encourage better EV car use.\nSupport our local economy and back our high streets\nI will support local business and secure investment to back our high streets.\nBring more investment to our region and support our green industry growth.\nRevitalise our high streets and towns through a Community Development Fund.\nInvest in childcare, helping working parents get back to work.\nCommit to buying products or services within our region where possible.\nBuild the homes we need\nI will build the affordable homes people need and tackle homelessness.\nBuild more homes on unused industrial land in our cities and communities.\nSet up the Mayor’s Homelessness Task force, to tackle rough sleeping and homelessness.\nInsist on energy efficient, carbon neutral developments.\nBring hundreds of empty properties back into use and unlock new land for homes.\nChampion housing schemes that support our most vulnerable and our veterans.\nLaunch ‘Visit East Midlands’ to put our region on the map\nI will work to boost tourism and celebrate our region’s heritage as part of a new cultural strategy.\nSupport our local and professional sports to encourage more visitors to our region.\nLead a new approach to our cultural and creative economy to make the most of our talent.\nWork with businesses to invest in new accommodation to meet our growing number of visitors.\nSupport a safe and exciting night time economy, working with our police and crime commissioners.\nDeliver more jobs and better skills\nI will deliver apprenticeships for young people and make sure everyone can get the skills they need.\nWork with colleges and providers to get the best courses that deliver the right skills for our region.\nInvest in digital skills across the community, to help people get better access to work and services.\nEstablish a Green Growth Fund to support the skills needed for retrofitting and access to new green technology\nSet up a Good Employment Charter to recognise businesses that have the best employment practices.\nWork for a greener East Midlands and a just transition\nI will ensure we rise to meet the challenge of net zero and a sustainable future.\nReview all our actions to see how they can help us achieve net zero.\nEstablish a Mayor’s Taskforce to support nature and biodiversity as a key part of our region.\nCampaign for all new suitable industrial buildings and homes to have solar panels and be energy efficient.\nSupport a just transition so no one is left behind as we move to a more sustainable life.\nEncourage more walking and cycling as a green transport alternative.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-sherwood-clp/content_76.html": "Claire Ward has been nominated by Sherwood CLP.\nLocal party members there have thrown their support behind Claire to be Labour’s first East Midlands mayor.\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_former-home-secretary-endorses-claire/content_48.html": "Jacqui Smith, the UK’s first female Home Secretary, has announced that she’s backing Claire Ward for East Midlands mayor.\nJacqui said: “I’ve worked with Claire in Parliament, government and the NHS. She has the ideas and energy to be a brilliant Mayor for the East Midlands. Good luck Claire!”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_toyotas-hydrogen-future/content_40.html": "A really interesting visit to Toyota in Burnaston to talk about the future of hydrogen, and how the new East Midlands Mayor could make the most of its potential.\nA really interesting visit to Toyota in Burnaston to talk about the future of hydrogen, and how the new East Midlands Mayor could make the most of its potential.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_leader-of-newark-sherwood-council-backs-claire/content_81.html": "The newly elected Labour leader of Newark & Sherwood District Council, Paul Peacock, has announced he’s backing Claire Ward for Mayor.\nCouncillor Peacock said: “Claire has my full backing to be the Labour Candidate for the East Midlands Mayor. I know she will fight and win for our region. Claire has the energy, drive and compassion to rejuvenate our communities.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_save-alstom-in-derby/content_29.html": "Alongside Labour colleagues, I stood up for Alstom workers in Parliament yesterday (Wednesday 6 December). We’re facing the real possibility that Derby will lose thousands of jobs connected to the rail industry. We cannot let this happen.\nAlstom finish the manufacturing of programmes at end of January – so in six weeks they could go from an annual output of 650 cars employing 3,000 people to zero. Those working at Alstom and the companies who rely in its supply chain, could lose their jobs if the Tory government continues to dither. We want to be building trains in Britain not importing from abroad but that’s what will happen unless we see action.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_voting-opens-on-20-july/content_46.html": "It’s almost time to choose Labour’s candidate for East Midlands Mayor.\nWhat’s the election for?\nFrom 2024, a new East Midlands Combined Authority covering the region of Nottinghamshire County Council, Nottingham City Council, Derbyshire County Council and Derby City Council will be created. A new East Midlands Mayor will oversee this new authority and will have significant tools at their disposal, and significant funding, to make changes that will affect your life and your community.\nThe East Midlands has been the lowest-funded region of the UK for decades. This role needs someone who is energetic, resilient, experienced, and well connected. It isn’t a ceremonial role.\nWhen can I vote?\nBallots will be emailed on 20th July between 10am-2pm. Postal ballot papers will also be issued on the 20th July taking 2-3 days to land on your doormat.\nNot had a ballot paper or have an issue?\nThe last day for a postal re-issue is Monday 31st July and the last day for an email re-issue is Wednesday 3rd July at noon.\nMembers can get in touch with support@cesvotes.com if there are queries.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_weve-got-a-deal-for-high-peak/content_18.html": "A parent-powered campaign calling for cheaper bus fares for college students travelling into Greater Manchester has taken a huge step towards becoming a reality.\nFor the last few months, I’ve been working on a deal with Labour’s parliamentary candidate for High Peak, Jon Pearce, and Greater Manchester Mayor Andy Burnham to extend the ‘Our Pass’ scheme to include young people in High Peak, making journeys into Greater Manchester much cheaper, saving families thousands of pounds a year.\nThis deal is ready to go, but it can only happen with a Labour mayor; any other candidate would have to start from scratch. By voting for me on May 2nd, we can save High Peak parents thousands of pounds a year and ensure our young people can access the education they deserve.\nMum of two and campaign organiser Vickie Sharpe said: “This goes to show that a committed group of people really can make a difference. All we’ve ever asked is that our politicians work together to ensure our young people get the best possible start in life and I can’t thank Jon, Claire, and Andy enough.”\nLabour’s Jon Pearce said: “Extending the ‘Our Pass’ scheme to include young people living in High Peak isn’t just the right thing do to, it also makes huge economic sense. If more young people can afford to go to college, those institutions will benefit financially. Not to mention the added spend in local cafes, shops, and other businesses.”\nLeave a Reply",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_its-polling-day/content_8.html": "Polls are now open until 10pm tonight – you get to decide who will be the very first East Midlands mayor.\nA vote for me means we can get a grip of our roads, buses and trains, back our high streets, and build the homes we need. Your vote will determine the direction of our region for a generation!\nRemember, you’ll need your photo ID to be able to cast your vote. Not sure where your nearest polling station is? Click the link below.\nLeave a Reply",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_super-sunday/content_17.html": "Today, we clocked up the miles as the Labour Unions team helped me spread the word about Thursday’s mayoral election, and my vision for Derbyshire and Nottinghamshire.\nFrom Ripley to Lenton and on to Kirkby in Ashfield, volunteers, party members and trade union campaigners knocked on hundreds of doors to deliver one simple message, if I’m elected on the 2nd of May, I will make this region the best place to live, work, and learn.\nLeave a Reply",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_supporting-our-veterans/content_19.html": "It was a real privilege to meet with veterans and organisations that support those from military service.\nWe had an opportunity to discuss some of the challenges that face those who have served in our armed forces. They include mental health issues, getting into work, homelessness, and reintegrating into society.\nIf I’m elected on Thursday, my pledge is to make our region a more welcoming, understanding and supportive place for our veterans and their families. That means better housing and access to retraining and skills opportunities.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_claire-ward-confirms-bid-to-become-first-east-midlands-mayor/content_84.html": "The battle to become the first East Midlands mayor has kicked into gear, with former MP and Minister Claire Ward officially joining the race.\nClaire, who is Chair of Sherwood Forest NHS Trust which includes Mansfield’s Community Hospital, Ashfield’s Kings Mill Hospital and Newark Hospital, has announced that she is seeking the Labour Party’s nomination for the top job, confirming a run that has been rumoured for weeks.\nA new regional mayor is set to be elected in May 2024 under a £1.14 billion devolution deal for the East Midlands that was recently announced. The figurehead would lead a combined mayoral authority stretching across Nottingham, Nottinghamshire, Derby, and Derbyshire.\nCommenting on the launch, Claire said, “I have the experience, ambition, and, most importantly, energy and enthusiasm to represent the East Midlands and would make Derbyshire and Nottinghamshire a better place to live, work, and learn”.\nClaire has lived in Nottinghamshire for over a decade with her husband and two children. As well as leading local hospitals, Claire works with an independent trade union for pharmacists. She has also been a school governor and a town councillor in Ollerton, where she set up a Code Club to help local children gain new skills in technology.\nThe selection process and timings will be confirmed in due course by the party but during this time, Claire is keen to hear from all members across Derbyshire and Nottinghamshire in relation to their views on what they need and want from their regional mayor.\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk/content_1.html": "“This election is a once in a generation opportunity to bring pride back to our villages, towns, and cities. If I’m elected on 2nd May, I will make this region the best place to live, work and learn.”\nI’m Claire Ward, and I am standing to be your East Midlands Mayor. I’m standing because the East Midlands is my home too. I’ve raised my family here, built a business, and been deeply involved in local life. From leading my local NHS Trust to serving as a school governor, I’ve dedicated myself to making a difference.\nWorking Hard Across Derbyshire & Nottinghamshire\n- Mayor of the East MidlandsOn Friday, May 3rd I was elected as the very first Mayor of the East Midlands. I am truly humbled… Read more: Mayor of the East Midlands\n- It’s polling day!Polls are now open until 10pm tonight – you get to decide who will be the very first East Midlands… Read more: It’s polling day!\n- Visit to JCB to talk skillsI had a terrific visit to JCB yesterday with Bridget Phillipson and Samantha Niblett. Creating a thriving economy with well-paid… Read more: Visit to JCB to talk skills",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_ed-miliband-in-amber-valley/content_15.html": "It was great to show Ed Miliband around Amber Valley Borough Council’s new homes in Kirk Langley.\nThe Labour council’s commitment to providing green homes will save tenants money and reduce our reliance on fossil fuels.\nIf you elect me on May 2nd, these homes are just the beginning. Find out more about my vision for affordable homes in the East Midlands here.\nLeave a Reply",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_visit-to-nottingham-tram/content_28.html": "A huge thank you to both Keolis and GMB Midlands for inviting me to take a tour of the Wilkinson Street NET tram depot on Wednesday (20 December).\nI sat down with tram bosses to hear about the day-to-day running of the network and the challenges that come from that. It was really interesting to hear from drivers, inspectors and engineers about their roles, and how hard the GMB branch reps work to ensure NET remains a good place to work.\nIf elected as East Midlands mayor, I will ensure Nottingham’s tram remains a key part of the city and county’s public transport offer, as well as making our region’s bus network more affordable and reliable.\nIs public transport one of your key issues? Let me know by completing my survey below.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_mansfields-deputy-mayor-backs-claire/content_83.html": "Craig Whitby, Mansfield’s deputy mayor and cabinet member for finance has given Claire Ward his backing to become Labour’s first regional mayor for the East Midlands.\nCraig said: “I’ve worked closely with Claire for several years and have complete faith in her ability to deliver. The East Midlands will thrive with Claire as the regional mayor.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_derby-city-councillor-backs-claire/content_73.html": "Balbir Sandhu, a formidable local councillor in Normanton Ward and a well respected community leader across Derby, has revealed he’s backing Claire Ward for East Midlands Mayor.\nCommenting on his announcement, Balbir said: “Claire is a formidable campaigner; she’s proven that here in Derby helping us win the local elections. She has a vast amount of real life and relevant experience to ensure the whole region benefits from an Elected Mayor. I’m backing Claire.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_claire-in-the-press/content_42.html": "It’s been a busy few days since Claire was chosen to be Labour’s candidate for East Midlands Mayor.\nShe started by having a great chat with Oliver Pridmore at Nottinghamshire Live. Claire talked about her selection win and the job she’s got to do to excite and engage people across Derbyshire and Nottinghamshire before next May’s election. You can read that here.\nClaire also spoke to Mansfield 103.2 about the cost of living crisis impacting families across North Nottinghamshire and beyond. Claire’s win was also picked up by BBC East Midlands Today.\nShe has also been featured in Labour List, Mansfield’s Chad newspaper, and the Local Government Chronicle.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_nottingham-city-labour-endorse-claire-2/content_53.html": "The Labour group of councillors on Derby City Council have backed Claire Ward’s campaign for Mayor.\nClaire said: “Derby Labour emerged victorious with the most seats following the local elections in May, and haven’t wasted anytime in putting right the Tories’ mistakes. Baggy Shanker and Nadine Peatfield are providing strong leadership to a very capable group of elected members, and I’m delighted they’re backing me.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_sarah-brown-is-backing-claire/content_45.html": "Sarah Brown, global health and education campaigner, children’s charity founder, and wife of former Prime Minister Gordon Brown, has endorsed Claire Ward for East Midlands Mayor.\nSarah said: “Claire Ward would bring her values, experience and personable warmth to the role of East Midlands Mayor. This matters because she would work tirelessly and care deeply for the people of Nottinghamshire and Derbyshire.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_founder-of-labour-women-in-tech-backs-claire/content_77.html": "Claire Ward’s mayoral race continues to pick up support from right across the movement as Samantha Niblett comes out in support of the campaign.\nSamantha is the Founder of Labour Women in Tech which works to encourage more girls and women in to tech and allied sectors. Samantha said: “Claire is going to make a magnificent mayor for Derbyshire and Nottinghamshire. She’ll make sure all the areas get the attention they need and work so well with existing councillors to deliver the best for all across the region. She has my full support”.\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_bassetlaw-labour-group-clp-endorse-claire/content_56.html": "The Labour group of councillors on Bassetlaw District Council, as well as members of the CLP, have backed Claire Ward’s campaign for Mayor.\nClaire said: “In May, Labour achieved a strong majority through hard work and a great track record. I’m proud to have the support of the councillors there and will work alongside them as Mayor.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_launching-the-campaign/content_13.html": "A really exciting morning in Hyson Green as we launched the Mayoral and Police and Crime Commissioner campaign!\nWe have a once in a generation opportunity to invest in better roads, green homes, and bring in thousands of new jobs and learning opportunities to the region.\nThe highlight was Claire meeting Ms Carey who told her she is going to vote Labour for the first time ever on Thursday the 2nd May.\nLeave a Reply",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-derby-north-clp/content_71.html": "Claire Ward has been nominated by Derby North CLP.\nCommenting on the news Claire said: “I am incredibly grateful to members there for your support and trust.”\nDerby North CLP member Adam Wisdish said: “Claire had our back during the local elections in May, we have her back now!”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-south-derbyshire-clp/content_68.html": "Good things come in threes for Claire Ward!\nFollowing nominations from Derby North and Ashfield constituency Labour parties, South Derbyshire CLP have also thrown their weight behind Claire’s campaign.\nClaire said: “Thank you to South Derbyshire CLP for your faith in me and my ability to beat the Tories. I’m confident that we can transform Derbyshire and Nottinghamshire together.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_newarks-matt-spoors-endorses-claire/content_50.html": "Matt Spoors, Deputy Leader of Newark and Sherwood District Council, has backed Claire Ward for East Midlands mayor.\nMatt said: “Newark and Sherwood has amongst the lowest social mobility in the country. I know Claire has the experience, creativity, drive and values to address this crucial issue and that’s why I’m backing her to be our first East Midlands Mayor.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_visiting-vaillant-uk-in-belper/content_26.html": "Derbyshire and Nottinghamshire is home to more than 80,000 businesses employing more than 930,000 people. Whether they’re small and medium enterprises, or household global brands, they all play a crucial role in making the East Midlands a place people want to invest in.\nThat’s why it was a real pleasure to visit leading boiler and heat pump manufacturer, Vaillant, HQ in Belper, to see production of its low carbon technology in action and gain a clearer view of how the new mayor and industry can work in partnership to ensure our region can successfully transition to low carbon technologies.\nManaging Director Henrik Hansen, as well as their Technologies and Training Director, Mark Wilkins, gave me the tour of their impressive facility and showed me how they’re investing in economical, effective and environmentally friendly heat pump technology. We need environmentally friendly ways to provide heating and hot water not only in new build properties, but also in older, less insulated houses.\nIs the environment, green jobs, and net zero priorities for you? Let me know your thoughts by taking my survey below.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_posts/content_7.html": "Latest News\n- Mayor of the East MidlandsOn Friday, May 3rd I was elected as the very first Mayor of the East Midlands. I am truly humbled… Read more: Mayor of the East Midlands\n- It’s polling day!Polls are now open until 10pm tonight – you get to decide who will be the very first East Midlands… Read more: It’s polling day!\n- Visit to JCB to talk skillsI had a terrific visit to JCB yesterday with Bridget Phillipson and Samantha Niblett. Creating a thriving economy with well-paid… Read more: Visit to JCB to talk skills\n- Visit East MidlandsSome people see culture and arts as a nice to have or available only for those that cannot afford it.… Read more: Visit East Midlands\n- Super Sunday!Today, we clocked up the miles as the Labour Unions team helped me spread the word about Thursday’s mayoral election,… Read more: Super Sunday!\n- Supporting our veteransIt was a real privilege to meet with veterans and organisations that support those from military service. We had an… Read more: Supporting our veterans\n- Derby to be at the heart of Labour’s rail revivalLabour won’t let Derby’s rail legacy be consigned to the history books. Instead, our plan to create a publicly owned… Read more: Derby to be at the heart of Labour’s rail revival\n- Campaign WeekendFrom High Peak to South Derbyshire, Derby to Nottingham, Chesterfield to Mansfield, Labour colleagues have knocked on thousands of doors… Read more: Campaign Weekend\n- Register to vote!Are you registered to vote by post? If so, look out for your postal vote letter coming through the door… Read more: Register to vote!\n- Happy VaisakhiIt was a pleasure to welcome @SeemaMalhotra1 to Derby alongside @BaggyShanker and @NicolleNdiweni. Thanks to Derby Indian Community Centre and… Read more: Happy Vaisakhi\n- Launching the campaignA really exciting morning in Hyson Green as we launched the Mayoral and Police and Crime Commissioner campaign! We have… Read more: Launching the campaign\n- Ed Miliband in Amber ValleyIt was great to show Ed Miliband around Amber Valley Borough Council’s new homes in Kirk Langley. The Labour council’s… Read more: Ed Miliband in Amber Valley",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_claire-is-on-the-long-list/content_78.html": "Following a successful start to her mayoral campaign, Claire Ward has made it through to the next round to be Labour’s first East Midlands Mayor.\nSpeaking after the announcement Claire said: “I’m humbled to have made it on to the long list. I’ve been blown away by the breadth of support I’ve received so far from across the Labour movement but there’s more work to do. If Labour members want a candidate who will work tirelessly to win, not just sit back and take the nomination for granted, then I’m their choice.\n“The job of mayor isn’t some sort of ceremonial role to be taken lightly, it’s a critical job for someone with drive and energy.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_contact-me/content_2.html": "By using this form you are agreeing to the terms laid out in the privacy policy and you allow Claire Ward to use the data entered in this form to contact you in relation to any enquiry or comments made as part of this form.\nBy using this form you are agreeing to the terms laid out in the privacy policy and you allow Claire Ward to use the data entered in this form to contact you in relation to any enquiry or comments made as part of this form.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_canal-and-river-trust-visit/content_25.html": "It was a real treat to meet with staff and volunteers at the Canal and River Trust in Newark, who are leading the clean-up operation following the terrible flooding caused by Storm Henk. We talked about the opportunities our rivers and canal’s bring for both the renewable energy, tourism, and leisure sectors.\nAre the environment, green jobs, and leisure priorities for you? Let me know your thoughts by taking my survey below.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_speech-to-labour-conference-2023/content_35.html": "I was humbled to address Labour’s 2023 conference today.\nMy contribution to the Energy debate recognises one of my key priorities. Labour’s mission to make Britain a world class, clean energy superpower speaks to the ambition of people across the East Midlands.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_lee-brazier-backs-claire-for-mayor/content_75.html": "One of Labour’s great victories in May’s local elections was capturing Newark and Sherwood District Council from the Tories.\nLee Brazier, Portfolio Holder for Housing at the council, has endorsed Claire saying: “I’m backing Claire to be East Midlands Mayor. She knows our local communities and works closely with local councillors to get the best for our areas. My approach to improving housing matches with Claire’s and I want to work with her to get the best for our region.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_meeting-with-friends-of-the-earth/content_27.html": "I had a great meeting with East Midlands Friends of the Earth to hear how the incoming mayor can work collaboratively to tackle the climate and nature crisis impacting communities across our area.\nWe covered a huge range of issues, including a just transition to net zero, sustainable transport options, the potential for the East Midlands to be a leader in hydrogen, new energy-efficient homes, and retrofitting older houses too. If elected as mayor, I will work to tackle the climate and nature crisis. I also attended an online policy discussion this week with the regional Walking and Cycling Alliance, who are keen to get more of us using sustainable transport and reducing the number of car journeys across the region.\nIs the environment, green jobs, and net zero priorities for you? Let me know your thoughts by taking my survey below.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_privacy-policy/content_6.html": "We respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\n1. WHO WE ARE AND HOW TO CONTACT US\nClaire Ward is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at\nPrivacy@claireward.co.uk\n2. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\n- your use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a supporter of “Claire Ward for Mayor” (known as the Campaign)) or completing an online survey.\n- By collecting such data, we will be able to inform you about relevant developments that relate to the Campaign and what you can do to help the Campaign as it progresses.\n- In order to advance the Campaign, we may share your data with other related campaigns and movements that share the values, principles and aims of Claire Ward for Mayor (including, but not limited, to other Labour Party elections in this area) and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place.\n- This website is not intended for children and we do not knowingly collect data relating to children.\n- It is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\n- This privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n3. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\n- identity data, including first name, maiden name, last name, username or similar identifier, marital status, title, date of birth and/or gender;\n- contact data, including address, email address and/or telephone number(s);\n- financial data, including bank account and payment card details;\n- transaction data, including details about payments to and from you and other details of products and services you have purchased from us;\n- technical data, including internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website and platforms hosting our content;\n- profile data, including your username, your interests, preferences, feedback and/or survey responses;\n- usage data, including information about how you use our website; and/or\n- marketing and communications data, including your preferences in receiving content and/or marketing from us and your communication preferences.\n- We also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n4. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you:\n- Provided by you – directly\n- You may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\n- This also includes personal data you provide when you register as a supporter of the Campaign, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\n5. HOW WE USE YOUR PERSONAL DATA\nThe uses:\n- We will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\n- Register you as a supporter of Claire Ward for Mayor\n- Inform and engage you about the Campaign;\n- Inform and engage you with any other campaigns and movements that share the values, principles and aims of Claire Ward for Mayor (including, but not limited, to other Labour Party elections);\n- Manage donations, payments, fees and/or charges;\n- Comply with our legal obligations; and/or\n- Answer your queries and respond to your questions and/or complaints.\n- The legal basis\n- Where you have specifically consented to a particular use of your data (such as where you have subscribed to receive information about Claire Ward’s campaign);\n- Where you have entered into a legal agreement with us that necessitates that particular use of your data (such as where you make a payment or donation to us);\n- Where it is a necessary lawful basis for our legitimate interests and your interests and fundamental rights do not override those interests; or\n- Where we are obliged to process your data in a particular way by law (for example, if we are required to notify any authority or regulator of the nature or value of your donations).\n6. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\n- To enable transfers to take place (where appropriate);\n- Where we need to comply with a legal obligation; and/or\n- With suppliers who act as our ‘data processors’ and who provide the means of processing financial transactions including, but not limited to, The Labour Party, Stripe, Paypal and others.\n7. WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing:\n- You will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\n- Right to object/Opting-out\n- You can ask us to stop sending you marketing messages at any time by contacting us at Privacy@claireward.co.uk.\n- You have a right to opt-out of your data being used for direct marketing.\n- If we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\n- Where you opt-out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagement or transactions with us (so, for example, if you opt-out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\n8. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\n9. CHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n10. CHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n11. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n12. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n13. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n14. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n15. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them:\n- Right of access:\n- You may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\n- We follow the ICO’s “Subject Access Code of Practice” when dealing with requests for access to personal data. You can read this code by visiting\n- https://ico.org.uk/media/for-organisations/documents/2014223/subject-access-code-of-practice.pdf\n- Please note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\n- You can exercise this right at any time by contacting us at Privacy@claireward.co.uk and telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request.\n- Your right to rectification and erasure\n- You may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (you may have heard of this right described as the “right to be forgotten“).\n- Please note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\n- You can exercise this right at any time by contacting us at Privacy@claireward.co.uk and telling us that you are making a request to have your personal data rectified or erased and on what basis you are making that request. If you want us to replace inaccurate data with new data, you should tell us what that new data is. You do not have to fill in a specific form to make this kind of request.\n- Your right to restrict processing\n- Where we process your personal data on the basis of a legitimate interest (see the sections of this privacy policy which explain how and why we use your information), you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\n- You may also ask us to stop processing your personal data: (a) if you dispute the accuracy of that personal data and want us to verify that data’s accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; or (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\n- Please note that if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it. You can exercise this right at any time by contacting us at Privacy@claireward.co.uk and telling us that you are making a request to have us stop processing the relevant aspect of your personal data and describing which of the above conditions you believe is relevant to that request. You do not have to fill in a specific form to make this kind of request.\n- Your right to portability\n- Where you wish to transfer certain personal data that we hold about you, which is processed by automated means you may write to us and ask us to provide it to you in a commonly used machine-readable format.\n- Because of the nature of our work we do and the systems that we use, we do not envisage this right being particularly relevant to the majority of individuals with whom we interact. However, if you wish to transfer your data from us to a third party, we are happy to consider such requests in good faith.\n- Your right to stop receiving communications\n- As noted above, where we send you email marketing communications (or other regulated electronic messages) you have the right to opt-out at any time. You can do this by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications).\n- Alternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at Privacy@claireward.co.uk and telling us which communications you would like us to stop sending you.\n- Your right to object to automated decision making and profiling\n- You have the right to be informed about the existence of any automated decision making and profiling of your personal data, and where appropriate, be provided with meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing that affects you.\n- Exercising your rights\n- When you write to us making a request to exercise your rights, we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help us to verify your identity. This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\n- It will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be, the faster and more efficiently we can deal with your request. If you do not provide us with sufficient information, then we may delay actioning your request until you have provided us with additional information (and where this is the case, we will tell you).\n- You will not usually have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.\n- We try to respond to all legitimate requests within one (1) month. However, it could take us longer than a month if your request is particularly complex or if you have made a number of requests. In this case, we will notify you of this and keep you updated.\n16. RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nThe contact details for the ICO are:\nInformation Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\nTelephone: 0303 123 1113\nWebsite:\nLast updated: 30/05/23",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_register-to-vote/content_14.html": "Are you registered to vote by post? If so, look out for your postal vote letter coming through the door very soon!\nIf you aren’t registered to vote, then tomorrow (Tuesday 16 April) is the deadline to get it sorted!\nClick here before 11:59pm to make sure you don’t lose your voice!\nBy electing a Labour East Midlands Mayor on May 2, it’s your chance to make our region the best place to live, to work, and to learn.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-bolsover/content_54.html": "Labour members in Bolsover CLP have backed Claire Ward for East Midlands Mayor.\nClaire said: “Bolsover is a classic case of Tories over promising and under delivering. As mayor, I will work hard to bring opportunities and investment to the area alongside the brilliant Natalie Fleet.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_voting-is-now-open/content_44.html": "It’s now time to choose Labour’s candidate for East Midlands Mayor.\nCheck your inbox for the e-ballot email.\nIf you want a Mayor with experience, vision, and energy who is backed by more local parties and councillors than anyone else, make me your #1 choice.\nNot had a ballot paper or have an issue?\nThe last day for a postal re-issue is Monday 31st July and the last day for an email re-issue is Wednesday 3rd July at noon.\nMembers can get in touch with support@cesvotes.com if there are queries.\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-rushcliffe-clp/content_61.html": "Labour members in Rushcliffe have backed Claire Ward for East Midlands Mayor.\nClaire said: “Rushcliffe is home to Trent Bridge Cricket Ground and Nottingham Forest’s City Ground. I’ll be working hard with members there to help turn Rushcliffe from Tory Blue to Garibaldi Red.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_the-opportunity/content_3.html": "The Opportunity\nFor too long the decisions impacting our lives have been made my strangers in Westminster.\nThe East Midlands is on the brink of an exciting transformation with the establishment of the Mayoral Combined Authority, a pivotal step forward in the devolution deal aimed at creating a more connected, competitive, and prosperous region.\nThis ground breaking initiative promises to reshape the economic landscape through a £1.14 billion investment focusing on critical areas such as jobs, transport, environmental sustainability, and housing.\nThe Mayoral Combined Authority will significantly impact the 2.1 million people and our communities across Derbyshire, Nottinghamshire, Derby, and Nottingham.\nInvestment\nin Jobs\nCreation of new opportunities and the development of key skills to drive economic growth.\nEnhanced\nTransport Links\nDevelopment of a cohesive infrastructure and the improvement of public transport systems to better connect the region.\nEnvironmental Sustainability\nCommitment to achieving net zero by 2050, promoting a greener and more sustainable environment.\nImproved\nHousing\nFocus on creating affordable, high-quality housing and retrofitting existing homes to enhance energy efficiency.\nThe role of the East Midlands Mayor will be central to driving these initiatives forward, ensuring that our region can realise its full potential as the best place to live, to work, and to learn.\nImportantly, it will allow us to make our own decisions locally, breaking free from London focussed ideas which have held our region back for too long. The vision for our region must be interconnected to ensure that we deliver for our communities. For more detailed information, you can visit the official East Midlands Devolution website.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_darley-dale-councillor-endorses-claire/content_70.html": "Distinguished former Police and Crime Commissioner and member of the House of Lords, Lord Willy Bach, has thrown his weight behind Claire Ward in her campaign to be Labour’s first East Midlands Mayor.\nLord Bach said: “Claire and I were ministers under the last Labour government. I saw for myself how effective she was at getting things done, and believe she has the commitment, experience, and energy to be a brilliant Labour Mayor. I am proud to support her.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_community-union-endorse-claire/content_67.html": "Community union, who represent workers in every sector of the UK economy from steelworkers to office workers to the self-employed, have endorsed Claire Ward for East Midlands mayor.\nClaire said: “I have dedicated my life to our Labour, Trade Union and Co-Operative movement. As Mayor, I will create a Derbyshire and Nottinghamshire Social Partnership bringing together trade unions, local businesses, innovators and the broader community to make employment work for all.\n“I am absolutely delighted to receive Community’s nomination.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_can-you-help/content_41.html": "The Labour Party has always stood as a beacon of progress, unity, and hope for hard working families in Derbyshire and Nottinghamshire. Over the next 8 months, in the run up to polling day, I want to show people the difference a Labour East Midlands Mayor can really make.\nI have launched a crucial fundraising drive that will address the unique challenges faced by our region. Your contribution will help turn my 5 campaign pledges into reality. I want to:\n- Create more affordable housing in the East Midlands\n- Improve workers’ wages, working conditions and skills\n- Deliver a transport system that works for all\n- Create more jobs through a Green Growth Fund\n- Give young people a real voice in our region\nYour generous contribution will make a difference. This election covers 2.2 million people across 22 constituencies. We know the Tories have the money to campaign at this level. To match them we need your help.\nYou can contribute in two meaningful ways:\nOne-time donation: Visit our secure online donation portal to make a one-time contribution.\nMonthly contributions: Join our committed group of monthly donors who provide consistent support that sustains our effort over the long term. Your dedication ensures our ability to continue making progress. To join this group please contact Neil Rayner in the East Midlands team via email: neil_rayner@labour.org.uk\nThank you for considering this important call to action. Together, with your support and my energy and experience, we can build a brighter and fairer future for the East Midlands.\nClaire.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_west-of-england-mayor-is-supporting-claire/content_80.html": "Labour’s mayor in the West of England, Dan Norris, has thrown his weight behind Claire Ward in her race to become East Midlands mayor.\nDan said: “The East Midlands has faced years of uncertainty and neglect by the Conservatives. As a Mayor myself I know Claire Ward has the ideas and integrity to transform the region’s villages, towns, and cities and bring back honesty and compassion to our politics. I’m very proud to support her.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-chesterfield-clp/content_64.html": "It’s been an huge evening of CLP nominations for Claire Ward as Chesterfield CLP have chosen to back her campaign for East Midlands Mayor.\nClaire said: “Your support means so much. Chesterfield has such a rich Labour history, and together with the fabulous Toby Perkins, I’m committed to securing it’s future.”If you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-gedling-clp/content_65.html": "Another constituency Labour Party has chosen to nominate Claire Ward in her race to become East Midlands Mayor, with members in Gedling supporting the campaign.Claire said: “Thank you Gedling members for your trust and support! I can’t wait to get out on the doorsteps with members there to get the brilliant Michael Payne elected.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_campaign-weekend/content_12.html": "From High Peak to South Derbyshire, Derby to Nottingham, Chesterfield to Mansfield, Labour colleagues have knocked on thousands of doors this weekend.\nAs a Labour East Midlands Mayor, I will build a future that offers better jobs, affordable homes, and a healthier environment for all. It’s about more than just policies; it’s about building a future for our children, supporting our businesses to innovate and grow, and ensuring everyone has the chance to live a fulfilling life. I will be dedicated to making this a reality.\nThis election is a once-in-a generation opportunity to bring pride back to our villages, towns, and cities. Together, we can make this region the best place to live, work, and learn.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_peaks-and-dales-rail/content_30.html": "The new East Midlands Mayor will oversee transport powers across the counties, so it was really interesting to attend the recent public meeting to hear about plans to reinstate the train line between Ambergate and Buxton, linking Matlock, Bakewell and the Peak District Park.\nTheir proposals include:\nUpgrading 23 miles and reinstating 13 miles of railway to, once again, link Matlock to Buxton by rail, via Bakewell.\nRe-connecting communities across the Peak District National Park left isolated by the disastrous and short-sighted Beeching Report.\nCatalysing the economy across Derbyshire, delivering new jobs and growth.\nRe-provisioning the fabulous Monsal Trail and connecting it to stations along the reinstated railway, ensuring that visitors can continue to enjoy this spectacular attraction within the Peak District National Park.\nEnabling more of the 13.25m annual visitors (source: PDNPA) to the Peak District National Park to travel by train, reducing environmental impact and boosting economic benefit.\nTransporting more of the heavy stone traffic from the quarries of the Peaks & Dales, taking HGVs off the heavily-used but narrow and winding roads of the Peak District and relieving the pressure on the seriously congested Hope Valley line.\nWould this new rail line change the way you travel across Derbyshire and onward to the North West? Please complete my survey by clicking below and tell me about the key issues affecting you and your family.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_local-parents-bus-pass-campaign-gathers-speed/content_37.html": "I attended a public meeting in Glossop on Saturday (30 September) where parents called for cheaper fares available to students in Manchester to be extended to those travelling into the area to study.\nThe campaign calling for cheaper bus passes for 16 to 18-year-olds, which I wholeheartedly support, has struck a chord with hundreds of families who have highlighted frustrations that young people over the border in Manchester are able to access cheaper fares to travel to college, whilst those who travel from inside the Derbyshire border cannot access the same support.\nThe public meeting was also covered on BBC North West Tonight\nI was joined at the meeting by Labour’s parliamentary candidate for High Peak, Jon Pearce, and Councillor Damien Greenhalgh, who echoed my pledge to support Vickie’s campaign.\nLabour’s Jon Pearce said: “Extending the ‘Our Pass’ scheme to include young people living in High Peak isn’t just the right thing do to, it also makes huge economic sense. If more young people can afford to go to college, those institutions will benefit financially. Not to mention the added spend in local cafes, shops, and other businesses.”\nSince Saturday’s meeting, we have also been contacted by families living in Hayfield and New Mills facing the same unfairness. Please contact me if this impacts you and you’d like to add your weight to this campaign.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_kings-speech-reaction/content_31.html": "Yet again, this Tory government has failed to offer any real ambition or hope. They also think they can fool the people of Derbyshire and Nottinghamshire.\nUnder the Tories, the last 13 years have seen our public services trashed, opportunities lost, and the East Midlands put to the bottom of pretty much every list going. We can and must do better for our communities.\nWhat are the issues most important to you? Please complete my survey by clicking below and tell me about the key issues affecting you and your family.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_happy-vaisakhi/content_9.html": "It was a pleasure to welcome @SeemaMalhotra1 to Derby alongside @BaggyShanker and @NicolleNdiweni. Thanks to Derby Indian Community Centre and Guru Arjan Dev Gurdwara too. I’m proud of our diverse communities, and as Mayor, I’ll work hard to represent people of all faiths and cultures.\nWishing a Happy Vaisakhi to all Sikhs celebrating across Derbyshire, Nottinghamshire and around the world.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_claire-supported-by-derbyshires-youngest-councillor/content_82.html": "Derbyshire County Councillor Joel Bryan has thrown his support behind Claire Ward to become Labour’s first East Midlands Mayor.\nJoeI, who is also the executive member for environment at Erewash Borough Council, said: “Claire has what it takes to bring our two counties together and I know she won’t forget young people and our concerns, and will work closely with Labour councillors to achieve the best for our region.”\nOne of Claire’s key pledges as mayor would be to create a youth panel to ensure that the views of young people are brought directly to the discussions and decisions taken by the mayor.\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_aslef-is-backing-claire-for-mayor/content_49.html": "Another affiliated trade union, ASLEF, have come out in support of Claire Ward for East Midlands Mayor.\nClaire said: ASLEF were there at the start of the Labour Party and have been speaking up for rail workers for over 140 years. We should be proud of their achievements and I’m delighted to have their support.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_unison-is-backing-claire-for-mayor/content_57.html": "UNISON, the UK’s largest trade union, representing over 1.3 million workers in the public sector, have endorsed Claire Ward for East Midlands mayor.\nClaire said: “I’m delighted to have secured UNISON’s nomination. UNISON in the East Midlands play a vital role in keeping our public services going in our region, and I’ll make sure their voices are heard at the very top as Mayor.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_margaret-beckett-backs-claire/content_62.html": "Dame Margaret Beckett MP has thrown her considerable weight and support behind Claire’s bid to be Labour’s first East Midlands Mayor.\nDame Margaret said: “I am pleased to see a good list of candidates, but having first worked with Claire when she joined the NEC as youth representative at the age of 19, I know her strengths and talents. I am endorsing Claire, as I know she will make a great Mayor for our region.”\nClaire Ward said: “Dame Margaret is a titan of the Labour movement. First female Foreign Secretary, Leader of the Opposition, and Commons Leader. It means the world that she’s supporting my campaign to be East Midlands Mayor.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_contact/content_38.html": "By using this form you are agreeing to the terms laid out in the privacy policy and you allow Claire Ward to use the data entered in this form to contact you in relation to any enquiry or comments made as part of this form.\nBy using this form you are agreeing to the terms laid out in the privacy policy and you allow Claire Ward to use the data entered in this form to contact you in relation to any enquiry or comments made as part of this form.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-amber-valley-clp/content_66.html": "It has been another successful evening for Claire Ward’s campaign to become Labour’s first East Midlands Mayor, with Amber Valley CLP choosing to nominate her.\nReacting to the nomination Claire said: “As mayor, I will work to rejuvenate communities like Alfreton and Ripley. Enhancing local shopping areas with new services and businesses.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_we-did-it/content_43.html": "Claire Ward has been selected as Labour’s Candidate for East Midlands Mayor.\nWE DID IT! 🎉\nMy thanks to @PaddyTipping and @johnbhess for running an excellent and positive campaign🌹\nNow the hard work begins to beat the Tories! Let’s bring prosperity and opportunity to every corner of Derbyshire and Nottinghamshire. pic.twitter.com/STehRYT9GX\n— Claire Ward for East Midlands Mayor (@ClaireWard4EM) August 3, 2023",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_claire-is-on-the-shortlist/content_51.html": "Following the nomination period for constituency parties, trade unions, and council groups, a final shortlist of candidates has been announced in the race to be Labour’s first East Midlands Mayor.\nOn being named on the shortlist, Claire said: “I’m delighted and humbled to be on the shortlist to be Labour’s first East Midlands Mayor! This wouldn’t have been possible without the support of so many members, councillors and unions. But there is still more work to do – so come and help us in the final stretch!”\nEmail: contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_visit-east-midlands/content_20.html": "Some people see culture and arts as a nice to have or available only for those that cannot afford it. It is so much more than that. Our cultural scene, heritage and the arts enrich us all, supporting healthier lives, social mobility, skills and a thriving economy.\nOur region has so much to offer. The peaks and dales of Derbyshire and the beauty of the National Park; stunning buildings from our industrial heritage, the legend of Robin Hood and Sherwood Forest, Nottingham and Derby theatres, the Playhouse, Buxton Opera House, the birthplace of DH Lawrence and the museums of our heritage.\nData shows that whilst many people in our communities already access the shows, sports and entertainment on offer across our region we are also a destination of choice for those beyond our boundaries.\nThe visitor economy contributes nearly £5 billion to our Gross Value Add in the East Midlands so it is essential that we recognise it as a key driver for our regional economic growth too.\nMaking the most of these opportunities needs a Mayor committed to the Visitor Economy as a pillar of our strengths in the region. I will establish a new committee of the Combined Authority to focus on the Visitor Economy, working with the partners across the Arts Council, Department of Culture Media and Sports and most importantly, our local partners such as Visit Nottingham and Nottinghamshire and Marketing Derby and Derbyshire. Together we will map out all we have to offer in the region and working with the Mayor’s transport leads we will create a joined up offer to those who come to visit our brilliant cities, towns and communities.\nMy previous experience in leading the All Party Parliamentary Group on the Film Industry put me at the forefront of lobbying the government to bring in the tax incentives for the film industry in the UK. Over the last 20 years, the UK film industry has grown significantly. I want the East Midlands to have a greater share of that growth and develop some of the opportunities that already exist for location filming by providing the business support and skills for those who want to enter into the industry and be based in our region.\nAs Mayor, I will work with the private sector to bring the investment into our region for accommodation to support our ambitious plans for more visitors both for business and culture., but I will not forget those who are already providing a warm welcome to our visitors. I will be an ambassador for the region nationally and internationally to promote every aspect of this fantastic region to live, work and visit.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_visit-to-nottingham-city-transport/content_34.html": "As Mayor, providing better and cheaper public transport will be one of my key priorities.\nThat’s why it was a real pleasure to sit down with senior leaders, trade union officials, and bus drivers to hear what Nottingham City Transport does well and discuss how we can use their expertise to benefit the rest of Nottinghamshire and Derbyshire.\nIs public transport an important issue to you? Please complete my survey by clicking below and tell me about the key issues affecting you and your family.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_nottinghams-neghat-khan-backs-claire/content_47.html": "Councillor Neghat Khan has announced that she’s backing Claire Ward for East Midlands mayor.\nNeghat said: “Claire is the candidate the Tories don’t want to face. I know, through her, Nottinghamshire and Derbyshire will see increased investment and green jobs, better services in transport and adult skills training, and another prominent voice speaking up for our region.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_out-and-about-in-derbyshire/content_23.html": "One of the best things about campaigning to be East Midlands Mayor is meeting passionate local people. Thank you to the team at Rural Action Derbyshire for having me. Their mission is to improve the quality of life for Derbyshire residents, by empowering people in rural communities to take action to address disadvantage, become more sustainable and increase local control.\nRural communities shouldn’t be disadvantaged just because of where they live or work.\nI also really enjoyed catching up with some of Derbyshire’s Labour county councillors. As East Midlands mayor, I will work to revitalise our villages and towns, bring better public transport services to rural communities, and safeguard our green spaces.\nIf you live or work in Derbyshire, I’d love to hear the issues that are important to you and your family.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_high-peak-councillor-backs-claire-ward/content_79.html": "As Claire’s mayoral campaign enters another week, Rob Baker, a High Peak councillor and NHS worker has announced he’s on board.\nRob said: “Claire is acutely aware of our difficult position on the periphery of the region. I believe that she is the candidate who takes the High Peak seriously.”\nClaire Ward said: “For too long our rural communities have been starved of investment. As mayor, I am determined to put that right.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_hello-world/content_21.html": "Welcome to WordPress. This is your first post. Edit or delete it, then start writing!\nYour email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nLeave a Reply",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_mayor-of-the-east-midlands/content_4.html": "On Friday, May 3rd I was elected as the very first Mayor of the East Midlands.\nI am truly humbled that the people of Derby, Derbyshire, Nottingham and Nottinghamshire have elected me to become your very first East Midlands East Midlands Mayor. Throughout this campaign, I have heard your message loud and clear: you are ready for change.\nYou have not only put your trust in me, you have also put your trust in a changed Labour Party that can now, confidently and with conviction, say to our proud villages, towns and cities: we are ready to lead, we are ready to deliver.\nThank you to my agent and the whole Labour team across Derbyshire and Nottinghamshire, the trade union movement, and so many more who will forever have my gratitude.\nAnd of course, a huge thank you to my family, my husband John and my children, for their endless patience, love and support.\nAs mayor, I will leave the same old politics behind in Westminster, create a new politics here, and involve our communities in new ways.\nMy focus will be on making a difference, not point scoring, and working across the political divides to deliver truly transformational change for our region.\nWe will give power and purpose to those people and places that Westminster has left behind.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_visit-to-jcb-to-talk-skills/content_10.html": "I had a terrific visit to JCB yesterday with Bridget Phillipson and Samantha Niblett.\nCreating a thriving economy with well-paid jobs needs the skills to match. Not just at the early start of working life, but throughout it.\nAs the Local Enterprise Partnership, D2N2 brings its responsibilities and expertise into our new combined authority. I will enhance the work they have done with Boot Camps for skills and the Careers Hub to make sure we prioritise those economically inactive to get them back into work. Partnering with the NHS as it continues to offer its free NHS health check to those aged 40 plus, I will offer a free skills check too. We will make sure that people are not just given health support but skills support to keep them working. An holistic and collaborative approach to make sure our people are fit, healthy and skilled for the future.\nMy focus to grow the local economy recognises that we will need a vast number of highly-skilled workers to support our greener economy – from retrofitting, to low carbon house building, to nuclear skills and more. My Green Growth Fund will support those new skills and harness investment from the private sector so we share those ambitions and gains.\nAs we focus on lifelong learning, I am aware that we often don’t prepare our children for the variety of skills they will need to navigate the world of work and life. As Mayor, I will help by bringing businesses in to work with our Careers service to focus on the transferrable and collaborative skills needed from a young age not just when they enter work.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_cwu-is-backing-claire-for-mayor/content_52.html": "CWU, the biggest union for the communications industry, have endorsed Claire Ward for East Midlands mayor.\nClaire said: “I’m humbled to have the only official nomination from the biggest union for the communications industry. As Mayor, I will make sure trade unions have a seat at the top table.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_darley-dale-councillor-endorses-claire-2/content_72.html": "Sarah Halliwell, Darley Dale Councillor and Derbyshire Dales CLP Secretary, has come out for Claire Ward in her bid to be the first East Midlands Mayor.\nSarah said: “Claire has the political, business, and leadership experience needed to be mayor. She understands the importance of drawing Derbyshire and Nottinghamshire together, and I know that she has a vision to lead and make this region work for everyone.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_nottingham-college-hustings/content_24.html": "I took part in the very first mayoral hustings event held at Nottingham College on Thursday (17 January). There were some interesting (and tough) questions from students and staff around transport, housing, jobs, and the environment. The event was filmed by BBC Politics East Midlands, and you can see highlights on the programme this Sunday at 10am on BBC One.\nI’m the only candidate who has promised to establish a youth panel, to ensure that the views of our young people are brought directly to the discussions and decisions taken by the Mayor.\nIf you’re a young person looking to make your voice heard, let me know your thoughts by taking my survey below.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_further-education-at-newark-college/content_36.html": "Creating new skills and learning opportunities for young people, and those looking for a career change, will be a priority for me if elected as East Midlands Mayor next year.\nFurther Education rarely gets the funding or attention it deserves – until there’s a skills shortage. I want to create new opportunities for learners in Derbyshire and Nottinghamshire and ensure they are provided with the tools to achieve their career aspirations, developing our further education offer through partnership working with trade unions, local businesses, innovators and the broader community.\nThat’s why I was delighted to be invited to visit Newark College, chat to their team, and take a look around the Air and Space Institute, a state-of-the-art aviation training facility that will open in early September 2024.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-nottingham-north-and-south/content_60.html": "Labour members in both Nottingham North CLP and Nottingham South CLP have backed Claire Ward for East Midlands Mayor.\nClaire said: “I’m so grateful to members in the North and South of Nottingham for putting their trust in my experience and for supporting my vision for the city. Together we can win this!\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_member-mobilisation-event/content_33.html": "Join members from across Derbyshire and Nottinghamshire for our first fundraising evening social at The Shoulder, Hardstoft, S45 8AX.\nI will be joined by our Police and Crime Commissioner candidates, Nicolle Ndiweni and Gary Godden. There will be speeches, raffles and a buffet for members from across our region to enjoy.\nFind out how you can get involved with our 2024 election campaign, so that together we get our Labour candidates elected!",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_homelessness-summit/content_22.html": "If I’m fortunate enough to be elected East Midlands mayor, I will get on and do what matters for the people of Nottingham. For too long, our politicians have been out themselves putting their friends and vested interests first. I am determined to do things differently, making sure the most vulnerable in our society are taken care of. That’s why I pulled together a homelessness summit to work out how we get our fellow citizens off the streets.\nOrganisations from across the region, including YMCA, Canaan Trust, Framework, Emmanuel House, and The Friary shared their thoughts on how the new mayor can lead on this hugely important issue.\nBaroness Louise Casey who chaired the event said: “In 1999, I was appointed the country’s first ever homelessness tsar. With the help of local communities, we managed to bring the number of homeless people in Nottingham and Derby down to almost zero.\n“The new East Midlands mayor will have a real opportunity to use their new powers around housing to address to stop our fellow citizens ending up sleeping on the streets. I know that Claire Ward cares passionately about this too and I’m proud to be supporting her.”",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_bassetlaws-jo-white-endorses-claire/content_74.html": "Labour’s prospective parliamentary candidate for Bassetlaw, Jo White, is endorsing Claire Ward for East Midlands mayor.\nAnnouncing her support, Jo said: “The new East Midlands mayoral role will be key to unlocking the potential of Nottinghamshire and Derbyshire, and bringing investment to places like Bassetlaw. Living locally, Claire understands the local challenges and how to tackle them. Claire will work tirelessly to win, not taking anything for granted. That’s why I’m backing her.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_about-me/content_11.html": "About me\nI’m Claire Ward, and I am standing to be your East Midlands Mayor. I’m standing because the East Midlands is my home too. I’ve raised my family here, built a business, and been deeply involved in local life. From advocating for better healthcare to serving as a school governor, I’ve dedicated myself to making a difference and doing what matters.\nFor the past year and a half, I’ve been on a journey through the heart of Nottinghamshire and Derbyshire, visiting villages, towns, and communities.\nIt’s been eye-opening. Everywhere I’ve been, I’ve seen the same struggles: families stretched thin, worries about the future, infrastructure falling apart, and taxes on the rise. But amidst these challenges, I’ve also seen resilience, hope, and a shared desire for change.\nAs your Mayor, I’ll bring fresh leadership and a commitment to listening to your concerns. I know we can’t keep relying on the same old promises that never materialise. It’s time for real change.\nWith the creation of a new Mayor for the East Midlands, we have a chance to take control of our future. I’ll use every bit of experience I’ve gained over three decades in politics, business, and healthcare to make our region thrive.\nTogether, we can invest in our communities, create better jobs, improve transportation, provide affordable housing, and tackle climate change. But most importantly, we can build a future where every child has the opportunity to succeed.\nI’m asking for your support to make our region the best place to live, to work, and to learn.\nJoin me, and let’s make it happen.\nWhat you can expect from me\nListener\nAs mayor, I’ll listen to the voices of local people, community groups, and business, championing their priorities at a regional and national level.\nEnergy\nI will bring energy and resilience to deliver for our people and our communities. Relentlessly focused on standing up for our communities.\nCollaboration\nI will build partnerships across our region. Working together with our communities, councils, trade unions, charities, educators and businesses.\nFuture Focused\nI am determined to build a better future for our young people, creating outstanding learning and employment opportunities closer to home.\nExperience\nI will use my 30 years experience across politics, business and public sectors to get things done",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_derby-to-be-at-the-heart-of-labours-rail-revival/content_16.html": "Labour won’t let Derby’s rail legacy be consigned to the history books.\nInstead, our plan to create a publicly owned and passenger focused rail network will transform our region. As East Midlands Mayor, I’ll make sure we create the next generation of railway workers who have the right skills they need.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_derby-museums-flooding/content_32.html": "This week, I visited the Museum of Making at Derby Silk Mill to see the damage caused by Storm Babet.\nAs East Midlands Mayor, I will create a Green Growth Fund to create thousands of new jobs to support our environmental ambitions, helping Derbyshire and Nottinghamshire to become leaders in green technology and manufacturing.\nDespite the damp circumstances, it was great to chat with museum boss Tony Butler about how we can better connect our local heritage and culture with new skills and training opportunities. Culture and heritage can contribute so much to the development of skills. From technicians to set designers from crafts and making to traditional building skills.\nWhat are the issues most important to you? Please complete my survey by clicking below and tell me about the key issues affecting you and your family.",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_nottingham-city-labour-endorse-claire/content_58.html": "The Labour group of councillors on Nottingham City Council have backed Claire Ward’s campaign for Mayor. The hugely influential endorsement comes from the 51 elected members.\nClaire said: “Nottingham Labour resoundingly beat the Tories in May’s council elections, and I’m determined to do the same when I get the chance. I’m incredibly grateful to have their support.”\nIf you’d like to speak with Claire, ask a question, get involved in the campaign or pledge your support, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk",
  "https_www_claireward_co_uk_/https_www_claireward_co_uk_thank-you-ashfield-clp/content_69.html": "Claire Ward’s campaign to become Labour’s first East Midlands Mayor has taken another step forward thanks to Ashfield CLP, which has decided to nominate her.\nCommenting on the news Claire said: “We are growing support across our cities, towns and villages. This mayoralty matters, it isn’t just a ceremonial job. I have the energy and determination to beat the Tories.”\nIf you’d like support to get your own CLP to nominate Claire, or want to get involved in the campaign, you can do this by emailing contact@claireward.co.uk or send a message through the campaign website at claireward.co.uk"
}