{
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_category_Westminster-News/content_10.html": "Business confidence reaches lowest in two years 7th January 2025 LABOUR’S first Budget has left business confidence at its lowest in two years, new evidence suggests. In the last quarter of 2024, only 49 per cent of 4,808... Westminster News\nLocal MP welcomes free trade agreement 16th December 2024 On 15 December 2024, the UK became the first European nation to officially join the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP... Westminster News\nConservatives to force vote on Family Farm Tax 3rd December 2024 THE future of farmers across the UK will be the focus of a major Parliamentary vote in an effort to overturn Labour’s Family Farm Tax. Despite Labour Prime... Westminster News\nShadow Chancellor warns of inflation risks 26th November 2024 NEW figures this week show a sharp increase in the rate of inflation from 1.7 per cent to 2.3 per cent. This is a sharper increase than economists had... Westminster News\nMPs protest Winter Fuel Cuts with 250,000 signature petition 29th October 2024 MEL STRIDE, MP for Central Devon and Shadow Secretary of State for Work and Pensions, joined fellow Conservative MPs today outside Parliament as they prepared... Westminster News\nDisability Action Plan launched 12th February 2024 Mel Stride has launched a new Disability Action Plan as part of the government’s long-term plan to help disabled people including across Central Devon fulfil... Westminster News\nMel Stride welcomes Pharmacy First launch in Central Devon 5th February 2024 Mel Stride has welcomed the launch of the Conservative Government’s Pharmacy First approach, helping patients across Central Devon to receive care more quickly... Westminster News\nMel Stride marks Holocaust Memorial Day 27th January 2024 Mel Stride marked Holocaust Memorial Day by signing the Holocaust Educational Trust’s Book of Commitment in the House of Commons. In signing the book, Mel... Westminster News\nAutumn Statement 2022 17th November 2022 The full details of the Chancellor's Autumn Statement, delivered on 17th November 2022 can be found here: https://www.gov.uk/government/publications/autumn... Westminster News",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mp-receives-reassurance-future-moretonhampstead-hospital/content_18.html": "Mel Stride MP held a “very positive” meeting with Health Minister Edward Argar MP on Thursday over the future of Moretonhampstead Hospital. Mr Stride has been liaising with the Department for Health for several months over the future of the cottage hospital after being contacted by Julia Darby, Chief Executive of North East Dartmoor Care, which is based at the hospital. Ms Darby had been concerned that because the Royal Devon and Exeter Hospital (RD&E) has moved services out of the property then its future as a local health hub might be in doubt. Mr Stride received assurances from the minister that the hospital will remain as a local health hub with plans for further services to be agreed up amongst key stakeholders. A meeting of local providers to discuss the future of services will take place in early August.\nMr Stride said:\n“Moretonhampstead Hospital is a vital community facility and there is complete agreement among local stakeholders, including the GP Surgery and North East Dartmoor Care, that it must be retained as a key part of our local healthcare delivery. It was very reassuring to hear directly from the minister that the future of the hospital looks to be secure and I look forward to continuing to work with local stakeholders to ensure that the best possible range of care continues to be provided locally in Moretonhampstead.”\nPhoto: Mel at Moretonhampstead Hospital in 2018 meeting with North East Dartmoor Care, who had just moved into the hospital.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_cdn-cgi_l_email-protection/content_4.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_cookies/content_8.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_melstridemp_com_/http_www_melstridemp_com/content_1.html": "Latest News & Articles Local MP Meets Future Leaders During Visit to Crediton Sixth Form CENTRAL DEVON MP, Mel Stride, visited Queen Elizabeth School Sixth Form in… Families in Devon to be hit by £1,191 of extra costs LOCAL MP for Central Devon and Shadow Chancellor Mel Stride has warned that… Mel Stride highlights urgent need for adult literacy support A charity in Okehampton that helps adults overcome literacy challenges welcomed… Mel on Twitter Contact Westminster OfficeHouse of Commons, London SW1A 0AA020 7219 7037[email protected]On Twitter\nLocal MP Meets Future Leaders During Visit to Crediton Sixth Form CENTRAL DEVON MP, Mel Stride, visited Queen Elizabeth School Sixth Form in…\nFamilies in Devon to be hit by £1,191 of extra costs LOCAL MP for Central Devon and Shadow Chancellor Mel Stride has warned that…\nMel Stride highlights urgent need for adult literacy support A charity in Okehampton that helps adults overcome literacy challenges welcomed…",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_preserving-local-healthcare/content_31.html": "One of my key priorities as an MP has been maintaining (and where possible improving) local healthcare provision. I care deeply about our NHS and the principle of universal healthcare, free at the point of use, for those in need. Three years ago while serving as a treasury minister I was proud to help provide the largest ever cash increase for our NHS (an additional £20 billion a year in real terms by 2023-24, including an additional £2.3 billion a year for mental health).\nLocally in Central Devon I played a key role in getting NHS England to intervene when North Tawton Medical Practice was earmarked for closure, and when the old medical centre in Hatherleigh closed I successfully pressed NHS England to get the new site up and running. I lobbied the Secretary of State for Health for funding for the new health hub in Crediton (which opened earlier this year) and I worked closely with the Ashburton and Buckfastleigh League of Friends to persuade the Torbay and South Devon NHS Trust to retain the hospital building in Ashburton after it closed the hospital. It is now serving as a valuable Health and Wellbeing hub, providing a range of outpatient services. In Okehampton I have worked alongside local stakeholders to bring new outpatient services to their hospital and earlier this year I organised a ministerial meeting regarding the future of Moretonhampstead hospital, and secured an assurance that it will stay open.\nPreserving local healthcare provision is important for a number of reasons but near the top of the list is that our older residents need services to stay as local as possible, particularly those who no longer drive. When services are accessible and convenient they are used, but when they are not people sometimes don’t seek help when they need it. I was therefore proud back in 2011 when I helped to convince NHS Devon not to close the GP surgery in Pathfinder Village in Tedburn St Mary. For the past decade it has been a much-valued local amenity for the park home site – home to more than 400 older residents. However, its future is once again uncertain, after the St Thomas Medical Group, based in Exeter, wrote to local residents to say that a temporary closure of the surgery during the pandemic may be made permanent. Having reluctantly accepted the temporary closure on the grounds that the surgery could not be made Covid-secure, I will be fighting hard to prevent any possible permanent closure. With this in mind last week I met with local Teignbridge District Councillor Terry Tume at Pathfinder to launch a joint petition against its closure and signatures from local residents have been coming in thick and fast.\nMore from Mel at melstridemp.com.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news/content_22.html": "Local MP Meets Future Leaders During Visit to Crediton Sixth Form Monday, 7 April, 2025 CENTRAL DEVON MP, Mel Stride, visited Queen Elizabeth School Sixth Form in Crediton last week to speak to students about politics, democracy, and how young people can get involved in shaping the future of the country. During the visit, Mr Stride spoke to Year 12 and 13 students about their role as future voters and potential leaders, offering insight into life as a Member of Parliament and the... Local News\nFamilies in Devon to be hit by £1,191 of extra costs 7th April 2025 LOCAL MP for Central Devon and Shadow Chancellor Mel Stride has warned that families in Devon are in line for dramatic cost increases in the new tax year. It... Local News\nMel Stride highlights urgent need for adult literacy support 28th March 2025 A charity in Okehampton that helps adults overcome literacy challenges welcomed Central Devon MP, Mel Stride, for a visit to discuss the growing need for adult... Local News\nAward-winning Dartmoor hotelier tells Central Devon MP about concerns for hospitality sector 21st March 2025 The owner of an award-winning hotel in Dartmoor has expressed his concerns for the hospitality sector following “Labour’s anti-business Budget” – which saw the... Local News\nBrewing success: Mel Stride raises a cuppa to celebrate 10th Anniversary of Dartmoor Estate Tea 14th March 2025 Local success story Dartmoor Estate Tea spilled the tea on their remarkable 10-years with Central Devon MP, Mel Stride – who visited the business this week (14... Local News\nCentral Devon MP says “tax is crippling growth” after visiting award-winning local business 7th March 2025 MP for Central Devon, Mel Stride has said businesses are right to be concerned about the incoming ‘Jobs Tax’. The comments from the Shadow Chancellor come... Local News\nMel Stride supports men’s mental health in Okehampton 24th February 2025 In a continued effort to raise awareness around men’s mental health and provide support for those struggling with mental health issues, Central Devon MP, Mel... Local News\nLocal MP campaigns against farm tax at Westminster rally 11th February 2025 THE future of family farms was the focus of a major rally in Westminster on Monday, which saw farmer from across the country take to the streets of London in... Local News\nLocal MP visits thriving independent bookshop 10th February 2025 LOCAL MP, Mel Stride, dropped into The Bookery last week – Crediton’s independent, not for profit bookshop. The Bookery has been community-owned since 2013 and... Local News\nLocal MP takes part in railway heritage project 23rd January 2025 LOCAL MP, Mel Stride, sat down with Crediton-based Folklore Library & Archive this week to discuss his involvement in the reinstatement of the Dartmoor Line... Local News",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mel-visits-3-post-offices-christmas-countdown-continues/content_20.html": "As the countdown for Christmas continues, Central Devon MP and Treasury Minister Mel Stride popped into Okehampton, Chagford and Ashburton Post Offices today to recognise the valuable role the branches will play in providing vital services to customers within his constituency during the festive season.\nWith the big day fast approaching the post office teams were delighted to welcome their special visitor, it gave them the ideal opportunity to showcase the wide range of Post Office services available for customers this Christmas.\nMel said: “It was fantastic to meet the teams at Chagford and Okehampton post offices and to catch up with Stuart and his team in Ashburton. They provide such a vital service to their communities and I wish them every success for the future and especially during this busy period.”\nAlong with the wide range of Post Office products and services on offer, at both Post Offices this festive season it’s never been easier for people to access cash for Christmas shopping. The branches, along with all 11,500 Post Office branches across the country, offers everyday banking services for customers of all the main UK banks including cash withdrawals, deposits and balance enquiries.\nIf this Christmas customers are intending to shop from their sofa, then their local branch can help too as Post Office branches, including Okehampton, Chagford and Ashburton Post Offices, offer an easy way for shoppers to collect and return their online Christmas shopping. Finally and to add Christmas cheer to cards and gifts there are also Royal Mail’s special Christmas stamps available within all Post Office branches.\nBranch Manager at Chagford, Jessica Cookson was thrilled with the special Christmas visit from her local MP, she commented: “The Christmas countdown is well underway here at Chagford Post Office and we were delighted that Mel took time out from his busy schedule to pop in and recognise the valuable service we provide every day to the local community.”\nPostmaster at Okehampton, Hafiz Gul was pleased to host the visit from his local MP, he commented: “I was delighted to welcome Mel to my branch and we really appreciated the visit. We play a crucial role in providing services to the community throughout the year and it was nice to be recognised for the valuable service we offer.”\nTo find out more about the wide range of products and services available from the Post Office this Christmas visit www.postoffice.co.uk",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mel-pledges-use-new-westminster-role-champion-post-offices/content_27.html": "POST OFFICES have never been more vital to their communities according to Central Devon MP Mel Stride who has seen local bank branches disappear at a greater rate than almost anywhere else in the country. Mr Stride has been working closely with the South West’s representative on the National Federation of sub-postmasters, Stuart Rogers, to promote local post offices as an avenue for customers to carry out almost all their banking needs. After meeting again last week to record a video together to promote local post offices, the pair are working on a new campaign to promote the importance of local post offices, particularly in rural counties like Devon.\nStuart, who runs Ashburton Post Office with his wife Jackie, explained:\n“For a decade Mel has been one of the strongest voices in the country for our post offices and we are stepping up our efforts to promote their importance as a vital amenity, in some cases the only community shop, and as a hub of the community. It was very encouraging to hear that Mel hopes to use his Chairmanship of the Treasury Select Committee to champion the post office network.”\nMr Stride said:\n“The Government has set itself the admirable target of addressing the economic imbalance between different parts of the country and as part of that we need to see rural areas like Devon receive their fair share of funding. We have begun to see this with significant increases in education funding but I also hope to see it in other areas of economic policy and I will certainly be pressing the Treasury on its support for our post offices.”",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_central-devon-mp-says-tax-crippling-growth-after-visiting-award-winning-local-business/content_30.html": "MP for Central Devon, Mel Stride has said businesses are right to be concerned about the incoming ‘Jobs Tax’.\nThe comments from the Shadow Chancellor come following a tour of one of the region’s most celebrated local businesses - Tors Vodka in Okehampton.\nDespite their remarkable success - winning Gold in the prestigious Taste of the West Awards, for three consecutive years - the founders of Tors Vodka told Central Devon’s MP that scaling their business is becoming increasingly difficult due to rising taxes and escalating costs.\nFollowing the visit, Central Devon MP, Mel Stride said: “As an entrepreneur, who has built businesses from the ground up, I understand the difficulties small businesses like Tors Vodka are facing.\n“While it’s wonderful to see these local businesses gaining national recognition, it’s concerning to see how much harder it’s becoming for them to grow. Tax rises and increasing costs are crippling growth and creating significant barriers for entrepreneurs. Small businesses are the lifeblood of our economy, but these rising costs threaten their survival.”\nThe government’s national insurance rise will see businesses paying an additional £900 per employee for the average worker from April 6.\nMr Stride added: “The government needs to create an environment where businesses like Tors Vodka can continue to succeed, provide employment and contribute to the success of Central Devon for many years to come.”\nTors Vodka founders, Jonathan Bright and Edward Baily said: “It was great to welcome Mel to Tors Vodka, especially after he reached out to congratulate us following our Platinum and Gold wins. We really appreciate him taking the time to listen and understand the challenges we face. We’re in a fantastic position for growth, but ever-increasing taxes on the alcohol industry continue to hold us back - impacting both business expansion and job creation.”",
  "http_www_melstridemp_com_/http_www_melstridemp_com_privacy/content_2.html": "This document outlines how Mel Stride processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Mel Stride\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Mel Stride.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Mel Stride, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Mel Stride via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_families-devon-be-hit-ps1191-extra-costs/content_5.html": "LOCAL MP for Central Devon and Shadow Chancellor Mel Stride has warned that families in Devon are in line for dramatic cost increases in the new tax year.\nIt comes as a swathe of price increases are set to come into force from 6 April, with analysis showing that the average family could be hit with annual bill increases of £1,191 following the April hikes.\nEnergy bills will rise by an average of £111, Council Tax is set to rise by £109, and water bills could increase by as much as £123 per household.\nOther bills set to rise include car tax, TV licence fees, phone bills, broadband, and nursery fees.\nCommenting, Mel Stride, Shadow Chancellor of the Exchequer and Member of Parliament for Central Devon, said:\n“Today hard-working families across the country will see their cost of living rise yet again – and it's all thanks to this Labour government’s choices.\n“A whole litany of household bills is set to soar, with some increases running into the hundreds of pounds. Whether it’s council tax, energy, water, broadband or car tax, almost every corner of family life is about to get more expensive.\n“Yes, these bill hikes may come into force on April Fools’ Day, but there’s nothing funny about what Labour is doing to the country.”\nThese price rises come alongside increases in the rate of National Insurance that employers pay. The 1.2 percentage increase, coupled with the reduced threshold at which businesses start paying National Insurance contributions, is set to cost businesses £25 billion.\nThe Office of Budget Responsibility’s (OBR) independent economic forecast has confirmed that the average cost of employing someone will increase by £800, with the average business seeing their tax liability increase by £26,000. This is, on top of the £5 billion a year cost of the new Employment Rights Bill, is likely to trickle down into reduced wages for employees and see consumer prices increase dramatically.\nAt a time when the cost of living is increasing, the impact of these measures is likely to be devastating for many families across the country.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_shadow-chancellor-warns-inflation-risks/content_26.html": "NEW figures this week show a sharp increase in the rate of inflation from 1.7 per cent to 2.3 per cent. This is a sharper increase than economists had anticipated and is partly due to a rise in energy bills.\nAlthough prices are rising much more slowly than in the immediate aftermath of the outbreak of war in Ukraine, annual gas and electricity bills for a typical household went up by about £149 last month, causing the sharpest month-on-month increase in the rate of inflation for two years.\nEarlier this month, the Bank of England cut interest rates from 5 per cent to 4.75 per cent in a widely anticipated move resulting from inflation falling below the Bank’s target of 2 per cent after the unprecedented economic damage caused by the war in Ukraine and the Covid pandemic.\nHowever, the Bank warned that interest rates would not continue to fall at a steady rate unless inflation remained close to the 2 per cent target and raised concerns about spending commitments announced in the recent Budget.\nThe Office for Budget Responsibility and Bank of England have both said Labour’s Budget will keep inflation and mortgage rates higher for longer, and today’s inflation announcement signifies the beginning of this.\nMel Stride, MP for Central Devon and Shadow Chancellor, said: “Inflation is running ahead of expectations and above target.\n“While some credit must be given to international energy markets, Labour has agreed above-inflation pay deals – with no increased productivity requirements – and announced almost £70bn of extra spending each year.\n“Official forecasts state that inflation figures are not expected to improve because Labour’s Budget will push up inflation and mortgage rates.”",
  "http_www_melstridemp_com_/http_www_melstridemp_com_events_feed/content_29.html": null,
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mel-stride-mp-presses-government-retain-bank-englands-independence/content_21.html": "Mel Stride MP, who chairs the influential House of Commons Treasury Select Committee, argued forcefully in the House of Commons today on about the need for the Bank of England to retain its independence. His intervention came after recent suggestions from some parliamentarians that it should be curtailed.\nSpeaking during a debate on the Financial Services and Markets Bill currently going through Parliament, Mr Stride defended the record of the bank over the past 20 years and argued against those who have been overly critical of its record on inflation in recent months. Mr Stride acknowledged that the Bank was “not perfect” but that no central bank would have fared better given unprecedented global pressures on prices few of which could have been predicted. He argued:\n“It is vital that the Bank of England maintains its independence, that politicians are kept out of monetary policy and that politicians and chancellors do not determine interest rates going forward if we are going to have a credible approach to monetary policy.”\nIn response, Richard Fuller MP, Economic Secretary to the Treasury reassured Mr Stride that the Government had no plans to review the Bank of England’s independence.\nEarlier in the debate Mr Stride spoke of seizing the opportunity now we have left the European Union for a “lighter touch” on regulation for businesses.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_campaigns/content_7.html": "Education and Training Mel has been one of the leading campaigners for more education funding for Devon for over a decade. Working alongside other MPs and campaigners he helped to...\nHealth and Social Care Mel cares deeply about our NHS and the principle of universal healthcare, free at the point of use, to those in need. In 2018 as a treasury minister Mel helped...\nBusiness and Economy Mel's background is in entrepreneurship - he started his own business from scratch and grew it for 20 years both in the UK and abroad before being elected to...\nEnvironment The need to protect our environment for future generations was one of the reasons Mel got into politics in the first place. Before he was elected to Parliament...\nFarming Central Devon is one of the most rural constituencies in England and Mel has been a strong voice for our farming industry. He led legislation that introduced up...\nHousing Wages in Devon are below the national average but house prices here are higher than the national average. As a result, many families struggle to make their way...\nPost Offices Central Devon has the third most post offices of any constituency in England and one of Mel's top priorities as an MP has been to keep them open and, where...\nTransport In November 2020 the Government included an Okehampton to Exeter (via Crediton) rail service in its National Infrastructure Strategy (click here for more...",
  "http_www_melstridemp_com_/http_www_melstridemp_com_campaigns_housing/content_11.html": "Wages in Devon are below the national average but house prices here are higher than the national average. As a result, many families struggle to make their way onto the housing ladder. Although planning decisions are taken by local district and borough councils, Mel has done what he can to support the building of affordable housing, either through the creation of Community Land Trusts or as a part of a larger development. As a Treasury Minister he helped to increase national funding for affordable housing from £7billion to £9billion.\nMore than a thousand residents in Central Devon live in park home communities and Mel has helped lead efforts in Westminster to strengthen their legal rights as a key contributor to the 2013 Mobile Homes Act. The legislation included greater legal protections against unjustified pitch fee increases and greater enforcement powers for local authorities when it comes to ensuring landlords properly maintain their sites. He was instrumental in helping residents in Buckingham Orchard in Chudleigh Knighton set up a Residents' Association and has helped residents in New Park, Bovey Tracey, with various issues over many years, including local public transport provision.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_campaigns_health-and-social-care/content_14.html": "Mel cares deeply about our NHS and the principle of universal healthcare, free at the point of use, to those in need. In 2018 as a treasury minister Mel helped to provide the largest ever cash increase for our NHS (an addition £20 billion a year in real terms by 2023-24, including an additional £2.3 billion a year for mental health).\nLocally in Central Devon he has fought vigorously to preserve and where possible improve local healthcare provision. This includes playing a key role in getting NHS England to intervene when North Tawton Medical Practice was earmarked for closure and working with campaigners in Pathfinder Village to convince NHS Devon not to close their GP surgery. When the old medical centre in Hatherleigh closed Mel pressed NHS England to get the new site up and running.\nMel helped to lobby the Secretary of State for Health for funding for the brand new, purpose-build health hub in Crediton which was given the final go ahead in August 2020. It will result in the merger of the two existing GP surgeries in the town and improve healthcare provision for residents in both the town and its surrounding villages.\nMel worked closely with the Ashburton and Buckfastleigh League of Friends to persuade the Torbay and South Devon NHS Trust to retain the Ashburton Hospital building after it closed the hospital. It is now serving as a valuable Health and Wellbeing hub, providing a range of excellent outpatient services, including many that weren’t there before. He has also successfully pressed for the introduction of outpatient services at Okehampton and Moretonhampstead hospitals.\nPrior to his election as an MP Mel served as Co-Chair of the Crediton Hospital Campaign Group.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mel-given-tour-new-housing-development-exminster/content_24.html": "Exminster's Teignbridge District Councillors John Goodey and Kevin Lake have given Mel Stride MP a tour of a new housing development at the bottom of the village. 65 market-value properties including 17 affordable houses have been built at Sentrys Orchard, with a new access footpath and cycle way built directly into the development from the A379. The development includes sizeable open green space and an equipped play area.\nCllr Goodey, who lives less than a 30 second walk away from the development, explained:\n“There were understandably concerns about this development when it was given the go ahead several years ago, including from myself. However, it has delivered valuable affordable housing, helping local families afford to buy or rent locally rather than having to move further afield, and the new play park is giving young families at the bottom of the village a closer park than they had before. Exminster Parish Council is also playing its part by using money from the development to improve the traffic island at the A379 roundabout. By linking the pedestrian and cycle path outside to the development it will make it a safer crossing of the A379 and provide a useful link towards the Exe Estuary trail.”\nMel added:\n“I was encouraged to see that the promises made by the developers in terms of green space, play park provision and road access are being kept and that residents who are moving into the properties are enjoying living here.”",
  "http_www_melstridemp_com_/http_www_melstridemp_com_parliament/content_25.html": "Mel was elected as the first MP for the newly created constituency of Central Devon in 2010 - one of the most rural in England. He was re-elected in 2015, 2017 and 2019 with an increased share of the vote each time.\nFrom 2012-14 Mel served as a PPS (ministerial aide) in the Business Department and then the Energy Department. He helped to significantly increase the number of young people embarking on apprenticeships and helped to steer a major energy bill through the House of Commons (which has since helped to reduce UK greenhouse gas emissions). In 2014 Mel was promoted to the Whips Office as a Government minister.\nIn 2017 Mel was promoted to Financial Secretary to the Treasury and Paymaster General. He led legislation which cracked down on tax avoidance and evasion and helped to deliver the largest ever cash injection for the NHS. He also helped to reduce business rates for the majority of small high street traders and increased Government funding for affordable housing from £7billion to £9billion.\nMel was appointed as Leader of the House of Commons and Lord President of the Council in 2019. During his brief tenure he highlighted the need to safeguard our democracy against the scourge of fake news and spoke out against the abuse of female MPs.\nIn October 2019 Mel was elected as the Chair of the influential Treasury Select Committee. His nominations came from across the House of Commons (including from Labour and SNP MPs), reflecting his willingness to work with colleagues of all parties for the best interests of the country. During the coronavirus pandemic he has been at the forefront of scrutinising the Government’s economic policies and the support schemes to help both employers and employees. The Committee pressed the Chancellor successfully on issues such as the need for greater support for the self-employed and for workers returning from maternity or paternity pay.\nOn 25th October 2022 Mel was appointed as Secretary of State for Work and Pensions by Rishi Sunak.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mel-promotes-devon-county-councils-proud-care-recruitment-campaign/content_19.html": "Proud to Care Devon has launched a ‘Find Your Calling’ campaign to recruit 2,000 more care workers urgently in the county, particularly in domiciliary care and care homes. The campaign is encouraging anyone looking for a new challenge, with plenty of training opportunities, to consider if their skills and values are suitable for a career in care. The campaign emphasises that you don’t necessarily need qualifications or previous experience - what’s important are your core skills, values and your attitudes towards working with people who need care.\nThere are free and flexible training courses to help people to find the right role being offered by partners across Devon, including Learn Devon, City College Plymouth, South Devon College, Exeter College and Petroc College.\nCentral Devon MP Mel Stride, who met with Devon County Council’s Cabinet Member for Adult and Social Care James McInnes in August to discuss the challenges facing the care sector in Devon, said:\n“From the conversations I have had with carers who help to look after people in their own homes, and the visits I have made to local care homes, I constantly hear about how rewarding a career in care can be. Carers are unsung heroes and I would urge anyone thinking about a career change or any young person recently out of education who is unsure what they want to do next to seriously consider a career in care.”\nFor more information or to register your interest visit www.proudtocaredevon.org.uk/findyourcalling. Applicants will receive a call back and offered free one-to-one support to find out if a job in care and health is right for them.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_category_Speeches-in-Parliament/content_9.html": "Mel Stride MP: Tribute to Her Majesty Queen Elizabeth II 9th September 2022 \"Your service was an inspiration for us all. You could not have given us more. Thank you. Rest in Peace Queen Elizabeth.\" Watch Mel's tribute to Her Majesty... Speeches in Parliament\nMel backs 'bold measures' to tackle energy bills with typical family saving £1,000 8th September 2022 Mel Stride MP, who chairs the influential House of Commons Treasury Select Committee, spoke in the House of Commons today and broadly welcomed the package of... Speeches in Parliament\nMel Stride MP presses government to retain Bank of England's independence 7th September 2022 Mel Stride MP, who chairs the influential House of Commons Treasury Select Committee, argued forcefully in the House of Commons today on about the need for the... Speeches in Parliament\nMel presses Chancellor to retain Bank of England's independence 20th May 2022 Mel Stride MP, who chairs the influential House of Commons Treasury Select Committee, spoke passionately in the House of Commons this week about the need for... Speeches in Parliament\nWatch Mel respond to Autumn Budget 1st November 2021 Click on the video to watch Mel Stride MP respond to the Chancellor's Budget last Wednesday. As the Chair of the Treasury Select Committee he was the second MP... Speeches in Parliament",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_out-and-about/content_16.html": "It was great to be back at New Park in Bovey Tracey last week supporting their Summer Fete. More than a thousand older residents live in park homes across our constituency with New Park one of the two largest, along with Pathfinder Village in Tedburn St Mary. I have supported both over many years including lobbying to keep local bus services and helping to retain the Pathfinder Village GP surgery. I have also been active in Westminster. The Mobile Homes Act 2013 – to which I was a key contributor – provided park home residents with better protection against pitch fee increases, made it more difficult for owners to disrupt the sale of properties and gave local authorities greater powers to compel landlords to carry out essential works and fine them if they fail to do so. I followed the review of this legislation in 2018 and research will be carried out later this year into the 10% commission charge that residents face when selling their homes which many owners want to see abolished.\nWith my family I also visited the Lustleigh Village Show. It was a wonderful day out with the profits going to local causes such as the local pre-school and play park. I admire the show’s focus on promoting small local businesses with larger businesses generally excluded unless there is a strong local connection. Small businesses are the lifeblood of communities in Central Devon and the event could not have been a better showcase of high-quality local food and drink as well as handmade arts and crafts.\nLast weekend I met with the South West representative of the National Federation of Subpostmasters, Stuart Rogers, who runs one of the most successful and community-minded branches in our constituency. With Central Devon having the third most post office branches of the 650 constituencies in the UK, the need to preserve our branches has always been a top priority for me. This has been a tough challenge in the face of growing competition from online retailers and younger generations able to do almost everything they need on their phone. But post offices remain vital for many people – often older, often living in rural communities where their post office is also the only shop, often isolated with little or no access to public transport. They are also vital for businesses who have a post office branch far closer than their nearest bank. But there is cause for optimism with the Post Office now the largest UK retail network to open on a Sunday and £370million of Government investment between 2017 and 2021 helping modernise the network and deliver hundreds of thousands of additional opening hours every week. But the old adage has never been more true – if we want to keep our post offices, we need to use them or we will lose them.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_postoffices/content_12.html": "Central Devon has the third most post offices of any constituency in England and one of Mel's top priorities as an MP has been to keep them open and, where possible, increase their opening hours to help them stay viable.\nHe was instrumental in getting Ashburton Library moved into the Post Office (pictured) which has been a huge success, significantly increasing the library’s opening hours and increasing footfall at the post office as well. He also worked with a former apprentice at the branch in organising a local forum (believed to be a UK first) where sub-postmasters from across his constituency got together to discuss ideas and best practice.\nWhen Barclays Bank was refusing to let their customers withdraw money at local post office branches, Mel made an impassioned plea in the House of Commons. The next day Barclays reversed their decision - a victory for all Barclays customers in Central Devon who can now withdraw cash at their local post office rather than travel much further afield to their nearest Barclays branch.\nPrior to his election as an MP Mel raised 14,000 signatures door-to-door for his petition against the last Labour Government's post office closure programme which saw over a third of branches in the UK close. He also ran several 'Use it or Lose it' campaigns for specific branches to help encourage local communities to support their post offices.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_about-rss/content_13.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mps-protest-winter-fuel-cuts-250000-signature-petition/content_32.html": "MEL STRIDE, MP for Central Devon and Shadow Secretary of State for Work and Pensions, joined fellow Conservative MPs today outside Parliament as they prepared to present their ‘Keep Winter Fuel’ petition to the Treasury ahead of Wednesday’s Budget.\nThe petition calls for the Chancellor, Rachael Reeves, to reverse the decision to means test the Winter Fuel Payment at the Budget.\nThere has been much criticism of the policy, with Labour’s own advisory body deeming the legislation “not fit for purpose” and warning it could raise significantly less than expected while neglecting vulnerable pensioners.\nMel Stride, MP for Central Devon and Shadow Secretary of State for Work and Pensions, said: “The decision by the Labour Government to means test the Winter Fuel Payment will result in around 10 million pensioners losing up to £300.\nWith the energy price cap simultaneously rising by 10%, about two thirds of pensioners below the poverty line will lose out on benefits and many will have to make the terrible choice between heating and eating.\nWe are calling for the Chancellor to cancel this disastrous policy ahead of tomorrow’s Budget before it is too late.”\nMr Stride has previously criticised Labour for rushing the policy through without taking time to consider the impacts, ensure effective and fair implementation, or allow possible scrutiny by Parliament.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_local-mp-meets-future-leaders-during-visit-crediton-sixth-form/content_28.html": "CENTRAL DEVON MP, Mel Stride, visited Queen Elizabeth School Sixth Form in Crediton last week to speak to students about politics, democracy, and how young people can get involved in shaping the future of the country.\nDuring the visit, Mr Stride spoke to Year 12 and 13 students about their role as future voters and potential leaders, offering insight into life as a Member of Parliament and the importance of political engagement. The talk was followed by a lively Q&A session, with students raising questions on everything from climate change and the cost of living, to how MPs make decisions and represent their constituents.\nSpeaking after the visit, Mel Stride said: “It was a real pleasure to meet such thoughtful and engaged students at Queen Elizabeth Sixth Form. Their questions were sharp, passionate, and well-informed – exactly what we need from the next generation of voters.\n“I strongly believe that political education and open conversations like this are key to strengthening our democracy.”\nThe visit to Queen Elizabeth Sixth Form is part of Mr Stride’s ongoing commitment to engaging with young people across the constituency and encouraging political awareness and active citizenship from an early age.\nMr Stride has previously voiced concerns about growing political apathy amongst younger voters and has advocated for policies aimed at winning back votes from 18–24-year-olds. During the recent Conservative Party leadership contest, where Stride stood as a candidate, he outlined his idea for a scheme whereby the first £5,000 of National Insurance that a person pays to HMRC is put into a government ISA which can be used towards a deposit on a first home.\nStride’s visit to Queen Elizabeth Sixth Form was organised as part of the school’s mission to empower students to think critically and engage confidently with the world around them and comes after a recent school trip to the European Parliament.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mel-reviews-park-home-legislation-residents-new-park-bovey-tracey/content_15.html": "Resident in New Park, Bovey Tracey, met with their local MP today to discuss the Government’s review into park home legislation. Central Devon MP Mel Stride has a long history of fighting for improved rights for mobile park home residents and he was a key contributor to the Mobile Homes Act 2013 which provided park home residents with better protection against pitch fee increases, made it more difficult for owners to disrupt the sale of properties and gave local authorities greater powers to compel landlords to carry out essential works and fine them if they fail to do so. Five years on, the Government is reviewing the Act and consulting on whether it is having the desired effect.\nMel said:\n“The majority of park home sites, such as New Park, are well run but there have too many instances in my constituency and around the country where park home residents have been treated very badly by unscrupulous site owners. Problems have included everything from intimidation and the contravention of basic health and safety to unjustified pitch fee increases and the interference in the sale of a property so that the site owner can purchase it at below market value. I am very proud that The Mobile Home Act 2013 significantly improved the rights of park home residents but it is right that the impact of the legislation is reviewed to ensure it is working, particularly regarding to enforcement by local authorities. It was good to get feedback from the New Park Residents Association Chairman Colin Back and other local residents on this.”\nThere are more than a dozen mobile park homes in Mel’s constituency which are home to more than a thousand residents. These include Pathfinder Village in Tedburn St Mary, Oaklands Park in Okehampton, Dartbridge Manor in Buckfastleigh and Ashburton Park.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_map-locations/content_23.html": "Mel Stride - Standing up for Central Devon\nThe map below links to just a small fraction of Mel's work as an MP. Hopefully it provides a useful snapshot of his local activity, including some of the issues he has tackled in communities across our vast constituency.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_news_mp-urges-unpaid-carers-check-eligibility-ps290-monthly-allowance/content_17.html": "Unpaid carers have been hailed as unsung heroes by a Devon MP and the Devon County Council cabinet member for Adult and Social Care. Central Devon MP Mel Stride and Cllr James McInnes met in Chagford last week to discuss a range of issues relating to health and social care in Devon. These included safeguarding, recruitment, the tighter regulations being introduced from 2024 and the Health and Social Care Bill that was introduced in the House of Commons in July.\nThe pair also discussed the crucial role played by the 100,000 unpaid carers in Devon – those who help to care for a loved one or friend due to a lifelong condition, illness, disability, serious injury, mental health condition or addiction.\nCllr McInnes said:\n“Without the help provided by millions of unpaid carers across the UK our health and social care system would collapse. It is important they get the recognition they deserve and that any unpaid carer who is struggling to cope and needs to organise respite care contacts Devon County Council on 0345 1551 007 for more information.”\nMr Stride added:\n“Every unpaid carer is making a huge difference to someone else’s life. I strongly urge anyone who is caring for someone for more than 35 hours a week to check if they are eligible for the Carer’s Allowance of nearly £300 a month by visiting www.gov.uk/carers-allowance.”\nCarers UK estimates that around 1 in 8 adults, around 6.5 million people, are carers, saving the economy around £132 billion a year – equivalent to the entire NHS budget, excluding Covid-19 costs.",
  "http_www_melstridemp_com_/http_www_melstridemp_com_survey/content_6.html": "Tweet Tell Mel what you think. Mel Stride MP Survey Current Mel Stride MP Survey Your details Leave this field blank Do you usually feel safe where you live? Yes No Not Sure / Not applicable Are you happy with the recycling services you receive from your local council? Yes No Not Sure / Not applicable Was the government right to put up the State Pension in line with the Triple Lock (8.5%)? Yes No Not Sure / Not applicable Are you satisfied with the service you receive from your local GP surgery? Yes No Not Sure / Not applicable If a parent or carer of a school-aged child, are you satisfied with the quality of the education provision at your local school? Yes No Not Sure / Not applicable Do you think the government is doing enough to meet its net zero targets? Yes No Not Sure / Not applicable Do you have access to superfast broadband where you live? Yes No Not Sure / Not applicable Do you have a decent mobile phone signal where you live? Yes No Not Sure / Not applicable Do you think Mel is doing a good job as your local Member of Parliament? Yes No Not Sure What are the 3 key issues that matter to you the most?",
  "http_www_melstridemp_com_/http_www_melstridemp_com_accessibility/content_3.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}