{
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_cube-disability-daventry/content_14.html": "As soon as I was informed about the potential closure of The Cube Disability in Daventry, I contacted the Leader and Cabinet Member of West Northamptonshire Council to address this issue. They have confirmed they are aware of the issue and are contacting the head landlord for the units. I will monitor this situation closely and provide updates as soon as I receive more information.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_map-locations/content_32.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_events_feed/content_8.html": null,
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_stuarts-advice-surgery/content_4.html": "Please get in touch on [email protected] with any enquiries, or by using the below button.\nI hold regular advice surgeries for my constituents, which I balance across the constituency the best I can.\nUpcoming dates and locations for 2025 are below, with future dates to follow:\n- Saturday 26 April - Long Buckby Ward\n- Saturday 17 May - Daventry Wards\n- Saturday 21 June - Earls Barton Ward\n- Saturday 19 July - Braunston & Crick Ward\nIf you would like to meet with me to discuss any concerns you are having, either at one of the above Surgeries or at another date or time, please do get in touch as I am happy to work with my constituents to ensure I am as available to you as I can be.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-visits-little-dessert-shop-daventry/content_13.html": "I recently had the opportunity to meet with the manager of Little Dessert Shop. It was a delight to explore their offerings and learn about their future plans. I'm looking forward to visiting again soon to enjoy some sweet treats!\nIf you're interested in having me visit your business in the Daventry Constituency or if you need any assistance, please email me at [email protected]",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-speaks-creative-industries-general-debate/content_31.html": "Pleased to speak at the Creative Industries General Debate, where I emphasised the importance of our creative sectors.\nThey provide the news that informs our democracy, the events and shows that showcase our talent, and the films and art that we all love to see.\nThe imagination of our designers, writers, artists and creators is world leading and brings joy, inspiration and opportunity to our lives.\nI'm proud of the Conservatives record in backing our creative industries and I urge HM Treasury to think again about the impact of their Budget choices on the sector.\nClick here to listen to my speech",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-supporting-braunston-crick-candidates/content_15.html": "Great weather to be out campaigning. Today helping Conservative Candidates Alan Chantler and Steve Kerr in Braunston and Crick.\nGreat weather to be out campaigning. Today helping Conservative Candidates Alan Chantler and Steve Kerr in Braunston and Crick.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_veday/content_30.html": "Get creative and help celebrate the 80th Anniversary of VE Day\n2025 marks 80 years since the end of the Second World War, with Victory in Europe (VE) Day on 8 May 1945.\nTo celebrate this momentous occasion, Stuart invites all young artists across the Daventry Constituency to unleash their creativity this Easter. Children of all ages are encouraged to design a colourful and vibrant poster that captures the spirit of celebration.\nThink street parties, poppies, waving Union Flags and emotional family reunions — anything that symbolises the joy felt on VE Day.\nFUN FACT - Did you know FISH & CHIPS were one of the only foods not to be rationed during the war?\nThe creator of the winning entry will receive a VE Day Commemorative Flag and their design on display at the Daventry Museum – the perfect tribute to this historic day!\nThe deadline for entries is Friday, 2 May 2025. Artwork can be submitted either by post or email:\n- Post/hand deliver: Stuart Andrew MP, iCon Centre, Eastern Way, Daventry NN11 0QB\n- Email (scanned copies): stuart.andrew,[email protected]\nThe poster can be on A4 or A3 paper or card, with entry details on the back. For guidance, you can also download a template with entry details at the bottom of this page.\nEntry details must include the artist's name, age, and a parent or guardian's contact email / phone number.\nStuart looks forward to seeing your wonderful creations! Good luck!\nBy entering, you agree that the office of Stuart Andrew MP may contact you regarding the competition and may display your artwork publicly in Daventry and on social media platforms as part of the celebrations.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-visits-lambs-easter/content_28.html": "The sun is shining! It's peak lambing season in the Daventry Constituency and across Northamptonshire.\nHave you seen the lambs in the fields? Perhaps you have visited them at a local farm, a tradition many families enjoy during Easter.\n*These lamb photos are from Mini Meadows Farm in Welford.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_feed/content_6.html": null,
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-speaks-national-youth-strategy-debate-ncs/content_24.html": "Earlier today I spoke in the Commons on the National Youth Strategy Debate which you can access here.\nI share David's deep disappointment in Labour's decision to scrap the National Citizen Service - a programme he had the foresight to establish.\nSince 2011, NSC has transformed the lives of 750,000 young people, with an extraordinary 93% satisfaction rate. I've had the privilege of visiting many NSC projects and seeing first hand how it brings young people from all backgrounds together, and hearing their enthusiasm for the programme. By ending this successful programme, Labour will deprive thousands of young people of vital opportunities for growth, social mobility and community engagement.\nThis is the wrong decision that will leave a significant gap in youth services, and I'm particularly concerned about provision in the interim period. While I welcome the broader youth strategy and will work constructively with the government, ending NSC is a serious mistake.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_cdn-cgi_l_email-protection/content_7.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_about-rss/content_5.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_surveys/content_2.html": "I want everyone in our constituency to have their say, so I will run surveys to allow residents, local groups, organisations, and local businesses to share their views on important topics and issues.\nI want everyone in our constituency to have their say, so I will run surveys to allow residents, local groups, organisations, and local businesses to share their views on important topics and issues.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-supporting-candidate-simon-philip-smith/content_23.html": "Get creative and help celebrate the 80th Anniversary of VE Day2025 marks 80 years since the end of the Second World War, with Victory in Europe (VE) Day on 8 May 1945.To celebrate this momentous occasion, Stuart invites all young artists across the Daventry Constituency to unleash their creativity t",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_accessibility/content_17.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_privacy/content_19.html": "This document outlines how Stuart Andrew processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Stuart Andrew\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Stuart Andrew.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Stuart Andrew, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Stuart Andrew via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_category_Newsletters/content_22.html": "Stuart's Monthly Newsletter #1 1st December 2024 I'm delighted to share the first edition of my newsletter, which will be sent to subscribers monthly to share what I’ve been doing as your Member of Parliament... Newsletters",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_category_Articles/content_29.html": "Back to Parliament 8th January 2025 I hope everyone had a good Christmas and I would like to wish everyone a happy and healthy New Year! My December newsletter has recently been published where If... Articles\nStuart pleased to support Safer Gambling Week 2024 21st November 2024 I'm proud to supporting Safer Gambling Week 2024. Having previously served as Sports & Gambling Minister, I know how vital it is to promote safer betting tools... Articles",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_category_European-News/content_16.html": "Stuart visits Christmas Card Competition Winner's school 13th December 2024 This morning I was delighted to visit Braunston CE Primary School, home to this year's winner of my Christmas Card Competition. During the school assembly, I... European News",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_newslettersubscribe/content_26.html": "Want to stay up to date about what Stuart is up to in the Constituency and Westminster? Sign up for his monthly newsletter and get the latest news sent straight to your inbox!\nYou can view Stuart's newsletter below:\nWant to stay up to date about what Stuart is up to in the Constituency and Westminster? Sign up for his monthly newsletter and get the latest news sent straight to your inbox!\nYou can view Stuart's newsletter below:",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_category_Local-News/content_25.html": "VE DAY POSTER COMP 17th April 2025 Get creative and help celebrate the 80th Anniversary of VE Day 2025 marks 80 years since the end of the Second World War, with Victory in Europe (VE) Day on 8... Local News\nVE DAY POSTER COMP 17th April 2025 Get creative and help celebrate the 80th Anniversary of VE Day 2025 marks 80 years since the end of the Second World War, with Victory in Europe (VE) Day on 8... Local News\nStuart visits Little Dessert Shop in Daventry 16th April 2025 I recently had the opportunity to meet with the manager of Little Dessert Shop. It was a delight to explore their offerings and learn about their future plans... Local News\nThe Cube Disability in Daventry 15th April 2025 As soon as I was informed about the potential closure of The Cube Disability in Daventry, I contacted the Leader and Cabinet Member of West Northamptonshire... Local News\nDaventry outdoor swimming pool? 13th April 2025 It was a pleasure to meet with Tim and Pete on Friday, April 11, to discuss their plans for reopening the Outdoor Pool in Daventry. We also explored the... Local News\nStuart visits the lambs this Easter 10th April 2025 The sun is shining! It's peak lambing season in the Daventry Constituency and across Northamptonshire. Have you seen the lambs in the fields? Perhaps you have... Local News\nStuart supporting candidate Simon Philip-Smith 6th April 2025 Afternoon campaigning in Brixworth for Simon Philip-Smith for the local West Northamptonshire elections 2025 Local News\nStuart supporting candidate Richard Auger 6th April 2025 Another beautiful day to be out campaigning. This morning out in Naseby and Sibbertoft working for the local elections on May 1st for Richard Auger Local News\nStuart supporting Braunston & Crick candidates 5th April 2025 Great weather to be out campaigning. Today helping Conservative Candidates Alan Chantler and Steve Kerr in Braunston and Crick. Local News",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-visits-byfield-big-breakfast/content_10.html": "WATCH MY VIDEO HERE!\nI had the most wonderful time at the Byfield Big Breakfast this morning! It was great to connect with local residents over a lovely breakfast. Huge thanks to Lyn and your amazing team for all the hard work—you are all a credit to our community!\nMark your calendars for the next Big Breakfast at the Byfield Village Hall on May 8th! Everyone is invited, and you won't want to miss the VE Day celebrations being shown on the big screen! It’s going to be a fantastic event!",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news/content_9.html": "VE DAY POSTER COMP Thursday, 17 April, 2025 Get creative and help celebrate the 80th Anniversary of VE Day 2025 marks 80 years since the end of the Second World War, with Victory in Europe (VE) Day on 8 May 1945. To celebrate this momentous occasion, Stuart invites all young artists across the Daventry Constituency to unleash their creativity this Easter. Children of all ages are encouraged to design a colourful and vibrant poster that... Local News\nVE DAY POSTER COMP 17th April 2025 Get creative and help celebrate the 80th Anniversary of VE Day 2025 marks 80 years since the end of the Second World War, with Victory in Europe (VE) Day on 8... Local News\nStuart visits Little Dessert Shop in Daventry 16th April 2025 I recently had the opportunity to meet with the manager of Little Dessert Shop. It was a delight to explore their offerings and learn about their future plans... Local News\nThe Cube Disability in Daventry 15th April 2025 As soon as I was informed about the potential closure of The Cube Disability in Daventry, I contacted the Leader and Cabinet Member of West Northamptonshire... Local News\nDaventry outdoor swimming pool? 13th April 2025 It was a pleasure to meet with Tim and Pete on Friday, April 11, to discuss their plans for reopening the Outdoor Pool in Daventry. We also explored the... Local News\nStuart visits the lambs this Easter 10th April 2025 The sun is shining! It's peak lambing season in the Daventry Constituency and across Northamptonshire. Have you seen the lambs in the fields? Perhaps you have... Local News\nStuart supporting candidate Simon Philip-Smith 6th April 2025 Afternoon campaigning in Brixworth for Simon Philip-Smith for the local West Northamptonshire elections 2025 Local News\nStuart supporting candidate Richard Auger 6th April 2025 Another beautiful day to be out campaigning. This morning out in Naseby and Sibbertoft working for the local elections on May 1st for Richard Auger Local News\nStuart supporting Braunston & Crick candidates 5th April 2025 Great weather to be out campaigning. Today helping Conservative Candidates Alan Chantler and Steve Kerr in Braunston and Crick. Local News\nStuart visits the Byfield Big Breakfast 5th April 2025 WATCH MY VIDEO HERE! I had the most wonderful time at the Byfield Big Breakfast this morning! It was great to connect with local residents over a lovely... Local News",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk/content_1.html": "Recently I lanuched my first Agricultural Forum and was delighted to be joined on the panel by the Shadow Secretary of State for DEFRA, the Rural Crime Team Inspector at Northamptonshire Police, the West Northamptonshire Council Cabinet Member for Local Economy, Culture and Leisure and the NFU County Advisor for Northamptonshire.\nI'd like to say a huge thank you to the 100+ farmers who attended, as well as the panel and all those who helped to make the forum happen behind the scenes.\nI'm planning our next meeting this October. If you're interested in attending or if I can assist you in any way, please email me at [email protected]",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_parliament-0/content_21.html": "Here, you can read Stuart Andrew's latest speeches and appearances in Parliament or see further information about Stuart in Parliament\nCulture, Media and Sport: Topical Questions ( 3 Apr 2025)\nStuart Andrew: May I congratulate Newcastle United on its amazing win in the Carabao cup final? I share the Secretary of State’s remarks about the 80th anniversary of VE Day, and we all hope that the ceremonies around the country will be enjoyed by everybody. In just three days, national insurance bills will fall on the doormats of charities across the country, and they will have to find another £1.4...\nCulture, Media and Sport: Topical Questions ( 3 Apr 2025)\nStuart Andrew: We supported charities through the pandemic with millions and millions of pounds and with the £100 million cost of living fund. Month after month, we have urged the Secretary of State to tell the Chancellor that this policy is wrong and will do irreversible harm. We now hear that one charity a day is closing because of Government decisions. How many will have to close before the Government...\nWritten Answers — Department for Culture, Media and Sport: Youth Services: Finance ( 3 Apr 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, with reference to the Spring Statement of 26 March 2025, what assessment she has made of the potential impact of changes to her Department's planned budget for the 2025-26 financial year on the provision of youth services.\nWritten Answers — Department for Culture, Media and Sport: Streaming: Subscriptions ( 3 Apr 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, whether she has had recent discussions with the Secretary of State for Business and Trade on the potential impact of the subscriptions regime in the Digital Markets, Competition and Consumers Act 2024 on the level of investment in the video on-demand sector.\nWritten Answers — Department for Culture, Media and Sport: Streaming: Subscriptions ( 3 Apr 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, whether she has had recent discussions with the Secretary of State for Business and Trade on the effectiveness of proposed exemptions to cooling-off rights within the Digital Markets, Competition and Consumers Act 2024 subscription regime for preventing consumers from accessing digital content for free.\nWritten Answers — Department for Culture, Media and Sport: Media Act 2024 ( 3 Apr 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what discussions her Department has had with Ofcom on the implementation of the Media Act 2024.\nWritten Answers — Department for Culture, Media and Sport: Media Act 2024 ( 3 Apr 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, whether she is taking steps with Ofcom on implementing fair terms of carriage for public service broadcasters on streaming platforms under the Media Act 2024.\nWritten Answers — Department for Culture, Media and Sport: Charities: Finance ( 3 Apr 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, with reference to the Spring Statement of 26 March 2025, what assessment she has made of the potential impact of changes to her Department's planned budget for the 2025-26 financial year on support for charities.\nWritten Answers — Department for Business and Trade: Cultural Heritage and Tourist Attractions: Subscriptions ( 1 Apr 2025)\nStuart Andrew: To ask the Secretary of State for Business and Trade, what assessment he has made of the potential impact of proposals on cooling-off rights in the consultation on the implementation of the new subscription contracts regime, published on 18 November 2024, on (a) the heritage sector and (b) visitor attractions.\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, with reference to the Written Ministerial Statement on Local Government Finance on 24 February 2025, HCWS461, whether her Department plans to take steps to prevent local authorities from disposing of community and heritage assets.\nWritten Answers — Ministry of Housing, Communities and Local Government: Planning Permission: Listed Buildings (31 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, with reference to the Government response to the proposed reforms to the National Planning Policy Framework and other changes to the planning system consultation, last updated on 27 February 2025, whether she plans to provide local authorities with powers to charge a fee for Listed Building Consent planning applications.\nWritten Answers — Ministry of Justice: Telecommunications: Civil Proceedings (31 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Justice, if she will make an estimate of the number of mobile infrastructure litigation cases that have been processed via the Upper Tribunal Lands Chamber following changes to the Electronic Communications Code 2017; and if she will make an assessment of the potential impact on caseloads of changes to be introduced via the Product Security and...\nWritten Answers — Department for Culture, Media and Sport: Listed Places of Worship Grant Scheme (18 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, pursuant to the Answer of 5 March 2025 to Question 33865, on Listed Places of Worship Grant Scheme, if she will place a copy of the (a) internal Equality Impact Assessment and (b) equality screening in the Library of the House.\nWritten Answers — Department for Culture, Media and Sport: Gambling: Reform (12 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, whether she plans to implement the policies set out in the policy paper entitled High stakes: gambling reform for the digital age, published on 27 April 2023; and if she will make an assessment of the potential impact of the policies in that white paper on the land-based gambling industry.\nWritten Answers — Department of Health and Social Care: Attention Deficit Hyperactivity Disorder: Diagnosis (11 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, what assessment he has made of the potential impact of the 2025/26 NHS Payment Scheme Consultation on existing waiting times for an ADHD diagnosis.\nWritten Answers — Department of Health and Social Care: Attention Deficit Hyperactivity Disorder: Diagnosis (11 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, what assessment he has made of the potential impact of the 2025/26 NHS Payment Scheme Consultation on the ability of patients to access medication for ADHD.\nWritten Answers — Department for Education: PE and Sport Premium (11 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Education, whether she plans to provide funding for the PE and sport premium for primary schools in the 2025-26 financial year.\nWritten Answers — Department for Education: PE and Sport Premium (11 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Education, what steps her Department is taking to ensure that all school-age children have access to high quality physical education.\nWritten Answers — Department for Culture, Media and Sport: Listed Places of Worship Grant Scheme ( 6 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, pursuant to the Answer of 25 February 2025 to Question 31424 on the Listed Places of Worship Grant Scheme, whether her Department has undertaken an equality impact assessment of changes to that scheme.\nWritten Answers — Department for Culture, Media and Sport: Physical Education and Sports ( 4 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what discussions she has had with the Secretary of State for Education on the potential merits of physical education in the national curriculum on future engagement with sport\nWritten Answers — Department for Culture, Media and Sport: Tennis: Finance ( 4 Mar 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, whether her Department plans to provide funding for grassroots tennis.\nWritten Answers — Department for Culture, Media and Sport: Historic Buildings: Repairs and Maintenance (27 Feb 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what discussions she has had with (a) the Church of England, (b) the Roman Catholic Church and (c) representatives of non-conformist churches on funding for the (i) restoration and (ii) preservation of historic buildings.\nWritten Answers — Department for Culture, Media and Sport: Listed Places of Worship Grant Scheme (27 Feb 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what recent correspondence she has received from Historic England on the Listed Places of Worship scheme.\nWritten Answers — Department for Culture, Media and Sport: Department for Culture, Media and Sport: Historic England (27 Feb 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, how many meetings she had had in the last six months with Historic England on listed places of worship that are at risk.\nWritten Answers — Department for Culture, Media and Sport: Department for Culture, Media and Sport: Churches (25 Feb 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, how many meetings she has had with (a) the Church of England, (b) the Roman Catholic Church and (c) representatives of non-conformist churches in the last six months.\nWritten Answers — Department for Culture, Media and Sport: Sports: Concussion ( 3 Feb 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what steps her Department is taking to monitor the implementation of the Concussion Guidelines for Grassroots Sport.\nWritten Answers — Treasury: Gift Aid (30 Jan 2025)\nStuart Andrew: To ask the Chancellor of the Exchequer, whether she has plans to make changes to the rules on gift aid.\nCulture, Media and Sport: Topical Questions (16 Jan 2025)\nStuart Andrew: January is traditionally a time when people commit to exercising more, and it is the perfect opportunity to encourage a more active nation—\nCulture, Media and Sport: Topical Questions (16 Jan 2025)\nStuart Andrew: Bingo! I knew he would do that. I am proud that in government we had a sport strategy and set up the national physical activity taskforce, which brought together Departments, delivery partners and industry to work to increase activity rates. May I ask the Secretary of State when the taskforce last met, whether it discussed the impact of the jobs tax on the sector’s ability to get more...\nCulture, Media and Sport: Topical Questions (16 Jan 2025)\nStuart Andrew: The murder of Jimmy Mizen sadly sticks in the minds of many of us. An investigation by The Sun has revealed that his killer, Jake Farhi, is the masked rapper who has shockingly been promoted by the BBC despite his lyrics sickeningly boasting about killing and other crimes. Will the Secretary of State join me in calling for an investigation into how the BBC allowed this to happen? I cannot...\nWritten Answers — Department for Culture, Media and Sport: Listed Buildings: Carbon Emissions (13 Jan 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what discussions she department has had with the Secretary of State for Energy Security and Net Zero on the decarbonisation of listed buildings.\nWritten Answers — Ministry of Housing, Communities and Local Government: Planning Authorities: Staff (10 Jan 2025)\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, with reference to her Written Statement of 30 July 2024 on Building the homes we need, HCWS48, how many of the new planning officers will have the expertise to handle historic and traditionally constructed buildings.\nWritten Answers — Department for Culture, Media and Sport: Historic Buildings: Energy ( 8 Jan 2025)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, with reference to Section 5.2 of Adapting historic homes for energy efficiency: a review of the barriers, what progress has been made on Historic England’s review into the barriers to delivering the Level 3 Award in Energy Efficiency Measures for Older and Traditional Buildings.\nWritten Answers — Treasury: Cultural Heritage: Tax Allowances ( 7 Jan 2025)\nStuart Andrew: To ask the Chancellor of the Exchequer, what assessment she has made of the potential impact of changes to (a) Business and (b) Agricultural Property Relief on the heritage sector.\nStuart Andrew: To ask the Secretary of State for Environment, Food and Rural Affairs, what steps his Department is taking to review the Animal Welfare (Licensing of Activities Involving Animals) (England) Regulations 2018.\nWritten Answers — Treasury: Music Venues: Business Rates (12 Dec 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, if she will make an assessment of the potential impact of forthcoming changes to business rate relief on the viability of grassroots music venues.\nWritten Answers — Department for Education: Pre-school Education: Employers' Contributions ( 9 Dec 2024)\nStuart Andrew: To ask the Secretary of State for Education, what financial support she plans to provide to the Early Years sector to help manage the impact of proposed changes to employer National Insurance contributions.\nCulture, Media and Sport: Topical Questions (28 Nov 2024)\nThank you, Mr Speaker, and a very happy birthday to the Clerk of the House. As we have heard time and again today, and in the past few weeks, the Government’s jobs tax could cost £2.8 billion to the Department’s sectors—to the arts, sport, music, hospitality and tourism. Was the Secretary of State blindsided by the Budget, as the Secretary of State for Environment, Food and Rural...\nCulture, Media and Sport: Topical Questions (28 Nov 2024)\nSo it sounds like the right hon. Lady did know, which is interesting, given that she cares about charities as much as I do. They face a £1.4 billion bill. When they needed help the most, we gave them £100 million. Her Government are now going to take 14 times that amount back from them. We heard yesterday that the Teenage Cancer Trust will have to find an extra £300,000, and Marie Curie...\nHouse of Commons Debate - National Youth Strategy (12 Nov 2024)\nStuart Andrew: I thank the Secretary of State for advance sight of her statement. Let me begin by saying that the Opposition really do welcome any focus that the Government are putting on young people. I recall from my time in the Department that spending time in the youth sector provided some of the most inspiring moments of my time as a Minister. In government, we had a proud record of listening to young...\nWritten Answers — Department of Health and Social Care: Mental Health Services: Children (11 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, whether he plans to increase investment into the children's mental health system to (a) reduce waiting times for and (b) increase access to support.\nWritten Answers — Department for Culture, Media and Sport: Listed Places of Worship Grant Scheme (11 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, whether her Department will continue to support the continuation of the Listed Places of Worship Grant Scheme which is due to expire in March 2025.\nWritten Answers — Department for Transport: Motorway Service Areas: Greater London ( 8 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Transport, whether she plans to extend the lease on the Motorway Service Area at Watford Gap.\nWritten Answers — Department for Transport: Motorway Service Areas: Greater London ( 8 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Transport, what steps her Department is taking to resolve the status of lease renewals of Motorway Service Areas.\nWritten Answers — Department for Transport: Motorway Service Areas: Greater London ( 8 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Transport, what discussions her Department has had with Motorway Service Area operators on the renewal of leases for those areas.\nWritten Answers — Department for Culture, Media and Sport: Gambling: Economic Situation ( 7 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what estimate she has made of the contribution of the betting and gaming industry to the UK economy.\nWritten Answers — Department for Culture, Media and Sport: Gambling: Taxation ( 5 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what assessment she has made of the potential impact of increasing gambling taxes on employment in (a) high street bookmakers, (b) high street adult gaming centres and (c) bingo halls.\nWritten Answers — Department for Culture, Media and Sport: Gambling: Taxation ( 5 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what assessment she has made of the potential impact of an increase in machine gaming duty on bingo halls.\nWritten Answers — Department for Culture, Media and Sport: Gambling: Taxation ( 5 Nov 2024)\nStuart Andrew: To ask the Secretary of State for Culture, Media and Sport, what assessment she has made of the potential impact of increases in machine gaming duty on high streets.\nBudget: Implications for Farming Communities ( 4 Nov 2024)\nStuart Andrew: In the Minister’s opening answer, we sadly heard more Government slogans and soundbites than real understanding of the fear that Daventry farmers have been telling me about. I can assure him that they have been looking at the detail in great detail. One of them, whose father is sadly coming to the end of his life, is now actively looking to sell off land because they simply cannot make the...\nEducation: Topical Questions ( 4 Nov 2024)\nStuart Andrew: Thank you, Mr Speaker. It has been a while since I have spoken! Those at Buckton Fields school in my constituency were delighted when they had a newly constructed building, but that delight was sadly short-lived, as there were defects. As a consequence, with interim arrangements, the school’s roll has gone up and down, and now it has a £45,000 shortfall in its budget. Will the Minister...\nWritten Answers — Department of Health and Social Care: Mental Health Services: Children and Young People (28 Oct 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, what steps he is taking to ensure that the Mental Health Bill will (a) protect and (b) enhance the rights of (i) children and (ii) young people who are (A) detained in and (B) admitted informally to mental health hospitals.\nWritten Answers — Treasury: Tax Avoidance (25 Oct 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, what assessment she has made of the potential implications for her policies of the recommendations in Loan Charge Resolution’s letter to the Exchequer Secretary to the Treasury, dated 7th August 2024.\nWritten Answers — Department for Education: Educational Institutions: Mental Health Services (25 Oct 2024)\nStuart Andrew: To ask the Secretary of State for Education, what steps she is taking to embed a Whole Education Approach to mental health and wellbeing in all education settings.\nWritten Answers — Department of Health and Social Care: Mental Health Services: Children (23 Oct 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, whether he plans to increase investment into the children's mental health system to (a) reduce waiting times for and (b) increase access to support.\nWritten Answers — Department for Transport: Roads: Repairs and Maintenance (21 Oct 2024)\nStuart Andrew: To ask the Secretary of State for Transport, how much funding her Department plans to provide for road infrastructure in each of the next three financial years.\nWritten Answers — Treasury: Tax Avoidance (16 Oct 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, how many suicides of people facing the Loan Charge HMRC has referred to the Independent Office of Police Conduct.\nWritten Answers — Treasury: Tax Avoidance: Prosecutions (16 Oct 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, how many (a) promoters and (b) operators of schemes now subject to the Loan Charge have been prosecuted.\nWritten Answers — Ministry of Housing, Communities and Local Government: Retail Trade: Empty Property (18 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, with reference to the oral contribution of 2 September 2024 by the Parliamentary Under-Secretary of State for Housing, Communities and Local Government, Official Report, Column 3, if she will publish a timetable for implementing high street rental auctions.\nWritten Answers — Ministry of Housing, Communities and Local Government: Social Services: Finance (17 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, whether the Local Government Finance Settlement will contain measures to reform adult social care funding.\nWritten Answers — Ministry of Housing, Communities and Local Government: Local Government Finance (17 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, whether she plans to redistribute assets and wealth between different (a) local authorities, (b) communities and (c) local government through the Local Government Finance Settlement.\nWritten Answers — Ministry of Housing, Communities and Local Government: Local Government Finance (17 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, whether she plans to change the local government funding formula in the upcoming Local Government Finance Settlement; and whether she plans to consult on (a) technical changes and (b) data sources before publication.\nWritten Answers — Ministry of Housing, Communities and Local Government: Hospitality Industry: Smoking (16 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Housing, Communities and Local Government, what steps her Department has taken to facilitate (a) restaurants and (b) pubs to offer outdoor smoking facilities since 2010.\nWritten Answers — Department of Health and Social Care: Smoking: Hospitality Industry (13 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, whether his Department has carried out impact assessments of the Government’s plans to ban (a) smoking and (b) vaping (i) in pub gardens, (ii) at outdoor restaurant tables, (iii) at outdoor shisha bar seating and (iv) in outdoor nightclubs.\nWritten Answers — Department of Health and Social Care: Smoking: Hospitality Industry (13 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, what assessment he has made of the potential impact of the Government's proposals to ban outdoor smoking and vaping in and by pubs on the number of pub closures.\nWritten Answers — Department of Health and Social Care: Smoking: Hospitality Industry (13 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, whether his Department has carried out an impact assessment of the Government’s plans to ban (a) smoking and (b) vaping across university campuses.\nWritten Answers — Department of Health and Social Care: Smoking: Hospitality Industry (13 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, whether he plans to consult on banning smoking and vaping outside pubs, nightclubs and restaurants; and whether he has a planned timetable for the proposed ban.\nWritten Answers — Department of Health and Social Care: Smoking: Hospitality Industry (13 Sep 2024)\nStuart Andrew: To ask the Secretary of State for Health and Social Care, what assessment his Department has made of the potential impact of banning smoking and vaping outside pubs, restaurants and nightclubs on the (a) night-time economy and (b) viability of local high streets.\nWritten Answers — Treasury: Hospitality Industry: Business Rates (12 Sep 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, what business rate reliefs will be available in (a) 2024-25 and (b) 2025-26 to (i) pubs, (ii) restaurants and (iii) nightclubs; and what the thresholds and eligibility requirements are for each.\nWritten Answers — Treasury: Public Houses: Business Rates (12 Sep 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, whether the Valuation Office Agency takes account of the (a) presence and (b) size of a pub garden when valuing a pub for business rates; and whether the size of the garden is recorded by Agency.\nWritten Answers — Treasury: Hospitality Industry: Business Rates (12 Sep 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, what information the Valuation Office Agency holds on the number of hereditaments there are with the (a) 227 Public Houses/Pub Restaurants (Inc. Lodge) (National Scheme), (b) 226 Public Houses/Pub Restaurants (National Scheme), (c) 234 Restaurants, (d) 238 Roadside Restaurants (National Scheme), (e) 409 Cafes, (f) 500 Cafes/Restaurants Within/Part of...\nWritten Answers — Treasury: Hospitality Industry: Business Rates (12 Sep 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, what the average rateable value was for hereditaments with the (a) 227 Public Houses/Pub Restaurants (Inc. Lodge) (National Scheme), (b) 226 Public Houses/Pub Restaurants (National Scheme), (c) 234 Restaurants, (d) 238 Roadside Restaurants (National Scheme), (e) 409 Cafes, (f) 500 Cafes/Restaurants Within/Part of Specialist Property, (g) 060 Clubhouses,...\nWritten Answers — Treasury: Hospitality Industry: Business Rates (12 Sep 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, what the average business rates charge was for hereditaments with the (a) 227 Public Houses/Pub Restaurants (Inc. Lodge) (National Scheme), (b) 226 Public Houses/Pub Restaurants (National Scheme), (c) 234 Restaurants, (d) 238 Roadside Restaurants (National Scheme), (e) 409 Cafes, (f) 500 Cafes/Restaurants Within/Part of Specialist Property, (g) 060...\nWritten Answers — Treasury: Shisha Bars (12 Sep 2024)\nStuart Andrew: To ask the Chancellor of the Exchequer, in what Special Category code the Valuation Office Agency classifies shisha bars; and how many shisha bars there are in each local authority in England.\nWinter Fuel Payment (10 Sep 2024)\nStuart Andrew: claimed to move the closure ( Standing Order No. 36). Question put forthwith, That the Question be now put. Question agreed to. Main question put accordingly.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_category_Speeches-in-Parliament/content_20.html": "Stuart speaks at the Creative Industries General Debate 30th January 2025 Pleased to speak at the Creative Industries General Debate, where I emphasised the importance of our creative sectors. They provide the news that informs our... Speeches in Parliament\nStuart speaks on the murder of Jimmy Mizen 17th January 2025 The murder of Jimmy Mizen sadly sticks in the minds of so many of us. The BBC has serious questions to answer about how a murdering, balaclava-clad individual... Speeches in Parliament\nStuart warns of £1.4bn Charity Tax in Topical Question Debate 28th November 2024 Today in Parliament I challenged the Labour Government on their devastating £1.4 billion charity tax. Our charitable sector from hospices to community... Speeches in Parliament\nStuart Speaks in the National Youth Strategy Debate (NCS) 12th November 2024 Earlier today I spoke in the Commons on the National Youth Strategy Debate which you can access here. I share David's deep disappointment in Labour's decision... Speeches in Parliament",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_stuart-speaks-murder-jimmy-mizen/content_27.html": "The murder of Jimmy Mizen sadly sticks in the minds of so many of us.\nThe BBC has serious questions to answer about how a murdering, balaclava-clad individual with lyrics that glorify vile crimes was not vetted before being allowed to fill the airwaves. There must be an investigation into this, as I cannot imagine the pain and upset this will have caused Jimmy’s family\nI welcome that the Secretary of State for Culture, Media and Sport agreed to work with me on this.\nPlease click here to listen to my full speech.",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_contact/content_3.html": "Skip to main content\nMain navigation\nHome\nAbout Stuart\nContact Stuart\nSurveys\nContact\nLeave this field blank\nConstituency Office\nIcon Innovation Centre, Daventry, NN11 0QB\n01327 304803\n[email protected]\nWestminster Office\nHouse of Commons, London, SW1A 0AA\n020 7219 3615\n[email protected]\nStuartAndrewforDaventry\nStuartAndrew\nPlease use the form below to get in touch.\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_cookies/content_12.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_news_category_Holyrood-News/content_18.html": "EASTERN WAY UPDATE: 28th February 2025 EASTERN WAY UPDATE: CONSERVATIVES WILL NOT BUILD HOUSING ON EASTERN WAY PLAYING FIELD As your Member of Parliament, I have listened to your concerns about... Holyrood News",
  "https_www_stuartandrew_org_uk_/https_www_stuartandrew_org_uk_about-stuart/content_11.html": "Stuart James Andrew was born in 1971 where he spent the first few years of his life in the famous tongue-twisting village of Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch on the Isle of Anglesey in North Wales. Stuart grew up on a council estate, during which time his father was a welder and experienced periods of long-term unemployment and his mother worked in a newsagent’s.\nStuart left school after completing his A-Levels and started work for the then-Department of Social Security. However, having always had a keen interest in fundraising and voluntary work, he took the opportunity to join the British Heart Foundation in 1994. This helped to gain valuable experience in the voluntary sector which then lead to roles at Hope House Children's Hospice and East Lancashire Hospice. He was later appointed Fundraising Manager at Martin House Children's Hospice where he was responsible for leading a team charged with raising £4 million a year.\nStuart's passion for politics stems from many years of involvement in the local community.\nHe was elected to Leeds City Council in 2003 when he gained the Labour seat of Aireborough for the Conservatives. Following boundary changes, he then became the representative for the Guiseley and Rawdon Ward. He was a member of the Planning Panel and a keen campaigner against excessive developments in his Ward (which he continues to be). He was also the Lead Member for the Development Department and had particular responsibility for Transport Policy in the City. During this time, he helped to draw up the Local Transport Plan for West Yorkshire with members of neighbouring authorities.\nIn May 2010, he was honoured to be elected as the Member of Parliament for Pudsey, Horsforth and Aireborough, with the Conservatives in Government.\nIn 2012 he was made Parliamentary Private Secretary to Francis Maude MP, then-Minister for the Cabinet Office and Paymaster General. He also brought forward a Bill that would create a new power for Governors to destroy or otherwise dispose of any unauthorised property found within a prison or an escort vehicle. The bill was supported by both the Coalition and also the Labour Party, with the then-Shadow Secretary of State for Justice, Sadiq Khan, expressing his support for it.\nIn the 2015 General Election, Stuart was re-elected with a majority of 4,501.\nStuart then took on the role of Parliamentary Private Secretary to Patrick McLoughlin MP, the then-Secretary of State for Transport.\nStuart had always taken an active role in All Party Parliamentary Groups during his parliamentary career, including chairing the All Party Parliamentary Groups on Heart Disease, Islamophobia and Children Who Need Palliative Care prior to being appointed to serve in the Government.\nIn September 2016, Stuart was announced as the Parliamentary Private Secretary to Patrick McLoughlin in his capacity as Party Chairman and the Chancellor of the Duchy of Lancaster. Stuart was also appointed the Vice Chairman of the Conservative Party with specific responsibility for Cities.\nFollowing the June 2017 General Election, Stuart was re-elected to Parliament and appointed as an Assistant Government Whip, and in January 2018 also the Parliamentary Under-Secretary of State to the Office of the Secretary of State for Wales.\nIn July 2018, Stuart was appointed Parliamentary Under-Secretary of State and Minister for Defence Procurement at the Ministry of Defence. Stuart enjoyed this role for a year before returning to the Government Whips Office in July 2019 as Vice Chamberlain of Her Majesty's Household.\nIn December 2019, Stuart was re-elected for the fourth consecutive time with a majority of 3,517.\nStuart returned to his role within the Government Whip's Office on re-election, and was promoted to Deputy Chief Whip in February 2020.\nIn February 2021, Stuart was appointed to the Privy Council by the late Her Majesty the Queen, receiving the title of The Right Honourable Stuart Andrew MP.\nIn February 2022, Stuart became Minister for Housing at the Department for Levelling Up, Housing and Communities until resigning from the Government in July 2022. Stuart agreed to hold the interim position of Minister of State at the Ministry of Justice while the Conservative Party leadership election took place to help ensure the stability and continuation of Government.\nIn September 2022, Stuart became Parliamentary Under Secretary of State at the Department for Culture, Media and Sport and was reappointed to this role in October 2022. He was also pleased to be asked to take on the brief of Minister for Equalities in October 2022.\nFollowing the Boundary Review, the constituency of Pudsey, Horsforth and Aireborough was divided across two new constituencies of Leeds West and Pudsey, and Leeds North West. As a result, Stuart was displaced as a Member of Parliament, considered to no longer have a seat. With the General Election announced for 4 July 2024, Stuart's time as the Member of Parliament for Pudsey, Horsforth and Aireborough came to an end.\nIn June 2024, Stuart was delighted to be selected as the Conservative Party Candidate for the Daventry Constituency, an opportunity to continue his passion for public service. In July 2024, Stuart was delighted to be elected with a majority of 3,012.\nNow in Opposition, Stuart was appointed interim Opposition Chief Whip. In November 2024, Stuart was appointed Shadow Secretary of State for Culture, Media and Sport by the new Leader of the Opposition."
}