{
  "https_leighredman_uk_/https_leighredman_uk_contact/content_5.html": "For more information or for help please contact Leigh Redman\ncontact information\nwrite to Leigh or make contact on social media\nDonate\nSupport Leigh's campaign to be the next MP for you & our community. Every penny will help Leigh, unlike other parties Leigh has to fund his own campaign:",
  "https_leighredman_uk_/https_leighredman_uk_about-leigh/content_4.html": "Labour parliamentary Candidate for Bridgwater & Burnham\nFrom Bridgwater for all our communities.\nLeigh Redman was born and has lived, all his life, in the Bridgwater constituency. He has worked hard as a local community champion & Councillor for more than 30 years.\nBridgwater with the surrounding towns and villages really are the beating heart of Somerset.\nA truly local person with a life long history in the town, a demonstrable record of community achievements, Leigh wants to build on the work he has already started, most of you will know how hard he works. The new seat is an opportunity with his name on it.\nWhen asked about being the Labour candidate Leigh said:\nThe new constituency really is a benefit for Bridgwater and the surrounding villages, at last the working heart of Somerset will have a real chance to elect a person who is grounded in our communities, for too long we have been represented by an MP that did not speak for all.\nLosing the West Somerset area and gaining Burnham, Highbridge and Brean will give the 72,000 voters a real chance. I am a truly local candidate and able to demonstrate a long resume of community work, rooted in the constituency.\nWe need a Bridgwater voice in Westminster, not another voice of Westminster in Bridgwater.\nI know the constituency, I know the people in my communities, from village to large town, from workplace to workplace.\nI want to fight to win.\nThe Bridgwater constituency is mine and Labour’s for the taking. I want to be the candidate that Builds a Better Bridgwater.”\nCouncillor, Campaigner, Family man, Friend, Bridgwater to the core.\nLet me fight, with you, to be your MP for our town.\nLeigh redman\nLabour parliamentary Candidate for Bridgwater & Burnham",
  "https_leighredman_uk_/https_leighredman_uk/content_1.html": "Leigh Redman from Bridgwater for all our communities.\nStanding to be the MP for the beating heart of Somerset.\n“We need a Bridgwater voice in Westminster, not another voice of Westminster in Bridgwater.”\nLeigh Redman is the Labour Parliamentary Candidate\nfor the new Bridgwater & Burnham constituency\n“Leigh Redman – Councillor, Campaigner, Family man, Friend, Bridgwater to the core. Let me help you get Bridgwater & Burnham’s future back”\nLeigh Redman was born & has lived, all his life, in the Bridgwater constituency. He has worked hard as a local community champion, from Firefighter to Councillor, for more than 30 years, he can clearly demonstrate a long resume of community work and is rooted in Bridgwater & surrounding villages. He would be a Bridgwater voice in Westminster not another voice of Westminster in Bridgwater.\nMy Commitments to you:\nFor too long the residents of Bridgwater & Burnham have not had real representation in Westminster, I WILL CHANGE THIS.\nA Hard Working & Approachable MP.\nIt will be my full time job.\nBridgwater, Burnham & Surrounding Villages First.\nI will bring people together to help our community thrive.\nTaking your concerns to Westminster.\nOur voices need to be heard in parliament. I will make sure this happens.\nCouncillor, Campaigner, Family man, Friend, Bridgwater to the core. Let me help you get Bridgwater & Burnham’s future back.",
  "https_leighredman_uk_/https_leighredman_uk_video/content_3.html": "Support Leigh's campaign to be the next MP for you & our community. Every penny will help Leigh, unlike other parties Leigh has to fund his own campaign:\nNever see this message again",
  "https_leighredman_uk_/https_leighredman_uk_why-leigh/content_6.html": "What has Leigh done for our communities?\nLeigh is leader of the Labour group at Somerset Council, a council he has been a member of for 11 years. He was a member of Sedgemoor for the last 12 years of its existence until absorbed in to the new Somerset Unitary. He has been a member of various boards for the LGA as a Labour Councillor. He works hard at branch, CLP, regionally and nationally, he has attended and taken an active part in many party conferences.\nAs the Association of Labour Councillors rep for the SW, he speaks up for and supports our elected councillors every day. In this role he have led many training sessions, including ‘be a councillor’, ‘whip training’ and ‘small groups can make an impact’.\nAs Chair of Unite the Union Regional political liaison committee, he works daily to communicate to of our members about political issues.\nAs leader of the Labour group he has been able to work to make our voice heard, under his leadership Labour has impacted the residents of Somerset in a positive way. Taking this experience and building on it will make him an effective MP for our community.\nEndorsements\nLeigh Redman, Councillor, Campaigner, Family man, Friend, Bridgwater to the core.\nLeigh Redman was born & has lived, all his life, in the Bridgwater constituency. He has worked hard as a local community champion, from Firefighter to Councillor, for more than 30 years, he can clearly demonstrate a long resume of community work and is rooted in Bridgwater & surrounding villages. He would be a Bridgwater voice in Westminster not another voice of Westminster in Bridgwater.\nNeil Guild\nENDORSEMENT – Neil Guild, UNISON SW Regional Convenor & previous PPC, “No one works harder for the Labour party in Somerset than Leigh Redman. As Leader of the Labour group at Somerset Council he has fought tirelessly for Labour & Bridgwater residents in holding our political opponents to account. Leigh is always ready to challenge wrong and to champion those who have been unfairly treated. He has made a real difference in protecting essential services and continues that work now. He has also been an ally to my union, UNISON, for many years during some very difficult times.\n“I’m proud to call him a friend. Leigh would be an amazing Labour parliamentary candidate for Bridgwater and surrounding villages.”\nCllr Tudor Evans OBE, Leader of Plymouth Council\nENDORSEMENT – Cllr Tudor Evans OBE, Leader of Plymouth Council, “I’ve known Leigh Redman for many years now, as an experienced Councillor who works effectively at regional and national level. His campaigning skills are the stuff of legend. He is, to members across the South West, Mr Bridgwater.”\nSteve Preddy, Unite the Union SW Regional Secretary\nENDORSEMENT – Steve Preddy, Unite the Union SW Regional Secretary, “Over years of working with Leigh I have come to respect him as a person of integrity and honesty. His constant commitment, striving to secure the best for the people of Bridgwater and Somerset”.\nCllr Vince Maple, leader of Medway council\nENDORSEMENT – Cllr Vince Maple, leader of Medway council, “I’ve worked closely with Leigh on the Association of Labour Councillors where he has been an outstanding voice for the South West. With his never give up attitude, determination to deliver for his community and wide experience I have no doubt Leigh will be the strongest parliamentary candidate possible for Bridgwater.”\nTam McFarlane, FBU National Officer\nENDORSEMENT – Tam McFarlane, FBU National Officer, “Brilliant news that Leigh is standing, and a fantastic opportunity for the new constituency to elect a local, progressive and hard working representative as their new Member of Parliament!”",
  "https_leighredman_uk_/https_leighredman_uk_constituency/content_2.html": "Support Leigh's campaign to be the next MP for you & our community. Every penny will help Leigh, unlike other parties Leigh has to fund his own campaign:\nNever see this message again"
}