{
  "https_nadiawhittome_org_/https_nadiawhittome_org_about-me_salary-donations/content_28.html": "Since April 2024, the basic annual salary of an MP is £91,346, putting us within the top 5% of earners in the country. On top of this, some MPs have lucrative second jobs, picking up hundreds of thousands of pounds on the side, often working as consultants for private companies.\nI was elected to represent you – not corporate shareholders or the country’s wealthiest. As a representative of working people, it’s important to me that my income is not vastly different to that of other workers. It is for this reason, I choose to take a “worker’s wage” rather than my full MP’s salary.\nWhen I was elected in 2019, I committed to take home £35,000 a year (i.e. after deductions automatically taken from my pay for income tax, national insurance contributions, student loan repayments, and the standard MPs’ contributory pension scheme), and donate the remainder to local causes. During my re-election campaign in 2024, I committed to take home £41,000 a year if re-elected – taking a pay rise in line with average public sector pay rises over the last five years – and to continue to give what is left over to the community.\nSo far, my donations include:\n– £8,000 to St Ann’s Advice Centre\n– £7,000 to POW Nottingham\n– £4,000 to the SFiCE Foundation\n– £3,000 to the Nottingham and Notts Refugee Forum\n– £3,000 to Himmah\n– £3,000 to Emmanuel House\n– £3,000 to Harmless\n– £3,000 to the National Education Union Nottingham District strike fund\n– £3,000 to the ACNA Centre\n– £2,500 to the Dolly Parton’s Imagination Library Nottingham\n– £2,000 to Nottingham Law Centre\n– £2,000 to the Greenway Centre\n– £2,000 to the Wolfpack Project\n– £2,000 to Rosehill School\n– £2,000 to Salaam Shalom Kitchen\n– £2,000 to Nottingham Muslim Women’s Network\n– £2,000 to the Nottingham branch of the App Drivers & Couriers Union\n– £2,000 to the Nottingham couriers branch of the IWGB union\n– £2,000 to the RMT East Midlands strike fund\n– £1,600 to Nottingham Counselling Service\n– £1,000 to Nottingham Climate Assembly\n– £468 to the Robin Hood Fund (my earnings when I returned part-time to care work during the pandemic)",
  "https_nadiawhittome_org_/https_nadiawhittome_org_in-the-news_press-releases_nadia-whittome-mp-donates-part-of-her-salary-to-mental-health-organisation/content_8.html": "Nadia Whittome, MP for Nottingham East, has donated £3,000 to Harmless, a Nottingham-based mental health support organisation, as part of her pledge to take home only £35,000 after tax and share the remainder with local causes.\nHarmless is a user-led organisation that provides a range of services to support those affected by self-harm, mental health crises and suicide.\nMs Whittome has previously spoken about her own experience with mental health issues. Last year, Ms Whittome took a three month leave of absence from her MP duties due to post-traumatic stress disorder (PTSD).\nMs Whittome visited Harmless on Friday, where she met with members of staff to discuss their work and how self-harm and suicide can best be tackled.\nCommenting on her donation, Ms Whittome said:\n“Harmless does incredible work with people affected by mental ill-health in my constituency and beyond.\n“I know from my own experience with PTSD that getting the specialist support you need enables you to recover. The services Harmless provides, not only to those who self-harm or are at risk of suicide, but also to their loved ones, has no doubt changed lives.\n“I am proud to share my salary with them and I look forward to us working together to ensure every person is able to access timely, specialist mental health support.”",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_mid-january-newsletter/content_11.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nMid-January newsletter\nMy mid-January newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_blog_in-nottingham-east/content_30.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nIn Nottingham East\nEnd of March newsletter\n28 March 2025\nMid-March newsletter\n7 March 2025\nMid-February newsletter\n17 February 2025\nEnd of January newsletter\n24 January 2025\nMid-January newsletter\n13 January 2025\nEnd of December newsletter\n20 December 2024\nMid-December newsletter\n6 December 2024\nEnd of November newsletter\n22 November 2024\nMid-November newsletter\n8 November 2024\nEnd of October newsletter\n25 October 2024\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_in-the-news_press-releases_nadia-whittome-donates-part-of-her-mps-salary-to-rmt-strike-fund/content_24.html": "Nadia Whittome, MP for Nottingham East, has donated £2,000 to the strike fund of the RMT union’s East Midlands branch as part of her worker’s wage pledge.\nOn Thursday, Ms Whittome joined striking rail workers outside Nottingham Station. She is speaking at their rally there at 12pm today.\nRMT workers are on strike against job cuts and changes which will mean working longer hours and reduced pay. After years of pay freezes, they are asking for a pay rise to help their wages keep up with inflation.\nWhen Ms Whittome was elected, she pledged to share her MP’s salary with local causes in Nottingham. She has previously made donations to the local branches of other unions – the IWGB Couriers’ branch and the App Driver and Couriers’ Union – as well as a range of charities, not-for-profits and grassroots groups. She takes home £35,000 per year after tax, donating the remainder.\nCommenting on her donation, Ms Whittome said:\n“Rail strikers are leading the way for workers in the cost of living crisis – demanding decent pay and conditions to keep up with the cost of soaring inflation.\n“It’s workers like them who need a pay rise, not MPs. That’s why I’m donating £2,000 from my salary to my local RMT branch strike fund.\n“When workers go on strike, they don’t get paid. So this money will help to ensure that no one faces hardship as a result of standing up for themselves at work.”",
  "https_nadiawhittome_org_/https_nadiawhittome_org_help-and-advice/content_12.html": "Get advice and help for a range of issues from organisations in Nottingham and nationally.\nLocal Crisis Team\n0300 300 0065\nSamaritans\n116 123 (free from any UK phone number)\nLocal Mental Health Team\n0115 876 0153\nHarper Villa, Thorneywood, Porchester Road, Nottingham, NG3 6LF\nShout\nFree 24/7 mental health support in the UK.\nText Shout to 85258.\nLet’s Talk Wellbeing Nottinghamshire\n0300 300 2200\nletstalknottingham@nottshc.nhs.uk\nIf you think you are at risk of putting yourself in immediate danger please call 999 or go to A&E.\nCitizens Advice Nottingham\n0115 945 3970\n16 – 18 Maid Marian Way, Nottingham NG1 6HS\nShelter\n0808 800 4444\nFramework\n0115 841 7711\nVal Roberts House, 25 Gregory Boulevard, Nottingham, NG7 6NX\nHousing Aid\n0115 876 3300\nhousingaid@nottinghamcity.gov.uk\nCustomer Hub, Loxley House, Trent Street, Nottingham, NG2 3NG\nStreet Outreach Team\n0800 066 5356\nstreetoutreach@frameworkha.org\nShelter\n0808 800 4444\nEmmanuel House Support Centre\n0115 950 7140\n53-61 Goose Gate, Nottingham, NG1 1FE\nCitizens Advice Nottingham\n0300 330 5457\n16 – 18 Maid Marian Way, Nottingham NG1 6HS\nNottingham Women’s Centre (women only)\n0115 9411475\nreception@nottinghamwomenscentre.com\n30 Chaucer St, Nottingham, NG1 5LP\nSt Anns Advice Centre\n0115 9081530\ninfo@stannsadvice.org.uk\nThe Chase Neighbourhood Centre, Robin Hood Chase, Nottingham, NG3 4EZ\nCitizens Advice Nottingham\n0115 945 3989\n16 – 18 Maid Marian Way, Nottingham NG1 6HS\nSt Ann’s Advice Centre\n0115 950 6867\ninfo@stannsadvice.org.uk\nThe Chase Neighbourhood Centre, Robin Hood Chase, Nottingham, NG3 4EZ\nNottingham Law Centre\n0115 978 7813\n119 Radford Road, Hyson Green, Nottingham NG7 5DU\nNottingham Trent University Legal Advice Centre\n0115 848 4262\nNLS.legaladvicecentre@ntu.ac.uk\nNottingham and Nottinghamshire Refugee Forum\n0115 960 1230\ninfo@nottsrefugeeforum.org.uk\nThe Sycamore Centre, 33a Hungerhill Road, Nottingham, NG3 4NB\nRefugee Roots\n07307 857879\ninfo@refugeeroots.org.uk\nThe Vine Community Centre, Bobbers Mill Road, Hyson Green, Nottingham, NG7 5GZ\nNottingham Arimathea Trust\n0115 924 9920\nAll Souls Community Centre, Ilkeston Road, Nottingham, NG7 3HF\nNottingham City Council\n0115 915 5555\nFind your local councillor\nCompliments and Complaints\nReport a missed bin collection\nA list of food banks and social eating projects in Nottingham is available on Nottingham City Council website.\nDisability Support Nottingham\n0115 978 5095\ninfo@ddnottingham.com\nOld Basford Community Centre, Bramble Close, Nottingham, NG6 0QG\nNottingham Mencap (learning disabilities)\n0115 920 9524\ninfo@n-mencap.org\n203 Edwards Lane, Harpenden House, Sherwood, Nottingham NG5 3JA\nNottingham City Council Adult Social Care\n0115 915 5555\nJuno Women’s Aid (women only)\n0808 800 0340\nhelpline@junowomensaid.org.uk\nNottingham Women’s Centre (women only)\n0115 9411475\nreception@nottinghamwomenscentre.com\n30 Chaucer Street, Nottingham NG1 5LP\nNotts SVS Services\n0115 941 0440\ndutysupervisor@nottssvss.org.uk\n30 Chaucer Street, Nottingham, NG1 5LP\nCommunities Inc\n0115 964 8227\nNBV Enterprise Centre, David Lane, Nottingham, NG6 0JU\nTell Mama UK (for anti-Muslim hate crime)\n0800 456 1226\ninfo@tellmamauk.org\nLGBT+ Service Nottinghamshire\n01909 479191\ninfo@lgbtplusnotts.org.uk\nAbbey Street Community Centre, Worksop, Nottinghamshire, S80 2LA\nNotts LGBT+ Network\n0115 9348485\ninfo@nottslgbt.com",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_in-the-news/content_15.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nIn the News\nMPs put pressure on government to strengthen disabled renters’ rights\n30 April 2024\nNadia Whittome MP asks government if Nottingham attacks inquiry into ‘missed opportunities’ will take place\nNottingham Post\n1 February 2024\nIn conversation: Nadia Whittome MP and Bimini\nHuck Magazine\n19 December 2023\nNottingham MPs’ statement on Nottingham City Council issuing a section 114 notice\n29 November 2023\nLabour MP Nadia Whittome blasts Tory government over ‘conversion therapy’ ban delays\nAttitude\n24 October 2023\nGovernment has not met with LGBT+ organisations about transgender schools guidance\n2 October 2023\nWe need a National Care Service like the NHS to fix our social care crisis\nopenDemocracy\n3 July 2023\nLabour MP Nadia Whittome: Public Order Act is threat to democracy\nopenDemocracy\n11 May 2023\nWhat Labour can learn from the world’s happiest country\nLabourList\n8 March 2023\nClimate Education Bill returns to Parliament with growing support\n24 January 2023\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_blog/content_21.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nUpdates\nMy letter to the government about the proposed disability benefits cuts\n31 March 2025\nEnd of March newsletter\n28 March 2025\nMid-March newsletter\n7 March 2025\nMid-February newsletter\n17 February 2025\nEnd of January newsletter\n24 January 2025\nMid-January newsletter\n13 January 2025\nEnd of December newsletter\n20 December 2024\nMid-December newsletter\n6 December 2024\nMy statement on the Terminally Ill Adults (End of Life) Bill\n2 December 2024\nEnd of November newsletter\n22 November 2024\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_in-parliament/content_14.html": "I spend Monday to Thursday each week in London representing you in Parliament. I speak in debates, ask the government questions, sign motions and vote on proposed laws. I also interview witnesses about local services and housing as a member of the Levelling Up, Housing and Communities Committee.",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_my-letter-to-the-government-about-the-proposed-disability-benefits-cuts/content_20.html": "On the 24th of March, I wrote a letter to the government to express my deep concerns about the proposed changes to disability benefits, and to ask a number of questions. You can read it below:\nDear Secretary of State,\nRe: Pathways to Work Reform Green Paper\nEveryone agrees that the social security system is in desperate need of reform, not least those with personal experience of it. We have an opportunity to heed their calls and build a system that safeguards and empowers people, rooted in dignity and compassion.\nSome of the Green Paper’s proposals are welcome: for example, the “Right to Try” which would guarantee that people who move into employment can return to their benefits without reassessment, and the announcement that people with lifelong conditions who cannot work will not be subjected to work capability reassessments. I would be grateful if you could set out how lifelong conditions not in need of reassessment will be defined?\nHowever, any positive reforms are completely undermined by the £5 billion in benefit cuts. Disability Rights UK states that these amount to the biggest cuts in disability benefits on record, while the Resolution Foundation estimates that they will result in up to 1.2 million people losing support of up to £6,300 per year by the end of this decade. I am also disappointed that some of the most significant changes are not subject to consultation.\nDisabled people’s living standards\nAs you will recognise, the situation for disabled people’s rights and living standards in this country is already dire, with nearly half of families in poverty including a disabled person.\nThis situation is so serious that in 2016, the UN Committee on the Rights of Persons with Disabilities found that ‘grave and systematic violations’ of disabled persons’ rights had taken place because of austerity measures and welfare reforms since 2010, which had ‘disproportionately and adversely’ affected the rights of disabled people. Earlier this month, the UN’s Committee on Economic, Social and Cultural Rights concluded that welfare cuts implemented by Conservative governments have resulted in ‘severe economic hardship, increased reliance on food banks, homelessness, negative impacts on mental health, and stigmatisation of benefits claimants’. It called for more spending on social security; ‘corrective measures’ to address the impact of these welfare reforms, and for the levels of disability-related benefits to increase so that they ‘adequately cover additional disability-related costs’.\nWhile the Government’s Equality and Impact Assessment and Poverty Impact Assessment are yet to be published, it is clear that the cuts proposed in the Green Paper will further deepen poverty and inequality.\nCharities advocating for disabled people have been stark in their warnings. Scope has said that these plans will be “catastrophic for disabled people’s living standards” and that they should “shame the government to its core”. The MS Society has called these cuts “immoral” and “devastating”, stating that they will push more people into poverty and worsen people’s health. Disability Rights UK describes the plans as “brutal”, “reckless” and “dangerous”.\nThe government claims that it will continue to protect the most vulnerable, but these policies fall far short of this pledge.\nPIP\nPersonal Independence Payment (PIP) eligibility changes would deny vital support to those who need it. PIP fraud remains almost non-existent at 0.2%. I do not think it is possible that there are up to 1.2 million people currently in receipt of PIP who do not require it.\nThe new eligibility criteria means that a person must score ‘4’ in at least one category under the Daily Living Activities assessment. This means that many people who score lower but across multiple categories will no longer be eligible. For example, if you need assistance to wash your hair or your body below the waist, this only scores a 2; as does requiring supervision to be able to use the toilet. Meanwhile, many of the tasks that require the use of aids or appliances score below 4. All of these are significant disabilities that will have a huge impact on people’s lives and living costs, yet they will no longer receive PIP. What is the government’s rationale for withdrawing these payments, and do you have evidence that those who do not score ‘4’ on any single activity incur significantly lower costs than those who do?\nThese changes may well be counterproductive to the government’s aim of supporting more disabled people into work. 1 in 6 people in receipt of PIP are currently in work but these changes may lead to many dropping out of employment. For example, Epilepsy Action highlights that lots of people with epilepsy need PIP to help them get to work. What evidence does the government have that cutting PIP will result in more disabled people working?\nCitizens Advice Bureau has said that 29% of people it has helped with PIP have dependent children. It therefore expects the changes to eligibility to have a “significant” impact on child poverty.\nThese changes are also likely to affect carers’ entitlement to Carer’s Allowance, with over half of Carer’s Allowance awards tied to PIP. 28% of carers are disabled or have long-term health conditions, and caring is a risk factor in having to give up work. Around 150,000 unpaid carers also receive both Carer’s Allowance and PIP, relying on these vital benefits to get by.\nFurthermore, lots of people access other benefits through their entitlement to PIP. For these claimants, what will happen to their eligibility for other benefits if they are no longer entitled to PIP?\nUniversal Credit\nThe government is right to increase the basic rate of Universal Credit, but I strongly oppose the decision to cut payments for those newly assessed as being entitled to the health component, and to freeze the rate for existing claimants. There can be no justification for making those whom the state considers less likely to be able to work poorer, nor will this help them into work. There is also no justification for denying these payments to every single disabled person between the ages of 18 and 21 solely because of their age. Again, I would ask what evidence the government has that this will make disabled people more likely to secure employment? What evidence does the government have that the reduced rate is enough to enable disabled people to meet essential living costs?\nI am also concerned that more disabled people will now be subject to sanctions, including those under 22 years old under proposals that the department is consulting on. There is overwhelming evidence, from a number of studies, that sanctions do not help people into work. We should not be subjecting more disabled people to this punitive regime.\nFurther, I categorically reject the narrative of overdiagnosis of mental health conditions amongst young people. We are living through a youth mental health crisis, with a clear correlation between poverty and mental health conditions. At the same time, the underfunding of mental health services over many years has left huge waiting lists and young people without the support they need to recover. It is these root causes that we should be tackling, not taking away the money that is helping young people with mental health conditions to survive. The combined loss of no longer qualifying for PIP or UC health could mean that they lose at least £9,600 a year.\nWhile I welcome that disabled people will no longer be expected to go through a Work Capability Assessment as well as an assessment for PIP, I am concerned about what this change will mean in practice. Will there be more resources for PIP assessment if the health component of Universal Credit is solely available through this system? Will the eligibility criteria to receive the health component of Universal Credit also require someone to score ‘4’ in a Daily Living Activity?\nFor all the reasons I have set out above, I am afraid that I must inform you that I will vote against government legislation to enact these changes. This is not a position I ever wanted to be in, but I must oppose measures that will make disabled people poorer and widen inequality in this country. I sincerely hope that the government listens to the deep concern and distress of disabled people, and the warnings from experts on disability and poverty, and drops these plans before a vote takes place. It is not too late to salvage the additional support that could help disabled people into employment, which has been universally welcomed, and shelve the cuts to benefits that will cause immense harm.\nYours sincerely,Nadia",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_mid-february-newsletter-3/content_34.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nMid-February newsletter\nMy mid-February newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_blog_in-parliament/content_3.html": "I spend Monday to Thursday each week in London representing you in Parliament. I speak in debates, ask the government questions, sign motions and vote on proposed laws. I also interview witnesses about local services and housing as a member of the Levelling Up, Housing and Communities Committee.",
  "https_nadiawhittome_org_/https_nadiawhittome_org_about-me/content_6.html": "Nottingham has been my home my whole life. This city, its people, its communities, have made me who I am today.\nBefore my election, I was a hate crime worker, and prior to that a care worker whilst I studied law at the University of Nottingham.\nIt was the Bedroom Tax that drove me to become active in politics – because I saw that austerity was ripping apart our communities and wreaking devastation on the lives of my neighbours, family, and friends.\nIn 2019, I was elected to Parliament aged 23, becoming the UK’s youngest MP. I currently take home £41,000 a year, instead of my full MP’s salary, donating the remainder (after automatic deductions for tax etc.) to local causes.\nDuring the first wave of the Coronavirus pandemic I returned to work part-time as a care worker on the frontline.\nIn 2020 I was jointly awarded Pink News’ Politician of the Year. In 2023, I was awarded Diva Magazine’s Unsung Hero of the Year.",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_in-the-news_media-coverage/content_2.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nMedia coverage\nNadia Whittome MP asks government if Nottingham attacks inquiry into ‘missed opportunities’ will take place\nNottingham Post\n1 February 2024\nIn conversation: Nadia Whittome MP and Bimini\nHuck Magazine\n19 December 2023\nLabour MP Nadia Whittome blasts Tory government over ‘conversion therapy’ ban delays\nAttitude\n24 October 2023\nWe need a National Care Service like the NHS to fix our social care crisis\nopenDemocracy\n3 July 2023\nLabour MP Nadia Whittome: Public Order Act is threat to democracy\nopenDemocracy\n11 May 2023\nWhat Labour can learn from the world’s happiest country\nLabourList\n8 March 2023\nIncrease in benefits can help protect women from sex work says Labour MP\nChannel 4 News\n1 December 2022\nNadia Whittome: ‘The Tories have made their choice: protect the rich, condemn the rest’\ngal-dem\n18 November 2022\nNadia Whittome MP: ‘We must use the World Cup to condemn the Qatari regime’\nGay Times\n18 November 2022\n“There is always hope”: Labour MP Nadia Whittome on what lies ahead for British politics\nThe Stylist\n11 July 2022\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org/content_1.html": "It is the greatest honour of my life to be the MP for Nottingham East – born and bred in this city, made by this city. As your MP, I vow to use my role to tackle the issues that matter to our communities: from the cost of living, to the housing crisis, to decent jobs. Together I know we can build a better society for us all – in Nottingham East and beyond.",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_end-of-december-newsletter-2/content_35.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nEnd of December newsletter\nMy end of December newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_in-nottingham-east/content_33.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nIn Nottingham East\nEnd of March newsletter\n28 March 2025\nMid-March newsletter\n7 March 2025\nMid-February newsletter\n17 February 2025\nEnd of January newsletter\n24 January 2025\nMid-January newsletter\n13 January 2025\nEnd of December newsletter\n20 December 2024\nMid-December newsletter\n6 December 2024\nEnd of November newsletter\n22 November 2024\nMid-November newsletter\n8 November 2024\nEnd of October newsletter\n25 October 2024\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_privacy-policy/content_31.html": "As the MP for Nottingham East, my staff and I keep in touch with constituents about my work, take up casework on their behalf and ask for views on issues.\nThis policy explains how I collect and use personal data, and the legal basis for doing so. As the holder of that data I am called the Data Controller. You can also find here an explanation of your rights in relation to that data. My responsible staff member for data protection can be contacted at nadia.whittome.mp@parliament.uk or by writing to Nadia Whittome MP, 165 Mansfield Road, Nottingham, NG1 3FR.\nAs a Labour MP, I also have access to other information which I or my office, or volunteers working with me, may use for campaigning purposes or for communicating with Labour Party members. The Data Controller for that information is the Labour Party whose privacy policy can be located here: (https://labour.org.uk/privacy-policy/)\nData collection and use\nThe office of Nadia Whittome MP will only collect and use personal information for the specific purpose for which it has been obtained.\nPolicy inquiries and casework (personal problems) enquiries bring with them information provided by the constituent and/or on behalf of the constituent. I will only share such information with a third party organisation where this is necessary and reasonable to do so, and therein, that would be only the amount of information deemed necessary to ensure the query is handled efficiently. The data processing is for performing tasks in the public interest or in the exercise of official authority.\nPlease see the “who I share your information with” section for further details.\nIf you register with my website or complete a form or survey sent to you by my office, you may be asked for personal information. In each case, I will seek your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, or phone about my work and give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting the responsible officer for data protection.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with:\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my office for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the Nottingham East MP, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will usually be retained for a maximum of three years, unless the casework matter is still ongoing. In such circumstances, personal data shall only be retained for as long as is necessary to resolve the request. I may delete or destroy information that I consider repetitive or that is not stored electronically, in order to hold minimal personal data.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Nottingham East, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nMy website does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site. These website statistics are collected using Google Analytics. You may opt out using Google’s opt out tool.\nA cookie is a tiny text file that is stored on your computer. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites:\nIf this website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights:\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n· Obtain copies of the personal information I hold about you (known as a “subject access request”)\n· Request that personal information you have given your consent for me to use, and that I still hold, is provided in an electronic format so it can be transferred to another data controller (also known as ‘data portability’)\n· Request that I correct or update any personal information held about you\n· Ask that we erase or restrict the way in which I use your information\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact the responsible officer for data protection:\nAddress: Nadia Whittome, MP for Nottingham East, 165 Mansfield Road, Nottingham, NG1 3FR\nEmail: nadia.whittome.mp@parliament.uk\nTelephone: 0115 697 1757\nAlternatively you have the right to raise any issues or concerns directly with the Information Commissioner’s Office, at Wycliffe House, Water Lane, Wilmslow, Cheshire, SK9 5AF or www.ico.org.uk",
  "https_nadiawhittome_org_/https_nadiawhittome_org_in-the-news_press-releases_mps-put-pressure-on-government-to-strengthen-disabled-renters-rights/content_9.html": "MPs have today tabled an amendment to the Renters Reform Bill to strengthen the rights of disabled renters. Nadia Whittome, the Labour MP for Nottingham East and member of the Levelling Up, Housing and Communities Committee, worked with the disabled people’s organisation Disability Rights UK on the amendment, which aims to make it explicit in law that landlords cannot “unreasonably refuse home adaptations for the purposes of a disabled person’s access to or usage of the home”.\nMore than 1 in 6 disabled people currently live in the private rented sector.[1] 1 in 3 of these disabled renters are living in homes which are unsuitable for them,[2] often with disastrous consequences for their wellbeing, quality of life and independence.\nFunding to make adaptations to disabled people’s homes is available through the Disabled Facilities Grant (DFG), yet only 6% of DFGs go to private renters.[3] Many barriers exist, the most common being that private landlords often refuse to make adaptations. In fact, the government’s 2018 external review of DFG confirmed that over 10 per cent of applications for DFGs were discontinued because the landlord or owner refused permission.[4]\nMs Whittome’s amendment aims to make it harder for landlords to decline requests for adaptations. It has received support from 17 MPs, including Green MP Caroline Lucas, fellow Levelling Up Housing and Communities Committee member Ian Byrne, and former Shadow Minister for Disabled People Debbie Abrahams.[5]\nNadia Whittome, Labour MP for Nottingham East, said:\n“With home ownership becoming a distant dream for so many, and a chronic lack of social housing, more disabled people are having to rely on the private rented sector for a place to live.\n“Every disabled person should have a home that suits their needs and government funding is available to help make adaptations. My amendment aims to strengthen disabled renters’ rights, so that landlords cannot refuse the adaptations they need to live their life to the fullest.”\nMikey Erhardt, Campaigner at Disability Rights UK, said:\n“The housing sector is a dangerous mess for Disabled people. As Disabled people in the private rented sector we experience inaccessible homes, huge rates of disrepair, hazardous homes and poor behaviour from landlords.\n“And now, just as other colleagues have done, we are sounding the alarm that the Renter’s Reform Bill is failing. In its current form, it gives more power to landlords in exchange for little to no new protections or changes for renters across the country.\n“No one should be left in an unsafe home, no matter their background. Therefore, it is essential that we improve our legal protections and the Disabled Facilities Grant, which is often ignored by key cogs in our system. We’re grateful for Nadia Whittome’s support in helping us table this amendment.”\n– ENDS –\nNotes for editors",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_end-of-october-newsletter-2/content_37.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nEnd of October newsletter\nMy end of October newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_category_in-the-news_press-releases/content_5.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nPress releases\nMPs put pressure on government to strengthen disabled renters’ rights\n30 April 2024\nNottingham MPs’ statement on Nottingham City Council issuing a section 114 notice\n29 November 2023\nGovernment has not met with LGBT+ organisations about transgender schools guidance\n2 October 2023\nClimate Education Bill returns to Parliament with growing support\n24 January 2023\nNadia Whittome MP donates part of her salary to Nottingham Law Centre\n21 December 2022\nNadia Whittome donates part of her MP’s salary to RMT strike fund\n25 June 2022\nNadia Whittome MP donates part of her salary to mental health organisation\n23 March 2022\nNadia Whittome MP calls for more funding for Nottingham in Parliament\n2 November 2021\nNadia Whittome leads Parliament’s first-ever debate on climate education\n27 October 2021\nNadia Whittome responds to the Queen’s Speech\n11 May 2021\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_in-the-news_press-releases_nadia-whittome-mp-donates-part-of-her-salary-to-nottingham-law-centre/content_32.html": "Nadia Whittome, MP for Nottingham East, has donated £2,000 to Nottingham Law Centre, as part of her worker’s wage pledge.\nNottingham Law Centre, which is based in Hyson Green, offers free advice to Nottingham residents on issues such as housing, debt and benefits. It also represents people threatened with eviction by their landlord.\nIn the cost of living crisis, the services it provides are particularly important, as people struggle to pay rent and bills, facing mounting debt and eviction from their homes.\nNottingham Law Centre is the latest local organisation to receive a share of Ms Whittome’s salary. Upon being elected as an MP, Ms Whittome committed to taking home a yearly wage of £35,000 after tax, donating the remainder of her MP’s salary to local causes, such as food banks, strike funds and charities.\nCommenting on her donation, Ms Whittome said:\n“Constituents tell me week in, week out how the Law Centre has resolved problems that kept them up at night. The services they provide transform people’s lives, keeping the bailiffs from the door and putting food on the table.\n“Amidst mounting levels of poverty, free legal advice and access to justice have never been so essential and so in demand. It is my privilege to make a small contribution towards the Law Centre’s work.”\nSally Denton, Senior Solicitor at Nottingham Law Centre, said:\n“We are really grateful for Nadia’s support. This year has been very challenging and we are seeing a significant increase in demand for our services. We anticipate that this will continue to be the case with the cost of living increases and the number of people facing possession proceedings.”",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_nadia-whittome-wins-pinknews-politician-of-the-year-award/content_18.html": "MP for Nottingham East Nadia Whittome has received this year’s PinkNews Politician of the Year Award, alongside Liberal Democrat MP Layla Moran. The award, which was won last year by Conservative MP Penny Mordaunt, recognises politicians from across the political spectrum who have shown tireless support for LGBT+ rights.\nSince she was elected to parliament and became the UK’s youngest MP last year, Nadia Whittome has been an outspoken advocate for the rights of transgender people. In July, she used an oral question in parliament to criticise the government’s delay in publishing their response to the consultation on reforming the Gender Recognition Act. Whittome also spoke in parliament about waiting times for transgender healthcare, and wrote an article in the Independent in which she said that “we need to listen to, honour and hold [trans peoples’] stories with dignity and sensitivity.”\nNadia Whittome said:\nIt means so much to me to win this award, particularly at such a pivotal time for LGBT+ rights at home and abroad. We stand on the shoulders of giants who have fought for LGBT+ liberation for many decades – but that struggle isn’t over.\nI will always stand as a proud advocate of the LGBT+ community and I know that in 2021 we will be even stronger and more united against attempts to peddle division, disinformation and prejudice.\nOn their website, PinkNews – the world’s most-read LGBT+ magazine – said: “Labour MP Nadia Whittome has repeatedly spoken out against transphobia and has thrown her weight behind LGBT+ equality.”\nDescribing the awards, PinkNews said: “The PinkNews Awards will honour our 2020 heroes, and celebrate moments of unprecedented LGBT+ representation as well as PinkNews’ 15th birthday.” They invited members of the public to “join your favourite celebrities, politicians, activists and influencers in celebration of the LGBT+ community”.",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_end-of-november-newsletter/content_26.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nEnd of November newsletter\nMy end of November newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_nadia-whittome-mp-calls-for-more-funding-for-nottingham-in-parliament/content_16.html": "Nadia Whittome, MP for Nottingham East, has called for more funding for Nottingham in a speech in Parliament responding to the Budget.\nMs Whittome highlighted that the people of Nottingham now receive over £100 million less each year to fund local services and that due to government cuts to local authorities, the city’s youth services have been cut by more than 90% since 2010.\nMs Whittome asked “When will Nottingham get the money that we need to truly level up? And will the Chancellor answer honestly why his seat, among one of the most affluent in the country, has been prioritised in the levelling up fund – while 38% of children in Nottingham East live in poverty?”2\nMs Whittome also criticised the government’s decision to keep the Universal Credit cut affecting 14,250 households in Nottingham East. Even with changes to the Universal Credit taper rate – the amount a household’s Universal Credit income decreases as their earnings increase – the Resolution Foundation calculated that 75% of families would still be worse off.\nSumming up the Budget, Ms Whittome said “This Budget does not deliver the “new age of optimism” that the Chancellor promised. The glass isn’t half full. After 10 years of brutal Tory austerity and government cuts, it’s completely empty.”",
  "https_nadiawhittome_org_/https_nadiawhittome_org_contact/content_29.html": "You can contact me if you are affected by or have opinions about decisions made by Parliament or the Government.\nCommon enquiries that I help with:\nDue to strict parliamentary protocol I am only allowed to help people who live in Nottingham East. Please check if you live in my constituency before contacting me by entering your postcode here.\nFor very local issues, your local councillor might be better placed to help. This would include issues relating to the council, such as council housing, roads, buses, planning and rubbish collection. You can find your local councillors here.\nIf you live in Nottingham East and you would like to contact me with an issue or about your views, please use the form below.\nTo invite Nadia to an event, please email nadia.whittome.mp@parliament.uk\nFor media enquiries, please email hattie.craig@parliament.uk\nView our privacy policy.",
  "https_nadiawhittome_org_/https_nadiawhittome_org_in-the-news_press-releases_nottingham-mps-statement-on-nottingham-city-council-issuing-a-section-114-notice/content_23.html": "Responding to Nottingham City Council issuing a section 114 notice, the three MPs for Nottingham, Nadia Whittome, Alex Norris, and Lilian Greenwood said:\n“Like many local authorities across the country, Nottingham City Council’s finances have been pushed to the brink by more than a decade of cuts by Conservative-led governments – £1 billion since 2013. The Government’s failure to get a grip on unprecedented rising demand for social care and homelessness has now pushed the council over the edge, forcing it to issue a section 114 notice.\n“As MPs representing Nottingham, we urge the Government to provide our city’s council with the funding it requires to be financially sustainable and to deliver the services that our constituents rely on. Our constituents should not be made to suffer further cuts to local services at a time when they face the biggest drop in living standards since records began.\n“We will be working with local councillors to mitigate the impact that today’s development has on residents, and in Parliament fighting for proper reform of the social care system, real action to tackle homelessness, and funding for local services.”",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_mid-november-newsletter-3/content_36.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nMid-November newsletter\nMy mid-November newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_nadia-whittome-responds-to-the-queens-speech/content_22.html": "Responding to the Queen’s Speech, MP for Nottingham East, Nadia Whittome said:\n“Despite the Queen’s Speech containing reference to around 30 bills, there were glaring omissions which mean pressing crises will continue to grow, for Nottingham and across the country. Even after its failures in the pandemic, the government is continuing to delay urgent funding reform for the social care sector. Its environmental legislation is nowhere near ambitious and concrete enough. And there was little to tackle the rampant poverty and inequality which blights our society.\n“What’s more, a number of the proposed legislative changes signal a further dangerous turn towards authoritarianism by this government. Its plans to make photo ID compulsory to vote in elections risks disenfranchising younger people, poorer people and people of colour. The Police, Crime, Sentencing and Courts Bill represents the biggest threat to the right to protest in a generation and will criminalise Gypsy, Roma and Traveller communities’ way of life. Its plans for the immigration and asylum system have received international condemnation from human rights and refugee organisations.”\n“The government should have used the Queen’s Speech to rebuild the fairer, greener economy and society, coming out of a devastating pandemic, that the people of Nottingham and the rest of the UK need. Instead, it is more interested in demonising minority groups and attempting to rig future elections in its favour.”",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_mid-january-newsletter-2/content_13.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nEnd of January newsletter\nMy end of January newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_mid-december-newsletter-3/content_27.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nMid-December newsletter\nMy mid-December newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_mid-march-newsletter-2/content_25.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nMid-March newsletter\nMy mid-March newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_in-the-news_press-releases_climate-education-bill-returns-to-parliament-with-growing-support/content_7.html": "Nadia Whittome, the Labour MP for Nottingham East and youngest sitting MP, today tabled a Bill1 that would ensure that all young people are taught about climate change and the environment in schools.\nThe Bill calls for matters relating to climate change and sustainability to be integrated throughout the curriculum in primary and secondary schools and included in vocational training courses. It has been written in collaboration with Teach the Future2 – a school-pupil-led group that campaigns for climate education – and is believed to be the first Bill ever written by students.\nThis is the Bill’s second attempt at passing in Parliament. It was first tabled in 2021 but fell as the Parliamentary session finished before it could make its way through the necessary stages to become law.\nCampaigners are hopeful that the Bill is gathering momentum. Since it was last tabled, it now has the official backing of the Labour Party and cross-party support has grown. It is co-sponsored by four select committee chairs – Philip Dunne, Robin Walker, Greg Clark and Darren Jones – three of whom are Conservative MPs, one Labour. It is also co-sponsored by Green MP Caroline Lucas; Lib Dem MP Layla Moran; SNP MP Mhairi Black; Labour MPs Clive Lewis, Rebecca Long-Bailey, and Zarah Sultana; and former Labour Party leader Jeremy Corbyn.\nSchool students have long been calling for more teaching about the environment. In 2018, one survey found that 42% of pupils feel that have learnt a little, hardly anything or nothing about the environment at school and 68% would like to know more.3\nTeachers themselves also believe there are opportunities to integrate climate change in their teaching. In a survey of 4,690 secondary teachers, just one third (33%) agreed that climate change is embedded in their school’s curriculum, in their subject, in a meaningful and relevant way.4 Despite this absence, most teachers (89%) reported that issues regarding climate change were relevant to their subject area. Research by Teach the Future found that 70% of teachers feel they haven’t received adequate training to educate students about climate change.5\nNadia Whittome, MP for Nottingham East, said:\n“The climate crisis is already affecting people in the here and now. In the coming years, its impacts will grow, as must our action to prevent and mitigate it.\n“Right now, our education system is failing to prepare young people for this future. That’s why I’ve re-tabled my Climate Education Bill: to give young people the education they need to understand the world they will inherit and thrive in a net zero society.”\nLiv Marshall, age 15, from Teach the Future said:\n“We need the Climate Education Bill to make sure that every child, no matter their background, has the opportunity to learn about the world they’re growing up in, the challenges they’ll face and most importantly, how to fix it.”\n· ENDS –\nNotes for editors",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_in-parliament_end-of-march-newsletter-3/content_4.html": "Home\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nHome\nAbout\nUpdates\nIn Parliament\nIn Nottingham East\nIn the news\nMedia coverage\nPress releases\nHelp and advice\nContact me\nEnd of March newsletter\nMy end of March newsletter can be viewed\nhere\n.\nGET NADIA'S NEWSLETTER",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_nadia-whittome-mp-leads-parliaments-first-ever-debate-on-climate-education/content_10.html": "Ahead of the UN Climate Summit COP26, Nadia Whittome MP will today lead UK Parliament’s first-ever debate on climate education. The Westminster Hall Debate, tabled in partnership with students aged 13-18 from the Teach the Future campaign, aims to examine sustainability and climate education in the UK curriculum.\nThe 90-minute debate marks the beginning of parliamentary talks about the current state of climate education in the UK curriculum. MPs are expected to discuss a range of topics, including disparities in climate education around the world, education for girls and women, ensuring the right climate change information is included in the UK education syllabus, and how to education on green jobs to upskill the workforce.\nNadia Whittome MP, comments: “Young people today are growing up in a world that will be increasingly defined by the climate crisis. If our education system isn’t teaching us the knowledge and practical skills to help prevent climate change and deal with its consequences, then it is failing us. The inclusion of sustainability and climate change across the curriculum is essential to building a resilient, net-zero society.”\nTeach the Future, a youth-led campaign by students from all four UK nations, has been leading a UK-wide petition asking the government to implement climate education across the curriculum. More than 25,000 people have signed the petition and other key figures have supported the call.\nScarlett Westbrook, a 17-year-old organising with Teach the Future and UKSCN, comments: “Just five days before COP26, this debate presents a huge opportunity for the UK to become a global leader on climate education. Climate change education is inadequate.\n“Our approach to climate education urgently needs to change: the current curriculum is failing young people and causing escalating levels of climate anxiety. This is a climate emergency. The Government need to help build a global youth workforce equipped with the knowledge and tools to drastically reduce emissions and halt the loss of nature.”\nTeach the Future has three demands for MPs in the debate:\nEarlier this year, the largest study ever conducted into the effects of the climate crisis on the mental health of young people revealed nearly half (45%) of young people globally feel climate anxiety negatively affects their daily life. It also found that almost two-thirds (64%) of young people around the world believe governments are not doing enough to protect them from climate change.\nIn 2018, one survey found that 42% of pupils feel that have learnt a little, hardly anything or nothing about the environment at school and 68% would like to know more. Research by Teach the Future found that 70% of teachers feel they haven’t received adequate training to educate students about climate change.",
  "https_nadiawhittome_org_/https_nadiawhittome_org_in-the-news_press-releases_government-has-not-met-with-lgbt-organisations-about-transgender-schools-guidance/content_17.html": "The government has admitted that the Education Secretary has not met with a single LGBT+ organisation about the forthcoming guidance it intends to provide schools on transgender-related issues.\nOn 5th September, Nadia Whittome, the Labour MP for Nottingham East tabled a Written Parliamentary Question:\n“To ask the Secretary of State for Education, how many meetings she has had with which LGBT+ organisations on transgender guidance for schools in the last 12 months.”\nLast Friday, Schools Minister Nick Gibb, responded on behalf of the Education Secretary:\n“The Secretary of State has not met any lesbian, gay, bisexual and transgender (LGBT) organisations directly to discuss the guidance, but the Department is keen to consider the full range of views and will be undertaking a public consultation on the draft guidance prior to publication.\n“During the consultation period, the Department plans to engage with a range of interested organisations, including organisations that support the LGBT community.”\nSix months ago, in March of this year, the Prime Minister announced that the government intended to provide schools guidance on trans-related issues by the summer term – a deadline that it has now missed. Since then, there have been a number of briefings to the press about what the draft guidance contains and of disagreements between ministers.\nDespite this, the Education Secretary has not seen fit to meet with any LGBT+ organisations to discuss their views on what the guidance should contain, even though it will directly affect young trans people.\nCommenting on the government’s response to her Parliamentary Question, the MP for Nottingham East, Nadia Whittome said:\n“This guidance could have huge implications for the safety and wellbeing of young trans people. If the government cared about this, it would have met with LGBT+ organisations early in the process of drafting this guidance to ensure it gets it right. It is frankly insulting that the Education Secretary has been preparing this guidance for at least six months and hasn’t met even once with a single LGBT+ organisation.\n“The government has given up pretending it cares about LGBT+ people – from this guidance, to dropping the conversion therapy ban, to appalling remarks about LGBT+ refugees, our community is being treated as collateral damage in its vile and dangerous culture war.”",
  "https_nadiawhittome_org_/https_nadiawhittome_org_blog_my-statement-on-the-terminally-ill-adults-end-of-life-bill/content_19.html": "I would like to thank constituents who have contacted me regarding this issue and have shared their personal testimony from all perspectives. I have been truly moved by the stories that have so generously been shared with me. There is great intensity of feeling from people of all positions in this debate, and I am thinking of everyone for whom this is a particularly difficult and personal matter.\nIn developing my views on this issue, I have tried to be conscious of my own biases, and I recognise that the law is not just about the rights of the individual; the law must protect everyone. My decision is based on extremely careful consideration of the evidence, including the Health and Social Care Select Committee inquiry, legal opinion, and the views of clinicians, those who are terminally ill and their loved ones, and disabled people’s organisations, which have legitimate concerns about potential unintended consequences.\nA dignified death looks different for everyone and is deeply personal. For some, this will mean the choice of palliative care and end of life care alone, and for others, it would be a combination of this and assisted dying.\nThe current law produces inhumane consequences for terminally ill people who wish to end their suffering through assisted dying. Those who can afford to, can access assisted dying in Switzerland, but they may have to die earlier than necessary because they need to be well enough to make the journey. They often have to go alone as otherwise, their loved ones face lengthy and distressing police investigations.\nThose who cannot afford it are left with the choice of suffering painful deaths or dying by suicide, which is dangerous and extremely traumatic for both the dying person and their loved ones.\nIn all scenarios under the current situation, there are no safeguards, including from coercion. As Professor Aneez Esmail, a doctor previously opposed to assisted dying who now campaigns to legalise it has stated, “By forcing people to plan these deaths in secret and in the absence of a clear legal framework, we cannot be reassured that the individuals involved are making decisions voluntarily, free from pressure or coercion, and fully informed of their alternative care options.”\nI understand that there are serious concerns about the legalisation of assisted dying, some of which I share. I will address these thematically below.\nPalliative and end of life care\nDespite the UK’s palliative care system often being rated among the best in the world, underfunding creates huge inequalities in the care that people receive. Without urgent government funding, this is set to worsen with increased demands due to an ageing population. Hospices should not have to rely on charitable donations because state funding only meets 37% of costs. I support calls from the hospice sector for this to rise to at least 70%.\nHowever, The Office of Health Economics, Hospice UK and the Association for Palliative Care of Great Britain and Ireland, all confirmed that even universal access to the highest quality palliative care could not eliminate people’s pain and suffering. Some would still want to end their lives sooner.\nI also understand that there are concerns that palliative care would be deprioritised if assisted dying was legalised. However, this is not borne out by the evidence: in countries and US states where assisted dying is legalised, it was found that there is “no evidence to suggest that the palliative care sectors were adversely impacted by the introduction of the legislation… If anything… in jurisdictions where assisted dying is available, the palliative care sector has further advanced.”\nBut I wish to be absolutely clear: our government must not wait until assisted dying is potentially legalised; it must properly fund palliative and end of life care now.\nSafeguards\nI am pleased that this Bill explicitly limits eligibility to terminally ill people, with mental capacity, if they are expected to die within 6 months, and that it specifically excludes people with disabilities or mental illness alone.\nThis Bill can still be strengthened. For example, I would urge Parliament to consider a different threshold and process to assess capacity than the assumption of capacity in the Mental Capacity Act and to review the provision for the use of proxies.\nIt may be that after the committee stage, I decide that even the most substantial safeguards are not sufficient because of the material reality of our society. That is, a society that discriminates against and devalues the lives of disabled people. It is utterly shameful that the UN found that previous UK governments have been responsible for grave or systematic violations of disabled persons’ rights since 2010. These are matters of vital and urgent importance which the government must fix, regardless of whether or not this Bill passes.\nPotential widening of the law\nI do not want the eligibility criteria for assisted dying to be widened. This Bill is entirely different to assisted dying laws in Canada or the Netherlands, where eligibility is based on ‘intolerable suffering’. In Australia, New Zealand and states in the USA where the criteria is based on terminal illness, there has been no expansion of the law.\nI also understand concerns that the law could be challenged in the courts on discrimination grounds because the eligibility is too narrow, which could lead to a widening of the criteria. However, the European Court of Human Rights has taken the approach that it is for Member States’ legislatures to decide policy on assisted dying, and it has not expanded the laws on assisted dying in any country. While Parliament should give consideration to the rulings of the courts, Parliament is sovereign and has the ultimate power to legislate.\nToday’s vote does not change the law; it is a vote on whether to progress the Bill to a process of rigorous scrutiny. I voted in favour of this, and I reserve the right to vote against the Bill at third reading should I consider its provisions to inadequately safeguard the most vulnerable.\nThe current law is not working. It is cruel, lacks any safeguards for dying people, and the testimony I have heard has been truly harrowing. I believe in the right of the individual to choose, in the principles of autonomy and power in respect of your life, your body and your healthcare.\nThe government must create the conditions in which the right for terminally ill people to die in dignity, is possible, while protecting everyone. That means urgently funding welfare and good quality palliative and end of life care, healthcare and social care – and making it our mission to end poverty, so everyone can make a free choice. This is what I will continue to fight for, regardless of whether this Bill eventually becomes law."
}