{
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_parliament/content_2.html": "Here, you can read all of Jonathan's contributions in Parliament while he was the Member of Parliament for Stoke-on-Trent North, Kidsgrove and Talke from 2019 to 2024.\nHere, you can read all of Jonathan's contributions in Parliament while he was the Member of Parliament for Stoke-on-Trent North, Kidsgrove and Talke from 2019 to 2024.",
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_accessibility/content_3.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_contact/content_5.html": "Skip to main content\nJonathan Gullis\nMain navigation\nHome\nAbout Jonathan\nNews\nCampaigns\nIn Parliament\nContact\nJonathan Gullis\nContact\nLeave this field blank\n[email protected]\nJonathan on Facebook\nJonathan on Twitter\nJonathan on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage",
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_about-jonathan-gullis/content_1.html": "Jonathan grew up in Stratford-upon-Avon, attending Princethorpe College in Warwickshire, before studying International Relations with Law at Oxford Brookes University, and going on to get his PGCE in secondary citizenship from the Institute of Education.\nWhilst at university, Jonathan was elected as a Conservative Councillor to Stratford-upon-Avon District Council in 2011, gaining the Shipston seat from the Liberal Democrats.\nHe then began an eight-year stint in teaching at schools in London, Warwickshire and Birmingham, becoming a Head of Year who was responsible for the achievement, behaviour and safety of over 250 students. He oversaw whole school attendance for Years 7 to 11 and was also the school trade union representative for the NASUWT.\nJonathan's first parliamentary endeavour came in the 2017 general election, where he contested Washington and Sunderland West, increasing the Conservative vote-share by 10%, coming second to Labour.\nIn July 2019, Jonathan was selected as the Conservative candidate for Stoke-on-Trent North, Kidsgrove & Talke, and in the December general election later that year was elected as the Member of Parliament, with the popular vote and a majority of 6,286, becoming the constituency's first ever Conservative MP.\nDuring his parliamentary career, Jonathan sat on the Education Select Committee, helping them to author the report on disadvantaged white pupils, and also sat on the Business and Trade Select Committee, investigating issues like the Post Office scandal and post-Brexit trade agreements.\nHe also co-chaired the All Party Parliamentary Group (APPG) on Apprenticeships and founded and chaired the APPG for Defibrillators.\nIn 2020, Jonathan was appointed as Parliamentary Private Secretary (PPS) to the Leader of the House of Lords, later becoming PPS to the Secretary of State for Northern Ireland.\nJonathan was appointed as Minister for School Standards in 2022, overseeing all primary and secondary schools across England. During Jonathan’s time he introduced the new £30,000 per annum starting salary for new teachers, and began work on introducing a multi year PE and Sports Premium deal for primary schools to improve access to high quality PE lessons.\nDuring his time as a Member of Parliament, Jonathan put forward numerous Private Members' Bills - Desecration of War Memorials, Planning (Proper Maintenance of Land), and the Extension of Auto-Enrolment of Pensions - all of which were adopted by the Government and made into law. Jonathan’s other campaigns which he introduced Bills to Parliament regard Multi-Academy Trusts (Ofsted Inspection) and Sharlotte’s Law (Road Traffic (Testing of Blood) Bill).\nJonathan graduated from the Armed Forces Parliamentary Scheme which raises awareness of issues facing the Armed Forces amongst MPs. Specifically, Jonathan was on the Army course and has visited training centres like AFC Harrogate, Royal Military Academy Sandhurst and the Infantry Battle School Brecon.\nTo help people understand how Parliament and Whitehall works, Jonathan co-hosted the Inside Whitehall podcast with James Starkie, demystifying some of the concepts we hear and read about in politics coverage every day.\nLocally in Stoke-on-Trent North, Kidsgrove & Talke, Jonathan proudly made 761 times spoken contributions in Parliament, which is over four times more than his Labour predecessor. Between 2019 and 2024, he made the most spoken contributions of all Conservative MPs first-elected in 2019. From record levels of funding to new bus routes, read everything Jonathan campaigned for and achieved whilst MP for Stoke-on-Trent North, Kidsgrove & Talke here.\nIn 2024, Jonathan was asked to serve as Deputy Chairman of the Conservative Party which he did until the conclusion of the 2024 general election.\nHe lives with his fiancé Nkita, two children Amelia and William, and dogs Bella and Bailey.",
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_news_feed/content_6.html": null,
  "https_www_jonathangullis_com_about-jonathan-gullis/https_www_jonathangullis_com_campaigns/content_7.html": "Success - £13.8 million secured for Burslem and Tunstall Jonathan worked relentlessly, to stand up in Parliament 85 more times than his Labour predecessor for Burslem and Tunstall. This paid off, with £13.8 million of...\nSuccess - Six new bus routes and cheaper fares Jonathan lobbied tirelessly to secure £31.7 million which is being invested into better bus routes, cheaper fares and upgraded bus stops. Residents in Norton...\nStop Housing People at the Sneyd Arms in Tunstall After it was understood that a number of homeless individuals under the care of the City Council were being housed at the Sneyd Arms in Tunstall, Jonathan began...\nSuccess - New outpatient building for Haywood Walk-In Centre In Parliament, Jonathan fought for our local NHS. The government listened, investing over £20 million into a new outpatient facility for Haywood Walk In Centre...\nSuccess - Tens of millions secured to fix more potholes and resurface more roads Jonathan secured record investment to fill in more potholes and carry out resurfacing. Now it's time for them to use it and fix our roads! Following Jonathan's...\nSuccess - ULEZ kept out of Stoke-on-Trent Jonathan started petition to ensure that London Mayor Sadiq Khan’s “anti-motorist agenda” did not come to Stoke-on-Trent. With the Deputy Leader of the Labour...\nSharlotte's Law For many members of the local community, the tragic death of six-year-old Sharlotte-Sky Naglis remains poignant in memory. Sharlotte was killed in June 2021...\nSuccess - CCTV, alley gates & street lighting for Tunstall Making our streets safer for every resident in every community was one of Jonathan's biggest priorities as the Member of Parliament for Stoke-on-Trent North...\nSuccess - End Serco's Abuse of the North Stafford Hotel Following the use of hotels in Stoke-on-Trent for illegal migrants, Jonathan started a petition, campaigning for Serco to immediately bring an end to the use of...\nSuccess - Stoke to Leek line to re-open In 2020, Jonathan and his Staffordshire colleagues started a petition signed by over 1000 people calling for the re-opening of the Stoke to Leek line...\nSuccess - New & improved CCTV for Kidsgrove On 12/06/23 it was confirmed by Kidsgrove Town Council that following the rollout of new and improved CCTV at Newchapel Rec, Birchenwood and Bathpool Park...\nSuccess - Fuel Duty cut again Jonathan was thrilled that the Chancellor has announced he was keeping the 5p cut to fuel duty and freeze on inflationary rises in the March 2024 budget. He led..."
}