{
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alexs-campaign-diary-week-five/content_16.html": "Monday\nCanvassing. And something strange is going on. People reference national events on the doorstep, to be sure. But those who were Cs last time ultimately seem extremely likely to be Cs this time.\nIt’s a different picture on the ground to that shown in the polls – a point made by many Tories but, as it’s true, I mention it.\nTuesday\nWe finish delivery for our Get Out the Postal Vote personalised letters. With so many people now registered to vote by post this is no small undertaking and the volunteers who’ve done it with me are fantastic. Delivering in the sunshine at last!\nWednesday\nIt emerges that conservatives in different roles put bets on when the election was going to be. My views on this are pretty unprintable, beyond noting that this story is likely to run because the behaviour is so laughably stupid it would be comical – but for the harm it does to those of us campaigning street by street. Thanks guys.\nWe have our first hustings. On the one hand Sarah Sackman, my Labour opponent, has an advantage, as it’s held at the synagogue at which she and her family have worshipped for years. I can’t compete with that past.\nOn the other hand, the Jewish school next to it wrote to me to say they are in jeopardy thanks to Labour’s VAT on independent schools policy, a point I make. Voters will have to decide what’s more important – the past, or the future.\n(Sarah also has to explain how she entirely disagrees with her own party when it comes to David Lammy outbursts on Israel. To coin a phrase… I agree with Sarah.)\nFuture such outings are alas curtailed as my opponents have turned down most of the other hustings we’ve been invited to.\nThursday\nCanvassing.\nThe latest televised leadership “debate” – albeit they’re sequential presentations this time, not an actual debate. The format doesn’t allow for proper explanations of positions on issues like membership of the ECHR (which I’ve discussed elsewhere) and Fiona Bruce breaks her own rule about not interrupting right after mentioning it, and throughout.\nBut one thing becomes clear with Sir Keir Starmer’s answers. When pressed, he says that Jeremy Corbyn would have been a better prime minister than Boris Johnson.\nBear in mind that I’m running for Finchley and Golders Green, the most Jewish seat in the country. What are such electors supposed to think of the belief that Corbyn was fit to be prime minister? Corbyn, who said Hamas were his friends – friends who have raped, murdered and kidnapped Jews and say they’ll do it again? Hamas, the proscribed terrorist organisation?\nStarmer joins Lammy and Angela Rayner in the ranks of those inadvertently kneecapping my Labour opponent and assisting my campaign.\nFriday\nA community meeting with Mike Freer, a consummate professional who’s happily doing a farewell tour that would embarrass Sinatra by way of introducing me to those he knows well – which is a lot of people. And then, and this will surprise you… canvassing.\nSaturday\nCanvassing in Cricklewood. I really like this place. A university friend joins to canvass, with the opening line “I’m a Labour voter normally but I’m campaigning for Alex”, which gets attention.\nThe latest MRP shows us holding the seat, in the face of brutal results elsewhere. No pressure. Interesting number of voters on doorstep say they don’t mind us losing government (!) but don’t care for a landslide either. And in the words of one of them, “I’d therefore vote for you even if I didn’t like you.” A vote’s a vote!\n(Reflecting the point made above about postal votes, canvassing in this election turns up the response “I’ve already voted” more frequently than I’ve seen on the doorsteps ever before.)\nSunday\nTriple canvass session, with the help of Conservative Friends of Israel on the ground today. Full of energy, full of passion – and a lot of them!\nIn the evening, a house meeting. People hosting political events for their neighbours in their own homes – a lovely aspect of British democracy in action.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_events_feed/content_17.html": null,
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_honouring-our-democratic-tradition/content_9.html": "Mike Freer has been a truly exceptional MP for Finchley and Golders Green. His is a powerful legacy in this area – and his example is one I strive to emulate.\nMike is standing down – after being on the receiving end of several credible death threats, having been targeted by Sir David Amess’s killer, and after our Association office on Ballards Lane was set on fire.\nWith these facts before me, I knew that I couldn’t stand idly by. The Finchley and Golders Green Association might not select me, but I could at least try. I knew that I would forever regret it if I missed this opportunity to contribute to public service when the call came. So, I put myself forward – and I’m so proud and honoured that the Association chose me to be the candidate for Finchley and Golders Green. It is a great responsibility for me and one that I relish.\nIn light of the context I have described, I would like to say something about the forthcoming election. My opponents – all, by dint of the events I have described, selected well before me – are palpably decent people who believe as we do that change in society comes through the ballot box. That our democracy is served in the battle of ideas, not by creeping up in the dead of night and leaving a building in flames.\nWe are going to have a great debate in Finchley and Golders Green. We are going to argue robustly. But in the end, it will have been made clear that that which unites those in such debates is far stronger than what divides us – for the great divide is between all of us who believe in and stand up for democracy and those who think that violence is the right means to a political end.\nBy engaging in this debate with sincerity and civility, my opponents and I will collectively honour our democratic tradition and leave our community better rather than worse for having had that debate, whoever may prevail.\nMy priorities for the area are:\nSafety on our streets: I will work to address local safety concerns, advocating for our fair share of funding from the Mayor for policing, focusing on reducing knife crime and antisocial behaviour. I will take robust action to combat the unacceptable rise in antisemitism that has plagued our country and our city since October. It is intolerable that valued members of our community are questioning their places in our society due to the actions of a loud minority.\nBuilding family homes: People need places to live, and it is vital that housing developments enhance the local area. This means thoroughly considering their impact on infrastructure and community services. Brent Cross Town is an outstanding example of how thoughtful planning can lead to successful, sustainable developments.\nSupporting local businesses: Local businesses are the lifeblood of our communities, and I will strongly advocate for enhanced measures to support them. I am committed to ensuring they receive the necessary assistance to thrive, including access to financial support, streamlined regulations and initiatives that encourage local shopping and investment.\nStanding up for you: Residents deserve to have their voices heard on the issues that matter most to them. I will actively listen and work to raise your concerns with the relevant person or authority. It is only right that your views help shape the decisions that affect our community.\nNone of us are blind to the current political reality. These are challenging times for my Party. But this election will be fought on the ground, on local issues. Come what may, in the General Election, if I am elected to be the new MP for Finchley and Golders Green, I will be a strong voice for this area in parliament.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_cdn-cgi_l_email-protection/content_24.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alex-deane-endorses-international-holocaust-remembrance-alliances-working-definition/content_26.html": "Alex Deane, the Conservative Prospective Parliamentary Candidate for Finchley and Golders Green has taken a definitive stand against antisemitism by formally embracing the International Holocaust Remembrance Alliance’s (IHRA) working definition of antisemitism.\nThis adoption marks a significant commitment, aligning Deane with a global movement dedicated to eradicating hatred, racism and discrimination against Jewish people.\nThe IHRA definition is recognised internationally and provides a comprehensive framework to identify antisemitism. By signing up to the definition, Alex joins a global community committed to combating racism, hatred and discrimination against Jewish people.\nCommenting, Alex said:\n“Antisemitism has no place in our society, and we must confront and eliminate it wherever and however it manifests. By adopting the definition, I am affirming my commitment to my prospective Jewish constituents, promising to stand against hatred and work towards a more inclusive and respectful society.\nThe alarming surge in antisemitic incidents since October 7 underscores the necessity of steadfastly upholding the definition.The endorsement of IHRA should not be controversial, nor a matter for debate. I urge my fellow candidates in Finchley and Golders Green, and indeed across the nation, to join me in this pledge, acknowledging that the battle against antisemitism transcends political boundaries and demands collective action.”\nThis pledge comes at a crucial time when reports of antisemitic incidents are on the rise in the UK and around the world. Data collected by the Community Security Trust (CST) from October 7 to December 31, 2023, reveals a significant and frightening trend; 4,103 instances of anti-Jewish hate were recorded during this period. The figure represents a staggering 66 per cent of the total incidents for the year 2023, surpassing any yearly totals of antisemitic incidents documented by CST.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alex-deane-celebrates-purim-golders-green/content_23.html": "Alex Deane joined the vibrant Purim celebrations in Golders Green accompanied by former Home Secretary and staunch ally of the Jewish Community, Suella Braverman MP. The pair joined the festivities and experienced the traditions that make Purim a cherished occasion in the Jewish calendar.\nAlex was welcomed warmly by the residents of Golders Green and also met with members of the Shomrim and Hatzalah, vital community organisations that are instrumental in ensuring the safety and health of the community.\nCommenting, Alex said:\n“Celebrating Purim in Golders Green was an extraordinary experience. The sense of community was palpable, and I am so grateful to everyone who came and said hello and made me feel so welcome. I hope to celebrate many more Purims in Golders Green in the years to come.\nIt was an honour to witness the dedication of the Shomrim and Hatzalah. Their hard work and commitment to the community are inspiring and I look forward to engaging with them in greater detail over the coming weeks.”",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_feed/content_10.html": null,
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_privacy/content_5.html": "This document outlines how Alex Deane processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Alex Deane\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Alex Deane.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Alex Deane, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Alex Deane via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news/content_14.html": "Alex's Campaign Diary: Week Five Monday, 24 June, 2024 Monday Canvassing. And something strange is going on. People reference national events on the doorstep, to be sure. But those who were Cs last time ultimately seem extremely likely to be Cs this time. It’s a different picture on the ground to that shown in the polls – a point made by many Tories but, as it’s true, I mention it. Tuesday We finish delivery for our Get Out the Postal Vote... Opinions\nAlex's Campaign Diary: Week Four 17th June 2024 Monday Canvassing with a team in rain/sunshine/rain/sunshine. A fantastic guy in his teens joins our team to help, as his family had been at a talk I gave last... Opinions\nAlex's Campaign Diary: Week Three 10th June 2024 Monday Claire Coutinho joins us for the morning canvass. She’s adept on the doorstep and we cut a quick video about her energy interests too. Any ministers... Opinions\nAlex's Campaign Diary: Week Two 3rd June 2024 Monday The week starts with a bang, with the Party Chairman campaigning with us. A big group of activists are with us as we set out from the constituency office... Opinions\nHonouring our democratic tradition 1st June 2024 Mike Freer has been a truly exceptional MP for Finchley and Golders Green. His is a powerful legacy in this area – and his example is one I strive to emulate... Opinions\nAlex’s Campaign Diary: Week One 27th May 2024 Tuesday On what turned out to be the day before the election was called, I met with Chris Philp, the Policing Minister. I talked about my keen desire to see the... Local News\nAlex Deane Calls for a Halt to the Weekly Marches in London to Ensure Public Safety 21st May 2024 This morning, Alex Deane, met with the Police Minister Chris Philp to address the ongoing marches in London and their implications for public safety and... Local News\nAlex Deane Attends Groundbreaking Ceremony for New Affordable Housing Development in Golders Green 28th March 2024 Alex Deane, the Conservative Prospective Parliamentary Candidate for Finchley and Golders Green, attended the groundbreaking ceremony for a new block of flats... Local News\nAlex Deane Endorses the International Holocaust Remembrance Alliance’s Working Definition of Antisemitism 27th March 2024 Alex Deane, the Conservative Prospective Parliamentary Candidate for Finchley and Golders Green has taken a definitive stand against antisemitism by formally... Local News\nAlex Deane Celebrates Purim in Golders Green 24th March 2024 Alex Deane joined the vibrant Purim celebrations in Golders Green accompanied by former Home Secretary and staunch ally of the Jewish Community, Suella... Local News",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alex-deane-calls-halt-weekly-marches-london-ensure-public-safety/content_21.html": "This morning, Alex Deane, met with the Police Minister Chris Philp to address the ongoing marches in London and their implications for public safety and particularly that of the Jewish community.\nAlex raised the case where a police officer told a Jewish man that his “openly Jewish” appearance risked antagonising pro-Palestinian marchers with the Minister, who acknowledged the gravity of the situation and the challenges faced by the Government.\nCommenting, Alex said:\nThe police officer’s statement reveals a troubling reality; if the marches were genuinely anti-Zionist and not antisemitic as their organisers claim, the presence of a Jewish person would not be seen as provocative.\nIt is unacceptable that some individuals in British society feel unsafe in the heart of our once-inclusive capital. The rank-and-file officers policing these protests are doing their best under difficult circumstances, but their position is becoming increasingly untenable.\nWithout change, the situation will deteriorate further. I believe amendments to the Public Order Act may be necessary to halt these marches and allow our police officers to focus on ensuring the safety of all citizens.\nThe Minister also expressed support for the forthcoming Walney Review which is set to be released later today. The Review is intended to increase the government’s understanding of the increase in activity by far-right, far-left and other political groups and identify where activities can cross into criminality and disruption.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_about-alex-deane/content_12.html": "Alex Deane is a dedicated Conservative activist and seasoned campaigner, bringing a wealth of experience and a passion for public service to Finchley and Golders Green. Alex grew up in Suffolk and was educated at a comprehensive before achieving a place at Trinity College, Cambridge.\nHis extensive campaign record spans local elections, by-elections, and even federal seat campaigns in Australia.\nIn addition to his political endeavours, Alex has forged a successful career as a Senior Managing Director in a global business advisory consultancy, providing counsel to leading international companies on political strategies. His expertise in communications and public affairs equips him to address the needs of both small businesses and multinational corporations.\nA familiar face on television and radio, Alex's insight is frequently sought on television and radio. His strong media presence, coupled with a substantial social media following, enables him to effectively communicate and engage with constituents.\nBeyond politics and business, Alex is married to Catriona and they have one son. His commitment to community engagement is evident, volunteering at a homeless shelter and serving as a school governor. His diverse experiences, from serving as a barrister specialising in criminal law to advising on international educational opportunities, have shaped his understanding and empathy for people from all walks of life.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alex-deane-attends-groundbreaking-ceremony-new-affordable-housing-development-golders-green/content_19.html": "Alex Deane, the Conservative Prospective Parliamentary Candidate for Finchley and Golders Green, attended the groundbreaking ceremony for a new block of flats in Golders Green, initiated by the Agudas Israel Housing Association.\nIn an important step forward for affordable housing in Barnet, this project represents the first development that the association has built in the Borough of Barnet and will deliver 22 100 per cent affordable units for the Orthodox Jewish community.\nAt the ceremony, Golders Green Councillor Dean Cohen thanked the Trustees and Senior Management of the Agudas Israel Housing Association for working closely with him to deliver this “very important milestone.” Councillor Cohen was integral in bridging the conversation between the Housing Association, as the developer, and Barnet Council to ensure the project’s success.\nCommenting, Alex said:\nToday marks a significant milestone for the Agudas Israel Housing Association and the local Orthodox Jewish Community. I am proud to stand here alongside Councillor Dean Cohen, without whom this development would not have been possible, to break ground on this important project that will lay the foundation for future generations to thrive.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_category_Local-News/content_18.html": "Alex’s Campaign Diary: Week One 27th May 2024 Tuesday On what turned out to be the day before the election was called, I met with Chris Philp, the Policing Minister. I talked about my keen desire to see the... Local News\nAlex Deane Calls for a Halt to the Weekly Marches in London to Ensure Public Safety 21st May 2024 This morning, Alex Deane, met with the Police Minister Chris Philp to address the ongoing marches in London and their implications for public safety and... Local News\nAlex Deane Attends Groundbreaking Ceremony for New Affordable Housing Development in Golders Green 28th March 2024 Alex Deane, the Conservative Prospective Parliamentary Candidate for Finchley and Golders Green, attended the groundbreaking ceremony for a new block of flats... Local News\nAlex Deane Endorses the International Holocaust Remembrance Alliance’s Working Definition of Antisemitism 27th March 2024 Alex Deane, the Conservative Prospective Parliamentary Candidate for Finchley and Golders Green has taken a definitive stand against antisemitism by formally... Local News\nAlex Deane Celebrates Purim in Golders Green 24th March 2024 Alex Deane joined the vibrant Purim celebrations in Golders Green accompanied by former Home Secretary and staunch ally of the Jewish Community, Suella... Local News\nAlex Deane to represent Finchley and Golders Green 21st March 2024 The Finchley and Golders Green Conservatives are delighted to announce the selection of Alex Deane as the Conservative candidate for the upcoming General... Local News",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk/content_1.html": "Latest news\nFind me on Twitter\nFinchley & Golders Green\nAm I your candidate?\nEnter your postcode to confirm that Alex Deane is your candidate.\nHi, I'm Alex Deane, your Conservative candidate for Finchley and Golders Green. I'm here to make a difference to our community, to represent you in Parliament after the next election and to support the businesses and public services on which we rely in our area. I welcome you to join my campaign and help me keep Finchley and Golders Green blue.\nEnter your postcode to confirm that Alex Deane is your candidate.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_category_Opinions/content_7.html": "Alex's Campaign Diary: Week Five 24th June 2024 Monday Canvassing. And something strange is going on. People reference national events on the doorstep, to be sure. But those who were Cs last time ultimately... Opinions\nAlex's Campaign Diary: Week Four 17th June 2024 Monday Canvassing with a team in rain/sunshine/rain/sunshine. A fantastic guy in his teens joins our team to help, as his family had been at a talk I gave last... Opinions\nAlex's Campaign Diary: Week Three 10th June 2024 Monday Claire Coutinho joins us for the morning canvass. She’s adept on the doorstep and we cut a quick video about her energy interests too. Any ministers... Opinions\nAlex's Campaign Diary: Week Two 3rd June 2024 Monday The week starts with a bang, with the Party Chairman campaigning with us. A big group of activists are with us as we set out from the constituency office... Opinions\nHonouring our democratic tradition 1st June 2024 Mike Freer has been a truly exceptional MP for Finchley and Golders Green. His is a powerful legacy in this area – and his example is one I strive to emulate... Opinions",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_online-qa-1-july/content_15.html": "Tweet ONLINE Q&A - 1 JULY - 20:00 Please join us to put your questions to Alex Deane, the Conservative candidate for Finchley and Golders Green. The session will be chaired by Mike Freer, the former Member of Parliament for Finchley and Golders Green. SIGN UP HERE",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_map-locations/content_2.html": "Skip to main content\nMain navigation\nHome\nAbout Alex\nNews\nContact\nOnline Q&A - 1 July\nMy map",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alex-deane-represent-finchley-and-golders-green/content_22.html": "The Finchley and Golders Green Conservatives are delighted to announce the selection of Alex Deane as the Conservative candidate for the upcoming General Election. This decision comes after careful consideration and reflects our confidence in Alex's abilities to serve our constituency.\nAlex Deane brings a wealth of experience to this role. His commitment to representing the interests of all residents, coupled with his passion for positive change, makes him an excellent choice to lead Finchley and Golders Green into the future.\nMike Freer MP, who has served Finchley and Golders Green with distinction, shared his thoughts on the selection of Alex Deane:\n\"I am thrilled to see Alex Deane selected as the Conservative candidate for Finchley and Golders Green. His dedication to public service and his commitment to our community make him the ideal candidate to continue the work we've started. I have every confidence that Alex will be an outstanding representative for our constituency, and I look forward to supporting him in the upcoming General Election.\"\nFinchley and Golders Green Conservatives extend their warmest congratulations to Alex and pledge their full support as he embarks on this exciting journey to represent our community.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alexs-campaign-diary-week-two/content_20.html": "Monday\nThe week starts with a bang, with the Party Chairman campaigning with us. A big group of activists are with us as we set out from the constituency office, Margaret Thatcher House – which Richard knows well, as he recently came to reopen it after it was set on fire.\nThis is the sort of thing that is at stake; as I have said elsewhere in these pages, there are many points upon which we differ from our opponents but we are united in our belief in democracy rather than violence. More prosaically we get out almost all of this batch of material… before the next batch arrives!\nTuesday\nSpent on my day job. Worth mentioning as some online warriors seem to think that candidates are bathing in money whilst gargling champagne. Across the political spectrum, those willing to stand are doing so at their own expense and effort. Remember that when they come knocking, even if you don’t much feel like being friendly!\nMeanwhile my friend Simon is out nailing what’s left of the material from yesterday. In politics you won’t get far without allies and old friends coming to your aid. I am very lucky.\nWednesday\nMeeting residents in the Hampstead end of the constituency, who set out some concerns about community safety, especially in light of a recently-announced march set to go past pretty much every synagogue in the patch. Then a call with a resident worried about safety around Cricklewood station – completely reasonably, given the points she makes.\nAs per last week’s diary, I stress that candidates can’t yet take action – but hopefully they know who can and will find a way to help.\nIn this case, the excellent Conservative councillors in Barnet promptly pick up the issues I raise. Such is the teamwork an aspirant hopes to enjoy if elected. Then on to Ally Pally for a truly remarkable event – Jtrade, a trade fair for Jewish businesses in London. It’s a fantastic community event – and brilliant for a candidate who can see thirty thriving companies in the constituency in one go!\nThursday\nA video I posted online is doing the rounds on social media and via Whatsapp. I didn’t hold back. Very glad to have people getting in touch – mostly positively!\nI check in with our team doing phone canvassing. It’s worth a shout out, not least as some people who can’t or don’t want to go door to door might not realise that this is a very helpful way to assist someone’s campaign from the comfort of your home – or with friends and colleagues in a constituency office!\nFriday\nIn partnership with Ameet Jogia, our candidate in Hendon, I meet with rabbis from both there and across Finchley and Golders Green. It’s a brilliant meeting.\n(Most people don’t even think about what constituency they’re in from year to year – if you’ve got a community that exists across an imaginary constituency line, then find a way to work with them in conjunction with others rather than treating the arbitrary border as a barrier!)\nThen on to meet constituents for endorsements on forthcoming literature.\nSaturday\nWe canvass. If you don’t like knocking on doors, don’t go into politics! Very grateful to the team from Hampstead who come to help. Mutual aid is little recognised outside campaigning… but magic within it.\nSunday\nCanvassing morning and (gloriously sunny) afternoon. It’s a cliché to say that responses are positive – but so they were! A large group is out with us, led by Mike Freer. I am very lucky to be his successor as candidate, he goes the extra mile each and every time – which is why he was such a good MP.\nMeanwhile, my article in the Barnet Post drops.\nLess positively, a group in the constituency gets in touch to say that I was the only candidate willing to participate in their hustings, so they’re cancelling it!\nPublic debate is an important part of the democratic process. Constituents are entitled to see their prospective MPs in debate before they elect them, or so I think. In our oppositional Parliament, in which the idea is to crash government’s policies headlong into the opposition’s arguments as hard as each side can so that they are properly tested before they are enacted, it’s part of the process – and a good one.\nI can understand someone not wanting to be an MP, and not wanting to speak in public… but I can’t really understand someone wanting to be an MP, but not wanting to speak in public…\nI’m happy to debate my opponents anytime, anywhere. They presently seem to feel differently. Let’s hope that that changes!",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alexs-campaign-diary-week-one/content_25.html": "Tuesday\nOn what turned out to be the day before the election was called, I met with Chris Philp, the Policing Minister.\nI talked about my keen desire to see the end of the weekly marches through London – rendering our capital a no-go area for many constituents in Finchley and Golders Green, and British Jews more broadly. Under this government, at least, such points get a sympathetic hearing.\nSide note. I’ve known Chris for twenty years and gallingly, whilst there I am with my greying hair, weatherbeaten face (which often attracts constructive criticism from viewers after media appearances), and growing paunch (ditto), Chris looks exactly as he did in 2005.\nWhen I was selected I talked in these pages about the importance of having a robust but civil campaign. I intend to live up to that. This is made easier by the fact that on Tuesday evening, for the first time, I met Sarah Sackman of Labour, my principal opponent, at the Annual Barnet Council civic event for the change of Mayoralty – and as expected she’s a perfectly nice person who wants the best for the patch. It’s her Party that’s the issue…\nThe rest of the field has yet to really show itself. To be fair, that’s not unusual. Commentators often describe politics as having “battles” and so forth, but the reality is that for most of the time rival campaigns are more like trains running on parallel lines. You might catch glimpses of each other through the woods, you may be racing to the same destination, but – by design! – the tracks don’t cross. The temptation to think about what your opponent is up to is hard to resist – but you’re better off focusing on your own work.\nWednesday\nDeliveries with a great team in the seat. Even when you’re frantically playing the role of volunteer postie, an underpriced element of political activism, some people are at home and willing to have a chat. Any candidate worth his or her salt grabs such opportunities with both hands. As I pointed out in my introductory video, people are much nicer in real life than they are online!\nPeople talk a lot about pressure in politics. On your time. On your mind. Not to let your Party down. That’s all true, but in my case, I have an additional pressure. Mike Freer, my predecessor as Conservative in the seat, was an exceptional MP for fourteen years. Everywhere I go people say they know and really like him. Anecdotes about how he helped people are volunteered with alacrity. It’s one hell of a legacy to live up to.\nThe election was called soon after we packed in delivering. Well, at least we know where we stand. I think that history will be kinder of the call to go now than the present commentary!\nThursday\nNow that the election is on, all my media gigs dumped me for the duration, as they should – all expected, but it’s a peculiar reversal to be fielding calls from producers at Sky, GB News, talkTV, et al to say you can’t go on! Clears the diary for campaigning.\nI wrote a piece for The North West Circular about my candidacy, wrote some copy for our next leaflet, and did an interview with The Jewish Chronicle. That’s all from home. My wife and I moved south in London last year, for a bigger place with a garden, in time for the arrival of our son in February – just in time to be selected for a great seat in north London in March.\nSerendipitously it means I’m in Dulwich, where Margaret Thatcher (as she was then) had her home, whilst campaigning for her seat in Finchley. It means a fair bit of travel – but nothing compared to what many candidates undertake – often for years. No complaints, albeit my excellent activists are getting used to “if I catch that train, I can get home for bath time…”\nBut I’m still in the patch, for a planning meeting in the evening and then for what turns out to be a very special moment.\nThe Phoenix, East Finchley’s beloved local cinema, has been vandalised for having the temerity to show a film about the atrocities of 7 October. Absolutely appalling. And critics threaten to disrupt the cinema’s evening on Thursday, too. Many in the local community are determined to show their support for the cinema, and I join them.\nAs I had nothing to do with organising anything and just pitched up to show a friendly face, I’m free to observe impartially that it was the most impressive counterprotest I’ve ever seen. Happy smiling and singing and dancing in a pretty spontaneous gathering, to block the path of those wishing to abuse a local cinema. Remarkable really.\nFriday\nI spend some time with a local resident concerned about crime in his street and the area around it. Seeing the footage from his home camera, with people trying his car door at all times of day and night, I can see why. Like many, he completely understands that a candidate can’t do anything yet, barring making representations to councillors et al – but we can still listen, and care.\nAn interview for Jonny Gould’s podcast, Jewish State. He is an adept broadcaster and his method is a useful example for political campaigners. When you’ve got content in the bank it isn’t just one lump! You can cut it up and reuse bits of it for days.\nSunday\nA show recorded before the die was cast airs on Sunday on TalkTV. I was alongside my old friend Conor Burns, last seen in person at the desperately sad funeral of a young mutual friend who’d been in politics, at which he spoke so well and so movingly. People often don’t see the human side of politics but my goodness it’s there. I hope that the good people of Bournemouth West return Conor to the House once again.\nBig day of campaigning in the patch. Teams of people out delivering and canvassing. I’m so lucky to have this kind of support – but also candidates can make a bit of their own luck. Use your networks! Someone expresses support in a message to you? Ask them to come out and help! The worst they can do is say no!\nHere’s a last minute update I didn’t expect to be including. We are going to the country with a pledge to restore National Service. Well. I am to a large degree in politics because of my late father, who I admired and loved above all people. National Service was his favourite policy. He often spoke about how it was the one time everyone was together in society, how it taught skills for life and discipline and gave direction – how it was the making of him as a man.\nMany like me will have been raised by parents who felt the same, so there’s some institutional loyalty to the policy. But I worry that we’ve got no time to really explain it. Policies need to have the pitch rolled, especially big ones.\nAnyway. I’m delighted to be your diarist for the duration!",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_contact/content_13.html": "Skip to main content\nMain navigation\nHome\nAbout Alex\nNews\nContact\nOnline Q&A - 1 July\nContact\nLeave this field blank\nConstituency Office\n212 Ballards Lane, Finchley, N3 2LX\n0208 445 4292\n[email protected]\nOn Facebook\nOn Twitter\nOn Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_cookies/content_11.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alexs-campaign-diary-week-four/content_8.html": "Monday\nCanvassing with a team in rain/sunshine/rain/sunshine. A fantastic guy in his teens joins our team to help, as his family had been at a talk I gave last week. A reminder that the biggest problem for the youth vote is that… they don’t vote. They talk online a lot, but their power at the ballot box is dwarfed by the older vote which reliably turns out.\nSo if younger voters want their concerns (YIMBYism not least) considered, then vote – and get involved!\nAfter a minor flurry of hostile interest over the weekend, I post the relevant extracts from my 2005 book (!) on X so the context can be seen. People seemingly… couldn’t be less interested, which I suppose is reassuring.\nI record a short video for parents affected by Labour’s planned tax hike on school fees. There are dozens of independent schools in Barnet, over twenty of them Jewish – with many parents who aren’t at all wealthy making sacrifices to secure their children the religious education their families need, who will be hit by the plan.\nWhen my activists get in touch to say that the video has made it independently (no pun intended) to Whatsapp groups they’re in, I know that it’s been a good one.\nIn the evening I speak to a regularly-convened online discussion group. I was happy to be asked, but had no clue as to the scale of it when accepting… 200 people are online for the discussion!\nThink about things like that when next someone moans about the internet and social media: here’s a remarkably diverse set of people interested in politics and their community, empowered to discuss things with others from the comfort of their own homes.\nTuesday\nMike Freer, the former MP, and I spend some time on handover issues and take a meeting together with a local community leader. This is the kind of thing that is often overlooked in our system. Voters are inevitably frustrated if a longstanding issue in the patch is treated as if wholly new by the incoming MP. So this as part of one’s democratic due diligence… whether I win or not!\nWednesday\nCanvassing! And in the evening, a house meeting. Fifty people gather in the home of a constituent keen to ensure that my message is heard in the local community. They give me a good old grilling!\nCandidates should lead from the front, and being at such events means that one can’t help to run a canvassing or delivering session. So I’m really lucky that our past mayoral candidate – and longtime friend – Susan Hall steps in to help our team out knocking up this evening whilst I’m elsewhere.\nWhich prompts a thought. Political parties aren’t just brands: they’re tribal groups with institutional loyalty built up over many years. Lacking this hinterland is one of the challenges for insurgent newcomer parties, no matter how high-profile they may be.\nThursday\nWe record some content for videos for the rest of the campaign. I am very lucky to have talented and dedicated volunteers helping me.\nOh, and I mute a few Whatsapp groups. Candidates (and others) just love a gossip. Get out and knock on a door!\nFriday\nI visit Artsdepot, a community hub for the arts in the constituency. As with so many institutions in our country, Covid – and what we did during it – hit the centre hard. My parents both taught drama and the arts have always been important to me. More Bach and Mozart than atonal, plinky-plonk avant-garde nonsense for me… but then, of course, I am a conservative!\nOur Get Out The Postal Vote cards have arrived, so GOTPV will be the focus for the next few days. More people will vote by post in this election than ever before – a point seemingly missed by many political commentators. The fixation on “polling day” is a natural one, but in the current environment it’s more like polling month.\nSaturday\nDouble delivery session for GOT(P)V. In the rain/ sun/rain. I’m sure we will be told in due course that this was the hottest June ever, which will be odd given that many of us have turned the heating on. Rupert Matthews, our Police and Crime Commissioner in Leicestershire and Rutland, uncomplainingly delivers several bundles in the belting rain, fortunately so festooned in wet weather gear as if venturing into a tropical rainforest.\nMeanwhile I proudly sign up to the #UkraineMustWin campaign. The extent to which this has slipped off the political radar is terrible. I have loved the time I have spent in Kyiv and I think often of the bravery of those fighting for freedom and to repel an utterly unjust invasion.\nPerhaps it’s not a vote winner in the UK in 2024. But that’s not all that being a candidate is about.\nSunday\nWhile our excellent team led by local councillors deliver a full action day in Golders Green, Mike and I do some street stalls across the community together; a high-visibility handover! The number of people who come to give him their heartfelt thanks was plainly rather moving for him – and showed me what shoes I have to fill, if I succeed.\nAnd, lest people forget that candidates are people and not just robotic legal necessities in a campaign, I clock off earlier than usual, for a family event; it’s my first Father’s Day as a father, and my fourth without my Dad.\nThat this is the way of the world makes things no easier. Time does not heal all wounds. The juxtaposition is actually rather painful. I know how much Dad would have loved my son.\nBut whilst, for me, the rawness of this is not diminished, I find that there is also happiness and hope for the future this day, knowing how much I owe him, in seeing so many of my father’s qualities in my boy.",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_accessibility/content_6.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_alexdeane_org_uk_/https_www_alexdeane_org_uk_news_alexs-campaign-diary-week-three/content_4.html": "Monday\nClaire Coutinho joins us for the morning canvass. She’s adept on the doorstep and we cut a quick video about her energy interests too. Any ministers reading this should be assured that support like this means the world to candidates and it really gives a shot in the arm to activists!\nI do two journalist interviews in the afternoon – the Jewish News and the London Tab. Gaza and the Middle Eastern situation features heavily in both. The first is out, the second will drop in due course. I don’t think that he was expecting the answers I gave…\nTuesday\nA key meeting with community activists, in conjunction with the Hendon activists and their candidate Ameet Jogia. Suella Braverman drops by to give encouraging remarks. She has been a friend for 25 years and I am proud to campaign with her. An afternoon call with a trade association keen to know the positions being taken by candidates, and canvassing in the evening.\nDeane’s golden rule – if you don’t like dogs, don’t go into politics – is to the fore, as I hit one street with a clutch of chattering canines! Fortunately… I do!\nWednesday\nI speak at the University of the Third Age meeting in Hampstead Garden Suburb. The questions are thoughtful, erudite and on point – it’s not my first U3A meeting, I have always enjoyed them. Then canvassing, then a long Q&A into the night in the Jewish community.\nPart of my intention in aspiring to replace the excellent Mike Freer is to ensure that that much put-upon group continues to have non-Jewish allies in Parliament. Whilst I have an excellent Labour opponent, fortunately for me her front bench just can’t help contributing to reasons to prefer the Conservative Party on this topic.\nThursday\nOh dear. Canvassing is positive, but that isn’t the main thing on 6 June 2024, is it? The Prime Minister leaves D Day commemorations early. Lest people think that this is a remorselessly crawling diary: I just find this so appalling.\nNot, as some say, about the “optics” or about the “advice he’s getting” – about the act, and the thought process that could take anyone to it. The more I think about it, the dumber and worse it is. Rightly, the PM has apologised. I think he means it; I think he genuinely cares about the sacrifices made by the greatest generation (and those that followed them in our armed forces); and of course I don’t think that he meant for a moment to cause the feelings it did.\nBut no shying away from it, it was a mistake – made when we can afford precious few.\nFriday\nJust in time for the close of nominations, the Labour Party and their allies release their dossiers on candidates. Or perhaps that’s unfair and it’s a total coincidence that a number of candidates happen to have stories about them launched on this day. Two left-wing media outlets try with me. I respond promptly.\nMeanwhile I meet a property company seeking to build in the patch, then a prominent supporter, then meet with my campaign team and Mike Freer (did I mention last week how lucky I am to inherit my candidacy from someone standing down who still works so hard? I did. I’ll say it again. I am very lucky.)\nThen another meeting, pretty late. (Second rule: these aren’t nine to five gigs, however many alterations are made to Parliamentary sitting hours.)\nSaturday and Sunday\nDouble session canvassing, both days. It doesn’t make for interesting diary copy I suppose, but as all politicos know, it’s actually fascinating. To have a reason/excuse to go and knock on people’s doors and ask them what they think about things is a privilege and a quirk of our own democratic process, surprisingly not universal even in other democracies.\nThird rule: if you don’t like knocking on doors, don’t go into politics in the UK! Across the political spectrum, some people seem to think that they’re going to drift into some sort of super senior advisory role doing strategy without putting in the hard yards. Too much West Wing in their viewing diet I think.\nOh, and the lefty articles both drop. But sorry, lads – little impact. I’m still standing!\nThis article first appeared in conservativehome"
}