{
  "https_www_suewebber_uk_/https_www_suewebber_uk/content_1.html": "Latest News We need to prioritise housing spending The report to last Friday’s special meeting of Edinburgh’s housing committee… No place for Kneecap’s bile I’m first to accept I’m not exactly in the target market for hip-hop, but… Sue Webber MSP demands “crackdown” on antisocial behaviour on buses Today at First Minister’s Questions, local MSP for Edinburgh and the Lothian… Find me on Facebook Find me on Twitter\nWe need to prioritise housing spending The report to last Friday’s special meeting of Edinburgh’s housing committee…\nNo place for Kneecap’s bile I’m first to accept I’m not exactly in the target market for hip-hop, but…\nSue Webber MSP demands “crackdown” on antisocial behaviour on buses Today at First Minister’s Questions, local MSP for Edinburgh and the Lothian…",
  "https_www_suewebber_uk_/https_www_suewebber_uk_cookies/content_3.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_ae-services-nhs-lothian-are-facing-terrifying-winter/content_28.html": "Scottish Conservative and Unionist Sue Webber MSP for Lothian Region says A&E services in NHS Lothian are facing a “terrifying” winter.\nSue Webber MSP’s call comes after new statistics revealed only 61% of patients were seen within four hours at A&E in NHS Lothian during August.\nAt St John’s Hospital only 59.5% of patients were treated within the SNP’s four-hour target time whilst at Edinburgh Royal Infirmary it was just 48.1% of patients.\nThe SNP’s target is for 95 per cent of patients to be seen within four hours of arriving at A&E.\nSue Webber MSP says that if waiting times at A&E departments are this bad during the summer, she “dreads to think” how it will be during the winter months.\nShe added that the SNP have left services in a state of “permanent crisis” and have no positive vision for Scotland’s NHS, and urged SNP ministers to get out of the “Holyrood bubble”, accept the scale of the crisis in NHS Lothian and adopt common-sense Scottish Conservative plans to deliver a modern, efficient and local health service.\nScottish Conservative and Unionist Sue Webber MSP said: “A&E waiting times in NHS Lothian remain absolutely appalling.\n“Given only 61% of patients were seen during August, the prospect for patients and dedicated staff in NHS Lothian during the winter months is terrifying. Edinburgh Royal Infirmary’s figure of 48.1% is of particular concern.\n“I dread to think what scenes we will see in A&E corridors in the coming weeks and months if the SNP do not get a grip of this situation.\n“Successive SNP health secretaries have left A&E services in NHS Lothian in a state of permanent crisis and they have no positive vision to fix it.\n“It is time SNP health secretary Neil Gray got himself out of the Holyrood bubble and accepted the scale of the crisis in our NHS.\n“The Scottish Conservatives have put forward a bold plan to deliver a modern, efficient and local health service and I urge Neil Gray and the SNP to adopt our proposals.”",
  "https_www_suewebber_uk_/https_www_suewebber_uk_about-rss/content_8.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_time-city-council-stop-seeing-car-drivers-bogeyman/content_23.html": "Edinburgh has long been waging an ideological war on motorists, but it seems the more council leaders argue they are not persecuting drivers, the more extreme the measures have become.\nOnly when obvious outcomes become reality, like the Corstorphine bus gate fiasco or the West Craigs low traffic neighbourhood, are more sensible measures adopted.\nAlong the way the council manages to alienate people who just as enthusiastic about reducing the city's carbon footprint as transport officers, but have the benefit of detailed local knowledge which would produce better schemes, if only they were listened to in the first place.\nIt will be the same with the Low Emission Zones, which cost over £13 million of tax payers' money to set up here and in the other three big cities, making a minimal difference to air quality within the boundaries, but generating significant increases in the immediate periphery.\nBut they will make plenty of money for councils - over £1m for Glasgow in the first year, to June last year - and with 6000 fines issued that month here, when the Edinburgh scheme went live, the council could rake in around £2m.\nThese schemes might make little difference to net zero, but they have quickly become significant cash cows which will only encourage their expansion when revenues drop as drivers with non-compliant vehicles get wise.\nIt's the same story with controlled parking zones, generating cash while just displacing non-resident parking. It means that eventually everyone in Edinburgh with a car but no driveway being forced to buy a permit without the guarantee of a nearby place.\nJust don't expect to see the money invested in better park and ride facilities or on repairing our shocking road surfaces because neither the council nor Scottish Government are interested in incentivising you to change your habits, just to punish you.\nFor these reasons I was delighted to lead a debate in the Scottish Parliament yesterday on behalf of persecuted car owners, not just in Edinburgh but across Scotland and to point out how important efficient road transport is to Scotland's economy.\nIt's pointless to introduce 50mph speed limits on single carriageway roads but fail to accelerate the expansion of the electric vehicle charging network, when it is not just emissions which get up the nose of the Green lobby, but the very principle of car ownership.\nThey would far rather return to the days when most people relied on public transport and private car ownership was a rarity - it's OK for those with ministerial cars.\nBut the world has changed, particularly in Edinburgh, where so many people working in the city live further afield because of housing costs, but who find buses and trains unreliable, infrequent or non-existant.\nWe didn't expect to win yesterday's debate, but national transport policies need our common-sense approach, to do what's right both for the national economy and for those who would love to use good public transport alternatives if only they existed.\nIt is stick every time and no carrot, and now they have jettisoned the Green extremists it's time the SNP stop viewing car drivers as the bogeyman.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_pubs-find-rising-costs-are-hard-swallow/content_24.html": "Last week’s glorious weather brought out the crowds to our parks, and the tables and chairs which have sprung up outside pubs were put to good use as people enjoyed a chat over a drink as they basked in the sunshine. Roll on summer.\nHopefully it gave bars much needed revenue because like so many sectors, they are feeling another kind of heat, from rising costs which were challenging before but are now a becoming a crisis thanks to decisions taken by the UK Labour Government.\nThe double whammy of Chancellor Rachel Reeves’ rise in employers’ National Insurance and the minimum wage has put many pubs on the brink of closure, and according to the Scottish Beer & Pub Association (SBPA) the price of a pint will need to increase by at least 21p to maintain margins. And if they don’t, they will actually lose nine pence for every pint they sell.\nEven the big chains will find that hard to swallow, as it were, but for the remaining small independents it’s crippling. And the sector is braced for the Scottish Government clamp down on alcohol adverting.\nThere are things the SNP can do, like leave pubs out of legislation designed to reduce excessive alcohol consumption, because they are not the problem. They can also ease the burden of business rates so Scottish businesses are not at permanent disadvantage compared with the rest of the UK. Habits are changing, and so too should attitudes towards businesses at the heart of so many communities.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_no-place-kneecaps-bile/content_5.html": "I’m first to accept I’m not exactly in the target market for hip-hop, but despite their half-hearted apology, I definitely felt a target for the Belfast rap trio Kneecap who called for people like me to be killed.\n“The only good Tory is a dead Tory. Kill your local MP,” one of them told a hooting audience two years ago, this from a group feted at a major US film festival and who got a soft ride from Patrick Keilty on mainstream TV in the Irish Republic.\nThis is no garage band, but even so-called political satirists need to accept there are lines which shouldn’t be crossed. They might have started by considering why they would name themselves after punishment shootings which left innocent young people crippled, but that’s probably too much to ask from a band happy to associate themselves with Gaza terrorists responsible for mass rape.\nBut it’s very hard to understand why DF Concerts, the organisers of Glasgow’s Transmt festival, would ask such a deliberately provocative act to perform on the weekend of July 12, always a sensitive time in a city where sectarian division is not difficult to find.\n“Our values are grounded in the belief that events can be a force for good,” says their website. “We believe in creating events that are accessible and welcoming to everyone as we recognise we’re not all the same and everyone is individual.”\nIf that includes Conservative politicians, then apology or no apology, Kneecap should be given the day off to take their bile elsewhere.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_sue-webber-msp-calls-rape-crisis-scotland-chief-go/content_41.html": "There can be no doubt that without the Gender Recognition Reform (GRR) Bill’s aggressive promotion by Nicola Sturgeon – remember she claimed GRR critics were using the issue to “cloak” their transphobia, misogyny and racism – it would not have become a witch-hunt and one of the darkest episodes in 25 years of devolution.\nIt allowed people like Mridul Wadhwa, now thankfully the ex-CEO of the Edinburgh Rape Crisis Centre (ERCC), to claim rape victims who did not want to be counselled by a biological man were prejudiced, and to preside over the persecution of a worker for simply asking about a counsellor’s gender on a victim’s behalf.\nIt led the Rape Crisis Scotland CEO Sandy Brindley, who allowed Wadhwa – a man without a gender recognition certificate – to run the Edinburgh centre and to defend him as “one of the most passionate and compassionate woman (sic) I have had the privilege of working with,” as the worker’s victimisation came to light.\nMs Brindley is ultimately accountable for what happened at the ERCC, which a scathing independent report found “did not put survivors first” and last Tuesday in Holyrood I called for her resignation because to her shame she had not already done the decent thing.\nIt is Ms Brindley’s apparent response which has made her position even more untenable. According to the Sunday Mail Ms Brindley offered the telephone numbers of victims who would speak positively for her, and in the next two hours unsolicited emails from six victims arrived, all saying they were aware of calls for her resignation.\nThe SNP’s buck-passing on this scandal is completely unacceptable. It is them who have fostered a culture in Scottish Government-funded organisations that puts militant gender ideology before the safety of women and girls.\nThis inquiry must see a change of culture from the top down – and heads must roll. The SNP must commit to a complete reset of their priorities to ensure a similar scandal never occurs again, instead of pretending this is solely a matter for Rape Crisis Scotland.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_sue-webber-msp-urges-fellow-msps-back-scottish-conservatives-common-sense-proposals-ahead/content_16.html": "Scottish Conservative and Unionist MSP Sue Webber for the Lothian Region, has urged fellow MSPs to back “common sense” proposals that her party have put forward ahead of the Scottish Budget next month.\nLeader Russell Findlay has written to SNP first minister John Swinney setting out plans to reduce income tax, business rates and LBTT.\nSue Webber MSP says that this alternative approach would “start to undo the damage of SNP tax rises” which means anyone earning over £28,000 in the Lothian Region is paying more in income tax than someone in the rest of the United Kingdom.\nThe Scottish Conservative tax plan means that the current 19p tax rate would now apply to those earning up to £43,662 meaning everyone earning less than £45,000 will pay less than if they lived in the rest of the UK.\nSue Webber MSP is also backing plans to give 100 per cent rates relief for pubs and restaurants in the Lothian Region for the next year, while also delivering 40 per cent rates relief for retail, hospitality and leisure businesses in the Lothian Region.\nSue Webber MSP also supports the proposals to reduce LBTT to zero per cent on all residential properties worth up to £250,000 saving house buyers in the Lothian Region up to £800.\nSue Webber MSP has urged MSPs from other parties to back the “bold and ambitious common sense plan” to give families and businesses in the Lothian Region more freedom over the money they work so hard to earn.\nScottish Conservative and Unionist MSP Sue Webber said: “This common sense plan will mean a cut in tax for workers, businesses and would-be homeowners across the Lothian Region.\n“It would start to undo the damage of the SNP’s tax rises by cutting income tax, business rates and LBTT.\n“This is an alternative approach to the cosy left-wing consensus in Holyrood which always believes in taking more of taxpayers’ money, while giving people and businesses in the Lothian Region little in return.\n“Hard-pressed taxpayers, businesses and those who aspire to own their own home, deserve to be supported.\n“Other local MSPs should show they are on the side of aspirational workers by backing these bold and ambitious common sense plans which will give people and businesses in the Lothian Region more freedom over the money they earn.”",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_we-need-prioritise-housing-spending/content_22.html": "The report to last Friday’s special meeting of Edinburgh’s housing committee contained some grim statistics.\nAt the end of March, 5426 households were in temporary accommodation, including 3155 children under 16. Of those, 970 households were in accommodation legally deemed unsuitable, including 42 children. Over the past year, Edinburgh Council has failed to accommodate people on 3263 occasions, a 115 per cent rise on 2023-24.\nWhile partly a product of a successful city continuing to attract people from elsewhere, it’s not just council failure but the product of drastic under-funding by the SNP Scottish Government for many years and their policies driving away investors and landlords.\nThe council response is a freeze on housing allocations until the summer, possibly longer, with only those with the top “gold” priority rating, like a medical need or awaiting hospital discharge, considered for a new council home. All others looking for a flit to be nearer relatives or whatever will need to wait or look for a private rent.\nThere are no easy solutions, but more in hope than expectation I raised the issue at the Scottish Parliament yesterday to try to jolt the SNP into action.\nDespite an acute shortage of affordable housing, Edinburgh doesn’t get its fair share of government resources; it should receive £260 million for acquisitions, not the current £40 million.\nI don’t want a return to when the council was the dominant landlord, but if money is available, it should go where the need is greatest. I’m not holding my breath.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_privacy/content_11.html": "This document outlines how Sue Webber processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Sue Webber\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Sue Webber.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Sue Webber, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Sue Webber via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_suewebber_uk_/https_www_suewebber_uk_campaigns/content_25.html": "Opposing the parking ban in the Bangholms As a result of the pavement parking ban Edinburgh Council is going to ban all parking in the Bangholms with the introduction of double yellow lines. The...\nRestore Currie’s and Balerno’s Green Spaces Many residents have approached Sue Webber MSP with their concerns about the continued and deliberate lack of maintenance of the green spaces within Currie and...\nSAY NO to 50mph national speed limits For nearly two decades the SNP have failed to deliver the vital improvements Scotland’s roads need. Roads like the A9, A96, A1, A75, A77 and A83 have become...\nWinter Fuel Payment Labour has announced cuts to the winter fuel payments for elderly people across the UK and the SNP are doing their dirty work in Scotland by also limiting this...\nStop Labour's Family Farm Tax Labour have broken their promise to British farmers with the Family Farm Tax . Labour’s Family Farm Tax will stop farms being passed to the next generation...\nImprove Baberton's Green Spaces Many residents have been approaching Sue Webber MSP with their concerns about the continued and deliberate lack of maintenance of the green spaces within...\nWinchburgh Train Station Sue has launched her campaign for a new train station at Winchburgh. A new Winchburgh station is a vital missing link which will give Winchburgh people direct...",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_alfie-and-sue-webber-msp-compete-prestigious-holyrood-dog-year-title/content_19.html": "On Monday 29th April, Sue Webber, MSP for Lothian Region, and her dog Alfie will compete with other politicians and their canine companions to win the coveted title of ‘Holyrood Dog of the Year’ 2024.\nDogs of all shapes and sizes, regardless of breed, creed or ‘pawlitical’ persuasion, will be strutting their stuff with their MSP owners, as they head to the Scottish Parliament Gardens, Edinburgh, to see who will be crowned top dog.\nOrganised jointly by Dogs Trust and The Kennel Club, the competition offers the chance for Sue Webber MSP to show off her four-legged friend and celebrates the unique bond between dogs and their owners. The event also encourages open dialogue on dog welfare issues in addition to providing an opportunity for MSPs to meet with experts to discuss all aspects of the canine world.\nSue Webber MSP said:\n“I am excited about taking part in the competition for the third year now. Alfie has grown up a lot since his first appearance and I am hoping that this time round we will be a winning team. Owning a dog is a real privilege and Alfie brings so much joy to our homelife. We love getting outdoors for long walks in the Pentlands, although Alfie isn’t a fan of the rain.\n\"The event is important as it also provides an opportunity to discuss responsible dog ownership and raise important issues relating to dog welfare. Please cast your vote for Alfie, he is part of my pawlitical life every day of the year!”\nMSPs are also calling on their supporters to vote for them online, in a bid to win the ‘pawblic’ vote, with additional judging on the day which will review the contestants on their good dog deeds and winning personalities. This will then determine which political pooch will take home the ultimate parliamentary privilege of the ‘Holyrood Dog of the Year 2024’ title.\nTo vote for Sue Webber MSP with Alfie, and to find out details of all the MSPs and dogs entered for Holyrood Dog of the Year visit thekennelclub.org.uk/hdoty\nDogs Trust has two Rehoming Centres in Scotland - Glasgow and West Calder. To see all the dogs patiently waiting on new homes click here: https://www.dogstrust.org.uk/rehoming/",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_ferry-fares-rising-10/content_15.html": "The SNP Scottish Government has confirmed that it will be increasing ferry fares by 10% from 1st January 2025 for the Northern Isles network, and then for the Clyde and Hebrides network from 28th March 2025.\nCommenting as Scottish Conservative shadow transport secretary, Sue Webber MSP said, “Scotland’s island communities will be astonished and rightly furious to hear about this huge rise in ferry fares.\n“Those reliant on CalMac for lifeline ferries have endured a sub-standard service for years due to the SNP’s incompetent procurement of new vessels. So the announcement of a 10% hike in ticket prices will feel like another slap in the face to them.\n“The SNP transport secretary says these rises are necessary – but they wouldn’t have been had the SNP Scottish Government not wasted hundreds of millions of pounds on two new vessels which shamefully have still to carry a single passenger several years after they were due to come into service.”\nCoincidentally, today marks 10 years since the SNP Scottish Government began the procurement process for the two new ferries. This anniversary comes after yet another delay in completion was announced last week. The increase in fares and continued delays provide nothing but more of the poor-quality service thanks to the SNP’s mishandling, and Scotland deserves better.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_category_Holyrood-News/content_10.html": "Sue supports Marie Curie 25th March 2025 Sue Webber MSP lent her support to Marie Curie’s largest fundraising appeal month, the iconic Great Daffodil Appeal. Every five minutes, someone dies without... Holyrood News\nSue Webber MSP urges fellow MSPs to back Scottish Conservatives “common sense” proposals ahead of the Scottish Budget 21st November 2024 Scottish Conservative and Unionist MSP Sue Webber for the Lothian Region, has urged fellow MSPs to back “common sense” proposals that her party have put forward... Holyrood News\nFerry Fares Rising by 10% 15th October 2024 The SNP Scottish Government has confirmed that it will be increasing ferry fares by 10% from 1st January 2025 for the Northern Isles network, and then for the... Holyrood News\nDebate on free bus travel for asylum seekers proves parliament has ‘lost the plot’ 10th October 2024 Yesterday, 9th October 2024, Sue Webber and the Scottish Conservatives said the Scottish Parliament has “lost the plot” after the Greens brought forward a... Holyrood News\nSue Webber MSP calls for Rape Crisis Scotland chief to go 18th September 2024 There can be no doubt that without the Gender Recognition Reform (GRR) Bill’s aggressive promotion by Nicola Sturgeon – remember she claimed GRR critics were... Holyrood News\nAlfie and Sue Webber MSP come second in the Holyrood Dog of the Year competition 29th April 2024 On Monday 29th April, Sue Webber, MSP for Lothian Region, and her dog Alfie competed with other politicians and their canine companions to come second in the... Holyrood News\nAlfie and Sue Webber MSP compete for prestigious Holyrood Dog of the Year Title 16th April 2024 On Monday 29th April, Sue Webber, MSP for Lothian Region, and her dog Alfie will compete with other politicians and their canine companions to win the coveted... Holyrood News\nSue Webber MSP raises ‘grave concerns’ over NHS Lothian financial challenges 27th March 2024 Scottish Conservative and Unionist MSP for the Lothian region Sue Webber has highlighted the ‘deeply disappointing’ lack of funding provided to NHS Lothian for... Holyrood News\nSNP reaction to £8.6m Festivals boost “miserable and grudging” 15th March 2023 The Scottish Government’s reaction to an £8.6 million funding boost for the Edinburgh Festivals from UK Chancellor Jeremy Hunt is “typically miserable and... Holyrood News",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_category_Local-News/content_27.html": "Sue Webber MSP demands “crackdown” on antisocial behaviour on buses 1st May 2025 Today at First Minister’s Questions, local MSP for Edinburgh and the Lothian region, Sue Webber demanded a “crackdown” on antisocial behaviour onboard Lothian... Local News\nSue Webber MSP slams SNP’s “sustained neglect” of policing in Edinburgh 30th April 2025 Scottish Conservative and Unionist MSP for the Lothian Region Sue Webber has slammed the SNP’s “sustained neglect” of policing in Edinburgh. Sue Webber MSP’s... Local News\nOpposing the parking ban in the Bangholms 11th March 2025 As a result of the pavement parking ban, the Transport Committee at Edinburgh Council is going to ban all parking in Bangholm Park, Road, Avenue, Place and... Local News\nDelayed discharge waits are “source of shame” for SNP ministers 27th January 2025 Scottish Conservative and Unionist MSP for the Lothian Region, Sue Webber, says the length of time patients are waiting to be discharged in NHS Lothian should... Local News\nLess than half of emergency patients at Edinburgh’s Royal Infirmary seen on time 15th January 2025 Lothian Scottish Conservative and Unionist MSP Sue Webber has accused the SNP of presiding over “terrifying” A&E waiting times as over half of patients admitted... Local News\nSue Webber MSP urges the SNP to deliver 100% rates relief for local pubs and restaurants 3rd December 2024 Scottish Conservative and Unionist MSP for the Lothian Region Sue Webber has urged the SNP government to deliver 100 per cent relief for local pubs and... Local News\nA&E services in NHS Lothian are facing a “terrifying” winter 8th October 2024 Scottish Conservative and Unionist Sue Webber MSP for Lothian Region says A&E services in NHS Lothian are facing a “terrifying” winter. Sue Webber MSP’s call... Local News\nEdinburgh gas explosion: Six months on, Baberton Mains Avenue families 'still living in limbo' 23rd May 2024 Families still seriously affected by the Baberton Mains gas explosion tragedy are living in limbo and being let down by inaction from then City of Edinburgh... Local News\nSue Webber MSP and Councillor Jason Rust welcome lottery funding for Oxgangs Neighbourhood Centre 27th March 2024 Oxgangs Neighbourhood Centre, which has been at the heart of the community since it was founded in 1995, was delighted to be awarded £150,000 by The National... Local News",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_anti-social-e-scooter-riders/content_40.html": "If you have walked the streets of Edinburgh recently, you have probably seen the gangs of balaclava clad masked delinquents on monster e-bikes terrorising innocent bystanders and wreaking havoc as they speed around the Capital.\nI’ve experienced this first-hand, being buzzed by these riders while walking my dog Alfie along the Water of Leith.\nIt’s frankly unacceptable that these maniacs are able to fly about on electric scooters and souped up e-bikes that can often reach a terrifying 50 mph.\nMy heart lurches into my mouth when I see these silent killers speeding around the city. They are without question a serious risk to public safety, never mind their own.\nWe have seen the tragic case of Linda Davis, a 71 year old woman from Nottinghamshire after a teenager careered into her while riding his e-scooter on a pavement.\nUnless we take serious action to crack down on these riders, how long will it be before the first pedestrian loses their life in Edinburgh or indeed even one of the riders?\nThere is no point having rules and regulations if they’re not going to be enforced. SNP ministers need to ensure that these reckless riders are severely punished if they are caught breaking the law. The bikes and e-scooters should be seized and confiscated by the police.\nUnless action is taken soon, we risk watching our capital slowly turn into London, where crime has spiralled out of control and thugs on e-bikes brazenly swipe phones and attack innocent bystanders.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_contact/content_7.html": "Skip to main content\nMain navigation\nHome\nAbout Sue\nNews\nAdvice surgeries\nCampaigns\nCurrent Issues\nContact\nContact\nLeave this field blank\nScottish Parliament Office\n0131 348 5948\n[email protected]\nConstituency Office\n546D Lanark Road\n0131 202 3005\n[email protected]\nSue on Facebook\nSue on Twitter\nSue on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_suewebber_uk_/https_www_suewebber_uk_accessibility/content_4.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_council-still-hell-bent-tram-extension/content_26.html": "Despite the squeeze on public spending, Edinburgh City Council is apparently still hell-bent on extending the tram network for a sum which you can guarantee will start with “eye-watering”.\nFigures like £2 billion are bandied around like it’s Monopoly money, and from what I can see its supporters are full of confidence because the completion of the three-mile stretch from York Place to Newhaven “only” cost £207 million. And that didn’t include the rolling stock or hardware because that had already been bought. Nor did it take into account the years of disruption which forced Leith Walk traders to the wall before the first attempt was abandoned because the money ran out.\nHowever, I understand there is diminishing enthusiasm amongst councillors for digging up the Roseburn Path to Ferry Road, which means the dream of a tram to the new district springing up in Granton will probably remain just that because of the complexity – and cost – of strengthening the nearly 200 year-old Dean Bridge. And I’ll bet it would take more than the two years it took the Georgians to build it.\nA consultation on the plan to run a line from Granton to the Bioquarter, and further, will start in mid-August, and guess what, even that is behind schedule because it was supposed to start about now. It appears it was only belatedly realised that a 12-week consultation running from spring would run into the holiday season, so it was put back. Not that public opinion makes much difference.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_debate-free-bus-travel-asylum-seekers-proves-parliament-has-lost-plot/content_39.html": "Yesterday, 9th October 2024, Sue Webber and the Scottish Conservatives said the Scottish Parliament has “lost the plot” after the Greens brought forward a debate on providing free bus travel to asylum seekers.\nAs the new Scottish Conservative shadow transport secretary, Sue warned that going ahead with the proposal at a time when the SNP and Labour governments are removing universal winter fuel payments for pensioners would show “that this parliament doesn’t stand up for them”.\nSue described it as “scandalous” that MSPs from a range of parties supported a £2million transport subsidy at the same time as support for heating bills was being cut from almost a million elderly Scots.\nSue Webber added that the Scottish Conservatives opposed the plans because they believe every penny of taxpayers’ money should be spent on the “real concerns of the people”.\nSue Webber MSP said, “We all want to do right by asylum seekers and help people in need – but it’s on every politician in this building to spend public money on the biggest challenges facing our country.\n“The proposal is to spend millions of pounds giving asylum seekers free travel at the very same time the SNP and Labour are taking away the winter fuel payment from pensioners.\n“People who have worked hard all their days are getting their winter fuel payment cut, forcing some to choose between heating and eating this winter.\n“It’s scandalous and, to people across Scotland, it looks like the Scottish Parliament has lost the plot.\n“No wonder so many people feel that this parliament doesn’t stand up for them or represent their interests.\n“The Scottish Conservatives will oppose these plans because we believe every penny of taxpayers’ money must be spent carefully to address the real concerns and needs of people – especially at a time when the SNP Government are imposing swingeing cuts across the board.”\nTelegraph: www.telegraph.co.uk/politics/2024/10/09/snp-lost-plot-free-asylum-seeke…\nBBC: www.bbc.co.uk/news/articles/c79nj1yxrq4o\nScottish Daily Express: www.scottishdailyexpress.co.uk/news/politics/scottish-greens-lost-plot-…\nGlasgow Times: www.glasgowtimes.co.uk/news/24642003.msps-clash-debate-free-buses-asylu…",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_category_Westminster-News/content_21.html": "Sue Webber MSP selected to contest Edinburgh South West 29th February 2024 The General Election in Scotland should be about SNP failure and the continued threat of nationalism, according to the new Scottish Conservative candidate for... Westminster News",
  "https_www_suewebber_uk_/https_www_suewebber_uk_campaigns_winter-fuel-payment/content_34.html": "Labour has announced cuts to the winter fuel payments for elderly people across the UK and the SNP are doing their dirty work in Scotland by also limiting this payment.\nThis will have a devastating impact on over 68,000 pensioners locally.\nI'll continue to stand up for residents who need this vital payment.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_corner-stores-are-counting-cost-epidemic-criminality/content_38.html": "Just where would we be without convenience stores? Most people have their favourite corner shop to pick up a pint of milk, a loaf or something quick for tea on the way home. The clue is in the name.\nBut the life of the nation’s shopkeepers is not an easy one, and a recent conversation I had with one trader in Clermiston was shocking, but sadly not untypical. Shoplifting is now completely out of hand, and on top of that is regular racial abuse. This is a man is just trying to earn a reasonable living while providing a valuable service for his community. Remedies are available and the Co-op is spending millions on anti-theft measures like till barriers to stop the theft of vapes, and although barriers do not just stop stealing but social interaction between shopkeepers and their loyal customers, it’s better that than their profit literally disappearing out the door.\nBut such measures cost money and independent traders can’t necessarily afford the outlay needed. And, of course, the under-pressure police are usually so busy that they can’t get round to a shop in time to catch the thieves. The recently published Scottish Grocers’ Federation’s (SGF) crime report for the past year makes for grim reading, documenting both the impact of rising crime on both viability and the wellbeing of staff and their families, as well as their communities. Over 700 convenience stores took part in the SGF’s annual crime survey, and it reveals that the average annual cost of theft and vandalism is now just short of £20,000, which if applied to all Scotland’s 5220 convenience stores makes a total annual cost of approximately £102.7 million. The British Retail Consortium reckons the total cost of all shop crime across the UK, including investments in prevention, is a staggering £4.2 billion, approximately £400m in Scotland.\nScottish traders universally report that shoplifting is now a daily occurrence and is growing, with nine out of ten experiencing violence against staff at least once a month, and only slightly fewer are the targets of hate crime. As a result, two thirds of businesses report that at least one staff member has suffered mental health and wellbeing issues. Horrifically, four out of five report that incidents involving a weapon, such as a knife, club or even a firearm happens at least once a month.\nPolice Scotland statistics show there have been 15,975 reports of abuse and assaults from August 2021, when the Protection of Workers Act came into force, to the end of last year, and as police will not be notified of every incident the real figure is likely to be higher. Imagine going to your work knowing there was a 30-1 chance of you being attacked or abused, and a high chance it will involve a weapon. You’d either want something done about it, or you would refuse to go back. But if you rely on the shop for your livelihood then walking away isn’t that simple. No wonder their mental health can suffer. I recently visited Fort Kinnaird where they have a very good relationship with the police, but they have the resources to fund good security, with teams that support all the stores. But that’s not a luxury afforded to convenience stores and it’s in everyone’s interest to tackle what’s becoming an epidemic of criminality.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_sue-supports-marie-curie/content_32.html": "Sue Webber MSP lent her support to Marie Curie’s largest fundraising appeal month, the iconic Great Daffodil Appeal.\nEvery five minutes, someone dies without the care they need. The Great Daffodil Appeal, now in its 39th year, encourages everyone to wear their daffodil pins and donate to the end-of-life charity through the month of March to help Marie Curie bring expert end of life care to more people.\nMeeting with staff and volunteers from Marie Curie, Sue heard about the care and support that is provided to people living with terminal illness, their families and carers across Scotland.\nThe event promoted Marie Curie's campaign to ensure that everyone no matter who they are, where they are, or their diagnosis has access to the care and support they need at the end of life.\nThe leading end of life charity supported 7,200 terminally ill people across Scotland in their own homes and at its two Scottish hospices during 2023/24.\nSue Webber MSP said: “Marie Curie is renowned and respected for the quality of care and support they provide. I am very pleased to support their Great Daffodil Appeal.”\nAnne Lane, whose sister Mags was cared for by Marie Cure, spoke at the event. She said:\n“It wasn't just Mags who benefited from the incredible work of Marie Curie.\n“As her family, we too found immeasurable comfort and guidance during what was an unimaginably difficult time.\n“The staff took the time to explain every step, every option, and did so in a way that made us feel seen and heard. They knew our names, our faces, and our worries, and in some miraculous way, made those worries just a little bit lighter.\n“Through counselling and emotional support, they helped us navigate not just Mags's final days, but also our own intricate web of emotions. They reminded us that we were not alone.”\nAmy Dalrymple, Associate Director of Policy and Public Affairs, Marie Curie, Scotland, said:\n“Thank you to Sue for her ongoing support.\n“Seeing and hearing first-hand stories of how living with a terminal illness and caring for someone is a reminder that many of us have and will encounter Marie Curie at some point in our lives.\n“We know that by 2040, a further 10,000 people will be dying with palliative care needs. We need to ensure Marie Curie can be there for everyone across Scotland who needs us, which is why buying a daffodil pin and supporting our Great Daffodil Appeal in March, can help make this possible.\nThere’s only one chance to give someone the best possible end of life.\nAnd one chance for you to help give care that makes all that possible. Care that protects someone’s dignity – instead of leaving them alone or in pain. This Great Daffodil Appeal is that chance.\nEvery five minutes, someone dies without the support they need. But by donating and wearing your daffodil this March, you can change that – and help our Marie Curie Nurses bring expert end of life care when there’s no cure, whatever the illness.\nThe Great Daffodil Appeal only happens once a year. This is your chance to make it count. For information and to donate visit: Mariecurie.org.uk/daffodil .",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_pressure-prompts-second-thoughts-assisted-dying/content_36.html": "Maybe the pandemic has changed attitudes towards death and the dying, but there is little doubt public opinion has swung behind changing the law to legalise medically assisted dying.\nThe debate has been very respectful, and in proposing his Assisted Dying for Terminally Ill Adults (Scotland) Bill, Orkney MSP Liam McArthur has always shown great sensitivity to the highly emotional arguments on both sides. Everyone has their own stories of relatives’ experiencing good or bad deaths and it’s inevitable these will frame reaction.\nHis consultation, which received just over 14,000 responses, indicated 78 per cent are in favour, compared to 2015 when a consultation the last time a change was proposed found 64 per cent opposed. As someone who has moved in the opposite direction, I am clearly in a very small minority.\nWhen faced with a loved one whose quality of life has drastically deteriorated and their imminent end is beyond doubt, it’s understandable to want a humane termination. But now I’m facing a decision which could make the conscious decision to end your life much easier, why am I having second thoughts?\nI don’t believe anyone need die in agony if the correct palliative treatment is provided, and Liam’s bill specifically requires that to be offered. But there is a danger that even just the option of a quicker exit reduces the need to ensure that proper care for the dying is always available.\nHospices are wonderful places, but the fact their services rely on charitable giving, says much about the place of care for the dying in the NHS, and I fear assisted dying actually reduces the duty the NHS owes them. After all, it’s only 11 years since the controversial Liverpool Pathway, usually involving the withdrawal of food and water from terminal patients, was outlawed.\nDespite safeguards, like the requirements of two doctors to agree the patient will not recover and is also of sound mind, I am unconvinced there is enough in the proposal to prevent someone feeling personal pressure to end their life to cease burdening their relatives or society.\nNor am I persuaded that the normalisation of suicide ─ which is the brutal truth of it ─ and the significant acceleration of the number of people taking their own lives, is without significant negative impact on those left behind, and increase the chances of dividing families along the most emotional of lines.\nThere is plenty of data from countries where assisted dying is allowed to show just how quickly the numbers rise, and research proves it makes no difference to unassisted suicide levels. In the Netherlands, there is some evidence of an increase.\nThen there is Canada, where people with depression are effectively being euthanised in their 20s and 30s. Admittedly, few of the safeguards proposed here feature in their system but, as demonstrated by Gender Recognition Reform, a very small group of people can instigate change and there is no guarantee that previously tight legislation cannot be slackened on the basis of isolated cases unrepresentative of majority experience.\nRespectful debate is already threatened, and this week I received an email asking if I just hoped I wouldn’t die in excruciating pain. The answer is I shouldn’t have to, and that’s what we’re putting at risk.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_snp-reaction-ps86m-festivals-boost-miserable-and-grudging/content_12.html": "The Scottish Government’s reaction to an £8.6 million funding boost for the Edinburgh Festivals from UK Chancellor Jeremy Hunt is “typically miserable and grudging”, according to a Lothian Scottish Conservative MSP.\nThe chancellor is set to confirm the grant in today’s (Wednesday) Spring Budget, which will help finance a permanent base for the Fringe Society, as well as help the other August events like the tattoo and film festival.\nWhile a Scottish Government spokeswoman said that any additional funding would be welcome, Scottish ministers should be consulted in advance.\nSue Webber MSP said; “It is typically miserable and grudging of the SNP Scottish Government that it can’t just wholeheartedly welcome such a fantastic boost for our festivals, but have to make it all about SNP ministers and their sensibilities.\n“Giving the money straight to the festivals without going through the SNP means it gets to them quickly so it can have an immediate effect and be prioritised by those who know where it’s needed the most.\nWhen asked about the funding, the spokeswoman told The Scotsman newspaper, “Given culture is devolved, ministers would be disappointed if the UK Government did not engage in advance to ensure all public funding – Scottish and UK – was aligned to deliver maximum support for the sector which is facing considerable financial challenges”.\nSue Webber added, “Culture is indeed devolved, but as the SNP has given Edinburgh Council the worst grant settlement in Scotland, it’s inevitable the festivals will suffer too. The SNP seems to expect the UK government will simply hand cash to them so they can decide where it goes and to claim any credit.\n“Now Nicola Sturgeon is going, let’s hope these petty gripes will be a thing of the past.”",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_feed/content_14.html": null,
  "https_www_suewebber_uk_/https_www_suewebber_uk_campaigns_say-no-50mph-national-speed-limits/content_37.html": "For nearly two decades the SNP have failed to deliver the vital improvements Scotland’s roads need.\nRoads like the A9, A96, A1, A75, A77 and A83 have become notorious for accidents, injuries and deaths.\nBut instead of finally taking action to fix Scotland’s roads and protect drivers, the SNP now want to punish them with more restrictions.\n50mph speed limits on single carriageway roads will penalise ordinary people, without cutting down on dangerous driving.If the SNP really want to improve road safety, they need to deliver the road upgrades they promised.\nThis is just the latest front in the SNP’s war on motorists.\nJoin our campaign to SAY NO to these clueless plans 👇\nhttps://www.scottishconservatives.com/news/campaign-say-no-to-50mph/",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_sue-webber-msp-selected-contest-edinburgh-south-west/content_30.html": "The General Election in Scotland should be about SNP failure and the continued threat of nationalism, according to the new Scottish Conservative candidate for Edinburgh South West, Sue Webber MSP.\nCurrently a Lothian MSP, and the Scottish Parliament’s education committee convener, Sue Webber was chosen at a selection meeting on February 23. The seat has been held by the SNP’s Joanna Cherry since 2015.\n“This election in Scotland is all about SNP failure... our hospitals face record waiting times, standards in our schools are plummeting, the police are underfunded, and our roads are an utter disgrace,” she said.\n“Joanna Cherry might be a thorn in the side of the SNP leadership, but she still represents the SNP and the Nationalists have let down the people of Edinburgh South West for nearly 20 years. They have neglected our services because of their unrelenting focus on independence and the only way to end this distraction is for voters to stop supporting their candidates.\n“Every constituency needs a strong opponent to take them on and I have a proven track record of delivering for local people and for standing up to the SNP, particularly in the battle to save Currie High School.”\nSue Webber was a City of Edinburgh councillor for five years until 2022 and was elected to the Scottish Parliament in 2021. As well as convening the Scottish Parliament’s education committee, she is the Scottish Conservative spokesperson on drugs and alcohol policy, and locally she is the vice-chair of the Juniper Green community hub.\nShe was brought up in the constituency, where she still lives, and attended Currie High School. She later studied at Edinburgh University and subsequently ran her own business supplying equipment for health care services.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_sue-webber-msp-demands-crackdown-antisocial-behaviour-buses/content_9.html": "Today at First Minister’s Questions, local MSP for Edinburgh and the Lothian region, Sue Webber demanded a “crackdown” on antisocial behaviour onboard Lothian Buses.\nThis follows remarks made earlier this week by the Managing Director of Lothian Buses, Sarah Boyd, at the Net Zero, Energy and Transport Committee, who drew a clear link between the increase in antisocial behaviour on Lothian buses and the SNP’s introduction of free bus travel for under-22s.\nSue Webber MSP called out John Swinney for his failure to tackle the anti-social behaviour “crisis” onboard buses in Edinburgh and the Lothians.\nShe stated that John Swinney is “refusing to face reality” and his “warm words” just won’t cut it when it comes to tackling this issue.\nSue Webber believes that “enough is enough” and is calling for immediate action to remove free bus passes from the disruptive minority of young people who are ruining journeys across Edinburgh and the Lothian region.\nScottish Conservative MSP for the Lothian region Sue Webber said:\n“These warm words from the First Minister just won’t cut it.”\n“The SNP’s under-22 free bus travel scheme has fuelled a surge in antisocial behaviour on Lothian buses, but John Swinney refuses to face reality.”\n“I have spoken with countless constituents who are deeply concerned at the rise in this kind of behaviour.”\n“Local residents are being actively discouraged from using public transport due to antisocial behaviour. It’s unacceptable that anyone should have to fear using a local bus because of the actions of the disruptive minority.”\n“Enough is enough. John Swinney needs to clearly set out how free passes will be removed from the minority of young people who are ruining journeys for everyone else. Taxpayers should not have to burden the costs of travel for those who abuse their privileges.”",
  "https_www_suewebber_uk_/https_www_suewebber_uk_about-sue-webber/content_6.html": "Sue Webber is a Conservative MSP for the Lothian region.\nShe ran her own business providing services and medical supplies to our NHS so saw first-hand how poorly the SNP manages the priorities of the health service in Scotland. Sue worked in the healthcare industry from 1996 up to her election as an MSP.\nSue first entered politics during the independence referendum in 2014 when she was part of the Better Together campaign. Seeing that the SNP would not let go of their separatist agenda, Sue decided to run for office herself, to represent her local area which has been poorly served by the SNP at Council and Holyrood.\nAs a councillor for the Pentland Hills, Sue was a powerful voice for local residents and was known as a councillor who got things done.\nIn Holyrood, Sue has previously been the Shadow Minister for Drugs Policy & Mental Wellbeing as well as the Convenor of the Education, Children and Young People Committee.\nSue is now the Scottish Conservatives Shadow Cabinet Secretary for Transport.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_advice-surgeries/content_2.html": "I hold advice surgeries on the first Friday of every month from 10am-1pm in my constituency office - 546D Lanark Road, Juniper Green, Edinburgh Eh14 5EL.\nPlease come along if you have any issues or problems you’d like to discuss with me.\nIf this time is not possible you can make an appointment by contacting me via any of the above details.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_category_Opinions/content_18.html": "We need to prioritise housing spending 3rd May 2025 The report to last Friday’s special meeting of Edinburgh’s housing committee contained some grim statistics. At the end of March, 5426 households were in... Opinions\nNo place for Kneecap’s bile 2nd May 2025 I’m first to accept I’m not exactly in the target market for hip-hop, but despite their half-hearted apology, I definitely felt a target for the Belfast rap... Opinions\nTime for city council to stop seeing car drivers as bogeyman 1st May 2025 Edinburgh has long been waging an ideological war on motorists, but it seems the more council leaders argue they are not persecuting drivers, the more extreme... Opinions\nAnti-social e-scooter riders 25th April 2025 If you have walked the streets of Edinburgh recently, you have probably seen the gangs of balaclava clad masked delinquents on monster e-bikes terrorising... Opinions\nSupreme Court gender ruling addresses elephant in the room 24th April 2025 Last week’s Supreme Court verdict was a watershed moment. The country’s top legal minds finally addressed the elephant in the room and made it clear that the... Opinions\nSNP ministers’ reward for failure 23rd April 2025 The Supreme Court verdict wasn’t the only big story in the news this week, the First Minister also announced that his beleaguered gang of SNP ministers would be... Opinions\nPubs find rising costs are hard to swallow 20th April 2025 Last week’s glorious weather brought out the crowds to our parks, and the tables and chairs which have sprung up outside pubs were put to good use as people... Opinions\nCouncil still hell-bent on tram extension 19th April 2025 Despite the squeeze on public spending, Edinburgh City Council is apparently still hell-bent on extending the tram network for a sum which you can guarantee... Opinions\nCorner stores are counting the cost of this epidemic of criminality 18th April 2025 Just where would we be without convenience stores? Most people have their favourite corner shop to pick up a pint of milk, a loaf or something quick for tea on... Opinions",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_snp-ministers-reward-failure/content_33.html": "The Supreme Court verdict wasn’t the only big story in the news this week, the First Minister also announced that his beleaguered gang of SNP ministers would be handed an inflation-busting pay rise.\nIt didn’t go unnoticed that this bumper pay rise, which has been described as a reward for failure, comes at a time when hard-working Scots are being clobbered by SNP and Labour taxes and below inflation pay rises of their own.\nAcross Edinburgh, people will be asking what these SNP sycophants have done to deserve this pay rise, given that the roads are still a disgrace, anti-social behaviour has skyrocketed, and teacher numbers are falling across the city and housing is in crisis.\nWhat has the Culture Secretary done to earn this boost when several city arts venues, including Summerhall, are shutting down?\nWhy is the Health Secretary getting a pay rise when our new eye hospital remains a distant promise and waiting lists are spiralling out of control?\nAnd why is the Transport Secretary in line for a hike when the city’s roads are still in ruin?\nJohn Swinney claims that his ministers are ‘entitled’ to this payrise but it works both ways. The people of Edinburgh are entitled to a good standard of public services, but the SNP continually fail to deliver it.\nThat doesn’t sound like value for money to me.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_supreme-court-gender-ruling-addresses-elephant-room/content_29.html": "Last week’s Supreme Court verdict was a watershed moment. The country’s top legal minds finally addressed the elephant in the room and made it clear that the legal definition of a woman under the Equalities Act relates to biological sex.\nThe ruling was a monumental triumph for women’s groups in Scotland, who refused to accept the erosion of their rights by the cosy left-wing consensus at Holyrood.\nThis is one of those defining moments in history when future generations will ask, \"Where were you when the ruling was announced?\" Well, I was exploring the ancient Roman city of Herculaneum.\nAs our tour guide pointed out, that there were two separate bath complexes for men and women, I was reminded that even the Ancient Romans understood the importance of single-sex spaces as far back as 79 AD.\nThe majority of Scots have always believed that women are biological human females. Yet for years, SNP ministers – and the other left-wing parties at Holyrood – have point blank refused to acknowledge what should have been blatantly obvious.\nA small but vocal minority of hardline gender extremists have been dictating SNP government policy for years. They claim that you are what you say you are. Their logic is, if you have a male body, but choose to identify as a female, that’s absolutely fine and you should be able to use the women’s toilets.\nThis understandably terrified biological women who didn’t want to share a bathroom or changing rooms with biological men, but their concerns and objections were treated with utter contempt.\nInstead of listening to their views, Nicola Sturgeon arrogantly said they were “not valid” and pushed her reckless Gender Recognition Reform bill through parliament.\nNicola Sturgeon’s dangerous bill was rightly blocked by the previous UK Conservative government, but the ideology behind it had already permeated Scotland’s public bodies and institutions.\nIt resulted in a double rapist who claimed he was a female being sent to a women’s prison. Only when there was huge public backlash did SNP ministers backtrack and move this monster to a male prison.\nBut, if you asked Nicola Sturgeon, Anas Sarwar or Alex-Cole Hamilton they would probably still refuse to call him a man, you would have thought that the famous photo of him in his iconic pink leggings would have given the game away.\nWe’ve seen a health board taken to a tribunal by a brave nurse who refused to stay silent as a male-bodied colleague used the women’s changing room and a rape crisis charity worker who faced dismissal for saying that a woman is a woman and a man is a man.\nIt is time for NHS Fife to back down before its already shattered reputation falls further into disrepute\nAfter last week’s verdict, this nonsense needs to stop right now.\nThe SNP aren’t the only party at fault. Labour, the Liberal Democrats and Greens supported the Nationalists as they tried desperately to strip women and girls of their rights.\nBut the onus is on John Swinney as First Minister of Scotland, to apologise for the upset and anxiety that his party’s obsession with gender self-ID has caused.\nHe must issue an immediate directive instructing all public bodies to uphold the court’s ruling by providing single-sex spaces for biological women.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_campaignresponses/content_20.html": "Scottish Government Winter Fuel Payment\nThe SNP Government recently announced that all pensioners in Scotland will receive a winter fuel payment in 2025/26. Under the plans, those in receipt of pension credit or other benefits will receive a £200 or £300 payment, depending on their age. All other pensioners will receive a reduced payment of £100.\nThe SNP have been trying to hoodwink people into believing they are on their side when they haven’t delivered the support they need. Despite trying to talk up this decision to pensioners, the reality is that this new payment will be a cut for many pensioners and it won’t be coming this winter.\nIt should not be forgotten that the SNP shamelessly followed the example of the UK Labour Government by cutting the winter fuel payment for thousands of pensioners this year, and this poor substitute is nothing but blatant spin that will fail to protect pensioners this year and in future winters.\nMy Scottish Conservative colleagues and I will continue to scrutinise the Scottish Government over this decision and stand up for Scottish pensioners who should not see their fuel payments cut this winter because of the SNP’s inept mismanagement of Scotland’s economy.\nProposed Speed Limit Changes\nThe SNP Government recently announced that it is consulting on proposals to lower the national speed limit on single carriageway roads from 60 mph to 50 mph, and to increase speed limits for good vehicles over 7.5 tonnes on single carriageways from 40 mph to 50 mph, and on dual carriageways from 50 mph to 60 mph.\nWhile I welcome the proposed plan to change the speed limits for Heavy Goods Vehicles (HGV), if the SNP had kept their promises to upgrade and dual key roads, they wouldn't need to consider more limitations on drivers. The online consultation also does not separate the proposals for ordinary motorists and HGV drivers, and this will impact the results and could cause the conclusion to favour an all or nothing outcome.\nThe SNP are only trying to slow down drivers because they've been so slow to deliver vital infrastructure projects across Scotland. More restrictions are not what most people want to see and is another example of how detached the Scottish Parliament has become. If the SNP Government are genuinely interested in saving lives, they should be investing to improve roads up and down the country from the A9 to the A75, instead of imposing more curbs on motorists.\nReduction in the Active Travel Budget\nThe recent Scottish Budget for 2025-26 has cut the active and sustainable travel budget from £185.4 million to £164.8 million.\nThe Scottish Conservatives are concerned by this cut to the active and sustainable travel budget. Active travel is an essential part of Scotland’s transport landscape, but the SNP Government’s approach to active travel has been inconsistent.\nWhile I recognise that cycling is an important part of Scotland’s transport landscape, pedestrians should be at the centre of Scotland’s approach to active travel and money should be diverted towards pedestrians and used for projects such as better pavements and more pedestrian crossings instead of, as is the case in some parts of Scotland, building cycle lanes leading to nowhere.\nI would urge SNP Ministers to show some common sense, reconsider this cut, and ensure that pedestrians and all road users are put at the centre of active travel in Scotland.\nThe Scottish Budget and the Two-Child Cap\nI believe that supporting families and helping parents into work requires a balanced system that provides support for those who need it, but that also ensures a sense of fairness to the taxpayer and many working families who do not see their incomes rise when they have more children. Moreover, recent statistics show that 78 per cent of families on Universal Credit had fewer than three children.\nThe SNP Government announced in its recent budget that it planned to mitigate the two-child cap, despite it being a reserved matter. It is not yet clear how this mechanism will work or how much it will cost. Furthermore, the Scottish Fiscal Commission was only sent the SNP’s plans just before the budget was announced and have warned that it is a ‘fiscal risk’ considering they did not have it cost it.\nThe Scottish Conservatives believe the two-child cap is necessary and the right approach at this time. The rapidly rising benefits bill is currently unsustainable as a direct consequence of the SNP’s high tax rates and mismanagement of our economy and public finances.\nVAT on private school fees\nI share your concerns about the new Labour Government’s insistence on applying VAT to private schools. I wrote about my concerns in my weekly columns in the Edinburgh Evening News in the run up to the election. You can read them here:\nAll very much to play for in Scotland - Sue Webber (scotsman.com)\nSchool places will come under further pressure if Labour win - Sue Webber (scotsman.com)\nI am disappointed that the new government have rushed into announcing their plans without taking into account the obvious and expert advice available, and that the council are not fully prepared for the consequences.\nI will continue to raise this issue at every opportunity available to me.\nBuffer zones around abortion clinics\nGillian Mackay’s private members Bill to introduce anti-protest or buffer zones around abortion clinics passed Stage 1 on 30th April 2024. I supported this Bill at this early stage\nAbortion clinics are an essential legal medical service. No women should feel that they are being stigmatised against and discouraged from accessing abortion services.\nAs such, I will engage constructively with the Bill as it progresses through Parliament to enhance protections for women who are accessing these services. I am acutely aware how this will cause conflict with the right to protest and this fine balance must be carefully considered as the Bill progresses through parliament.\nWhile I acknowledge that there is a right to protest, this must not come at the expense of women’s health and their right to access medical services free of prejudice.\nHate Crime and Public Order (Scotland) Act\nThank you for contacting me regarding the Hate Crime and Public Order (Scotland) Act 2021, which came into force on 1 April this year. Bigotry, racism and prejudice are unacceptable in a civilised society and hate crime is already unlawful. However, the SNP government's new legislation risks the right to freedom of expression and will potentially criminalise people for what they say in the privacy of their own homes. Most respondents to the Scottish Parliament justice committee’s public consultation on the legislation raised concerns.\nThe Scottish Police Federation stated the bill could ‘devastate’ the relationship between the police and the public. Furthermore, the Association of Scottish Police Superintendents believe that activists will abuse the hate crime laws and divert officers from serious crimes. The Scottish Newspaper Society have also said it ‘poses a serious threat to freedom of expression’ and the Faculty of Advocates said there was ‘no alternative but to reconsider the draft bill’.\nScottish Conservative amendments which would have protected free speech were voted down by the SNP and all other parties. As a result, we voted against the legislation as it threatens freed speech and fails to protect the right to privacy. For three years, the legislation was not enacted due to concerns about its impact on people and how it would be enforced. It still remains unclear how it will be policed and prosecuted with various groups warning about the impact on freedom of speech. SNP politicians continue to ignore widespread and credible concerns of academics, lawyers, journalists, entertainers and faith groups.\nThe Scottish Conservatives would repeal the SNP’s Hate Crime Act and replace it with a Protection of Free Speech Bill. We have an ongoing campaign which you can support on this issue: Scrap the SNP Hate Crime Act.\nAssisted Dying for Terminally Ill Adults (Scotland) Bill\nLiam McArthur’s Private Members Bill on Assisted Dying was published/introduced to parliament on 28th March 2024. A link can be found here: Introduced | Scottish Parliament Website.\nThe decision my party, the Scottish Conservatives, has taken on this bill is to allow a free vote when this is voted upon in the chamber for the Stage 1 debate. However, there is not yet an agreed timeline for when this legislation will be brought in front of parliament. I have thought long and hard about this and have decided that I am unable to support this private members bill. I met Liam McArthur MSP to discuss my concerns and he is aware of them. If you want to learn more about my position on this bill then please read this article which is published on my website: Pressure prompts second thoughts on assisted dying | Sue Webber\nI have been heartened that my colleague Miles Briggs MSP is seeking to introduce another private members bill that seeks to make legal the Right to Palliative Care. Right now, 1 in 4 people are not getting access to palliative care in Scotland, and this bill would give people of all ages living with terminal illness and residing in Scotland a legal right to palliative care. The consultation on this Bill has opened and I will be supporting this Bill as it hopefully proceeds through parliament. If you wish to contribute to the consultation a link can be found here: Miles Briggs - Right to Palliative Care (Scotland) Bill Consultation Document (parliament.scot)\nShort-term lets\nThe recent ruling by the Court of Session stated that the City of Edinburgh Council’s short-term lets licencing policy was unlawful.\nI am growing increasingly concerned by the sheer complexity of the system, and the challenges being placed on small businesses across the area. Livelihoods are at risk.\nThis legal decision is another example of the Council failing to do their due diligence and a scheme which has faced problems from the outset.\nOn 1 October 2022, the law around short-term lets changed and now requires hosts to apply for a short-term let licence before they can accept bookings or receive guests. Although, the application deadline for existing operators has now been extended to October 2023.\nWhen the final version of the licensing scheme was brought to Parliament only the Scottish Conservatives expressed concerns, and it is regrettable that this legislation was approved.\nI support the right of homeowners and tenants to enjoy the use of their property, but I know that the SNP-Green Government’s policy will impact on self-catering businesses, as well as Airbnb and similar short-term let providers.\nTourism businesses across Scotland have been devastated by the pandemic and the last thing they need is to be burdened by more red tape. The Scottish Conservatives warned SNP-Green Ministers that the scheme was unworkable, but they failed to listen.\nIt is now time that SNP-Green Ministers suspended the short term lets legislation and consult again on a workable solution which would deliver the health and safety outcomes we all want to see.\nGoing forward, please be assured the Scottish Conservatives will continue to challenge the SNP-Green Government on this issue with the aim of ensuring that any changes to the law in this area are both necessary and proportionate.\nTeacher Strikes\nI recognise the huge importance of the work teachers do. The education of future generations is vital to the success of this country. I know the last thing teachers want is to be on strike over pay and as a result unable to educate our children and young people.\nAs you will be well aware, the Educational Institute of Scotland (EIS) teaching union is currently in the midst of strike action until at least the 21st April.\nOn the 15th of February the EIS unanimously rejected the SNP latest pay offer branding it ‘inadequate’ and unacceptable’.\nThe lack of urgency on the part of the SNP Education Secretary to resolve this dispute is stark and the continuing disruption is a damning legacy of a party who claim education is their top priority.\nAlready, Scottish pupils and parents have had to deal with rescheduled preliminary exams and now face additional disruption because of the SNP’s failure to reach a deal with the teachers’ union. Over the last 16 years the SNP have run down Scotland’s education system and it is clear that teachers now have had enough.\nI do not want to see the education of children and young people further disrupted and I urge the SNP Government to recognise the hard work teachers put in, fully engage in negotiations and propose a fair pay offer to teachers so these strikes can end and get teachers back to teaching.\nGender recognition reform Bill\nThe Scottish Conservatives recognise that improvements to the system of gender recognition would be beneficial for trans people. Now that the SNP Government have published their Bill we will constructively scrutinise proposals that may help to make the system and process easier.\nHowever, as drafted, the proposals do not protect women’s rights and they do not offer enough protection for women’s safety. Women have raised legitimate and reasonable concerns about sections of this bill and it is essential that the SNP Government both listens to and addresses those concerns.\nImproving the process for transgender people must not come at the expense of women’s rights and safety.\nThank you once again for taking the time to contact me on this issue.\nPolitical bias in the classroom\nThe Scottish Conservatives fully support unbiased political education in our schools. Our pupils are the future of our country, so it is critical that they gain a solid understanding of a wide range of political beliefs and current issues.\nTeachers have an obligation to be objective and professional when distributing information, with the purpose of stimulating discussion and independent thought. Pupils must be exposed to all sides of an argument in order to have a well-formed opinion and to further develop their own ideas, but at no time should that cross over into the expression of politically partisan opinions where they are held by any individual teacher.\nUnfortunately, pro-SNP material seeping into our classrooms is not a new trend. Recently, an S1 Modern Studies class was given a 34-page booklet and urged to come to their own conclusions about issues including independence. This contained 16 pictures of the First Minister and other SNP politicians and shows two completed ballot papers with the boxes ticked for pro-independence parties. There was only one picture of a Labour MSP and logo, and no mention of the Scottish Conservatives. On another occasion, an S3 Modern Studies class, were asked to compile a list of Nicola Sturgeon’s ‘important policies.’ Pupils were given ‘useful’ links, one of which goes to the SNP’s website. After listing the achievements, it concludes: ‘If you haven’t yet, join the SNP today to help secure independence…’ However, the SNP Government seem unconcerned about addressing the problem.\nParents should have the opportunity to raise with the headteacher any concerns they have over perceived bias.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news/content_13.html": "We need to prioritise housing spending Saturday, 3 May, 2025 The report to last Friday’s special meeting of Edinburgh’s housing committee contained some grim statistics. At the end of March, 5426 households were in temporary accommodation, including 3155 children under 16. Of those, 970 households were in accommodation legally deemed unsuitable, including 42 children. Over the past year, Edinburgh Council has failed to accommodate people on 3263 occasions... Opinions\nNo place for Kneecap’s bile 2nd May 2025 I’m first to accept I’m not exactly in the target market for hip-hop, but despite their half-hearted apology, I definitely felt a target for the Belfast rap... Opinions\nSue Webber MSP demands “crackdown” on antisocial behaviour on buses 1st May 2025 Today at First Minister’s Questions, local MSP for Edinburgh and the Lothian region, Sue Webber demanded a “crackdown” on antisocial behaviour onboard Lothian... Local News\nTime for city council to stop seeing car drivers as bogeyman 1st May 2025 Edinburgh has long been waging an ideological war on motorists, but it seems the more council leaders argue they are not persecuting drivers, the more extreme... Opinions\nSue Webber MSP slams SNP’s “sustained neglect” of policing in Edinburgh 30th April 2025 Scottish Conservative and Unionist MSP for the Lothian Region Sue Webber has slammed the SNP’s “sustained neglect” of policing in Edinburgh. Sue Webber MSP’s... Local News\nAnti-social e-scooter riders 25th April 2025 If you have walked the streets of Edinburgh recently, you have probably seen the gangs of balaclava clad masked delinquents on monster e-bikes terrorising... Opinions\nSupreme Court gender ruling addresses elephant in the room 24th April 2025 Last week’s Supreme Court verdict was a watershed moment. The country’s top legal minds finally addressed the elephant in the room and made it clear that the... Opinions\nSNP ministers’ reward for failure 23rd April 2025 The Supreme Court verdict wasn’t the only big story in the news this week, the First Minister also announced that his beleaguered gang of SNP ministers would be... Opinions\nPubs find rising costs are hard to swallow 20th April 2025 Last week’s glorious weather brought out the crowds to our parks, and the tables and chairs which have sprung up outside pubs were put to good use as people... Opinions\nCouncil still hell-bent on tram extension 19th April 2025 Despite the squeeze on public spending, Edinburgh City Council is apparently still hell-bent on extending the tram network for a sum which you can guarantee... Opinions",
  "https_www_suewebber_uk_/https_www_suewebber_uk_cdn-cgi_l_email-protection/content_17.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_sue-webber-msp-slams-snps-sustained-neglect-policing-edinburgh/content_35.html": "Scottish Conservative and Unionist MSP for the Lothian Region Sue Webber has slammed the SNP’s “sustained neglect” of policing in Edinburgh.\nSue Webber MSP’s comments come after the Scottish Conservatives uncovered that over 300 police stations across Scotland currently require repairs.\nThe Freedom of Information response received by the party shows that in Edinburgh 21 stations are in need of repair or have been declared unfit for purpose. The response also showed that almost 100 police stations have been sold off since 2016.\nSue Webber MSP says it is little wonder that officer morale is so low when staff are often being asked to work in stations in Edinburgh that are rundown and in a “dreadful” state.\nSue Webber MSP says successive SNP justice secretaries have failed to prioritise community policing which is only harming efforts to tackle crime in Edinburgh and keep local people safe.\nSue Webber MSP added that it “speaks volumes” about the SNP’s cuts to policing budgets that the force has still not got the funds to repair stations in Edinburgh despite selling off nearly 100 buildings in the last decade.\nScottish Conservative and Unionist MSP Sue Webber said: “These shocking figures expose the SNP’s sustained neglect of policing in Edinburgh.\n“Local people will be appalled that so many police stations need repairs or have been declared unfit for purpose.\n“It speaks volumes that, despite the SNP’s centralised police force selling almost 100 buildings since 2016, they still do not have the funds to carry out these repairs due to savage SNP cuts to police budgets.\n“It is simply unacceptable that our dedicated officers in Edinburgh are having to work in stations that are often in a dreadful state and completely rundown. It is little wonder officer morale is so low when officers are having to work under those conditions.\n“Failing to invest in the upkeep of stations in Edinburgh only harms community policing efforts which are already being pushed beyond breaking point as a result of the SNP overseeing a drop in officer numbers.\n“Rather than continuing to neglect frontline policing in Edinburgh, SNP ministers must finally address these issues and support the work of rank-and-file officers.”",
  "https_www_suewebber_uk_/https_www_suewebber_uk_news_category_Articles/content_31.html": "SNP plan for major highways will put us all on a road to nowhere 30th January 2025 For that reason you might have thought that in any accident prevention strategy, minimising those situations would be a key goal. But the consultation currently... Articles"
}