{
  "https_www_terryjermy_com/https_www_terryjermy_com_news/content_3.html": "Labour’s Water Act ensures polluting water bosses face up to two years in prison\nWater company bosses could face up to two years in prison due to new powers in force today (Friday 25 April 2025). The new powers,\nWater company bosses could face up to two years in prison due to new powers in force today (Friday 25 April 2025). The new powers,\nToday, the Labour government passed emergency legislation to save the steel factory in Scunthorpe, after Parliament was recalled for only the 34th time since 1948\nYesterday, Health Minister Karin Smyth confirmed that £1.4bn of funding for the Queen Elizabeth Hospital (QEH) would be made available for its refurbishment. This announcement\nTerry Jermy MP has welcomed over 1,500 extra GPs that have been recruited to help end the ‘8am scramble’. Landmark new figures published this morning\nWatch Terry Jermy MP speak in the House of Commons on Road Maintenance. General Debate: Road maintenance I am pleased to be able to speak\n• Millions are set to see their state pension rise by up to £470 from today • Thanks to the government’s commitment to the state pension\nFamilies across South West Norfolk will soon benefit from new nursery places. Swaffham Church of England Primary Academy is part of the Labour government’s new\nToday, King’s Lynn and West Norfolk Borough Council’s planning committee voted against the planning application of the proposed two megafarm sites in Methwold and Feltwell. The application\nThree schemes in South West Norfolk receive the go ahead with fresh government funding this year, helping to protect 27,000 more homes and businesses. South\nTerry Jermy MP, Member of Parliament for South West Norfolk, appeals to residents and businesses to pledge to pick at least one bag of litter\nToday, Labour have announced that police forces will received an additional £800,000 to tackle rural crime. The National Rural Crime Unit and National Wildlife Crime\nOn Tuesday 18th March, Terry Jermy MP hosted Target Ovarian Cancer in Parliament – to help raise awareness of the signs and symptoms of ovarian\nTerry Jermy MP has welcomed the news that Thetford is set to receive up to £20 million of funding as part of the Labour government’s\nTerry Jermy MP, Member of Parliament for South West Norfolk, visited The Queen Elizabeth Hospital (QEH) on Friday (28th February 2025) to discuss ongoing work\nFamilies in South West Norfolk will start to see improved end-of-life care as the government brings in major upgrades to hospice services nationwide. After lobbying\nTerry Jermy MP, Member of South West Norfolk, spoke in Parliament on the issue of special educational needs and disabilities (SEND), in particular around tribunals.\nThe Government has today announced that hundreds of thousands of people will soon be able to access urgent and emergency dental care as the government\nToday, Daniel Zeichner MP, Minister of State for Food Security and Rural Affairs, visited Thetford Power Station, Europe’s largest poultry litter fuelled power station which\nNorfolk will receive just over £47 million to help drive key health services from smoking cessation to addiction recovery and children’s health, and to help\nIndustrial-scale farms in East Anglia have violated environmental standards more than 700 times in the last seven years, according to Freedom of Information (FOI) data.\n46 Labour MPs have written to the ‘big six’ UK supermarkets, to express concern about their unfair practices, which are severely affecting farmers and growers\nTerry Jermy MP has written to Kings Lynn & West Norfolk Borough Council urging them to object to the proposed “mega-farm” at Methwold, which if\nI am delighted that the Labour Government have confirmed that they will extend the Listed Places of Worship Grant Scheme, providing £23 million so that\nFollowing the publication of the Labour Government’s review of the New Hospital Programme, funding has today been confirmed and a green light given for West\nA New Year funding boost for Norfolk families has been welcomed as the county is expected to receive more than £2.3 million through the Government’s family\nTerry Jermy MP has welcomed the Government’s plans to bring back the family doctor as part of a wider package of improvements announced for the NHS\nTerry Jermy MP has welcomed the news that the Queen Elizabeth Hospital will begin reconstruction in 2026 due to funding from the Labour government, stating\nHave your say in the future of the NHS In October 2024, the Government launched the biggest ever national conversation about the future of our\nPeople with disabilities and older residents in South West Norfolk will be supported to live independently in their own homes for longer thanks to an\nTerry Jermy MP has written to Kings Lynn & West Norfolk Borough Council objecting to the proposal for 10 mobile homes and caravan pitches on\nA Norfolk MP has praised the work of the County’s Rivers Trust following a visit to a recently restored rare chalk stream. Terry Jermy MP,\nA Norfolk MP has praised the work of the County’s Rivers Trust following a visit to a recently restored rare chalk stream. Terry Jermy MP,\nThe Labour Government’s landmark Armed Forces Commissioner Bill passed its House of Commons Committee Stage this week with the support of Terry Jermy MP. Introduced\nLabour’s funding for school breakfast clubs will help children achieve their potential. I have written to all schools in my constituency making them aware of\nWestminster Hall Debate on Biosecurity – Terry Jermy MP Speech It is a timely debate for my constituency as there is a proposal for a\nFamilies in South West Norfolk will soon be able to access 30 minutes of quality childcare ahead of the start of the school day as\nTo the residents of South West Norfolk RE: The Terminally Ill Adults (End of Life) Bill This Friday in Parliament there will be a vote\nTerry Jermy MP has submitted his concerns to the Environmental Agency about the potential “megafarm” that is being proposed to be built in Methwold, citing\nThe Government has introduced legislation to establish an independent Armed Forces Commissioner to improve service life for our Armed Forces and their families. Terry Jermy,\nTerry Jermy MP has today backed the Labour Government’s transformative plans to deliver better buses across England by investing nearly a billion pounds, including £16m\nTerry Jermy MP spoke in a key debate in Parliament on the issue of flood preparedness in Norfolk, highlighting the many issues that have caused\nCalls for a dental school to be created in Norfolk have been unanimously backed by county councillors – but a warning has been issued that such a facility would not solve the ‘dental desert’ crisis overnight.\nThe lack of access to dentistry is a major concern for the residents I represent in Thetford and those concerns are shared across wider West Norfolk.\nA challenger taking on Liz Truss at the next general election says the former prime minister’s media blitz to sell her new book has helped him hit his crowdfunding target.\nIt’s been clear since I was selected as the Labour candidate for South West Norfolk that residents are desperate for a Member of Parliament that is interested in local issues and actively working to improve the quality of life for people in the constituency.\nA town that was once the ancient capital of East Anglia will be protected under new rules that hope to attract more funding into the region.\nPlans have been lodged for the controversial 20-year-long redevelopment of a Norfolk housing estate, which could see hundreds of homes torn down.\nA parliamentary candidate from Norfolk is celebrating after surpassing his £5,000 fundraising target in a bid to defeat Liz Truss at the next General Election.\nTerry Jermy, Labour candidate for South West, was interviewed by Chris Goreham on the BBC Radio Norfolk breakfast show on Thursday 18th April 2024. They discussed local priorities and concerns and what people thought of the performance of the current MP.\nThe boundaries of scores of farms rented out by Norfolk County Council could be redrawn, with council leaders on the brink of agreeing controversial changes.\nThe best way to follow the campaign is to sign up for my newsletter.",
  "https_www_terryjermy_com/https_www_terryjermy_com_contact/content_5.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_www_terryjermy_com/https_www_terryjermy_com_priorities/content_2.html": "Priorities For South West Norfolk....\nI've lived in South West Norfolk my whole life. As the Member of Parliament I have outlined my top three priorities:\n1) The NHS - including Adult Social Care, Dentistry, Mental Health and GP services\n2) Jobs and Pay\n3) Farming and the Natural Environment.\nPlease see below for more information about my views and priorities.Terry Jermy MP, Labour Member of Parliament for South West Norfolk\nPeople in South West Norfolk, as with residents all over the UK, have seen the decline of our National Health Service after 13 years of Conservative Government.\nA record number of people are now awaiting hospital treatment causing pain and frustration for many, including people in our area.\n<BR>To make matters worse Norfolk has been particularly badly affected by the crisis in adult social care with thousands of care worker vacancies across our county and serious weaknesses in the quality of care.\nAccess to dentistry is also poor, with just 1.1 dentist for every 10,000 people in the Breckland area. Statistics for the Kings Lynn and West Norfolk Borough aren’t much better at 1.6. No wonder Norfolk has been called a ‘dentistry desert’ with residents too often left in pain and despair.\nA lack of access to dentistry for children is of particular concern with a sharp rise in the number of children presenting at hospital with rotting teeth.\n<BR>\nWhen it comes to mental health, the Norfolk and Suffolk Mental Health Trust has long been failing their residents, rated as inadequate by the Care Quality Commission and, despite repeated promises, there’s little sign of improvement.\nOur NHS facilities have been left to decline too. The Queen Elizabeth Hospital in Kings Lynn, a vital resource for many in South West Norfolk, left with a crumbling roof held up by more than 3,000 metal props.\nThis ridiculous situation has been impacting patient services with sections of the hospital routinely closed off for inspection or emergency work.\nOnly after years of campaigning by staff and community champions did the Government belatedly announce the hospital would be added to the New Hospital Programme. But the dither and delay has meant a new hospital is still many years away and the failing ceilings will continue to impact upon service delivery.\n<BR>\nIf elected, Terry would make securing improvements for our NHS and social care system his top priority.\nThrough casework he deals with as a Councillor, in recent years he has seen first-hand just how inadequate the current situation is.\n<BR>\nHe has supported residents to get improved services from the Mental Health Trust, writing to the Chief Executive to outline service failings with specific cases. Terry has liaised with the Norfolk Adult Social Care team to advocate on behalf of families, and he has listened to your concerns and stories about local health provision through his regular Councillor surgeries and canvassing sessions.\nLiving in South West Norfolk, Terry understands the challenges faced by many, whether that be accessing a GP appointment, obtaining vital medication from a pharmacy or just seeing a dentist.\nThe situation with our NHS is also personal for Terry and is one of the motivations for him to put himself forward as a candidate for Parliament, despite never wanting to be an MP previously.\nIn November 2022, Terry’s mother experienced an unexpected heart attack and spent three weeks in hospital undergoing bypass surgery. That experience was frustrating and concerning enough, with delays answering the 999 call and accessing an ambulance.\nThen a month later things took an even worse turn when Terry’s father, Trevor, contracted pneumonia and Covid-19 and spent two months in intensive care at West Suffolk Hospital.\nTrevor tragically passed away on the 29th January 2023. Throughout these experiences, Terry has seen first-hand how, despite the best efforts of staff, our NHS services are struggling to cope. Urgent investment and change are desperately needed.\nTerry supports the Labour Party’s policy ‘Build An NHS Fit For The Future’ which includes proposals to cut NHS waiting lists by funding two million more hospital appointments a year, through putting an end to the ‘non-dom’ tax status.\n<BR>\nTerry wants to see greater support for local councils like Norfolk County Council so that they can deliver the adult social care required, with improved pay and conditions for staff and an end to the out-sourcing of so much care provision to a myriad of expensive care providers.\nTerry also supports calls for the Norfolk and Suffolk Mental Health Trust to be disbanded.\nWages across South West Norfolk are among some of the lowest in the country. This affects so many other aspects of people’s lives including education, housing, and health. We need a focus in South West Norfolk on improving the number of good quality jobs with decent wages by helping local employers to grow and develop.\nTerry supports Labour’s plan to secure the highest sustained growth in the G7 – with good jobs and productivity growth at the core. This focus will see everyone, not just a few, better off.\nLife in a rural community can be expensive. House prices are often unaffordable to many and out of reach of the average-waged rural worker.\nRents in many market towns and villages are disproportionate for Norfolk’s low wage economy. The cost of transport is a greater proportion of people’s expenditure than elsewhere.\nTerry believes improving connectivity is key and his priority will be increased super-fast broadband provision and addressing mobile phone “not-spots”. For our economy to thrive, we must ensure our communication methods are first class.\nA large proportion of people in our rural communities are self-employed and we need to ensure they have the tools to grow and succeed. We’ve seen rail fares increase dramatically over recent years and Norfolk County Council’s funding for public transport slashed.\nA convenient and affordable rural transport service must become a reality – with a focus on trains as well as buses.\nBanks are closing at an alarming rate in Norfolk with many market towns being left without a service entirely.\nTerry supports the creation of Banking Hubs to ensure services remain available and would welcome the creation of community-owned banks. Terry is a lifelong supporter of credit unions too and would like to see these featured more widely in our rural community as they offer a pragmatic alternative to the big banks that are abandoning our communities.\nNorfolk County Council, and its subsidiary trading company Norse, have huge buying power, as do our district and borough councils along with wider public sector organisations.\nTerry wants to see an aggressive local procurement approach, with public sector organisations buying from and supporting Norfolk-based businesses whenever possible. This is something he has championed as Chair of Thetford Town Council’s Finance and Personnel Committee.\nSelling services to public bodies is often cumbersome with payments slow and the procurement exercise a labyrinth.\nWe need to simplify the process to support a greater number of small and medium-sized businesses in our county.\nTerry supports the policy put forward by Labour Coast and Country that would ensure everywhere has at least one community facility of some sort, be that through the ‘Pub as a Hub’ model, co-located public and other services or a modern village hall.\nTerry led the way with the Charles Burrell Centre, a former high school closed by Norfolk County Council, progressing from a redundant building to a thriving business and community centre with a £500k annual turnover.\nTerry is also a shareholder of the Blue Bell in Stoke Ferry – a project that saw residents in the village rally round to buy a local pub and turn it into a community hub. Along with the Fox at Garboldisham these are great examples of community owned and operated facilities.\nWe live in a beautiful area with fantastic natural environments whether that be areas such as Thetford Forest or the rare chalk-streams of the Little Ouse. Climate change represents a present threat in South West Norfolk and brings huge challenges to farmers and others that rely on the land and rivers.\nTerry believes we are facing both a climate and biodiversity emergency and supports policies addressing these challenges.\n<BR>\nTerry would like to see improvements to planning policy to ensure the planning system properly considers environmental impacts. Such issues are not currently given sufficient weight. He would also like to see councils producing a climate and environmental risk assessment for every major policy decision taken – in the same way that they currently undertake an equality impact assessment.\n<BR>\nThrough his role as a Norfolk County Councillor, Terry has criticised the loss of County Farms land and wants to see this land-holding increased. There needs to be a return to the roots of the scheme and greater emphasis on supporting small-scale and entry level farmers. He wants improved environmental standards for our County Farms Estate too as an example across the County. There needs to be a focus on identifying surplus land, whether that be public or private, and repurposing this for energy production and biodiversity projects, leading to the creation of, for example, bee and pollinator corridors.\nTerry supports the ban on fox hunting and opposes fracking and the use of damaging fertilisers. Terry supports the Campaign to Protect Rural England’s “rooftop revolution” campaign that supports greater use of roof space for solar panels and is against large scale solar farms on otherwise useable land.\nIf elected, Terry would work with Norfolk Police and the Norfolk Police and Crime Commissioner to tackle the impact of illegal hare coursing.\nTerry wants to see greater access to the countryside by improved maintenance of rights of way, by opening up new ones and improving accessibility. His aim is to ensure all Norfolk rights of way are identified and on the “definitive map” as well as supporting local communities to identify and register rights of way.\nOn farming, Labour has pledged to improve food security and boost the UK’s agriculture sector with a “New Deal for Farmers”, including a target that at least half of the food used in hospitals, schools and prisons is British.\nThis is important to our rural economy because analysis has showed that more than 6,300 farms in the UK agricultural sector have gone out of business since 2017, including nearly 5,000 meat, fruit, vegetable and dairy producers.\nOver the same period there has been a 30 per cent fall in the number of jobs in agriculture, forestry and fishing.\nTerry supports Labour’s plan to sign a new veterinary agreement with the EU recognising that, if successful, this would hugely cut red tape for British farmers by getting rid of many checks on food and agricultural goods at ports.",
  "https_www_terryjermy_com/https_www_terryjermy_com/content_1.html": "From South West Norfolk,\nand working hard\nFOR South West Norfolk\nI am the Member of Parliament for South West Norfolk.\nAs a local businessman, community champion and serving as a local Councillor for the past fifteen years, I understands the needs and issues facing South West Norfolk.\nHere are my priorities as your MP\nExperienced In Leadership\nTerry has been serving as a local Councillor in South West Norfolk for the past fifteen years. He’s been successfully elected to Thetford Town Council, Breckland District Council and Norfolk County Council on multiple occasions and has seen his number of votes and share of the total vote increase on each occasion as residents have noticed and appreciated his hard work.\nTerry served as Mayor of Thetford in the 2016/17 Mayoral year and is believed to have been Thetford’s youngest Mayor in its more than 800-year history. During his twelve months in the role, Terry attended more than 200 events locally and across Norfolk, Suffolk and beyond. He raised more than £6,000 for local good causes during the year by hosting an 80’s themed disco, a quiz night, a curry night and the annual Mayor’s Ball which was a sell-out that year. The money raised was divided between more than a dozen local charities and good causes. Terry selected Corinne Fulford, Manager of Thetford’s Great Information Centre and Leaping Hare to serve as his Consort for the year and between them they promoted Thetford far and wide.\nParticularly highlights for Terry’s year as Mayor include hosting representatives from Japan who were exploring links between obsidian and flint, which included a trip for Terry down one of the mines at Grimes Graves. He also officially opened the Polish Language School at Charles Burrell Centre and visited local museums including Dad’s Army Museum and Ancient House.\nFor Terry’s Mayoral Reception, he dispensed with the usual table flowers which had a limited use and decorated the room with small trees which were donated to every school in Thetford after the reception. Terry later visited schools to meet with students and field questions, helping some students to plant the trees in the school grounds.",
  "https_www_terryjermy_com/https_www_terryjermy_com_about-terry/content_4.html": "About Terry\nThe partisan nature of national politics, the constant squabbling and inability to work together is a style of working that does not appeal. However, through my years in local government, it is clear we can only achieve so much and in order to best support you and your family we need a Member of Parliament that understands our area and addresses the challenges that exist.\nI’ve lived in South West Norfolk my whole life and my family are rooted across the constituency. I’m passionate about our shared community. It is where I call home and it is the reason I first entered politics.\nFrom running my own business, to volunteering my time with local charities and serving as as a local Councillor within the constituency for more than fifteen years, it is clear that in order to support residents and improve your quality of life, we need a Member of Parliament who is focused on the needs of our community and understands the challenges that exist.\nI was born and brought up in Thetford and, once through the local education system, I intended to become a teacher but then became involved in my local community and was elected to Thetford Town Council in 2008 aged 22. I later joined both Breckland Council and Norfolk County Council.\nI’ve served on all three levels of local governments for more than ten years and understand well the many complexities and frustrations that come from our different tiers of Government.\nAt Breckland I served as the Leader of the Opposition for 10 years, standing down in 2023 to allow time to focus on my new role as Vice Chairman of the Council and Chairman of the Council’s Scrutiny Commission – an important part of the Council’s governance structure, holding the executive to account.\nPolitics for me is about being able to help people, solve problems and bring people together through hard work and co-operation. I would like to think I have built a reputation for getting things done as a local Councillor and I use my skills and experience to benefit the area I serve and the people within it. I have been delighted to be re-elected on multiple occasions, always improving on my previous election result.\nIn 2021, I received the largest share of the vote for a Labour candidate out of all 84 divisions in Norfolk. Not a County division in a big city or a strong Labour area, but in a market town in rural Norfolk.\nI have always been grateful for the support received and hope I have been able to repay people’s trust by delivering for them.\nAside from my role as a local Councillor I run my own business – producing a monthly magazine that is distributed to 13,000 homes locally. I work with more than eighty small businesses every month and understand the challenges they face.\nSmall and medium enterprises are crucial to both our local economy and our communities – inflation and the cost of living crisis have made trading difficult for many businesses, as well as our residents.\nI am involved in numerous local charitable groups including the Charles Burrell Centre in Thetford where I serve as Chair of the Board of Directors. This is a role I have undertaken since its inception back in 2012. The CBC has progressed from nothing more than a shell, into a thriving community and business centre with an annual turnover of nearly half a million pounds.\nWe provide crucial services that support residents every single day, tackling poverty and deprivation and improving people’s life opportunities. Through this role, I have seen the impact of the Government’s austerity agenda with constant cuts to services and local government.\nI am also Vice Chairman of the Staniforth Trust, maintaining Kings House, garden and Staniforth collection in Thetford.\nFuel poverty, malnutrition and insecure housing are daily struggles for many in South West Norfolk – I believe we can and should do better and our Member of Parliament should serve ALL residents.\nI encourage people to contact me directly should you have any queries or want to find out more information. This website will contain information about my priorities for this election campaign and where I stand on particular issues.\nBest wishes,\nTerry Jermy"
}