{
  "https_www_helengrant_org/https_www_helengrant_org_news_campaign-strengthen-duty-care-owed-students-higher-education-given-parliamentary-support-helen/content_12.html": "Every four days on average, over the last 10 years in England and Wales, one student in Higher Education has committed suicide, according to the ONS. Campaigners believe the general duty of care required of universities is inadequate and that many of these deaths could have been prevented if there were a clear standard to be followed.\nHilary Grime of Sissinghurst suffered the tragic suicide of her daughter Phoebe, formerly a student of Cranbrook School, at Newcastle University in 2021. Hilary joined forces with other bereaved parents and families to address the situation and formed a group called The Learn Network. She then met with her MP, Helen Grant, in December 2022 and as a result Mrs Grant sponsored and hosted an event in Parliament this week to raise awareness of the situation amongst MPs and Peers.\nAn online petition was also set up which has received over 128,000 signatures in support. The petition was delivered to No.10 Downing Street on the same day as the event and is expected to trigger a parliamentary debate about the need for a statutory duty of care to be created.\nHelen said “Whilst many universities have good pastoral services in place for students at such a vulnerable stage in their lives, a more consistent and robust framework needs to be in place to help safeguard and prevent these tragic deaths. I hope our event today will elevate awareness within Parliament and I very much support a debate being timetabled on this issue.”\nHilary Grime said “A statutory duty of care would establish a minimum standard of professional behaviour. This would clarify the responsibilities of universities to help all students throughout their ‘uni journey’, to protect their safety, health and welfare. The current system is not working, and we need to act now. We cannot bring back those we have tragically lost, but we can save and support current and future students.\n“I am carrying on Phoebe's voice and I will never give up this campaign because I believe in what is right and fair, as Phoebe would have done. With a statutory duty of care our universities would become world renowned centres of excellence in pastoral care and guidance, of which we will be very proud.”",
  "https_www_helengrant_org/https_www_helengrant_org_news_career-options/content_15.html": "One of the most enjoyable aspects of my job is that I have the pleasure of visiting so many of our wonderful schools across Maidstone and the Weald.\nIn recent weeks I have visited Barming Primary, to celebrate their ‘Good’ OFTSED rating, Brunswick House Primary, for a Q and A, and Maidstone Grammar, to celebrate their achievements at Speech Day. This week, I have also hosted a prize-winning group from the High Weald Academy in Parliament. Each school has a different culture and atmosphere, but all have impressed me with the confidence and thoughtfulness of the students and the dedication of their committed teachers.\nDuring my conversations with school students recently it has become clear that more and more young people are talking about alternative routes into their prospective careers. When I started visiting our schools ten years ago, most students spoke of either aiming to go straight into work, or to university. Both are viable, traditional and worthwhile options. Importantly, however, they are not for everyone. It is therefore very pleasing that more young people are now aware of the alternatives available to them, such as apprenticeships or starting their own business.\nApprenticeships are a fast-growing option which can provide life-changing career opportunities. They are a fantastic route into work because they allow apprentices to earn whilst they learn and often provide long term employment with their company at the conclusion. Furthermore, the growth of entrepreneurial spirit amongst students is vital in creating future jobs for others. In Parliament recently I launched ‘Workfinder’ - a new app which promotes entrepreneurship by providing young people with work experience in ‘start up’ firms, helping them on their way to a business career. More here: https://www.workfinder.com/.\nMy visits to schools across our community demonstrate how talented our young people are, but each person is different, and we must therefore provide the diversity of education required to help them all achieve their potential.",
  "https_www_helengrant_org/https_www_helengrant_org/content_1.html": "Latest news March Newsletter Dear ReaderThe clocks have come forward and spring is finally with us. … 2025 Apprenticeship Fair The seventh annual Apprenticeship Fair, organised by five Kent MPs, took place… February Newsletter Dear ReaderI’ve set out for you in the following link, a summary of some of my… How has the Winter Fuel Payment cut impacted you? Winter has finally arrived over the last few days, with frosts coming thick and… Holding the Attorney General to Account In the House of Commons today I asked the Solicitor General what the formal… Statement on Ivy Farm Planning Application Ahead of Wednesday's TMBC planning committee, please see my below statement on… Parliamentarians for Peace Pleased to join Mr Speaker and my parliamentary colleagues at New Palace Yard… Lobular Moon Shot Project Very pleased to be able to continue my support for the Lobular Moon Shot… Reaffirming Our Commitment to Justice: A Constructive Opposition It is a privilege to address my legal colleagues through the pages of the Law… November Newsletter November was marked by two particularly important events in our cultural… MP fights for bus passengers facing 50 per cent fare hike Bus passengers across Maidstone and Malling could lose vital services, if a 50… Maidstone and Malling MP Supports Farmers in their fight against unfair Family Farm Tax The plight of farmers across Kent will be highlighted by the MP for Maidstone… Find me on Twitter Find me on Facebook My map Am I your MP? Enter your postcode Postcode Contact Constituency OfficeFirst Floor, 109 Week Street, Maidstone, Kent , ME14 1RB01622 669623[email protected]Helen on TwitterHelen on Instagram\n2025 Apprenticeship Fair The seventh annual Apprenticeship Fair, organised by five Kent MPs, took place…\nHow has the Winter Fuel Payment cut impacted you? Winter has finally arrived over the last few days, with frosts coming thick and…\nHolding the Attorney General to Account In the House of Commons today I asked the Solicitor General what the formal…\nStatement on Ivy Farm Planning Application Ahead of Wednesday's TMBC planning committee, please see my below statement on…\nParliamentarians for Peace Pleased to join Mr Speaker and my parliamentary colleagues at New Palace Yard…\nReaffirming Our Commitment to Justice: A Constructive Opposition It is a privilege to address my legal colleagues through the pages of the Law…\nMP fights for bus passengers facing 50 per cent fare hike Bus passengers across Maidstone and Malling could lose vital services, if a 50…\nMaidstone and Malling MP Supports Farmers in their fight against unfair Family Farm Tax The plight of farmers across Kent will be highlighted by the MP for Maidstone…",
  "https_www_helengrant_org/https_www_helengrant_org_news_reaffirming-our-commitment-justice-constructive-opposition/content_8.html": "It is a privilege to address my legal colleagues through the pages of the Law Society Gazette. As I return to the law in my capacity as Shadow Solicitor General, I am keen to share my perspective on how the Opposition will approach this critical role. I am also greatly honoured to be working alongside the Shadow Attorney General, The Right Honourable The Lord Wolfson of Tredegar KC.\nOur legal system is the bedrock of a just and fair society. It requires diligence, integrity, and an unwavering commitment to the protection of rights and freedoms. These principles guided me during my 23 years as a family lawyer, where I stood alongside individuals at their most vulnerable, working to secure outcomes that balanced fairness with compassion. These experiences shape my approach today, as I scrutinise the Government’s legal agenda in Parliament.\nOne area that I am particularly passionate about is the scourge of violence against women and girls. It first came to my attention as a schoolgirl, when my pioneering mother co-founded one of the earliest women’s refuges in the country, in Carlisle. Tackling violence in the home later became the core of my own legal practice, and then a central part of my work as victims minister in David Cameron’s Government. Such crimes are abhorrent, leaving deep scars not only on the victims but on their families, communities, and society at large.\nThe Government has committed to halving violence against women and girls within a decade - a laudable goal that transcends party politics. My question to the then Solicitor General, Sarah Sackman KC MP, on this issue was simple, yet pressing: what steps are being taken on prevention and early intervention, and when will the specialist rape courts be introduced? - the latter being a promise made in the Government’s 2024 election manifesto.\nAs lawyers, we know the immense value of prevention. In practice, this means addressing the root causes of gender-based violence: educating young people, tackling harmful societal norms, and ensuring robust early interventions to prevent escalation. These measures require sustained funding, strategic planning and the ability to measure progress. I will continue to hold the Government to account for their delivery.\nEqually important is ensuring justice for victims. We are told in a government press release that an additional £49 million pledged for the Crown Prosecution Service will mean additional staff in the CPS’s specialist rape and serious sexual offence unit. This is a step forward, but we must see results. How many additional staff will this funding secure, and how soon will they be in place? Words alone cannot rebuild trust in the justice system; victims need action, and they need it urgently.\nWhile my role in opposition is, at times, adversarial, I am committed to constructive engagement. The law transcends political divides, and where the Government puts forward policies that serve justice and uphold our legal traditions, I will support them unequivocally. But when proposals fall short, when gaps are left unaddressed, or when rights are imperilled, it is my duty to oppose and demand better. This dual role - supportive where possible, critical where necessary - ensures the legal profession’s voice is amplified in Parliament.\nThis spirit of constructive opposition is vital as we navigate pressing challenges. The issues facing the judicial system demand collaboration, careful scrutiny, and an enduring commitment to the public interest.\nAs a profession, we understand the importance of precedent. As legislators, we must also embrace progress. It is my aim, alongside my colleagues, to work towards a justice system that is not just efficient, but equitable - a system that reflects the highest ideals of our shared mission.\nTo all my colleagues across the legal sector, I invite your views, insights, and expertise. I am interested in your commentary on some of the challenges we face in our profession and I want to work with you constructively to hold this Government to account in the spirit of progress that I have outlined in this piece.\nI will also use your feedback to help my party rebuild a platform of trust and confidence within the legal profession, and a sustainable policy programme that makes us deserving of a return to government, when that time comes.",
  "https_www_helengrant_org/https_www_helengrant_org_news/content_11.html": "March Newsletter Tuesday, 1 April, 2025 Dear Reader The clocks have come forward and spring is finally with us. Here's a summary of some of my recent activities since my last e-letter. https://mailchi.mp/parliament.uk/helen-grant-mp-mar-19875790?fbclid=IwY… News\n2025 Apprenticeship Fair 22nd March 2025 The seventh annual Apprenticeship Fair, organised by five Kent MPs, took place at Maidstone Leisure Centre and welcomed over 1,000 students from schools across... News\nFebruary Newsletter 26th February 2025 Dear Reader I’ve set out for you in the following link, a summary of some of my activities over recent weeks by way of an update. Please see my full newsletter... News\nHow has the Winter Fuel Payment cut impacted you? 28th January 2025 Winter has finally arrived over the last few days, with frosts coming thick and fast and the coldest January night in 15 years. I know that for many pensioners... Articles\nHolding the Attorney General to Account 23rd January 2025 In the House of Commons today I asked the Solicitor General what the formal procedures are for the Attorney General to recuse himself in matters involving... News\nStatement on Ivy Farm Planning Application 13th January 2025 Ahead of Wednesday's TMBC planning committee, please see my below statement on the Ivy Farm planning application: Throughout my time as a Member of Parliament... News\nParliamentarians for Peace 11th December 2024 Pleased to join Mr Speaker and my parliamentary colleagues at New Palace Yard to mark 76 years of the Universal Declaration of Human Rights. For nearly eight... News\nLobular Moon Shot Project 11th December 2024 Very pleased to be able to continue my support for the Lobular Moon Shot Project yesterday in Parliament. Specific forms of cancer – like lobular breast cancer... News\nReaffirming Our Commitment to Justice: A Constructive Opposition 3rd December 2024 It is a privilege to address my legal colleagues through the pages of the Law Society Gazette. As I return to the law in my capacity as Shadow Solicitor General... News\nNovember Newsletter 3rd December 2024 November was marked by two particularly important events in our cultural history; our annual remembrance services and, just last week, the Assisted Dying Bill... News",
  "https_www_helengrant_org/https_www_helengrant_org_campaigns_investing-schools-and-ensuring-funding-first-class-education-all-our-children/content_7.html": "I am pleased that the Government has shown it has listened to Kent MPs, by announcing further funding for our schools. In 2024-25 the total national core schools budget will be at its highest ever level – a £5.7bn increase in the last two years.\nI am pleased that the Government has shown it has listened to Kent MPs, by announcing further funding for our schools. In 2024-25 the total national core schools budget will be at its highest ever level – a £5.7bn increase in the last two years.",
  "https_www_helengrant_org/https_www_helengrant_org_news_category_Articles/content_10.html": "How has the Winter Fuel Payment cut impacted you? 28th January 2025 Winter has finally arrived over the last few days, with frosts coming thick and fast and the coldest January night in 15 years. I know that for many pensioners... Articles\nFebruary Newsletter 1st February 2024 The fireworks of New Year’s Eve seem long in the past as weather systems Ischa and Jocelyn stormed us through January toward the last month of Winter. Meanwhile... Articles\nHelen Grant Points the way for Village Green Status 10th January 2024 Protecting our green spaces from inappropriate housing developments and safeguarding our precious environment have always been priorities for me. That is why... Articles\nSEW Community Fund recipients recognised for their work in Maidstone & The Weald 23rd May 2023 A few weeks ago I wrote in this column about a special fund being set up by South East Water (SEW) for charities in Maidstone & The Weald. It was created to... Articles\nThe Coronation of King Charles III 4th May 2023 Amidst the current Cost-Of-Living crisis several commentators have been critical of the King’s Coronation, a theme I have also seen within several Maidstone &... Articles\nSouth East Water Announce Charity Community Fund 3rd April 2023 Regular readers of InYourArea may recall my column about the ‘nightmare before Christmas’ last year. It was a story about a large number of residents and... Articles\nThe Sustainability of Farming in Kent 10th March 2023 There’s a real torsion in the expression ‘A Perfect Storm’ – I think it is in the uncomfortable link between an ‘aspirational adjective’ and a ‘noun to avoid’... Articles\nHelen Grant speaks up for the Beautiful Game 27th February 2023 The success of English football is an achievement that should rightly be celebrated. Our clubs, across the top divisions, have been great generators of tourism... Articles\nRural Crime Roundtable 10th February 2023 Weald of Kent residents may recall a campaign I launched in Cranbrook in July 2021 to address rural crime and antisocial behaviour, working alongside the police... Articles",
  "https_www_helengrant_org/https_www_helengrant_org_news_parliamentarians-peace/content_2.html": "Pleased to join Mr Speaker and my parliamentary colleagues at New Palace Yard to mark 76 years of the Universal Declaration of Human Rights. For nearly eight decades, this landmark declaration has championed equality, freedom, and justice as the foundation of thriving societies.\nYet, in recent years, escalating wars and conflicts have caused immense suffering and displacement, underscoring the urgent need for global solidarity and leadership. As parliamentarians, we have a responsibility to address the root causes of conflict and promote peaceful dialogue. We must all strive for a world where human rights and peace prevail.",
  "https_www_helengrant_org/https_www_helengrant_org_news_category_News/content_4.html": "March Newsletter 1st April 2025 Dear Reader The clocks have come forward and spring is finally with us. Here's a summary of some of my recent activities since my last e-letter. https://mailchi... News\n2025 Apprenticeship Fair 22nd March 2025 The seventh annual Apprenticeship Fair, organised by five Kent MPs, took place at Maidstone Leisure Centre and welcomed over 1,000 students from schools across... News\nFebruary Newsletter 26th February 2025 Dear Reader I’ve set out for you in the following link, a summary of some of my activities over recent weeks by way of an update. Please see my full newsletter... News\nHolding the Attorney General to Account 23rd January 2025 In the House of Commons today I asked the Solicitor General what the formal procedures are for the Attorney General to recuse himself in matters involving... News\nStatement on Ivy Farm Planning Application 13th January 2025 Ahead of Wednesday's TMBC planning committee, please see my below statement on the Ivy Farm planning application: Throughout my time as a Member of Parliament... News\nParliamentarians for Peace 11th December 2024 Pleased to join Mr Speaker and my parliamentary colleagues at New Palace Yard to mark 76 years of the Universal Declaration of Human Rights. For nearly eight... News\nLobular Moon Shot Project 11th December 2024 Very pleased to be able to continue my support for the Lobular Moon Shot Project yesterday in Parliament. Specific forms of cancer – like lobular breast cancer... News\nReaffirming Our Commitment to Justice: A Constructive Opposition 3rd December 2024 It is a privilege to address my legal colleagues through the pages of the Law Society Gazette. As I return to the law in my capacity as Shadow Solicitor General... News\nNovember Newsletter 3rd December 2024 November was marked by two particularly important events in our cultural history; our annual remembrance services and, just last week, the Assisted Dying Bill... News",
  "https_www_helengrant_org/https_www_helengrant_org_news_november-newsletter/content_13.html": "November was marked by two particularly important events in our cultural history; our annual remembrance services and, just last week, the Assisted Dying Bill passing through the House of Commons. More about these below, together with an update on some of my other activities in the constituency and in Westminster.\nYou can read my full November newsletter here: https://mailchi.mp/parliament.uk/helen-grant-mp-nov-19873633",
  "https_www_helengrant_org/https_www_helengrant_org_news_statement-ivy-farm-planning-application/content_14.html": "Ahead of Wednesday's TMBC planning committee, please see my below statement on the Ivy Farm planning application:\nThroughout my time as a Member of Parliament, overdevelopment has been a persistent issue raised by constituents, and I have fought hard to protect our precious green spaces from inappropriate housing developments. This includes writing to TMBC planning department and committee to express my concerns with the Ivy Farm application (TM/22/01570/OA).\nI was pleased that this application was deferred to enable a Conservation and further Case Officer report to be prepared. This was in order to assess the impact of the proposed development on the East Malling Conservation Area and surrounding listed buildings. You can see the published report here: https://democracy.tmbc.gov.uk/.../Report%20of%20Director...\nI remain very worried, however, about the prospect of a raised access road in this plan. It will undermine the privacy of local residents and increase safety concerns arising from additional traffic on this part of the Wateringbury Road. I am also concerned that these extra homes will place further strain on local infrastructure, such as school places and access to GPs. I encourage all residents to contact their local councillor to raise their views.",
  "https_www_helengrant_org/https_www_helengrant_org_myplan/content_5.html": "This has been a pledge since I was first elected as MP in 2010, starting with the Save Fant Farm campaign. We now face challenges with the huge Bradbourne and Broadwater Farm developments in the Mallings, and the threat to Bunyards Farm in Allington\nI am extremely proud to work with the team at Maidstone and Tunbridge Wells NHS Trust. They are one of the few trusts in the country to have no long-waiting patients and have delivered the 62-day cancer standard each month for four years running.\nI am pleased that the Government has shown it has listened to Kent MPs, by announcing further funding for our schools. In 2024-25 the total national core schools budget will be at its highest ever level – a £5.7bn increase in the last two years.\nI regularly meet with Police and Crime Commissioner, Matthew Scott, Chief Superintendent Neil Loudon, and Maidstone District Commander Mark McLellan, to work together on measures being taken to keep Maidstone and Malling safe.\nIn 2018 I hosted the first annual Maidstone Apprenticeship Fair, bringing together employers and local schools. It has grown every year and in 2024 I welcomed 60 businesses and over 1600 students to the Maidstone leisure centre on March 8th.\nIn addition to my train services work, I campaign to tackle HGVs on rural roads, I set up and attend the Maidstone Schools Bus Forum, and I will be working alongside Tom Tugendhat MP on improving transport to schools in Tonbridge and Wrotham.",
  "https_www_helengrant_org/https_www_helengrant_org_news_february-newsletter-0/content_6.html": "Tweet Wednesday, 26 February, 2025 News Dear ReaderI’ve set out for you in the following link, a summary of some of my activities over recent weeks by way of an update.Please see my full newsletter here.",
  "https_www_helengrant_org/https_www_helengrant_org_cdn-cgi_l_email-protection/content_16.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_helengrant_org/https_www_helengrant_org_news_campaign-seeking-statutory-duty-care-higher-education-students-gains-momentum-impassioned/content_9.html": "Every four days on average, over the last 10 years in England and Wales, one student in Higher Education has committed suicide, according to the ONS. Campaigners believe that many of these deaths could have been prevented if there were a clear standard to be followed by universities under a duty of care to their students.\nHilary Grime of Sissinghurst suffered the tragic suicide of her daughter Phoebe, formerly a student of Cranbrook School, at Newcastle University in 2021. Hilary joined forces with a group called The Learn Network, formed by bereaved parents and families to address their shared situation. Hilary and her son Hamish then met with their MP Helen Grant in December 2022, and as a result Mrs Grant sponsored and hosted an event in Parliament in April to raise awareness of the situation amongst MPs and Peers. An online petition was also set up which received over 128,000 signatures and this triggered a parliamentary debate about the need for a statutory duty of care.\nThe debate, which took place on Monday 5th June in Westminster Hall, was very well attended and many senior MPs delivered powerful speeches. Most supported the motion for a Statutory Duty of Care, whilst citing the tragic losses of their own constituents. Helen Grant’s particularly impassioned speech set out the need for clarity and for consistency in the sector, urging the Minister to look again at the situation.\nShe said “while some universities are clearly raising their game, others are lagging behind, creating something of a [care and well-being] lottery for students in the UCAS applications process.\nA statutory duty of care would set the bar to ‘level-up’ the standard, by requiring all Higher Education Providers to do what might reasonably be expected, whilst maintaining their autonomy in deciding exactly how that will be achieved”.\nHilary Grime, who attended the debate alongside several other parents from The Learn Network said “A statutory duty of care would establish a minimum standard of professional behaviour. This would clarify the responsibilities of universities to help all students throughout their ‘uni journey’, to protect their safety, health and welfare. The current system is not working, and we need to act now. We cannot bring back those we have tragically lost, but we can save and support current and future students.\nIn Minister for Higher Education Robert Halfon’s concluding remarks, he said “my hon. Friend the Member for Maidstone and The Weald cares passionately about this, and I thank her for all that she has done for her constituents. To be absolutely clear, I am not closing the door on future legislation if that is what is required to make students safer. For now, we are seeking actively to bolster every aspect of the support systems that are available to students.”",
  "https_www_helengrant_org/https_www_helengrant_org_news_2025-apprenticeship-fair/content_3.html": "The seventh annual Apprenticeship Fair, organised by five Kent MPs, took place at Maidstone Leisure Centre and welcomed over 1,000 students from schools across Maidstone, Sevenoaks, Tonbridge, Faversham, and the Weald of Kent. Employers ranged from global giants like Google, Amazon, British Airways, and Transport for London to local businesses. The event featured a diverse range of career opportunities across sectors such as technology, healthcare, construction, and hospitality. The MPs hosting this event were Helen Whately MP, Helen Grant MP, Laura Trott MP and Katie Lam MP. Kent’s Police and Crime Commissioner Matthew Scott also attended the event.\nThis year’s Apprenticeship Fair comes at a critical time. With businesses grappling with employment costs due to the National Insurance changes announced in the Chancellor’s Autumn Statement, and job cuts seen in major supermarkets like Tesco and Sainsbury’s, apprenticeships are increasingly vital pathways into work. They also provide an alternative for young people amid rising university fees, as well as the financial challenges faced by universities like the University of Kent. The fair showcased how apprenticeships empower young people with hands-on skills while supporting businesses in building a skilled workforce.\nSee local coverage of the impact of: the budget on businesses here; supermarket job cuts here; redundancies at the University of Kent here; and apprenticeships in tackling unemployment here.\nHelen Grant MP says: “Another fantastic apprenticeship fair this year!\nIt is great to see so many businesses returning for the 7th annual fair, attended by over 1300 local Kent pupils across the day.\nI have always been a strong advocate for apprenticeships. They equip people with real-world skills and open doors to high-quality careers. They also provide employers with valuable new recruits for sustainable business growth and development.\nFrom engineering to education, from healthcare to hospitality, and from transport to technology - apprenticeships empower individuals, strengthen industries and boost economies!\nAlongside my Kent colleagues Helen Whately MP, Laura Trott MP and Katie Lam MP, I am proud to promote a proposition where everybody wins!”\nHelen Whately MP says: \"Our seventh annual Apprenticeship Fair was a resounding success. It was great to chat to students seizing the chance to learn about apprenticeships. Many students were discovering career options they had never thought of before.\n“With a 100,000 more young people not in education, employment, or training since Labour took office last July, and many young people telling me they are struggling to get on the first rung of a career ladder, the apprenticeships fair is more important than ever.\nI was delighted to see so many employers at the fair, despite the impact of the budget on hiring - with many businesses freezing recruitment because of the National Insurance tax rise. Local businesses, as well as larger ones like Google and Amazon, showed up in force.\nLeaving school and entering the world of work is a big step in all of our lives. The more students know about what’s out there, the better chance they have of setting off on the right career path for them.”\nLaura Trott MP says: “The Apprenticeship Fair is about helping young people connect with local employers, and it was great to hear that so many of the exhibitors were impressed with the quantity and quality of students in attendance.\n“Apprenticeships are changing lives across Kent and I loved seeing the apprentices of the future start their journey.\"\nKatie Lam MP says: “I was thrilled to see so many students attend the MPs’ Apprenticeship Fair on Friday. Apprenticeships are invaluable in helping young people develop rewarding careers, and for employers to develop a workforce with the right skills for the future.\n“I am grateful to all the businesses who came along. It was fantastic to speak to the current cohort of apprentices who could tell current students about their increased confidence, skills and knowledge. I wish all the students luck as they start to consider the first steps in their careers.”\nTom Tugendhat MP says: “The Apprenticeship Fair offers young people a valuable chance to meet local employers and explore diverse career paths. Each year, it’s great to see so many students engaging with employers, and feedback from businesses highlights the talent in Tonbridge, Edenbridge, and the North Downs Villages. Apprenticeships open doors across Kent, and it’s inspiring to see the next generation take their first steps toward success.”"
}