{
  "https_lynnthomson_com/https_lynnthomson_com/content_1.html": "Signed in as:\nfiller@godaddy.com\nWhat matters to you in Aberdeen North? As your Labour candidate, I'd like to hear from you about the issues that are important to you. It might be the cost of living crisis, our public services or climate change - do get in touch and let me know.\nClick here to go to my survey.\nPromoted by Lewis Macdonald on behalf of Lynn Thomson, both c/o 187 Craigton Road, Aberdeen, AB15 7UB\nCopyright © 2023 Lynn Thomson for Aberdeen North - All Rights Reserved.",
  "https_lynnthomson_com/https_lynnthomson_com_m_create-account/content_4.html": "Signed in as:\nfiller@godaddy.com\nSign out\nAccount\nSign me up to receive exclusive member benefits via email.\nAlready have an account? Sign in\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nPromoted by Lewis Macdonald on behalf of Lynn Thomson, both c/o 187 Craigton Road, Aberdeen, AB15 7UB\nCopyright © 2023 Lynn Thomson for Aberdeen North - All Rights Reserved.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_lynnthomson_com/https_lynnthomson_com_m_login/content_7.html": "Signed in as:\nfiller@godaddy.com\nSign in to your account to access your profile, history, and any private pages you've been granted access to.\nNot a member? Create account.\nPromoted by Lewis Macdonald on behalf of Lynn Thomson, both c/o 187 Craigton Road, Aberdeen, AB15 7UB\nCopyright © 2023 Lynn Thomson for Aberdeen North - All Rights Reserved.",
  "https_lynnthomson_com/https_lynnthomson_com_privacy-policy/content_5.html": "Signed in as:\nfiller@godaddy.com\nOur contact details\nName: Lynn Thomson\nPhone Number: 07782 740939\nE-mail: hello@lynnthomson.com\nThe type of personal information we collect\nWe currently collect and process the following information: your name, email address, postcode and if supplied, your phone number.\nHow we get the personal information and why we have it\nThe personal information we process is provided by you when you contact us through our website.\nWe use the information you give us to respond to any feedback you have.\nWe will not share the information you provide through the contact form with anyone else.\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful basis we rely on for processing this information is your consent. You can remove your consent at any time. You can do this by contacting us again through the website or on the phone number above.\nHow we store your personal information\nYour information is securely stored.\nWe will keep your personal information for the minimum time possible. We will then dispose your information by deleting in from our records.\nYour data protection rights\nUnder data protection law, you have rights including:\nYour right of access - You have the right to ask us for copies of your personal information.\nYour right to rectification - You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure - You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing - You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing - You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability - You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us at hello@lynnthomson.com if you wish to make a request.\nHow to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at hello@lynnthomson.com.\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\nPromoted by Lewis Macdonald on behalf of Lynn Thomson, both c/o 187 Craigton Road, Aberdeen, AB15 7UB\nCopyright © 2023 Lynn Thomson for Aberdeen North - All Rights Reserved.",
  "https_lynnthomson_com/https_lynnthomson_com_what-matters-to-you%3F/content_3.html": "Signed in as:\nfiller@godaddy.com\nSign in to your account to access your profile, history, and any private pages you've been granted access to.\nNot a member? Create account.\nPromoted by Lewis Macdonald on behalf of Lynn Thomson, both c/o 187 Craigton Road, Aberdeen, AB15 7UB\nCopyright © 2023 Lynn Thomson for Aberdeen North - All Rights Reserved.",
  "https_lynnthomson_com/https_lynnthomson_com_about-lynn/content_2.html": "Signed in as:\nfiller@godaddy.com\nI’m your Labour candidate for Aberdeen North at the next General Election. I’ve lived in Aberdeen for 40 years and as well as being a city councillor, I’m an NHS manager. I’m also a trade unionist, being a longstanding member of Unison.\nWith my life and work experience, I’m well-placed to be a strong voice for you at Westminster. Aberdeen North was a Labour seat for many years and it’s time to take it back from Kirsty Blackman and the SNP.\nHaving worked in the health service for 30 years, I’ve seen first hand how our public services are struggling. I believe that Labour must lead communities in campaigning against cuts and closures. We must set a new agenda and put forward a vision for a UK that is forward-looking, outward-looking and puts people first. I believe I have the energy and enthusiasm, the understanding of policy and the campaigning approach to make me a strong and effective representative for Aberdeen North at Westminster.\nThe UK deserves better than the constitutional nitpicking of the SNP and the disastrous economic policies of the Tories. I would be honoured if you were to lend me your vote and I would relish the opportunity to be part of the change that both Aberdeen North and the wider UK need.\nPromoted by Lewis Macdonald on behalf of Lynn Thomson, both c/o 187 Craigton Road, Aberdeen, AB15 7UB\nCopyright © 2023 Lynn Thomson for Aberdeen North - All Rights Reserved.",
  "https_lynnthomson_com/https_lynnthomson_com_m_account/content_6.html": "Signed in as:\nfiller@godaddy.com\nSign in to your account to access your profile, history, and any private pages you've been granted access to.\nNot a member? Create account.\nPromoted by Lewis Macdonald on behalf of Lynn Thomson, both c/o 187 Craigton Road, Aberdeen, AB15 7UB\nCopyright © 2023 Lynn Thomson for Aberdeen North - All Rights Reserved."
}