{
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_millbrook-combined-school/content_26.html": "It was fantastic to visit Millbrook Combined School & Community Hub. I answered some tough questions from Year 5 and 6 children about the role of an MP and how the government will improve schools.\nMillbrook is one of 20 Wycombe schools that are taking part in UK Parliament Week, an annual event that spreads the word about what Parliament does. It’s great to see so many young people making their voices heard in our democracy.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_wycombe-for-fairtrade/content_56.html": "Inspiring to meet volunteers from Wycombe for Fairtrade at Django’s specialty coffee house in the old library.\nI was interested to hear about their campaign to ensure that more retailers and catering outlets in Wycombe stock Fairtrade-certified products. Wycombe for Fairtrade aims to promote social justice and fairer opportunities for future generations by collaborating with partners in countries such as Kenya and Costa Rica.\nI was interested to hear from Professor Fred Yamoah about the video Buckinghamshire New University film students are making to raise the profile of Fairtrade in our town.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_kashmir-all-party-parliamentary-group/content_110.html": "I was delighted to attend the Kashmir All Party Parliamentary Group in the House of Commons. I spoke of my determination to represent the thriving Kashmiri community in Wycombe, should I get elected as Wycombe’s MP, and to ask the government to do more about human rights abuses and secure progress on the right of the Kashmiri people to self-determination.\nI was delighted to meet the High Commissioner of Pakistan, His Excellency Dr Mohammad Faisal. I also spoke about the time I spent living and working in Pakistan twenty five years ago.\nMPs Khalil Mahmood, Imran Hussain, Mohammad Yasin and Debbie Abrahams were also present.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_far-right-protests-in-wycombe/content_31.html": "I raised concerns with Thames Valley Police about the potential civil unrest by the far right ahead of their planned action in High Wycombe on 3rd August. It is unacceptable that the far right is trying to exploit the horrific murders in Southport to stoke division and target communities. We stand against their hatred and division.\nThank you to our brave police officers for protecting the public and preserving the peace in High Wycombe.\nThanks also to those who came to gather against hatred and division. We stand against those who try to divide communities and indeed who try to target specific communities. I feel very proud to represent the wonderful people of Wycombe.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_breakfast-clubs-roundtable/content_100.html": "In April 2025, 750 schools across England will participate in the government’s free breakfast club pilot scheme. Ahead of the national rollout, Secretary of State for Education Bridget Phillipson MP has asked peers to talk to local stakeholders and hear their views on the scheme.\nOn Friday, March 28, I hosted a roundtable of school leaders, parents, and providers. My aim was to understand the impact of breakfast clubs on local families and how the government can best support our young children.\nThe government’s Opportunity Mission Delivery Champion, Sarah Smith MP, also joined the meeting and explained how free breakfast clubs will benefit thousands of children at Wycombe’s 29 primary schools as part of Labour’s mission to break the unfair link between background and success.\nI learnt just how valuable breakfast clubs can be for families in Wycombe, boosting attendance and attainment, as well as enabling parents to balance work and family life.\nAhead of the national rollout, it was useful to learn about good practice in Wycombe’s existing breakfast clubs whilst also considering potential logistical and financial challenges.\nThere are so many benefits to breakfast clubs, which is why it is a shame these clubs were only available in one in ten schools in England under the Conservatives. Labour will make them available to every child.\nI have written to the Secretary of State to share key insights from this meeting.’\nCara Nightingale, Food Programmes Manager at the One Can Trust foodbank, said:\nIt was a great opportunity for parents, organisations, teachers and providers to come together to discuss this new policy by sharing ideas, offloading challenges and providing suggestions as to how to best feed and provide childcare for all primary school children.”",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_derehams-inn-community-group/content_69.html": "Pubs are such an important part of our communities.\nI met with Richard and Mick from the Derehams Inn Community Group as I was keen to hear about their efforts to save the Derehams Inn Pub. I will be supporting their campaign to bring life back to this community asset.\nTo learn more about their campaign please head to their web site.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_constituency-support-highlights/content_92.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_ceasefire-in-the-middle-east/content_102.html": "I am immensely relieved to hear of the announcement of a ceasefire in the Middle East.\nThis is a crucial step towards halting the violence that has claimed too many lives and caused immense suffering on both sides. The Palestinian people have suffered immeasurable loss, too many innocent people have lost their lives or their loved one and indeed their homes.\nAs well as a stop to the violence and killing, this ceasefire must enable a safe release of Israeli hostages and a significant increase in humanitarian aid, which is urgently needed to alleviate the suffering in Gaza.\nIt is now vital that all parties engage in meaningful dialogue to address the root causes of this conflict. There must be a better future for the Israeli and Palestinian people — grounded in a two-state solution with a safe and secure Israel living alongside an independent and viable Palestinian state.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_buckinghamshire-business-firsts-spotlight-on-skills/content_6.html": "I met with more than 15 local employers at an event organised by Buckinghamshire Business First (BBF) to examine how the Government’s skills agenda can drive economic growth.\nPhillippa Batting, CEO, said:\nWe appreciate Emma taking time to listen to the local business voice.\nIt was an insightful discussion where we put a spotlight on skills, focusing on the challenges and opportunities for businesses relating to their current and future workforce.\nI was interested to hear about the Buckinghamshire Local Skills Improvement plan and to discuss how government measures to improve flexibility on apprenticeships can increase uptake in our area. The meeting was a great opportunity to hear from businesses about the issues holding Wycombe’s young people back, including driving test delays and the excessive administrative burdens on companies offering work experience.\nI will be writing to the relevant authorities to represent these concerns. Other local businesses wishing to share their views should get in touch with me at Emma.Reynolds.MP@parliament.uk.\nLuisa Clarke, Talent Attraction Lead for Buckinghamshire Healthcare NHS Trust, said:\nNHS trusts across the country need to attract the workforce of the future by engaging with schools and colleges within our local communities.\n“We are working with Bucks Skills Hub and the Careers and Enterprise Company to create the foundations of our talent pipeline through outreach activities, work experience and insight events at the Trust.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_sikh-gurdwara/content_32.html": "I was pleased to visit the local Sikh Gurdwara in High Wycombe.\nAt the Gurdwara Amrit Parchar Dharmik Diwan, there is a celebration for the 555th anniversary of the arrival of Sri Guru Nanak Dev Ji.\nWycombe’s Sikh community makes an important contribution to local business and society. Thank you for the delicious food, especially the chai and samosas!",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_wycombe-refugee-partnership/content_43.html": "It was great to meet with Wycombe Refugee Partnership and interesting to hear how the team, made up of over 60 volunteers, support refugees and asylum seekers here in Wycombe.\nThank you for all the hard work you do.\nIt was great to meet with Wycombe Refugee Partnership and interesting to hear how the team, made up of over 60 volunteers, support refugees and asylum seekers here in Wycombe.\nThank you for all the hard work you do.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_christmas-card-competition-winners/content_30.html": "I would like to congratulate and thank the finalists in my Christmas card competition.\nFirst-place winner Kai impressed me with his cheerful, bright and fun design, featuring Santa with an enormous sack of presents.\nI have sent Kai and the other finalists a prize and a certificate each. Kai and his family have received an invitation to visit Parliament.\nA huge thank you to the children from High Wycombe Church of England School, Beechview Academy, Burford School, Danesfield School, Lane End Primary School and Crown House School for their fantastic entries to my Christmas card competition. I was delighted to give a copy of the card to local charities and organisations, as well as to the Prime Minister.\nThank you very much to our sponsors, Pladis global and Airflow, for making the Christmas card competition possible.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_labour-party-conference/content_45.html": "Change Begins\nIt was great to be at Labour Party conference in Liverpool this week.\nIt was an excellent opportunity to discuss how much this government has already achieved whilst also looking ahead towards a decade of national renewal.\nLabour Muslim Network Reception\nI was delighted to attend the Labour Muslim Network reception.\nI stand against Islamophobia and will call it out when I encounter it.\nMedical Aid for Palestinians and LFPME\nThank you to Medical Aid for Palestinians and Labour Friends of Palestine & the Middle East (LFPME) for hosting an excellent meeting with the Palestinian Ambassador, Husam Zomlot.\nConference Exhibitions\nI really enjoyed visiting the various exhibitions at conference.\nThanks to those constituents who asked me to speak to organisations close to their hearts. It was invaluable to discuss how these issues impact Wycombe.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_cableflow/content_71.html": "I was pleased to visit Wycombe-based company Cableflow, and to meet representatives from BEAMA, the UK trade association for manufacturers and providers of energy infrastructure technologies.\nCableflow is the UK’s largest manufacturer of Medical Supply Units, which are used across the NHS and the private healthcare sector. Companies such as Cableflow have an important role to play in our Labour government’s mission to make Britain a clean energy superpower.\nI look forward to supporting Cableflow in developing closer ties with the NHS.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_sir-william-ramsay-school/content_83.html": "I was pleased to visit Sir William Ramsay School, which many of my Wycombe constituents’ children attend. Headteacher Mr Stocking explained how he is changing the culture of the school and improving safeguarding and behaviour.\nI was interested to hear about how the new Year 7 students have been welcomed to the school with a residential trip and a performing arts programme.\nThe CEO of Insignis Trust, Garret Fay, explained how the academy trust is investing in William Ramsay through a new reading programme and lockable pouches for students to keep their phones in during the day. I am looking forward to hearing more about how the school is progressing on its path to improvement.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_opening-of-wycombes-new-primark-store/content_48.html": "I was pleased to be able to attend the grand opening of Wycombe’s new Primark store in the Eden Centre. It was great to chat to excited staff who had worked so hard to close the new store last night and open the new store this morning.\nI was pleased to be able to attend the grand opening of Wycombe’s new Primark store in the Eden Centre. It was great to chat to excited staff who had worked so hard to close the new store last night and open the new store this morning.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_outstanding-careers-guidance-at-rgs/content_88.html": "I enjoyed a tour of Wycombe’s Royal Grammar School with headteacher Mr Wayne and Sixth form students Alex and Cameron. I heard from RGS careers lead Sweta Thakrar about the school’s award-winning careers programme.\nSweta Thakrar said:\nIt was a privilege to welcome Emma Reynolds (MP) to RGS and share insights into our award-winning Careers Programme, which has earned us recognition as a National Centre of Excellence in Careers Education.\nAt RGS, we prepare students from Year 7 through to Year 13 for ambitious futures, whether that be top-tier universities, including Oxbridge, or the growing number pursuing Degree/Higher Apprenticeships.\nOur strong partnerships with the Local Authority (Bucks Business First and the Buckinghamshire Skills Hub), alongside our alumni and employer networks, allow us to deliver an innovative and forward-thinking careers provision.\nIt was also fantastic to discuss our plans for National Careers Week (#NCW2025), including a trip to the Bucks Skills Show, a whole-school Careers Prefect Assembly, a #YoungEnterprise Year 7 workshop, and our Sixth Form Lecture Series on Futures.”\nAs part of National Careers Week, it was inspiring to hear about the excellent careers provision at Wycombe’s Royal Grammar School. The Labour Government has outlined a comprehensive policy aimed at enhancing careers provision in all schools as part of its mission to break down barriers to opportunity. The Government is also delivering a new Youth Guarantee so every young person has access to education or training to help them find a job.\nSixth form students Alex and Cameron said:\nMeeting Emma was a valuable insight into her role as an MP and her interactions with her constituents. We had a great opportunity to show her round RGS”",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_pensions-credit-surgery/content_11.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_wycombe-hospital/content_39.html": "The future of the Wycombe hospital’s tower and the cost of its maintenance is raised with me frequently by constituents.\nI was very pleased to meet again the CEO of Buckinghamshire Healthcare Trust. I was encouraged to hear about their plans to develop the hospital and offered my steadfast support. It is crucial that we don’t lose any additional services from our hospital.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_william-hands-furniture-maker/content_93.html": "It was fascinating to visit William Hands – the furniture maker in the heart of High Wycombe which was started from William’s home in 1906.\nIt was wonderful to see the chairs that William Hands produced for the coronations of King George VI in 1936 and Queen Elizabeth II in 1953.\nWilliam Hands now specialises in manufacturing high end furniture for businesses and it was amazing to see the huge boardroom table they’re working on. I was interested to meet Jai, one of their apprentices, and hear about how he is building his skills in upholstery. It is brilliant to see the company investing in the next generation to continue the furniture making industry which is key to Wycombe’s industrial heritage.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_remembrance-sunday/content_101.html": "I attended the Remembrance Sunday Parade and Service at the All Saints War Memorial in High Wycombe this morning.\nWe honour those brave service personnel who serve and have served to keep us safe, and all those who have laid down their lives for the freedom and democracy that we enjoy today.\nI always remember my grandad on this day. He fought in WWII including D-Day. He was one of the lucky ones and lived until the age of 96. It used to be a huge honour to attend Remembrance Sunday with him in London and march alongside him and other veterans. I have fond memories of those times.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_highcrest-academy/content_112.html": "I enjoyed visiting The Highcrest Academy as part of UK Parliament Week. This is an annual event that spreads the word about what Parliament does.\nI was interested to hear how Highcrest Academy encourages its students to get involved in democracy, by running mock elections and sending a delegation to the Model United Nations.\nStudents told me about their career aspirations, which ranged from software engineering to speech and language therapy. The A Level Law and A Level Politics classes asked some thoughtful questions about hereditary peers, assisted dying and the role of an MP.\nA most interesting visit, thank you Highcrest.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_pladis-rd-centre/content_46.html": "I was lucky enough to visit pladis’s Research and Development hub in High Wycombe and to sample some of their latest biscuits. It was my first ever visit to a biscuit factory and I was fascinated to see all the machines and learn about their processes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_refresh-the-marketplace/content_55.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_islamophobia-awareness-month/content_62.html": "Over 70% of young Muslims in the UK who say they experience mental health struggles, also say they have been victims of Islamophobia.\n42% of Mosques experienced a religiously motivated attack in the last 3 years and of those, 83% have been attacked at least once a year\n59% of all articles associate Muslims with negative behaviour.\nThis ‘Islamophobia Awareness Month’, I have written to the Government to express my deep concern about the growing threat of Islamophobia in our country and to urge them to take decisive action by formally recognising Islamophobia as a distinct and unacceptable form of hatred.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_thank-you-for-electing-me/content_36.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_small-business-saturday-in-marlow-bottom/content_13.html": "It was fantastic to spend some time getting to know some small business owners around Marlow Bottom this afternoon.\nOften small businesses feel neglected by government, not given the respect their sheer economic weight deserves.\nLabour won’t let that happen.\nWith our new plan, a future Labour government will hardwire the voice of small business into everything we do.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_farm-visits/content_61.html": "I was delighted to visit several farms across the constituency today.\nIt was a lovely day despite the weather. We also had a lovely lunch at ‘The Barn’ in Turville Heath.\nThank you to all the farmers who took the time to show me around.\nI was delighted to visit several farms across the constituency today.\nIt was a lovely day despite the weather. We also had a lovely lunch at ‘The Barn’ in Turville Heath.\nThank you to all the farmers who took the time to show me around.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_small-business-saturday-uk/content_25.html": "I met with a group of small businesses in High Wycombe at The Vanilla Pod Cafe Patisserie on White Hart Street on Small Business Saturday UK. This is a chance to celebrate local businesses and to work with them to build a fairer, greener and more prosperous future for Britain.\nThe small businesses shared their concerns about shoplifting and anti-social behaviour in Wycombe town centre as well as the impact of the council’s improvement works in White Hart Street. I answered their questions on a range of topics, including the government’s plans to permanently lower business rates for small shops and pubs, paid for by asking online giants to pay their fair share of tax.\nThere is still time for businesses to share their thoughts on High Wycombe’s town centre with me.\nWe have some brilliant small businesses in Wycombe from gift shops to cafes to pharmacists. Which is your favourite?",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_medical-aid-for-palestine-caabu-event/content_111.html": "I recently attended an event in Parliament organised by Medical Aid for Palestinians and Caabu (Council for Arab-British Understanding).\nKhaled, a doctor from MAP, who was recently working in Gaza spoke movingly about his experience of trying to treat people who were likely to die from treatable diseases and treating children injured by the bombing.\nI had the privilege of meeting the Palestinian Ambassador Dr Husam Zumlot who spoke about the urgent need for a ceasefire, the suffering of the Palestinian people and deteriorating humanitarian crisis.\nWe need an urgent ceasefire. The violence must stop. Too many lives have been lost. Urgent aid needs to reach people safely in Gaza.\nThe inalienable right of the Palestinian people to an independent and sovereign state must be honoured.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_another-fantastic-wycombe-pride/content_114.html": "Although not my first time at Wycombe Pride, it was my first time attending as the local MP.\nFighting for equality is in my DNA, it’s why I became an MP and I will continue to always fight for a fairer society.\nThanks to everyone involved.\nAlthough not my first time at Wycombe Pride, it was my first time attending as the local MP.\nFighting for equality is in my DNA, it’s why I became an MP and I will continue to always fight for a fairer society.\nThanks to everyone involved.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_redevelopment-of-the-chilterns-shopping-centre/content_78.html": "Businesses and constituents have contacted me about Dandara Living’s plans to redevelop the Chilterns Shopping Centre to provide much-needed housing.\nI was interested to hear from Dandara Living’s Managing Director Edward Butler about how they plan to conserve listed buildings and overcome concerns about flooding, anti-social behaviour and parking.\nThe government is committed to building 1.5 million new homes and I look forward to working with Dandara and other stakeholders to tackle the acute housing shortage in Wycombe.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_about-emma-reynolds/content_3.html": "It is a huge honour to be elected as the MP for Wycombe, the first Labour MP here since 1951. I would like to thank all those who voted in the general election and I promise to represent all my constituents to the best of my ability.\nFor our local area, I will campaign for good local public services, policies that tackle our climate emergency, an affordable, warm, decent home for local families in an area where they feel safe and every child growing up here to fulfil their potential, with good schools and teachers nurturing their interests.\nThe last Labour government transformed the NHS, brought down waiting times and delivered record levels of satisfaction. This Labour government will rebuild our NHS so that it doesn’t leave people stranded, waiting hours for an ambulance or waiting too long for a standard operation.\nIt is a huge privilege to be appointed by the Prime Minister to serve as the new Pensions Minister, working across the Treasury and the Department of Work and Pensions. I am leading a Pensions Review to ensure better retirement incomes for future pensioners. However, I want to reassure my constituents that, despite my Ministerial role, you will continue to be my priority.\nTell me your views\nWhichever party you usually vote for, I want to hear from you – please do get in touch, it would be great to have a conversation with you.\nLike to help?\nIt’s not just canvassing and leaflet delivery – there are lots of ways you can get involved in our work. Please contact us to chat about how you might be able to help.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_prime-minister-of-st-vincent-and-the-grenadines/content_86.html": "I had a fantastic evening meeting with Ralph Gonsalves, the Prime Minister of St Vincent and the Grenadines, at Hilltop Community Centre.\nHigh Wycombe has the biggest Vincentian diaspora in the UK and the second largest diaspora in the world. Many came in the 1950s and 1960s to work in the furniture-making industry and other sectors too.\nThe evening was a great celebration of the community’s contribution to our business and society. The PM also reminded us that currently many Vincentians still come to the UK to work in our NHS and they help us fill shortages.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_allocation-of-the-11-8m-future-high-streets-fund-in-wycombe/content_59.html": "This is the email I have sent to Martin Tett, Buckinghamshire Council Leader about the allocation of the £11.8m Future High Streets Fund.\nDear Martin,\nThank you for your letter outlining how the Future High Streets Fund has been allocated. I have a number of urgent questions for clarification.\n- How did the Council arrive at the decision to spend the £11.8m Future High Streets Fund in the ways outlined in your letter?\n- Were elected Wycombe councillors and the High Wycombe Town Committee meaningfully consulted on these plans prior to final decisions being made?\n- Was there any attempt by the Council to seek views from the public about how to most effectively spend £11.8 million of public money on our high street?\n- Can you clarify please how much taxpayer money has been given to Primark and Tesco for the purposes outlined in your letter?\n- How much taxpayer money is being spent on re-allocating the archives? How does this align with the stated purpose of the Future High Streets Fund to renew and reshape town centres and high streets to drive growth?\n- I note that a considerable amount of money has been spent on purchasing properties on the high street. How will rental income derived from these properties be spent and will it be reinvested in the high street in High Wycombe? What will happen to the proceeds of this property when it is sold by the Council? Will it be reinvested in the high street in High Wycombe?\n- Thank you for your offer to meet. Will you come to High Wycombe at the earliest opportunity to meet with me, elected Councillors and the Town Committee to discuss the allocation of the funding and the consultation processes around this use of taxpayers’ money?\nYours sincerely\nEmma Reynolds MP",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_castlefield-school-and-beechview-academy/content_47.html": "I really enjoyed visiting Castlefield School and Beechview Academy for UK Parliament Week. This is an annual event spreading the word about what Parliament is, what it does and how you can get involved.\nMore than 20 schools and community groups in Wycombe have taken part, including local Girlguiding and Scouting units.\nI answered some tough questions from the Castlefield school councillors about my role as an MP. I loved reading letters about democracy from Year 4 children at West Wycombe School.\nIt’s great to see so many young people getting involved in our democracy.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_international-firefighters-day/content_108.html": "Thank you to Wycombe fire station for welcoming me on International Firefighters Day.\nThank you to all firefighters in Wycombe, UK and around their world for their bravery and dedication to protecting us and saving lives.\nThank you to Wycombe fire station for welcoming me on International Firefighters Day.\nThank you to all firefighters in Wycombe, UK and around their world for their bravery and dedication to protecting us and saving lives.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_chiltern-rangers-cic/content_97.html": "It was fascinating to learn about the work of the Chiltern Rangers CIC from Managing Director John Shaw.\nThe Chiltern Rangers is a Community Interest Company that manages a dozen nature reserves in the Wycombe area. They involve people of all ages and all abilities in conservation projects, which improve their health and well-being, as well as tackling the decline in nature and biodiversity.\nLooking for something to do with the kids over half term? Why not check out their volunteering opportunities.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_carols-by-candlelight-at-st-peters/content_18.html": "It was a privilege to read the first lesson at the Carols by Candlelight service at St. Peter’s Church, Loudwater this evening. The choir sang beautifully, and all visitors were made to feel very welcome.\nReverend Danny Rogers and his team put on an impressive range of activities for the community, including a youth club and the Young at Heart Seniors group. This was a lovely way to begin the count down to Christmas.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_all-spring-media-ltd/content_66.html": "It was great to hear about the exciting opportunities for Wycombe’s young people in the film and TV industry from Martina Porter, Managing Director of training provider All Spring Media Ltd.\nI look forward to hearing more about Bucks Screen’s plans to set up a film and TV hub and bring more creative jobs to our area.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_buckinghamshire-business-first/content_10.html": "I was delighted to meet with Buckinghamshire Business First and their members from across the county to discuss how the new government will bring down the barriers to growth for local businesses.\nThe Labour government will unlock the potential of businesses of all sizes with our ambitious plans on skills (setting up Skills England), tax predictability (we will be setting out a business tax roadmap), planning (see our NPPF consultation), a new small business strategy and industrial strategy –",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_wycombe-friends-of-the-earth/content_76.html": "I was pleased to meet with representatives from Wycombe Friends of the Earth to discuss air and water pollution, renewable energy development, and how the Government is delivering on climate action.\nWe also discussed the Government’s Warm Homes Plan, and Great British Energy, which is backed by over £8.3 billion over the Parliament.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_oak-lodge-skills-hub/content_81.html": "It was very interesting to visit Oak Lodge Skills Hub in High Wycombe and meet their team. They provide day care for adults with additional needs and help them to develop practical life skills. We discussed their plans to increase their provision and open a new local facility.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_buckinghamshire-council-elections/content_24.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_my-appointment-as-minister-for-pensions/content_84.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_constituency-garden-of-remembrance/content_80.html": "I planted a remembrance tribute at the Constituency Garden of Remembrance at the Palace of Westminster (Houses of Parliament). I was asked to dedicate it to an individual, regiment or community from the constituency who died defending our democratic freedoms and way of life. With help from the Royal British Legion, I chose to remember:\nKenneth Richard Bowen, Private 1439634S, 2nd BATTALION GLOUCESTERSHIRE REGIMENT.\nHe lived in Abbey Barn Rd, High Wycombe and was a cabinet maker. In the Normandy landings in 1944, Kenneth landed in the second wave at Gold Beach. He was sadly killed in action on 10 August 1944 aged 20 years at Thury-Harcourt, near Caen. He is buried in the Bayeux War Cemetery.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_labour-is-creating-apprenticeships/content_33.html": "Labour is creating apprenticeships for tens of thousands of young people by listening to businesses and taking the common-sense decision to cut red tape on English & maths requirements.\nBacked by the CBI, AELP & Institute of Directors, we’re driving growth & unlocking opportunity.\nLabour will harness the talents of young people through ambitious apprenticeship reform.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_high-wycombe-ambulance-station/content_95.html": "I enjoyed visiting the High Wycombe Ambulance Station and meeting the staff of the South Central Ambulance Service NHS Foundation Trust , which receives up to 3,000 calls a day from members of the public. They are advocating for greater public awareness about when it is appropriate to call an ambulance and when people should turn to other services, including NHS 111.\nAfter 14 years of Conservative neglect, the ambulance service is struggling with staff retention, low morale, and rundown vehicles and buildings. As part of the autumn budget, the government is investing £25.7 billion in fixing the NHS, our most valued public service.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_cressex-community-school-2/content_58.html": "I really enjoyed visiting Cressex Community School to talk to the GCSE Citizenship students about the role of an MP. I answered some thoughtful questions about how I represent my constituents and how I hope to improve Wycombe. It is brilliant to see young people so engaged in their education and our democracy.\nI was pleased to connect Cressex Community School with local company Hansford Sensors – Excellence in Vibration Monitoring who are interested in offering work experience to Wycombe’s young people.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_pakistan-independence-day/content_14.html": "Fantastic evening celebrating Pakistan Independence Day. Thanks for inviting me along to be a part of the celebrations.\nI had the privilege of working in Pakistan when I was younger, a beautiful country! I look back at my time there with fond memories.\nThanks to those who organised the event, a truly wonderful evening.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_rachel-reeves-the-path-to-a-labour-government-runs-through-wycombe/content_27.html": "I was delighted that Rachel Reeves, the Shadow Chancellor, found the time to join me and our local activists to help launch my campaign for the General Election.\nIn her rousing speech, Rachel reminded us that people across the country are ready for change.\n“After 14 years of failure under the Conservatives, it’s time for a fresh start here in Wycombe with Emma Reynolds, and a Labour government in Westminster… Emma has the skills and experience to deliver positive change for Wycombe.”\n“Labour has a plan to deliver more jobs, lower bills, and a growing economy that will benefit the whole country… Only a vote for Emma Reynolds here in Wycombe will help us get the country’s future back.”\nWe can win here in Wycombe for the first time since the 1945 election. That election brought about the great reforming Labour government that founded the NHS. Rachel was right to point out that the road to a Labour Government runs through Wycombe.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_winter-fuel-allowance/content_49.html": "The last government wrecked our economy, leaving a £22bn black hole in the public finances. There were no easy options, but not acting was not an option. Keir Starmer has spoken about a decade of national renewal to get our public services back on their feet and in particular to bring down NHS waiting times, because he knows, as the country knows, it will take time to repair the damage left by the Conservatives.\nThese are not the choices the Chancellor wanted to make or expected to make, but they are the right choices in the circumstances. By taking the tough decisions now to protect the public finances we can begin the process of change. By introducing means testing we can make sure the least well-off pensioners still receive the help they need.\nWe are absolutely determined to do everything possible to protect the poorest pensioners, and to increase the uptake of pension credit which the Tories failed to do for more than a decade. We have joined forces with local authorities and charities in a drive to encourage those eligible to apply for Pension Credit, this will ensure low-income pensioners continue to receive the Winter Fuel Payment.\nAs I have underlined in Parliament today, those pensioners on low incomes but above the pension credit threshold should be supported by our council (through the Household Support Fund which is the Government has extended), will also benefit from the Government’s commitment to the triple lock and should apply for the Warm Homes discount from October.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_a-budget-to-fix-the-foundations-and-deliver-change/content_91.html": "I was proud to be part of the Treasury team standing alongside our first woman Chancellor Rachel Reeves Reeves who delivered the first Labour budget for 15 years.\nI was proud to be part of the Treasury team standing alongside our first woman Chancellor Rachel Reeves Reeves who delivered the first Labour budget for 15 years.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_community-impact-bucks/content_50.html": "I met with representatives from Community Impact Bucks, a local charity which helps people and organisations to get involved in voluntary action in Buckinghamshire and to support those most in need in our communities.\nI would like to congratulate Community Impact Bucks on their new website https://communityimpactbucks.org.uk/. It is a one stop shop for volunteers, charities, and residents to get the help that they need. I was interested to hear about the services that Community Impact Bucks provides, including the High Wycombe Transport Scheme, which helps vulnerable members of the community with transport to medical appointments and social activities.”\nActing CEO Helen Archer for Community Impact Bucks said:\nI was pleased to showcase our new website to Emma Reynolds and to discuss our work helping to build strong and vibrant communities in Buckinghamshire.\n“It was great to talk about our volunteering platform, Volunteer Bucks, where people can search for volunteering roles by interest, location and availability.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_my-letter-to-steve-baker-to-address-the-unacceptable-comments-made-by-frank-hester/content_60.html": "Dear Steve,\nI hope you are well. I know that you take seriously the security of politicians. I wanted to thank you for talking to one of my colleagues on the Labour benches about the security of MPs and candidates recently.\nAs a General Election campaign approaches and political parties begin preparations, I am writing to you to seek assurances that your campaign and local Conservative Association will not use funds given to by the Conservative Party which have be donated by Frank Hester.\nAs you will know this week, Mr Hester’s abhorrent racist views became clear. He is reported to have said that he wanted to shoot an elected Member of Parliament. This falls well below the standard of behaviour that Wycombe residents expect and it is right that no party of government uses funds donated by this man.\nThe Guardian reported that Frank Hester said “[The executive] and Diane Abbott need to be shot”, and that “you see Diane Abbott on the TV, and […] you just want to hate all black women because she’s there, and I don’t hate all black women at all, but I think she should be shot.”\nIt was also reported that Frank Hester said of a female executive from a separate company that “it would be much better if she died. She’s consuming resource. She’s eating food that other people could eat.”\nThe Conservative Party has taken £10,000,000 in donations since February 2023 from Frank Hester or The Phoenix Partnership (TPP) where he is founder and sole shareholder.\nWhile – in good faith – we assume that the Conservative Party was not aware of Mr. Hester’s views at the time of receiving these donations, it is only right that you and your party take seriously these new revelations.\nYet, the PM has refused to return the money.\nThis now means it is your responsibility to refuse support from your party if it is funded by Frank Hester’s money.\nAccepting and using that money can only be treated as an condoning his deeply disturbing comments. Will you take responsibility and turn down this support? I will be publishing this letter in the public interest.\nKind regards\nEmma",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_respect-for-shop-workers-week-at-tesco/content_99.html": "During Respect for Shop Workers Week, I was pleased to meet staff at Tesco’s Loudwater store. We discussed planning for Christmas, Tesco’s excellent pension arrangements, retail crime and abuse of shop workers.\nIn the King’s Speech, the government set out plans to make an assault on a shopworker a specific offence. The government’s plan to repeal the £200 threshold for the offence of low-value shoplifting shows its commitment to retail businesses.\nI was delighted to meet Bev who has worked for Tesco since 1989! I was also interested to hear about how Tesco are working with charities, including the One Can Trust, Wycombe Food Hub, The Trussell Trust and FareShare, to support those on low incomes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_sv2g/content_109.html": "It was fascinating to hear from CEO Jacqueline Roberts about the important work of the St Vincent and the Second Generation charity SV2G.\nSV2G will receive the King’s Award for Voluntary Service (KAVS) for their arts and heritage projects including steelpan lessons. Equivalent to an MBE, KAVS is the highest Award given to local voluntary groups in the UK, and they are awarded for life.\nHigh Wycombe has the largest population of Vincentians in the UK and they make an important contribution to our community.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_tackling-knife-crime-in-wycombe/content_67.html": "On Wednesday 12 March, representatives of Wycombe’s faith communities, senior leaders of Bucks New University and Thames Valley Police, were brought together by Imam Haseeb Jahangir, who leads the chaplaincy at the university, to discuss how to tackle knife crime in Wycombe.\nAs part of our Safer Streets mission, the Labour government has set out plans to crackdown on knife crime and halve knife offences in a decade. I welcome Imam Haseeb’s initiative to bring together Wycombe’s faith communities and Thames Valley Police to tackle knife crime our area.\nImam Haseeb said:\nThis was a very productive meeting with many good initiatives. I believe we shall work together for the betterment of our community.\nKaren Adamson, Community and Diversity Officer at Thames Valley Police for Buckinghamshire, said:\nAddressing concerns about drugs and knife crime is vital to ensuring the safety of all our communities. We encourage reports from everyone and treat all information with the utmost seriousness, taking appropriate action where necessary.\nYou can submit reports through the Thames Valley Police website, or by calling 999 in emergencies and 101 for non-emergency enquiries. Additionally, you can locate your local neighbourhood team via the Your Area section on our website.\nFor those who wish to remain anonymous, information can be shared confidentially through Crimestoppers on 0800 555111.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_drop-in-event-at-ymca/content_89.html": "I attended a multi-agency drop-in event at the YMCA that connected YMCA residents with charities and organisations who provide a range of invaluable support to vulnerable people in Wycombe. I spoke with many outstanding organisations including Hope After Harm, The Hepatitis Trust, the aMAZing Therapy Centre CIC, Mind, and Brook.\nIt was fantastic to speak to so many organisations from across Wycombe and Buckinghamshire who are so dedicated to supporting individuals in vulnerable situations. The event provided a great opportunity to learn about residents’ experiences at the YMCA, and the support that is also offered by staff on-site and via the outreach team.\nYMCA Supported Housing Officer Harry Carter said:\nWe wanted to host this event to help connect our residents to a wide range of professional support. We felt it was very positive for both professionals and residents in the pursuit of developing people’s lives.\nMarian Kennedy, Founder and Joint CEO of aMAZing Therapy Centre CIC said:\nLast year, we delivered one-to-one counselling to residents at the YMCA, and thanks to a grant from Heart of Bucks, we’re delighted to be returning this year to deliver a further 160 hours of support. The need remains high, and we continue to receive overwhelmingly positive feedback from both residents and staff about the impact on mental health, confidence, and wellbeing.\nIt was a real pleasure to meet Emma at the Multiagency Drop-in Session at the YMCA in High Wycombe on Friday 4th April. It was lovely to connect and share a little about the work we’re doing locally.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_category_policing/content_85.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_my-appointment-as-economic-secretary-to-the-treasury/content_94.html": "I am honoured to be appointed by the Prime Minister as Economic Secretary to the Treasury. I look forward to working with the Chancellor Rachel Reeves to boost the critical role of financial services in driving growth across the country and delivering vital services to people.\nAlongside my ministerial duties, I will continue to work tirelessly on behalf of my constituents. Since being elected last year, I have been privileged to meet so many local residents, businesses and community groups, and look forward to continuing that work.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_contact-me/content_41.html": "It is a honour to be elected as the Member of Parliament for Wycombe.\nMPs can only raise concerns on the behalf of their own constituents so please make sure to include your full address in any correspondence. If you are unsure whether I am your Member of Parliament, you can check to see if you live in the Wycombe constituency here by entering your postcode.\nIf you are a constituent, please contact me via email at emma.reynolds.mp@parliament.uk. You can write to me at Emma Reynolds MP, House of Commons, London, SW1A 0AA.\nPlease review my Office Standards Policy.\nLabour, as a political party, has a key role to play in the democratic process. Data protection law recognises that it’s in the public interest for political parties to collect and process personal information, including about political opinions. We also collect, with consent, contact information that people freely provide to us, such as email addresses and telephone numbers.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_video-international-womens-day-at-wycombe-high-school/content_44.html": "I had a great time celebrating International Women’s Day at Wycombe High School. The theme of this year’s International Women’s Day is accelerating action towards gender equality.\nI was pleased to give an interview to WHTV, the UK’s only student-led school TV channel. The students posed some challenging questions about how to get more women into senior positions in business and politics.\nMrs Nicola Renyard, Headteacher at Wycombe High School, said:\nWe were delighted to welcome Emma Reynolds, the MP for Wycombe and Economic Secretary to the Treasury, to Wycombe High School as part of our National Careers Week activities.\nHer visit was particularly fitting ahead of International Women’s Day, with this year’s theme of ‘Accelerating Action’.\nAt Wycombe High, we are committed to inspiring our students to aim high and achieve their ambitions, and this visit was a fantastic opportunity for our Politics students to gain valuable insights into public life and the world of politics.\nI’m also incredibly proud of our student-led TV channel, Wycombe High TV, who conducted an excellent interview with Ms Reynolds – I encourage everyone to watch it!",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_tackling-speeding-concerns/content_73.html": "Since I was elected, numerous residents have raised concerns me about speeding and illegal parking in High Wycombe. As a mother, I deeply understand the importance of addressing these issues to ensure the safety of our children and the community as a whole.\nAfter receiving so many concerns, I initiated a local survey to identify areas with high instances of speeding offenders, illegal parking and untaxed vehicles. Thank you to those who participated; your input has been invaluable in informing my reports to the local police.\nI am pleased to see that Thames Valley Police has taken firm action. I will continue to collaborate with them to address these issues in our community.\nInspector Gehnich of Thames Valley Police said:\nThames Valley Police are committed to listening to our Communities and taking positive action to resolve issues. We recognise the negative impact speeding, illegal parking and untaxed vehicles have on our roads.\nWe have been working closely with Emma Reynolds MP’s team to identify issues and using results from our community polls to direct our Neighbourhood resources to the areas where they are needed most.\nWe will continue to focus on these issues, with upcoming speeding and joint DVLA operations planned. We share all of our work on our Facebook page, which highlights the need to keep reporting these issues through your Councillor, to Emma Reynolds MP’s team and on the Thames Valley Police website.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news/content_2.html": "Delivering on GP improvements\nOver 1,500 extra GPs recruited to help end ‘8am scramble’ and bring back the family doctor in Wycombe.\nDrop-in event at YMCA\nI attended a drop-in event that connected YMCA residents with charities and organisations who provide a range of invaluable support.\nBreakfast clubs roundtable\nI hosted a roundtable of school leaders, parents, and providers to understand the impact of breakfast clubs.\nHigh Wycombe Ambulance Station\nThe local ambulance service is advocating for greater public awareness about when it is appropriate to call an ambulance.\nBreakfast club at Highworth Combined School\nThe staff explained how breakfast clubs support parents to work, and the children told me how much they enjoy attending breakfast club.\nContinue Reading Breakfast club at Highworth Combined School\nChildren’s community campaigns\nI visited High Wycombe Church of England Primary School to hear about the children’s community campaigns.\nAttack on vulnerable adults at the Wrights Meadow Centre\nI condemn the appalling attack on the members of High Wycombe Gateway Club.\nContinue Reading Attack on vulnerable adults at the Wrights Meadow Centre\nCommunity Iftar at The Hive\nThis was an incredible opportunity to learn about the holy month of Ramadan and hear from voices within the community.\nCommunity Iftar at Jubilee Road Mosque\nMany thanks to everyone at Jubilee Road Mosque for their warm welcome and a wonderful community Iftar.\nTackling knife crime in Wycombe\nLeaders of Wycombe’s faith communities, BNU and TVP met to discuss how to tackle knife crime in Wycombe.\nVideo: International Women’s Day at Wycombe High School\nThe students asked insightful questions about how we can get more women into top roles in business and politics.\nContinue Reading Video: International Women’s Day at Wycombe High School\nPlans to redevelop Wycombe hospital\nI have offered my steadfast support. for the plans to redevelop our hospital. We must not lose any additional services.\nCommunity Impact Bucks\nI would like to congratulate Community Impact Bucks on their new website – a one stop shop for volunteers, charities, and residents.\nFunding for community-based Early Support Hubs\nHundreds of young people across Wycombe will receive bolstered support with their mental health this year.\nContinue Reading Funding for community-based Early Support Hubs\nBuckinghamshire Business First’s spotlight on skills\nI met with more than 15 local employers at an event organised by BBF to examine how the Government’s skills agenda can drive economic growth.\nContinue Reading Buckinghamshire Business First’s spotlight on skills\nTaking back our streets\nThe Government’s flagship Crime and Policing Bill represents the biggest package of new laws on crime and policing for decades.\nOutstanding careers guidance at RGS\nI enjoyed a tour of Wycombe’s Royal Grammar School and learned about school’s award-winning careers programme.\nVisit to Seeleys House\nI have written to Buckinghamshire Council to share my concerns about the impact of the potential closures of services like Seeleys House.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_finings-wood-community-group/content_82.html": "It was great to meet with Finings Wood Community Group in Lane End.\nTogether we braved the British weather and took a walk through the woods where I enjoyed hearing more about the group’s commitment to protecting nature for future generations.\nThe group is campaigning to sustainably protect, manage and restore this ancient woodland for the community and for nature.\nDo you have a local cause or community project you’d like to share with me? Email me at emma.reynolds.mp@parliament.uk",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_taking-back-our-streets/content_106.html": "Crime and Policing Bill\nIntroduced in Parliament on 25 February, the Government’s flagship Crime and Policing Bill represents the biggest package of new laws on crime and policing for decades.\nLabour’s comprehensive set of new measures will tackle antisocial behaviour, shop theft and street crime head on, giving the police and our communities new powers to take back town centres from thugs and thieves.\nThe Bill also includes measures to address the most serious violence and highest-harm offences such as knife crime, violence against women and girls, cybercrime, child sexual abuse, and terrorism.\nThis Labour Government will take back our streets and town centres, restore respect for law and order, and give the police and local communities the support and tools they need to tackle local crime.\nWhat is the Labour government doing to address crime?\nThrough this Bill, Police will be given stronger powers to tackle mobile phone thefts – no longer needing a warrant to search premises where stolen items have been electronically located, speeding up investigations and increasing the chances of recovering stolen goods.\nWe will protect our high streets by ending the effective immunity for anyone caught shoplifting goods below £200 and introducing a new criminal offence to better protect retail workers from assault.\nWhat is the Labour government doing to address antisocial behaviour?\nWe will introduce Respect Orders to tackle the worst ASB offenders, and stamp out issues such as public drinking and drug use, to ensure that our communities are free from harm and nuisance.\nPolice will be given new powers to immediately seize vehicles that cause havoc in our communities, allowing them to deal with the scourge of off-road bikes in public parks and dangerous e-scooters on pavements.\nWhat is the Labour government doing to help our high streets?\nWe will protect our high streets by ending the effective immunity for anyone caught shoplifting goods below £200 and introducing a new criminal offence to better protect retail workers from assault. In the year ending September 2024, police recorded one million incidents of anti-social behaviour. In the same period, they recorded over 490,000 shop theft offences, an increase of 23 per cent over the previous 12-month period. Instances of theft from a person increased by 22 per cent, while there were also over 55,000 recorded offences involving a knife or sharp instruments.\nWhat is the Labour government doing to prevent violence against women and young girls?\nThis Labour government has set out an unprecedented ambition to halve violence against women and girls within a decade. Achieving this mission will require a transformation in the way we work together on this issue across Government, public services, charities and the private sector, and we will use all of the levers available to us to deliver it. The Bill will treat violence against women and girls as the national emergency it truly is, with tougher action against perpetrators and better protection for victims including strengthening Stalking Protection Orders and introducing a new criminal offence for spiking.\nWhat is the Labour government doing to address child sex abuse?\nThe Government will implement a flagship recommendation of the Independent Inquiry into Child Sexual Abuse by creating a new duty to report child sexual abuse, as well as increased sentencing for those who organise child grooming.\nWhat is the Labour government doing about local policing?\nTo help rebuild confidence in police standards, Chief Constables will be supported to remove those who are unfit to serve by allowing them the right to appeal the result of misconduct boards to the Police Appeals Tribunal.\nMeasures in the Bill will be backed up by the recruitment of 13,000 extra neighbourhood police officers, with a named officer in every community. We have already announced funding of £200 million to kickstart delivery of these roles, as part of an overall police funding increase of up to £1.1 billion compared to the 2024-25 settlement under the Tories.\nThe Crime and Policing Bill sits at the heart of the Government’s Safer Streets Mission and Plan for Change. It will help tackle the crimes that matter most to communities but have been ignored for too long after 14 years of Tory dereliction on law and order.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_high-wycombe-delivery-office/content_52.html": "Really enjoyed meeting Royal Mail staff and to find out what goes on at their High Wycombe Delivery Office in the town centre. I also joined postie Mark to deliver letters and parcels off Amersham Hill. He described how the job has changed over the years and gave me some tips on how to deliver parcels!\nCWU Union Rep Chris explained his role as a mental health ambassador and workplace coach and told me how the sorting office is like ‘one huge family’.\nI was pleased earlier this week to speak at the launch of Royal Mail’s new pensions scheme in my role as Pensions Minister. Royal Mail are the first UK employer to forge ahead with Collective Defined Contribution pensions.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_newsletter/content_8.html": "Sign up for my e-Newsletter\nPlease subscribe to my email newsletter so we can keep you up to date with my activities in parliament and our work in and around Wycombe .\nBy completing this form, you are consenting to receive emails from Emma Reynolds MP and/or Wycombe Labour Party. We will not use the data you submit for any other purpose. You can unsubscribe at any time. See our privacy policy.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk/content_1.html": "EMMA REYNOLDS\nWycombe’s Labour MP\nThank you\nIt is an honour to be elected as your MP. I am keen to represent you regardless of who you voted for. I am determined that my team and I will give constituents the very best service.\nThe Tories left the public services on their knees and a £22 billion blackhole. The new Labour government has had to make some tough choices but we remain focused on driving economic growth and improving public services.\nLatest News\nDelivering on GP improvements\nOver 1,500 extra GPs recruited to help end ‘8am scramble’ and bring back the family doctor in Wycombe.\nDrop-in event at YMCA\nI attended a drop-in event that connected YMCA residents with charities and organisations who provide a range of invaluable support.\nBreakfast clubs roundtable\nI hosted a roundtable of school leaders, parents, and providers to understand the impact of breakfast clubs.\nHigh Wycombe Ambulance Station\nThe local ambulance service is advocating for greater public awareness about when it is appropriate to call an ambulance.\nBreakfast club at Highworth Combined School\nThe staff explained how breakfast clubs support parents to work, and the children told me how much they enjoy attending breakfast club.\nContinue Reading Breakfast club at Highworth Combined School\nChildren’s community campaigns\nI visited High Wycombe Church of England Primary School to hear about the children’s community campaigns.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_my-name5-doddie-foundation/content_51.html": "I was pleased to discuss the important work of the Motor Neurone Disease charity, My Name’5 Doddie Foundation, with constituents Claire Whatman and Sean McGrath.\nMotor Neurone Disease affects 1 in 300 people in the UK and is the disease that medical professionals fear the most. My name’5 Doddie foundation was set up by the former Lions and Scotland rugby international, Doddie Weir.\nThe charity has raised an impressive £18 million for MND research and is supporting a trial to look at the effectiveness of the drug Tofersen in slowing the progression of the disease.\nI look forward to hearing more about how the charity is making their vision for a world free from MND a reality.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_funding-for-for-community-based-early-support-hubs/content_22.html": "I welcome the news that hundreds of young people across Wycombe will receive bolstered support with their mental health this year, thanks to £180,500 of funding for community-based Early Support Hubs.\nEarly Support Hubs provide open access, drop-in mental health services that assist young people aged 11-25 with a range of issues such as exam worries, financial difficulties, jobs and relationships, helping to prevent more severe mental illness without the need for a referral or doctor’s appointment.\n24 hubs up and down the country, including Youth Enquiry Service based in High Wycombe, will receive funding to deliver 10,000 more interventions such as group sessions, counselling, therapies, and specialist support over the next twelve months.\nNHS data shows that 21% of 8- to 16-year-olds have a probable mental health problem, which has increased 7% since 2017.\nEvidence suggests that open-access hubs attract groups that are less likely to engage with traditional NHS or school-based services, including ‘older’ young people and those from an ethnic minority background.\nThe evidence collected from the evaluation of the Early Support Hubs programme will be one of the key initiatives used to support the delivery of future open access mental health support, which the government is committed to providing through Young Futures Hubs.\nThe learning will inform the government’s ambitions for community mental health and wellbeing support for children and young people. Expanding community mental health support will complement wider reforms to make the NHS fit for the future and break down barriers to opportunity for young people.\nThe government made a clear commitment in its manifesto to improve the mental health of young people through specialist support and earlier intervention. Today’s investment is a positive step towards supporting the mental health of children and young people. This continued funding will have a significant positive impact on many of my constituents.\nMental Health Minister Baroness Merron said:\nToo many children and young people are waiting too long to access the mental health care they need – worrying about things like exams, money, jobs and relationships – which can compound their illness and limit their potential.\nEarly Support Hubs are a fantastic way local communities can support young people with their mental health at an early stage, before they experience more severe mental illness, and without the need to join a waiting list.\nAs we reform the NHS as part of our Plan for Change, this government is committed to shifting more healthcare into communities and giving mental health the focus and funding it deserves.”",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_privacy-policy/content_21.html": "I am the MP for Wycombe Constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data.\nData collection and use\nThe office of Emma Reynolds MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nData storage\nWe use the Caseworker MP system to manage constituents’ casework and queries. This system is GDPR-compliant. It has been populated with the full electoral register for the constituency, to which MPs have a legal entitlement, even where you have asked not to be contacted.\nWe use MailChimp to manage email newsletters, including the subscribe and unsubscribe processes. It too is GDPR-compliant.\nWhom I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for Wycombe Constituency, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary, although I may retain information about closed cases in the event that you contact me again for help.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual. You may choose to reject cookies when you visit the site.\nLinks to other websites\nThis website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n- Obtain copies of the personal information I hold about you (known as a “subject access request”)\n- Request that I correct or update any personal information held about you\n- Ask that we erase or restrict the way in which I use your information\n- Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications form me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact:\nData Protection Officer\nOffice of Emma Reynolds MP\nHouse of Commons\nLondon\nSW1A 0AA",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_community-iftar-at-the-hive/content_29.html": "It was an honour to attend the Community Iftar at The Hive. This was an incredible opportunity to learn about the holy month of Ramadan and hear from voices within the community, including a very inspiring young woman speaking about what Ramadan means to her. To then join with those present to break their fast and connect as a community was truly special.\nThe event, organised by Imam Haseeb Jahangir (Inter Faith Co-ordinating Chaplain Bucks New Uni), brought together many from other faiths across Wycombe including Rabbi Neil Janes (South Bucks Jewish Community), TJ (Minister at St Annes and St Peters ) and Manjit Singh. Also joined by Councillor Majid Hussain , Aatif Kayyani (The Rye College), Karen Adamson (TVP Wycombe).",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_community-iftars/content_103.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_new-life/content_77.html": "I was delighted to visit the Eden Centre store of New Life, the Charity for Disabled Children.\nNew Life sells surplus stock from well-known high street brands. 100% of their profits help disabled children and their families access much-needed specialist equipment.\nDo visit if you are able to, there are some great bargains to be had and all for a fantastic cause. They’re at 27 Eden Walk, High Wycombe HP11 2AW.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_delighted-to-visit-airflow-developments-in-cressex-business-park/content_72.html": "I was delighted Delighted to visit Airflow Developments in Cressex Business Park. It was really interesting to learn about what they do they and the challenges they face. Like many other businesses I speak to, Airflow Developments shared that the impact of Brexit has been tough on them.\nBusinesses like Airflow Developments are so important to Wycombe, so it was great to be able to take a look around.\nHuge thanks to Alan and Paul for taking the time to talk to me!",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_chiltern-railways/content_54.html": "As a regular commuter, I know how important an efficient train service is.\nI met with Richard Allan, Managing Director of Chiltern Railways, to discuss local concerns and the steps being taken to improve services.\nI look forward to continuing my work with Chiltern Railways to deliver the best rail service for Wycombe.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_shri-meenakshi-amman-temple/content_23.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_childrens-community-campaigns/content_105.html": "I visited High Wycombe Church of England Primary School to hear about the children’s community campaigns. The school follows the Church of England’s Courageous Advocacy programme, which encourages children to speak out on issues of injustice, on behalf of those whose voice is not often heard.\nI was inspired by the children’s passion for improving our community. I enjoyed hearing about Year 5’s campaign to Free the River Wye, making it into a focal point for Wycombe.\nI will pass Year 6’s proposal for improving the safety of the junction in Desborough Road to the leader of Buckinghamshire Council at our next meeting.\nThe younger children were equally impressive, presenting campaigns about saving bees, trees and endangered animals.\nI was also delighted to meet Kai, the winner of my 2024 Christmas Card competition.\nHigh Wycombe Church of England Primary School headteacher, Mrs Hawkins, said:\nAs a school, we are deeply committed to caring for our world and all those who live in it.\nOur Christian vision inspires us to be strong and courageous in making our community a better place.\nOver the past few years, our students have been identifying areas in our local community that need improvement and taking action to become agents of change.\nInspired by figures such as Marcus Rashford and Sir David Attenborough—who have used their voices to drive meaningful change—our students understand that while they may be young, their collective efforts can make a significant impact. This belief made Emma Reynolds’ visit particularly special, as she took the time to listen to their ideas and engage with their projects.\nWe are excited to continue working alongside local leaders, organisations, and our wider community to bring about real and lasting change.”",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_the-holocaust-must-never-be-forgotten/content_113.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_heart-of-bucks-charity/content_34.html": "It was fascinating to hear from CEO Henry Allmand about the important work of the Heart of Bucks charity in its 25th anniversary year.\nHeart of Bucks has awarded more than £17 million to more than 6,000 charities since its first grant in 2000. These include local charities such as the Wycombe Wanderers Foundation , and the Movers and Shakers health and wellbeing group for older people in Castlefield.\nWycombe wards such as Castlefield and Oakridge are some of the most deprived in Buckinghamshire. Through its Together Against Poverty campaign, Heart of Bucks has provided several hundred thousand pounds in crisis grants to individuals and households in Wycombe",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_category_nhs/content_98.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_royal-star-garter/content_90.html": "I really enjoyed visiting the Royal Star and Garter care Home in High Wycombe and meeting the staff and residents. Royal Star & Garter is a charity which provides loving, compassionate care to veterans and their partners living with disability or dementia.\nThis is a beautiful home for people to live in, and I was very impressed with the care it provides, and the high standard of dementia care it has to offer.\nI even joined in with some activities. Read more about my visit.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_paradigm-housing-group/content_104.html": "Interested to meet Matthew Bailes, chief executive of Paradigm Housing Group, and hear about their plans for good quality affordable housing in our area. Paradigm is a charitable organisation and the money that they make goes into building new homes and supporting customers with issues such as mental health. We visited their sites in Clay Hill and Desborough Rd.\nThe government is committed to building 1.5 million new homes and I look forward to working with Paradigm and other stakeholders to tackle the acute housing shortage in Wycombe.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_brigit-phillipson-visit-to-bucks-new-university/content_37.html": "It was brilliant to have the Shadow Education Secretary Bridget Phillipson join me at Bucks New University and afterwards in Downley last week.\nBridget met with staff and students to hear about the amazing work going on with Degree Apprenticeships at BNU.\nBNU needs more government support, but are real leaders in this.\nDefinitely something that all of us in Wycombe can be proud of.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_my-speech-to-the-rotary-club-of-high-wycombe/content_35.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_uncategorised_join-my-team/content_57.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_international-womens-day/content_79.html": "Fantastic event put on by the Women of Wycombe Labour Party last night. It was a privilege to celebrate International Women’s Day with like-minded women from across Buckinghamshire!\nFantastic event put on by the Women of Wycombe Labour Party last night. It was a privilege to celebrate International Women’s Day with like-minded women from across Buckinghamshire!",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_air-league-reception-in-westminster/content_74.html": "I was pleased to meet Wycombe constituent Mubashar Yasin at the Air League reception in Westminster. The Air League is the UK’s leading aviation and aerospace charity. Its mission is to inspire young people by awarding aviation scholarships and CV enhancing opportunities.\nMubashar received an Air League scholarship and has directly benefited from the charity’s provision of educational resources. We spoke about his childhood in High Wycombe, his career journey and his voluntary work for the Air League.\nIt is an honour to be invited to meet constituents at celebratory events.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_delivering-on-gp-improvements/content_9.html": "We all know how important the front door to our NHS is. But when I knock on doors in our community, local residents regularly vent their frustration after enduring the ‘8am scramble’ and the difficulty that they have in getting a GP appointment.\nI promised residents in Wycombe that we would help bring back the family doctor. Landmark new figures show that, thanks to the Labour Government’s action, over 1,500 extra GPs have been recruited since 1st October. I’m delighted to see over 1,500 examples of Labour continuing to deliver on our promise!\nThe increased GP capacity will help fix the front door of the NHS and increase appointments to bring back the family doctor. Bringing back the family doctor and ending the 8am scramble for appointments were key manifesto commitments in the General Election.\nThe news of 1,500 extra GPs recruited comes after the Labour government removed red tape which prevented surgeries from hiring doctors soon after coming into office.\nThe recruitment boost, part of the government’s Plan for Change, will help end the scandal of patients in Wycombe struggling to see a doctor. People will be more readily able to receive the timely care they deserve, helping to shift healthcare from hospitals to the community, easing pressure on local GPs and cutting waiting lists.\nThe Labour Government has also provided the biggest boost to GP funding in years – an extra £889million on top of the existing budget for general practice along with new reforms to free up GPs from red tape and box-ticking targets so they can spend more time caring for patients.\nSince Labour came into power, the Government has delivered over two million extra appointments, meeting its target seven months early, and the waiting list has fallen five months running, down by 193,000.\nHealth and Social Care Secretary, Wes Streeting, said:\nRebuilding our broken NHS starts with fixing the front door. We inherited a ludicrous situation where patients couldn’t get a GP appointment, while GPs couldn’t get a job. By cutting red tape and investing more in our NHS, we have put an extra 1,503 GPs into general practice to deliver more appointments.\nThe extra investment and reforms we have made will allow patients to book appointments more easily, to help bring back the family doctor and end the 8am scramble.\nIt is only because of the necessary decisions we took to increase employer National Insurance that we are able to recruit more GPs and deliver better services for patients. The extra investment and reform this government is making, as part of its Plan for Change, will get the NHS back on its feet and make it fit for the future.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_wycombe-district-swimming-club/content_19.html": "As a keen swimmer, I enjoyed presenting trophies at the Wycombe District Swimming Club‘s annual awards event at the Wycombe Swan Theatre.\nWycombe District Swimming Club promotes the positive effects of swimming for health and fitness and provides opportunities for Wycombe swimmers to progress to the highest levels possible. Former members include Olympic freestyle relay gold medallist Kieran Bird.\nWith more than 700 swimmers from age 7, the club prides itself on being inclusive, offering pathways for everyone – whether in its fitness, development or competitive squads or the Enable Squad for swimmers with disabilities.\nCongratulations to all Wycombe District Swimming Club’s staff, volunteers and swimmers on their impressive achievements.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_cressex-community-school/content_38.html": "I was delighted to visit Cressex Community School.\nThank you to the headteacher, Mr K Shabbir, for giving me a tour. I really enjoyed dropping in on some of the classes and meeting students.\nI was delighted to visit Cressex Community School.\nThank you to the headteacher, Mr K Shabbir, for giving me a tour. I really enjoyed dropping in on some of the classes and meeting students.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_community-iftar-at-jubilee-road-mosque/content_40.html": "Many thanks to the committee and congregation at Jubilee Road Mosque in High Wycombe for their warm welcome and a wonderful community Iftar this evening. Spending time with you in your mosque during the holy month of Ramadan and breaking the fast with you is a very special thing and truly appreciated.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_high-wycombe-christmas-lights/content_65.html": "Fantastic evening at the High Wycombe Christmas lights switch on. It was so well attended! Great to see a wonderful crowd of all different ages enjoying all the various activities (2 stages including Bluey and Bingo and some lovely acts and singing) and lots of local food stalls, local businesses and charities.\nMany thanks to Hwbidco for organising such a wonderful event. I can’t remember the last time I have seen High Wycombe so full of people!",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_international-investment-summit/content_107.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_office-standards-policy/content_75.html": "Office Standards Policy\nI am proud to represent over 70,000 people from the Wycombe constituency. My casework service is supported by two members of staff. We’re a small team of dedicated staff who work hard to support as many people as possible, as quickly as possible.\nThere are occasions when people may act out of character in times of trouble or distress. There may have been upsetting or distressing circumstances leading up to a constituent approaching my office.\nHowever, I will not tolerate unacceptable behaviour nor actions that result in unacceptable or excessive demands on my staff in a way that it prevents them from carrying out their duties effectively. It is these behaviours and actions that I aim to manage under this Policy.\nAggressive or abusive behaviour\nI understand that many constituents are often upset and angry about the issues they have raised with me. If that anger escalates into aggression towards my team, I consider that unacceptable. Any violence or abuse towards my team will not be tolerated. Violence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language (whether verbal or written) that may cause staff to feel offended, afraid, threatened or abused. I will judge each situation individually and appreciate individuals meet with me and my team may be upset. Whilst I accept that those who contact me may feel angry, it is not acceptable to shout or swear at anyone in my office. Unacceptable language is that which:\n- is offensive, derogatory or patronising\n- is discriminatory in any way, including racist, sexist, homophobic or transphobic comments; or\n- makes serious allegations that individuals have committed criminal, corrupt or perverse conduct without any evidence.\nI may decide that comments aimed not at my team but at third parties are unacceptable because of the effect that listening or reading them may have on my team.\nExamples include rudeness, offensive comments, derogatory remarks, making inflammatory statements, or raising unsubstantiated allegations made towards these third parties.\nAll threats against either myself or my team will be taken extremely seriously and if my team feel scared or threatened at any point during a conversation with a constituent, the interaction may be ended at any time and the Police may be contacted.\nUnreasonable demands\nA demand becomes unacceptable when it starts to (or when complying with the demand would) impact substantially on the work my staff carry out on my behalf. Examples of this behaviour include:\n- repeatedly demanding response within an unreasonable timescale,\n- insisting on seeing or speaking to a particular member of staff, when that is not possible,\n- repeatedly changing the substance of a complaint or raising unrelated concerns.\nAn example of such impact would be that the demand takes up an excessive amount of time and in doing so disadvantages other constituents and prevents their own complaint from being dealt with quickly.\nUnreasonable levels of contact\nSometimes the volume, frequency and duration of contact made to my office by an individual causes problems.\nThis can occur over a short period, for example, a number of calls in one day or hour, or frequent and persistent emails on a vast range of issues which take up a disproportionate amount of staff time. It may occur over the life-span of a complaint when a constituent repeatedly makes long telephone calls to us or inundates us with copies of information that has been sent already or that is irrelevant to the complaint.\nI consider that the level of contact has become unacceptable when the amount of time spent talking to a constituent on the telephone, or responding to, reviewing and filing emails or written correspondence impacts on my office’s ability to deal with that complaint, or with other constituents’ complaints.\nHarassment\nMy team has the right to carry out their duties free from harassment or threats of harassment. I ask everyone to respect that my team are delivering a service on my behalf and therefore this may not reflect their own views or preferences.\nExamples of behaviours I consider to be harassment against my office include: • recording telephone discussions and publishing the information online such as through YouTube, Vimeo or Twitter;\n- contacting staff using their personal details or social media presence such as Facebook, Twitter or LinkedIn;\n- publishing personal, sensitive or private information about staff online or other public domains such as noticeboards or newsletters.\nUnacceptable or excessive demands\nA demand becomes unacceptable when it starts to (or when complying with the demand would) impact substantially on the work of my office.\nExamples of this behaviour include:\n- repeatedly demanding a response within a unreasonable timescale,\n- insisting on, or refusing to, speak to a particular member of staff, when that is not possible,\n- repeatedly changing the substance of a complaint or raising unrelated concerns, including “spamming” my office with emails on a vast range of issues.\n- Making repeated and unnecessary contact during the course of us dealing with a complaint or carrying out an investigation,\n- Refusing to accept a decision where explanations for the decision have been provided.\nAn example of such impact would be that the demand takes up an excessive amount of staff time and in doing so disadvantages other constituents and prevents their own complaint from being dealt with quickly.\nRefusal to co-operate.\nWhen looking at a complaint, my office will need to ask the individual who has contacted us to work with us. This can include agreeing with us:\n- the complaint we will look at\n- to provide us with further information, evidence or comments on request, or\n- help us by summarising their concerns.\nSometimes, an individual repeatedly refuses to co-operate or fails to respond to our requests and this makes it difficult for us to proceed. My office will always seek to assist someone if they have a specific, genuine difficulty complying with a request.\nHowever, it is unacceptable to bring a complaint to my office and then not respond to clear and appropriate requests by my team.\nSocial media\n- Any posts containing offensive, expletive or aggressive comments will be deleted and the user blocked from the page. This includes language directed towards myself, my team, other Facebook users or other individuals.\n- If the same content is posted on multiple posts made by the page, this will be considered spam and will be deleted and the user will be blocked from the page.\n- Users posting material on behalf of others who have been blocked will be blocked too.\n- Page admins reserve the right to delete posts that are dishonest, or in bad faith, or in other ways contrary to clean political campaigning\n- Page admins reserve the right to delete posts that are considered inappropriate or irrelevant to the page or the post in question. This includes, but is not limited to: commercial advertising, off-topic discussions or images containing obscenities.\n- Posts containing links to other Facebook pages or external web links that the page admins cannot easily verify as containing appropriate material will be deleted.\n- Facebook users who have been blocked from the page for breaking the page policy rules are done so on a permanent basis.\n- I believe in transparency and I reserve the right to block people who are posting anonymously\nReasonable adjustments\nI understand that some constituents may find it difficult to express themselves or communicate clearly, especially when they are anxious or upset. To do this, we ask that they explain what adjustments they’re looking for and how this will ensure they can access the service my office offers.\nMy office will always consider making reasonable adjustments for a constituent asked to do so. Examples of adjustments we can consider are:\n- we could consider using different methods of communication;\n- providing written communication in large print, coloured text, or in translation;\n- giving clear warnings if conversations become unproductive and allowing constituents to opportunity to modify their behaviour before ending a call.\nHowever, I do not expect my staff to accept being subjected to aggressive, offensive, threatening or abusive actions, language or behaviour.\nI may still use the policy if there are actions or behaviours which are having a negative effect on our staff or our work even where a reasonable adjustment has been made.\nActions I may take\nWhen my office experiences behaviour or demands which are unacceptable, I may consider taking more formal action. The actions I will consider may include the following:\n- Warning the constituent about their behaviour and requesting that the constituent modifies their behaviour in future contact with us.\n- Reporting an individual to the Police.\n- Appointing a specific point of contact for the constituent\n- Communicating only in writing or via a representative• Deciding not to investigate a complaint on the basis that it has been pursued in a way that is unacceptable.\n- Stop all communication with a constituent\n- Restricting or limiting contact\n- Your telephone number and email may be automatically blocked from our systems.\nWhere it is decided that formal action must be taken a note may be placed on our records to this effect.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_what-the-budget-means-for-bucks/content_87.html": "Callum Anderson, MP for Buckingham and Bletchley, Laura Kyrke-Smith, MP for Aylesbury and I wrote to Cllr Martin Tett (Leader of Bucks Council) to share our thoughts on the Budget and what it means for Buckinghamshire Council.\nThe Gateway\nGatehouse Road\nAylesbury\nHP19 8FF5 November 2024\nDear Cllr Tett,Last week the Chancellor of the Exchequer announced measures from Labour’s first Budget in 14\nyears, which have been welcomed by the Local Government Association as a “step in the right\ndirection” and will generate positive impacts for Buckinghamshire.Some of the measures announced include:\n- A £1bn uplift in SEND and alternative provision funding.\n- Increasing core spending for councils by 3.2% in 2025/6, including £1.3bn new grant\nfunding, with at least £600m for social care funding.- Extending the household support fund and discretionary housing payments with an\nadditional £1bn in funding to 2025-26.- £500m to tackle the issue of potholes in Buckinghamshire and across the UK.\n- Continuing the UK Shared Prosperity Fund for a further year, providing £900m to allow\nlocal authorities to invest in local growth.In our manifesto, Labour promised to give councils greater stability, and we are delivering on this\npromise.In particular, the Budget marked an important step in realising the Government’s ambition to\nreform the system that underpins SEND provision. We have been listening to constituents across\nBuckinghamshire and the whole country and have recognised that more needs to be done to give\nevery pupil the education they deserve.There is more to come from The Treasury. Local government funding will be a priority of Phase 2\nof the Spending Review, which is expected to be completed in spring 2025.We are looking forward to working with you to fix public services, deliver economic growth and\nrestore fiscal responsibility. Please do let us know if you would like to meet and discuss what the\nBudget means for Buckinghamshire Council and the services it provides.Kind regards,\nCallum Anderson MP, Laura Kyrke-Smith MP, and Emma Reynolds MP",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_breakfast-club-at-highworth-combined-school/content_20.html": "I visited the breakfast club at Highworth Combined School, ahead of the government’s national roll out of free breakfast clubs. I heard from headteacher Mrs Pankhania about the school’s impressive progress.\nI was delighted to meet children and staff at Highworth Combined School and to hear about how much they enjoy attending breakfast club and mixing with different year groups.\nThe staff discussed with me how breakfast clubs support parents to work.\nHeadteacher Mrs Clare Pankhania explained how the culture of ‘studious intent’ created at Highworth Combined School has narrowed the gap in educational attainment between disadvantaged children and their peers.”\nMrs Pankhania said:\nWe’ve worked really hard to make a difference for children who need it the most, making sure they get the very best educational start in life.\nThis year, we expect to be in the top 5% of schools in England for attainment in national tests at the end of Key Stage 2. Just as importantly, we’ve looked for ways to do this whilst making teacher workload manageable.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_visit-to-the-accessible-workshop/content_70.html": "It was fascinating to visit the Accessible Workshop in Wycombe with the Minister for Social Care, Stephen Kinnock MP.\nThe Accessible Workshop is a Social Enterprise Initiative which enables adults with learning disabilities or autism to build real-world work skills and gain an understanding of how their skills and talents can be used to create positive social change.\nIt was great to meet Marcus who started as a student and now works for the Social Enterprise. He taught me and Stephen how to use a drill properly, a skill that I have no doubt we will remember for a long time!",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_inter-faith-co-ordinating-chaplain/content_17.html": "Great to meet Imam Haseeb Jahangir and to hear about his work as Inter Faith Co-ordinating Chaplain supporting students at Buck New University.\nWe discussed how we can work together to bring Wycombe’s communities closer in these challenging times.\nGreat to meet Imam Haseeb Jahangir and to hear about his work as Inter Faith Co-ordinating Chaplain supporting students at Buck New University.\nWe discussed how we can work together to bring Wycombe’s communities closer in these challenging times.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_category_news/content_28.html": "Delivering on GP improvements\nOver 1,500 extra GPs recruited to help end ‘8am scramble’ and bring back the family doctor in Wycombe.\nDrop-in event at YMCA\nI attended a drop-in event that connected YMCA residents with charities and organisations who provide a range of invaluable support.\nBreakfast clubs roundtable\nI hosted a roundtable of school leaders, parents, and providers to understand the impact of breakfast clubs.\nHigh Wycombe Ambulance Station\nThe local ambulance service is advocating for greater public awareness about when it is appropriate to call an ambulance.\nBreakfast club at Highworth Combined School\nThe staff explained how breakfast clubs support parents to work, and the children told me how much they enjoy attending breakfast club.\nContinue Reading Breakfast club at Highworth Combined School\nChildren’s community campaigns\nI visited High Wycombe Church of England Primary School to hear about the children’s community campaigns.\nAttack on vulnerable adults at the Wrights Meadow Centre\nI condemn the appalling attack on the members of High Wycombe Gateway Club.\nContinue Reading Attack on vulnerable adults at the Wrights Meadow Centre\nCommunity Iftar at The Hive\nThis was an incredible opportunity to learn about the holy month of Ramadan and hear from voices within the community.\nCommunity Iftar at Jubilee Road Mosque\nMany thanks to everyone at Jubilee Road Mosque for their warm welcome and a wonderful community Iftar.\nTackling knife crime in Wycombe\nLeaders of Wycombe’s faith communities, BNU and TVP met to discuss how to tackle knife crime in Wycombe.\nVideo: International Women’s Day at Wycombe High School\nThe students asked insightful questions about how we can get more women into top roles in business and politics.\nContinue Reading Video: International Women’s Day at Wycombe High School\nPlans to redevelop Wycombe hospital\nI have offered my steadfast support. for the plans to redevelop our hospital. We must not lose any additional services.\nCommunity Impact Bucks\nI would like to congratulate Community Impact Bucks on their new website – a one stop shop for volunteers, charities, and residents.\nFunding for community-based Early Support Hubs\nHundreds of young people across Wycombe will receive bolstered support with their mental health this year.\nContinue Reading Funding for community-based Early Support Hubs\nBuckinghamshire Business First’s spotlight on skills\nI met with more than 15 local employers at an event organised by BBF to examine how the Government’s skills agenda can drive economic growth.\nContinue Reading Buckinghamshire Business First’s spotlight on skills\nTaking back our streets\nThe Government’s flagship Crime and Policing Bill represents the biggest package of new laws on crime and policing for decades.\nOutstanding careers guidance at RGS\nI enjoyed a tour of Wycombe’s Royal Grammar School and learned about school’s award-winning careers programme.\nVisit to Seeleys House\nI have written to Buckinghamshire Council to share my concerns about the impact of the potential closures of services like Seeleys House.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_category_uncategorised/content_115.html": "EMMA REYNOLDS\nWycombe’s Labour MP\nThank you\nIt is an honour to be elected as your MP. I am keen to represent you regardless of who you voted for. I am determined that my team and I will give constituents the very best service.\nThe Tories left the public services on their knees and a £22 billion blackhole. The new Labour government has had to make some tough choices but we remain focused on driving economic growth and improving public services.\nLatest News\nDelivering on GP improvements\nOver 1,500 extra GPs recruited to help end ‘8am scramble’ and bring back the family doctor in Wycombe.\nDrop-in event at YMCA\nI attended a drop-in event that connected YMCA residents with charities and organisations who provide a range of invaluable support.\nBreakfast clubs roundtable\nI hosted a roundtable of school leaders, parents, and providers to understand the impact of breakfast clubs.\nHigh Wycombe Ambulance Station\nThe local ambulance service is advocating for greater public awareness about when it is appropriate to call an ambulance.\nBreakfast club at Highworth Combined School\nThe staff explained how breakfast clubs support parents to work, and the children told me how much they enjoy attending breakfast club.\nContinue Reading Breakfast club at Highworth Combined School\nChildren’s community campaigns\nI visited High Wycombe Church of England Primary School to hear about the children’s community campaigns.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_plans-to-redevelop-wycombe-hospital/content_4.html": "I know many constituents are concerned about the future of Wycombe hospital. During my last meeting with the CEO of Buckinghamshire Healthcare Trust, Neil Macdonald, I was encouraged to hear about their plans to develop the hospital. I am glad I am now able to share further details about those plans.\nWhat do these plans look like?\n- A phased approach to moving services to a new building.\n- These phases will be determined as and when funding becomes available.\n- The first stage will be to complete preparatory work before starting on detailed designs.\nI have offered my steadfast support. We must not lose any additional services from our hospital.\nA spokesperson from Buckinghamshire Healthcare NHS Trust said:\nWe are committed to the redevelopment of Wycombe Hospital.\nIt looks very unlikely that Wycombe will be included in the New Hospital Programme, so we are looking at alternative ways of delivering the changes that are so desperately needed.\nThis will probably mean that any new building to replace the Tower will need to be constructed in a phased way, as and when funding becomes available. The first stage will be to complete preparatory work, including things like ground investigations and utilities, before starting on detailed designs to allow us to gain financial approval to proceed in late 2026.\nIn the meantime, we are continuing to undertake essential maintenance work to ensure the safety of our patients and our colleagues. We would like to thank everyone for their patience as we continue to do our best to deliver outstanding care in an environment that we know is less than ideal.”",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_hansford-sensors/content_64.html": "I was pleased to visit Wycombe company Hansford Sensors, the leading global manufacturer of vibration monitoring equipment.\nI congratulated Managing Director Chris Hansford on receiving the King’s Award for Enterprise. This prestigious award celebrates Hansford’s outstanding achievement in the International Trade category.\nHansford Sensors are keen to provide apprenticeships and work experience for Wycombe’s young people, and I am delighted to connect them with local schools.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_battle-of-britain-sunday/content_96.html": "It was an honour and privilege to attend the act of thanksgiving and commemoration of the Battle of Britain today at the All Saints War Memorial in High Wycombe.\nWe commemorated the great victory of the Royal Air Force which saved Britain from invasion in 194",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_attack-on-vulnerable-adults-at-the-wrights-meadow-centre/content_63.html": "On 18 March 2025, the High Wycombe Gateway Club met at the Wrights Meadow Centre to host around 100 adults with learning difficulties for paralympic sports and craft activities. Paula Lee, Manager of the Wrights Meadow Centre, reported that a group of youths surrounded the taxis carrying the adults with learning difficulties and their carers, and harassed them as they were leaving the centre.\nEverybody in Wycombe has the right to feel safe. I condemn the appalling attack on the members of High Wycombe Gateway Club, who are some of the most vulnerable people in our community.\nMy team and I promptly contacted Thames Valley Police as well as the Wrights Meadow Centre team. I am pleased to hear that Thames Valley Police are investigating the incident as a public order offence and that they will be increasing patrols in the area.\nI encourage anybody with any information to report it to the police. For those who wish to remain anonymous, information can be shared confidentially through Crimestoppers 0800 555111.\nPaula Lee said:\nIt was absolutely terrifying for the adults with learning difficulties. It is making them scared to come back to the club, which is so important for their mental and physical well-being. They take part in paralympic sports, including boccia and curling. They have always felt safe here. The fact that has been compromised is the most heart-breaking thing of all.\nCouncillor Annie Baughan said:\nI was disgusted to hear about the attack on vulnerable people enjoying the Wrights Meadow Centre. It must have been very upsetting everybody, including the staff and volunteers.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_labours-missions/content_53.html": "Get Britain Building Again\nKick-start growth and create skilled jobs by building the infrastructure we need for the future.\nSwitch on Great British Energy\nCut energy bills for good and create 500,000 high paid jobs with a new publicly owned clean energy company.\nTake Back our Streets\n13,000 extra police and PCSOs on the street and guaranteed town centre patrols to tackle gangs, drug dealers and antisocial behaviour.\nBreak Down Barriers to Opportunity\nBreakfast clubs in every primary school, 6,500 new specialist teachers and Technical Excellence Colleges for top class training and apprenticeships.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_seeleys-house/content_68.html": "I recently visited Seeleys House Short Breaks and Overnight Respite Centre alongside Sarah Green, MP for Chesham and Amersham. I was very impressed by the high standard of care provided by the staff at Seeleys House, as well as the excellent facilities and activities available to support service users.\nI have spoken with a number of residents and families in Wycombe who access the Adult Social Care day and overnight respite services in Buckinghamshire. They have expressed significant concerns at Buckinghamshire Council’s proposed changes to the services which includes the potential closures of Seeleys House, the only Council-run overnight respite service in Buckinghamshire, as well as other day centre sites in the county.\nFollowing my visit to Seeleys House, I have written to Buckinghamshire Council with the following:\n- To share my experiences of the visit to Seeleys House and my concerns about the impact of the potential closures of these services.\n- To urge them to carefully consider the experiences, concerns and recommendations of the families and carers of service users from their recent consultation process.\n- To ask them to ensure that the care and needs of those who rely on the services are prioritised in all decisions.\nI will provide an update when I am able to",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_interfaith-meeting-bnu-tvp/content_15.html": "I was pleased to meet with representatives of Wycombe’s Hindu, Sikh, Muslim, Christian and Jewish communities, and senior leaders of Buckinghamshire New University and TVP Wycombe. The group was brought together by Imam Haseeb Jahangir, who leads the chaplaincy at the university.\nThe attendees jointly agreed a statement about the event:\nWe shared our commitment to working together, building bridges, and supporting the lives of those living in High Wycombe, particularly through tea and hospitality. We want to ensure that faith leaders, and in turn their communities, are not strangers and build trusted friendships, share kindness and knowledge of each other’s religions, and contribute to a collaborative vision for a peaceful local society.\nAs the MP for Wycombe, I am here to serve all of Wycombe’s diverse communities. This meeting of faith leaders and similar initiatives are particularly important at a time when international and national figures are doing their best to divide us.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_vincentian-exhibition-for-black-history-month/content_42.html": "During Black History Month, it is important to celebrate the amazing contribution of Wycombe’s black community.\nI enjoyed meeting Estelle Williams MBE and former mayor Sebert Graham at the Vincentian Exhibition at All Saints Parish Church.\nEstelle came to Wycombe from St Vincents and the Grenadines alone at the age of 18 to train as a nurse. She was later awarded the MBE by Queen Elizabeth II for her pioneering work with the Caribbean Elderly Hairoun Day Centre.\nEstelle told us\nThanks to Father Anthony and All Saints Parish Church for the privilege of sharing Black History Month with the people of High Wycombe. It was a great opportunity to meet our MP and to recognise the huge contribution of the African Caribbean community.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_bucks-county-show/content_7.html": "I had a fantastic day at Bucks County Show.\nIt was great to speak to farmers and members of the rural community from across Buckinghamshire. I enjoyed catching up with familiar faces from Wycombe.\nI look forward to continuing this close relationship and visiting their farms again soon.\nWhilst at the show, I also spoke with the Rural Crime Taskforce lead, Inspector Stuart Hutchings.\nStuart has done an excellent job with this team. Since its launch, the taskforce has seized more than £5 million-worth of property, including vehicles, drugs, plant machinery and tools, as well as completing hundreds of investigations and supporting hundreds of people with crime prevention advice. Thames Valley Police are setting an example of how rural crime should be dealt with and how it can be prevented.\nI look forward to working with this taskforce and Thames Valley Police to make Wycombe a safer place for all.\nLearn more about their work.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_wear-it-pink-day/content_12.html": "We would like to use cookie to analyse performance of our web site. No personal data is stored.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news_inter-faith-liasion/content_16.html": "I had the pleasure of meeting again with Imam Haseeb Jahangir (Inter Faith Co-ordinating Chaplain Bucks New Uni) and also with Rabbi Neil Janes (South Bucks Jewish Community) to discuss how to build trust and relationships between faith leaders in Wycombe.\nI am committed to continuing to work with all local faith organisations so that we can build and maintain mutual respect and also stamp all forms of discrimination including Islamophobia and Antisemitism.",
  "https_emmaforwycombe_org_uk_/https_emmaforwycombe_org_uk_news-2/content_5.html": "News (2)\nLatest news\nTackling speeding and illegal parking\nI’m delighted that Thames Valley Police have worked alongside me to increase joint speeding and DVLA operations.\nConstituency Support Highlights\nSince September I have hosted 10 surgeries where I have met with over 90 constituents.\nWycombe for Fairtrade\nI learned about their campaign to ensure that more retailers and catering outlets in Wycombe stock Fairtrade-certified products.\nLabour is creating more apprenticeships\nLabour is creating apprenticeships for tens of thousands of young people by listening to businesses.\nCableflow\nCompanies such as Cableflow have an important role to play in our Labour government’s mission to make Britain a clean energy superpower.\nFinings Wood Community Group\nThe group is campaigning to sustainably protect, manage and restore this ancient woodland for the community and for nature.\nBuckinghamshire Council Elections\nIt was great to meet some of Labour’s exciting array of young, vibrant and diverse candidates for Bucks Council elections in May.\nChiltern Railways\nI met with Richard Allan, Managing Director of Chiltern Railways, to discuss local concerns and the steps being taken to improve services.\nThe Holocaust must never be forgotten\nI have signed the Holocaust Educational Trust (UK) Book of Commitment pledging to mark Holocaust Memorial Day and remember all those who were murdered.\nMy Name’5 Doddie Foundation\nI was pleased to learn about the important work of the Motor Neurone Disease charity, My Name’5 Doddie Foundation.\nWycombe District Swimming Club\nAs a keen swimmer, I enjoyed presenting trophies at the Wycombe District Swimming Club’s annual awards event.\nWycombe Friends of the Earth\nWe discussed air and water pollution, renewable energy development, and how the Government is delivering on climate action.\nHeart of Bucks charity\nHeart of Bucks has awarded more than £17 million to more than 6,000 charities since its first grant in 2000.\nAll Spring Media Ltd\nIt was great to hear about the exciting opportunities for Wycombe’s young people in the film and TV industry.\nCeasefire in the Middle East\nThis is a crucial step towards halting the violence that has claimed too many lives and caused immense suffering on both sides.\nMy Appointment as Economic Secretary to the Treasury\nI look forward to working with the Chancellor Rachel Reeves to boost the critical role of financial services in driving growth across the country and delivering vital services to people.\nContinue Reading My Appointment as Economic Secretary to the Treasury\nInterfaith Meeting with BNU and TVP\nThis meeting of faith leaders is particularly important at a time when international and national figures are doing their best to divide us.\nChristmas Card Competition Finalists\nI would like to congratulate and thank the finalists in my Christmas card competition.\nCressex Community School\nI talked to the GCSE Citizenship students about the role of an MP.\nHansford Sensors\nI congratulated Managing Director Chris Hansford on receiving the King’s Award for Enterprise.\nCarols by Candlelight at St. Peter’s\nIt was a privilege to read the first lesson at the Carols by Candlelight service at St. Peter’s Church, Loudwater.\nSmall Business Saturday UK\nI met with a group of small businesses in High Wycombe at The Vanilla Pod Cafe Patisserie on White Hart St.\nSV2G\nCEO Jacqueline Roberts told me about the important work of the St Vincent and the Second Generation charity.\nSir William Ramsay School\nThe Headteacher and the CEO of the Trust explained how they are improving the school.\nIslamophobia Awareness Month\nI have written to the Government to express my deep concern about the growing threat of Islamophobia in our country.\nHighcrest Academy\nI enjoyed visiting The Highcrest Academy as part of UK Parliament Week.\nMillbrook Combined School\nI visited Millbrook Combined School & Community Hub and answered some tough questions about the role of an MP\nAir League reception in Westminster\nThe Air League is the UK’s leading aviation and aerospace charity.\nRedevelopment of the Chilterns Shopping Centre\nI met with the MD of Dandara Living to learn about their plans.\nContinue Reading Redevelopment of the Chilterns Shopping Centre\nCastlefield School and Beechview Academy\nI enjoyed visiting schools for UK Parliament week.\nHigh Wycombe Christmas lights\nFantastic evening at the High Wycombe Christmas lights switch on. I can’t remember the last time I have seen High Wycombe so full of people!\nSikh Gurdwara\nAt the Gurdwara Amrit Parchar Dharmik Diwan, there is a celebration for the 555th anniversary of the arrival of Sri Guru Nanak Dev Ji.\nRespect for Shop Workers Week at Tesco\nI met staff at Tesco’s Loudwater store during Respect for Shop Workers Week.\nVisit to the Accessible Workshop\nThe Accessible Workshop is a Social Enterprise Initiative which enables adults with learning disabilities or autism to build real-world work skills.\nPrime Minister of St Vincent and the Grenadines\nI had a fantastic evening meeting with Ralph Gonsalves, the Prime Minister of St Vincent and the Grenadines, at Hilltop Community Centre.\nContinue Reading Prime Minister of St Vincent and the Grenadines\nRemembrance Sunday\nI attended the Remembrance Sunday Parade and Service to honour those brave service personnel who serve and have served to keep us safe\nInter Faith Liasion\nI met with Imam Haseeb Jahangir and with Rabbi Neil Janes\nHigh Wycombe Delivery Office\nI visited Royal Mail’s High Wycombe Delivery Office and joined a postie on their round.\nWycombe Hospital\nI met the CEO of Buckinghamshire Healthcare Trust. and was encouraged to hear about their plans to develop the hospital.\nPensions Credit surgery\nThanks to Citizens Advice and Age UK for their help with my Pensions Credit surgery.\nConstituency Garden of Remembrance\nI planted a tribute at the Constituency Garden of Remembrance to remember those who died defending our democratic freedoms and way of life.\nWhat the budget means for Bucks\nFellow Bucks Labour MPs and I wrote to the leader of Bucks Council about the budget.\nA Budget to fix the foundations and deliver change\nI was proud to be part of the Treasury team standing alongside our first woman Chancellor, Rachel Reeves.\nContinue Reading A Budget to fix the foundations and deliver change\nChiltern Rangers CIC\nThe Chiltern Rangers is a Community Interest Company that manages a dozen nature reserves in the Wycombe area.\nShri Meenakshi Amman temple\nI learned about plans for a new building and joined devotees for a pooja ceremony.\nVincentian Exhibition for Black History Month\nCelebrating Black History Month with Estelle Williams MBE at the Vincentian Exhibition.\nContinue Reading Vincentian Exhibition for Black History Month\nParadigm Housing Group\nI met with Paradigm Housing Group and heard about their plans for good quality affordable housing in our area.\n’wear it pink’ day\nBreast Cancer is the most common form of cancer. I’d like to encourage everybody to check for signs of breast cancer.\nOak Lodge Skills Hub\nI learned how Oak Lodge Skills provide day care for adults with additional needs and help them to develop practical life skills.\nBNU Inter Faith Co-ordinating Chaplain\nImam Haseeb Jahangir and I discussed how we can work together to bring Wycombe’s communities closer.\nInternational Investment Summit\nIncredible day at our International Investment Summit where we secured £63 billion of investment and nearly 38,000 jobs.\nRefresh the Marketplace\nI got to see how this store aims to encourage people to Reduce, Reuse, Recycle and Create\nNew Life\nNew Life, the Charity for Disabled Children,\nsells surplus stock from well-known high street brands.\nWilliam Hands, Furniture Maker\nIt was fascinating to visit William Hands – the furniture maker in the heart of High Wycombe.\npladis R&D centre\nI was lucky enough to visit pladis’s Research and Development hub in High Wycombe and to sample some of their latest biscuits.\nFarm visits\nI was delighted to visit several farms across the constituency today. Thank you to all the farmers who took the time to show me around.\nLabour Party Conference\nIt was an excellent opportunity to discuss how much this government has already achieved and to look ahead towards a decade of national renewal.\nBuckinghamshire Business First\nI met with Buckinghamshire Business First to discuss how the new government will bring down the barriers to growth for local businesses.\nBattle of Britain Sunday\nIt was an honour and privilege to attend the act of thanksgiving and commemoration of the Battle of Britain today at the All Saints War Memorial in High Wycombe.\nCressex Community School\nI really enjoyed dropping in on some of the classes and meeting students when I visited Cressex Community School.\nRoyal Star & Garter\nI really enjoyed visiting the Royal Star and Garter care Home in High Wycombe and meeting the staff and residents.\nWycombe’s new Primark store\nI was pleased to be able to attend the grand opening of Wycombe’s new Primark store in the Eden Centre.\nWinter Fuel Allowance\nThe last government wrecked our economy, leaving a £22bn black hole in the public finances. These are not the choices the Chancellor wanted to make or expected to make, but they are the right choices in the circumstances.\nWycombe Refugee Partnership\nIt was great to meet with Wycombe Refugee Partnership and interesting to hear how the team, made up of over 60 volunteers, support refugees and asylum seekers here in Wycombe. Thank you for all the hard work you do.\nBucks County Show\nIt was great to speak to farmers and members of the rural community from across Buckinghamshire. I look forward to continuing this close relationship and visiting their farms again soon.\nDerehams Inn Community Group\nI met with Derehams Inn Community Group as I was keen to hear about their efforts to save the pub. I will be supporting their campaign to bring life back to this community asset.\nPakistan Independence Day\nFantastic evening celebrating Pakistan Independence Day. Thanks for inviting me along to be a part of the celebrations.\nAnother fantastic Wycombe Pride!\nFighting for equality is in my DNA, it’s why I became an MP and I will continue to always fight for a fairer society.\nStanding against hatred and division in Wycombe\nThank you to our brave police officers for protecting the public and preserving the peace in High Wycombe. Thanks also to those who came to gather against hatred and division.\nContinue Reading Standing against hatred and division in Wycombe\nAllocation of the £11.8m Future High Streets Fund in Wycombe\nSee the email I sent to Martin Tett, Buckinghamshire Council Leader about the allocation of the £11.8m Future High Streets Fund.\nContinue Reading Allocation of the £11.8m Future High Streets Fund in Wycombe\nMy appointment as Minister for Pensions\nIt’s a great honour to have been asked by the new Prime Minister to serve as Parliamentary Secretary in His Majesty’s Treasury and the Department of Work and Pensions.\nThank you for electing me\nIt’s a huge honour and privilege to be elected as the MP for Wycombe.\nInternational Firefighters Day\nThank you to Wycombe fire station for welcoming me on International Firefighters Day. Thank you to all firefighters in Wycombe, UK and around their world for their bravery and dedication to protecting us and saving lives.\nCommunity Iftars\nI was delighted to take part in the community Iftars this Ramadan at John Hampden Grammar School, the HIVE and the Wycombe Mosque.\nSpeech to the Rotary Club of High Wycombe\nI gave a speech about how Parliament has changed over the last 15 years.\nMy visit to Airflow Developments in Cressex Business park.\nLike many other businesses I speak to, Airflow Developments shared that the impact of Brexit has been tough on them.\nContinue Reading My visit to Airflow Developments in Cressex Business park.\nMy letter to Steve Baker to address the unacceptable comments made by Frank Hester.\nI challenged Steve Baker to refuse money from his party if it is funded by Frank Hester.\nContinue Reading My letter to Steve Baker to address the unacceptable comments made by Frank Hester.\nInternational Women’s Day\nFantastic event put on by the Women of Wycombe Labour Party last night. It was a privilege to celebrate International Women’s Day with like-minded women from across Buckinghamshire!\nMedical Aid for Palestine / Caabu event\nI recently attended an event in Parliament organised by Medical Aid for Palestinians and Caabu (Council for Arab-British Understanding)\nBrigit Phillipson visit to Bucks New University\nIt was brilliant to have the Shadow Education Secretary Bridget Phillipson join me at Bucks New University and afterwards in Downley last week.\nContinue Reading Brigit Phillipson visit to Bucks New University\nKashmir All Party Parliamentary Group\nI was delighted to attend the Kashmir All Party Parliamentary Group in the House of Commons. I spoke of my determination to represent the thriving Kashmiri community in Wycombe, should I get elected as Wycombe’s MP, and to ask the government to do more about human rights abuses and secure progress on the right of…\nRachel Reeves : The Path to a Labour Government Runs Through Wycombe\nRachel Reeves, the Shadow Chancellor, joined us for my campaign launch event.\nContinue Reading Rachel Reeves : The Path to a Labour Government Runs Through Wycombe\nSmall Business Saturday in Marlow Bottom\nIt was fantastic to spend some time getting to know some small business owners around Marlow Bottom this afternoon."
}