{
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_parliament/content_4.html": "In 2023, I was successful in passing my Private Members' Bill on Power of Attorney (see photo above). It made a number of reforms to digitise the power of attorney application process, whilst securing the paper application process with new ID checks.\nI also brought forward a Ten Minute Rule Bill on Defibrillators which highlighted the need for greater access to defibs. This was inspired by Dave Bowling, a Community First Responder in SBET.\nIn 2024, I scrutinised the Criminal Justice Bill at Committee Stage. Among other things, the Bill brings in new offences related to bladed articles, such as zombie-style knives, and new offences to tackle developments in the drug trade and firearms trade.\nAs MP for SBET, I regularly contributed to the House of Commons and raised local issues of importance. You can still see some of my contributions below:",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_news_stephen-metcalfe-pledges-support-ukraines-victory/content_11.html": "Stephen Metcalfe, Conservative Parliamentary Candidate for South Basildon & East Thurrock, has pledged his support for Ukraine at this coming General Election by signing up to 4 key pledges.\nStephen has been a massive supporter of British efforts to help the people of Ukraine. He has been instrumental in organising 4 aid missions, he has arranged a ‘Big Hug’ event on the second anniversary of the Russian Invasion for local Ukrainian refugees and their families and he has secured funding for a company who have been delivering aid constantly throughout the last 2 years.\nTherefore, in preparation for the General Election on 4th July, Stephen has reaffirmed his commitment to Ukraine by signing up to 4 key pledges of the #UkraineMustWin campaign.\nThe pledges are as follows: First, arm Ukraine so that it wins. Second, recognise Russia as a state sponsor of terrorism. Third, make Russia pay by confiscating sanctioned Russian assets and giving the proceeds to Ukraine. Fourth, strengthen sanctions and other economic measures to defund the Russian war machine.\nStephen Metcalfe said: “I am a solid friend of Ukraine. This is simple for me – Ukraine was invaded by an aggressor. This war is no one’s fault but Russia. We must help Ukraine – a sovereign, independent country which does not want to become the vassal state of an authoritarian dictator.\nI have shown my support in Parliament and in the constituency. I have been sanctioned by Russia and I stand up for what is right. I am proud to sign up to these 4 pledges and I am proud to be a friend of Ukraine.”",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_news/content_7.html": "\"We need to wake up\": Stephen Metcalfe urges parents to be aware of online challenges Monday, 1 July, 2024 Stephen Metcalfe has worked with Lisa Kenevan and Holly Dance to raise the issue of online safety in the halls of Parliament and now he is urging parents to watch the hard-hitting video which they have produced to ensure that parents can #BeChallengeAware. Ms Kenevan, a Basildon resident, lost her son Isaac, 13 years old, after he was believed to have taken part in an online choking challenge. Ms... Articles\nStephen Metcalfe visits Lee Chapel Primary School ahead of French trip to Somme 25th June 2024 Stephen Metcalfe, Parliamentary Candidate for South Basildon & East Thurrock, recently visited Lee Chapel Primary School for ‘French Day’ and chatted to pupils... Articles\nStephen Metcalfe marks Armed Forces Week with flag raising ceremony in Thurrock 25th June 2024 Stephen Metcalfe, Conservative Parliamentary Candidate for South Basildon & East Thurrock, yesterday marked Armed Forces Week in the constituency with an... Articles\nStephen Metcalfe pledges support for Ukraine’s victory 24th June 2024 Stephen Metcalfe, Conservative Parliamentary Candidate for South Basildon & East Thurrock, has pledged his support for Ukraine at this coming General Election... Articles\nStephen Metcalfe welcomes plan for 8,000 additional police officers, on top of 20,000 recruited since 2019 14th June 2024 Stephen Metcalfe , Conservative parliamentary candidate for South Basildon and East Thurrock, has welcomed the Conservative plan to recruit 8,000 additional... Articles\nStephen Metcalfe welcomes Conservative plan to abolish ULEZ expansion and enshrine in law the rights of motorists against ‘pay-per-mile’ plans 13th June 2024 Since 2010, Conservative MPs in Parliament have spoken out strongly against anti-motorist policies – in particular, the expansion of ULEZ by the Labour Mayor of... Articles\nStephen Metcalfe commemorates 80th Anniversary of D-Day in the local area 7th June 2024 Stephen Metcalfe, Parliamentary Candidate for South Basildon & East Thurrock, has helped organise events across the area to ring in the 80th Anniversary of the... Articles\nWith the highest police headcount in history, violent crime has fallen by double digits in Basildon 4th June 2024 Stephen Metcalfe has welcomed the news that Basildon has seen double digit decreases in violent crime from April 2023 to April 2024 – thanks to an increased... Articles\nStephen Metcalfe welcomes Conservative plan to increase apprenticeship opportunities and improve regulation of university courses to ensure young people can reach their full potential 3rd June 2024 Stephen Metcalfe has welcomed the Conservative plan to deliver 100,000 more apprenticeships per year if Rishi Sunak is elected – building on the success of the... Articles\nStephen Metcalfe visits dBD Communications at Basildon HQ 24th May 2024 Stephen Metcalfe, MP for South Basildon & East Thurrock, recently visited dBD Communications, a successful family-run business operating out of its Basildon HQ... Articles",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_science-and-technology-parliament/content_3.html": "During my time Parliament, after constituency work, one of my key focuses has been the promotion of science, technology, engineering and maths (STEM) in all its guises across Parliament.\nI have sat on the Science, Innovation and Technology Select Committee every week - scrutinising Government policy and carrying out inquiries into quantum technologies, fusion energy, nuclear energy, artificial intelligence and the list goes on.\nI have also chaired the Parliamentary and Scientific Committee which the oldest All-Party Parliamentary Group in Parliament, having been founded in 1939. It publishes a quarterly magazine called Science in Parliament.\nI have also co-chaired the All-Party Parliamentary Group on Artificial Intelligence since its creation in 2017.\nI am a big advocate of increasing participation in STEM and, to this end, sponsor The Big Bang Competition and The Big Bang Fair in Parliament each year.\nAwards and recognitions for Science and Technology:\n- An Honorary Fellow of the Institute of Engineering and Technology in recognition of his outstanding contribution to the engineering profession\n- Previously the Government Envoy for the Year of Engineering\n- Awarded for Services to Innovation by the Institute of Innovation & Knowledge Exchange\n- An Honorary STEM Ambassador",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_news_stephen-metcalfe-visits-dbd-communications-basildon-hq/content_9.html": "Stephen Metcalfe, MP for South Basildon & East Thurrock, recently visited dBD Communications, a successful family-run business operating out of its Basildon HQ.\ndBD Communications is a leading manufacturer and supplier of duplex wireless solutions. Their products facilitate point-to-point communication between multiple people and create safer working environments on major rail projects, construction sites, and air ground handling.\nStarted in 2002 by Managing Director and Owner, David O’Connell, the Basildon-based company has gone from strength to strength. Clients include Network Rail, Balfour Beatty, and Çelebi Airport Services – an international air ground handling company from Turkey.\nStephen Metcalfe said: “A big thanks goes to David O’Connell for welcoming me back at dBD’s Basildon HQ. The precision, quality assurance and sheer ingenuity of the products is plain to see. It’s awesome that we have such exciting businesses operating in Basildon.\nThe production of specialised duplex communication systems is really innovative and international businesses are coming to dBD and its expert team of engineers and technicians for solutions.\nI am also pleased to see that the Department for International Trade has been working with dBD to further increase its profile on the world stage. This is what Government needs to do more of.”",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_about-rss/content_5.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk/content_1.html": "I recently quizzed the Govt on the crime of fly tipping – a very important topic for landowners and the public. Pleased to hear from Minister Robbie Moore that fines have doubled. I pressed for bigger fines, more prosecutions and publicised convictions.\nTo watch more clips of my previous interventions in Parliament, check out my Twitter or Facebook.",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_privacy/content_2.html": "This document outlines how Stephen Metcalfe processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Stephen Metcalfe\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Stephen Metcalfe.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Stephen Metcalfe, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Stephen Metcalfe via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_news_stephen-metcalfe-marks-armed-forces-week-flag-raising-ceremony-thurrock/content_6.html": "Stephen Metcalfe, Conservative Parliamentary Candidate for South Basildon & East Thurrock, yesterday marked Armed Forces Week in the constituency with an official flag raising ceremony at Thurrock Civic Offices.\nAhead of Armed Forces Day on 29 June, Stephen joined the Armed Forces community at Thurrock Civic Offices in Grays for a flag raising ceremony.\nPiper Jo Goddard led the procession, and the Mayor of Thurrock raised the flag.\nStephen Metcalfe said: “It was great to speak with Piper Jo and support our Armed Forces community at today’s procession in Thurrock.\nThe world is increasingly dangerous, I am therefore incredibly grateful to those serving in our Armed Forces today who stand ready and willing to act to defend our traditions and freedoms – we must support them every step of the way.\nI strongly welcome the Conservatives 2024 manifesto commitment to increase defencing spending to 2.5% of GDP. This marks a £140 billion increase to ensure our Armed Forces have the best equipment to defend against an ever-evolving threat.\nWe also set up the very first Office for Veterans Affairs, we have waivered National Insurance for those who employ veterans, and we have committed to passing the UK’s first Veterans’ Bill into law.\nI will always vote to champion our Armed Forces. I want the UK to be the best place to be in the Armed Forces – now, in the past or indeed in the future.”",
  "https_www_stephenmetcalfe_org_uk_/https_www_stephenmetcalfe_org_uk_westminster-trips/content_10.html": "Free guided tours of Parliament are available to constituents. The walking tour of the Palace of Westminster includes -\n- Westminster Hall, the ancient hall at the heart of the Palace where Parliament first sat and where many historic events have taken place\n- The House of Commons, including the Speaker's Chair and the famous green benches and the 'lobbies' where MPs actually vote\n- The House of Lords, including the Royal Throne\n- The Queen's Robing Room, Royal Gallery and many other fascinating parts of the Palace of Westminster\nPlease note that tours are very popular and places are limited so generally have to be booked about six months in advance.\nPlease contact us to enquire about a visit to Westminster."
}