{
  "https_www_chriskane_net_/https_www_chriskane_net_contact/content_6.html": "CONTACT\nWould you like to find out more about my campaigns? Please use the contact form below to get in touch.\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\nAlternatively, you can write to me at: House of Commons, London, SW1A 0AA.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_nhs-forth-valley-responds-to-chris-calls-to-release-information-on-hospital-equipment/content_16.html": "Home » NHS Forth Valley Responds to Chris’ Calls to Release Information on Hospital Equipment.\nNHS Forth Valley Responds to Chris’ Calls to Release Information on Hospital Equipment.\nShare on Social Media\nNHS Forth Valley has released the numbers and ages of various hospital equipment following Chris’ calls for them to do so last month.\nThis follows a freedom of information request that revealed that NHS Scotland is relying on decades-old hospital equipment across the country. NHS Tayside, which covers Strathallan, revealed it had an MRI scanner, a CT scanner and two X-ray machines that were more than 15 years old. NHS Grampian has an X-ray machine which is 27 years old.\nAn independent report to NHS bosses in England recommended that CT and MRI machines that are over 10 years old should be retired.\nYou can read the previous article here.\nThe picture across Scotland looks bleak with many NHS boards relying on old equipment. However, NHS Forth Valley was the only board that failed to respond to the Freedom of Information request. Leaving patients in the dark as to the standard of their equipment.\nChris wrote to NHS Forth Valley in March demanding they release these figures, and last week he received a response. Confirming NHS Forth Valley’s oldest MRI and X-ray scanners are six years old and their oldest CT Scanner is eight years old. Which is under the recommended 10-year life span.\nChris, commenting on the situation, stated, “I am glad that NHS Forth Valley has now responded to my request for information, and I welcome that their machines are under the recommended retirment age.”\n“However, across Scotland, we can see the rot start to set in to our NHS. 18 years of incompetence and neglect have allowed our health service to deteriorate with out-of-date equipment and growing waiting lists”\n“The UK Government has provided Scotland with a record budget settlement, it is time for the Scottish Government to start investing in the latest technology, reducing waiting times and delivering the fast, accurate diagnoses that patients deserve.”\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_news/content_13.html": "LATEST NEWS\nKeep updated on the latest news, campaigns and my work on behalf of voters in Stirling and Strathallan.\nEaster Weekend Office Closure\nPlease note that Chris’s office will be closed over the Easter weekend, from Friday 18th April to Monday 21st April. During this time, the team will still be keeping an eye on Chris’s inbox and will respond to any urgent casework as needed.\nChris Kane Celebrates Boost for Thousands of Pensioners in Stirling and Strathallan\nMillions saw their state pension rise by up to £470 per year. This is thanks to the government’s commitment to the state pension triple lock, which saw the basic and new state pension rise by 4.1% yesterday (6 April).\nNHS Forth Valley Responds to Chris’ Calls to Release Information on Hospital Equipment.\nNHS Forth Valley has released the numbers and ages of various hospital equipment following Chris’s calls for them to do so last month. This follows a freedom of information request that revealed that NHS Scotland is relying on decades-old hospital equipment across the country.\nChris Kane Meets with Local Campaigner to Demand Action on Teith Bridge\nChris has reiterated his call for road safety action on the Teith Bridge. He met with Fiona Morton, a local campaigner to see first-hand the safety issues Deanston residents face on a daily basis.\nChris Urges SSEN to Expand Housing Initiative into Stirling and Strathallan\nChris has urged SSEN (Scottish and Southern Electricity Networks) to expand a recently announced housing initiative into the Stirling and Strathallan constituency.\nChris backs campaign to help Keep Transport Workers Safe\nChris has given his backing to a campaign to help keep transport workers safer from violence and abuse. He has signed an Early Day Motion (EDM) 937 this week which notes with concern the findings of the TSSA union’s latest report ‘Keep transport workers safe – no to abuse and harassment on the transport network’.\nNHS Forth Valley Fails to Respond as Report Reveals Scottish Hospitals Relying on Decades-Old Hospital Equipment\nNHS Forth Valley failed to release information on hospital equipment following a freedom of information request. The request revealed that Scottish hospitals are relying on MRI scanners and X-ray machines that are decades old.\nChris Backs Historic Employment Rights Bill\nThis week in Parliament, Chris voted for the Employment Rights Bill, a groundbreaking piece of legislation which will bring the most significant overhaul of employment rights in a generation. The bill, now written into law, strengthens workers’ rights by preventing unfair dismissal, enhancing sick pay, banning exploitative zero-hour contracts, and putting an end to the controversial ‘fire and rehire’ practices.\nKEEP UPDATED\nSubscribe to Chris's Newsletter\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_chris-kane-supports-pump-track-project-in-killin/content_9.html": "Home » Chris Kane supports Pump Track project in Killin.\nChris Kane supports Pump Track project in Killin.\nShare on Social Media\nChris, this week, has committed his support for the much-anticipated Pump Track project in Killin. Stating “Good community facilities can boost tourism in rural villages, adding to the economy, as well as promoting activity for young people in the area. I am aware of the demand for greater recreational facilities and cycling provision in Killin, and I am glad that it is getting off the ground.”\nKillin Sports and Recreation Hub, established in 2022, are working alongside the Killin and Ardeonaig Community Development Trust (KAT) and Killin Community Council (KCC) to raise funds in order to complete the project.\nThe Hub was set up with the aims of regenerating sports and recreation infrastructure and social inclusion within the Killin area. The hub recently received a vote of congratulations from Stirling council for its work regenerating Killin’s tennis courts/MUGA pitch and marking 70km of local trails.\nNow it has its sights set on creating a Pump Track for the local area, which will provide a vital recreational space for their youth and serve as a boost to local tourism, with the nearest equivalent facilities currently over 40 miles away, with no Public Transport links.\nThanks to incredible community efforts, they have successfully raised £93,000 to date, with nearly £10,000 being raised locally. However, for them to finish this project, they still require £57,000 in additional funds.\nChris has commended the work of the sports hub, development trust and the community council for their work to get this project off the ground. He added,“I am committed to promoting the fundraising efforts of the project and supporting them as much as I can in my capacity”\nThey are currently putting applications into the Community Spaces Improvement Grant and the FVL CLLD funding programme, however, they are encouraging individual donations as well.\nIf you would like to donate to the project, you can visit their Just Giving page here. If you would like to find out more about the project, contact Killin Sports and Recreation Hub at [email protected] or call 07909807271\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_chris-urges-ssen-to-expand-housing-initiative-into-stirling-and-strathallan/content_15.html": "Home » Chris Urges SSEN to Expand Housing Initiative into Stirling and Strathallan\nChris Urges SSEN to Expand Housing Initiative into Stirling and Strathallan\nShare on Social Media\nChris has urged SSEN (Scottish and Southern Electricity Networks) to expand a recently announced housing initiative into the Stirling and Strathallan constituency.\nHis request in the House of Commons follows SSEN’s Housing Our Workers Strategy, published in October 2024, which outlines plans to build 1,000 homes in rural communities across northern Scotland. These homes will initially accommodate workers involved in major infrastructure projects before being repurposed to benefit rural communities facing a housing crisis.\nChris welcomes this initiative, stating: “This scheme is to be congratulated; however, it is the Scottish Government that failed to grasp control of the rural housing crisis, which is acting to a major barrier to infrastructure projects in rural areas, and having a knock-on effect to other local businesses.”\nThe SSEN strategy outlines participating council areas, including Perth & Kinross Council; however, Stirling Council is notably absent, despite key SSEN projects taking place in the far north of the Council area.\nDuring topical questions to Ministers from the Department for Energy Security and Net Zero, Chris called on the minister to urge SSEN to “expand the scheme into my constituency, where we have key projects around the communities of Killin, Lochearnhead, Tyndrum and Crianlarich.”\nMichael Shanks, Parliamentary Under-Secretary of State at the Department for Energy Security and Net Zero, agreed with Chris, stating that he is right to highlight “the importance not just of delivering on energy projects but the wider economic benefits from building infrastructure.” He went on to say, “He is right that to deliver these projects, we need to see investment in rural communities by the Scottish Government.”\nWatch the full question below👇\nChris stated, “The UK Government is pressing ahead with its plans to make this country’s energy supply more secure and sustainable. SSEN’s scheme is a great example of the positive knock-on effects of these infrastructure projects, and I am pleased the company is taking such a wholistic approach which recognises the housing strain faced in many parts of rural Scotland.\n“Given the ongoing pressure on housing, and the Scottish Government’s failure to invest in rural housing I will be highlighting to SSEN the housing issues across Killin, Lochearnhead, Tyndrum and Crianlarich, where SSEN have significant historic links and where they have plans for future operations and asking them to look at the possibility of expanding their excellent housing programme into Stirling and Strathallan.”\nChris has an upcoming meeting with SSEN to discuss their Housing Our Workers Strategy. You can read the full strategy here.\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_easter-weekend-office-closure/content_4.html": "Home » Easter Weekend Office Closure\nEaster Weekend Office Closure\nShare on Social Media\nPlease note that Chris’s office will be closed over the Easter weekend, from Friday 18th April to Monday 21st April.\nDuring this time, the team will still be keeping an eye on Chris’s inbox and will respond to any urgent casework as needed.\nWe hope you have a restful and joyful Easter, however you are spending it. The office will reopen as usual on Tuesday, 22nd April.\nIf you need support with a reserved matter—such as benefits, pensions, or visas—or if you’d like to raise a local issue, please don’t hesitate to get in touch using the contact form.\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_chris-backs-historic-employment-rights-bill/content_17.html": "Home » Chris Backs Historic Employment Rights Bill\nChris Backs Historic Employment Rights Bill\nShare on Social Media\nChris Backs Historic Employment Rights Bill\nThis week in Parliament, Chris voted for the Employment Rights Bill, a groundbreaking piece of legislation which will bring the most significant overhaul of employment rights in a generation. The bill, now written into law, strengthens workers’ rights by preventing unfair dismissal, enhancing sick pay, banning exploitative zero-hour contracts, and putting an end to the controversial ‘fire and rehire’ practices.\nStrengthening Sick Pay Protections\nOne of the landmark changes within the bill is the reform of Statutory Sick Pay, making it a legal right for all workers. This means that 1.3 million low-wage employees will now be entitled to either 80% of their average weekly earnings or the current Statutory Sick Pay rate—whichever is higher. Crucially, the reform removes the waiting period, ensuring sick pay is available from day one of illness. This measure not only provides much-needed financial security to workers but also helps curb the spread of illness in workplaces, ultimately boosting productivity and benefiting businesses across the country.\nEnding Exploitative Zero-Hour Contracts\nThe bill also delivers a long-overdue victory for workers trapped in exploitative zero-hour contracts. Under the new law, all workers—including 900,000 agency workers in the UK—will be entitled to contracts that reflect their regular working hours. This ensures greater job security by granting reasonable notice of shifts and fair compensation when shifts are cancelled or changed at short notice. While the law maintains flexibility for businesses, it ensures workers are no longer left uncertain about their incomes.\nCracking Down on ‘Fire and Rehire’ Tactics\nAnother major reform in the bill is the crackdown on ‘fire and rehire’ practices. The government is doubling the maximum protective award for collective redundancies from 90 to 180 days, allowing employment tribunals to issue larger compensation awards when employers fail to meet consultation requirements. This change creates a powerful deterrent, ensuring that businesses uphold their obligations rather than opting for financially motivated redundancies that exploit workers.\nThese reforms have been widely welcomed by the people of Stirling and Strathallan. Last month, an MRP mega poll conducted by Hope Not Hate revealed that:\n- 71% supported an end to exploitative zero-hour contracts and demanded contracts that reflect actual working hours.\n- 76% backed stronger sick pay protections, including the right to sick pay from the first day of illness.\nCommenting on the bill, Chris emphasised the importance of securing fairer conditions for working people: “For far too long, working people have been underpaid and undervalued. I am delighted that these reforms are now being written into law to ensure the biggest change to employment rights in a generation. Labour is delivering for working people.”\nWith the Employment Rights Bill now set in law, these changes mark a historic step toward a fairer, more secure working environment for millions across the UK. This bill underscores a firm commitment by the Labour Government to protecting workers in Stirling and Strathallan.\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_nhs-forth-valley-fails-to-respond-as-report-reveals-scottish-hospitals-relying-on-decades-old-equipment/content_20.html": "Home » NHS Forth Valley Fails to Respond as Report Reveals Scottish Hospitals Relying on Decades-Old Hospital Equipment\nNHS Forth Valley Fails to Respond as Report Reveals Scottish Hospitals Relying on Decades-Old Hospital Equipment\nShare on Social Media\nNHS Forth Valley failed to release information on hospital equipment following a freedom of information request. The request revealed that Scottish hospitals are relying on MRI scanners and X-ray machines that are decades old.\nThe picture across Scotland shows that many boards are using outdated equipment with NHS Grampian still using an MRI scanner which is 15 years old, while one of its X-ray machines is 27 years old.\nNearby NHS Tayside also had an MRI scanner, a CT scanner and two X-ray machines that were more than 15 years old.\nAn independent report to NHS bosses in England recommended that CT and MRI machines that are over 10 years old should be retired.\nHowever, NHS Forth Valley was the only board in Scotland not to respond to the FOI request. Chris has written to NHS Forth Valley demanding that these figures be released.\nChris commented: “With hospitals across the country struggling with dangerously outdated equipment, NHS Forth Valley must be transparent and release their figures so that patients know the quality of service they are receiving.\n“Across Scotland, we see a picture of growing incompetence and neglect from the Scottish Government, with patients paying the price. Over the past 18 years, our NHS has been allowed to deteriorate, with out-of-date equipment and growing waiting lists.\n“The UK government has provided Scotland with a record budget settlement. It is now up to the Scottish Government to ensure that hospitals can invest in the latest technology—reducing waiting times and delivering the fast, accurate diagnoses that patients deserve.”\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net/content_1.html": "Do you need help on local issues? Get in touch today.\nDAILY UPDATES\nLatest News\nKeep updated on the latest news, campaigns and our work on behalf of voters in Stirling and Strathallan.\n-\nChris Kane supports Pump Track project in Killin.\nChris, this week, has committed his support for the much-anticipated Pump Track project in Killin. Stating “Good community facilities can boost tourism in rural villages, adding to the economy, as well as promoting activity for young people in the area. I am aware of the demand for greater recreational facilities and cycling provision in Killin, and I am glad that it is getting off the ground.”\n30/04/2025Read More -\nEaster Weekend Office Closure\nPlease note that Chris’s office will be closed over the Easter weekend, from Friday 18th April to Monday 21st April. During this time, the team will still be keeping an eye on Chris’s inbox and will respond to any urgent casework as needed.\n17/04/2025Read More -\nChris Kane Celebrates Boost for Thousands of Pensioners in Stirling and Strathallan\nMillions saw their state pension rise by up to £470 per year. This is thanks to the government’s commitment to the state pension triple lock, which saw the basic and new state pension rise by 4.1% yesterday (6 April).\n07/04/2025Read More\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_about-us/content_2.html": "ABOUT\nFind out more about my work, campaigns and how I can help you with local issues and concerns.\nChris Kane is the Member of Parliament for Stirling and Strathallan. Chris is a Labour politician, first elected to parliament in July 2024. From 2017-2024, Chris was a local authority councillor in Stirling (Stirling East ward), where he held roles including Leader of the Council (2022-2024), Deputy Leader of the Council (2020-2022) and Convenor of the Community Planning and Regeneration Committee (2017-2022).\nChris has served on the Boards of organisations including Loch Lomond and the Trossachs National Park and the Stirling Smith Art Gallery and Museum. His route into politics was through community activities; he was the Chair of his local community council (Braehead and District) and established a local Community Development Trust, where he raised over £300K to build a 10,000 square metre Community Garden which was named the ‘best community space in the UK’ by the Society of Garden Designers in 2015.\nChris was born in Stirling. He lives there with his wife, Anne, and their two teenage children. Chris attended Stirling High School and Stirling University, graduating with a BA in Media Studies and a Postgraduate Diploma in Entrepreneurial Studies.\nAway from politics, Chris was a full-time broadcaster and journalist for many years, working with most of Scotland’s radio stations and a few of Scotland’s local newspapers. In recent years he worked as a marketing and communications consultant and created digital content (website blogs, podcasts, press releases, etc) for businesses and organisations.\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_chris-kane-meets-with-local-campaigner-to-demand-action-on-teith-bridge/content_18.html": "Home » Chris Kane Meets with Local Campaigner to Demand Action on Teith Bridge\nChris Kane Meets with Local Campaigner to Demand Action on Teith Bridge\nShare on Social Media\nChris has reiterated his call for road safety action on the Teith Bridge. He met with Fiona Morton, a local campaigner to see first-hand the safety issues Deanston residents face on a daily basis.\nThe communities of Deanston and Doune are intrinsically linked, with the Teith Bridge being the only suitable pedestrian crossing for them to access local shops, the GP surgery, Post Office and Public Library, all of which are located in Doune.\nResidents believe the bridge is a growing danger, with traffic levels upwards of 8000 vehicles every day, 7% of which are HGVs.\nSpeaking of the visit, Chris commented: “Walking across the bridge, I saw first-hand the danger pedestrians face just getting to the shop every morning. It is completely inaccessible; those with wheelchairs or parents with prams are unable to cross the bridge safely.”\nFiona Morton commented: “The bridge poses an unnecessary and increasing danger to members of the community. It is acting as a physical barrier between the villages of Doune and Deanston; the opposite of what a bridge is designed to do.”\nTraffic Scotland have previously responded to the Chris’ calls for a solution, stating that widening the bridge would be challenging due to the requirements of design standards and conservation restrictions on the listed structure. They would need to limit spaces for vehicles instead, in order “to assess the impacts of this, a vehicular traffic modelling exercise is currently ongoing considering the viability and merits of potentially introducing permanent traffic signals”.\nThe letter went on to say, “The exercise is due for completion in February 2025. Further meetings are planned once the traffic modelling is completed to discuss what improvements can be made within the existing constraints.”\nAs of the end of March, Chris has still not received an update from them.\nChris added: “The Scottish Government and Transport Scottish need to stop dragging their feet on this issue. I want to make it very clear, the A84 and the Teith Bridge are Traffic Scotland’s responsibility, and it is time for them to work with Stirling Council rather than against them to find a solution for the residents of Deanston and Doune.”\nFind out more by watching the video of Chris’ visit below.\nCelebrating excellence and community hero’s in Stirling and Strathallan\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_useful-links/content_11.html": "USEFUL LINKS\nUse the links below to read helpful information from public service providers.\nCOUNCIL SERVICES\nCOUNCIL SERVICES\nCOMMUNITY SAFETY\nCOMMUNITY SAFETY\nPARLIAMENT LINKS\nPARLIAMENT LINKS\nCONSUMER RIGHTS\nCONSUMER RIGHTS\nOTHER SERVICES\nOTHER SERVICES\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_contact_visiting-parliament/content_10.html": "VISITING PARLIAMENT\nIf you would like me to try to arrange a tour on your behalf please contact me via the email below.\nBOOK TOUR\nMembers of the public and school groups are encouraged to visit the Houses of the Parliament and Palaces of Westminister. Paid tours can be arranged through the Houses of Parliament but free tours are available to UK Residents booking through their MP.\nThese tours (called Democratic Access Tours), are only available on certain days and at certain times, depending on whether Parliament is in session or in recess. They usually last approximately one hour, and at present, tours are only available on Monday, Tuesday and Wednesday mornings. Friday tours are available all day if the Commons are not sitting and in the late afternoon if they are.\nThe Central Tours Office issue MPs with a limited number of special permits each day, and once these have all been allocated no more will be issued. Where possible I will try to arrange for me, or one of my team, to meet you on your tour, but this is not always possible.\nIf you would like me to try to arrange a tour on your behalf please contact me via the email below. Applications should be made as far in advance as possible and, as it is difficult to arrange for everyone to take a tour on their preferred date, it would be helpful if you could have some alternative dates to hand.\nWATCH DEBATES\nMembers of the public can see the House of Commons in action by sitting in the Public Gallery. It is located on a level above the floor of the Commons and looks down onto it. The Public Gallery is open to the public when the House is sitting, and is closed to the public when the House is in recess.\nTickets to the Public Gallery are also available through your MP but members only have a small allocation of tickets (two tickets, about once a fortnight) so requests should be made as far in advance as possible. The Wednesday afternoon sitting including Prime Minister’s Question Time is particularly popular.\nAs an alternative to making ticket arrangements, visitors may join the public queue outside St. Stephen’s Entrance. A wait of 1 or 2 hours or more is usually common during the afternoons. Generally speaking, after ticket holders have left the Gallery and the afternoon queue has subsided, there is not normally too much pressure on places in the Gallery, except during controversial debates. Visitors who wish to minimise waiting times are therefore advised to arrive at about 13.00 or later.\nBooking a visit\nIf you are interested, please send an email to [email protected].\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_coffee/content_12.html": "Coffee mornings\nDo you have a local issue? Let’s talk about it over a cup of tea.\nChris holds regular coffee morning events across the constituency. See below for details of upcoming events, and fill out the form to register interest in attendance.\nPlease note there are limited spaces at the coffee morning events.\nDunblane – Saturday, 10 May – 10am\nBalfron – Friday, 20 Jun – 3pm\nAuchterarder – Saturday, 13 Sep – 10am\nCambusbarron – Saturday, 4 Oct – 10am\nCallander – Saturday, 8 Nov – 10am\nDue to parliamentary security protocols, the exact location of the event will be disclosed closer to the event date.\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_media_campaigns/content_7.html": "Industrial Strategy\nGET BRITAIN BUILDING AGAIN\nGood jobs and productivity growth in every part of the country making everyone, not just a few, better off.\nDetails\nCLEAN ENERGY\nGreat British Energy\nBritish people are facing challenges with higher bills. The only way to cut energy bills is to shift to clean, low carbon power.\nDetails\nCHILD POVERTY TASKFORCE\nImprove lives & life chances of children\nA dedicated task force to ensure we are improving the lives of children now, and addressing root causes for long-term change in the future.\nDetails\nBUILDING INVESTMENT IN STIRLING\nA brighter future for our community\nChris supports more investment into Stirling, which he will continue to fight from in his current position. See the Stirling & Clackmannanshire City Region Deal to see the impact of more investment.\nDetails\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_newsletter-signup/content_3.html": "NEWSLETTER SIGNUP\nSubscribe to my newsletter to keep updated on my work via email..\nStay informed about my work in Parliament and within the Constituency by subscribing to my newsletter. I send out two regular updates: a weekly Westminster roundup offering insight into my parliamentary activities, alongside key government developments, and a monthly Constituency update highlighting the latest from Stirling and Strathallan. Subscribe below!\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_contact_event-request/content_5.html": "EVENT REQUEST\nAre you hosting an event locally or in Parliament? Invite me to attend or speak at the event by completing the form on this page.\nIn my role as your elected representative, I want to engage with voters, community groups and local organisations to foster dialogue, promote community interests, and encourage representation on issues that matter to you.\nThis page lets you easily invite me to attend local events or gatherings at Parliament. Whether you’re organising a community meeting, charity event, or a local celebration, you can use the form here to invite me to the event and ensure your community’s voice is heard.\nSimply fill out the form with your event details and explain how my attendance would benefit your cause. Don’t forget to include details of the location, day and times and other useful information about your event.",
  "https_www_chriskane_net_/https_www_chriskane_net_chris-backs-campaign-to-help-keep-transport-workers-safe/content_19.html": "Home » Chris backs campaign to help Keep Transport Workers Safe\nChris backs campaign to help Keep Transport Workers Safe\nShare on Social Media\nChris has given his backing to a campaign to help keep transport workers safer from violence and abuse.\nHe has signed an Early Day Motion (EDM) 937 this week which notes with concern the findings of the TSSA union’s latest report ‘Keep transport workers safe – no to abuse and harassment on the transport network’.\nThe report received 650 responses from transport and travel workers. It revealed that over half had experienced some form of violence -either physical or verbal – within the past year. It also revealed that 95% had received a form of verbal assault while at work, and more alarmingly over 40% had received a threat of violence involving a weapon.\nAfter reading the report Chris commented:\n“I was disappointed, but unfortunately not shocked at the findings of this report. Violence and anti-social behaviour in the transport network has been a long-term issue, which has not been given the priority it deserves. But it should not be deemed as normal or inevitable, it can and must be tackled. Transport Workers need and deserve better support.”\nThe report also showed a rise in racial and sexual harassment towards transport workers. 43% of respondents reported racial harassment while 37% reported sexual harassment. Another respondent noted that “a few times a week we face verbal abuse, racist remarks and threats of physical harm”.\nThe report goes on to speak about the long-lasting effects of the violence transport workers suffered, including physical injuries, emotional and physiological effects and effects on job satisfaction and productivity.\nOne response in the report quoted: “At the ticket gates at Glasgow Queen St, a male had no ticket and was threatening staff. When I tried to speak to him, he told me he felt sorry for my family as he was going to stab me in the heart, then attempted to pull a knife from his pocket.”\nThe EDM aims to tackle this by calling on the Government to use public transport reforms to bring in legislative measures to increase the protection of transport workers and enhance funding settlement for the British Transport police. Which the report calls for when outlining recommendations.\nChris added:\n“I believe the calls in the report for legislative measures to be put in place must be investigated. The UK and Scottish Governments must work together on this to ensure the safety of workers and passengers. No one should go to work feeling unsafe or expecting to receive any form of violence, and our transport network should be free of anti-social behaviour.”\nYou can read TSSA Union’s full report here.\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_chris-kane-celebrates-thousands-of-pensioners-in-stirling-and-strathallan/content_14.html": "Home » Chris Kane Celebrates Boost for Thousands of Pensioners in Stirling and Strathallan\nChris Kane Celebrates Boost for Thousands of Pensioners in Stirling and Strathallan\nShare on Social Media\nMillions saw their state pension rise by up to £470 per year. This is thanks to the government’s commitment to the state pension triple lock, which saw the basic and new state pension rise by 4.1% yesterday (6 April). 18,385 pensioners in Stirling and 35,994 in Perth and Kinross are set to receive a pay boost from this rise, up to £470 per year.\nChris has welcomed the news, highlighting how the government’s commitment to the triple lock has delivered this extra cash for pensioners and is set to deliver around £1,900 over the course of this parliament.\nThe Labour Government is committed to the pensions triple lock, which guarantees that the\nThe state pension goes up each year by the highest of 2.5%, inflation, or earnings growth, for the\nThe whole of the parliament – at a cost of £30bn.\nThis news comes as the government continues the biggest ever drive to ensure those eligible for\nPension Credit is receiving it, resulting in an 81% increase in claims. Nearly fifty thousand extra\npensioners are receiving Pension Credit following the campaign to boost uptake, and DWP has\nnow processed a record number of claims. Pension Credit is worth on average £4,300 a year and\nalso unlocks support including help with Housing Costs, Council Tax and free television licenses.\nCommenting on the rise, Chris stated: “This rise in the state pension is a real boost for over 20,000 pensioners across Stirling and Strathallan. Thanks to Labour’s commitment to the triple lock, pensioners will see up to £470 more in their pockets this year. Over the course of this Parliament, that means almost £2,000 extra support, and it’s money that will make a real difference. I’ll also keep working hard to make sure everyone who’s entitled to support like Pension Credit is getting it.\n“This increase comes in the same week that the lowest paid workers got a pay rise, with the minimum wage increasing to £12.21 per hour for those over 21 and £10 an hour for those aged 18-20. Labour is delivering a real boost for those who need it most.”\nWork and Pensions Secretary Liz Kendall MP said:\n“Today’s state pension boost will be incredibly welcome news for the millions of pensioners across our country, putting up to £470 extra in their pockets. This Labour Government is committed to delivering for our pensioners – ensuring their financial stability through the triple lock, fixing our public\nservices, and targeting support towards those who need it most.”\nWhilst there has been a significant uptake in Pension Credit claims, there are still people of are eligible and have yet to claim. Visit https://www.gov.uk/pension-credit/eligibility to check if you are eligible.\nShare on Social Media\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-",
  "https_www_chriskane_net_/https_www_chriskane_net_privacy-policy/content_8.html": "PRIVACY POLICY\nThis “Privacy Policy” sets out information relating to how we use personal information relating to constituents and visitors to this website.\nWHAT’S INCLUDED IN THIS PRIVACY NOTICE?\nCHRIS KANE MP\nThis document (“privacy notice”) sets out information relating to how we will use personal information relating to visitors to this website. It also sets out information about what rights individuals have in relation to their personal information and various other matters required under data protection law.\nIn particular, this privacy notice provides information about how you can object to our use of your personal information, how you can withdraw any permissions you have given to enable us to process your personal information, and how you can make a complaint.\nWHO DOES THIS PRIVACY NOTICE APPLY TO?\nThis privacy notice applies to visitors to this website.\nOne of our key roles as campaigners is to raise issues on behalf of people. As such we will often collect and use personal information as part of our role. From time to time we will also contact people to ask them to complete surveys to gather information and opinions on matters..\nIn the sections below, when referring to visitors to this website we will use the terms “you” or “your”.\nWHAT’S OUR APPROACH TO PRIVACY?\nWe take your privacy extremely seriously and want you to feel confident that your personal information is safe in our hands.\nWe will only use your personal information in accordance with the data protection law applicable to England and Wales from time to time.\nUnder data protection law, when we use your personal information, we will be acting as a data controller. Essentially, this means that we will be making decisions about how to use your personal information and why.\nBelow, we summarise the main rules that apply to us as a data controller under data protection law when we use your personal information:\n- We must be upfront about how we intend to use your personal information and must use your personal information fairly. Providing privacy information to individuals (such as in this privacy notice) is one aspect of using personal information fairly.\n- We must only use your personal information if we have a legal basis to do so under data protection law. These legal bases include:\n- That you have consented to our use of your personal information;\n- That our use of your personal information is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\n- We must only use certain types of sensitive personal information, also referred to as special category personal information (such as information relating to your health, racial or ethnic origin, political opinions, or criminal convictions) if we can also satisfy one of the conditions for processing this type of information set out in data protection law. These conditions include:\n- That you have given us your explicit consent to use the information; and\n- That the processing is necessary for reasons of substantial public interest.\n- We are only permitted to share your personal information with others in certain circumstances and if we take steps to ensure that your personal information will be secure.\n- Generally speaking, we must only use your personal information for the specific purposes we have told you about. If we want to use your personal information for other purposes, we need to contact you again to tell you about this.\n- We must not hold more personal information than we need for the purposes we have told you about and must not retain your personal information for longer than is necessary for those purposes (this is known as the “retention period”). We must also dispose of any information that we no longer need securely.\n- We must ensure that appropriate security measures are in place to protect your personal information.\n- We must act in accordance with your rights under data protection law.\n- We must not transfer your personal information outside the European Economic Area (“EEA”) unless certain safeguards are in place. One such safeguard is that the personal data is only transferred to a country that has been approved by the European Commission as having an acceptable level of data protection law.\nHOW WILL WE USE YOUR PERSONAL INFORMATION?\nHow we will use your personal information, the legal bases we will rely upon, how long we will keep your personal information and other details are set out below.\nSURVEYS\nWhat personal information we will use\n- Your name;\n- Your address;\n- Your contact details (email address, telephone number etc);\n- Your opinions or other personal information provided by you in the survey.\nHow we will obtain the personal information\n- Provided by you when you complete the survey.\nWhat purposes we will use the personal information for\n- To obtain information relevant to inform;\nThe legal grounds we rely upon\n- Our use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\nHow long we retain the personal information and why\n- We will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. If you have consented to receive information about our work, we will only retain your personal information so long as you ask not to be contacted further. We will regularly review the personal information we hold to ensure that its use is necessary and proportionate.\nWHEN WILL W EUSE YOUR PERSONAL INFORMATON FOR DIRECT MARKETING?\nIn addition to data protection law, if we use your personal information for direct marketing purposes, we may also be subject to additional rules that regulate direct marketing. The term “direct marketing” essentially means directing marketing material or political campaign communications at a particular individual.\nTo ensure compliance with both data protection laws and the specific rules relating to direct marketing, we will only use your personal information to provide you with political campaign information, whether by telephone, email, text or other forms of electronic communication [or by post] if you have given us your specific consent to do so.\nOur legal basis for such processing under data protection law will therefore be that you have given your consent to process your personal data for direct marketing purposes.\nWe will retain your personal information unless and until you inform us that you no longer wish to receive direct marketing information from us. You can ask us to stop sending direct marketing to you at any time by contacting us using the details set out in the section below titled –\n“How can you get in touch with us?”\nIP ADDRESSES AND COOKIES\nWhen visiting and interacting with most websites and services delivered via the internet, when you visit our website, the technology used on our website, and via the hosting provider(s) we use, gathers certain information and stores it in log files.\nThis information includes Internet Protocol (IP) addresses, operating system, browser version, cookie details, the content you viewed on our website, system and configuration information, and locale and language preferences. This information gathered will only be used to monitor and ensure the security of our website and the data kept on it and/or to make website improvements for the benefit of visitors to our website. We collect and use Log Data to operate, maintain and improve upon the information we provide to visitors to our website. For example, Log Data can help to detect new security threats on our website, identify malicious third parties, and provide more robust security protection for all users that visit and communicate with us via our website.\nOur website may use cookies and other information gathering technologies for a variety of purposes, such as providing us with information about how visitors interact with the content on our website and to allow us to improve upon the services and/or information on our website for the benefit of all users. You can control how websites use cookies by configuring your browser’s privacy settings (please refer to your browser’s help section to learn more about cookie controls). If you choose to disable cookies entirely, the services and/or information provided on our website may not function properly.\nNEWSLETTERS\nWhat personal information we will use\n- Your name;\n- Your contact details (postal address, email address, telephone number etc.);\nHow we will obtain the personal information\n- Provided by you.\nWhat purposes we will use the personal information for\n- To provide you with newsletters about the work we undertake.\nThe legal grounds we rely upon\n- You have given your consent\nOR - Our use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us. This is because the processing of your personal data by us will be to provide you, by post, with communications about our work, an activity which we consider promotes democratic engagement\nHow long we retain the personal information and why\nUntil you tell us that you no longer wish to receive newsletters and updates from us. You can ask us to stop sending direct marketing to you at any time by contacting us using the details set out in the section below titled – “How can you get in touch with us?”\nWHEN WILL WE SHARE YOUR PERSONAL INFORMATION WITH OTHERS?\nSometimes, we will need to share your personal information with others. This section sets out details of who we will share your personal information with and why. It also tells you about our legal basis for doing so under data protection law and steps we will take to protect your personal information.\nORGANISATIONS WHO CAN ASSIST WITH YOUR CASE\nWho are these Organisations?\n- We will share such of your personal information as is necessary with organisations who can assist with your enquiry.\nWhy we need to share your personal information with them\n- To assist with your enquiry or to obtain information relevant to your enquiry.\nThe legal bases we rely upon when sharing your personal information\n- Sharing of personal data with such organisations will be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\nWhat precautions do we take?\n- We will only share personal data as is necessary and will take steps to determine that the organisations are aware of the importance of protecting personal data.\nPROVIDERS OF INFORMATION TECHNOLOGY SERVICES\nWho will we be sharing your personal information with?\n- Suppliers of information technology products and services such as:\n- We work with other companies to help run our website. These companies provide services to help us to maintain our website, deliver support to our constituents, provide communications support and maintain administrative and security support on our behalf. These Service Providers may only process personal information pursuant to instruction and in compliance with our Privacy Policy and other applicable confidentiality, security measures and regulations. We do not permit any Service Providers to use any personal information we share with them for their own marketing purposes or for any other purpose than in connection with the services they provide to us.\nWhy we need to share your personal information with such providers\n- We use suppliers of information technology products and services in connection with the supply, maintenance and/or improvement of our IT network, and the creation, development hosting and maintenance of our website.\nThe legal bases we rely upon when sharing your personal information\n- We rely upon our legitimate interests in ensuring that our work is managed efficiently and our IT system can function properly and efficiently and that our IT network is secure.\nWhat precautions do we take?\n- We enter into contracts with our IT providers which require them to put appropriate security measures in place and which restrict their use of your personal information.\nOTHER THIRD PARTIES\nWe may also need to share your personal information with others in the following circumstances:\nLegal or regulatory requirements\nOn occasion, we may be required to disclose your personal information to organisations such as the courts or the police to comply with legal obligations we are subject to and/or to prevent fraud or crime.\nSafeguarding\nOn occasion, we may need to disclose your personal information to other organisations such as the local authority or the police for safeguarding purposes in the substantial public interest.\nProfessional advice and legal action\nWe may need to disclose your personal information to our professional advisers (for example, lawyers and accountants) in connection with the provision by them of professional advice and/or the establishment or defence of legal claims.\nWHAT RIGHTS DO YOU HAVE UNDER DATA PROTECTION LAW?\nUnder data protection law, you have a number of different rights relating to the use of your personal information. The information below contains a summary of those rights and our obligations. More information about your rights and our obligations can be found on the ICO website https://ico.org.uk/.\nYour rights – What this involves – What our obligations are\nA right of access\nThis is a right to obtain access to your personal data and various supplementary information.\n- We must provide you with a copy of your personal information and the other supplementary information without undue delay and in any event within 1 month of receipt of your request;\n- We cannot charge you for doing so save in specific circumstances (such as where you request further copies of your personal information).\nA right to have personal data rectified\nThis is a right to have your personal information rectified if it is inaccurate or incomplete.\n- We must rectify any inaccurate or incomplete information without undue delay and in any event within 1 month of receipt of your request;\n- If we have disclosed your personal information to others, we must (subject to certain exceptions) contact the recipients to inform them, that your personal information requires rectification.\nA right to erasure\nThis is a right to have your personal information deleted or removed. This right only applies in certain circumstances (such as where we no longer need the personal information for the purposes for which it was collected). We have the right to refuse to delete or remove your personal data in certain circumstances.\n- If this right applies, we must delete or remove your personal information without undue delay and in any event within 1 month of receipt of your request;\n- If we have disclosed your personal information to others, we must (subject to certain exceptions) contact then recipients to inform them that your personal information must be erased.\nA right to object\nThis is a right to object to the use of your personal information. The right applies in certain specific circumstances only. You can use this right to challenge our use of your personal information based on our legitimate interests or where the processing is necessary for the performance of a task in the public interest or in the exercise of official authority vested in us. You can also use this right to object to use of your personal information for direct marketing\n- If you object to us using your personal information for direct marketing, We must stop using your personal information in this way as soon as we receive your request.\n- If you object to other uses of your personal information, whether we have to stop using your personal information will depend on the particular circumstances.\nA right to restrict processing\nThis is a right to ‘block’ or suppress processing of your personal information. This right applies in various circumstances, including where you contest the accuracy of your information).\n- If we are required to restrict our processing of your personal information we will be able to store it but not otherwise use it.\n- We may only retain enough information about you to ensure that the restriction is respected in future.\n- We have disclosed your personal information to others, we must (subject to certain exceptions) contact them to tell them about the restriction on use.\nIf you wish to exercise any of your rights, you can make a request by contacting us using the details set out in the section below titled –\n“How can you get in touch with us?”\nIf you request the exercise of any of your rights we are entitled to ask you to provide us with any information that may be necessary to confirm your identity.\nYOUR RIGHT TO WITHDRAW CONSENT\nIf you have given us your consent to use any of your personal information, you can withdraw your consent at any time. To do so, please contact us using the details set out in the section below titled – “How can you get in touch with us?”\nHOW CAN YOU GET IN TOUCH WITH US?\nYou can get in touch with us in the following ways:\nEmail address: [email protected]\nWe are the persons overseeing compliance with data protection law an this privacy notice. If you have any questions about this privacy notice, how your personal information is handled or if you wish to make a complaint, please contact us.\nRIGHT TO COMPLAIN TO THE INFORMATION COMMISSIONER’S OFFICER\nIf we are unable to deal with a complaint to your satisfaction or if you are unhappy with the way we are using your personal data, you also have the right to make a complaint at any time to the UK’s supervisory authority for data protection issues, the Information Commissioner’s Office.\nCHANGES TO THIS PRIVACY NOTICE\nWe may update this privacy notice from time to time. If we make any substantial updates, We will provide you with a new privacy notice. We may also notify you in other ways from time to time about the processing of your personal information.\nIn effect: 23/01/25\nGET IN TOUCH\nI can help constituents with various issues, such as benefits, employment law, energy policy, taxation, and visas.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\nAdditionally, use this form to access details about our online and in-person surgery events.\n-\n01786 652345\n-"
}