{
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_campaigns_give-your-view-conservative-run-harrow-council/content_3.html": "The Conservatives took control of Harrow Council in May 2022. Bob is keen to hear your views on how you think it is going, what you would like to see in Harrow and other important topics! You can complete Bob's survey below to take part.\nThe Conservatives took control of Harrow Council in May 2022. Bob is keen to hear your views on how you think it is going, what you would like to see in Harrow and other important topics! You can complete Bob's survey below to take part.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_bob-blackman-irgc-2/content_22.html": "Having just celebrated Nowruz, Bob once again called for the proscription of the IRGC.\nHe hopes that next year's Nowruz will be celebrated in a free and democratic Iran!\nFollow Bob online:\nFacebook: https://www.facebook.com/bobblackmanofficial\nInstagram: https://www.instagram.com/bobblackmanmp\nTwitter: https://twitter.com/BobBlackman\nWebsite: https://www.bobblackman.org.uk\nSubscribe to e-newsletter: https://bit.ly/3Vzviic",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_nationalinsurance/content_33.html": "Labour announced several tax rises in the Autumn Budget, particularly the increase to employer National Insurance contributions (NICs). From 6 April 2025, the rate of employer NICs will increase from 13.8 per cent to 15 per cent, and the Secondary Threshold will be reduced to £5,000 a year.\nThis policy will have a significant impact on local businesses in Harrow East, which are essential to our community. Bob wants to ensure their concerns are heard and represented in Parliament.\nComplete Bob's quick survey below to have your say about the NIC changes.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_expenses/content_11.html": "The Independent Parliamentary Standards Authority (IPSA) oversees all MPs' expenses, setting the rules for what can be claimed and approving and paying claims.\nIPSA publish data in tranches of two or three months together and you can see my claims for the latest period by clicking here and following the instructions on the website.\nOn their website, IPSA also explain what the different categories of expenditure are. Please note that the scheme is revised regularly and some of the categories changed between the financial years 2010 - 11 to 2011 - 12.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_stopthecuts/content_13.html": "Bob Blackman CBE MP has launched a survey to hear the concerns of local residents on the Government's recent announcement to cut Winter Fuel Payments to pensioners.\nIn response to the Governments proposals, the Conservative Party has submitted an Early Day Motion to challenge the government's decision and demand a full debate on the issue in Parliament.\n15,600 pensioners in Harrow East are set to lose their Winter Fuel Payment under the Labour Government’s proposals. That is a staggering 82% of people aged 66 and over in the Harrow East and is unacceptable. Many pensioners now have to complete a 243 question survey as part of the means-testing process. This is why Bob Blackman is launching his survey to ensure that the Government can hear the concerns of residents in Harrow East.\nIntroducing means-testing of the Winter Fuel Payment so quickly, with no previous warning will leave millions without a payment they desperately need to stay warm this winter.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_newsletter/content_7.html": "Every month, Bob produces an e-newsletter to inform his constituents of everything he's been doing, both in the constituency and Westminster.\nIf you would like to receive Bob's Newsletter straight to your Inbox, click here to sign up or use the form on the left-hand side. You can opt-out at any time.\n- January 2025\n- December 2024\n- November 2024\n- October 2024\n- Summer 2024\n- February 2024\n- January 2024\n- December 2023\n- November 2023\n- October 2023\n- September 2023\n- August 2023\n- July 2023\n- June 2023\n- May 2023\n- April 2023\n- March 2023\n- February 2023\n- January 2023\n- Bob's End of Year Review 2022\n- December 2022\n- November 2022\n- October 2022\n- September 2022\n- August 2022\n- July 2022\n- June 2022\n- May 2022\n- April 2022\n- March 2022\n- February 2022\n- January 2022",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_about-bob-blackman-0/content_5.html": "Bob Blackman has been the Conservative Member of Parliament for Harrow East since the 2010 General Election.\nDuring this time Bob has held several roles in the Conservative party and in Parliament, including Secretary of the 1922 Committee since 2015, being a Member of the Conservative Party Board since 2019, Member of 3 Select Committees, a Member of over 72 All-Party Parliamentary Groups (APPGs) and changed the law twice: first with his Homelessness Reduction Act 2017 and recently with his Supported Housing (Regulatory Oversight) Act 2023. Bob was awarded a C.B.E in The King's Birthday Honours List 2023 for his 37 years of continuous political and public service.\nIn 1992, Bob contested the constituency of Brent South as the Conservative Prospective Parliamentary Candidate and produced one of the best results in London without being elected! In 1997, Bob contested Bedford & Kempston, producing the best result in Bedfordshire & Hertfordshire for the Conservatives again without actually winning! Bob also fought Brent North in 2005, producing a 7.1% swing in favour of the Conservatives.\nBefore Parliament, Bob worked for BT\nPrior to being elected to Parliament, Bob was employed by British Telecom in various sales and management positions before becoming a sales tutor at the BT Training College. He was Regulatory Compliance Manager for BT from 1998 to 2010. Bob has also been employed in a variety of sales assignments for Unisys/Burroughs Machines before joining BT.\nBob is married to Nicola Blackman - who is now a Harrow Councillor in Edgware, and lives in Wembley, where he has resided for most of his life. He has been a keen football fan since an early age and passionately supports Tottenham Hotspur, for whom he holds a season ticket for both home and away games.\nBob was President of Liverpool University Guild of Undergraduates and Head Boy at Preston Manor High School, where he subsequently served as a School Governor.\nOutside of politics, Bob is an avid reader of thrillers, crime and mysteries, and a keen follower of rock music, with an extensive collection over the last 50 years. He also enjoys games of Bridge and Chess in his spare time and enjoys food of all varieties... especially curry.\nGreater London Assembly Member\nBob was the Greater London Assembly member for Brent & Harrow for four years, after ousting the Labour Leader on the GLA in June 2004. He served as the Conservative Group Whip on the GLA and on the London Fire & Emergency Planning Authority, was a Member of the Budget Committee and the Deputy Chair of the Economic Development, Culture, Sport and Tourism Committee.\nLocal Councillor & Leader\nBob was a Councillor for the Preston Ward in Brent for 24 years, serving as leader of the Brent Conservatives from 1990 to 2010, before stepping down in order to stand as the Conservative candidate for Harrow East.\nBob was the Deputy Leader of Brent Council between 2006 and 2010 and, during this time, presided over the budget of Brent Council, having previously served as the Leader of Brent Council between 1991 and 1996, where he was credited for leading the dramatic reduction in local taxes and major service improvements of that era.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_about-rss/content_15.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news/content_14.html": "Bob Blackman on Gujarat and Maharashtra Day!\nOn this day in 1960, the state of Bombay was divided into Gujarat and Maharashtra. Bob wished everyone celebrating in Harrow and across the world a Happy Gujarat and Maharashtra Day! Follow Bob online: Facebook: https://www.facebook.com/bobblackmanofficial Instagram: https://www.instagram.com/bobblackmanmp Twitter: https://twitter.com/BobBlackman Website: https://www.bobblackman.org.uk Subscribe...",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_node_3127/content_27.html": "Here you can find many ways to get involved, including current surveys, polls, petitions and Bob's Harrow Residents' Survey, which you are welcome to fill in.\nLabour have broken their promise to British farmers with the Family Farm Tax.\nLabour's Family Farm Tax will stop farms being passed to the next generation\nThreatening our food security\nRisking jobs\nLeading to food prices ri\nStop Labour's 50% bus fare hike.\nLabour's plans to raise bus fares from £2 to £3 mean hard-working people commuting every day will pay £520 a year more.\nSign our petition to stop this.\nThis petition will be presented to the Labour Party.\nIt's time to get justice for victims.\nThe only way to expose those who turned a blind eye to the grooming gangs is by holding a full inquiry, so sign our petition.\nAdd your name and sign the petition to demand a full inquiry into the grooming gangs and those who turned a\nLabour's War on Pubs Will Close Your Local\nLabour's pub tax hike will force landlords to raise prices or shut their doors for good.\n£1,000s extra in business rates per pub\n£800 extra per worker in National Insurance\nHigher\nEvery year I conduct a survey of residents so that I can act on your concerns, champion what matters to you and deliver what you want to see.Since being re-elected as your Member of Parliament, I have been busy delivering on the priorities you told me mattered: crime, schools, housing, the NHS, busi\nBob Blackman CBE MP has launched a survey to hear the concerns of local residents on the Government's recent announcement to cut Winter Fuel Payments to pensioners.\nIn response to the Governments proposals, the Conservative Party has submitted an Early Day Motion to challenge the government's decis\nOver 1,000 Londoners have been killed in the capital since Sadiq Khan became Mayor.\nKnife crime is so bad in London that it has skewed the national average, despite knife crime falling elsewhere across the country.\nThis cannot go on.\nPlease complete Bob's Crime Survey to have your say on what our\nWinning is hard.\nThat's why incredible volunteers like you make all the difference.\nPlease let us know what you can do to help by completing the quick survey below.\nThe Conservatives took control of Harrow Council in May 2022. Bob is keen to hear your views on how you think it is going, what you would like to see in Harrow and other important topics! You can complete Bob's survey below to take part.\nEvery month, Bob produces an e-newsletter to inform his constituents of everything he's been doing, both in the constituency and Westminster.If you would like to receive Bob's Newsletter straight to your Inbox, click here to sign up or use the form on the left-hand side.\nBob welcomes your comments and suggestions regarding his work! You can fill in this survey to provide your feedback.\nI am keen to learn what more you would like to know about my role and work, alongside the topics that I focus on and the things that I share with you.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_category_Westminster-News/content_17.html": "Bob Blackman on Labour's Freebie Taylor Swift Tickets 24th October 2024 Bob Blackman joined Susan Hall's calls for an enquiry into whether there was pressure applied to the Met Police to provide an escort to Taylor Swift. Labour MPs... Speeches in ParliamentWestminster News\nBob Blackman on Free Trade Deal with India 31st July 2024 Bob Blackman asked David Lammy, the Foreign Secretary, about free trade negotiations with India. Bob asked this question on 31/07/24. Follow Bob online... Westminster News\nHAVE YOUR SAY on the Spring Budget 2024 6th March 2024 The Chancellor has announced the Spring Budget for 2024. Bob wants to know your views on this. Have your say on what this means to you and businesses locally. Local NewsWestminster News\nBob Blackman on the success of his Homelessness Reduction Act 15th January 2024 Bob spoke about his Private Members Bill, the Homelessness Reduction Act, and the number of people this Bill has helped since it has been enacted. Follow Bob... Local NewsWestminster News\nAn update from Bob Blackman CBE MP; Looking ahead to 2024 15th January 2024 Bob gave an update on the Parliamentary affairs for 2024, including the Post Office Scandal, the NHS, the upcoming Rwanda Bill and this years elections. Follow... Local NewsWestminster News\nBob Blackman on Just Stop Oil 8th December 2023 Bob asked Penny Mordaunt, Lord President of the Council and Leader of the House of Commons, what action will be taken to increase police funding and to stop... Speeches in ParliamentWestminster News\nBob Blackman on the Israel and Hamas Humanitarian Pause 1st December 2023 Bob asked Andrew Mitchell, Minister of State for Foreign, Commonwealth and Development Office, the risk of Hamas gaining support in the West Bank due to the... Speeches in ParliamentWestminster News\nBob Blackman on SEND in Harrow 24th November 2023 On Tuesday, Bob and fellow Harrow MP David Simmonds met Gillian Keegan to discuss the important provision for children with special educational needs and... Local NewsWestminster News\nBob Blackman on the ITV Late Debate Show 24th October 2023 On Thursday, Bob joined ITV's The Late Debate show to discuss the Israel- Hamas conflict. Bob condemned the mainstream media taking the Hamas terrorists... Westminster News",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_accessibility/content_28.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_lend_a_hand/content_26.html": "Winning is hard.\nThat's why incredible volunteers like you make all the difference.\nPlease let us know what you can do to help by completing the quick survey below. If you can think of any other ways in which you can help, please contact 020 8421 4161 or email [email protected]",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_events_feed/content_20.html": null,
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_endknifecrime/content_6.html": "Over 1,000 Londoners have been killed in the capital since Sadiq Khan became Mayor.\nKnife crime is so bad in London that it has skewed the national average, despite knife crime falling elsewhere across the country.\nThis cannot go on.\nPlease complete Bob's Crime Survey to have your say on what our police should be focusing on.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_tackling-illegal-hmos-harrow/content_30.html": "Many residents raise concerns regarding properties being turned into suspected unlicensed HMOs (houses of multiple occupancy). To make this easier for residents, Harrow Council have provided a list of all registered HMOs in Harrow to Bob's office.\nIf you suspect a property is an unlicensed HMO, contact Bob's office by emailing [email protected] and you will be informed if there is a licence in place.\nIf it is an unlicensed HMO, you can report it to Harrow Council by CLICKING HERE.\n(Last update: 21st August 2023)",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_category_Reports/content_31.html": "Bob Blackman Secures £4.8 Million of SEND Funding 27th March 2024 Bob Blackman CBE MP Secures £4.8 million for SEND Students in Harrow Last January, Bob Blackman MP CBE launched his campaign to secure more funding for Special... ArticlesLocal NewsReports",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk/content_1.html": "INVESTMENT: £22.6 million upgrade to Northwick Park Hospital\nI am delighted that London North West University Healthcare NHS Trust is receiving £22.62 million which will be used for a new ward with 32 beds at Northwick Park Hospital. This comes after I successfully pressed the Government for earlier support to improve Northwick Park's Accident & Emergency Department.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_category_Speeches-in-Parliament/content_25.html": "Bob Blackman on Gujarat and Maharashtra Day! 1st May 2025 On this day in 1960, the state of Bombay was divided into Gujarat and Maharashtra. Bob wished everyone celebrating in Harrow and across the world a Happy... Speeches in Parliament\nBob Blackman on the Islamist Terror Attack in Kashmir 30th April 2025 Bob once again condemned the Islamist terrorist attack in Pahalgam which tragically claimed the lives of 26 Hindu's and Christians. He reiterated his calls on... Speeches in Parliament\nBob Blackman on the terrorist attack in Pahalgam 24th April 2025 Bob condemned the terrorist attack on Hindu pilgrims in Pahalgam which tragically claimed the lives of 26 people. He called on the Govt to fully support India... Speeches in Parliament\nBob Blackman on School Visits and SEND schools 9th April 2025 In 2025, Bob visited 9 local schools, and hopes to visit many more! It's always important to engage with tomorrow’s generation and hear their views. He also... Speeches in Parliament\nBob Blackman on the IRGC 9th April 2025 Having just celebrated Nowruz, Bob once again called for the proscription of the IRGC. He hopes that next year's Nowruz will be celebrated in a free and... Speeches in Parliament\nBob Blackman calls for lifts at Stanmore, Queensbury and Canons Park stations 9th April 2025 Once again Bob called for lifts at Stanmore, Canons Park and Queensbury station! He also called for a legislative change to tighten the definition of “step-free... Speeches in Parliament\nBob Blackman on Preventing Homelessness 8th April 2025 Bob's Private Members Bill, the Homelessness Reduction Act 2017, has prevented 1.4 million people from becoming homeless. He asked the Govt to support my... Speeches in Parliament\nBob Blackman on the United Nations and Palestine 3rd April 2025 Our allies, including the U.S, plan to object to the reappointment of Francesca Albanese as the UN special rapporteur on the occupied territories. She has... Speeches in Parliament\nBob Blackman on cutting NHS Waiting Lists 3rd April 2025 Today, the Govt missed the deadline for issuing remediable service statements to doctors, Without up to date information, doctors may cut their hours to avoid... Speeches in Parliament",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_bob-blackman-islamist-terror-attack-kashmir/content_12.html": "Bob once again condemned the Islamist terrorist attack in Pahalgam which tragically claimed the lives of 26 Hindu's and Christians.\nHe reiterated his calls on the Govt to fully support India in their steps to eliminate terrorism in Jammu and Kashmir.\nFollow Bob online:\nFacebook: https://www.facebook.com/bobblackmanofficial\nInstagram: https://www.instagram.com/bobblackmanmp\nTwitter: https://twitter.com/BobBlackman\nWebsite: https://www.bobblackman.org.uk\nSubscribe to e-newsletter: https://bit.ly/3Vzviic",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_bob-blackman-preventing-homelessness/content_18.html": "Bob's Private Members Bill, the Homelessness Reduction Act 2017, has prevented 1.4 million people from becoming homeless. He asked the Govt to support my Homelessness Prevention Bill, to put pressure on the people who should provide housing, so that no one is forced to sleep rough.\nFollow Bob online:\nFacebook: https://www.facebook.com/bobblackmanofficial\nInstagram: https://www.instagram.com/bobblackmanmp\nTwitter: https://twitter.com/BobBlackman\nWebsite: https://www.bobblackman.org.uk\nSubscribe to e-newsletter: https://bit.ly/3Vzviic",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_bob-blackman-labours-freebie-taylor-swift-tickets/content_23.html": "Bob Blackman joined Susan Hall's calls for an enquiry into whether there was pressure applied to the Met Police to provide an escort to Taylor Swift.\nLabour MPs and Sadiq Khan should not be involved in operational policing, especially when they have been gifted free tickets.\nBob asked this question on 24/10/24.\nFollow Bob online:\nFacebook: https://www.facebook.com/bobblackmanofficial\nInstagram: https://www.instagram.com/bobblackmanmp\nTwitter: https://twitter.com/BobBlackman\nWebsite: https://www.bobblackman.org.uk\nSubscribe to e-newsletter: https://bit.ly/3Vzviic",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_campaigns_register-vote-or-need-postal-vote/content_10.html": "Tweet If you would like details on registering to vote, or to request a postal vote, complete the form below. What can you do to help? Current About you Can you help? Your details Leave this field blank Are you registered to vote? Yes No Would you like an application to vote by post? Yes No Many people find it easier to vote by post, guaranteeing their vote even if they are away or ill. How well do you think Bob Blackman is doing as an MP? Extremely well Quite well Okay Not very well Badly No opinion",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_about-harrow-east/content_29.html": "History\nHarrow East has been a Conservative seat for much of its history, but was taken by Labour in their two great landslides of 1945 and 1997, and in 1966.\nThe previous Member of Parliament was a Labour MP and Harrow East is often referred to as a 'bellwether' constituency and is a key marginal for the Conservative Party.\nA Local Champion\nBob is constantly out and about in Harrow East, holding street surgeries and speaking to constituents. Bob has several surveys and ways for you to get involved, which you can do so by clicking HERE or visiting the Get Involved! tab above.\nLocal Schools & Youth\n- Secured £millions in funding for local schools across Harrow, including Salvatorian College, Sacred Heart Language College, Stanmore College & Bentley Wood High School.\n- Supporting local facilities with investment into grassroots pitches in Harrow, including the upgrades to tennis courts across Harrow.\n- Every year I run a work experience programme for local students - in 2023 we had around 50 students join for two weeks of door knocking, speaking to residents and better understanding the role of a Member of Parliament.\nPublic Transport & Services\n- Strongly opposes Mayor Sadiq Khan's expansion of the Ultra-Low Emission Zone to Harrow, which will cost drivers over £4,500 each year to leave their driveways and go to work, do the weekly shop or visit GP and hospital appointments.\n- Continues to press Mayor Sadiq Khan to provide more car parking and a lift at Stanmore Station and campaigned against Transport for London (TfL) proposals to build tower blocks on the car parks at Stanmore and Canons Park Stations.\n- Supporting residents in opposing the disgraceful plans to build a cluster of 29 high-rises on the Edgware Broadwalk and Town Centre sites, many over 20-storeys, which will destroy the local high street and cause construction chaos for over 10 years!\n- Opposed the ridiculous Low Traffic Neighbourhoods (LTNs) that a previous Labour-run Harrow Council implemented throughout Harrow, blocking emergency vehicles and angering drivers against residents' wishes.\nHealth & Environment\n- Secure £22.6 million for a new Ward at Northwick Park Hospital.\n- Instrumental in ensuring that the Royal National Orthopaedic Hospital in Stanmore received the go ahead for their long promised redevelopment.\n- Assisting Northwick Park Hospital to obtain the required funds to improve the hospital and safeguard the A&E Department.\n- Raised the concerns of local GP services, including Belmont Medical Centre and Kenmore Medical Centre.\nSpeaking Up for all\n- Harrow has a diverse population and Bob is well known by all communities and welcomes the opportunity of celebrating all local festivities; he is extremely well-known amongst the local Asian communities and is known as Bobubhai by local residents. He assisted the Swaminarayan Temple in Neasden for many years and is a regular visitor to the Wood Lane and Kenton, Queensbury and Kum Kum temples.\n- Intervened to ensure refugees fleeing Afghanistan, Ukraine and the Sudan crises get to the UK, including displaced children and constituents.\n- Attended all of the synagogues in Harrow East and is a strong supporter of the local Jewish population and the State of Israel. Bob has spoken up in the House of Commons supporting Israel.\n- Visited the Harrow Central Mosque regularly and has given support to the Mosque when threatened by fascist demonstrators. Bob has also visited the Wood Lane Islamic Centre as well as supporting the Sri Lankan Mosque in Wealdstone.\n- Visited most of the churches in Harrow East to join festivals of worship.\n- Supported the Jain community in a variety of functions, including raising awareness during the recent UK Census.\nSafe & Secure Neighbourhoods\n- Campaigning in favour of more police on the streets as experienced police are transferred to Central London and fought locally to ensure that the new Safer Neighbourhood police teams were brought up to strength quickly.\n- Worked closely with Harrow Council and the police to take effective actions that address residents' safety concerns with dangerous speeding in Harrow, including in Edgware at Mollison Way.\n- Highlighted the influx of catalytic converter thefts in Harrow and worked with police to clamp down on criminals, reduce the frequency of thefts and ensure residents are protected.\nHigh Streets & Businesses\n- Worked with the Conservative-run Harrow Council to introduce 1 hour free parking across Harrow.\n- Secure £millions in Government funding that will be invested in Harrow Town Centre.\n- Helped the campaign against the closure of Post Offices locally which were forced through by the previous Labour Government.\n- Opposed the high-density multi-storey developments being foisted upon Harrow as a result of Labour Government diktat.\n- Well known for his campaign to ensure that Harrow residents would not shoulder an unfair burden on the funding of the London Olympics in 2012.\n- Avid advocate of low tax policies and opposes increases in Council Tax; he is keen to ensure that pensioners and others on fixed incomes are given substantial rebates from the Council Tax.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_2025survey/content_4.html": "Every year I conduct a survey of residents so that I can act on your concerns, champion what matters to you and deliver what you want to see.\nSince being re-elected as your Member of Parliament, I have been busy delivering on the priorities you told me mattered: crime, schools, housing, the NHS, business and transport.\nTackling crime was the number one issue raised during the election.\nI have already met our Borough Superintendent to find out what the police are doing to keep us all safe. We are fortunate to live in one of the safest Boroughs in London but still crime is too high. I have been working as a close partner with the police and promoting the work they do every day.\nNext year we will have Local Elections to decide who runs your local Council.\nIn Harrow, the Conservatives have run the Council since 2022, gaining control after 12 years of Labour’s financial mismanagement. We have seen a great improvement with one-hour free parking rolled out, free bulky waste collections introduced, investment in our parks, resurfacing many roads and filling thousands of potholes. I hope your Conservative councillors will be re-elected so they can continue improving our Borough.\nIn Brent, we only have 5 Conservative councillors compared to Labour’s 49! I hope more are elected next year so we can start turning Brent Council around and improving services for residents. Having been a Brent councillor for 24 years and Leader of the Council, I know how important it is that the Council delivers high quality, value for money services for residents.\nThat’s why I would like to know your views ahead of these important elections, so please complete my survey below – thank you!",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_category_Articles/content_24.html": "Bob Blackman Secures £4.8 Million of SEND Funding 27th March 2024 Bob Blackman CBE MP Secures £4.8 million for SEND Students in Harrow Last January, Bob Blackman MP CBE launched his campaign to secure more funding for Special... ArticlesLocal NewsReports",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_bob-blackman-israel-denying-entry-2-labour-mps/content_19.html": "Yesterday, Bob reminded the House that we have previously refused to admit elected politicians.\nGiven that Israel is in a state of war against a terrorist entity, It is absolutely their right to refuse entry to people who call for boycotts against the state of Israel.\nFollow Bob online:\nFacebook: https://www.facebook.com/bobblackmanofficial\nInstagram: https://www.instagram.com/bobblackmanmp\nTwitter: https://twitter.com/BobBlackman\nWebsite: https://www.bobblackman.org.uk\nSubscribe to e-newsletter: https://bit.ly/3Vzviic",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_bob-blackman-cutting-nhs-waiting-lists/content_21.html": "Today, the Govt missed the deadline for issuing remediable service statements to doctors,\nWithout up to date information, doctors may cut their hours to avoid extra pension bills.\nThis will lead to less patients getting treated and the NHS waiting lists getting larger!\nFollow Bob online:\nFacebook: https://www.facebook.com/bobblackmanofficial\nInstagram: https://www.instagram.com/bobblackmanmp\nTwitter: https://twitter.com/BobBlackman\nWebsite: https://www.bobblackman.org.uk\nSubscribe to e-newsletter: https://bit.ly/3Vzviic",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_mental-health-support/content_8.html": "During the COVID-19 pandemic, the Government announced that people struggling with their mental health will be offered additional online support and practical guidance to help them cope. In recognition of the unprecedented challenges which the outbreak and extended periods of self-isolation resulted in, Public Health England published an online guidance setting out principles to follow to help people to manage their mental health during the difficult time, such as:\n- maintaining contact with friends and family via telephone and video calls, or social media\n- keeping a regular routine and sleeping pattern\n- focusing on a hobby or learning something new\nFull guidance for the public on the mental health and wellbeing aspects of coronavirus (COVID-19) can be found here.\nMental Health Information Pack\nWe have also produced a highly useful information pack, with tips on how to look after your mental health which may still be useful after the coronavirus outbreak, as well as contact information for organisations offering support. The pack be downloaded below.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_privacy/content_9.html": "This document outlines how Bob Blackman processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Bob Blackman\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Bob Blackman.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Bob Blackman, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Bob Blackman via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_investment-ps226-million-upgrade-northwick-park-hospital/content_16.html": "I am delighted that London North West University Healthcare NHS Trust is receiving £22.62 million which will be used for a new ward with 32 beds at Northwick Park Hospital. This comes after I successfully pressed the Government for earlier support to improve Northwick Park's Accident & Emergency Department.\nThis latest investment is one of 30 schemes across the country that will now be progressed for delivery in 2023/24. In total, the schemes will create 900 beds which includes over 60 intermediate care beds and improved space and assessment areas in A&E. It also includes the development and improvement to 4 Same Day Emergency Care services and 5 Urgent Treatment Centres.\nYou can read the letter I have received from the Secretary of State for Health and Social Care, Steve Barclay, below.",
  "https_www_bobblackman_org_uk_/https_www_bobblackman_org_uk_news_bob-blackman-itv-late-debate-show/content_32.html": "On Thursday, Bob joined ITV's The Late Debate show to discuss the Israel- Hamas conflict. Bob condemned the mainstream media taking the Hamas terrorists propaganda on face value as well as the disgraceful rise of anti-Semitism. Bob also thanked the Prime Minister for his actions to help the UK become smoke free, which he has campaigned in support of for over 10 years.\nClick here to watch the video."
}