{
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_the-role-of-an-mp/content_5.html": "THE ROLE OF AN MP\nWhat does an MP do?\nMPs are elected to Parliament by the residents of a constituency who are over 18 years old and register to vote. Following the 2019 General Election there are 650 constituencies in the UK.\nIn Parliament, MPs participate in debates, vote on proposed laws and discuss other matters. Some MPs are also members of parliamentary committees that examine proposed laws or the work of individual government departments. Some will also have a role as a government minister or as an opposition spokesperson. Most MPs also take on roles in cross party working groups on a particular policy topic, called All Party Parliamentary Groups - or APPGs for short.\nMPs can help their constituents by taking up issues with Government departments, asking questions and by representing local concerns in Parliament.\nIs Sarah your MP?\nSarah is the MP for the Chesham & Amersham constituency. This constituency covers Chesham, Amersham, Seer Green and Jordans, Penn Wood, and the Chalfonts. At the 2024 General Election the boundary was changed to also include Hazlemere and Gerrards Cross. You can easily check if you are in the Chesham & Amersham constituency via the Parliamentary website. All you need to do is to type your postcode into the box.\nCan Sarah help even if I live outside the constituency?\nSadly not. There is a strict Parliamentary rule that MPs can only offer assistance to people who live in the constituency they represent. The link above will provide details for your own MP and you should make contact with them. If you're contacting Sarah to ask for help for a friend or relative who does live in Chesham & Amersham constituency, please supply their details to us as well as your own. We will need their consent for GDPR reasons, and we will explain how that works when you contact us.\nHow I can help\nI can offer assistance with matters that Parliament and Central Government are responsible for, such as Government Departments or raising issues with Ministers. I can write to senior officials or Ministers in Government Departments and Agencies.\nMy staff often telephone Government Agencies like the UK Immigration and Visa Service or the DWP on behalf of constituents, and I also do so when this is necessary. I may lobby a Minister personally when appropriate. I can ask Parliamentary Questions of Ministers, which they are obliged to reply to (this does not guarantee that their answer will be useful!). I can apply for a debate in the House of Commons or in Westminster Hall if the issue is one that needs to be raised more widely – this does not guarantee that I will be successful in the ballot.\nI will also try to help when a private company has caused problems to you.\nI am not elected to Buckinghamshire Council. I have no direct control over the issues for which the local authority has responsibility – such as housing, roads, schools, public transport, refuse collection, and planning. However, I will try to assist wherever I can by contacting the Council to ask them to look into your situation, particularly if you have been in contact with them multiple times and they have not yet resolved the issue.\nUnfortunately, I cannot help you with filling in application forms for benefits or housing, or with legal problems. I cannot write to private individuals (for example, your neighbours) on your behalf. I cannot undertake research on your behalf for projects or study that you are undertaking.\nHow long will I take to reply to you?\nI receive thousands of requests for help, assistance and information, and I try, along with my caseworkers, to ensure that all work is dealt with as quickly as possible. All requests for help are looked at on receipt and urgent cases are prioritised as quickly as possible. I’m sorry that this sometimes means that you have to wait for a reply.\nPlease note that we prioritise personal cases and the response time for policy enquiries and mass email campaigns may take longer.\nI would also ask that you are mindful of my Safe Contacts Policy, which can be read here. Emails that are in breach of that policy will not be acknowledged.\nHow to find out how I voted or what I’ve said\nThe Parliament website shows progress for all bills before Parliament at the link below. However it is not particularly easy to navigate from there to finding the votes. You can put my name and the subject of the bill into the search box and it will bring up votes.\nIf you want to find out what I’ve said the search function on TheyWorkForYou is also good – you can enter an MP’s name along with a topic.\nWhat is the best way to invite me to an event?\nThe best way to invite me to an event is to email me at sarah.green.mp@parliament.uk\nWhen sending an invite, please be as clear as possible about what the event is, where it will be, the date and time it will run to and from. If you want me to do anything at the event – e.g. make a speech – please say.\nI receive over a hundred invitations a month, and sadly I am not able to make more than a very small minority. I will prioritise those within the constituency and those involving ordinary constituents or on the major issues within the constituency.\nFinding out about my expenses\nMy first priority is to ensure that I serve my constituents properly. The majority of my office and staffing costs have been used to fund the setting up and running costs of my constituency office and the staff team based there.\nAll MPs’ expenses are strictly controlled by the Independent Parliamentary Standards Authority (IPSA). Full details are on their website.\nMy role as International Trade and Wales Spokesperson for the Liberal Democrats\nI am the Liberal Democrat Spokesperson on two topics; International Trade and Wales. You are welcome to contact me about portfolio matters, but I do not have secretarial support to reply to the many good ideas that I am sent so I’m afraid that I may not be able to reply individually. However, I do read all the emails and pass them on as appropriate.\nFinding out more about how Parliament works\nThere are many resources available on the internet and in books. Parliament’s own website has much information on it. A good source of information for younger readers is the website of Parliament’s Education Service.\nBooking tours and tickets\nMy Westminster office is always happy to try and help to arrange a tour of Parliament for my constituents. These tours are free of charge when the House is sitting. Tours are very popular and are booked up many months in advance. Further information on MP booked tours of Parliament is here. If you would like my office to arrange a tour of Parliament, please contact me via email.\nCommercial tours of Parliament are also run at weekends and when Parliament is in recess. The commercial tours can be personally guided as part of a group or with an audio headset. You can also book a commercial tour that includes an afternoon tea. Further details can be found here.\nMPs can often arrange for you to watch a debate in the House of Commons. Please contact my office directly with details of your requirements. Further information on watching debates can be found here.\nYou can often get tickets just by queuing on the day, but not for popular sessions such as Prime Minister’s Question Time.\nYou can also watch Select committees.\nTo get tickets for Prime Minister’s Question Time\nThe Public Gallery for the House of Commons is very small. MPs receive two PMQs tickets for their constituents in each calendar month. To be added to the waiting list, please contact my office by email, but please bear in mind that the wait is likely to be several months.\nFind out more about Prime Minister’s Questions.",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_job-vacancies/content_3.html": "JOB VACANCIES\nAdministration Officer (part time)\nApplications Closing Date:\n11am on Monday 18th November 2024\nLocation: Negotiable: remote, constituency or Westminster\nSalary: £27,007 per annum, pro rata with annual reviews\nLength of Contract: Permanent\nJob Details:\nSarah Green MP is looking for an Administration Officer to join her team.\nThis is a part-time role of approximately 19 hours per week (2.5 days per week equivalent) that will support both Sarah’s constituency and Parliamentary work. Sarah would ideally like the post holder to commit to a pattern of working a half-day each weekday Mon-Fri. However all working patterns and flexible working arrangements will be considered.\nThe location of this role is negotiable, with opportunity to work remotely, in the constituency or in Westminster being available.\nThe successful candidate will provide administrative support for Sarah and will be primarily responsible for:\n-\nManaging the public-facing inbox, incoming post and phone calls\n-\nManaging the diary, arranging meetings, visits and logistics\n-\nSupporting Sarah in the administration of record keeping for budgeting and expenditure claims\n-\nAccurate data management of relevant files\n-\nManaging office supplies\nApplicants must be able to demonstrate exceptional administration skills and be proficient in the use of standard email applications, word processing and spreadsheet management.\nThey must have a meticulous eye for detail and be highly organised. They must also have strong verbal and written communication skills, an excellent telephone manner and work well in a team.\nUpon appointment you will be required to comply with the Baseline Personnel Security Standard, undertaken by the Members’ Staff Verification Office (MSVO). See Members’ Staff Verification Office (MSVO) page for further info. MPs generally pay staff in accordance with IPSA guidelines.\nInterview/Start Dates\nCandidates will be contacted for an interview within a week of the closing date. The successful candidate will start as soon as possible, subject to parliamentary vetting procedures.\nApplication Details\nIf you have what it takes to join our team, please submit a covering letter and CV to sarah.green.mp@parliament.uk\nPolicy Assistant\nApplications Closing Date:\n11am on Monday 18th November 2024\nLocation: Westminster\nSalary: £27,007 per annum, pro rata 4 days per week\nLength of Contract: Fixed term until Sep 2025\nJob Details\nSarah Green MP is looking for a Policy Assistant to join her team in Westminster.\nThis new role will work alongside Sarah’s Parliamentary Assistant in her Westminster office and will be primarily responsible for:\n-\nResearching and drafting replies to policy queries raised by constituents\n-\nAssisting with the drafting of Parliamentary Questions\n-\nAssisting with the drafting of various speeches and briefings as required\n-\nMonitoring the mass-email campaigns which are sent to Sarah and drafting appropriate replies\n-\nVarious administrative tasks in the Westminster office (for example, entering Sarah into the ballot for Parliamentary question sessions).\nThere is no expectation that you will have experience of a similar role. Instead, you should be able to demonstrate and evidence:\n-\nOutstanding verbal and written communication skills - to include in-person and telephone conversations\n-\nAn understanding of the role of an MP\n-\nA passion for politics and current affairs\n-\nExcellent organisational skills\n-\nBeing a self-starter\nThis role is not suitable for applicants who wish to work remotely.\nUpon appointment you will be required to comply with the Baseline Personnel Security Standard, undertaken by the Members’ Staff Verification Office (MSVO). See Members’ Staff Verification Office (MSVO) page for further info. MPs generally pay staff in accordance with IPSA guidelines.\nInterview/Start Dates\nCandidates will be contacted for an interview within a week of the closing date, if not before. The successful candidate will start as soon as possible subject to parliamentary vetting procedures. Sarah may decide to appoint a candidate before the closing date if we find an exceptional applicant, so early applications are encouraged.\nApplication Details\nIf you have what it takes to join our team, please submit a covering letter and CV to sarah.green.mp@parliament.uk",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_about-sarah/content_8.html": "ABOUT SARAH\nSarah Green was elected as the Liberal Democrat MP for the Chesham & Amersham constituency in a Parliamentary by-election in June 2021. Since then, she has spent her time working hard for the people and businesses in the constituency.\nSarah has helped more than 15,000 local people who have contacted her with requests for assistance, advice and information.\nShe has been particularly concerned for local families, communities and businesses who are struggling with the cost of living. She conducted a Cost of Living Survey in the constituency in 2022 and has then raised in Parliament the issues highlighted.\nSarah speaks up for our NHS to ensure it’s there for us when we need it. She has helped many constituents who have been impacted by waiting times and difficulties accessing NHS services, as well as supporting our overworked NHS staff.\nSarah works to protect our natural environment and for action on climate change. In 2023 she tabled a Private Members Bill for the Protection of Chalk Streams. Sadly it fell at the Second Reading when time ran out for the Parliamentary session. She re-presented it to Parliament in early 2024 and though this also ran out of time for debate before the 2024 General Election was called, Sarah continues to work across Party lines with MPs from different parties to try to implement protections for these precious, rare ecosystems.\nA key election pledge that Sarah made when she was elected was to hold HS2 to account. She has been true to her word and has raised many individual complaints with HS2 on behalf of residents, including environmental concerns, noise and traffic problems arising from the works and many more. She has spoken several times in Parliament about concerns over HS2 including calling for the project to be scrapped as the business case continued to collapse with the announcement of further project delays and the cancellation of the northern phase. She played a key role, working with Missenden Parish Council and Amersham Town Council, in uncovering the misuse of a water hydrant by HS2 contractors in Summer 2022.\nShe has built a reputation as a vocal campaigner for justice for victims of the surgical mesh scandal. After meeting with a constituent who had undergone surgical mesh implantation and suffered horrific consequences, Sarah has raised the issue several times in Parliament. She is Vice Chair of the All Party Parliamentary Group on the Mesh scandal. The victims are mostly women and many have been left in appalling pain.\nIn 2023, working with an MP from the Scottish National Party, Sarah co-founded a new All Party Parliamentary Group on Crohn's disease and Colitis.\nYou can see what Sarah has recently spoken about in Parliament here and see the Written Questions she recently submitted to various Ministers here\nSarah lives in Chesham and loves to go walking in the Chiltern countryside to relax.",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk/content_1.html": "top of page\nSARAH GREEN MP\nfor Chesham and Amersham Constituency\nSarah's promise to you\nStanding up for you\nI will continue to stand up for local families, communites and businesses\nFighting for our NHS\nI will continue to fight for our NHS and its staff, to ensure that it is there for us when we need it\nProtecting our Environment\nI will continue to work to protect our natural environment and for action on climate change\nbottom of page",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_social-media-policy/content_4.html": "SOCIAL MEDIA POLICY\nMy social media profiles are on Facebook and X. They are owned and managed by me, with the support of my team. The purpose of these channels is to increase awareness of my work, and share information I feel is useful to my constituents.\nI do not normally reply to comments on my social media channels. I engage with local constituents by email, in surgeries, at events and meetings; I regularly knock on doors and publish surveys to ask for your views. However, I do not engage in discussions on social media.\nPlease do not use social media to tell me about a problem you need my help with - instead please email me on sarah.green.mp@parliament.uk Due to Parliamentary protocol your email needs to include your full name and residential address in the constituency or I will not be able to assist you.\nBreaking the following ground rules on my social media channels may lead to your comments being hidden or deleted, users may be blocked without notice, and serious breaches may be reported to the police or social media platform.\n-\nPlease comment respectfully.\n-\nAbuse, threats or harassment of any kind will not be tolerated – even if you think that the words you used were mild or intended as a joke.\n-\nNo bigotry, or discriminatory terms.\n-\nWhile comments that disagree with my position will normally be allowed to remain on my page, commenters should not be promoting other political parties or campaigns - please use or create your own pages for such messages.\n-\nComments that misrepresent my actions, beliefs or position on an issue will be removed.\n-\nComments that are intended to deflect or divert attention from the content of the main post are not permitted.\n-\nSpamming is not tolerated. This includes persistent posting of comments across multiple posts or platforms that say the same thing or an unrelated comment to the original post. These comments will be deleted and the account that is posting them may be blocked without any prior notice.",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_volunteer/content_10.html": "VOLUNTEER TO HELP SARAH\nIf you already know what you'd like to do to help Sarah's campaigns, you can jump straight to the form to share your details here.\nThere are all kinds of tasks that volunteers can do that are extremely helpful.\nThe most well-known, and the first one people think of is delivering leaflets to people's homes. This helps Sarah to keep in touch with local residents and inform them about what she is doing.\nThere are many other ways to help as well:\n-\nKnocking on doors, to speak to voters\n-\nHelping with clerical work, like stuffing envelopes\n-\nDoing data entry and other computer-based tasks\n-\nJoining our fundraising team to help organise events and socials\n-\nHelping with the book-keeping and admin for our events\n-\nAgreeing to display a poster in your garden at election time\n-\nJoining our garden poster team who put the posters up in people's gardens at election time\n-\nDriving people, or things like leaflets, around the constituency to drop them off in specific places\n-\nHelping to manage the leaflet deliveries in a small area, making sure the deliveries are completed by an agreed date by other volunteers\n-\nMaking phonecalls to supporters and voters\n-\nSharing your professional expertise with us if you feel it could be of use in some way\n-\nOffering storage space (for example in a lockable shed or garage) for some of our equipment\n.... and there are many other ways to help as well!\nWhatever you can do, your help will be valued and appreciated.",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_support-sarah/content_6.html": "SUPPORT SARAH\nWays you can help\nOur volunteers help Sarah by delivering leaflets around the local area, knocking on doors, organising events, stuffing envelopes and lots more!\nIf you would be happy to volunteer some time to help in any way, please do get in touch, find out more here.\nTo join the Liberal Democrat party, please click here.\nHelp fund our campaigns\nUnlike the other political parties, Liberal Democrats are not funded by big business or trade unions. Instead we rely on donations from our supporters. Every pound you give helps us campaign here in Chesham and Amersham to re-elect Sarah Green as our local MP.\nDonations can be made on this link, or get in touch if you'd like to discuss your donation.\nJob Vacancies\nWhen we are looking for staff, we will post the advert to the website Work For an MP as well as listing it here and on the Liberal Democrat Party website.\nYou are welcome to submit speculative applications that can be kept on file but they may not be acknowledged at busy times.",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_contact-sarah/content_9.html": "top of page\nCONTACT SARAH\nPARLIAMENTARY CONTACT\nLOCAL PARTY CONTACT\nChesham and Amersham Liberal Democrats\n87 High Street\nChesham\nHP5 1DE\nPlease use this email address for any offers of campaign help, volunteering or any questions about Sarah's campaigns.\nbottom of page",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_privacy-policy/content_7.html": "PRIVACY & DATA POLICY\nIf you would like to be removed from all contacts by Sarah Green and the Liberal Democrats, please email data.protection@libdems.org.uk\nThe Liberal Democrats' Privacy Policy can be viewed here https://www.libdems.org.uk/privacy\nContact us\nIf you would like more information on any part of this privacy policy, or have any questions about this policy, then please contact us by emailing sarah.green.mp@parliament.uk\nChanges to our Privacy Policy\nWe keep our privacy policy under regular review and as such it may be updated from time to time so you should check it each time you submit personal information to us. The date of the most recent revisions will appear on this page. If you do not agree to these changes, please do not continue to use this website to submit personal information to us.\nData Retention Policy\nSarah Green and her office collect and process personal data from constituents and members of the public which can include emails, letters, images and phone records in electronic and hard copy format.\nThe UK Data Protection Act 2018 (UK DPA) and the UK General Data Protection Regulation (UK GDPR) requires that data subjects are informed of how their data will be used, and in particular how long their data will be retained for. These are known as data retention periods.\nData Controllers should retain personal data no longer than necessary and process data with the key principles of storage limitation and data minimisation in mind.\nThis policy and schedule details how long Sarah Green, as the Data Controller, will process personal data.\nGeneral\nWhere required by legislation, regulation or where the data is relevant to an ongoing Casework matter, data will be retained for as long as required. Otherwise, data will be retained for 1 year after the last correspondence or case closure.\nSpecial Category data - The UK GDPR defines Special Categories of Data, specifically, racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, and the processing of genetic data, biometric data for the purpose of uniquely identifying a person, data concerning health or data concerning a natural person’s sex life or sexual orientation.\nThe process of data deletion / destruction\nDecisions will be taken at the point of documents reaching their retention date. A review will be made prior to the deletion / destruction of the document. Where there are hard copy documents, these will be disposed of securely.\nUpdated: 28 May 2024",
  "https_www_sarahgreen_org_uk_/https_www_sarahgreen_org_uk_safe-contacts-policy/content_2.html": "SAFE CONTACTS POLICY\nSarah and her team have already been contacted by thousands of local residents asking for help with different issues. The overwhelming majority of contacts have been appropriate and polite. However, sadly, we have already had a few instances of unacceptable or threatening behaviour.\nFollowing the murder of David Amess MP, and Jo Cox MP some years before, Sarah Green and her team will be working within the following safe contacts policy:\n-\nThreats, abuse, harassment, swearing, intimidation, aggression and shouting will not be tolerated.\n-\nIf your contact with Sarah or a member of her team includes any such content, we will end our communication with you and we may report you to the appropriate authorities.\n-\nThis policy applies to all forms of contact, including email, social media, phone calls and in-person events and meetings.\nWe appreciate that you may be contacting Sarah about a situation that is causing you great frustration or distress, but it is not appropriate for Sarah or her team to be subjected to any form of abusive behaviour.\nThank you for your understanding and co-operation."
}