{
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_2025_02_06_harboroughs-rubbish-first-posted-7th-dec-2021/content_9.html": "Harborough, Oadby & Wigston Green party have release their report into the effectiveness of the recycling system in Harborough District, the report does not cover the affectivness of the system rather just the self declared rates of the council.\nA number of Freedom of information requests were made to identify the key figures required to plot rates over the last decade, we also made requests to see how the CO2 emmissions of the Waste handling system were being recorded.\nThe big picture is that “Recycling” rates have been dropping and that there is a clear correlation with the decrease and the closure of the free Green waste collection service which also seems to have instigated a downward trend after the initial peak of Green waste entering the general waste system.\nThe report can be read below.",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk/content_1.html": "Welcome to your local Green party representing the District of Harborough and the Borough of Oadby & Wigston. We are responsible for the fielding of candidates in these 29 wards with 55 councillors, and the candidate in the general elections for the Harborough, Oadby & Wigston constituency.\nAs the Green party we are passionate about creating a better, more inclusive, sustainable world where our children can thrive, and where wealth is fairly shared amongst us all to create a healthier and more equitable society.\nWe are a volunteer lead organisation without any paid workers, we need to raise our own funds for all that we do as we do not accept large donations that may have strings attached and so we need all of the support you can give if you want to see a better future.\nIf you want a greener future then please become a member, but you do not need to be a member to support or volunteer for us. Just get in touch to see how you can help.\nWe’re working hard to improve your area\nimproving the area\nWe run regular litter picking sessions in association local residents and community groups.\nListening to you\nRegularly surveying residents to find out what local issues are important to you, and identify any problems in the area.\n🌳\nProtecting local trees and encouraging more to be planted.\nImproving local air quality.\nImproving recycling.\nEngaging with schools\nEngaging with local NHS\nWant to hear about the work we’re doing?\nNews\nFind out what we’ve been up to, about issues in your area, and see the work we’ve done in the past.\n- Harborough, Oadby & Wigston Green party announces its candidates for 2025 County elections\n- Labour to punish people with disabilities\n- Welland ward surgery\n- Leicestershire Waste partnership consultation response – first published 14th April 2022\n- Harborough’s rubbish – first posted 7th Dec 2021\nUpcoming Events\nGet involved to help get Greens elected. A Green Councillor can make a world of difference to your local area.\n- No upcoming events",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_author_darrenwoodiwiss/content_17.html": "2 April 2025 / 2 April 2025 by darrenwoodiwiss\nWe are delighted to announce a full slate of candidate in Harborough, Oadby and Wigston’s 12 seats in the forthcoming elections on May 1st. This is the second time that we have and only being 2 short, due to reserved occupations, in the District elections in 2023 and the first time there has been a […]\nRead more »\n11 March 2025 by darrenwoodiwiss\nAs many of you might have seen on the BBC, and other media outlets, Kier Starmer and his government are planning once again to cut the welfare bill. This has caused considerable concern and anguish amongst many disabled people who are worried it’ll leave them without food, heating or even making them homeless. The Labour […]\n26 February 2025 / 26 February 2025 by darrenwoodiwiss\nOn Saturday 22nd Feb, we were delighted to hold a surgery for residents of Welland Ward to hear directly about any concerns as well as share ideas about how to support and develop the community further. Areas discussed included, flooding, community projects, the local plan, parking and traffic issues. Our next surgery will be Saturday, 28th June, […]\n6 February 2025 / 6 February 2025 by darrenwoodiwiss\nThe Leicestershire Waste partnership has published a consultation to review how they collect our waste. There are many mentions of the ‘Circular economy’ but it is our view that this cannot be achieved without a move to kerbside sortation, as Harborough District previously had before the current system. They have proposed 11 pledges which we […]\nHarborough, Oadby & Wigston Green party have release their report into the effectiveness of the recycling system in Harborough District, the report does not cover the affectivness of the system rather just the self declared rates of the council. A number of Freedom of information requests were made to identify the key figures required to […]\nFirst published 21st July 2022 Please find the submission from the Harborough, Oadby & Wigston Green party. We recognise and commend the actions undertaken and the ambition in the statement however we feel that the council is attempting to limit its commitment to Scope 1 (Councils direct activities) emissions. For the Councils true emissions to […]\n29 July 2024 / 29 July 2024 by darrenwoodiwiss\nWelcome to our new website. unfortunately our last site was decommissioned during our webmasters summer holiday so we have lost all of our previous content, but this give us the chance for a fresh new feeling. We hope you enjoy the new look and feel and bear with while we update the pages and content.",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_people/content_7.html": "Your Local Councillors\nCllr darren woodiwiss, mkt harborough – welland\nDarren has lived in the Welland ward since 1997 and is the father of three. He cares passionately about the environment and sustainability, and was a cofounder for Transition town market harborough and a voluntary director of Harborough Energy.\nDarren joined the Green Party in 2015 as he had always wanted the option to vote Green and it was the only party with the policies he supported.\nHe is a member of the cabinet and is portfolio holder for Environmental and Climate change.\nCllr dr lynne taylor, market harborough – welland\nLynne joined the Green Party in 2021 after becoming increasingly concerned that other parties were not responding urgently to the Climate Crisis and were failing all of our futures and the futures of our children and grandchildren.\nLynne is passionate about protecting and maintaining public services, and this is one of the main reasons she joined the Green Party. Lynne has worked in the NHS children mental health for 18 years. She believes that everyone has the right to have free, and excellent health care and social care when they need it.\ncllr rose foreman, market harborough – welland\nRose has been interested in environmental issues since she was a teenager. She studied politics at university and then completed a master’s degree in Human Rights Law.\nRose joined The Green Party around the 2015 election as she felt that we best represent her values. She has worked for a local charity as well as housing and homelessness at local councils. She is passionate about helping others and protecting the environment\nYour Local Officers\ndarren woodiwiss, membership & coordination\nDarren helped reorganise the Leicestershire Green party and established the local Harborough, Oadby and Wigston party in which he has consistently held posts.\nHe believes that you need to be the change you want to see.\nmary stanhope-morgan, membership/2nd officer\nMary lives in a farm on the ourskirts of Harborough. She has a background in food development and worked with Jamie Oliver on his school meals project.\nMary is a keen environmentalist and equestrian.\nstephen rankine, treasurer\nStephen is a retired financial director with a keen interest in the environment and building a better future for his grandchildren,\nStephen volunteers with Harborough Woodlands and the wildlife trust, helping to build a better environment for our community.\njames Bayliss, coordinator for oadby & wigston\nJames has lived in Oadby and Wigston for the past 12 years, but he have been visiting and staying in the borough since 1992. He had been studying politics since 2005 gaining two degrees (BA politics 2012 & MA in international relations in 2018)\nDespite having multiple disabilities, James is determined to overcome any challenge he faces. He is passionate about bringing welfare and environmental reform, making the local area, a more prosperous and safer place for all to live and work.\nmandy sanders, fundraiser & membership\nI am passionate about the environment and protecting our countryside. Throughout my life and especially since moving to Leicestershire 36 years ago, I have loved spending time in the outdoors – walking, cycling and riding.\nAs a student in the 1980s, I followed the emergence of the Green Party with interest and ever since I have supported environment charities like Greenpeace and Friends of the Earth.\nMy working life began as a journalist until 20 years ago when I swapped to working for charities as a fundraiser. My current job is with The Duke of Edinburgh’s Award.\nPatrick Barlow, Coordinator for Kibworth\nI grew up on a family dairy, beef and arable farm, and have a BSc in Agriculture, so I know that large scale rewilding is not feasible for most famers. There is much that can be done though with public spaces, allotments and gardens.\nI was an accountant for most of my career, advising on fund raising, buying and selling businesses, working with other professionals.\nI’m now retired, spending my time feeding mice, slugs and caterpillars with the produce on our allotment. I support Leicester Tigers and live in hope that the glory days will return.",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_donate/content_4.html": "We’re powered by people, not big business\nYour donation will help us get Greens elected.\nThe Green Party is funded through donations by individuals like you. We don’t take donations from businesses that are trying to sway our politics. Politics is about people, and delivering a society that puts them first. Can you donate to help us get Greens elected?",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_2024_07_29_welcome-a-new-platform-a-new-website/content_11.html": "Welcome to our new website. unfortunately our last site was decommissioned during our webmasters summer holiday so we have lost all of our previous content, but this give us the chance for a fresh new feeling.\nWe hope you enjoy the new look and feel and bear with while we update the pages and content.",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_contact/content_3.html": "Skip to content\nSkip to footer\nHarborough, Oadby & Wigston\nMenu\nCandidates\nNews\nElections Timetable\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nContact Us\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_leicestershire-county-council-elections/content_18.html": "Leicestershire County Council has eleven Electoral divisions that fall into the remit of our local party. The County council is the higher tier authority that sits above the Boroughs and Districts and it looks after our highways and paths, education and social care along with many other responsibilities.\nCounty Council elections May 2025\n| Division Broughton Astley Bruntingthorpe East Wigston Gartree Launde Lutterworth Market Harborough East Market Harborough West & Foxton North Wigston Oadby Oadby South and West Wigston | Candidate |\nCounty Council elections May 2021\n| Division Broughton Astley Bruntingthorpe East Wigston Gartree Launde Lutterworth Market Harborough East Market Harborough West & Foxton North Wigston Oadby Oadby South and West Wigston | Candidate Mark Green Mary B Smith Chris Cooper-Hayes Gillian Buswell Melanie Wakely Carl Tiivas Mary Morgan Darren Woodiwiss Richard Ansell Bethan Painter Sakile Simpson Amanda Sanders |\nCounty Council elections May 2017\n| Division | Candidate |\n| Market Harborough West & Foxton | Darren Woodiwiss |",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_news/content_2.html": "Harborough, Oadby & Wigston Green party announces its candidates for 2025 County elections 2 April 2025 / 2 April 2025 by darrenwoodiwiss We are delighted to announce a full slate of candidate in Harborough, Oadby and Wigston’s 12 seats in the forthcoming elections on May 1st. This is the second time that we have and only being 2 short, due to reserved occupations, in the District elections in 2023 and the first time there has been a […] Read more »\nLabour to punish people with disabilities 11 March 2025 by darrenwoodiwiss As many of you might have seen on the BBC, and other media outlets, Kier Starmer and his government are planning once again to cut the welfare bill. This has caused considerable concern and anguish amongst many disabled people who are worried it’ll leave them without food, heating or even making them homeless. The Labour […] Read more »\nWelland ward surgery 26 February 2025 / 26 February 2025 by darrenwoodiwiss On Saturday 22nd Feb, we were delighted to hold a surgery for residents of Welland Ward to hear directly about any concerns as well as share ideas about how to support and develop the community further. Areas discussed included, flooding, community projects, the local plan, parking and traffic issues. Our next surgery will be Saturday, 28th June, […] Read more »\nLeicestershire Waste partnership consultation response – first published 14th April 2022 6 February 2025 / 6 February 2025 by darrenwoodiwiss The Leicestershire Waste partnership has published a consultation to review how they collect our waste. There are many mentions of the ‘Circular economy’ but it is our view that this cannot be achieved without a move to kerbside sortation, as Harborough District previously had before the current system. They have proposed 11 pledges which we […] Read more »\nHarborough’s rubbish – first posted 7th Dec 2021 6 February 2025 / 6 February 2025 by darrenwoodiwiss Harborough, Oadby & Wigston Green party have release their report into the effectiveness of the recycling system in Harborough District, the report does not cover the affectivness of the system rather just the self declared rates of the council. A number of Freedom of information requests were made to identify the key figures required to […] Read more »\nHarborough DC Climate Emergency Consultation Questions – Reposted 6 February 2025 / 6 February 2025 by darrenwoodiwiss First published 21st July 2022 Please find the submission from the Harborough, Oadby & Wigston Green party. We recognise and commend the actions undertaken and the ambition in the statement however we feel that the council is attempting to limit its commitment to Scope 1 (Councils direct activities) emissions. For the Councils true emissions to […] Read more »\nWelcome, a new platform a new website 29 July 2024 / 29 July 2024 by darrenwoodiwiss Welcome to our new website. unfortunately our last site was decommissioned during our webmasters summer holiday so we have lost all of our previous content, but this give us the chance for a fresh new feeling. We hope you enjoy the new look and feel and bear with while we update the pages and content. Read more »",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_2025_02_06_harborough-dc-climate-emergency-consultation-questions/content_13.html": "First published 21st July 2022\nPlease find the submission from the Harborough, Oadby & Wigston Green party. We recognise and commend the actions undertaken and the ambition in the statement however we feel that the council is attempting to limit its commitment to Scope 1 (Councils direct activities) emissions. For the Councils true emissions to be tackled Scope 2 (Councils directly procured emissions) and Scope 3 (Emissions from Council procured services, waste collection and transfer)\nWe further recognise that no commitments are made for actions to reduce the emissions in the geographical area that is represented by the Council, the wider community, industry, retail, transport and agriculture. For this to be a meaningful action plan all of these must be included.\nWe note that Leicestershire County Council has enrolled to UK100 which is a commitment to deal with these wider geographic emissions from Leicestershire and so we strongly recommend that Harborough District Council also enrol and work with LCC on these issues where responsibility is shared between the two tiers of local government.\nPlease find our other recommendations below.\nThe Council commits to demonstrate political and corporate leadership in acting on climate change.\n2. What else can the council do, given that not all areas of activity are the responsibility of the council?\n- Become accredited as a Carbon literate Council\n- Review the Local Plan and other Plans and Policies to ensure they support reducing greenhouse gas emissions\n- Ensure that climate impact is embedded in all council decision making\n- Ensure that all employees pension assets are invested in sustainable funds which necessarily excludes all corporates engaged in fossil fuel exploration and supply\n- Lobby national government for changes in planning and transport laws and for more resources to tackle the climate crisis\n- Join UK 100 Group – UK100 is the only network for UK locally elected leaders who have pledged to play their part in the global effort to avoid the worst impacts of climate change by switching to 100% clean energy by 2050. Leicestershire County council have joined and so a combined & coordinated approach would save resources.\nUK100 | An ambitious network of 100+ UK local authorities | UK100\n- Employ triple bottom line accounting (financial, social, environmental benefits / costs) to prioritise environmentally positive projects\n- Produce regular annual carbon reports covering all activities that are transparent and accessible to all and with the raw data sets open to public scrutiny.\n- Ensure CO2e reductions are included in neighbourhood plans, local plans, spatial reviews etc.,\n3. Who should we be working with?\nYour environmental audit should pinpoint all stakeholders, but I imagine this will include:\n- The entire Council supply chain network to influence behaviour in accordance with the Council’s green objectives\n- Pension providers: including the LGPS Central Fund and the LCC Pension Fund and all asset managers that are involved in advising the choice of funds, most of Leicestershire’s councils have declared Climate emergencies and yet the pension fund still insists on investing in fossil fuels.\n- Employees: training across the board to provide specialists in every department; ensure everyone understands they are working to a clear carbon budget; prioritisation given to climate change in every decision by the executive, planning committee and scrutiny committee\n- Local environmental groups: making use of the wealth of knowledge and commitment that is in the community already; eg\nClimate Action, Leicester, Leicestershire\nSustainable Harborough Community\nHarborough Woodland\nHarborough Energy\nHarborough Eco village\nLeics & Rutland Wildlife Trust\nWelland Partnership\nHarborough, Oadby & Wigston Green Party\nPlus National groups eg Woodland Trust, Green Building Advisory Service\n- Work with other councils, particularly Leicester City and Leicestershire CC to spread ideas, best practice and increase influence\n- Work with local schools to include Climate awareness as part of their curriculum, Dale Vince of Ecotricity has created a climate curriculum that is currently being trialled.\n4. How do we best engage with MPs?\n- We assume there is a regular engagement already with the sitting MP, Neill O’Brien ! if you don’t, then a line of communication should be sought as a matter of urgency;\n- MPs need to be engaged with the issues and what is required to resolve the issue\n- work with other local councils across the country to employ best practice (there is already the combined authority approach in waste)\n- Make use of lobbying to influence planning and transport laws in favour of the council’s green objectives\n- National planning law needs to require all new buildings to be highly insulated and to include renewable energy generation like solar panels\nThe Council commits to managing its own assets and services, with the aim of reducing carbon emission to net zero by 2030, as far as practical.\n5. It will be difficult to move away from gas heating, how do we best address this?\nFor the Council assets\n- Refurbish the Leisure centre, do not replace it, replace plant with low carbon technologies (I am sure Harborough Energy would be interested, solar PV on roof, wind on the ridge, solar thermal for the pool heating) but you can immediately switch off the diesel generator that powers the fan on the inflatable football pitch that has been running 24/7 since its installation\n- A full building fabric assessment should be made by a Retrofit assessor. Interventions to reduce the heating load should be considered and/or capex should be assigned for replacing the boilers with heat pump technology.\nThe wider community\n- Absolutely vital that planning consents given to developers contain conditions regarding electric powered heating systems including, but not exclusively, heat pumps. The expectation is that hydrogen as an alternative to natural gas will be feasible in the near future and therefore all boilers must be compatible with this conversion\n- Solar on all viable council roofs in the next 5 years and support for solar on all privately owned roofs\n- Licensing scheme for all private landlords requiring them to improve energy efficiency to high levels\n- Training people to insulate their own homes – there will not be enough professionals to do this work\n- Promote ‘Rent-a-Room’ schemes with council support (credit risk checks etc.) to generate tax-free income which can be used to improve insulation – this has add-on benefits in satisfying housing demand and improving mental wellbeing\n- Sponsor, with partners, a community retro-fitting co-operative (to insulate homes)\nhttps://retrofitworks.co.uk/community-groups\n- Advisory service to access grants and advice to promote insulation, solar panels. PV cells, heat pump systems. A trusted voice and signposting service\n- Work with Harborough Energy\n- Work with partners to encourage businesses to reduce energy / carbon – insulation, led lighting, solar panels, PV cells, wind etc\n- Supplementary planning conditions to require new builds to meet highest environmental standards\n- Lobby hard with partners and councils to demand that government grants / schemes are run through local councils – trusted organisations – to maximise take up, impact and run ethically\n.\n6. What do we need to include in our procurement processes to reduce emissions?\n- All your suppliers must be able to submit environmental/CO2e emission audit assessments as a condition of their continued supply\n- You should set minimum standards against which suppliers compete for contracts, eg, they must be Carbon Literate\n- Procurement contracts should embed the requirement for CO2e reduction plans with Net zero being achieved at the soonest possible time. For instance, all waste collection and transfer vehicles to be Zero emissions, Likewise for parks maintenance and street cleansing contracts.\n- Procurement should not just be awarded to the lowest tender, financial, environmental and social costs should be considered equally. (Part of the triple bottom line accounting)\n- Continuous monitoring of progress to these plans is essential with penalties embedded in the contracts\n- Where the CO2e scope is beyond Scope 3 but known, such as the incineration of waste collected through the black bin and Recycling residue, the council must include this in its annual reporting as it directly causes these emissions through the structure of its contracts.\n- Work with other councils & purchasing organisations (eg ESPO) to set common standards and maximise impacts\n- Ban single-use plastics and require meat-free and low waste catering in council premises and events\n- Tree planting targets for the council to plant far more trees (mostly nut and chestnut) on its own land and on green spaces and encourage others to do the same\n- YOUR COMMUNITY, if you feel you do not have sufficient remit then a citizens assembly should be formed to advise on what policies the council should implement.\nThe Council commits to working with residents and communities to support their actions in reducing emissions and help them increase their resilience to the impacts of climate change.\n7. How can we encourage more people to reduce their own emissions, without incentives?\n- If there is no scope for incentives, and here you must lobby Central government to provide the tools to do it, then disincentivising the wrong behaviour is the next option, such measures as restricting cars in public places such as town centres\n- A system of park-and-ride may be beneficial\n- You should consider property EPC ratings when calibrating council tax valuations\n- Encourage local schools to instigate meat-free days and reduce meat and dairy in their meals – this dietary change will spread to many private households\n- Train people in repair and promote businesses with these specialist skills\n- Introduce a climate education strategy employing an Environment Education Team to support individuals, schools and businesses\n- Establish a trusted advice service that the Energy savings Trust would have provided before they were defunded.\n- Demonstration sites so people can get to understand the available technologies\n- Train and retain the services of 2-3 Retrofit assessors\n- Offer targeted energy efficiency audits to homes, particularly older properties\n- Launch a Green Bond to raise money for Green initiatives which will allow some incentives\n8. How can we encourage more people to move to sustainable transport, including walking and cycling?\n- Again I come back to restricting cars in the town centre\n- Using park-and-ride schemes with electric transport from out-of-town car parks\n- This has the enormous benefit of improving air quality in the town and making it much safer for pedestrians and cyclists; that will be enough to incentivise people to walk and cycle\n- Introduce pre-announced improvements so that residents know the trend is way from cars, such as:\n- Congestion charge in the town centre along with an extension to the blue badge scheme; used to fund the park-and-ride scheme and bus passes for low-income residents\n- Close streets outside schools at pick-up and drop-off time; school-age bus travel to be free\n- 20 mph town limit on all roads to reduce air pollution and make cycling safer; all limits to be enforced by speed camera NOT speedbumps which accentuate air pollution\n- More bus and segregated cycle lanes created by making the roads one-way for cars\n- Stop car access to town centre side streets to pedestrianise them and provide space for open-air cafes and restaurants. This could be done at weekends, so gradually so people can see the benefits. A traffic free town centre could host festivals, music, performance, art etc. Doing this regularly will get people into the habit of visiting on traffic free days\n- Introduce low traffic neighbourhoods / shared streets initiatives\n- The Council needs to be allowed to run its own not-for-profit public transport service\n- Encouraging local employers keeping close to the town is a good way to reduce commuting\n- Provide secure cycle storage in the town centre, covered by monitored CCTV\n- Engage with taxi drivers to encourage a shift towards electric or low emission vehicles with a view to only licensing non-internal combustion energy taxis from Jan 2022. Apply increased permit costs for the most polluting vehicles operating as taxis.\n- Only allow electric Ice-cream vans from the end of 2021. No more idling diesel engines among crowds of children.\n- Lobby Leicestershire County Council and bus operators to move to an all electric fleet as soon as possible\n- Sponsor a car share app / scheme and electric car club\n- Extend cycle purchase schemes to electric bicycles\n- AN INTEGRATED TRANSPORT STRATEGY based on travel census to establish what is really required\n9. What else can we do in relation to promoting local food and local food growing?\n- Provide / facilitate land for allotments – all have long waiting lists\n- Provide / facilitate land for small holdings\n- A decade ago Transition Town market Harborough approached HDC to create a permaculture community farm on the Naseby square disused garage site. Support is required to find a suitable semi urban site where such a farm (2-5 acres) can be established as this would be an important local educational facility, green tourism destination as well as provider of wholesome food.\n10. How can we best encourage better public transport and lift sharing?\n- Ensure current services are reliable (currently cancellations make service unreliable)\n- Council to develop own services based on community transport schemes elsewhere\n- Council to promote a selected lift sharing application\nThe Council commits to working with businesses to support their actions in reducing emissions and help them increase their resilience to the impacts of climate change.\n11. How can we best engage with businesses?\n- Provide consultation and advice on sustainability to help businesses choose the most sustainable suppliers through group contract arrangements negotiated by the Council\n- The Council’s legal department will need to alert local business to the risks of ‘Climate Crime’ in respect of which we are seeing increasing litigation across the world\n- Advisory / signposting services (with partners) to encourage energy / carbon savings; encourage tree planting, planting for insects\n- Convene energy reduction workshops to support businesses, particularly smaller SMEs\n- Release an annual state of the town report which details economic, social and environmental factors (The Sustainable Harborough project release a proof of concept report)\n12. How can we promote our good practice to encourage others to do the same?\n- First and foremost, make sure your practice is indeed ‘good’, then you can justifiably promote it\n- If you disincentivise bad practice, you will encourage the many good businesses to relocate and thrive\n- Encourage local community energy generation with local involvement – we already have Harborough Energy, but to my knowledge the Council has never promoted it – this could power district heat pumps or provide local electricity at lower cost for residents\n- Biomass is not proven as a sustainable fuel and should be avoided\n- Provide tools and training for carbon footprinting – develop a rating system to say how they are doing publicly; offer awards; give examples of basic things they could do to get the best rating which they could then use in marketing and public relations – examples such as:\n- Buying green electricity\n- % of profit invested in insulation\n- Support for staff not to drive to work\n- Work with parish councils and other landowners to develop pollinator sites\n- Initiate a 5 year, district wide Climate awareness program to ensure the problem is understood and to dispel the normal denier arguments. We need to bring the community to consensus so they work with us.\n- Create a partner/stakeholder group to help co-ordinate district-wide action and provide external scrutiny\n- Create a dedicated Climate officer role\nThe Council commits to ensuring that new development is designed to mitigate emissions and be resilient to the impacts of climate change.\n13. Should we ask developers to build to higher standards?\n- Supplementary planning guidance should be implemented to enforce higher standards\n- Yes, it should be a condition of any planning permission that all new-build are to PassiveHaus standards.\n- There neds to be a carrot/stick for developers so maybe fast-track planning permission for developments within the local plan which will be build to high standards of insulation, increase proportions of social housing and discourage car use and implement CIL charges for lower standard builds where higher standards cannot be enforced.\n- Implement supplementary planning conditions to ensure new builds meet high environmental standards\n- Ensure compliance with TPOs and punitive fines for ignoring them\n- Carry out a call for sites to identify land suitable for renewable technology developments\n- Engage in the Western Power Distribution development of a Local Area Energy action plan\n- Include support for District heating Schemes in new developments\n14. How can we ensure developments are resilient to climate change?\nIntroduce a policy in the local plan to require developers to show how new developments are designed to adapt to climate change including use of green and brown roofs, solar shading, thermal mass, heating and ventilation of the building, tree planting to provide shading and help to connect habitat\nClient Earth have written to authorities with the threat of legal action if local plans are produced without a robust Climate action plan, this will apply if HDC revisits their Local plan.\nHomes designed to be at least carbon neutral and water efficient to include the following:\n- High levels of insulation (PassiveHaus) to minimise heating and cooling energy requirements\n- Design adaptations to reduce solar gain in times of heat stress, natural or low carbon cooling systems.\n- Solar thermal for hot water and solar photovoltaics for electricity – housing oriented to maximise heat and generation\n- Heating via heat pumps – ideally community-based\n- Rainwater collection and water saving features\n- Deeper foundations, Harborough has a lot of clay which will shrink in the case of a long drought and cause subsidence.\nProbably the single most important thing is enabling people to stay local, avoid energy use and help with mental health:\n- Provide schools, health and community facilities – carbon zero schools that can be used by the community in the evenings\n- Community hubs scattered over new developments to provide such as:\n- Shops including food and encouraging independent local businesses\n- Public toilets\n- Parcel pick-up and drop-off using smart lockers\n- Secure bike and mobility scooter storage\n- Electric bike and car charging points\n- Bike and car share hire points\n- Bus stops\n- Pick-up point for school ‘walking-bus’\n- Children’s play area\n- Green space with trees for shade as a community information and meeting point\nLeicestershire is the county with the second lowest level of tree cover; with around 70% of trees being Ash, a large proportion of which will die back over next 5 years. There needs to be a Woodland Management Plan in the District but part of a wider county plan\nImproving new developments is the easy part, we need to adapt our solid walled Victorian properties and our poorly constructed newer houses, we need to initiate a Retrofit task force to evaluate what would be needed to achieve this.\n15. How should we help developers build more biodiverse space with good space for water?\nGreen and blue infrastructure to mitigate the effects of climate change needs to be implicit in planning consents:\n- Developments should be built as communities and not just a site where you can shoehorn in as many houses as possible, there is an adage that community space creates community. Long streets where people only know their immediate neighbours are in start contrast to houses that are build around a community space where they all meet and have community events.\n- Shade trees in all streets to reduce overheating in summer and reduce wind-chill in winter\n- SUDs drainage, ponds and water courses\n- Minimisation of hard areas and maximisation of natural ground (also to facilitate food growing)\n- Support for rewilding in areas of the natural ground to support biodiversity\n- Requirements for Hedgehog highways in all developments\n- Promote wild gardens as a positive thing and restrict consents of hard-paved areas\n- Create networks of wildlife ponds, volunteers will be glad to deliver\n- Pollinator friendly plantings with year round food sources for bees\n- Required as part of planning conditions; requirement to have landscape plans approved by Leics & Rutland Wildlife Trust\n- Local affordable housing goes hand-in-hand with the encouragement of localism in employment; this should include a range of sizes and prices, both private owned and rental tenure, at least 15% affordable and 15% social housing\nThe Council commits to working in partnership to promote resilient natural systems that will help to reduce the impacts of climate change.\n16. What more do we need to do to try to reduce flood risk to settlements?\nAs above:\n- SUDs drainage, ponds and water courses\n- Minimisation of hard areas and maximisation of natural ground for rewilding and also to facilitate food growing\n- Work with partners and water authorities to increase tree cover in catchments and slow down rivers / brooks by reintroducing meanders and leaky barriers\n- New burial facilities to be Green burial sites\n17. How can we best work with landowners to promote tree planting, hedge maintenance and biodiversity?\n- The Council should employ an ecologist with the mandate to advise local landowners, support their involvement in the ‘Green Revolution’ and make use of voluntary groups who are well versed in tree planting and working with landowners\n- Use crowdfunding to pay the additional staff costs\n- Access volunteers through partners and businesses (as part of their corporate social responsibility agenda)\n18. How can we help parishes deliver more tree planting?\n- By funding the provision of saplings and making use of local voluntary tree planting groups\n- Work with parish councils, tree wardens to promote opportunities for tree planting to land owners; with offer of volunteer help\n- Launch a Harborough forest project, raise money to buy land close to Harborough for wildlife and public amenity.\n- Where the Council is responsible for Nature reserves/SSSIs there should be robust management plans (So the land is not degraded like Scraptoft) and protections in the local plan to ensure they do not get built upon (Like Scraptoft and Misterton SSSI)\n19. Do you agree with our climate commitments?\nYes / No / Other (please specify)\nWe agree with your climate commitments, but they do not go anywhere near far enough to alleviate or adapt to the effects of the climate crisis",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_2025_03_11_labour-to-punish-people-with-disabilities/content_10.html": "As many of you might have seen on the BBC, and other media outlets, Kier Starmer and his government are planning once again to cut the welfare bill. This has caused considerable concern and anguish amongst many disabled people who are worried it’ll leave them without food, heating or even making them homeless. The Labour government has labelled, those with disabilities and health conditions as “ the undeserving poor,” placing a larger emphasis on working people and expecting those on Personal independence (POP) or Universal Credit (UC) to seek work as a alternative to their benefit support.\nThis doesn’t give an accurate picture of the situation faced by many disabled people, where many would love to work and contribute to society. Many are limited by there conditions however, with a lot citing, lack of transportation, accessibility and fatigue as some of the main reasons why people with disabilities and mental health conditions, struggle achieving full time employment.\nAs a person with multiple disabilities, I can express first hand how stressful, the job application process is. There is limited support at every stage of the process, this despite many private and public sector organizations claiming to be disability confident. An example of this could be that graduates with recognised disabilities or health conditions were in 2023 12.7% less likely to find employment (according to Department of Work and Pensions) (DWP).\nAnother thing to remember here is disability isn’t a choice, it’s a minority community that anyone can enter anytime throughout their lives. Some enter at birth, some through illness and some by ageing. It’s something nobody would chose, but a situation a person must adapt to and deal with as best as possible.\nAlong with the obvious struggle with any physical and mental limitations from the disability and any societal stigma that may be attached, there is a unseen financial cost of being a person with a disability. Writing in the Guardian a leading disability charity Scope claimed “without PIP a further 700,000 households could be pushed into poverty. Having a disability does cost more, the cost of home and vehicle adaptations, medications and hospital surgeries and appointments reduce a person’s ability to seek employment even further.\nBut there’s another way, the government could offer people with disabilities more support during education and during the job application process. Also offering people flexible hours, working in a setting they’re more comfortable with will gradually ease people into work. Some may not ever be able to get into paid work, these people staff our charity shops and cafes, playing an equally vital role in society.\nSo in conclusion, if the government wants to reduce government debt and spending, the targeting of the most vulnerable in society shows a complete lack of morals and compassion towards those in need. It also paints a darker narrative that excludes disabled people from society. This would be a huge step backwards in efforts made to increase equality and diversity and threatens the very fabric of society.\nFinally it’s a well, in which the last Tory government, bled dry and I’m sure Labour and Kier Starmer came into office wanting to distance themselves from the legacy of 14 years of Tory governorship, but this policy on welfare shows that this may not be the entire truth.\nJames Bayliss – Coordinator Oadby & Wigston",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_2025_04_02_harborough-oadby-wigston-green-party-announces-its-candidates-for-2025-county-elections/content_14.html": "We are delighted to announce a full slate of candidate in Harborough, Oadby and Wigston’s 12 seats in the forthcoming elections on May 1st. This is the second time that we have and only being 2 short, due to reserved occupations, in the District elections in 2023 and the first time there has been a Green in every seat across Leicestershire.\nThis means that every resident in the two Districts and Boroughs will have a Green option in their ballot sheets.\nLocal Green party nominations officer, Darren Woodiwiss said “I am delighted to be able to field a full slate of candidates in order to give all voters a proper choice.”\n“It is vital that everyone knows that the Green Party is an active and real participant in the local political scene, this is so important with the Local Government Reform proposals where we need new voices to be heard. Do we really want the same representatives that have overseen the decline of our services designing those of the new unitary council?”\nYou can view our candidate profiles here https://harborough.greenparty.org.uk/candidates/\nFull list of candidates in Harborough Districts divisions https://www.harborough.gov.uk/download/downloads/id/8991/statement_of_persons_nominated.pdf\nFull list of candidates in the Oadby & Wigston Borough divisions",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_category_local-news/content_12.html": "2 April 2025 / 2 April 2025 by darrenwoodiwiss\nWe are delighted to announce a full slate of candidate in Harborough, Oadby and Wigston’s 12 seats in the forthcoming elections on May 1st. This is the second time that we have and only being 2 short, due to reserved occupations, in the District elections in 2023 and the first time there has been a […]\nRead more »\n11 March 2025 by darrenwoodiwiss\nAs many of you might have seen on the BBC, and other media outlets, Kier Starmer and his government are planning once again to cut the welfare bill. This has caused considerable concern and anguish amongst many disabled people who are worried it’ll leave them without food, heating or even making them homeless. The Labour […]\n26 February 2025 / 26 February 2025 by darrenwoodiwiss\nOn Saturday 22nd Feb, we were delighted to hold a surgery for residents of Welland Ward to hear directly about any concerns as well as share ideas about how to support and develop the community further. Areas discussed included, flooding, community projects, the local plan, parking and traffic issues. Our next surgery will be Saturday, 28th June, […]\n6 February 2025 / 6 February 2025 by darrenwoodiwiss\nThe Leicestershire Waste partnership has published a consultation to review how they collect our waste. There are many mentions of the ‘Circular economy’ but it is our view that this cannot be achieved without a move to kerbside sortation, as Harborough District previously had before the current system. They have proposed 11 pledges which we […]\nHarborough, Oadby & Wigston Green party have release their report into the effectiveness of the recycling system in Harborough District, the report does not cover the affectivness of the system rather just the self declared rates of the council. A number of Freedom of information requests were made to identify the key figures required to […]\nFirst published 21st July 2022 Please find the submission from the Harborough, Oadby & Wigston Green party. We recognise and commend the actions undertaken and the ambition in the statement however we feel that the council is attempting to limit its commitment to Scope 1 (Councils direct activities) emissions. For the Councils true emissions to […]\n29 July 2024 / 29 July 2024 by darrenwoodiwiss\nWelcome to our new website. unfortunately our last site was decommissioned during our webmasters summer holiday so we have lost all of our previous content, but this give us the chance for a fresh new feeling. We hope you enjoy the new look and feel and bear with while we update the pages and content.",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_elections-timetable/content_15.html": "Find the timetable of elections planned for our area\n- County Council Elections – May 2025\n- District Council elections – May 2027 – Maybe replaced by the new Unitary council elections\n- General Election – May 2029\nFind the timetable of elections planned for our area",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_harborough-district-elections/content_19.html": "Harborough District is the county’s most southerly district and also one of the most rural and largest at 238 square miles running East to West along the bottom of the county. The District is responsible for Waste collection, environmental health and licensing, grounds maintenance and planning.\nDistrict elections May 2023\n| Ward | Candidate |\n| Billesdon and Tilton Bosworth Broughton Astley South and Leire Broughton Astley South and Leire Broughton Astley-Primethorpe and Sutton Broughton Astley-Primethorpe and Sutton Dunton Fleckney Fleckney Glen Glen Kibworths Kibworths Kibworths Lubenham Lutterworth East Lutterworth East Lutterworth West Lutterworth West Market Harborough-Great Bowden and Arden Market Harborough-Great Bowden and Arden Market Harborough-Little Bowden Market Harborough-Little Bowden Market Harborough-Logan Market Harborough-Logan Market Harborough-Welland Market Harborough-Welland Market Harborough-Welland Misterton Nevill Thurnby and Houghton Thurnby and Houghton Thurnby and Houghton Ullesthorpe | Claire Recordon Katherine Ruhl Chris Cooper-Hayes Adam Holmes Mark Green Gillian Buswell N/A Amanda sanders Jess Jenkins Matthew Norton Stephen Rankine Brian Thompson Debbie James Erika Cudworth Phil Harding Doug Taylor N/A Carl Tiivas N/A Mary Morgan Richard Ansell Daniella Orsini Carlos Bilbao Jennifer Wroath Simon Shepley Darren Woodiwiss Lynne Taylor Rose Forman Jonathan Hopkins Suzie Rankine Melanie Wakley N/A Martyn Gower Sarah Nimmo |\nDistrict elections May 2019\n| Ward | Candidate |\n| Broughton Astley South and Leire Broughton Astley-Primethorpe and Sutton Glen Glen Lutterworth West Market Harborough-Great Bowden and Arden Market Harborough-Great Bowden and Arden Market Harborough-Welland Market Harborough-Welland Market Harborough-Welland Thurnby and Houghton Thurnby and Houghton | Chris Cooper-Hayes Mark Green Matthew Norton Stephen Rankine Carl Tiivas Mary Morgan Richard Ansell Darren Woodiwiss Lynne Taylor Rose Forman Martyn Gower Melanie Wakley |\nDistrict elections May 2015\n| Ward | Candidate |\n| Market Harborough – Welland Market Harborough – Welland Market Harborough – Gt Bowden & Arden Market Harborough – Gt Bowden & Arden Market Harborough – Little Bowden Market Harborough – Logan | Jacquie Gadd Darren Woodiwiss Charles Oppenheim James Waddington Judith Waddington James Pearce |",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_oadby-wigson-borough-elections/content_16.html": "The towns of Oadby and Wigston make up the southern borough of Leicester\nBorough Elections 2023\nNo Candidates\nBorough Elections 2019\n| Ward | Candidate |\n| Oadby Woodlands | Pauline Pratt |\nThe towns of Oadby and Wigston make up the southern borough of Leicester\nBorough Elections 2023\nNo Candidates\nBorough Elections 2019\n| Ward | Candidate |\n| Oadby Woodlands | Pauline Pratt |",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_candidates/content_8.html": "We are pleased to offer you the chance to meet you candidates for the 2025 County Council elections.\nyour 2025 green party county council candidates\ndanniella bonham – Broughton Astley\nI want to stand for the Green Party because I care about keeping our planet healthy.\nI believe we need to take care of the Earth so kids in the future can enjoy clean air, fresh water, and beautiful nature just like we do. When I see rubbish in our green spaces or hear about animals losing their homes, it makes me sad.\nI want to help fix these problems. I promise to work hard to protect trees, animals, and clean air. If you choose me, I’ll make sure we all do our part to keep our Earth safe and green for everyone to enjoy now and in the future.\namanda sanders – bruntingthorpe\nI grew up loving nature and being in the countryside. Everyone deserves to benefit from access to well managed green spaces where they can relax and reset away from the pressures of modern life. Gardens and parks also have a huge role in restoring biodiversity and providing sanctuary from degraded countryside.\nI am optimistic that we can turn the tide on the damage done to nature over the last 30 years. It needs us all to cherish our green land and speak up for nature.\nahmad khwaja – North wigston\nI am standing as a candidate for the Green Party in the upcoming County Council election in Leicestershire as a passionate advocate for environmental sustainability, social justice, and grassroots democracy, I am proud to offer voters a genuine Green choice.\nWith a background in public service, I have held roles including Justice of the Peace, Non-Executive NHS Director, and Essex Police Authority Member. I have also supported education as a school governor and chaired voluntary sector organizations such as Citizens Advice. Now serving as a Governor at Oakland School and a Member of Bushby and Thurnby Parish Council, I am committed to community engagement in Leicestershire. Having lived in Southend for 35 years before moving to Leicester, I understand the challenges both urban and rural communities face. I am standing to give voters a Green alternative and to promote fairness, sustainability, and local democracy.\ndebbie james – gartree\nmelanie wakley – launde\ncarl tiivas – lutterworth\nDuring the day I own and run Kibworth books and I am a founder member of the Booksellers association’s, Sustainable Bookselling Group and has recently been named the BA’s ‘sustainability champion’. I also sit on the Sustainability Industry Forum, a cohort of members working towards reducing waste, improving supply chain methods and implementing net-zero business practices in publishing and bookselling.\nI have been a member of The Green Party for eight years and hosts meetings in the bookshop. I am a keen supporter of The Harborough Big Green Week, hoping to introduce a similar project in Kibworth in 2025, alongside an extensive author events programme which recently included a talk from Natalie Bennett. Working with fellow local business owners and the Parish Councils, I have helped to set up the Kibworth Business Forum, whose remit and actions are inspired by the importance of community and a sustainable future.\nI want to represent the Green Party in the local elections because I believe that we should be standing up for nature and striving to make a better environment for our community.\nIn my village I have created three wild flower areas, planted Spring bulbs and instigated the planting of over 30 trees. I have responded to The Local Nature Recovery Strategy which is being re-written by the councils. I have commented on the footpaths consultation work to keep footpaths in Leicestershire open. I am currently campaigning urging the Government to deliver a new Big Climate Plan, setting bolder and fairer targets, providing communities with warmer homes, cheaper energy, cleaner air, better transport and well-paid greener jobs.\nIf I am elected, I would continue working for my community, the environment and therefore the planet, to make it a safer place for us all to live now and for future generations.\nCarl is a retired NHS clinical scientist. He was born in Lutterworth and still lives in the town.\nHe is a volunteer director for Harborough energy, a local community energy company.\nHe believes in strong local communities and a fair transition to a greener economy bolstered by local action.\nmary stanhope-morgan – mkt harborough east\nI am not a politician, but I am standing as a candidate for the Green Party because I feel we have all been let down by the dominant parties, and the Green Party is the only one that is truly democratic and puts social and environmental justice at its core.\nThe Green Party is unique because its policies are decided by its members, not by wealthy donors. Everyone who joins the Green Party has the opportunity to shape its policies.\nIf I am elected I will work tirelessly to stand up for a fair and healthy society and the protection of the natural environment upon which we all depend.\ndarren woodiwiss – mkt harborough west & foxton\nI have been an environmentalist for most of my adult life and active within our community since 2007 when I co-founded Transition Town Market Harborough (Now Sustainable harborough).\nI joined the Green party in 2014 as I could see that to make real changes in our community needed political will, as well as community support. I have stood in four general elections as the Green candidate and this is my third time as a candidate in the County council elections.\nWe can win, in May 2023, I was one of three Green Councillors elected to Harborough District Council where I now sit as a cabinet member. Professionally I have always been involved in IT and the planning and delivery of applications from the inception and problem solving stage, through to delivery.\nThis I feel makes me an excellent choice and as a Green I will be advocating strongly for the residents of our community, and will not be bound by the view of my party.\nSamuel hilton – east wigston\nI don’t think that the status quo can go on much longer.\nIt doesn’t matter if you are thinking locally, about the flooding of homes, or nationally at a world at war, something has to change. The Green party is the only party which is offering change in our community.\nI am standing to help improve our community and to help build a movement that can give us back faith in the future.\nelaine shipton – oadby\nBorn and brought up in Derby, I have lived in the Leicester area for 20 years.\nI have been deeply concerned about both social and environmental issues since university.\nI joined the Green Party before the last election because I am convinced that we represent both the only hope for saving the planet, and the only party that is really committed to social justice.\nOther political parties insist that we cannot afford the services that people need. This is just not true. Only the Green party has the guts to say that the country’s wealth, generated by all, of us needs to be used for the benefit of the people, and not just the super-rich.\nAll the other parties pay lip service to tackling the climate and biodiversity crises. Only the Green party is committed to the action that urgently needs to be taken. We need a green revolution, and we need it now!\nPlease elect me so I that we can start making a difference, before it is too late.\nbethan painter – oadby\nBethan has lived in Oadby for 8 years and teaches in Leicester City. She joined the Green Party in 2019 after realising that it’s the only party with a realistic sense of urgency about the climate and biodiversity crises and that the Green Party has excellent, forward-thinking policies in other areas too.\nBethan volunteers with several conservation groups and a helpline. In her work and volunteering, she sees day to day the profound effects of cuts to public services.\nShe enjoys walking and playing the violin in a local orchestra.\njames bayliss – south & west wigston\nI’m James, a Green Party candidate from South Wigston. I am a local volunteer in many charities, a elected member of Scope. As a person living with multiple disabilities, I’m more than aware how politicians are seeking to exclude the most vulnerable in society from living a active and independent life. This is immoral and it’s our duty to protect our families and neighbour’s.\nI have been involved in politics, since I was 16, I was a elected member of Youth parliament in 2008. Also receiving a master’s degree in 2018.\nI am passionate about protecting the environment and seeing all homes have a renewable energy source within 10 years. I also believe that whilst it’s important to build enough homes, they should be affordable and offset any environmental challenges. I believe by making simple changes now we can safeguard the environment and economy for generations to come.",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_2025_02_06_leicestershire-waste-partnership-consultation-response-first-published-14th-april-2022/content_5.html": "The Leicestershire Waste partnership has published a consultation to review how they collect our waste.\nThere are many mentions of the ‘Circular economy’ but it is our view that this cannot be achieved without a move to kerbside sortation, as Harborough District previously had before the current system.\nThey have proposed 11 pledges which we feel are meaningless without defining how they will be achieved in a manner that supports the various councils “Climate Emergency Action Plans” and actually looks to achieve actual recycling.",
  "https_harborough_greenparty_org_uk_/https_harborough_greenparty_org_uk_2025_02_26_welland-ward-surgery/content_6.html": "On Saturday 22nd Feb, we were delighted to hold a surgery for residents of Welland Ward to hear directly about any concerns as well as share ideas about how to support and develop the community further. Areas discussed included, flooding, community projects, the local plan, parking and traffic issues. Our next surgery will be Saturday, 28th June, 10am-12pm at The Community Church, Bath Street. Come and join us next time and enjoy the available refreshments and a chance to share ideas."
}