{
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_tag_featured/content_4.html": "Tag: featured\nFeatured Content\nThis is a featured content post. Click the Edit link to modify or delete it, or start a new post.\nThe personal website of Councillor Adam Freeman BA MA\nThis is a featured content post. Click the Edit link to modify or delete it, or start a new post.",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2020_03_31_standing-for-labour-in-south-staffordshire/content_13.html": "In 2017 I had the honour of representing the seat I was born in through the greatest force for good in this country, the Labour Party. It is a challenge seat and has been won by the Conservatives since its creation in the 1970s. It resulted in a very short campaign with only one leaflet distributed to residents, partially through the national picture looking good for us I happened to increase our vote by over 3,000 and give us the best result for a Labour Candidate for sixteen year’s. I am standing again in the same seat this time.\nSince the highs of the 2017 General Election campaign, locally we have faced a twin threat with the re-emergence of a Green Party focused on a few villages and then growing organically from there as well as Independent group that rightly sees this as there best chance of upsetting the incumbent and generally hated Conservatives. In May this resulted in a whole raft of Parish seats moving to Independents and many even taking control of local councils themselves.\nThis election is not only a chance for us to remind residents who is the closest challengers to the incumbent Tory MP, but a chance for us to build the contacts we have spoken to over the last few years, using our mass membership, our new Council Candidate’s and our Union affiliates to campaign in every village for a Labour Government and build a mass movement for change.\nIf you speak to most candidates, even those who have previously been MPs in the seat, they will give you a personal story either why the particular area and its residents is important to them or at the very least the reasons they first thought about running for Public Office and why the Labour Party.\nFor me, living standards is the cornerstone of my campaign but also the reason why i get up every day and ask myself: “What will I do for Labour today?” Too many people in this seat have to fight to find their monthly rent or their annual electricity and gas payments, seeing little change if any in the quality of service, the majority of the time seeing an increase in payments blamed on inflation or “market pressures”. At the same time these companies are discussing what bonuses to give their bosses and the money they will pay to lobby politicians for even greater sector autonomy.\nIt is only through a Labour Party committed to changing the way this country is run, who is really in charge of our day to day activities, that we can implement really transformative policies.\nI am sure there are many people who see standing in a challenge seat as an important stepping stone to higher aspirations within the Party and a chance to prove themselves on a larger stage. For me the opportunity and excitement is more profound. Challenge seats get no national funding, barely a mention by any Regional Office and certainly no paid staff to help you, the candidate is the most important person, even ore at times than the Agent who works more behind the scenes .\nThis means you can design your own leaflets, present your own online strategy and your own approach for dealing with the media – it is clear the right candidate needs to have a grasp of each of these important topics to be successful in a modern campaign.\nI hope I can at least say I brought the Labour Party home with a solid second place. For the a seat like ours this would be seen a as a victory, any reduction of the winner’s majority or decrease of other rivals parties would be a greater achievement. At 27, it is possible I will never stand for Parliament again, but it also possible I will, in a different seat than where i was born, with different challenges, expectations and goals.\nWhat ever the future holds for me one of my important jobs is being a guardian, a temporary leader of the Labour force in South Staffordshire. One that I hope I have left in a better place than when I arrived, so that someone else next time can experience the task and honour of flying the flag for our party in this constituency.\nAdam Freeman. 2019 PPC for South Staffordshire\nLet us know what you think? Write a reply? theclarionmag@gmail.com",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2020_03_31_real-devolution/content_11.html": "One of the greatest legacy’s of the last Labour Government was the commitment to devolution, shown through the creation of Parliament’s in Northern Ireland, London and Scotland.\nSince 2010 there has been a push for greater devolution, devo-max to give greater power to local residents, this has seen the creation of Police and Crime Commissioners, the power for Council’s to raise Council Tax and the creation of new Authority’s in Greater Manchester, Liverpool and South Yorkshire just to name a few. Whilst there is much debate over how much these new powers has actually given to local resident’s, it is certainly a small step towards localism – and one I am afraid the Conservatives have taken. How should Labour shape the next decade and create their own devolution story that truly gives power to local people and enriches their lives?\nWith Brexit looming the power of Whitehall, which has led to the UK overtaking Albania as the most centralised state in Europe! Will again be on the agenda, it is something as progressives we should anticipate and with the support of our many excellent Labour Councillors and Mayor’s help to create a vision for the next decade of the largest power transfer to local people and regions. I was proud to vote for the 2018 Progress backed NEC slate which saw a representative from all corners of the country committed to representing their area at the top table, is also why I am standing in this election, a true model of how progressives can lead and shape the debate.\nI live in Staffordshire, which is sandwiched between the Welsh Assembly to the west and the West Midlands’s Combined Authority to the East. Whilst I may feel like I live in the West Midland’s, politically speaking any powers and funding given to the region will miss out Staffordshire/Shropshire and Worcestershire completely as it will get swallowed up by the new Authority. A city or regional deal that includes these rural area’s – many of which voted for Brexit in 2016, is key. It is these precise areas that Labour need to win to form the next Government, tackling the question of local powers must be the first step to regaining these seats, being included and forming the heart of a future Labour manifesto is the only way we can truly say we are ready for Government.\nAdam Freeman – Progress Strategy Board Candidate",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2017_11_12_first-blog-post/content_7.html": "This is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nThe personal website of Councillor Adam Freeman BA MA\nThis is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2018_07_16_featured-content/content_3.html": "Standing up for South Staffordshire July 16, 2018March 31, 2020 cllradamfreeman Like Loading... Related Published by cllradamfreeman View all posts by cllradamfreeman",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2020_03_31_the-contradictions-of-tusc/content_10.html": "It was nearing mid-day on a Wednesday as members from the Hampshire Socialist Party branch started to set up a stall; which we use for all campaigning purposes around Hampshire. For today we were in Eastleigh and had positioned our stall outside a deserted shop in the high street, a immediate swing of the state of the British high street and the problems that the capitalist system is facing. I was joined by Dave Boyes the Branch Secretary and Ania a Eastleigh resident who is also our treasurer. On our stall we had standard Socialist party posters and leaflets on the bedroom tax and bankers bonuses signing sheets. But we were actually campaigning for TUSC and the only evidence we had to prove this fact was photocopied enlarged leaflets to put up on the shop of Daz Proctor and Tusc’s policies, with a whole stack of leaflets to hand out to passers by.\nIt is true we are a small young party and teething problems must be expected in any political campaigning. But there are some crucial and concrete problems that we are facing and a party that we must learn if we want the party to grow and make inroads into national consciousness and naturally increase the amount of votes we get. These problems with the structure and message that TUSC is representing is something that is felt not only in the Eastleigh by-election but also in other elections. Fort many people within the party and from outside the only people who are campaigning and working hard to represent the party are Socialist party members, where are the SWP and RMT members? There support for our candidates (the majority of which are Socialist party members) are non existent. But even when a RMT candidate of Daz Proctor stood in the Eastleigh parliamentary by-election, RMT and I include Daz in the same breath started to campaign in the sense of leafleting only in the last few days and even when this happened all members were heavily outnumbered by Socialist Party and Socialist Workers party members. This lack of co-ordinated action and communication between all parts of TUSC was shown when the normal Eastleigh Socialist party met in the Eastleigh Loco club for a TUSC meeting and the RMT had their own meeting downstairs – this worrying lack of local support is a damming indictment of the grass route problems of TUSC locally.\nTo any opposite party or even a floating voter we must look very disorganised and have a confusing message. Remembering that not one person who actively campaigned for TUSC in Eastleigh was a member of the party; and when any question came about who were our Trade Unionists we had to give out some literature and ask them to check out the website (which in itself is a very poor version of a website) as there were no Trade Unionists within our midst. This circus then grew into even more chaos when RMT members came on the campaign trial had RMT flags and t-shirts, no TUSC logo or the name anywhere. We looked like the Socialist party was gaining support from the RMT for the day, even when we were all supposed to be in the same party of TUSC. This criticism of the party must not be laid at the door of RMT only, the Socialist party has much to blame as well, where were the TUSC posters and merchandise, a party that is very happy to chuck out tons of material over the course of the year to all branches, including incredibly Anti-bedroom tax posters during the election period were printed under the guise of the Socialist party, another great opportunity missed for TUSC to show what it stands for. After much discussions with fellow Socialist party members its clear this lack of material from the party is a recurrent theme.\nBut away from the problems with communication and material there is a more fundamental problem. If we I.e. TUSC regard ourselves as a political party we must hold elections to decide who leads the party and any other particular committee role. Even party’s that we like to criticise I.e. BNP and UKIP have fair and open elections for there top brass, so why don’t we or even why can’t we? There is also a lack of transparency – I do wonder how many of the ‘committee’ are actual members of TUSC – not just RMT or Socialist party or even Socialist workers party members. The next problem is even more obvious the name of the party, no matter what people may like to admit we have the two phrases that people hate the most – Trade Unionist and coalition. I am very clueless as why we had to use Trade Unionist in our name when no other party in the CWI that we are affiliated uses such a name or term. Secondly we are not a coalition, as that equates to people joining for particular reasons when they don’t necessarily believe the same course. Neither of these are true I hope.\nWe are at a important crossroads in the future of TUSC, over three years after the parties formation we are struggling to get the necessary improvements in nay election. As has already been noted the top bras of TUSC need to be more vocal and seen in election campaigning. You can count on one hand the amount of times Dave Nessit and Bob Crowe have been out on the campaign trial – I don’t count 30 minute speeches at rally’s in this. For anyone else it would seem the RMT and the Socialist Party hierarchy are nervous to be associated with TUSC, when have we seen or heard Peter Taffee or Hannah Sell publicly offer their support or even encourage support for TUSC. Now it is not a time to enter debate about Bob Crowe head of R,T and TUSC’s wages, but it is hypocritical and hard to justify when a supporter or even passer by asks how TUSC can campaign on a ’workers MP on a workers wage’ when our leader is a multi-millionaire through representing workers.\nThe question must be asked if TUSC is the party for the mass workers party, it needs to grow its teeth and prepare for the fight, because if united it will fall and will disappear as a force and a party.\nHampshire Socialist Party/TUSC Deputy Branch Secretary Adam Freeman\nThe question must be asked if TUSC is the party for the mass workers party, it needs to grow its teeth and prepare for the fight, because if united it will fall and will disappear as a force and a party.\nHampshire Socialist Party/TUSC Deputy Branch Secretary Adam Freeman",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_labourcandidates/content_5.html": "Labour Candidates in South Staffordshire\nReal Devolution?\nOne of the greatest legacy’s of the last Labour Government was the commitment to devolution, shown through the creation of Parliament’s in Northern Ireland, London and Scotland.\nSince 2010 there has been a push for greater devolution, devo-max to give greater power to local residents, this has seen the creation of Police and Crime Commissioners, the power for Council’s to raise Council Tax and the creation of new Authority’s in Greater Manchester, Liverpool and South Yorkshire just to name a few. Whilst there is much debate over how much these new powers has actually given to local resident’s, it is certainly a small step towards localism – and one I am afraid the Conservatives have taken. How should Labour shape the next decade and create their own devolution story that truly gives power to local people and enriches their lives?\nWith Brexit looming the power of Whitehall, which has led to the UK overtaking Albania as the most centralised state in Europe! Will again be on the agenda, it is something as progressives we should anticipate and with the support of our many excellent Labour Councillors and Mayor’s help to create a vision for the next decade of the largest power transfer to local people and regions. I was proud to vote for the 2018 Progress backed NEC slate which saw a representative from all corners of the country committed to representing their area at the top table, is also why I am standing in this election, a true model of how progressives can lead and shape the debate.\nI live in Staffordshire, which is sandwiched between the Welsh Assembly to the west and the West Midlands’s Combined Authority to the East. Whilst I may feel like I live in the West Midland’s, politically speaking any powers and funding given to the region will miss out Staffordshire/Shropshire and Worcestershire completely as it will get swallowed up by the new Authority. A city or regional deal that includes these rural area’s – many of which voted for Brexit in 2016, is key. It is these precise areas that Labour need to win to form the next Government, tackling the question of local powers must be the first step to regaining these seats, being included and forming the heart of a future Labour manifesto is the only way we can truly say we are ready for Government.\nAdam Freeman – Progress Strategy Board Candidate\nStanding for Labour in South Staffordshire\nIn 2017 I had the honour of representing the seat I was born in through the greatest force for good in this country, the Labour Party. It is a challenge seat and has been won by the Conservatives since its creation in the 1970s. It resulted in a very short campaign with only one leaflet distributed to residents, partially through the national picture looking good for us I happened to increase our vote by over 3,000 and give us the best result for a Labour Candidate for sixteen year’s. I am standing again in the same seat this time.\nSince the highs of the 2017 General Election campaign, locally we have faced a twin threat with the re-emergence of a Green Party focused on a few villages and then growing organically from there as well as Independent group that rightly sees this as there best chance of upsetting the incumbent and generally hated Conservatives. In May this resulted in a whole raft of Parish seats moving to Independents and many even taking control of local councils themselves.\nThis election is not only a chance for us to remind residents who is the closest challengers to the incumbent Tory MP, but a chance for us to build the contacts we have spoken to over the last few years, using our mass membership, our new Council Candidate’s and our Union affiliates to campaign in every village for a Labour Government and build a mass movement for change.\nIf you speak to most candidates, even those who have previously been MPs in the seat, they will give you a personal story either why the particular area and its residents is important to them or at the very least the reasons they first thought about running for Public Office and why the Labour Party.\nFor me, living standards is the cornerstone of my campaign but also the reason why i get up every day and ask myself: “What will I do for Labour today?” Too many people in this seat have to fight to find their monthly rent or their annual electricity and gas payments, seeing little change if any in the quality of service, the majority of the time seeing an increase in payments blamed on inflation or “market pressures”. At the same time these companies are discussing what bonuses to give their bosses and the money they will pay to lobby politicians for even greater sector autonomy.\nIt is only through a Labour Party committed to changing the way this country is run, who is really in charge of our day to day activities, that we can implement really transformative policies.\nI am sure there are many people who see standing in a challenge seat as an important stepping stone to higher aspirations within the Party and a chance to prove themselves on a larger stage. For me the opportunity and excitement is more profound. Challenge seats get no national funding, barely a mention by any Regional Office and certainly no paid staff to help you, the candidate is the most important person, even ore at times than the Agent who works more behind the scenes .\nThis means you can design your own leaflets, present your own online strategy and your own approach for dealing with the media – it is clear the right candidate needs to have a grasp of each of these important topics to be successful in a modern campaign.\nI hope I can at least say I brought the Labour Party home with a solid second place. For the a seat like ours this would be seen a as a victory, any reduction of the winner’s majority or decrease of other rivals parties would be a greater achievement. At 27, it is possible I will never stand for Parliament again, but it also possible I will, in a different seat than where i was born, with different challenges, expectations and goals.\nWhat ever the future holds for me one of my important jobs is being a guardian, a temporary leader of the Labour force in South Staffordshire. One that I hope I have left in a better place than when I arrived, so that someone else next time can experience the task and honour of flying the flag for our party in this constituency.\nAdam Freeman. 2019 PPC for South Staffordshire\nLet us know what you think? Write a reply? theclarionmag@gmail.com\nDemocratize Young Labour\nThe Contradictions of TUSC\nIt was nearing mid-day on a Wednesday as members from the Hampshire Socialist Party branch started to set up a stall; which we use for all campaigning purposes around Hampshire. For today we were in Eastleigh and had positioned our stall outside a deserted shop in the high street, a immediate swing of the state of the British high street and the problems that the capitalist system is facing. I was joined by Dave Boyes the Branch Secretary and Ania a Eastleigh resident who is also our treasurer. On our stall we had standard Socialist party posters and leaflets on the bedroom tax and bankers bonuses signing sheets. But we were actually campaigning for TUSC and the only evidence we had to prove this fact was photocopied enlarged leaflets to put up on the shop of Daz Proctor and Tusc’s policies, with a whole stack of leaflets to hand out to passers by.\nIt is true we are a small young party and teething problems must be expected in any political campaigning. But there are some crucial and concrete problems that we are facing and a party that we must learn if we want the party to grow and make inroads into national consciousness and naturally increase the amount of votes we get. These problems with the structure and message that TUSC is representing is something that is felt not only in the Eastleigh by-election but also in other elections. Fort many people within the party and from outside the only people who are campaigning and working hard to represent the party are Socialist party members, where are the SWP and RMT members? There support for our candidates (the majority of which are Socialist party members) are non existent. But even when a RMT candidate of Daz Proctor stood in the Eastleigh parliamentary by-election, RMT and I include Daz in the same breath started to campaign in the sense of leafleting only in the last few days and even when this happened all members were heavily outnumbered by Socialist Party and Socialist Workers party members. This lack of co-ordinated action and communication between all parts of TUSC was shown when the normal Eastleigh Socialist party met in the Eastleigh Loco club for a TUSC meeting and the RMT had their own meeting downstairs – this worrying lack of local support is a damming indictment of the grass route problems of TUSC locally.\nTo any opposite party or even a floating voter we must look very disorganised and have a confusing message. Remembering that not one person who actively campaigned for TUSC in Eastleigh was a member of the party; and when any question came about who were our Trade Unionists we had to give out some literature and ask them to check out the website (which in itself is a very poor version of a website) as there were no Trade Unionists within our midst. This circus then grew into even more chaos when RMT members came on the campaign trial had RMT flags and t-shirts, no TUSC logo or the name anywhere. We looked like the Socialist party was gaining support from the RMT for the day, even when we were all supposed to be in the same party of TUSC. This criticism of the party must not be laid at the door of RMT only, the Socialist party has much to blame as well, where were the TUSC posters and merchandise, a party that is very happy to chuck out tons of material over the course of the year to all branches, including incredibly Anti-bedroom tax posters during the election period were printed under the guise of the Socialist party, another great opportunity missed for TUSC to show what it stands for. After much discussions with fellow Socialist party members its clear this lack of material from the party is a recurrent theme.\nThe question must be asked if TUSC is the party for the mass workers party, it needs to grow its teeth and prepare for the fight, because if united it will fall and will disappear as a force and a party.\nHampshire Socialist Party/TUSC Deputy Branch Secretary Adam Freeman",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_biography/content_15.html": "2015 – present. CLP Secretary and Campaign Co-Ordinator for South Staffordshire\n2015 May – South Staffordshire District Council – Cheslyn Hay South and Saredon\n2016 January – Perton Parish Council – Dippons Ward\n2016 June – Sub Agent for Stronger IN for Europe and Labour IN for Britain for South Staffordshire in EU Referendum\n2017 May – Staffordshire County Council – Perton\n– Election Agent for all 8 seats for Labour in Staffordshire County Council Election\n2017 June – South Staffordshire – Parliamentary Candidate\n2018 February – Election Agent for 4 Codsall/Bilbrook By-Elections\n2019 March – Election Agent for District Candidate’s for South Staffordshire District Council\n2019 March – Parish Election Agent in Perton Lakeside ward\n2019 March – Elected unopposed to Pattingham Ward of Pattingham Parish Council\n2019 December – South Staffordshire – Parliamentary Candidate",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_author_cllradamfreeman_page_2/content_8.html": "Author: cllradamfreeman\nFirst blog post\nThis is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nFeatured Content\nThis is a featured content post. Click the Edit link to modify or delete it, or start a new post.",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com/content_1.html": "About me\nThis is the personal website and blog of Adam Freeman.\nDisclaimer – I serve as a Councillor on Pattingham Parish Council, CLP Secretary of South Staffordshire Labour Party for the last 5 years and two times former Parliamentary Candidate for South Staffordshire.\nAnyone who wishes to contact me about anything please send me an email at:\nadamfreeman1@outlook.com",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_testimonial/content_9.html": "It seems we can’t find what you’re looking for. Perhaps searching can help.\nTestimonials\nThis is a testimonial archive page. You can customize this text in the Customizer.\nTestimonials page can be added to Custom Menu using the Links Panel.\nThe testimonial archive page can be found at http://mygroovysite.wordpress.com/testimonial/ — just replace http://mygroovysite.wordpress.com/ with the URL of your website.",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_author_cllradamfreeman/content_6.html": "Author: cllradamfreeman\nReal Devolution?\nOne of the greatest legacy’s of the last Labour Government was the commitment to devolution, shown through the creation of Parliament’s in Northern Ireland, London and Scotland.\nSince 2010 there has been a push for greater devolution, devo-max to give greater power to local residents, this has seen the creation of Police and Crime Commissioners, the power for Council’s to raise Council Tax and the creation of new Authority’s in Greater Manchester, Liverpool and South Yorkshire just to name a few. Whilst there is much debate over how much these new powers has actually given to local resident’s, it is certainly a small step towards localism – and one I am afraid the Conservatives have taken. How should Labour shape the next decade and create their own devolution story that truly gives power to local people and enriches their lives?\nWith Brexit looming the power of Whitehall, which has led to the UK overtaking Albania as the most centralised state in Europe! Will again be on the agenda, it is something as progressives we should anticipate and with the support of our many excellent Labour Councillors and Mayor’s help to create a vision for the next decade of the largest power transfer to local people and regions. I was proud to vote for the 2018 Progress backed NEC slate which saw a representative from all corners of the country committed to representing their area at the top table, is also why I am standing in this election, a true model of how progressives can lead and shape the debate.\nI live in Staffordshire, which is sandwiched between the Welsh Assembly to the west and the West Midlands’s Combined Authority to the East. Whilst I may feel like I live in the West Midland’s, politically speaking any powers and funding given to the region will miss out Staffordshire/Shropshire and Worcestershire completely as it will get swallowed up by the new Authority. A city or regional deal that includes these rural area’s – many of which voted for Brexit in 2016, is key. It is these precise areas that Labour need to win to form the next Government, tackling the question of local powers must be the first step to regaining these seats, being included and forming the heart of a future Labour manifesto is the only way we can truly say we are ready for Government.\nAdam Freeman – Progress Strategy Board Candidate\nStanding for Labour in South Staffordshire\nIn 2017 I had the honour of representing the seat I was born in through the greatest force for good in this country, the Labour Party. It is a challenge seat and has been won by the Conservatives since its creation in the 1970s. It resulted in a very short campaign with only one leaflet distributed to residents, partially through the national picture looking good for us I happened to increase our vote by over 3,000 and give us the best result for a Labour Candidate for sixteen year’s. I am standing again in the same seat this time.\nSince the highs of the 2017 General Election campaign, locally we have faced a twin threat with the re-emergence of a Green Party focused on a few villages and then growing organically from there as well as Independent group that rightly sees this as there best chance of upsetting the incumbent and generally hated Conservatives. In May this resulted in a whole raft of Parish seats moving to Independents and many even taking control of local councils themselves.\nThis election is not only a chance for us to remind residents who is the closest challengers to the incumbent Tory MP, but a chance for us to build the contacts we have spoken to over the last few years, using our mass membership, our new Council Candidate’s and our Union affiliates to campaign in every village for a Labour Government and build a mass movement for change.\nIf you speak to most candidates, even those who have previously been MPs in the seat, they will give you a personal story either why the particular area and its residents is important to them or at the very least the reasons they first thought about running for Public Office and why the Labour Party.\nFor me, living standards is the cornerstone of my campaign but also the reason why i get up every day and ask myself: “What will I do for Labour today?” Too many people in this seat have to fight to find their monthly rent or their annual electricity and gas payments, seeing little change if any in the quality of service, the majority of the time seeing an increase in payments blamed on inflation or “market pressures”. At the same time these companies are discussing what bonuses to give their bosses and the money they will pay to lobby politicians for even greater sector autonomy.\nIt is only through a Labour Party committed to changing the way this country is run, who is really in charge of our day to day activities, that we can implement really transformative policies.\nI am sure there are many people who see standing in a challenge seat as an important stepping stone to higher aspirations within the Party and a chance to prove themselves on a larger stage. For me the opportunity and excitement is more profound. Challenge seats get no national funding, barely a mention by any Regional Office and certainly no paid staff to help you, the candidate is the most important person, even ore at times than the Agent who works more behind the scenes .\nThis means you can design your own leaflets, present your own online strategy and your own approach for dealing with the media – it is clear the right candidate needs to have a grasp of each of these important topics to be successful in a modern campaign.\nI hope I can at least say I brought the Labour Party home with a solid second place. For the a seat like ours this would be seen a as a victory, any reduction of the winner’s majority or decrease of other rivals parties would be a greater achievement. At 27, it is possible I will never stand for Parliament again, but it also possible I will, in a different seat than where i was born, with different challenges, expectations and goals.\nWhat ever the future holds for me one of my important jobs is being a guardian, a temporary leader of the Labour force in South Staffordshire. One that I hope I have left in a better place than when I arrived, so that someone else next time can experience the task and honour of flying the flag for our party in this constituency.\nAdam Freeman. 2019 PPC for South Staffordshire\nLet us know what you think? Write a reply? theclarionmag@gmail.com\nDemocratize Young Labour\nThe Contradictions of TUSC\nIt was nearing mid-day on a Wednesday as members from the Hampshire Socialist Party branch started to set up a stall; which we use for all campaigning purposes around Hampshire. For today we were in Eastleigh and had positioned our stall outside a deserted shop in the high street, a immediate swing of the state of the British high street and the problems that the capitalist system is facing. I was joined by Dave Boyes the Branch Secretary and Ania a Eastleigh resident who is also our treasurer. On our stall we had standard Socialist party posters and leaflets on the bedroom tax and bankers bonuses signing sheets. But we were actually campaigning for TUSC and the only evidence we had to prove this fact was photocopied enlarged leaflets to put up on the shop of Daz Proctor and Tusc’s policies, with a whole stack of leaflets to hand out to passers by.\nIt is true we are a small young party and teething problems must be expected in any political campaigning. But there are some crucial and concrete problems that we are facing and a party that we must learn if we want the party to grow and make inroads into national consciousness and naturally increase the amount of votes we get. These problems with the structure and message that TUSC is representing is something that is felt not only in the Eastleigh by-election but also in other elections. Fort many people within the party and from outside the only people who are campaigning and working hard to represent the party are Socialist party members, where are the SWP and RMT members? There support for our candidates (the majority of which are Socialist party members) are non existent. But even when a RMT candidate of Daz Proctor stood in the Eastleigh parliamentary by-election, RMT and I include Daz in the same breath started to campaign in the sense of leafleting only in the last few days and even when this happened all members were heavily outnumbered by Socialist Party and Socialist Workers party members. This lack of co-ordinated action and communication between all parts of TUSC was shown when the normal Eastleigh Socialist party met in the Eastleigh Loco club for a TUSC meeting and the RMT had their own meeting downstairs – this worrying lack of local support is a damming indictment of the grass route problems of TUSC locally.\nTo any opposite party or even a floating voter we must look very disorganised and have a confusing message. Remembering that not one person who actively campaigned for TUSC in Eastleigh was a member of the party; and when any question came about who were our Trade Unionists we had to give out some literature and ask them to check out the website (which in itself is a very poor version of a website) as there were no Trade Unionists within our midst. This circus then grew into even more chaos when RMT members came on the campaign trial had RMT flags and t-shirts, no TUSC logo or the name anywhere. We looked like the Socialist party was gaining support from the RMT for the day, even when we were all supposed to be in the same party of TUSC. This criticism of the party must not be laid at the door of RMT only, the Socialist party has much to blame as well, where were the TUSC posters and merchandise, a party that is very happy to chuck out tons of material over the course of the year to all branches, including incredibly Anti-bedroom tax posters during the election period were printed under the guise of the Socialist party, another great opportunity missed for TUSC to show what it stands for. After much discussions with fellow Socialist party members its clear this lack of material from the party is a recurrent theme.\nThe question must be asked if TUSC is the party for the mass workers party, it needs to grow its teeth and prepare for the fight, because if united it will fall and will disappear as a force and a party.\nHampshire Socialist Party/TUSC Deputy Branch Secretary Adam Freeman",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2020_03_31_health-security-and-its-impact-on-socialist-values-in-the-2020s/content_14.html": "Health Security and its impact on Socialist values in the 2020’s March 31, 2020 cllradamfreeman Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related Published by cllradamfreeman View all posts by cllradamfreeman",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_labourcandidates_page_2/content_16.html": "Labour Candidates in South Staffordshire\nFirst blog post\nThis is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nFeatured Content\nThis is a featured content post. Click the Edit link to modify or delete it, or start a new post.",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2020_03_31_democratize-young-labour/content_12.html": "Over the last few years we have seen a great internal democratic exercise. For the first time this year Women’s Annual Conference gained voting rights and a chance to debate a motion to Annual Conference, supported by next year’s Women’s Annual Conference being held in a separate city and time of year – Telford in February 2019. These changes have been supported by the Democracy Review creating greater engagement to many group’s within the party on a local CLP and National level, but throughout all of this one group was missed, us. There were no major changes to Young Labour, the mechanics of the organisation or participation for all under 27’s.\nI have had the honour of attending Annual Conference’s youth gathering for the last three years, I have seen first-hand it going from strength to strength in terms of participation and guest speakers. Whilst this is great, the ‘gathering’ still has no official role in the Labour policy making process, does not debate any policy and CLP Youth Delegate’s to Annual Conference can’t even attend as they are in the Hall at the same time. This situation is increased by the fact that it is held on a Sunday, at the same time as fringe Meeting’s, important vote’s in the Conference Hall, this year the Democracy Review was even held on the same day. I have had the honour of attending a number of regional Young Labour and Labour Student’s event’s over the last number of years and I afraid with these Conference’s being set aside specially for young matters a lot more consultation is needed.\nIf we are going to truly harness the young members and supporters to not only vote for Labour but to campaign, engage and get their friends involved in decision making, debating policies then we need a separate Young Labour Conference with full voting rights. Supported by a commitment that in a future GE manifesto the policy’s that affect us the most, for example Youth Services, 16-18 education and housing for first time buyer’s, just to name a few is decided by the member’s who it impacts’ on the most.\nI will be watching UK Youth Parliament day today on the TV, it will be a proud moment to see the young given a platform to air their views, perspective’s and policy’s to the country. I hope you all watch this exercise in youth democracy.\nProgress Youth Board Candidate Adam Freeman",
  "https_cllradamfreeman_wordpress_com/https_cllradamfreeman_wordpress_com_2017_11_12_featured-content-2/content_2.html": "Featured Content November 12, 2017November 12, 2017 cllradamfreeman This is a featured content post. Click the Edit link to modify or delete it, or start a new post. Like Loading... Related Published by cllradamfreeman View all posts by cllradamfreeman"
}