{
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_rishi-sunak-comes-henley/content_3.html": "It was a pleasure to welcome the Prime Minister, Rishi Sunak to Henley-on-Thames today, together with Lucy Demery, the Conservative Parliamentary Candidate for Wokingham. The PM met women rowers at Leander, the leading international rowing club, to highlight the importance of women's sport and of women's safe spaces. He was announcing the Conservative plan to amend the Equality Act to make clear that the protected characteristic of sex is biological sex, ensuring that organisations cannot be prosecuted for maintaining single-sex spaces for women and girls for our dignity, privacy and safety.\nI took the opportunity to talk to the PM about the concern I share with many residents here about pollution of our rivers, particularly after a winter of record rainfall. There is still a lot to do, both to remove pollution from our rivers by improving capacity and technology and to rebuild trust - in the water companies, and the government bodies that regulate and monitor them, particularly Ofwat and the Environment Agency.\nBut we have taken important action already: it's the Conservative Government that has required 100% of storm outflows to be monitored; has insisted on the river companies investing £56 billion in improving sewage treatment plants up till 2035; announced it will impose uncapped fines on water companies polluting illegally; and ensured dividends and bonuses are strictly tied to improvements in water quality.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_map-locations/content_11.html": "Skip to main content\nMain navigation\nHome\nAbout Caroline\nNews\nMy Plan\nContact\nMy map",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_accessibility/content_20.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_feed/content_27.html": null,
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_campaigns_security-and-defending-british-interests/content_6.html": "My father saw active service in the Royal Navy, and I served our country as a diplomat. Keeping the United Kingdom safe in an increasingly dangerous world has to be a top priority for our leaders and public servants. That’s why I support increased funding for our Armed Forces and why I’ll always stand with the servicemen and women at RAF Benson and their families, and the veterans who have defended us.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_cdn-cgi_l_email-protection/content_25.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_campaigns_supporting-local-business/content_9.html": "From farming to finance; tech to the trades - they’re the backbone of this constituency, and we need to support them. Business owners here tell me they need lower taxes and fewer unnecessary regulations. That’s the case I’m relentlessly making to government. Living in a rural community I’m particularly concerned about the strains on the farming sector; that’s why I’ll keep on speaking up for our farmers - for fair prices, targeted support and the value of local produce.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_category_Reports/content_5.html": "Protecting our Precious Rivers 29th May 2024 I share residents' concern and anger about pollution in the Thames. After a winter of record rainfall, storm overflows from sewage plants have been running way... Reports",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_caroline-newton-attends-mayor-making-henley-thames/content_21.html": "Caroline Newton, the Prospective Parliamentary Candidate for Henley and Thame, attended the Mayor Making ceremony at Henley Town Hall this morning,to see Cllr Rory Hunt elected as mayor for the forthcoming year. She was a guest of Cllr Felix Bloomfield, Chairman of Oxfordshire County Council.\nShe said: \"It was a real privilege to be present at Rory's election. He's the youngest ever Mayor of Henley, and I'm sure he is going to represent the town with energy and positivity. I hope to work with him and his fellow-councillors to support the town and its residents if I am elected as the member of parliament at the next General Election.\"",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_campaigns_protecting-environment-and-countryside/content_17.html": "I grew up here - and love our countryside, rivers and village communities. I worry about climate change, about the loss of biodiversity, about pollution and flooding. But I’m clear we have to address those challenges without putting even more pressure on households’ finances and undermining our prosperity.\nI’ll continue to campaign to make sure we don’t compromise our food security by losing our productive farm land to solar farms. And I’ll press Thames Water, the Environment Agency and landowners to sort out the pollution and flooding of our rivers and streams.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_about-caroline-newton/content_2.html": "Henley and Thame is Caroline Newton’s home. She was brought up in here, and is raising her family here too.\nHaving gone to school locally, Caroline studied history at Cambridge. Her career started as a British diplomat in Eastern Europe after the fall of the Berlin Wall where, as she says, she saw “the power and fragility of democracy”. As a journalist at the BBC she helped set the daily news agenda as a producer on programmes like Today and the 10 O’Clock News, and she subsequently headed up the Government’s broadcast communications strategy at No 10 Downing Street. In the private sector she’s advised companies on their international growth strategies.\nCaroline stands up for the things we all care about: our beautiful countryside, our communities, our local businesses and the most vulnerable people in our society.\nShe has a track record of helping residents here in South Oxfordshire. As a local councillor over a decade she got social care and social housing for people in need; she worked with communities to get the developments they wanted - and to fight off the ones they didn’t. She’s campaigned for our local, Oxfordshire farmers; and she supports patients at Townlands Hospital in Henley as the chairman of the charity there.\nAs your MP she’d continue to focus on these local issues, as well as on promoting British interests and security internationally.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_cookies/content_10.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_caroline-newton-selected-be-prospective-parliamentary-candidate-henley-thame/content_24.html": "Local Conservatives have selected Caroline Newton as their Parliamentary Candidate for the revised Henley & Thame constituency.\nCaroline was brought up in this constituency and lives here with her family. Alongside a career as a diplomat, public servant, and BBC journalist, she has represented communities across this constituency as a district and county councillor, for over a decade.\nSpeaking after her selection Caroline said: “I’m incredibly honoured that local Conservatives have put their trust in me. I have always been passionate about this constituency I call home, and particularly about supporting our environment, local businesses, and the most vulnerable people in our community. I look forward to meeting more residents across Henley and Thame over the coming months to hear what matters most to them; and to make my case for being their new representative in Parliament.”\nThe meeting was attended by more than 100 Party Members from across the new constituency. Chairman of Henley & Thame Conservatives, Andrew Collins, said: “Caroline is a fantastic local campaigner, who will bring a strong background and wealth of experience to the role. We are all looking forward to working with her and know that she will be a great champion for all residents across the new Henley and Thame constituency.”",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_protecting-our-precious-rivers/content_4.html": "I share residents' concern and anger about pollution in the Thames.\nAfter a winter of record rainfall, storm overflows from sewage plants have been running way too high, and run-off from drenched farmland has been adding to the problem.\nIt's been building up for decades. Under all governments, Labour, Conservative and Lib Dem. The regulators have failed to make Thames Water address it, and in the meantime, have allowed them to build up unsustainable levels of debt.\nVoters will hear a lot from the Lib Dems during this election campaign about what they’d do if they were in charge.\nTheir funding figures are - frankly - a fantasy.\nThey’re suggesting they can magic billions of pounds of investment without any cost to tax payers or customers. That is fantasy funding at its most dishonest. They have been supporting legislation so poorly designed that it would bankrupt the water companies, piling huge costs onto either customers or taxpayers, and force the sewage system to grind to a halt, backing up foul water into our homes.\nAfter he was minister for the Post Office, Sir Ed Davey, now the leader of the Lib Dems, was the government minister in charge of energy and climate change. He did nothing to address this.\nThe Conservatives are making the water companies invest £56 billion by 2035 to solve this infrastructure problem. We calculate they can do that without bills rising too much, without breaking the companies, and without those costs being picked up by taxpayers. And we're working with farmers reduce the run-off from their fields, to help clean up the rivers.\nThere’s no question it’s too late, and we need to do more. But Ed Davey’s Lib Dems don’t have the answers. I'm focusing on workable solutions to get this right.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_contact/content_22.html": "Skip to main content\nMain navigation\nHome\nAbout Caroline\nNews\nMy Plan\nContact\nContact\nLeave this field blank\nCampaign Office\nWaterloo House, 58-60 High St, Witney OX28 6HJ\n[email protected]\nOn Facebook\nOn Instagram\nOn LinkedIn\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_campaigns_delivering-good-public-services/content_19.html": "Like many other people here, I’ve struggled recently to get swift access to healthcare, mental healthcare and social care for my family. We need to find solutions to the strains on our health and social services. But the answer can’t just be putting more money into them: we need to make services more efficient, like using AI to help diagnose, treat and monitor patients, and use public health services to get people to take responsibility for their own health.\nAnd it’s not just state-run services: I’ll address the growing difficulty many of us experience in accessing basic services like banks by encourage banking hubs and mobile banks to set up here.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_rebecca-pow-mp-minister-nature-visits-christmas-common/content_15.html": "Greenfield Farm in Christmas Common received a visit this week from Rebecca Pow MP the minister in the Department for Environment, Food and Rural Affairs responsible for nature restoration. She was invited by Caroline Newton, the prospective parliamentary candidate for Henley and Thame, to see what landowners here are doing to protect and increase biodiversity. They were guests of Andrew Ingram, owner of the Tree Barn, and chairman of the Christmas Common Farm Cluster who has been farming with nature very much front-of-mind for three decades. He told Rebecca how much he welcomes the support the Government is giving farmers and landowners to continue and improve their nature-friendly farming practices.\nCaroline said: \"So many people tell me protecting and restoring Nature is one of your top priorities. It certainly is one of mine. That why it was such a pleasure to welcome Rebecca Pow MP, the Government Minister for Nature, to Christmas Common, Watlington recently. With serious help from Rebecca and a raft of government legislation, farmers across Henley & Thame are creating bigger, better and more joined-up nature sites.\"",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk/content_1.html": "Hi, I'm Caroline Newton, your prospective Member of Parliament for Henley and Thame. I have a clear vision for our constituency and I'm here to understand your needs and deliver on your priorities. If I can help in any way, please don't hesitate to get in touch.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_events_feed/content_26.html": null,
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_ourplan/content_12.html": "From farming to finance; tech to the trades - they’re the backbone of this constituency, and we need to support them. Business owners here tell me they need lower taxes and fewer unnecessary regulations. That’s the case I’m relentlessly making to government.\nI grew up here - and love our countryside, rivers and village communities. I worry about climate change, about the loss of biodiversity, about pollution and flooding.\nI’m fortunate to have been able to create a home here with my family. But these days that’s just not an option for many people who, like me, were brought up here.\nLike many other people here, I’ve struggled recently to get swift access to healthcare, mental healthcare and social care for my family. We need to find solutions to the strains on our health and social services. But the answer can’t just be putting more money into them: we need to make\nI’m in the first generation of my family to go to university. I know how valuable good education and training is for getting on in life. That’s true for children and young people, as well as for adult workers wanting to retrain and up-skill.\nA good education doesn’t just mean A’levels.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_about-rss/content_8.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news/content_18.html": "Rishi Sunak comes to Henley Monday, 3 June, 2024 It was a pleasure to welcome the Prime Minister, Rishi Sunak to Henley-on-Thames today, together with Lucy Demery, the Conservative Parliamentary Candidate for Wokingham. The PM met women rowers at Leander, the leading international rowing club, to highlight the importance of women's sport and of women's safe spaces. He was announcing the Conservative plan to amend the Equality Act to make clear... Local News\nProtecting our Precious Rivers 29th May 2024 I share residents' concern and anger about pollution in the Thames. After a winter of record rainfall, storm overflows from sewage plants have been running way... Reports\nRebecca Pow MP, Minister for Nature visits Christmas Common 21st May 2024 Greenfield Farm in Christmas Common received a visit this week from Rebecca Pow MP the minister in the Department for Environment, Food and Rural Affairs... Local News\nCaroline Newton visits the River Thame Conservation Trust 17th May 2024 Caroline Newton, the Prospective Parliamentary Candidate for Henley and Thame visited the River Thame Conservation Trust (RCTC) this afternoon to hear about... Local News\nCaroline Newton attends Mayor Making in Henley-on-Thames 13th May 2024 Caroline Newton, the Prospective Parliamentary Candidate for Henley and Thame, attended the Mayor Making ceremony at Henley Town Hall this morning,to see Cllr... Local News\nCaroline Newton selected to be the prospective Parliamentary Candidate for Henley & Thame 19th February 2024 Local Conservatives have selected Caroline Newton as their Parliamentary Candidate for the revised Henley & Thame constituency. Caroline was brought up in this... Local News",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_caroline-newton-visits-river-thame-conservation-trust/content_23.html": "Caroline Newton, the Prospective Parliamentary Candidate for Henley and Thame visited the River Thame Conservation Trust (RCTC) this afternoon to hear about this local charity is doing to help improve the health of the River Thame and its catchment area. The River Thame runs through the town of Thame and joins the River Thames at Dorchester. Its catchment area, includes brooks and streams in Chinnor, Lewknor, Watlington and Chalgrove, Wheatley and Stadhampton.\nDr David Fraser, CEO of the RTCT, and his colleagues told her is one of the most polluted of all the catchment areas that feed the Thames, largely because of inadequate capacity in its sewage treatment plants (STPs) to deal with exceptional rainfall, a regulatory system that permits high levels of pollutants from STPs in normal conditions, and run-off of pesticides and fertilisers from agriculture.\nCaroline said: \"I know the cleanliness of our rivers is one of residents' top priorities in Henley and Thame. It’s one of mine too. As the MP here I’d work to ensure our rivers get the care they deserve by ensuring Thames Water invest adequately in their infrastructure and service; OFWAT and the Environment Agency regulate Thames Water properly; and farmers are supported to prevent polluting run-off. It was a pleasure to meet Dr David Fraser and colleagues at the River Thame Conservation Trust today to hear about the challenges the Thame River catchment faces and what they’re doing to help.\n@https://www.facebook.com/thametown\n@https://www.facebook.com/chinnorvillagecentre\nLove Thame Stadhampton Village notice board. @https://www.facebook.com/RiverThameCT @https://www.facebook.com/RiverThamesSociety",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_news_category_Local-News/content_14.html": "Rishi Sunak comes to Henley 3rd June 2024 It was a pleasure to welcome the Prime Minister, Rishi Sunak to Henley-on-Thames today, together with Lucy Demery, the Conservative Parliamentary Candidate for... Local News\nRebecca Pow MP, Minister for Nature visits Christmas Common 21st May 2024 Greenfield Farm in Christmas Common received a visit this week from Rebecca Pow MP the minister in the Department for Environment, Food and Rural Affairs... Local News\nCaroline Newton visits the River Thame Conservation Trust 17th May 2024 Caroline Newton, the Prospective Parliamentary Candidate for Henley and Thame visited the River Thame Conservation Trust (RCTC) this afternoon to hear about... Local News\nCaroline Newton attends Mayor Making in Henley-on-Thames 13th May 2024 Caroline Newton, the Prospective Parliamentary Candidate for Henley and Thame, attended the Mayor Making ceremony at Henley Town Hall this morning,to see Cllr... Local News\nCaroline Newton selected to be the prospective Parliamentary Candidate for Henley & Thame 19th February 2024 Local Conservatives have selected Caroline Newton as their Parliamentary Candidate for the revised Henley & Thame constituency. Caroline was brought up in this... Local News",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_campaigns_sensible-approach-new-homes/content_16.html": "I’m fortunate to have been able to create a home here with my family. But these days that’s just not an option for many people who, like me, were brought up here. I want to help make sure there are enough affordable homes in this constituency, because every young person deserves to buy their first home.\nI’ll be working to balance that against protecting our open countryside and the quality of life of the people who already live here. We need the right houses in the right places, at a price that people can afford - with the infrastructure and services in place at the right time.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_campaigns_improving-education-skills-and-training/content_7.html": "I’m in the first generation of my family to go to university. I know how valuable good education and training is for getting on in life. That’s true for children and young people, as well as for adult workers wanting to retrain and up-skill.\nA good education doesn’t just mean A’levels. It means helping all students get their best outcomes, whatever their strengths. I’ll work with local schools, colleges and employers to get the right mixture of high-quality academic and vocational education - to provide the graduates and school leavers we need.",
  "https_www_carolinenewton_uk_/https_www_carolinenewton_uk_privacy/content_13.html": "This document outlines how Caroline Newton processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Caroline Newton\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Caroline Newton.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Caroline Newton, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Caroline Newton via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}