{
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_maiden-speech-bob-seely-mp/content_22.html": "Bob Seely made his Maiden Speech on the evening of Monday 3rd July 2017\nI want to say what a great privilege it is to follow my hon. Friend the Member for Clacton (Giles Watling), but such was the brilliance of his speech that my heart rather sank.\nI am genuinely humbled by listening to some of the wonderful speeches including those by the hon. Member for Crewe and Nantwich (Laura Smith) and my hon. Friends the Members for East Renfrewshire (Paul Masterton) and for Redditch (Rachel Maclean), and my hon. Friend the Member for North East Derbyshire (Lee Rowley), who really brought home why we are in this place; we listened in silence, and I thank him.\nI think I am going to support this Bill, although I have to say that any Bill relating to tourism that encourages anyone to go anywhere other than the Isle of Wight seems to suffer from what our philosophical Front Bench would call an a priori flaw. However, my constituents are as generous as they are understanding, and I am sure that they would allow me to support this otherwise very sensible Bill.\nI also want to pay tribute to my predecessor. Andrew Turner was a kind man, a good listener, attentive to his constituents and held in very high regard by many of them. He worked hard for our island for 16 years and I wish him a long, contented and happy retirement.\nRepresenting the Isle of Wight—we call it the island, and I apologise if I refer to it as such—is for me a labour of love. It is my patch of England. I have loved it ever since I was knee high to a grasshopper, and it is close to my heart.\nIt also has a special place in the nation’s heart, serving as a source of inspiration for islanders, visitors and our nation’s greatest artists. Turner’s first great work was for the Royal Academy: “Fishermen at sea” in the Solent, with the Needles as a moonlit backdrop. The poet Alfred Lord Tennyson settled here, and we hear our sounds and understand our sense of place in his work. When we listen to the seawater today rushing off the stones at Alum Bay, we understand the line in “Maud”:\n“Now to the scream of a maddened beach dragged down by the wave”.\nSwinburne and Keats wrote here:\n“A thing of beauty is a joy forever”,\nfrom “Endymion” is one of Keats’s greatest lines, and was inspired by visits to Shanklin and Carisbrooke. The wonderful eccentric Edward Lear tutored Queen Victoria at Osborne, the Bonchurch watercolourists painted near Ventnor, Julia Margaret Cameron, the wonderful feminist, pioneered portrait photography at Dimbola Lodge, and the Pre-Raphaelites hung out in Freshwater. And today we remain a home for many island artists, as well as cultural and sporting events of world renown.\nWe have a special place in science, too. We had the world’s first telegraph station, the hovercraft and the seaplane were built here, and the Blue Streak missile system—what a great name for a missile system—was test-fired from the Needles. And today the island’s experts produce some of the most sophisticated radars in the world for the Royal Navy.\nMy hon. Friend the Member for Spelthorne (Kwasi Kwarteng) eloquently assured us a fortnight ago that he was still thrusting. I am sure of it, but let me remind the House that our Thrust 2 jet-engined supercar, built largely on the island, won and held the world land speed record for our nation for over a decade, at some 633 mph. So on the Isle of Wight, even our thrusting is world class.\nMoving from science to pseudo-science, Karl Marx was a regular visitor, a point I might have to make should the right hon. Member for Islington North (Jeremy Corbyn) ever come to power—although if the victory last month was any harbinger of the future, let us wish Opposition Members many more such victories in the years to come.\nOn a more serious note, I mentioned our arts and science not to provide a potted history lesson or to express my love for my constituency—which I hope is self-evident—but because they are what we need for our future. We need again to embrace art, science, technology, innovation and education to inspire, to enrich and to employ. Our island is special in many ways, but our wealth has not always been of the financial kind and there is a perception that Whitehall sometimes overlooks us. In the 1990s, the Government promised the Isle of Wight and the Scilly Isles that they would study the extra costs of being an island. Sadly, that promise came to nothing, but those costs are recognised in Scotland through the special islands needs allowance, which provides an uplift in funding for some half a dozen councils with island seats. I believe that we need a better deal for our island, and it is not just a question of money, although every little helps and I will fight for extra spending on health and education. It is about islanders working with the Government to generate ideas for the public good, and about the Government working with us and being keen to listen. I know that there are good examples of that happening, and I wish to encourage more of it.\nWe need to embrace the knowledge economy and higher education. I look forward to working with the Department for Education and with universities to provide opportunities for such engagement. We need to continue to drive all education standards on the island, and I will continue to fight for the future of the Sandown Bay school. I look forward to the Government’s continuing support.\nOur cultural offer is getting stronger. We have the wonderful Isle of Wight festival—I think Rod Stewart topped the bill this year, as part of a tartan revival that is clearly taking place in politics as well. We also have the wonderful literary festival and the cutting-edge Ventnor fringe festival—look out, Edinburgh! However, I wish to work with Culture Ministers and institutions to find out how they can help us to improve our museum offer and possibly attract a major gallery to the island, to help with year-round cultural tourism.\nI look forward to engaging with Sport England and with trade and investment Departments to work with our high-tech sailing industry and with the sailing clubs of Cowes and others to ensure that the town of Cowes remains the centre of the sailing world. I also hope that it becomes a global centre for disabled sailing. That would be an important move that would have practical and moral implications. I was privileged last month to meet the captain of our national blind sailing team, who were prepping for their world championships, and I wish Lucy and her inspiring team all the very best.\nWe need to work with the Department for Work and Pensions, and organisations such as Help the Aged and our wonderful Mountbatten hospice, to make the island a national leader in ensuring quality of life for those in later life, combining health and social care and voluntary and state support to enrich life.\nIn transport, we need to ensure the future of the Island railway line and improve our cycling routes to make us Britain’s leading cycling destination. We also need to engage with the ferry firms to provide a better service. Let me be clear: privatisation did a great deal of good in the ’80s and ’90s nationally, but the privatisation of our ferries was not such a great success. I do not have all the answers, but I know that we should not have started from that point. I am uncomfortable with the levels of debt that Red Funnel and Wightlink have, because islanders—who are not the richest people in the country—have to help to subsidise it in order to cross the Solent.\nI welcome the Government’s commitment to social housing and starter housing from the bottom of my heart. I find it difficult to explain to my fellow islanders why rich property developers were able to build houses there that most of my constituents could not afford. We do not need large-scale projects, which are heartily disliked by many islanders. They do significant cumulative damage to our precious landscape, on which much of our tourism—which accounts for half our economy—depends. We do, however, need genuinely affordable projects to provide homes for islanders, and we will work with the Government to build them. Our island plan should reflect that. For my islanders, housing is hope, especially for the younger ones. Working with many others—our chamber of commerce, our council, our excellent tourism team, voluntary groups and individuals—we will present ideas for a brighter future for our island.\nNationally, this Government have laudable aims of social justice, hope, meritocracy and opportunity for all, values which were inherent in manifestos and are absolutely inherent in our hearts, but we sadly failed to translate them during the campaign. I want those principles, aims, values and aspirations for my fellow islanders and for our nation. Let us deliver real change and real hope in the next few years and set an example, whether economic, moral, or political, that we are the natural party of government.\nMy fellow islanders deserve nothing but the best, and I will do my best to give them the voice that they deserve. Some Members, such as my hon. Friend the Member for North East Derbyshire (Lee Rowley), have explained why we are here far more eloquently than I have, but I will battle for my island. I cannot promise to win every battle, but I will fight every battle on their behalf for as long as I have the honour of serving in our Parliament what Wordsworth called “that delightful Island”.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_bob-seely-says-wightlink-apology-not-good-enough/content_27.html": "Bob Seely MP said: \"Wightlink's apology is welcome but frankly not good enough, given their increasingly poor record of reliability.\n\"My recent report into the ferries has shown that the ferries have become less reliable, slower, less frequent and more expensive than they were two decades ago.\n\"I had hoped that after Covid they would reset their relationship with the Island and frankly do a better job, given the public money given to them and their status as a lifeline service.\n\"Sadly, the opposite has happened. In particular their staffing levels don’t seem to be good enough to offer a reliable service and there are rumours that the firms are cutting back on their servicing to save money to pay their owners.\n\"It is not good enough. I am campaigning to get a better deal. We need a better deal.\n\"To have such a disrupted service on a bank holiday weekend not only hits Islanders but costs Island businesses money. The ferries’ unreliability is hitting our Island economy as well as inconveniencing individual Islanders.\n\"First, I will be encouraging and doing what I can to help new services to compete with Wightlink and Red Funnel, which between them have over £400 million pounds of debt, the majority of it borrowed to pay their owners - not for investing in services.\n\"Second, we need regulation of service not only to encourage competition but also to protect the interests of the Island, which as far as I can see come last in the ferry firms’ calculations.\n\"Next week, prior to Parliamentary dissolution, I will be publishing figures on how often Red Funnel cancel services based on staffing shortages or poor servicing.\"",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_about-rss/content_2.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_myplan/content_12.html": "Early in 2024, I set out \"My Plan\" - my priorities for the next 12 months, and beyond.\nThis builds on the progress we have made so far in securing a better deal for the Island, and sets out how - working with others - I intend to go further.\nEarly in 2024, I set out \"My Plan\" - my priorities for the next 12 months, and beyond.\nThis builds on the progress we have made so far in securing a better deal for the Island, and sets out how - working with others - I intend to go further.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_national-articles/content_7.html": "Tweet Planning and housebuilding Our housebuilding agreement with Michael Gove will help deliver the community-led planning system we need Bob Seely and Theresa Villiers The Telegraph 05/12/2022 Government’s planning policy needs a rethink Bob Seely The Times 23/11/2022 The Conservative Party must change or risk being bulldozed by their own voters Bob Seely The Telegraph 21/06/2021 The case against planning revolutionaries – and their flawed assumptions about how to get housing done Bob Seely ConservativeHome 18/06/2021 The Government’s current approach to housing needs intelligent, sensitive reforms – not a complete overhaul Bob Seely ConservativeHome 05/06/2021 Ministers must revise the housing plan to give our cities the homes they need Bob Seely ConservativeHome 08/10/2020 'Computer says no' house building plan is another own goal Bob Seely The Telegraph 28/09/2020 The Government must urgently re-assess its misguided housebuilding strategy Bob Seely ConservativeHome 11/09/2020 Scrap the automatic Right to Buy. And nine other ideas to make housing sustainable Bob Seely ConservativeHome 15/07/2019 My housing challenge to think tanks. Devise a strategy that will prize social justice above economic liberalism Bob Seely ConservativeHome 10/06/2018 Russia The Russian Way of War Bob Seely Foreign Affairs 24/11/2023 Biden has just made his worst decision on Ukraine so far Bob Seely The Telegraph 06/07/2023 Russia’s summer of political and military chaos. And what it means for the war in Ukraine. Bob Seely ConservativeHome 27/06/2023 The threat of nuclear war is now higher than ever before Bob Seely and Hamish De Bretton-Gordon The i 12/06/2023 Vladimir Putin is preparing to attack the UK Bob Seely The Telegraph 0/04/2023 Putin is preparing for a nuclear showdown - we must be ready Bob Seely and Hamish De Bretton-Gordon The Telegraph 15/03/2023 What Russia Says About Nuclear Weapons And What It Means Bob Seely et al. 1945 14/03/2023 We MUST give Ukraine the tools to finish this war, writes Bob Seely MP Bob Seely The Daily Mail 08/02/2023 How Sunak can help Russia’s political prisoners Bob Seely The Times 18/01/2023 Why arming Ukraine to win is the least bad option for the West Bob Seely ConservativeHome 11/01/2023 Why the loss of Kherson is bad for Russia – but not fatal Bob Seely ConservativeHome 14/11/2022 We are entering a terrifying new phase of the Russo-Ukraine war Bob Seely The Telegraph 02/10/2022 How should the West respond to Putin’s nuclear threats? Bob Seely The Spectator 21/09/2022 Our visit to Kyiv, meeting with Zelensky, and my sense of the opportunities and dangers ahead Bob Seely ConservativeHome 20/09/2022 Russia and the war. 3) Tactics. Bob Seely ConservativeHome 17/03/2022 Russia and the war. 2) Its military. Bob Seely ConservativeHome 16/03/2022 Russia and the war. 1) Its aims. Bob Seely ConservativeHome 15/03/2022 What Moscow doctrine says about using nuclear and chemical weapons Bob Seely ConservativeHome 09/03/2022 We should have deterred a Russian invasion decades ago Bob Seely The Times 25/02/2022 The current climate in Bosnia is a concern for the international community Bob Seely The Times 01/02/2022 Putin is ready to gamble on war with the West Bob Seely The Telegraph 16/11/2021 How Russia’s spies became the best known secret agents on the planet Bob Seely The Spectator 04/10/2018 With Putin buying some EU states and bullying others, Britain cannot expect a united front on sanctions Bob Seely The Telegraph 21/08/2018 Ten steps to defend our country against the aggression and subversion of Putin’s Russia. Bob Seely ConservativeHome 06/09/2018 Russia is waging a new kind of conflict Bob Seely and Dr Andrew Foxall The Times 04/06/2018 Ukraine's flirtation with fake news could be disastrous for the West Bob Seely The Telegraph 31/05/2018 Kremlin-linked oligarchs’ money is used to harm our democracy – we must defend ourselves Bob Seely ConservativeHome 21/05/2018 How Russia's trolls and propagandists have turned Soviet disinformation into a terrifying art form Bob Seely The Telegraph 16/04/2018 The toolkit for Kremlin’s new warfare Bob Seely and Alya Shandra The Times 02/04/2018 How to stop cyber-savvy Vladimir Putin fixing the next election to get Jeremy Corbyn into No10 Bob Seely The Sun 25/03/2018 Why the Kremlin likes using poison Bob Seely The Spectator 06/03/2018 China Ignore the naysayers who insist we're too weak to stand up to China. We need the courage to get tough, just like Australia has Bob Seely Daily Mail 12/09/2023 China cannot be allowed to dominate Britain and force us to rely on them, says Bob Seely Bob Seely Express 30/08/2023 We need to protect ourselves when it comes to dealing with China, says BOB SEELY Bob Seely Express 13/07/2023 Don’t let China win the peace in Ukraine Bob Seely and Helena Ivanov The Telegraph 22/06/2023 Welcoming Hong Kongers shows Global Britain is willing to do more than virtue signal Bob Seely The Telegraph 31/01/2021 China's data gathering must serve as a wake-up call for the British Government Bob Seely The Telegraph 13/09/2020 It’s not all good news for Huawei Bob Seely Spectator US 14/07/2020 A new reality means a new, realistic British policy towards China Bob Seely CapX 09/07/2020 We do not want to see China undermining the rules-based global order Bob Seely and Iain Duncan Smith The Telegraph 08/06/2020 While we are distracted by Covid-19, China prepares to seize Hong Kong – and crush freedom Bob Seely ConservativeHome 24/05/2020 Our leaders must wake up: dependence on China is dangerous Bob Seely The Times 14/05/2020 Our allies have said, ‘No way, Huawei’ - we should take the threat seriously and do the same Bob Seely The Times 26/01/2020 Why the Government should listen to our allies and say: no way, Huawei Bob Seely ConservativeHome 13/01/2020 Hong Kong shows us we must be clearer about defending our values Bob Seely Sydney Morning Herald 02/09/2019 When it comes to the rights of Hong Kongers, Britain must be clearer with China Bob Seely The Telegraph 01/09/2019 Donald Trump is absolutely right about Huawei, and anyone interested in being PM should listen Bob Seely The Telegraph 02/06/2019 The contents of the Huawei leak are the real threat to national security Bob Seely The Telegraph 02/05/2019 There's no way we can trust the tech arm of the Chinese state to run our communications Bob Seely and John Hemmings The Telegraph 24/04/2019 Williamson is right. China and Huawei are threats to our security Bob Seely ConservativeHome 30/12/2018 Other foreign affairs Iran and its Hamas proxy have been emboldened by Western weakness: Hybrid warfare expert BOB SEELY explains how Tehran's tentacles are spreading remorselessly through the Middle East Bob Seely Daily Mail 07/10/2023 Afghanistan: a long-term strategy is needed Bob Seely The Times 18/08/2021 We have to keep our promise to the world's poorest - and save the 0.7 per cent target Bob Seely New Statesman 11/12/2020 Britain can lead in the new age of warfare Bob Seely The Telegraph 19/11/2020 Abolishing DfID 1) The case for. “Is this the be all and end all? No. But it is a great start.” Bob Seely ConservativeHome 17/06/2020 Bob Seely: How to make our foreign policy really work for Britain Bob Seely ConservativeHome 27/01/2020 How should Britain react to the escalating crisis in Iran? Bob Seely The Telegraph 08/01/2020 Trump may have just re-ignited a ‘hot cold war’ in the Middle East Bob Seely ConservativeHome 03/01/2020 How Iran is seeking to hit the West where it hurts – at the petrol pumps Bob Seely ConservativeHome 19/09/2019 In the Gulf, we are paying the price for starving defence of funding for so long Bob Seely ConservativeHome 23/07/2019 Proposals for CANZUK Bob Seely The British Interest 15/06/2019 Julian Assange, useful idiot and Left-wing dupe, will finally have to answer for his actions Bob Seely The Telegraph 11/04/2019 The rule of law is an absolute. It cannot be dispensed with when we deal with ISIS terrorists Bob Seely ConservativeHome 15/02/2019 Where do the midterms leave the Mueller investigation? Bob Seely CapX 09/11/2018 We need a list of lobbyists for hostile states Bob Seely The Times 25/10/2018 What does Global Britain really mean? Bob Seely CapX 02/10/2018 The online activists who found the Salisbury 'hitman' are our best weapon against Putin's lies Bob Seely The Telegraph 27/09/2018 Bob Seely and James Rogers: Britain remains remarkable - let’s challenge the ‘New Declinism’ Bob Seely and James Rogers ConservativeHome 23/08/2018 Perhaps the first war in which hospitals are the primary target. What I saw and heard on Syria’s border Bob Seely ConservativeHome 25/07/2018 The Answer To Yemen Is Neither Bombs Nor Bribes - Britain Needs A New Plan Bob Seely and Elisabeth Kendall HuffPost 17/05/2018 Bob Seely: Labour’s press chief Seumas Milne ‘peddled Putin’s lies’ Bob Seely The Times 06/05/2018 I’m a Tory MP and former soldier. Bombing Syria would make things worse Bob Seely The Guardian 12/04/2018 Syria's humanitarian disaster is fast becoming a global crisis Bob Seely CapX 09/04/2018 Australia's critical role in fighting weapons of influence Bob Seely Sydney Morning Herald 24/02/2018 Seven reasons why Liam Fox is wrong to question Sir David Richards’ assertion that British forces may need to remain in Afghanistan for decades Bob Seely ConservativeHome 13/08/2009 We shouldn’t have supported Kosovan independence Bob Seely ConservativeHome 15/04/2008 Politics Brits want Government to get to grips with legal and illegal immigration – here’s how I would do it Bob Seely The Sun 25/11/2023 Lessons from the Cummings era about leadership, decentralisation, localism – and making more use of MPs Bob Seely ConservativeHome 25/11/2020 What the Isle of Wight has learned from trialling the NHS’s Coronavirus App Bob Seely ConservativeHome 20/05/2020 In defence of the Isle of Wight’s suitability for tracking and tracing Bob Seely The Spectator 03/05/2020 Let’s use the Isle of Wight as a testing ground to solve our lockdown dilemma Bob Seely The Telegraph 26/04/2020 Britain’s islands provide the perfect trial setting for the Government’s track and trace strategy Bob Seely The Telegraph 23/04/2020 HS2 is a super turkey. Let’s invest in northern rail instead Bob Seely The Telegraph 28/12/2019 Why I resigned my government position to oppose HS2 Bob Seely The Telegraph 17/07/2019 Saving Britain billions. Ideas for the contenders in this leadership contest. Bob Seely ConservativeHome 09/06/2019 Why I’m backing Michael Gove Bob Seely CapX 31/05/2019 I am shocked by fellow MPs who think the will of Parliament trumps the will of the People Bob Seely The Telegraph 14/03/2019 Brexit is within reach. Why do so many Leavers refuse to grasp it? Bob Seely CapX 12/03/2019 Bloody Sunday prosecutions would betray our armed forces Bob Seely ConservativeHome 05/03/2019 We Tories must not condemn ourselves to irrelevance like Labour, by driving out discontented MPs Bob Seely The Telegraph 19/02/2019 The Withdrawal Agreement is the only way we can guarantee Brexit won’t be stolen Bob Seely The Telegraph 22/01/2019 MPs voting down May’s Brexit deal are the elite revolting against democracy Bob Seely The Guardian 14/01/2019 Arrogant Remainer MPs are steering us towards a democratic car crash Bob Seely The Telegraph 09/12/2018 This deal isn’t perfect. If it can be improved, great. But let’s not make the best the enemy of the good Bob Seely ConservativeHome 17/11/2018 Hunt must face up to the harsh strategic realities facing Britain Bob Seely ConservativeHome 01/11/2018 Yes, Brexit and leadership are important. But so’s everything else. Here are some ideas for the future Bob Seely ConservativeHome 18/09/2018 How Jeremy Hunt can breathe life into Britain’s global aspirations Bob Seely CapX 10/07/2018 Forget Brexit, there is a much bigger divide in the Conservative Party Bob Seely CapX 21/06/2018 Karl Marx’s sinister legacy of anti-Semitism Bob Seely The Spectator 04/04/2018 Post-Brexit, we need to be the world’s smart power nation. Let’s make it happen Bob Seely ConservativeHome 22/01/2018 The new emphasis on looking after veterans is one of the most important things to have come out of the Iraq War Bob Seely ConservativeHome 11/10/2009 Is Patriotism going to be the next big political idea? Bob Seely ConservativeHome 28/09/2009 The lessons the Conservatives must learn from the Labour Government’s appalling treatment and use of the Armed Forces Bob Seely ConservativeHome 05/09/2009 Lib Dem co-operation on civil liberties? Bob Seely and Bill Melotti ConservativeHome 10/02/2007",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_parliament/content_16.html": "Tweet You can see Bob's latest speeches and appearances in Parliament below (provided by theyworkforyou):\nImmigration and Asylum | Commons debates I beg to move, That leave be given to bring in a Bill to make provision for the annual approval by the House of Commons of maximum numbers i\nImmigration and Asylum | Commons debates I beg to move, That leave be given to bring in a Bill to make provision for the annual approval by the House of Commons of maximum numbers i\nHomicide: Prosecutions | Attorney General | Written Answers To ask the Attorney General, pursuant to the Answer of 20 January 2023 to Question 125287 on Rape: Prosecutions, how many (a) completed pros\nPeople Smuggling: Prosecutions | Attorney General | Written Answers To ask the Attorney General, with reference to the Answer of 20 January 2023 to Question 125287 on Rape: Prosecutions, how many (a) complete\nBus Services: England - [Valerie Vaz in the Chair] | Westminster Hall debates If the hon. Gentleman is so critical, what would the Labour party do about it?\nBus Services: England - [Valerie Vaz in the Chair] | Westminster Hall debates It is a pleasure to serve under your chairmanship, Ms Vaz.\nBus Services: England - [Valerie Vaz in the Chair] | Westminster Hall debates I thank the Minister for his intervention.\nHampshire and Isle of Wight Integrated Care System: Palliative Care | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, how much hospice-provided palliative care was commissioned by the Hampshire and Is\nHampshire and Isle of Wight Integrated Care Board | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what assessment her Department has made of the adequacy of the performance of the\n[Christina Rees in the Chair] | Westminster Hall debates I thank everyone for attending and I thank you, Ms Rees, for chairing the debate.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_accessibility/content_14.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_religious-freedoms/content_21.html": "Thank you for contacting me about religious freedoms. My ministerial colleagues and I are committed to defending freedom of religion or belief (FoRB) for all, and to promoting respect between different religious and non-religious communities.\nThe importance of championing freedom of religion or belief is laid bare in the facts and figures regarding Christian persecution described in the Open Doors world watch list for 2024. Promoting and defending the right to FoRB is one of the UK's longstanding human rights priorities.\nI would like to briefly outline how the Government strives to do so.\nThe Iranian regime’s human rights record is appalling, and FoRB is no exception: the recent upsurge in arbitrary arrests of Christians is particularly concerning. At the 78th United Nations General Assembly, the UK co-sponsored the Iran Human Rights Resolution, calling for Iran to eliminate- in law and in practice- all forms of discrimination on the basis of thought, conscience, religion or belief. I have been assured that the UK will continue to work with international partners via multilateral fora to promote the rights of Christians in Iran.\nThe environment for FoRB in China is sadly also restrictive, and alongside Iran, China is one of 32 human rights priority countries for the UK. As befits this priority status, the UK Government regularly raises human rights concerns, including on the treatment of religious and ethnic minorities, directly with the Chinese authorities and in multilateral fora, including the OSCE, Council of Europe, International Religious Freedom or Belief Alliance.\nIn India, the British high commission in New Delhi and our deputy high commissions across the country regularly meet with religious representatives and official figures. The high commissioner has visited a number of diverse places of worship in India, meeting faith leaders there—including Christian communities.\nMoreover, the UK engages directly with government officials in Algeria and through the United Nations Human Rights Council universal periodic review process and follow-up recommendations. I especially welcomed the recent visits by the UN Special Rapporteur on the Rights to Freedom of Peaceful Assembly and of Association, and the Special Rapporteur on Human Rights Defenders.\nMore broadly, the Government has been working to embed FoRB considerations across the work of the Foreign, Commonwealth and Development Office. History has shown that where FoRB is under threat, other human rights are also at risk: I therefore welcome that defending this right remains top priority for the UK.\nThank you again for taking the time to contact me.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_privacy/content_8.html": "This document outlines how Bob Seely processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Bob Seely\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Bob Seely.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Bob Seely, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Bob Seely via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_cdn-cgi_l_email-protection/content_24.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_category_Westminster-News/content_19.html": "CASH BOOST FOR ISLAND SCHOOLS CONFIRMED IN LETTER TO ISLAND MP 16th March 2020 Island MP Bob Seely has received written confirmation that Island schools will receive a significant increase in funding for pupils with special educational... Westminster News\nMP PLEADS ISLAND’S CASE FOR HOSPITAL FUNDING 6th March 2020 MP Bob Seely has reiterated to Government Ministers that the Island has additional costs to bear when it comes to healthcare, because it is separated from the... Westminster News\nISLAND MP WELCOMES MORE GOOD NEWS FROM GOVERNMENT 10th February 2020 Island MP Bob Seely has welcomed the news that all Island school children will be offered cycle training. The announcement came from Cycling Minister, Chris... Westminster News\nMP ASKING GOVERNMENT FOR A STATEMENT ABOUT ISLAND LINE 9th January 2020 MP Bob Seely is asking the Government to make a statement about the South Western Railway franchise – which includes Island Line - following concerns raised... Westminster News\nMP visits GKN Aerospace 3rd September 2019 MP Bob Seely has praised a decision by GKN Aerospace to invest heavily in its Isle of Wight operation during a recent visit to the company’s Cowes plant. GKN... Westminster News\nBob congratulates Boris on becoming PM 23rd July 2019 Island MP Bob Seely has congratulated the country’s next Prime Minister, Boris Johnson, on winning the conservative party vote putting him in Downing Street. Mr... Westminster News\nBob Leaves Government Role Over HS2 17th July 2019 MP Bob Seely has resigned from his role as a Parliamentary Private Secretary (PPS) for the Department for Environment, Food & Rural Affairs (DEFRA) after... Westminster News\nBob fights for WASPI Women 15th July 2019 MP Bob Seely has spoken in parliament about the hardship faced by thousands of Island women who are affected by the change in legislation to equalise the state... Westminster News\nBob Stands Up For Veterans 12th July 2019 MP Bob Seely has backed changes to the law which would give British servicemen more protection against so-called legacy prosecutions. Mr Seely said its grossly... Westminster News",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_freshwater-hotel-re-opening-draws-near/content_6.html": "The Albion Hotel in Freshwater Bay is due to open within weeks and IWW candidate Bob Seely dropped by to check on progress.\nThe hotel has undergone a multi-million-pound refurbishment since it changed hands early last year. Bob Seely, who is hoping to be re-elected on 4 July, dropped by the Albion to meet with the new owners.\nBob said: “This is exactly the sort of investment we need on the Island and in the West Wight in particular, creating jobs and bringing more money to the Island’s visitor economy.\n“Great to meet up with the new owners, David and Mark and to see their plans.”\nUnder new owners, A2K Leisure, the 41-bedroom hotel has been upgraded throughout with new decoration, fixtures and fittings and a new spa.\n“David and Mark talked me through their plans for the hotel while the builders were busy working on last minute details ahead of a formal re-opening.\n“I thank David for his investment, and I wish them every success.”\nNew owner, David Walker from A2K Leisure said: “It has been an amazing challenge squeezing a brand-new hotel into a building which is 300 years old in places.\n“We are very proud of what we have achieved and thank all the people who have helped us get this far. 95% of the people we have used are Island based. So, this is very much a local achievement!”\nThe hotel is currently taking bookings for 2024 via its website.",
  "http_www_bobseely_org_uk_/https_www_bobseely_org_uk_news_bob-seely-welcomes-uk-ban-wet-wipes-containing-plastic/content_32.html": "News confirming the government will this year introduce legislation to ban wet wipes containing plastic has been welcomed by MP Bob Seely.\nWet wipes containing plastic break down into microplastics over time, which can be harmful to human health and disrupt ecosystems. A ban will reduce both plastic pollution and the volume of microplastics entering wastewater treatment sites and ending up on beaches and in waterways.\nMr Seely said: “This is very welcome news and builds on action already taken by the government to tackle plastic pollution and clean up our environment including banning some single-use plastics and introducing a charge for single-use carrier bags.\n“This legislation takes things a step further. It’s a small change but it’s part of a package of wider measures that together make a difference.\n“Anything we can do, no matter how small, to prevent plastic from entering our waters in the first place is a positive step forward.\n\"It's especially important for coastal communities such as the Isle of Wight because we don't want plastic washing up on our shores.\"\nThe move comes as part of the Government’s Plan for Water launched in April 2023 which set out measures to transform and integrate the water system, address sources of pollution and boost water supplies through more investment, tighter regulation, and more effective enforcement.\nA consultation launched by the government last Autumn showed overwhelming support for the proposed ban with 95% of respondents agreeing or strongly agreeing with the proposals.\nThe legislation for England will be brought forward ahead of Summer recess, with Northern Ireland, Scotland and Wales following by the Autumn. The ban will be introduced via secondary legislation under the Environmental Protection Act 1990.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_investing-isle-wights-healthcare/content_3.html": "Many healthcare services like those provided at St Mary’s Hospital are too critical to be provided on the mainland. I’m focused on supporting St Mary’s as well as improving access to GP and dental services on the Island.\nAs your MP, I successfully lobbied ministers to support the Isle of Wight NHS Trust’s bid for a £48 million healthcare transformation programme.\nFor 2024, we will complete work on\n• upgraded wards at St Mary’s Hospital\n• a new diagnostics centre at St Mary’s\n• and a new community health hub in Newport.\nI am fighting for more NHS dental services and I am working closely with the Integrated Care Board to bring more dentists to the Island. This year, the Government will publish its Dental Recovery Plan, setting out changes to help constituents access dental care.\nOn NHS dentists:\nFirst there is a temporary increase in NHS payments for Island dental practices to increase NHS treatments.\nSecond, the recommissioning of contracts with NHS dentists will increase capacity on the Island.\nThird, starting by March at the latest, a mobile dental bus will come to the Island.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_local-articles/content_18.html": "Tweet Isle of Wight MP Bob Seely responds to column about leadership Bob Seely Isle of Wight County Press 23/09/2023 Isle of Wight Council school decisions worrying says MP Bob Seely Isle of Wight County Press 25/08/2023 Column by Isle of Wight MP Bob Seely - Good news since 2010 Bob Seely Isle of Wight County Press 26/07/2023 Isle of Wight MP praises teachers in his monthly newspaper column Bob Seely Isle of Wight County Press 02/07/2023 Support Isle of Wight local food businesses and suppliers Bob Seely Isle of Wight County Press 11/06/2023 Isle of Wight MP's advice during cost of living crisis Bob Seely Isle of Wight County Press 29/05/2023 Isle of Wight MP Bob Seely welcomes Southern Water water butts Bob Seely Isle of Wight County Press 01/05/2023 Isle of Wight MP outlines policy on sewage in response to letter Bob Seely Isle of Wight County Press 25/03/2023 Ferries are critical to Island life and here's what needs to be done Bob Seely Isle of Wight County Press 18/03/2023 \"Let the facts speak for themselves\" MP Bob Seely provides update on the Island Deal Bob Seely Isle of Wight County Press 01/03/2023 Let's be clear...merger of trusts will strengthen Island health services Bob Seely Isle of Wight County Press 28/02/2023 Waste recycling plant puts Island at forefront of green energy Bob Seely Isle of Wight County Press 24/02/2023 Isle of Wight MP Bob Seely's monthly County Press column Bob Seely Isle of Wight County Press 28/01/2023 Planning changes are good news says Isle of Wight MP Bob Seely Bob Seely Isle of Wight County Press 23/12/2022 As the Isle of Wight's MP, I’m not complacent and I’m proud to work for Islanders Bob Seely Isle of Wight County Press 08/12/2022 MP Bob Seely says he is striving to keep up the good work for Islanders Bob Seely Isle of Wight County Press 28/11/2022 I have put Isle of Wight at forefront of Southern Water clean up strategy Bob Seely Isle of Wight County Press 30/10/2022 Sorry about the Westminster roundabout...but I am still working on better deals for the Island Bob Seely Isle of Wight County Press 28/10/2022 Isle of Wight households can get help with cost of living crisis Bob Seely Isle of Wight County Press 02/08/2022 We don't want a National Park for the Island...but here's a better idea Bob Seely Isle of Wight County Press 28/05/2022 It's time Wightlink brought back late-night Portsmouth Fastcats Bob Seely Isle of Wight County Press 26/03/2022 Victory for Isle of Wight will see more roads policing officers Bob Seely Isle of Wight County Press 26/02/2022 Isle of Wight should be at front of the queue for investments and improvements Bob Seely Isle of Wight County Press 29/01/2022 Despite the Covid pandemic, it’s been a busy year for the Island MP Bob Seely Isle of Wight County Press 03/01/2022 These are the real reasons I didn't vote for amendment on sewage Bob Seely Isle of Wight County Press 29/10/2021 Isle of Wight MP Bob Seely says we need to get planning and housing right Bob Seely Isle of Wight County Press 01/10/2021 Isle of Wight education standards are improving all the time Bob Seely Isle of Wight County Press 26/06/2021 Public ownership would give Isle of Wight some control over ferries Bob Seely Isle of Wight County Press 18/06/2021 I'm looking for aid to build Isle of Wight back better Bob Seely Isle of Wight County Press 01/05/2021 Isle of Wight may not have had a 'Deal' but it has had plenty of cash Bob Seely Isle of Wight County Press 11/04/2021 Let's make Isle of Wight a movie star location Bob Seely Isle of Wight County Press 27/03/2021 Free school meals handled badly but decision may be right Bob Seely Isle of Wight County Press 30/10/2020 Isle of Wight MP - I'll have no part in scapegoating Bob Seely Isle of Wight County Press 08/01/2021 Covid lockdown has hurt, so let's support Isle of Wight business Bob Seely Isle of Wight County Press 28/11/2020 From curds to cider...the Isle of Wight has quality produce Bob Seely Isle of Wight County Press 31/07/2020 Enticing prospect of Newport to London Waterloo by rail Bob Seely Isle of Wight County Press 22/06/2020",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_fighting-better-education/content_15.html": "Education is a success story in England. Reading achievement in Year 5 is now amongst the best in the world and the percentage of good or outstanding schools in England has gone up from under 70 percent to near 90 percent.\nThe Conservative introduced Free Schools - including one in Ventnor on the Island - and rolled out the academy programme. The UK Government has also invested in more and better apprenticeships. This year Island Schools will received over £90 million pounds to help headteachers cope with inflation the rising costs.\nOur plans for 2024 will see the IW College being largely rebuilt with a £25 million grant from the Government. I’m also working with employers to highlight the benefits of apprenticeships, to help support the Island’s skilled industry.\nHowever, failing so-called Alliance Councillors, supported by Labour and the Lib Dems, are damaging Island primary schools. They have delayed planning for primary school place planning and refused to listen to the advice of headteachers and school governors.\nI am working with the Department for Education to hold the Alliance Councillors to account.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_bob-seely-presents-ferries-bill-parliament/content_28.html": "Today, Bob Seely MP presented the Solent Ferry Regulator Bill to Parliament, making it the last Bill to be presented before the general election.\nSeely’s Bill proposes the creation of an independent regulator for Island ferry services. The regulator would aim to promote competition, drive down prices and improve the service for Islanders.\nThis Bill follows Bob Seely’s 21-page report into the Isle of Wight Ferry services earlier this year which you can read here.\nNow the general election has been called the Bill will not progress further in its current form, but it could be considered again after the election.\nBob Seely MP said: “Over the past 20 years the ferries have become slower, less frequent, more expensive and less reliable, and we have seen further disruption this week.\n\"Following the publication of my reports into the cross-Solent ferries, Islanders have made it very clear to me that they support both a ferry regulator and new entrants into the market. This Bill would create the former while I continue to champion the latter.\n\"While the snap general election means this Bill will now have to wait, I said I would present a Bill in this Parliament and I have.\n\"I promise that If I am re-elected on the 4th July, I will continue to proceed with this proposal, and championing the interests of Islanders more widely.\"",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_ocean-protection/content_5.html": "Thank you for contacting me about ocean protection.\nThe UK is a global leader in protecting our seas, the ocean and marine life, working with counterparts both in the UK and overseas.\nAt COP15 in 2022, almost 200 countries agreed a global commitment to reverse biodiversity loss and to protect 30 per cent of land and oceans by 2030. The UK also announced nearly £30 million to support developing countries to deliver the \"30 by 30\" target. In addition, in March 2023, UN Member States agreed the High Seas Treaty, which aims to place 30 per cent of the seas into protected areas by 2030.\nFurther, 374 Marine Protected Areas (MPAs) protect 38 per cent of UK waters, which are all subject to planning and licensing regimes to ensure they are protected from harmful activities. The Government’s Environmental Improvement Plan (EIP) sets the country on a path to deliver an improved marine environment and halt the decline in biodiversity which benefits us all. As set out in the EIP, the Government has a statutory target to have 70 per cent of designated features in MPAs in a favourable condition by 2042, with the remainder in a recovering condition.\nThe UK was among the first signatories to the Biodiversity Beyond National Jurisdiction Agreement at the UN in 20 September 2023. Work is in hand on the legislation and other measures needed to translate the detailed and complex provisions of the agreement into UK law before ratification when parliamentary time allows.\nThe first Highly Protected Marine Areas (HPMAs) have come into force. These areas of the sea will benefit from the highest level of protection which will exclude all fishing, thus encouraging full recovery of marine ecosystems. For HPMAs to be successful, the Government will work with the fishing industry, other marine industries and sea users in designating, managing and monitoring them.\nI was pleased to receive confirmation that the Government will introduce legislation to ban wet wipes containing plastic this year. This builds on action already taken by the government to tackle plastic pollution and clean up our environment. This is an important step forward for areas such as the Isle of Wight as we don't want plastic washing up on our local beaches. I recently joined Planet Aware at Brook Beach and discuss the issue of nurdle pollution.\nFurther information is available here:\nhttps://www.bobseely.org.uk/news/bob-seely-welcomes-uk-ban-wet-wipes-containing-plastic\nhttps://www.bobseely.org.uk/news/isle-wight-mp-keen-tackle-plastic-pollution\nThank you again for taking the time to contact me.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk/content_1.html": "Constituency Office\nOffice of Bob Seely, Northwood House, Ward Avenue, Cowes PO31 8AZ\n01983 220 220\nI’m Bob Seely, former MP for the Isle of Wight and 2024 Conservative candidate for the Isle of Wight West constituency. Find out here about my campaigns to get a better deal for the Island, and my six-point plan for the future. I’m here to help and I always enjoy hearing from fellow Islanders; please do get in touch.\nThe Isle of Wight needs, and deserves, a better deal from the ferry firms than the one we have. The status quo has lasted 40 years. I believe we need a new joint approach so I’ve written a plan for the Isle of Wight so we have a common agenda.\nI’m committed to stamping out crimes such as home burglary and anti-social behaviour. We have already recruited another 30 police officers on the Island. We’re also ensuring that our police spend more time on the beat and visible in our communities, cutting crime.\nEducation is a success story in England. Reading achievement in Year 5 is now amongst the best in the world and the percentage of good or outstanding schools in England has gone up from under 70 percent to near 90 percent.\nIsland pay is similar to the rest of the country but below the South East. I want to get a better deal on jobs to give Islanders better life chances and better opportunities.\nOn planning and the environment, we need to protect more of the Island’s unique landscape and environment, including our rivers, seas and green spaces. We need a more appropriate housing target for the Island and I want to see more action from Southern Water to reduce storm overflows.\nMany healthcare services like those provided at St Mary’s Hospital are too critical to be provided on the mainland. I’m focused on supporting St Mary’s as well as improving access to GP and dental services on the Island.\nIn 2019, we secured the biggest investment in rail on the Island in 50 years to upgrade our trains, stations, and track; repair Ryde Railway Pier; and keep trains running to Ryde Pier Head.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns/content_29.html": "Ocean Protection Thank you for contacting me about ocean protection. The UK is a global leader in protecting our seas, the ocean and marine life, working with counterparts both...\nPlastic Pollution Thank you for contacting me about plastic pollution. The Resources and Waste Strategy for England sets out the Government’s plans to reduce, reuse, and recycle...\nReligious Freedoms Thank you for contacting me about religious freedoms. My ministerial colleagues and I are committed to defending freedom of religion or belief (FoRB) for all...\nEconomic Activity of Public Bodies (Overseas Matters) Bill Thank you for contacting me about boycotts by public institutions. The Economic Activity of Public Bodies (Overseas Matters) Bill will stop public bodies...\nPesticides Thank you for contacting me about the regulation of pesticides. I would like to reassure you that my ministerial colleagues and I share the public’s high regard...\nBritish Overseas Territories Thank you for contacting me about the British Overseas Territories. The Crown Dependencies and Overseas Territories (CDOTs) are fiscally autonomous...\nAbortion Thank you for contacting me about abortion. Abortion on the grounds of sex alone is illegal and guidance for doctors on how to comply with the Abortion Act 1967...\nFossil Fuel Non-Proliferation Treaty Thank you for contacting me about the use of fossil fuels. I note your comments in relation to the Fossil Fuel Non-Proliferation Treaty. I would like to assure...\nAnimal Welfare (Kept Animals) Bill Thank you for contacting me about the Animal Welfare (Kept Animals) Bill. As the highest-ranked G7 nation on World Animal Protection's Animal Protection Index...\nContracts for Difference Thank you for contacting me regarding the Contracts for Difference (CrD) mechanism. I am aware that total investment into UK offshore wind, onshore wind and...\nPalestinians Thank you for contacting me about creating a visa scheme for Palestinians. I understand that there are currently no plans to introduce bespoke arrangements for...\nPrivate Rented Sector Thank you for contacting me about reforming the private rented sector. The Renters (Reform) Bill is intended to create a fairer rental market in England. The...",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_events_feed/content_10.html": null,
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_about-bob-seely/content_20.html": "Bob was first elected as the Conservative MP for the Isle of Wight parliamentary constituency in June 2017. He was re-elected in December 2019, with the highest number of votes ever secured on the Isle of Wight by any candidate.\nBob lives near Brighstone, at the heart of the Island. He is the sixth generation of his family to be involved in community life on the Isle of Wight. He is committed to representing all Islanders, regardless of political affiliation, fighting for the interests of the community as a whole.\nBob is a former journalist and soldier. From 1990 to 1995, he worked as a foreign correspondent in the USSR/post-Soviet states. From 2008 to 2017, he served in the UK Armed Forces on the Iraq, Afghanistan, Libya and ISIS campaigns.\nBob has a PhD in International Security Studies from King’s College.\nBob’s career prior to becoming the Island’s MP\nBob worked as a foreign correspondent in eastern Europe for four years for The Times newspaper. He first visited the USSR in early 1990, witnessing the first celebrations of Easter in western Ukraine since Soviet occupation after World War II, and also the first Chernobyl disaster protests in Kiev that year. He filed an initial batch of reports and was invited by the newspaper to return permanently to the USSR / former USSR.\nBetween 1991 and 1995, Bob lived in Kyiv, and reported from many parts of the then USSR: Russia (including Moscow, European Russia and Siberia) Ukraine (including Crimea), Moldova, Georgia, Azerbaijan, Armenia (including Nagorno Karabakh), Uzbekistan and Tajikistan. He also made occasional visits to the Balkans, including Sarajevo and Kosovo. He also wrote occasional articles for The Spectator and The Sunday Times.\nIn the final year in the former USSR, Bob became a Special Correspondent for The Washington Post. He then spent a year in the USA writing a book, Deadly Embrace, on Russia’s role in the Caucasus. During this time, Bob was a fellow at Brown University’s Watson Institute. He returned to the UK to work for the Associated Press as a London-based reporter.\nIn 2000 Bob moved into politics for a short period. He headed up the foreign affairs team for Francis Maude. In 2005, he stood in the Broxtowe Parliamentary seat in the General Election but lost to the Labour candidate by 2,296 votes.\nFrom 2005 to 2008 Bob worked for MTV Networks International.\nRussia and Ukraine\nBob has written on the threat of Russian warfare, and for years warned of the threat of a new cold war.\nIn 1995, writing for the Wall Street Journal, Bob predicted of the decades ahead: “After a honeymoon period following the collapse of the Soviet Union, Europe now looks set for a new era of rivalry between coalitions of nations led by the United States and one led by the Russian Federation.”\nIn 2008, Bob criticised the UK Government’s policy recognising Kosovo. He argued: “It will harm our relationship with Russia, extending and worsening the new Cold War. It will diminish the prospects for stability and order in many parts of the world, not least in the Balkans as well as the arc of instability which rings the southern flank of Russia. It will result in a loss of credibility for Western diplomacy.” In the Kings College’s ‘Defence-in-Depth’ blog in 2016, Bob claimed “that Western states are now in a third cold war with Russia.”\nIn 2017, Bob, writing for the influential UK think tank, the Royal United Services Institute, argued that President Vladimir Putin’s objectives were: “to remould Russia in an illiberal and anti-Western way. He represents a virulent strain of Russian thought and identity that rejects, even despises, Western liberal thought.” He also predicted that Russian soldiers stationed in Crimea were “positioned as a precursor to further violence.” Writing in The Daily Telegraph in November 2021, Bob argued that: \"In his final decade in power, Putin wants to do three things: first, destroy an independent Ukrainian state; second, shatter NATO and third, cement Russia’s role of an illiberal rival to the West. He will risk war.”\nAs of 2023, Bob chairs or co-chairs the All Party Parliamentary groups in Parliament on both Russia and Ukraine.\nMilitary Career\nFrom 2008 onwards, Bob served in the UK Armed Forces. He was mobilised or placed on Full Time Reserve Service (FTRS) for nearly a decade until his selection as a parliamentary candidate in the 2017 election, at which time he resigned his full-time service and returned to the Army Reserve.\nBob was initially mobilised in 2008, deploying to Iraq. He served out of Basra Airport. Over eight months (parts of Op TELIC 12 and 13), he deployed on over 20 operations during his tour, mainly focused on extended patrolling through the villages around the southern Basra marshes and parts of Basra city, meeting local village elders and providing atmospherics reporting for the UK Command. After his tour Bob was remobilised and asked to remain in the Armed Forces on full-time service. He deployed on four occasions to Afghanistan for tours of between one to four months. He was based out of Lashkar Gah, and Nad-e Ali. He also served on the Libya and ISIS campaigns.\nBob has also supported the development of UK military thinking in unconventional warfare.\nBob was awarded a Joint Commanders Commendation in 2009 and was decorated with a Military MBE in the 2016 Operational Awards and Honours List, which he received from the late Queen in early 2017.\nBob's Commissioning as a Captain at Sandhurst in early 2017\nAcademic, Defence and Foreign Policy Work\nBob has a PhD in International Security Studies from King’s College, London. The title of his thesis was: Uniting Ways of War for Perpetual Conflict, An Examination of Contemporary Russian Warfare.\nHe argued that modern Russian warfare – and modern conflict - should be interpreted as the unification of two ways of war, conventional military warfare with non-conventional forms of conflict. In the case of Russia this united the conventional war of the Red Army with the unconventional tactics of the KGB and the Communist Party. He argued that the Russo-Ukraine war has been ongoing for nearly twenty years and, thus far, in three phases. It began in 2004, using the tools of political, economic, espionage and informational warfare to subvert Ukraine’s political leadership. From 2014 onwards, the Kremlin additionally used violent political fronts and paramilitary groups to conduct a limited war in eastern Ukraine. From 2022, it attempted to rely on overwhelming military force for a third, largely conventional, phase.\nHis academic writing is available online. He is an occasional blogger on Russian / Ukrainian issues, hybrid war, unconventional and new forms of war. He has contributed to the King’s College War Studies blog, Oxford Politics Department blog, The Washington Post’s social sciences blog and the Journal of the Royal United Services Institute as well as The Telegraph, The Times and The Spectator.\nFamily Background\nBob is descended from a family involved in business, politics and soldiering. His family have come from the Isle of Wight and Nottinghamshire. He is the sixth member of his paternal family to become a Member of Parliament, the second to be MP for the Isle of Wight and the third to contest the Island since the 19th century. He is the first member of the family to be knowingly elected as a Conservative MP (a great, great uncle was elected under the Conservative banner whilst serving in the Boer War, but assumed he was standing as a Liberal due to the family’s political traditions).\nThe family had a reputation for radical liberalism. Charles Seely MP (1803-1887) was a Chartist supporter and Liberal republican MP (Lincoln) who Queen Victoria refused to talk to for a quarter of a century after Seely invited the Italian revolutionary Giuseppe Garibaldi to Britain. Another four family members were Liberal or Liberal Unionist MPs between the 1860s and 1950s. Two, Jack Seely and Hugh Seely, were government ministers in 20th Century Liberal and Coalition Governments. Jack had been MP for the Isle of Wight on two occasions, 1900-1906 and 1923-1924. As General Jack Seely, he led one of the last great cavalry charges in history at the Battle of Moreuil Wood on his horse Warrior in March 1918, preventing German forces from decoupling British and French armies. Jack Seely was a close friend of Winston Churchill and the only former Cabinet Minister to go to the front in 1914 and still be there four years later. Jack Seely’s book about his horse, Warrior, was a best-seller in 1934 and on its re-release in 2014.\nThe Seely family wealth was built on the agricultural revolution - milling in Lincoln - and afterwards the industrial revolution - coal in Nottinghamshire. The family were known for their philanthropic work, establishing schools in Nottinghamshire as well as recognising union representation in the family coal mines as far back as the late 19th century. On the Island, they established a library service and Reading Rooms, built housing for the rural poor and helped to establish a lifeboat service along the southwest coast of the Island. The family’s wealth was whittled away during the 20th century.\nBob was born in 1966 to Richard and Helga. He was educated at Arnold House School, and Harrow School.\nThe lives of both of his parents were shaped by World War II.\nBob's grandfather, Bill Seely, was killed leading his Artillery Regiment, the South Notts Hussars, during desperate fighting at the battle of Gazala in June 1942. On the morning of the Regiment’s destruction, 6 June, Seely’s Regiment had received the order to fight ‘to the last man and the last round’ to provide cover for retreating British forces. It succeeded, but at the cost of the destruction of the unit as a fighting force and the death of many of its men. Lt. Col. Seely himself was killed when his tank was pierced by a German shell, two hours before the Regiment’s positions were finally overrun.\nPrior to his death, Lt. Col. Seely had been Mentioned in Despatches for gallantry, for leading his men in taking several thousand Italian prisoners.\nFor some time after, Richard - who was then a young teenager - lived in hope that his father had been taken prisoner. Richard later trained as a pianist, before becoming a government lawyer. He died in 2013.\nBob's German mother, Helga, was brought as a young girl up in Nazi Germany. Her family had moved to Krackow during the war where her father worked as a postman. Bob's maternal grandmother was killed at the end of the war, and his mother’s life was saved thanks to her father’s ability to speak Russian and serve as a translator for the invading Soviet forces. The family ended the war in a refugee camp in Dresden, and from there made their way to what became western Germany. Helga later moved to the United Kingdom. She passed away in 2015.\nIn his free time, Bob loves the outdoor spaces of the Island and enjoys exploring our footpaths, bridleways and beaches. He plays guitar badly. Bob is a keen swimmer and occasionally swims the Solent for charity.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news/content_26.html": "FRESHWATER HOTEL RE-OPENING DRAWS NEAR Monday, 17 June, 2024 The Albion Hotel in Freshwater Bay is due to open within weeks and IWW candidate Bob Seely dropped by to check on progress. The hotel has undergone a multi-million-pound refurbishment since it changed hands early last year. Bob Seely, who is hoping to be re-elected on 4 July, dropped by the Albion to meet with the new owners. Bob said: “This is exactly the sort of investment we need on the Island... Local News\nBOB SEELY WELCOMES PROGRESS ON NEW SPORTS GROUND 12th June 2024 Bob Seely has welcomed news that plans for a new Newport Football Club stadium - and also the new retail park that will finance it - are moving forward. The... Local News\nCONSERVATIVES MAKE MANIFESTO COMMITMENT TO ISLE OF WIGHT FERRIES REVIEW 11th June 2024 Bob Seely has secured a manifesto commitment from Prime Minister Rishi Sunak for a review of the Solent ferries. The review will look at “all options” to... Local News\nBOB SEELY THANKS D-DAY EVENT ORGANISERS AND ATTENDEES 10th June 2024 Local champion Bob Seely has thanked the organisers and all those who attended the D-Day events across the Isle of Wight. Over the past few days, the Island has... Local News\nBOB SEELY WELCOMES PLAN FOR 8,000 EXTRA POLICE 10th June 2024 Conservative parliamentary candidate for Isle of Wight West, Bob Seely, has welcomed a plan from his party to put even more police on the streets. In the run up... Local News\nBOB SEELY WELCOMES PLAN TO CAP MIGRATION 5th June 2024 Bob Seely has welcomed Rishi Sunak’s plan for a legally binding cap on immigration to bring numbers down to much lower levels. Bob, who is the Conservative... Local News\nBOB SEELY HIGHLIGHTS RED FUNNEL’S FAILINGS 3rd June 2024 As part of his continuing campaign for better ferry services, Bob Seely has produced evidence which shows that, over the last 26 years, Red Funnel services have... Local News\nBOB SEELY SAYS WIGHTLINK APOLOGY NOT GOOD ENOUGH 24th May 2024 Bob Seely MP said: \"Wightlink's apology is welcome but frankly not good enough, given their increasingly poor record of reliability. \"My recent report into the... Local News\nBOB SEELY PRESENTS FERRIES BILL IN PARLIAMENT 24th May 2024 Today, Bob Seely MP presented the Solent Ferry Regulator Bill to Parliament, making it the last Bill to be presented before the general election. Seely’s Bill... Local News\nBOB SEELY RECEIVES ASSURANCE THAT EAST COWES WILL NOT LOSE ITS FIRE STATION 22nd May 2024 MP Bob Seely has received confirmation that East Cowes will not lose its fire station. The fire station was suddenly closed on 9 May following the results of a... Local News",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_more-police-officers-safer-streets/content_11.html": "We're getting a better deal on policing. We have already recruited an additional 500 police officers for the Hants and the Isle of Wight Constabulary. We’re also ensuring that our police spend more time on the beat. Chief Constable Scott Chilton became the first police leader to ditch a requirement for police officers to have degrees, preferring to have 'more officers on the street' learning on the job rather than in classrooms. That has freed up 100,000 more police hours. (https://www.hampshire-pcc.gov.uk/end-of-mandatory-degrees-for-officers-…).\nAs part of getting a better deal for the Island, we’ve already recruited 30 new Isle of Wight police officers to make our streets safer for you and your family. Donna Jones has also agreed to my request for the retune of dedicated Roads Police Unit officers to the Island to deal with dangerous driving. Donna and I are also working on better ways to to support victims of sexual assaults.\nOur plans for 2024 mean that we are\n-\nOpening a new police station in Cowes\n-\nRe-opening Ryde police station to the public\n-\nAssigning a dedicated police officer to every community\nWe have also ensured that the name of the forces has been changed to include the Island in the force's title: Hampshire and the Isle of Wight",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_daily-telegraph-article-computer-says-no-house-building-plan-another-own-goal/content_31.html": "This article by Bob Seely MP was in the Daily Telegraph on 28th September 2020.\nThe Telegraph has revealed the full extent of plans to unleash a wave of greenfield housing over rural and suburban England. It amounts to the suburbanisation of many rural areas and the urbanisation of many suburbs.\nAt this difficult time, it's critical that the Government and backbench MPs work supportively together. However, we also have a duty to articulate our constituents' concerns.\nThis latest own goal comes thanks to a new algorithm for assessing house building. The new housing targets can, apparently, simply be adopted without debate.\nI'll be blunt: the new numbers are grim: environmentally unsustainable, they heap further pressure on stressed suburban and rural roads and rail, and in many constituencies they won't help first-time buyers. In the process, decision-making will be removed from communities.\nWe all agree we need to build housing, but we need to build the right housing in the right places.\nConservatives at the last election stood on a manifesto of \"levelling up\" - an integrated approach to supporting infrastructure, jobs and house building to revive primarily urban, Northern and Midland communities. Yet a year after winning an election promising a renaissance for forgotten areas, are we now doing the opposite?\nThe key fact is this: cities across England are being asked to build relatively less compared with the rural and suburban areas around them.\nSo, compared with the current method, over 15 years - the life of an average local plan - Southampton's target will fall by 2,511 houses while Hampshire rises by 26,040 to 115,644; Nottingham city falls by 3,782, while Nottinghamshire rises by 25,173 to 71,609.\nThe glaring exception is London, which also sees exponential rises.\nAcross swathes of the North West, Yorkshire and the North East, three dozen local authorities have targets lower than their existing local plans.\nInstead of levelling up the North, I fear we are concreting out the South.\nThis bizarre algorithm has been unleashed in the name of affordability; sadly, it's likely to make little difference. First-time buyers want one- and two-bed houses in existing communities, not four-beds in car-dependent greenfield sites favoured by developers, who are already sitting on nearly a million unbuilt planning permissions.\nRural England has been told for years that it \"needs to do its bit\". Well, my constituency, the Isle of Wight, tells a story similar to many. Since 1961, the population has grown by 50 per cent. By comparison, many Northern cities have declined. The island now has overdevelopment pressures. Our transport network is, with the exception of half a mile of dual carriageway, the same as the Victorians bequeathed us, minus most of the rail.\nThe island is a Unesco biosphere, yet we are being asked to near double our already unachievable housing target from 688 to 1,045 dwellings per year.\nThe Government might as well ask the island's council to develop a Moon-landing programme for all the likelihood of achieving those targets.\nI fear, like Little Britain's Carol Beer, a \"computer says no\" culture is creeping into Government. The algorithm row is an unnecessary, self-inflicted wound.\nThose in Red Wall seats will see little change as cash goes to the shires. Shire voters will react with anger at swathes of greenfield planning. Labour in the North will accuse Red Wall Tories of failure to deliver. Lib Dems in the South will claim to champion local democracy. As policies go, it's a double whammy of lose-lose. Only an algorithm could be this dumb.\nIf we get this wrong, come the next election, I fear it won't only be Carol's computer that says no.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_bob-seely-welcomes-progress-new-sports-ground/content_13.html": "Bob Seely has welcomed news that plans for a new Newport Football Club stadium - and also the new retail park that will finance it - are moving forward.\nThe club is currently playing at East Cowes Vics while the St George’s Park owners and Newport FC benefactors South Coast Leisure (SCL) has been putting in place plans for both linked schemes.\nNow, having negotiated local planning requirements, the pandemic and subsequent economic challenges, South Coast Leisure has told Bob it is hopeful the schemes will begin this year.\nBob said: “I have spoken to Newport FC supporters and directors and I know how keen they are to see this project progress.\n“I also know the club has welcomed the considerable support South Coast Leisure has provided while the issues around the new ground and the retail park are overcome.\n“I’ve been told that, subject to final financial agreements, both projects could get underway this year. This is great news for Newport FC and its supporters and also the wider sporting community who will also be able to use these fantastic new facilities at The Racecourse.\n“I have told SCL I would be happy to do anything I can to help see this development start as soon as possible. I know the developers want to get cracking and I know that Newport FC need their new ground.\"\nBob sought an update from SCL after speaking to Newport FC supporters, most recently at the IW Gold Cup final.\n“As someone who loves sport, I’m delighted that the new ground will open up a lot of year-round recreational opportunities for local people,” he said.\n“I'm also pleased SCL is making progress to deliver a new sports facility and also the retail park that will create many local jobs.”",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_better-opportunities-islanders/content_4.html": "Island pay is similar to the rest of the country but below the South East. I want to get a better deal on jobs to give Islanders better life chances and better opportunities.\nWorking with the then Conservative Council and Homes England, we helped secure the Venture Quays site in East Cowes for Island shipbuilding, protecting hundreds of jobs.\nI got the Island’s £5.8 million Levelling Up project prioritised and included in the first round of bids. And working with others, we’ve helped secure a £10m grant from the Government to upgrade almost all the Island to fibre-to-premises broadband, years ahead of the rest of the UK.\nOur plan for 2024 will see work finished on the first Levelling Up bid and work starting on the second. The rural elements of fibre-to-premises broadband will be rolled out, and work will finish on Ryde Esplanade too.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_getting-better-deal-transport-and-infrastructure/content_30.html": "In 2019, we secured the biggest investment in rail on the Island in 50 years to upgrade our trains, stations, and track; repair Ryde Railway Pier; and keep trains running to Ryde Pier Head.\nI’m committed to improving transport for Islanders, including bus and ferry services.\nIn 2019, working with the Council we secured a £26 million upgrade to rolling stock, stations and track on the Island. Next, I secured a £20 million investment to repair Ryde Railway Pier.\nIn 2023, the Council and I secured £13.6 million to build a series of interlinked transport projects including walking and cycling networks across the Island.On the ferries, I want the ferry firms to acknowledge their public service obligations and provide more affordable and reliable sailings.\nFor 2024, we’re:\n1. Extending the £2 cap on single bus fares on Southern Vectis routes across the Island,\n2. We will start to get the West Wight cycle route built and\n3. We will finish work at Ryde Esplanade.",
  "http_www_bobseely_org_uk_/https_www_bobseely_org_uk_news_isle-wight-mp-keen-tackle-plastic-pollution/content_25.html": "MP Bob Seely has submitted written questions to the government to ask what steps are being taken to tackle the international problem of ocean plastic pollution. Mr Seely has previously discussed the problem of ‘nurdle’ pollution on Brook Beach with Island environmental group Planet Aware.\nNurdles are small plastic pellets which are used as a raw material in the manufacture of plastic products.\nMr Seely asked two questions, the first about the merits of classifying nurdles as a hazardous shipment and the second about the steps being taken to tackle nurdle pollution in the marine environment.\nMr Seely’s full questions are below:\nTo ask the Secretary of State for Transport, whether the Government has made representations to the International Maritime Organisation on the potential merits of classifying pre-production plastic pellets, nurdles, as a hazardous shipment.\nTo ask the Secretary of State for Environment, Food and Rural Affairs, what steps he is taking to tackle pre-production plastic pellet, nurdle, pollution in the marine environment.\nMr Seely said he hoped to build on the previous steps the government has taken to reducing plastic pollution. These include a world first ban on the sale of products containing microbeads’, restricting single-use items such as plastic straws, pledging to eliminate all avoidable plastic waste by the end of 2042, and establishing the Commonwealth Clean Ocean Alliance.\nMr Seely said: “The government has a good record when it comes to tackling plastic pollution, but there is always more to do, and it is clear that nurdles in particular are a worldwide problem so I want to see what more we can be doing to help tackle this problem.”\nMr Seely said he would keep Islanders updated via his Facebook page and regular newsletter.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_campaigns_plastic-pollution-0/content_9.html": "Thank you for contacting me about plastic pollution.\nThe Resources and Waste Strategy for England sets out the Government’s plans to reduce, reuse, and recycle more plastic and Ministers have committed to work towards all plastic packaging on the market being recyclable or reusable by 2025.\nThrough the Environment Act 2021, the Government has set a target is to halve residual waste by 2042. This refers to waste that is sent to landfill, put through incineration, or used in energy recovery in the UK or overseas. This is an intentionally broad target, which will include the most environmentally harmful materials like plastics, rather than banning a single type of material and risk producers moving to a different, more harmful material.\nSignificant progress has already been made to address plastic pollution, including a ban on microbeads and restricting the supply of plastic straws, plastic drink stirrers, and plastic-stemmed cotton buds. The use of single-use carrier bags in supermarkets has reduced by over 98 per cent.\nFurther, restrictions on a range of single-use plastics, including plastic plates, trays, bowls, cutlery, balloon sticks and certain types of polystyrene cups and food containers have now come into force. I understand that England uses 2.7 billion items of single-use cutlery and over 700 million single-use plates per year, but only 10 per cent are recycled. This new ban is the next step in cracking down on harmful plastic waste.\nThe Government recently announced that legislation will be introduced to ban wet wipes containing plastic. This builds on action already taken by the government to tackle plastic pollution and clean up our environment. It is especially important for coastal communities such as the Isle of Wight, as we do not want plastic washing up on our Island beaches. Further information is available here.\nThank you again for taking the time to contact me.",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_category_Opinions/content_17.html": "Daily Telegraph article: 'Computer says no' house building plan is another own goal 28th September 2020 This article by Bob Seely MP was in the Daily Telegraph on 28th September 2020. The Telegraph has revealed the full extent of plans to unleash a wave of... Opinions",
  "http_www_bobseely_org_uk_/http_www_bobseely_org_uk_news_category_Foreign-Affairs/content_23.html": "Comments on events linked to the MH17 investigation 25th May 2018 Bob Seely MP, Member of the Foreign Affairs Select Committee, said: “The evidence presented by the Joint Investigation Team (JIT) in their interim report on... Foreign Affairs"
}