{
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_home/content_40.html": "LATEST NEWS FROM CHRIS\nABOUT CHRIS\nI have always believed that there is much more that unites us than divides us and that, despite our sometimes polarised political discourse, I remain convinced that our country's best years are ahead of us.\nI've lived in North Worcestershire nearly all my life. I'm an active campaigner, having previously served as a councillor and a school governor.\nMy first job was delivering the Redditch Advertiser; I spent the money I earned in the Kingfisher Centre and learned to drive around our many roundabouts. I even had the opportunity to play on a few occasions at the Valley for and against the Reds.\nAs your Member of Parliament, I am here for you, regardless of how you cast your vote. My door is always open, and I am ready to assist you in any way I can. We may not always see eye to eye, but please know that you can always reach out to me for help or advice.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_9e2ff73f-fe37-4d65-b1a6-25a387b0cc4b_events/content_17.html": "MP for Redditch\nProfile\nEvents\nMore\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nSolar panel petition",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_dc27e8ec-8858-4201-a0b9-0ff67989536c_profile/content_30.html": "top of page\nProfile\nJoin date: Aug 19, 2024\nPosts (54)\nApr 22, 2025 ∙ 1 min\nAttending Parliamentary Event on the Future of Greyhound Racing\nI attended a parliamentary drop-in hosted by Blue Cross and Dogs Trust to discuss the future of Greyhound racing and ongoing welfare...\n1\n0\nApr 15, 2025 ∙ 1 min\nAttending Sakura Cherry Tree Ceremony Celebrating UK–Japan Friendship and Local Tourism\nI joined local stakeholders and representatives from the Japanese Embassy at The Valley, Evesham, for the Sakura Cherry Tree Ceremony....\n0\n0\nApr 2, 2025 ∙ 1 min\nCalling for Better Access to Sport to Tackle Youth Mental Health Crisis\nI called for urgent action to improve access to sport and PE in schools, highlighting its vital role in supporting young people’s mental...\n12\n0\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_latestnews_categories_parliament/content_9.html": "top of page\nRedditch Rowers Praised in Parliament for Atlantic Charity Challenge\nI commended four Redditch residents—Rob Oliver, Kevin Joynes, Matthew Humphries and Tom Hayward—who will row 3,000 miles across the...\nChris Bloore MP\nApr 24\nAttending Parliamentary Event on the Future of Greyhound Racing\nI attended a parliamentary drop-in hosted by Blue Cross and Dogs Trust to discuss the future of Greyhound racing and ongoing welfare...\nChris Bloore MP\nApr 23\nChampioning Life-Saving Allergy Safeguards in Schools\nI backed the introduction of 'Benedict's Law' during National Allergy Awareness Week, joining medical professionals and campaigners at a...\nChris Bloore MP\nApr 22\nCalling for Better Access to Sport to Tackle Youth Mental Health Crisis\nI called for urgent action to improve access to sport and PE in schools, highlighting its vital role in supporting young people’s mental...\nChris Bloore MP\nApr 3\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_5c630c75-b870-48b7-b09c-774052e9e559_profile/content_36.html": "top of page\nProfile\nJoin date: Aug 19, 2024\nPosts (45)\nApr 14, 2025 ∙ 1 min\nVisiting Roundhill Wood with Heart of England Forest Team\nI visited Roundhill Wood, a designated Local Wildlife Site near Stock Green, following constituent enquiries about conservation and...\n0\n0\nApr 11, 2025 ∙ 1 min\nCelebrating Mayor Juma Begum’s Civic Dinner Success\nI congratulated the Mayor of Redditch, Cllr Juma Begum, on hosting a successful Mayoral Civic Dinner at the Abbey Hotel. The evening...\n0\n0\nApr 2, 2025 ∙ 1 min\nCalling for Historic Protection of Wychbold Masts\nI called for the Wychbold Masts to be granted protected status. During Business of the House, I highlighted their significant role during...\n16\n0\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_privacy-policy/content_20.html": "PRIVACY POLICY\nI am the Member of Parliament (MP) for the Redditch and the Villages Constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour and MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy data protection officer can be contacted at chris.bloore.mp@parliament.uk.\nData collection and use\nThe office of Chris Bloore MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do this where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for Redditch and the Villages, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Redditch and the Villages or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites\nThis website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n-\nObtain copies of the personal information I hold about you (known as a “subject access request”)\n-\nRequest that I correct or update any personal information held about you\n-\nAsk that we erase or restrict the way in which I use your information\n-\nRequest that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications form me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within 10 working days.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nAlternatively you have the right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_redditch-rowers-praised-in-parliament-for-atlantic-charity-challenge/content_22.html": "Redditch Rowers Praised in Parliament for Atlantic Charity Challenge\n- Chris Bloore MP\n- Apr 24\n- 1 min read\nI commended four Redditch residents—Rob Oliver, Kevin Joynes, Matthew Humphries and Tom Hayward—who will row 3,000 miles across the Atlantic Ocean this December as part of “The World’s Toughest Row.” The team’s incredible journey from the Canary Islands to Antigua will raise funds for three vital charities: the Frank Bruno Foundation, Arrive Alive, and Redditch Self Defence and Youth Engagement, which educates young people on knife crime prevention. Speaking in the House of Commons, The Leader of the House also joined in praising their efforts.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_launching-campaign-for-solar-panels-on-new-builds/content_44.html": "Launching Campaign for Solar Panels on New Builds\n- Chris Bloore MP\n- Jan 28\n- 1 min read\nI am calling on the government to make solar panels a standard feature on all new properties. Too many new builds are missing the opportunity to cut energy bills, protect green spaces, and support the UK’s Net Zero ambitions.\nA roofs-first approach to solar power would reduce the need for renewable developments in rural areas, helping to preserve natural landscapes while ensuring homes are built with sustainability in mind.\nJoin the campaign for a greener future—sign the petition today.\n🔗 Sign here: chrisbloore.co.uk/solar-panels",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_latestnews_hashtags_BeTheChange/content_47.html": "top of page\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nRedditch Directory\nSolar panel petition\nMore\nUse tab to navigate through the menu items.\nHave your say\nAll Posts\nParliament\nIn Redditch and the Villages\nPolicy\nLocal Issues\nFairtrade Pledge\nI've pledged to #BeTheChange with the Fairtrade Foundation because I know fairer trade matters to my community, and millions more around...\nPolicy\nChris Bloore MP\nSep 17, 2024\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nRedditch Directory\nSolar panel petition\nMore\nUse tab to navigate through the menu items.\nSAVE THE POST OFFICE\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_latestnews/content_4.html": "top of page\nRedditch Rowers Praised in Parliament for Atlantic Charity Challenge\nI commended four Redditch residents—Rob Oliver, Kevin Joynes, Matthew Humphries and Tom Hayward—who will row 3,000 miles across the...\nChris Bloore MP\nApr 24\nAttending Parliamentary Event on the Future of Greyhound Racing\nI attended a parliamentary drop-in hosted by Blue Cross and Dogs Trust to discuss the future of Greyhound racing and ongoing welfare...\nChris Bloore MP\nApr 23\nChampioning Life-Saving Allergy Safeguards in Schools\nI backed the introduction of 'Benedict's Law' during National Allergy Awareness Week, joining medical professionals and campaigners at a...\nChris Bloore MP\nApr 22\nAttending Sakura Cherry Tree Ceremony Celebrating UK–Japan Friendship and Local Tourism\nI joined local stakeholders and representatives from the Japanese Embassy at The Valley, Evesham, for the Sakura Cherry Tree Ceremony....\nChris Bloore MP\nApr 16\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk/content_1.html": "LATEST NEWS FROM CHRIS\nABOUT CHRIS\nI have always believed that there is much more that unites us than divides us and that, despite our sometimes polarised political discourse, I remain convinced that our country's best years are ahead of us.\nI've lived in North Worcestershire nearly all my life. I'm an active campaigner, having previously served as a councillor and a school governor.\nMy first job was delivering the Redditch Advertiser; I spent the money I earned in the Kingfisher Centre and learned to drive around our many roundabouts. I even had the opportunity to play on a few occasions at the Valley for and against the Reds.\nAs your Member of Parliament, I am here for you, regardless of how you cast your vote. My door is always open, and I am ready to assist you in any way I can. We may not always see eye to eye, but please know that you can always reach out to me for help or advice.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_latestnews_categories_policy/content_28.html": "top of page\nLaunching Campaign for Solar Panels on New Builds\nI am calling on the government to make solar panels a standard feature on all new properties. Too many new builds are missing the...\nChris Bloore MP\nJan 28\nNATIONAL RURAL CRIME ACTION WEEK\nDuring National Rural Crime Action Week, I'm committed to supporting efforts to tackle rural crime issues and ensure rural areas like...\nChris Bloore MP\nOct 21, 2024\nFairtrade Pledge\nI've pledged to #BeTheChange with the Fairtrade Foundation because I know fairer trade matters to my community, and millions more around...\nChris Bloore MP\nSep 17, 2024\nWinter Fuel Allowance and Pension Support Changes\nI want to thank every constituent who has written, called, or posted on social media about the changes to the Winter Fuel Allowance (WFA)...\nChris Bloore MP\nSep 12, 2024\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_advicesurgeries/content_11.html": "top of page\nNo events at the moment\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nRedditch Directory\nSolar panel petition\nMore\nUse tab to navigate through the menu items.\nSAVE THE POST OFFICE\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_visiting-roundhill-wood-with-heart-of-england-forest-team/content_37.html": "Visiting Roundhill Wood with Heart of England Forest Team\n- Chris Bloore MP\n- Apr 15\n- 1 min read\nI visited Roundhill Wood, a designated Local Wildlife Site near Stock Green, following constituent enquiries about conservation and access. Guided by Heart of England Forest CEO Andy Parsons and Principal Biodiversity Officer Tasha Cain, the visit included a tour of the ancient woodland to view recent conservation work—most notably the installation of deer fencing to protect native hazel coppice and encourage wildlife to flourish. I thanked the team for their warm welcome and praised their efforts to protect biodiversity while promoting responsible public access to the countryside.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_raise-a-local-issue/content_5.html": "Home\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nSolar panel petition\nMore\nBy ticking this box I consent to the office of Chris Bloore MP contacting me via the details above.\nhttps://www.chrisbloore.co.uk/privacy-policy\nYes, subscribe me to Chris Bloore MP's newsletter.\nRedditch also has a range of services available to meet residents' needs.\nYou can explore them in the Redditch Directory:",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_c521d985-d9f5-460f-9f9b-675dc5b71abe_profile/content_8.html": "top of page\nProfile\nJoin date: Aug 19, 2024\nPosts (31)\nApr 23, 2025 ∙ 1 min\nRedditch Rowers Praised in Parliament for Atlantic Charity Challenge\nI commended four Redditch residents—Rob Oliver, Kevin Joynes, Matthew Humphries and Tom Hayward—who will row 3,000 miles across the...\n15\n0\nApr 9, 2025 ∙ 1 min\nMeeting Local Sector Leaders to Discuss Devolution and Community Funding\nI recently joined representatives from Bromsgrove and Redditch Network (BARN), Age UK, Citizens Advice and Young Solutions Worcestershire...\n0\n0\nApr 5, 2025 ∙ 1 min\nJoining Community Interfaith Walk Celebrating Unity and Diversity in Redditch\nI participated in a vibrant community interfaith walk in Redditch, organised by Redditch Together. The walk, open to all faiths and none,...\n11\n0\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_about/content_3.html": "ABOUT CHRIS\nI have always believed that there is much more that unites us than divides us and that, despite our sometimes polarised political discourse, I remain convinced that our country's best years are ahead of us.\nI've lived in North Worcestershire nearly all my life. I'm an active campaigner, having previously served as a councillor and a school governor.\nMy first job was delivering the Redditch Advertiser; I spent the money I earned in the Kingfisher Centre and learned to drive around our many roundabouts. I even had the opportunity to play on a few occasions at the Valley for and against the Reds.\nBefore I became your MP, I was the Chief Executive of an international Trade Association, helping to safeguard jobs and industry during the COVID-19 pandemic, working alongside Ministers from all political parties.\nI was fortunate to get a great start in life, and as a parent, I want every child to have the same opportunities\nWhether it's rebuilding our public services, including our beloved NHS, making it easier to start a business, growing the economy, making our streets safe, or making life affordable again, I know it won't be easy, and tough decisions must be made.\nAs your Member of Parliament, I am here for you, regardless of how you cast your vote. My door is always open, and I am ready to assist you in any way I can. We may not always see eye to eye, but please know that you can always reach out to me for help or advice.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_fairtrade-pledge/content_39.html": "Fairtrade Pledge\n- Chris Bloore MP\n- Sep 17, 2024\n- 1 min read\nI've pledged to #BeTheChange with the Fairtrade Foundation because I know fairer trade matters to my community, and millions more around the world. Find out how fairer pay and prices can drive change for farmers at fairtrade.org.uk/bethechange #ChooseFairtrade",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_latestnews_categories_in-redditch-and-the-villages/content_35.html": "top of page\nAttending Sakura Cherry Tree Ceremony Celebrating UK–Japan Friendship and Local Tourism\nI joined local stakeholders and representatives from the Japanese Embassy at The Valley, Evesham, for the Sakura Cherry Tree Ceremony....\nChris Bloore MP\nApr 16\nVisiting Trimite Global Coatings to Back Local Innovation and Exports\nI recently visited Trimite Global Coatings in Redditch to hear about the company’s ambitious growth plans and global export success....\nChris Bloore MP\nApr 15\nVisiting Roundhill Wood with Heart of England Forest Team\nI visited Roundhill Wood, a designated Local Wildlife Site near Stock Green, following constituent enquiries about conservation and...\nChris Bloore MP\nApr 15\nVisiting Richmond Wood Norton and Backing Innovative Housing-with-Care Model\nI recently visited Richmond Wood Norton to meet residents and staff at one of our constituency’s leading Integrated Retirement...\nChris Bloore MP\nApr 15\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_delivering-new-school-based-nursery-for-redditch-families/content_49.html": "Delivering New School-Based Nursery for Redditch Families\n- Chris Bloore MP\n- Apr 2\n- 1 min read\nI welcomed the announcement that Matchborough First School Academy will receive funding for a new school-based nursery, as part of the Government’s commitment to expanding childcare access. This is one of 300 schools nationally set to benefit, creating 6,000 new childcare places.\nFrom September, working parents will be eligible for 30 hours of government-funded childcare, saving families up to £7,500 a year. This is fantastic news for Redditch families. The Government is delivering on its promise to give every child the best start in life while supporting parents with high-quality, affordable childcare.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_marking-one-year-of-drop-the-knife-at-the-old-needleworks/content_24.html": "Marking One Year of ‘Drop the Knife’ at the Old Needleworks\n- Chris Bloore MP\n- Apr 13\n- 1 min read\nI joined residents and campaigners at The Old Needleworks to celebrate the first anniversary of Drop the Knife on the premises—a Redditch-based initiative tackling knife crime through education, mentoring and self-defence. Founded by Pete Martin, the grassroots project has worked with thousands of young people to promote safety and resilience. The event featured martial arts demonstrations, bleed kit training and community activities. I also announced a £10,000 funding boost from the Morrisons Foundation to support expanded outreach. I praised the initiative’s impact and reaffirmed my commitment to building a safer Redditch through local action.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_c521d985-d9f5-460f-9f9b-675dc5b71abe_events/content_14.html": "MP for Redditch\nProfile\nEvents\nMore\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nSolar panel petition",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_5c630c75-b870-48b7-b09c-774052e9e559_events/content_41.html": "MP for Redditch\nProfile\nEvents\nMore\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nSolar panel petition",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_dc27e8ec-8858-4201-a0b9-0ff67989536c_events/content_33.html": "MP for Redditch\nProfile\nEvents\nMore\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nSolar panel petition",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_joining-community-interfaith-walk-celebrating-unity-and-diversity-in-redditch/content_10.html": "Joining Community Interfaith Walk Celebrating Unity and Diversity in Redditch\n- Chris Bloore MP\n- Apr 6\n- 1 min read\nI participated in a vibrant community interfaith walk in Redditch, organised by Redditch Together. The walk, open to all faiths and none, aimed to celebrate unity, diversity and community engagement. Starting at St Stephen’s Church, participants journeyed to the Forge Mill Needle Museum & Bordesley Abbey Visitor Centre, where they enjoyed refreshments and samosas. The event, which has become a tradition in Redditch, provided a platform for greater understanding and dialogue between local faith groups. I praised the organisers for fostering inclusivity and building stronger community ties through these important initiatives.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_meeting-with-local-police/content_34.html": "MEETING WITH LOCAL POLICE\n- Chris Bloore MP\n- Oct 19, 2024\n- 1 min read\nI met with Safer Neighbourhood Chief Inspector for North Worcestershire, David King, and Inspector Rich Field from the Safer Neighbourhood Team. We discussed current trends, challenges over car theft, shoplifting, and rural crime. These sessions are important for me to receive updates on police operations and feedback resident concerns directly to the police.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_bbc-coverage-on-send-provision/content_25.html": "BBC Coverage on SEND Provision\n- Chris Bloore MP\n- Sep 30, 2024\n- 1 min read\nThank you to James Pearson at the BBC for covering the ongoing concerns about SEND provision in Worcestershire. It’s crucial the public understands the scale of the problem, and I will keep fighting alongside parents to ensure young people get the support they need.\nI was also grateful to speak with Tammy Gooding at BBC Hereford & Worcester about the future of SEND provision across the county.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_91d6cbe6-8a4b-4ab0-90d1-3fd2b6fbca0b_events/content_46.html": "MP for Redditch\nProfile\nEvents\nMore\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nSolar panel petition",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_latestnews_hashtags_ChooseFairtrade/content_48.html": "top of page\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nRedditch Directory\nSolar panel petition\nMore\nUse tab to navigate through the menu items.\nHave your say\nAll Posts\nParliament\nIn Redditch and the Villages\nPolicy\nLocal Issues\nFairtrade Pledge\nI've pledged to #BeTheChange with the Fairtrade Foundation because I know fairer trade matters to my community, and millions more around...\nPolicy\nChris Bloore MP\nSep 17, 2024\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nRedditch Directory\nSolar panel petition\nMore\nUse tab to navigate through the menu items.\nSAVE THE POST OFFICE\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_saveredditchpostoffice/content_2.html": "top of page\nI am deeply concerned about the proposed closure of the Redditch Post Office—a vital service and lifeline for our community, especially our most vulnerable residents. This isn’t just another high street closure; it would mean losing essential, face-to-face support that people rely on for banking, bill payments, and more.\nNearly two in five vulnerable customers use these services monthly, and without them, many risk social isolation and financial hardship. I have requested an urgent meeting with the Post Office to explore all options to keep these services in Redditch.\nI urge everyone to join the campaign I'm running in partnership with The Redditch Standard, and sign the petition to save our Post Office.\nSHARE THIS WITH FRIENDS, FAMILY & NEIGHBOURS AND HELP SUPPORT OUR CAMPAIGN TO SAVE THE POST OFFICE 👇\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_latestnews_categories_local-issues/content_7.html": "top of page\nMEETING WITH LOCAL POLICE\nI met with Safer Neighbourhood Chief Inspector for North Worcestershire, David King, and Inspector Rich Field from the Safer...\nChris Bloore MP\nOct 19, 2024\nBBC PHONE-IN\nDiscussed SEND, Alex Hospital, and local issues on Elliott Webb's show.\nChris Bloore MP\nOct 12, 2024\nINKBERROW PRIMARY SCHOOL MINIBUS FUNDRAISER\nI'm visiting Inkberrow Primary School soon and want to help them raise funds for a school minibus. The Friends of Inkberrow Primary...\nChris Bloore MP\nOct 7, 2024\nBBC Coverage on SEND Provision\nThank you to James Pearson at the BBC for covering the ongoing concerns about SEND provision in Worcestershire. It’s crucial the public...\nChris Bloore MP\nSep 30, 2024\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_visiting-richmond-wood-norton-and-backs-innovative-housing-with-care-model/content_27.html": "Visiting Richmond Wood Norton and Backing Innovative Housing-with-Care Model\n- Chris Bloore MP\n- Apr 15\n- 1 min read\nUpdated: Apr 24\nI recently visited Richmond Wood Norton to meet residents and staff at one of our constituency’s leading Integrated Retirement Communities (IRCs). IRCs offer a unique model of housing-with-care—combining independent living, 24/7 on-site support and communal facilities to help older people stay healthy, active and connected. Following the visit, I committed to becoming a Parliamentary Champion for IRCs and will attend the group’s first meeting in Portcullis House. I praised the vital role IRCs play in supporting ageing well and easing NHS pressures and will return soon to host a constituency surgery.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_attending-parliamentary-event-on-the-future-of-greyhound-racing/content_12.html": "Attending Parliamentary Event on the Future of Greyhound Racing\n- Chris Bloore MP\n- Apr 23\n- 1 min read\nI attended a parliamentary drop-in hosted by Blue Cross and Dogs Trust to discuss the future of Greyhound racing and ongoing welfare concerns. Animal welfare organisations, supported by the Cut the Chase coalition, are calling for a phased end to racing across the UK following high injury and fatality rates—over 2,700 Greyhound deaths and 26,000 injuries were recorded between 2018 and 2023. I heard powerful case studies from rehoming centres and pledged to continue working with campaigners to ensure a safe and sustainable future for Greyhounds beyond the racetrack.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_acceptable-behaviour/content_23.html": "ACCEPTABLE BEHAVIOUR POLICY\nIntroduction\nChris Bloore MP understands that people may act out of character in times of trouble or distress. There may have been upsetting or distressing circumstances leading up to a constituent approaching our office.\nHowever, Chris Bloore will not tolerate behaviour nor actions that result in unacceptable or excessive demands on his staff.\nThis may include actions or comments directed at a third party.\nWe’ll give you a chance to change your behaviour before we stop helping you – unless your behaviour threatens the safety of our staff or other people.\nDefinition of Unacceptable Behaviour\nAggressive or abusive behaviour\nThis is behaviour or language (written or spoken) that could cause Chris Bloore’s staff to feel afraid, threatened or abused. This includes threatening emails, telephone calls, meetings, and comments on social media or elsewhere.\nFor example:\n-\ninsulting or degrading or patronising language, including inappropriate banter or innuendo;\n-\nmakes serious malicious allegations that individuals have committed criminal, corrupt or perverse conduct without evidence;\n-\nany form of physical violence or threats of physical violence\n-\nderogatory racist, sexist, ageist, homophobic or transphobic remarks;\n-\ncomments relating to disability, perceived gender, religion, belief, or any other personal characteristic.\nViolence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language (whether verbal or written) that may cause staff to feel offended, afraid, threatened or abused.\nUnreasonable demands and vexatious complaints\nUnacceptable demands may include:\n-\nRepeatedly demanding a response within an unreasonable timescale;\n-\nInsisting on, or refusing to, speak to a particular member of staff, when that is not possible;\n-\nDemanding repeated surgery appointments;\n-\nMaking repeated and unnecessary contact during the course of us handling a case, waiting for a reply from a third party or carrying out an investigation;\n-\nKeep raising the same issue when we’ve already helped you or we have told you we can’t help further;\n-\nRefusing to accept a decision when it related to issues where Chris has no direct authority or would be inappropriate for him to be involved (e.g. court decisions).\nUnacceptable or persistent levels of contact may include:\n-\nRepeated telephone calls over a short period, for example, a high number calls in one day or week;\n-\nLengthy telephone calls repeating the same points;\n-\nHigh volumes repetitive correspondence by email or post;\n-\nunnecessarily or excessive copying Chris into emails to third parties.\nIt is not acceptable to knowingly provide Chris with incorrect or false information, and doing so prevents his office from successfully dealing with your case.\nHarassment\nExamples include:\n-\nrecording telephone discussions and publishing the information online or via social media;\n-\ncontacting staff using their personal details or social media presence including Facebook, Twitter or LinkedIn;\n-\npublishing personal, sensitive or private information about staff online or on noticeboards or newsletters.\nHow will we respond to unacceptable behaviour\nWe do not expect our staff to tolerate unacceptable behaviour when communicating with constituents.\nWhen this happens on the telephone, letter or email, we have the right to:\n-\nplace callers on hold;\n-\nend the call;\n-\nnot reply to an abusive letter or email.\nIn person, for example at a surgery or our office, we have the right to ask you to leave.\nBefore taking such action, we will always warn constituents that they are behaving in an unacceptable way to give them the chance to change their behaviour. However, a warning will not be given in extreme cases to protect our staff, for example, when a serious threat is made.\nWhere these circumstances arise, we will take the following steps:\n-\nwe’ll ask constituents to modify their behaviour and explain why;\n-\nif the behaviour continues to be unacceptable, our employees will remove themselves from the situation. If the communication is by telephone, the caller will be told that the call will be ended;\n-\na record of the incident. In all cases, Chris or his representative will investigate the situation and decide what action to take. This could include limiting a constituent’s contact with us;\n-\nwe’ll refer the matter to the police where a criminal offence has been threatened or committed.\nLimiting contact may include:\n-\nAppointing a specific point of contact for the constituent;\n-\nCommunicating only in writing or via a representative;\n-\nNo longer making surgery appointments for a constituent;\n-\nDeciding not to proceed in a case when behaviour has been unacceptable;\n-\nEnding all contact with a constituent.\nWhere a decision to limit contact has been made, then Chris will inform the constituent in writing.\nHow we will take account of our duties under the Equality Act\nChris makes sure that his office meets the requirements of the Equality Act 2010. This includes making sure we consider adjustments for people with protected characteristics.\nWe understand that some people may have difficulty expressing themselves or communicating clearly and/or appropriately. We will always consider the needs and circumstances that we have been made are aware of, before deciding how best to manage the situation. This will include making reasonable adjustments.\nExamples of reasonable adjustments might include:\n-\nUsing a different method of communication;\n-\nproviding written communication in large print, coloured text, or translated to another language;\n-\ngiving clear warnings if conversations become unproductive and allowing constituents to opportunity to modify their behaviour before ending a call.\nHowever, this does not mean we will tolerate abusive language, violence, shouting, or other unacceptable behaviour or actions.\nIf an individual with a protected characteristic becomes the subject of a restriction under this policy, we will consider whether the restriction may affect them more than someone without that characteristic. If this is the case, we may make different arrangements so they can still receive support from Chris Bloore MP.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_meeting-local-sector-leaders-to-discuss-devolution-and-community-funding/content_31.html": "Meeting Local Sector Leaders to Discuss Devolution and Community Funding\n- Chris Bloore MP\n- Apr 10\n- 1 min read\nI recently joined representatives from Bromsgrove and Redditch Network (BARN), Age UK, Citizens Advice and Young Solutions Worcestershire to discuss the impact of devolution proposals on North Worcestershire’s voluntary and community sector. The meeting explored concerns around funding, local representation and how future arrangements can best reflect community needs. I reaffirmed my commitment to working closely with local organisations to ensure services remain accessible, responsive and sustainably funded. I pledged to continue championing the sector’s voice as devolution plans develop across the region.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_solar-panels/content_21.html": "top of page\nSign our solar panels petition\nSolar power has a massive part to play in our Net Zero ambitions, and a roofs-first approach should be prioritised whenever possible.\nAlthough it may not completely eliminate the need for renewable energy sources to be placed in rural areas, it can help preserve some of our natural landscape and avoid disrupting our precious natural ecosystems.\nToo many new builds come without them; I am calling on the government to ensure solar panel coverage on all new properties. Will you join me?\nSHARE THIS WITH FRIENDS, FAMILY & NEIGHBOURS AND HELP SUPPORT OUR CAMPAIGN TO ENSURE SOLAR COMES AS STANDARD 👇\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_9e2ff73f-fe37-4d65-b1a6-25a387b0cc4b_profile/content_16.html": "top of page\nProfile\nJoin date: Aug 19, 2024\nPosts (33)\nApr 21, 2025 ∙ 1 min\nChampioning Life-Saving Allergy Safeguards in Schools\nI backed the introduction of 'Benedict's Law' during National Allergy Awareness Week, joining medical professionals and campaigners at a...\n1\n0\nApr 14, 2025 ∙ 1 min\nVisiting Trimite Global Coatings to Back Local Innovation and Exports\nI recently visited Trimite Global Coatings in Redditch to hear about the company’s ambitious growth plans and global export success....\n1\n0\nApr 12, 2025 ∙ 1 min\nMarking One Year of ‘Drop the Knife’ at the Old Needleworks\nI joined residents and campaigners at The Old Needleworks to celebrate the first anniversary of Drop the Knife on the premises—a...\n0\n0\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_attending-sakura-cherry-tree-ceremony-celebrating-uk-japan-friendship-and-local-tourism/content_18.html": "Attending Sakura Cherry Tree Ceremony Celebrating UK–Japan Friendship and Local Tourism\n- Chris Bloore MP\n- Apr 16\n- 1 min read\nI joined local stakeholders and representatives from the Japanese Embassy at The Valley, Evesham, for the Sakura Cherry Tree Ceremony. Part of a national initiative to plant 10,000 native cherry trees across the UK, the event celebrated blossom season and highlighted opportunities to promote Worcestershire to UK-based Japanese nationals. The afternoon included visits to Orchard Blossom and The Wood Norton, with special guest Keisaku Sandy Sano transported by a Morgan Motor Company Plus Four. I praised the initiative for strengthening UK–Japan ties and supporting local tourism.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_calling-for-historic-protection-of-wychbold-masts/content_45.html": "Calling for Historic Protection of Wychbold Masts\n- Chris Bloore MP\n- Apr 3\n- 1 min read\nI called for the Wychbold Masts to be granted protected status. During Business of the House, I highlighted their significant role during World War II, where they were crucial in jamming enemy transmissions and aiding communication with the French Resistance. The longwave transmitters, which celebrated their 90th anniversary last year, played a key part in D-Day operations. I urged Historic England to list the masts, ensuring their historical importance is preserved for future generations. The Leader of the House, Lucy Powell, in response, praised the Masts for their pivotal role in safeguarding Britain during the war.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_calling-for-better-access-to-sport-to-tackle-youth-mental-health-crisis/content_15.html": "Calling for Better Access to Sport to Tackle Youth Mental Health Crisis\n- Chris Bloore MP\n- Apr 3\n- 1 min read\nI called for urgent action to improve access to sport and PE in schools, highlighting its vital role in supporting young people’s mental health. Speaking in a Commons debate, I noted that one in five children are experiencing a mental health crisis and stressed that physical activity can help manage stress, anxiety and depression.\nA strong PE curriculum and access to outdoor sport are more important than ever. I pledged to keep campaigning for inclusive, well-funded sports provision in schools across Redditch and the Villages.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_joining-launch-of-new-autism-parents-support-group-sessions-at-redditch-united-fc/content_43.html": "Joining Launch of New Autism Parents Support Group Sessions at Redditch United FC\n- Chris Bloore MP\n- Apr 4\n- 1 min read\nI recently joined the North Worcestershire Autism Parents Support Group at their first face-to-face session at Redditch United Football Club. The voluntary group offers expert advice and vital peer support to parents of autistic children, with free monthly meetings now taking place at the club.\nI thank the organiser, Tracy Winchester, and praise the group’s commitment to supporting local families. I also welcomed Redditch United’s generous offer of a free meeting space and their enthusiasm for future collaboration. I will continue to support the group’s work and champion improved SEND provision locally.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_championing-life-saving-allergy-safeguards-in-schools/content_29.html": "Championing Life-Saving Allergy Safeguards in Schools\n- Chris Bloore MP\n- Apr 22\n- 1 min read\nI backed the introduction of 'Benedict's Law' during National Allergy Awareness Week, joining medical professionals and campaigners at a special House of Commons workshop hosted by the Benedict Blythe Foundation.\nThe proposed legislation would require all schools to implement mandatory allergy management policies, keep adrenaline auto-injectors on-site and provide compulsory staff training on recognising and responding to anaphylaxis.\nNo parent should ever face the heartbreak that Helen and her family have endured. With 20% of anaphylaxis reactions happening at school, I urge all schools in Redditch and the Villages to review their allergy policies and ensure staff are equipped to act in emergencies.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_redditch-directory/content_6.html": "Redditch has a range of services available to meet residents' needs. If you have explored them below but feel you need additional support with a problem, please get in touch:\nHome\nAdvice Surgeries\nLatest News\nAbout Chris\nRaise a local issue\nSolar panel petition\nMore",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_national-rural-crime-action-week/content_42.html": "NATIONAL RURAL CRIME ACTION WEEKChris Bloore MPOct 21, 20241 min readDuring National Rural Crime Action Week, I'm committed to supporting efforts to tackle rural crime issues and ensure rural areas like ours are safe and protected.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_bbc-phone-in/content_13.html": "BBC PHONE-INChris Bloore MPOct 12, 20241 min readDiscussed SEND, Alex Hospital, and local issues on Elliott Webb's show.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_visiting-trimite-global-coatings-to-back-local-innovation-and-exports/content_19.html": "Visiting Trimite Global Coatings to Back Local Innovation and Exports\n- Chris Bloore MP\n- Apr 15\n- 1 min read\nI recently visited Trimite Global Coatings in Redditch to hear about the company’s ambitious growth plans and global export success. Meeting with CEO Nigel Smith and representatives from the British Coatings Federation, I learned how Trimite’s high-quality coatings—produced in a compact local facility—are used across industries, from Challenger tanks to medical devices. The visit also highlighted the regulatory challenges facing manufacturers. I pledged to support efforts to reduce these burdens and promote innovation. I look forward to staying in touch with the team, particularly as Trimite expands further into the defence sector.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_celebrating-mayor-juma-begum-s-civic-dinner-success/content_50.html": "Celebrating Mayor Juma Begum’s Civic Dinner Success\n- Chris Bloore MP\n- Apr 12\n- 1 min read\nI congratulated the Mayor of Redditch, Cllr Juma Begum, on hosting a successful Mayoral Civic Dinner at the Abbey Hotel. The evening brought together residents, community leaders and supporters to mark the end of Cllr Begum’s mayoral year and raised over £1,400 for Primrose Hospice and Disability Support Project. I praised the Mayor’s service and the generosity of all who contributed. The dinner marked one of Cllr Begum’s final events before Cllr Joanna Kane takes over as Mayor. I wish her every success in the year ahead.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_profile_91d6cbe6-8a4b-4ab0-90d1-3fd2b6fbca0b_profile/content_26.html": "top of page\nProfile\nJoin date: Aug 19, 2024\nPosts (30)\nApr 14, 2025 ∙ 1 min\nVisiting Richmond Wood Norton and Backing Innovative Housing-with-Care Model\nI recently visited Richmond Wood Norton to meet residents and staff at one of our constituency’s leading Integrated Retirement...\n0\n0\nApr 3, 2025 ∙ 1 min\nJoining Launch of New Autism Parents Support Group Sessions at Redditch United FC\nI recently joined the North Worcestershire Autism Parents Support Group at their first face-to-face session at Redditch United Football...\n6\n0\nApr 1, 2025 ∙ 1 min\nDelivering New School-Based Nursery for Redditch Families\nI welcomed the announcement that Matchborough First School Academy will receive funding for a new school-based nursery, as part of the...\n20\n0\nbottom of page",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_inkberrow-primary-school-minibus-fundraiser/content_32.html": "INKBERROW PRIMARY SCHOOL MINIBUS FUNDRAISER\n- Chris Bloore MP\n- Oct 7, 2024\n- 1 min read\nI'm visiting Inkberrow Primary School soon and want to help them raise funds for a school minibus. The Friends of Inkberrow Primary School have already raised £9,000 of the needed £30,000. The minibus is required to help students get to activities well out of walking range.",
  "https_www_chrisbloore_co_uk_/https_www_chrisbloore_co_uk_post_winter-fuel-allowance-and-pension-support-changes/content_38.html": "Winter Fuel Allowance and Pension Support Changes\n- Chris Bloore MP\n- Sep 12, 2024\n- 1 min read\nI want to thank every constituent who has written, called, or posted on social media about the changes to the Winter Fuel Allowance (WFA) payments announced by the Chancellor in July and yesterday's subsequent Conservative Party motion.\nThroughout the summer, I met with AGE UK, among others, to discuss the changes, and my team has provided help and support to residents to ensure they're getting all the support they're eligible for. That process continued throughout the summer at my surgeries and will continue throughout the upcoming recess."
}