{
  "https_scunthorpe-reformuk_com_/https_scunthorpe-reformuk_com_privacy-policy/content_2.html": "Copyright © 2024 Scunthorpe-reformuk - All Rights Reserved.\nPolitical webpage promoted by Darren Haley of low Hill farm, Scunthorpe dn17 3ps on behalf of:\n83 Victoria Street, London SW1H 0HW, United Kingdom 0800 414 8525\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_scunthorpe-reformuk_com_/https_scunthorpe-reformuk_com/content_1.html": "DaysDays\nHrsHours\nMinsMinutes\nSecsSeconds\nIn many areas, just the application of basic common sense would be a good start! The nation faces many challenges, but we can overcome them. To succeed, we need to do Brexit properly. We must grow our way out of the crisis, we cannot tax our way out of it. We must stand up for our core democratic values, our civil liberties, our right to free speech.\nLet’s celebrate our pride in being British: our amazing culture, our unbreakable communities, our incredible heritage. Let’s stop all the woke nonsense that is holding us back. Let’s have a proper immigration policy that works for our country and protects our borders. Together, let’s make great things happen!\nIf you would like to help or\nif anyone wants a Vote ReformUk Poster for their window\nPlease get in contact: darren@scunthorpe-reformuk.com\nOur Contract is not just another party manifesto. It sets out the reforms that Britain needs in the first 100 days following a general election and thereafter. It has been produced with advice from a range of independent economists, think tanks and advisors on savings and costings.\nCostings can be found at the end of each policy page. Some policy areas come with net costs and others with net savings. There is also extra growth assumptions from our economic forums. Final annualised budget calculations across a 5 year term of government can be found at the end of this Contract.\nWe are impatient for change. We are doers and achievers. Our Contract with you would be delivered by people with a real track record of success.\n5/ Immigration\n6/ NHS\n8/ Policing\n9/ Justice\n10/ Education\n11/ Benefits\n12/ Brexit\n13/ Defence\n14/ Veterans\n15/ Housing\n17/ Transport & Infrastructure\n18/ Agriculture\n19/ Fisheries\nDownload Our Contract With You PDF\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers.\nPlease email comments to: info@reformparty.uk\nLow Hill Farm, West Common, North Road, Scunthorpe, DN17 3PS\nSign up to receive updates from the candidate on the trail!\nCopyright © 2024 Scunthorpe-reformuk - All Rights Reserved.\nPolitical webpage promoted by Darren Haley of low Hill farm, Scunthorpe dn17 3ps on behalf of:\n83 Victoria Street, London SW1H 0HW, United Kingdom 0800 414 8525"
}