{
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_05_mass-in-blue-by-youth-choral-worcestershire/content_23.html": "Last weekend we were invited to a performance of Mass in Blue by Youth Choral Worcestershire in the cathedral. This is a project set up in 2010 to provide educational singing projects to young people in the county, particularly those who have limited opportunity to access this sort of experience. It is open to any secondary school in Worcestershire and provides the opportunity to learn a major choral work with world class professionals and sing it in a major concert venue and is the brainchild of Anne Renshaw who has a vision of the highest quality of music in the city being open for all.\nWell, the energy, enthusiasm and top-notch performance this week is testament to the success of this project. Christopher Whitehead and RGS from the city were joined by other county schools, cathedral youth choir and international students from the USA together with an internationally acclaimed conductor, jazz band and soloists to give us such an unforgettable performance.\nThe sad thing is that this is exactly the sort of thing that is being cut with a narrowing of the national curriculum and underfunding of the arts. Anne was twice turned down for financial help from the Arts Council for the project and it was only because of generous funding from The Bransford Trust, Worcester City Council and Worcestershire Community Foundation that this could go ahead. Music provides a great way to learn teamwork and broaden horizons. I know that opportunities like this can literally change a young person’s life. It is a travesty that without opportunities like this, music is often now limited to an affluent few.\nWell done to everyone involved and thank you Anne for everything you do.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_03_bulgarian-dancing/content_15.html": "Last week was a varied but quieter week for Mayoral engagements. The Mayoress and I had the pleasure of being invited to a Bulgarian dancing community group.\nWe received a warm welcome of traditional bread that guests dip in a pot of honey, washed down with a glass of Bulgarian red wine. It was evidently a very popular event with people travelling some distance – from elsewhere in the county and beyond. Many of the younger generation were born in the UK and the mums, dads and grandparents understandably want to keep their culture and language alive.\nOf course, we were dragged up onto the dance floor and what looked easy when sitting down was actually quite complicated and turned out to be very good exercise. I’ve never been to Bulgaria but my brief encounter seeing their dancing, their warm reception and trying their food certainly made me think about one day visiting their country.\nLast Tuesday I received a group of twenty or so teenage students who had travelled from the Palestinian West Bank to learn more about our culture. I chatted to one of the organisers to learn more about why they were visiting the UK. They are here to learn about our culture but also, they are here as ambassadors for their country so we may know them and understand them better too. Teenagers are teenagers the world over – who doesn’t enjoy a selfie holding the ceremonial sword in the Mayor’s Parlour?\nThe week ended with an invitation to watch the musical show ‘Little Shop of Horrors’ put on by Christopher Whitehead Language School. It showed for four nights and was a sell-out each night. It was a stunning performance and pupils, staff and supporting parents should feel extremely proud – well done! It was all the more impressive given the current funding pressures our schools face in providing drama and music.\nAfter the show I was introduced to Jack Tompkins, the production’s technical manager, a past pupil of the school who set up a very successful shop fitout company, who has been extremely generous with both time and money with his support of the school theatre.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_02_worcesters-malayali-community/content_22.html": "As Mayor you get to learn about the many and varied parts of Worcester’s varied cultures. I recently attended the Malayali Christmas celebrations that happen in January each year. It was a riot of sarees, food, music and dance with an amazing Father Christmas throwing sweets and dancing his way through a cheering crowd.\nThere are over a thousand Malayali families living in Worcestershire who originally came from Kerela in southwest India. Due to their good English and medical training many of these families came to the UK in the 90s and noughties to work in our NHS and as consequence we have lots of Malayali residents living here in Worcester, many working at Worcestershire Royal Hospital.\nIt’s perhaps dangerous to generalise but the Malayali community are generous to a fault and are a friendly and an incredibly polite group of people. In fact, unless you have been a patient at the hospital you may not have known that the community existed.\nA big part of their culture is that they are mostly Catholic, the other for me was to learn that they are very keen on tug of war competitions. Our Worcester team is very good – in the past they have been UK national champions and they sometimes travel abroad to compete. Tug of war is a popular sport in southeast Asia – you don’t need a big space and the only equipment you need is a rope. It’s a very competitive sport – it’s not just strength or weight it’s about timing, technique and teamwork. There is lots of talk about getting just the right type of shoe for getting the best grip.\nI know that local councillors are working with council staff to try and find a place for the local team to practice. It would be fantastic to see tug of war given more attention in Worcester and I’m sure that if the council can support the community with a space to practice it will be possible to see this great sport taken up by all sections of the community.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_page_2/content_14.html": "Last weekend I attended a charity event for Worcestershire’s Children First fostering service. It was an event organised by Kyle Daisley, county councillor and Chairman of Worcestershire County Council. I’ve attended many charity events during my Mayoral year. Every event is a chance to learn something new. We heard about how foster parents help and […]\nWorcester Wheels & Worcester Rotary Club\nIt’s been a varied week. Last week I had the pleasure of giving some of the Worcester Wheels volunteers a Mayoral much deserved ‘thank you for everything you do’ tour of the Guildhall. Worcester Wheels helps older and less able-bodied people get around the city to get to hospital appointments and social events where the […]\nWorcester Language Exchange\nDuring my year as Mayor I have met so many interesting organisations and this week was no exception when I came across Worcester Language Exchange. Speaking to Frances Burton who set it up she said; “It was an accident really.” That’s the truth to how Worcester Language Exchange began. Fran had moved to Worcester from […]\nFast Fashion\nIn recent years, the term “fast fashion” has become synonymous with affordable and trendy clothing, churned out at lightning speed to meet consumer demand. However, behind the facade of convenience and low prices lies a host of negative issues that have far-reaching consequences for both people and the planet. The industry is notorious for its […]\nIn Praise Of Benches\nLast week I unveiled a bench with Worcester’s u3a in memory of their former member, Elizabeth Coxon. The new bench is positioned on the riverside near the Watergate ferry steps for the benefit of residents and visitors wishing to sit for a while. Liz loved watching clouds so the bench plaque is simply inscribed “Sit […]\nBulgarian Dancing\nLast week was a varied but quieter week for Mayoral engagements. The Mayoress and I had the pleasure of being invited to a Bulgarian dancing community group. We received a warm welcome of traditional bread that guests dip in a pot of honey, washed down with a glass of Bulgarian red wine. It was evidently […]\nChinese New Year\nLast weekend it was Chinese New Year celebrations in Worcester. Well over a thousand people attended – it was a truly spectacular occasion. There was a dragon dance, food, Chinese tea drinking, music and lots of entertainment for children of all ages and it was all free to access. I have to confess that despite […]\nBrave Birds\nIn the captivating world of cinema, a concerning trend persists: the low representation of strong leading women both on screen and in roles behind the camera. Despite strides in gender equality, female filmmakers still face significant hurdles entering the industry. Societal norms and institutional biases perpetuate the stereotype that filmmaking is a male-dominated field. This […]\nLearning From The Past\nIt’s so easy, perhaps natural, to want to turn away from uncomfortable issues but as the Harvard philosopher Santayana said, “Those who cannot remember the past are condemned to repeat it.” This week, together with the Worcestershire Interfaith Forum, I hosted the annual International Holocaust Memorial Day event at the Guildhall. The theme of this […]\nWorcester’s Malayali Community\nAs Mayor you get to learn about the many and varied parts of Worcester’s varied cultures. I recently attended the Malayali Christmas celebrations that happen in January each year. It was a riot of sarees, food, music and dance with an amazing Father Christmas throwing sweets and dancing his way through a cheering crowd. There […]",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_contact/content_2.html": "Please feel free to get in touch with me with the contact details below.\nTel: 0784 298 2774\nE-mail: LouisJosephStephen@gmail.com\nAddress: 146 Bath Road, Worcester, WR5 3EP\nSocial Media Links: https://linktr.ee/LouisStephen\nPlease feel free to get in touch with me with the contact details below.\nTel: 0784 298 2774\nE-mail: LouisJosephStephen@gmail.com\nAddress: 146 Bath Road, Worcester, WR5 3EP\nSocial Media Links: https://linktr.ee/LouisStephen",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_category_pfi-waste/content_3.html": "Continuing previous thread….. The alternative to PFI is to fund public infrastructure using government’s reserves or money borrowed on the international markets, e.g. government gilts and bonds.\nCategory: PFI Waste\nExposing the un-transparent and wasteful nature of Public Finance Initiative (PFI) for raising private money for public infrastructure\nWhat’s Wrong with PFI\nContinuing previous thread …. Public Finance Initiative (PFI) projects are more expensive than using public money because: In a PFI project money has to be raised in the financial markets – the cost of private borrowing will always be more expensive (typically 1.5% above bank base rates) compared to government money raised with bonds and […]\nNO PFI-LING MATTER\nThe Private Finance Initiative (PFI) was a Tory idea, which, in opposition, New Labour strongly opposed. But as soon as Labour came to power they fully embraced it and declared that PFI would become the means by which most of our new public infrastructure would be built. Everything from schools to hospitals to roads are […]",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_05_thank-you-and-goodbye-as-mayor/content_7.html": "Sadly, my time as Mayor has now come to an end. The chain of office has been handed over, a thank you and goodbye speech made at the Guildhall and the safe for the very valuable chain that has been a bit of an eye sore in the hallway for the last year has been removed. As they say, all good things come to an end. Katey and I have enjoyed the experience. It’s been a real honour and a privilege, something that I’ll treasure forever. Thank you.\nLast year I attended hundreds of events and helped to raise over £7,000 for Age UK. Last May I supported Worcester Community Trust to put on a Christmas meal at the Guild Hall.\nI’ve conducted scores of Mayor’s tours of the Guildhall to all manner of charities, schools and foreign visitors – sometimes several in one week. Each tour being perfected and honed, hopefully getting a little better as I gained experience.\nAt the beginning of the year, I made a pledge to attend every Mayoral event on my bike. I’ve always believed that leaders should lead. Unfortunately, perhaps I should have consulted Katey before making that pledge. There were a few ‘words said’ when on more than one occasion I insisted on us arriving at a posh charity event in evening dress and dinner jacket.\nOne of the things that I’m most proud of was the Mayor’s charity fashion show. When I say proud it’s actually more accurate to say proud of the team that made it happen and by that, I mean key Guildhall staff like Gill Preece but also Karel Bretveld from Age UK. The team raised thousands of pounds and gave dozens of Worcester’s young people an amazing opportunity to show off their creative skills. And it was also a lot of fun.\nFinally, I wish Mel Allcott all the best for her time as the city’s new Mayor. I hope she enjoys the experience as much as I did.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_08_speed-safety-concerns-on-london-road/content_18.html": "Many residents, whilst speaking to Paul and Louis, have raised concerns about the speed of the traffic on London Road. This has been highlighted by another serious accident near Foxwell Street in August with a car flipping on to its roof. Speeding cars and lorries, as well as being noisy are creating safety concerns for pedestrians as well as cars pulling out of side roads.\nSpeeding near Foxwell street is less of a problem at busy congested ‘rush hour’ times of the day. However overnight when the traffic volume is low over 25% of the vehicles are speeding above 35mph.\nPavement parking is also becoming an issue as people stop to use the local shops.\nWhat is to be done? One possibility is to install a speed camera. Another is to install a segregated cycle lane on the uphill side or possibly change the road layout to introduce a 20mph zone. What do you think?\nLet us know by following this link.\nIf we have enough support we will create a petition to the county council. You decide!",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_07_new-toucan-crossing-on-bath-road/content_13.html": "A city councillors Paul and I have been informed that that the proposed Toucan Crossing across Bath Road is now nearing its initiation. It will be built near the junction of Norton Road and Bath Road.\nHighways will be closing Bath Rd to traffic on the 21st and 28th July for the removal of the pedestrian refuge and again on the 8th and 15th Sept to lay the High friction surfacing (HFS).\nNorton Road will be closed through the entire duration of the project.\nThe rest of the works will be undertaken with two way lights which will be manually controlled in an attempt to limit traffic backing up onto St. Peters roundabout and the Ketch.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_03_in-praise-of-benches/content_16.html": "Last week I unveiled a bench with Worcester’s u3a in memory of their former member, Elizabeth Coxon.\nThe new bench is positioned on the riverside near the Watergate ferry steps for the benefit of residents and visitors wishing to sit for a while. Liz loved watching clouds so the bench plaque is simply inscribed “Sit awhile and watch the clouds.”\nThank you to Worcester u3a for making this bench possible. For very many older people and those with disabilities, a bench and ideally a series of benches, is the difference between being able to go for a walk and not.\nBenches are so important – they are truly amazing things. A simple bench enables; walking, sitting, meditating, looking at the passers-by, the swans, people rowing or running past. A bench is somewhere to nurse a child, perhaps for lovers to meet, a tourist to eat chips or a shop worker to eat a lunchtime sandwich. A bench and somewhere to sit is at least some dignity to the homeless.\nEver thought of the etiquette of bench sitting? Sitting in the centre says, ‘go away’. Sitting at one end says, ‘there’s room one more’ and invites a ‘Is it OK for me to sit here?’ The humble bench makes all this happen.\n*********\nIt’s normal practice for the Deputy Mayor to become Mayor at the first full council meeting at the start of the municipal year. Last year the then Mayor Adrian Gregson and Rachel were incredibly welcoming to Katey and I and helped us get ready for our new roles. So last Tuesday it was my pleasure to continue that new tradition created by Adrian to support the likely new Mayor of Worcester – Cllr Mel Allcott and her consort Andy.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_05_worcesters-local-elections-may-2024/content_12.html": "Worcester Green Party has done amazingly well.\nHere in Battenhall I was re-elected for a second time and with an increased share of the vote – 68% is not too shabby – thank you for your support.\nThe Greens won another seat and we now have 12 of the 35 city councillors. Across the whole city the support for each party was as follows:\n| Party | Votes | Share |\n| Green | 18,346 | 33% |\n| Lab | 16,446 | 30% |\n| Con | 11,084 | 20% |\n| LD | 7,894 | 14% |\n| Ind | 1,288 | 2% |\n| UKIP | 68 | 0% |\n| TUSC | 207 | 0% |\n| Reform | 297 | 1% |\nFor the second year running the Green Party won the city wide, so called, popular vote.\nThese excellent results unfortunately did not translate directly into council seats. The number of seats on the council for each party is now as follows: As you can see due to first past the post Labour got fewer votes but the most council seats.\nLabour: 17 seats\nGreen: 12 seats\nLib Dems: 5 seats\nConservatives: 1 seat\n18 seats are needed to form a majority council so the council remains in no overall control\nAt the first full council meeting after the elections the Leader and Deputy Leader and all the chair and vice chairs of committees get appointed. The Green Party offered to work with Labour to create a stable and collaborative council but that offer was rejected and with support from the lone Conservative and Lib Dem councillors we now have a Labour led minority council.\nThe Green Party is now effectively the main opposition party on the council. We’ll put forward our own ideas and support every idea on which we agree but we will scrutinise and hold the Labour Party to account when ever we believe they are making a mistake.\nAs I write this blog the General Election has just been called. The Conservatives in Worcester are in disarray. They clearly struggled to field a full slate of candidates at the city council elections and have no real prospect of winning the parliamentary seat here in Worcester. Electoral Calculus has put the chances of a Labour victory in Worcester at 97%. National opinion polls will I’m sure narrow a bit as we get closer to the election, but with Labour leads of over 20% in the polls anything but a very large Labour majority would now be a big surprise.\nSo whoever you normally vote for, given that Labour are going to win big nationally, would you be prepared at this election to vote with your heart and vote for the Green Party?\nYou can find more out about Tor Pingree here: More information\nWant to know more about our core values and policies: Core Values and Policies",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_newsletters/content_8.html": "To receive our future monthly digital community newsletter ‘Battenhall News’ by email please register here: Subscribe\nCurrent and past copies of the digital edition:\nBattenhall News – November 2024\nBattenhall News – September 2024\nBattenhall News – February 2024\nBattenhall News – January 2024\nBattenhall News – November 2023\nBattenhall News – September 2023\nBattenhall News – February 2022\nBattenhall News – January 2022\nBattenhall News – November 2021\nBattenhall News – September 2021\nBattenhall News – Nov Dec 2020\nBattenhall News – October 2020",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_campaigns/content_10.html": "Working for Worcester\n20 mph Campaign\nSafer streets for Worcester; a 20 mph campaign for our city.\nThe Green Party is calling for a 20mph speed limit in built-up areas to be implemented urgently to improve road safety.\nFree Insulation for All\nGreens are working for universal free insulation, not means-testing. In Yorkshire, Green Councillors have made sure that 40,000 people will get warmer, cheaper-to-run homes for absolutely nothing.\nA Green New Deal for Worcester\nIn a world with limited resources, it does not make sense to depend on economic growth. The Green Party seeks an economic system which recognises the limits of the natural systems of the planet while supporting the needs of all people.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_tag_pfi/content_4.html": "The Private Finance Initiative (PFI) was a Tory idea, which, in opposition, New Labour strongly opposed. But as soon as Labour came to power they fully embraced it and declared that PFI would become the means by which most of our new public infrastructure would be built. Everything from schools to hospitals to roads are […]",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_08_speech-for-stand-up-to-racism-rally-worcester-10th-august-2024/content_6.html": "My name is Louis Stephen I’m a Green Party councillor on Worcester’s city council.\nI don’t want to be here.\nWe shouldn’t need to be here but be here we must.\nThank you to Worcester Trades Council\nA sincere thank you to everyone for coming to stand up to racism and violent thuggery.\nSome might say that we should not be creating a fuss, maybe that we should be quiet to calm things down – it’s an attractive idea – I don’t want to be here but be here we must.\nThe reason? We must show the racists that we will never be cowed and that we are the many they are few.\nThe racist protesters have been chanting “stop the boats”. We all know where this poisonous rhetoric has come from. This MUST be a wake-up call to all politicians who have actively promoted or given in to the rhetoric of immigration being a threat to this country. These riots didn’t happen just overnight they started when the last government started to scapegoat and other people coming to this country. They took a populist stance to divide and conquer with all their talk of illegal immigrants, the years of austerity, the creation of deliberate hostile environment. I say refugees are welcome\nLet’s be clear, hatred and organised political violence of those who come to intimidate our communities has no place here and we stand proudly against Islamophobia, racism and all forms of hate.\nI thank the police for their efforts to contain those intent on violence and maintain safety in the city, and thank everyone who has come out in peaceful support of the UK as a tolerant and welcoming country. Our work now is to unite – in Worcester and nationally – to support those who feel unsafe and targeted by this hatred, and to build that unity against the far-right’s racism, Islamophobia and violence.\nThank you",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_legal/content_19.html": "Legal Promoted by C Wratten on behalf of Louis Stephen (Green Party) both at 146 Bath Road, Worcester, WR5 3EP.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2010_01_beyond-pfi-%e2%80%93-what%e2%80%99s-the-alternative/content_17.html": "Continuing previous thread…..\nThe alternative to PFI is to fund public infrastructure using government’s reserves or money borrowed on the international markets, e.g. government gilts and bonds.\nResponsibility for ensuring that money is spent efficiently needs to remain with our elected government leaders. Elected leaders, departmental managers and directors need to get on with the job they have been paid for. We need to build up the competence and skills in these areas to ensure that we are able to specify, negotiate and project manage the infrastructure we need building. In my experience within engineering the key is having excellent specifications with lots of consultation with the people who will use the thing we are buying, good negotiation and project management. These skills must be found and developed in the public sector.\nNo more PFI projects should be agreed from now. What about existing PFI schemes? Existing PFI should be very gradually bought back under public ownership. This would need to be on a case by case basis. The Skye Toll Bridge is a good example where this has already happened.\nIn PFI projects, where it is too costly to buy the assets back, the government should bring back the sub-contracted soft services like cleaning and catering under public control. Let’s start unwinding the PFI mess with Worcestershire Royal Hospital.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_about/content_21.html": "A local resident and part of the local community\nI have lived in and around Worcester for the majority of my life moving to the Bath Road area in 1997. I am 57 years old, married and have two grown up children who attended Nunnery Wood High School and Sixth Form College.\nTransferable skills needed to become a City Councillor\nUntil early 2015 I worked as a senior manager at Worcester Bosch in Production Engineering as well as Change Management in the Service Department. In previous roles I have worked within Project Management and Purchasing departments.\nIn all these roles I have needed good communication skills and sometimes needed to take hard decisions. Much of my work is focused on creating and driving through changes within a continuous improvement culture where gritty determination needs to be balanced with a real understanding that it is the people and their needs and aspirations that really make an organisation strong.\nHaving spent decades in industry with some well paid jobs I have decided to now put something back into our community by standing in and winning a seat on Worcester City Council. This last municipal year I have had the great honour of being Mayor of Worcester.\nPolicy priorities:\nWhat are the influences that have set my policy priorities?\nAs a child I grew up in Thatcher’s Britain with all that it entailed: recession, privatisation, American cruise missiles at Greenham Common, riots in the inner cities, the miners’ strike, Tiananmen Square, the poll tax and the subjugation of society in favour of the individual.\nLike many I looked on at the Labour victory in ’97 – a time to hope for a radical change. But as the years passed it dawned on me that policy after policy Labour were being sucked into the political establishment. In place of real change we got spin, sleaze, war in Iraq, University tuition fees, continuing arms trade and a gradual steady loss of civil liberties. I became aware of climate change and joined the Green Party about 15 years ago.\nBut what are my policy priorities? I will work to promote the Green Party values of:\n- Cost of living crisis\n- Inclusive communities\n- Meaningful work\n- Taking responsibility for the local environment as part of the global environment\n- Equitable access to education and health care\nGoals and aspirations for Worcester:\nI am a positive person and my vision is to make Worcester a sustainable and better place to live. I truly believe that anything is possible and that the only thing holding us back is ourselves. I am an optimist and when I set myself a goal will strive my utmost to achieve it. If you trust in me and are prepared to work with me I will do my best to repay that trust and support.\nRunning for election is expensive – are you in a position to chip in?\nCllr Louis Stephen (April 2024)",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk/content_24.html": "Many residents, whilst speaking to Paul and Louis, have raised concerns about the speed of the traffic on London Road. This has been highlighted by another serious accident near Foxwell Street in August with a car flipping on to its roof. Speeding cars and lorries, as well as being noisy are creating safety concerns for […]\nSpeech for Stand-Up To Racism Rally – Worcester 10th August 2024\nMy name is Louis Stephen I’m a Green Party councillor on Worcester’s city council. I don’t want to be here. We shouldn’t need to be here but be here we must. Thank you to Worcester Trades Council A sincere thank you to everyone for coming to stand up to racism and violent thuggery. Some might […]\nLast of a kind….\nInteresting planning committee meeting today where we discussed buildings on the ‘At Risk’ register. This building, now in a sorry state, was built in 1913 at farriers smithy for shoeing horses. Apparently horses were led through the horseshoe arch to have their shoes replaced. Behind this site was a blacksmith for making the shoes. It’s […]\nPeer to Peer Car Club – Hiya Car\nQuite a lot of people are trying to cut down on their car use. A few years back we went from having two cars to one. It was a bit scary but ever since I’ve used my e-bike a whole lot more. There is always a bit of a concern though with not having a […]\nNew Toucan Crossing On Bath Road\nA city councillors Paul and I have been informed that that the proposed Toucan Crossing across Bath Road is now nearing its initiation. It will be built near the junction of Norton Road and Bath Road. Click on this blue text for a link to a drawing of the general arrangement to give an idea […]\nWorcester’s Local Elections – May 2024\nWorcester Green Party has done amazingly well. Here in Battenhall I was re-elected for a second time and with an increased share of the vote – 68% is not too shabby – thank you for your support. The Greens won another seat and we now have 12 of the 35 city councillors. Across the whole […]\nThank you and goodbye as Mayor\nSadly, my time as Mayor has now come to an end. The chain of office has been handed over, a thank you and goodbye speech made at the Guildhall and the safe for the very valuable chain that has been a bit of an eye sore in the hallway for the last year has been removed. […]\nWorcester Bike Bus\nThis week I joined the Honeywell Bike Bus in Dines Green. It was great to be able to show a bit of Mayoral support for this fantastic initiative. Not yet familiar with bike buses? A bike bus is a brilliant way to support and encourage primary-school children to cycle to school, reducing traffic and giving […]\nMass In Blue by Youth Choral Worcestershire\nLast weekend we were invited to a performance of Mass in Blue by Youth Choral Worcestershire in the cathedral. This is a project set up in 2010 to provide educational singing projects to young people in the county, particularly those who have limited opportunity to access this sort of experience. It is open to any […]\nSt George’s Day Parade – Worcester Scouts\nLast Sunday it was the Scout’s annual St George’s Day parade. I’m always learning. The sun shone on the hundreds of Squirrels, Beavers, Cubs, Scouts and Explorers as they marched past the Vice Lord-Lieutenant Gilbert Greenall taking the salute. There was a warm positive atmosphere with the High Street packed with proud parents and grandparents. […]",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2010_01_whats-wrong-with-pfi/content_9.html": "Continuing previous thread ….\nPublic Finance Initiative (PFI) projects are more expensive than using public money because:\n- In a PFI project money has to be raised in the financial markets – the cost of private borrowing will always be more expensive (typically 1.5% above bank base rates) compared to government money raised with bonds and gilts.\n- In a PFI project the private company will additionally need to make a profit. This profit is of course not applicable where projects are managed and funded by public bodies.\n- Projects funded under PFI have higher arrangement and setup fees. PFI deals are complicated; considerable amount of money is needed to pay for arrangement, brokerage, insurance and consultancy fees which are simply not needed in conventionally funded projects.\nEnron managed to fool the world keeping many of its liabilities off the books – when they were found out their business collapsed. This government has been piling up debt to the nation that is similarly “off the books”. The very large off-balance sheet debts now need to be added to the money the government has spent on bailing out the banks.\nThis government led us into one of the longest recessions in recent history. Its reliance on complicated financial instruments such as PFI, trust in the power of the City and trust in using market forces is increasingly putting the government’s competence into sharp relief.\nWe can’t go on like this…",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_05_st-georges-day-parade-worcester-scouts/content_5.html": "Last Sunday it was the Scout’s annual St George’s Day parade. I’m always learning. The sun shone on the hundreds of Squirrels, Beavers, Cubs, Scouts and Explorers as they marched past the Vice Lord-Lieutenant Gilbert Greenall taking the salute. There was a warm positive atmosphere with the High Street packed with proud parents and grandparents. What I had not expected was the Cathedral service just prior to the parade.\nI say this in a good way – I’ve never been to a Cathedral service quite like this. Cubs and Scouts have changed a great deal over the years. The service included lots of singing, audience participation “it’s behind you” and lots of laughs as they put on a short play retelling the story of how St George overcame the dragon in the most engaging way imaginable – at times we were in stitches on the front row.\nAll of the organisers deserve much deserved thanks – they are all volunteers and do so much in our communities creating a fantastic social environment for our young people.\nThe Scouts in Worcester meet in 10 groups within our city. With over 1100 young people and 350 volunteers. Unfortunately, not every area is fully covered. In the north of the city, 12th Worcester would love to open a Scout Troop so the cubs can move up when they reach 10 years old. And in WR2 they have a huge waiting list for the Squirrels’ age group of 4-6 years old. They need volunteers to help open these sections.\nSociety changes and with it so do organisations like the Scouts. They are an inclusive organisation and welcome diversity in volunteering. Whether you work with young people directly, a trustee, or an admin superstar, they are ready to welcome you. Visit scoutsworcester.org to express an interest.",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_policies/content_11.html": "Green Party Policies for Worcester\nThe Green Party offers a different approach to the other main political parties. At the heart of all Green Party policies is SUSTAINABILITY. This means … meeting everyone’s basic needs (for safe food and water, clean air, housing, energy, education, work and play, caring for each other) without compromising the ability of future generations to meet their needs. This won’t be easy, but it can be achieved if people and their Governments work together.\nLocally, nationally and globally, other parties have allowed public services to deteriorate, the gap between rich and poor to increase massively, and the natural environment to be ruined in pursuit of profits and economic growth. The Green Party aims to address the root causes of these problems, rather than simply tinkering with the symptoms. Their approach looks beyond the short term and single issues, to offer a coherent long-term strategy for a sustainable future.\nCOMMUNITY INVOLVEMENT in decision-making stands at the very heart of Green politics. In today’s globalised society, too much power lies in the hands of big business, financial institutions and central governments. Greens believe that if local people have control over what happens in and to their own communities, then decisions will be made which are fairer and more sustainable.\nThe Green Party believes that economic activity should be LOCALLY BASED. As far as possible, companies should be locally owned and run, and goods and services should be traded locally. Benefits will include cleaner production processes, less need for long-distance transport of goods, more local jobs, and more money circulating locally instead of being sucked away by multinational companies.",
  "http_www_louisstephen_co_uk_/http_www_louisstephen_co_uk/content_1.html": "Many residents, whilst speaking to Paul and Louis, have raised concerns about the speed of the traffic on London Road. This has been highlighted by another serious accident near Foxwell Street in August with a car flipping on to its roof. Speeding cars and lorries, as well as being noisy are creating safety concerns for […]\nSpeech for Stand-Up To Racism Rally – Worcester 10th August 2024\nMy name is Louis Stephen I’m a Green Party councillor on Worcester’s city council. I don’t want to be here. We shouldn’t need to be here but be here we must. Thank you to Worcester Trades Council A sincere thank you to everyone for coming to stand up to racism and violent thuggery. Some might […]\nLast of a kind….\nInteresting planning committee meeting today where we discussed buildings on the ‘At Risk’ register. This building, now in a sorry state, was built in 1913 at farriers smithy for shoeing horses. Apparently horses were led through the horseshoe arch to have their shoes replaced. Behind this site was a blacksmith for making the shoes. It’s […]\nPeer to Peer Car Club – Hiya Car\nQuite a lot of people are trying to cut down on their car use. A few years back we went from having two cars to one. It was a bit scary but ever since I’ve used my e-bike a whole lot more. There is always a bit of a concern though with not having a […]\nNew Toucan Crossing On Bath Road\nA city councillors Paul and I have been informed that that the proposed Toucan Crossing across Bath Road is now nearing its initiation. It will be built near the junction of Norton Road and Bath Road. Click on this blue text for a link to a drawing of the general arrangement to give an idea […]\nWorcester’s Local Elections – May 2024\nWorcester Green Party has done amazingly well. Here in Battenhall I was re-elected for a second time and with an increased share of the vote – 68% is not too shabby – thank you for your support. The Greens won another seat and we now have 12 of the 35 city councillors. Across the whole […]\nThank you and goodbye as Mayor\nSadly, my time as Mayor has now come to an end. The chain of office has been handed over, a thank you and goodbye speech made at the Guildhall and the safe for the very valuable chain that has been a bit of an eye sore in the hallway for the last year has been removed. […]\nWorcester Bike Bus\nThis week I joined the Honeywell Bike Bus in Dines Green. It was great to be able to show a bit of Mayoral support for this fantastic initiative. Not yet familiar with bike buses? A bike bus is a brilliant way to support and encourage primary-school children to cycle to school, reducing traffic and giving […]\nMass In Blue by Youth Choral Worcestershire\nLast weekend we were invited to a performance of Mass in Blue by Youth Choral Worcestershire in the cathedral. This is a project set up in 2010 to provide educational singing projects to young people in the county, particularly those who have limited opportunity to access this sort of experience. It is open to any […]\nSt George’s Day Parade – Worcester Scouts\nLast Sunday it was the Scout’s annual St George’s Day parade. I’m always learning. The sun shone on the hundreds of Squirrels, Beavers, Cubs, Scouts and Explorers as they marched past the Vice Lord-Lieutenant Gilbert Greenall taking the salute. There was a warm positive atmosphere with the High Street packed with proud parents and grandparents. […]",
  "http_www_louisstephen_co_uk_/https_www_louisstephen_co_uk_2024_05_could-you-foster-a-child/content_20.html": "Last weekend I attended a charity event for Worcestershire’s Children First fostering service. It was an event organised by Kyle Daisley, county councillor and Chairman of Worcestershire County Council.\nI’ve attended many charity events during my Mayoral year. Every event is a chance to learn something new.\nWe heard about how foster parents help and support the most vulnerable children in our communities. It breaks my heart to think of the very many children who through no fault of their own are being looked after in a children’s home. Instead of a children’s centre manager, doesn’t every child deserve a warm, supportive and loving real home with parents?\nIt’s clear that being a foster carer isn’t possible for everyone however there is something we can all do to help, and that is by talking about fostering. There are nearly six hundred thousand people living in our county – there is a very good chance that there are good people who might be interested to help. But how do we reach them? Somebody somewhere just needs to be asked or given a kernel of an idea that down the line might one day lead to them applying to become a foster parent.\nI listened, took their message and now I’m passing that message on. Who do you know that might be interested? You may not have a weekly blog or newspaper column but my challenge to you is to mention fostering to someone you know and ask them in turn to think of someone else that might be interested. Maybe, just maybe as a community someone you mention fostering to, could dramatically change a young person’s life for ever."
}