{
  "https_about_me_deeshachandra/https_about_me_user_edit_account/content_15.html": "Get started for free\nGet your page\nFeatures\nPricing\nHome\nFeatures\nPricing",
  "https_about_me_deeshachandra/https_about_me_user_edit_account_billing/content_17.html": "Get started for free\nGet your page\nFeatures\nPricing\nHome\nFeatures\nPricing",
  "https_about_me_deeshachandra/https_about_me_deeshachandra/content_1.html": "Deesha Chandra\nConsultant and Community manager in London, United Kingdom\nI have been working in the social sector for over 10 years now. A portfolio career ranging from managing communities, supporting social entrepreneurs, running innovation challenges, teaching, human rights case work, research and event management.\nI am passionate about creating the future we want to live in. Societies that collaborate, thrive on diversity and function with an awareness of our impact on each other and the planet.",
  "https_about_me_deeshachandra/https_about_me_cdn-cgi_l_email-protection/content_23.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_about_me_deeshachandra/https_about_me_login/content_2.html": "Get started for free\nGet your page\nFeatures\nPricing\nHome\nFeatures\nPricing",
  "https_about_me_deeshachandra/https_about_me_side-hustlers/content_16.html": "Are you a side hustler looking to grow your audience or attract new clients?\nWhat is a side hustle?\nThe term “side hustle” has been gaining popularity for a while now and refers to a project you pursue in addition to your 9-to-5 job. A side hustle may or may not bring in income. Side hustlers are mainly looking to explore an interest, hone their skills, and share their work while growing an audience.\nHow can about.me help side hustlers?\nSide hustlers on about.me use their page and personalized link, such as yourname.me, to professionally present who they are and what they do (from 9-to-5 and from 5-to-9).\nabout.me can help you…\n- Build a reputation by showcasing your side hustle\n- Centralize your online presence\n- Easily bridge the gap between your personal and professional self\n- Highlight your background and expertise\n- Make it easy for people to learn more about you\nWhat kinds of side hustles are there?\nA side hustle can be anything.\nSeriously!\nOur users are really inspiring. They have all kinds of successful side hustles. We’ve seen a lawyer who doubles as a musician, a life coach who is also a talented massage therapist, and even someone who is a business consultant by day, lifestyle blogger by night.\nSide hustlers we admire\nWait—is having a side hustle the same thing as freelancing?\nWe’re going to be honest here: freelancers get a lot of attention. There are a lot of tools and solutions out there to help them succeed. We think side hustlers need a little love, too!\nA side hustler is someone who has at least two projects that they are pursuing. One of them being a traditional 9-to-5 job and the other is their “hustle,” which they do in their off hours.\nA freelancer typically works for themselves. They are promoting and selling their skillset as their primary source of income. Sometimes people actually freelance as their side hustle. There’s a lot of overlap.\nResources for side hustlers\nArticles, interviews, and the tools you need to achieve side hustle success.\nA side hustler’s dictionary\n- “side hustle”5-to-9activity\n- “passion project”side gighobby\n- “off-hours”part-timeweekends\n- “9-to-5”day jobcareer",
  "https_about_me_deeshachandra/https_about_me_press/content_10.html": null,
  "https_about_me_deeshachandra/https_about_me_diiorio/content_18.html": "Michel A. Di Iorio\nWriter, Editor, and Small Business Owner in Deux-Montagnes, Québec, Canada\nMICHEL A. DI IORIO, a retired paramedic (turned author and translator) was a wordsmith whose skills have served his clients, both large and small... rich and poor... public and private. During this leg of his career, he wrote for those who didn't know how, who couldn't, who never had the time, or who simply weren't the greatest of writers.\nMichel wrote / translated just about everything to / from either of the official languages of the land!\nLanguages: French and English\nRetired since 2022\nMICHEL A. DI IORIO est un artisan des mots dont les compétences répondaient aux besoins variés de ses clients, les petits et les gros... les riches et les pauvres... les clients publics et privés, et ce depuis plusieurs années. Il écrivait pour ceux qui ne savaient pas comment, qui ne pouvaient pas, qui n'avaient pas le temps, ou qui n'étaient pas doués de la plume.\nDurant sa carrière, Michel a rédigé et traduit à peu près tout ce qu'on peut s'imaginer dans ou vers l'une des deux langues officielles du pays!\nLangues : français et anglais\nRetraité depuis 2022\n-----------------------------------------------------------------------------",
  "https_about_me_deeshachandra/https_about_me_legal_copyright/content_21.html": "Copyright Dispute Policy\nLast Updated: June 7, 2018\nIn accordance with the DMCA, we’ve adopted the policy below toward copyright infringement. We reserve the right to (1) block access to or remove material that we believe in good faith to be copyrighted material that has been illegally copied and distributed by any of our advertisers, affiliates, content providers, members or users and (2) remove and discontinue service to repeat offenders.\nRemember that your use of About.me’s Services is at all times subject to the Terms of Use, which incorporates this Copyright Dispute Policy. Any terms we use in this Policy without defining them have the definitions given to them in the Terms of Use.\n- Procedure for Reporting Copyright Infringements. If you believe that material or content residing on or accessible through the Services infringes your copyright (or the copyright of someone whom you are authorized to act on behalf of), please send a notice of copyright infringement containing the following information to the About.me’s Designated Agent to Receive Notification of Claimed Infringement (our “Designated Agent,” whose contact details are listed below):\n- A physical or electronic signature of a person authorized to act on behalf of the owner of the copyright that has been allegedly infringed;\n- Identification of works or materials being infringed;\n- Identification of the material that is claimed to be infringing including information regarding the location of the infringing materials that the copyright owner seeks to have removed, with sufficient detail so that Company is capable of finding and verifying its existence;\n- Contact information about the notifier including address, telephone number, and email address;\n- A statement that the notifier has a good faith belief that the material identified in (1)(c) is not authorized by the copyright owner, its agent, or the law; and\n- A statement made under penalty of perjury that the information provided is accurate and the notifying party is authorized to make the complaint on behalf of the copyright owner.\n- Once Proper Bona Fide Infringement Notification is Received by the Designated Agent. Upon receipt of a proper notice of copyright infringement, we reserve the right to:\n- remove or disable access to the infringing material;\n- notify the content provider who is accused of infringement that we have removed or disabled access to the applicable material; and\n- terminate such content provider’s access to the Services if he or she is a repeat offender.\n- Procedure to Supply a Counter-Notice to the Designated Agent. If the content provider believes that the material that was removed (or to which access was disabled) is not infringing, or the content provider believes that it has the right to post and use such material from the copyright owner, the copyright owner’s agent, or, pursuant to the law, the content provider may send us a counter-notice containing the following information to the Designated Agent:\n- A physical or electronic signature of the content provider;\n- Identification of the material that has been removed or to which access has been disabled and the location at which the material appeared before it was removed or disabled;\n- A statement that the content provider has a good faith belief that the material was removed or disabled as a result of mistake or misidentification of the material; and\n- Content provider’s name, address, telephone number, and email address, and a statement that such person or entity consents to the jurisdiction of the Federal Court for the judicial district in which the content provider’s address is located, or, if the content provider’s address is located outside the United States, for any judicial district in which About.me is located, and that such person or entity will accept service of process from the person who provided notification of the alleged infringement.\nIf a counter-notice is received by the Designated Agent, About.me may, in its discretion, send a copy of the counter-notice to the original complaining party informing that person that About.me may replace the removed material or cease disabling it in 10 business days. Unless the copyright owner files an action seeking a court order against the content provider accused of committing infringement, the removed material may be replaced or access to it restored in 10 to 14 business days or more after receipt of the counter-notice, at About.me’s discretion.\nPlease contact Company’s Designated Agent at the following address:\nMindy Lauck, Copyright Officer\n[email protected]\n27 South Park St\nSan Francisco, CA 94107",
  "https_about_me_deeshachandra/https_about_me_signup_email/content_24.html": "Features\nPricing\nLog In\nHome\nFeatures\nPricing",
  "https_about_me_deeshachandra/https_about_me_privacy/content_13.html": "Privacy Policy\nEffective date: June 7, 2018\nWe at About.me, Inc. know you care about how your personal information is used and shared, and we take your privacy seriously. Please read the following to learn more about our Privacy Policy. By using or accessing the Services in any manner, you acknowledge that you accept the practices and policies outlined in this Privacy Policy, and you hereby consent that we will collect, use, and share your information in the following ways.\nRemember that your use of About.me’s Services is at all times subject to the Terms of Use, which incorporates this Privacy Policy. Any terms we use in this Policy without defining them have the definitions given to them in the Terms of Use.\nWhat does this Privacy Policy cover?\nThis Privacy Policy covers our treatment of personally identifiable information (“Personal Information”) that we gather when you are accessing or using our Services, but not to the practices of companies we don’t own or control, or people that we don’t manage. We also host and process certain content for our users. Our users tell us what to do with their content, and we follow their instructions. If you are an end user of one of our user’s webpages and want to know how a user handles your information, you should check the user’s privacy policy.\nWe gather various types of Personal Information from our users, as explained in more detail below, and we use this Personal Information internally in connection with our Services, including to personalize, provide, and improve our services, to allow you to set up a user account and profile, to contact you and allow other users to contact you, to fulfill your requests for certain products and services, and to analyze how you use the Services. In certain cases, we may also share some Personal Information with third parties, but only as described below.\nAs noted in the Terms of Use, we do not knowingly collect or solicit personal information from anyone under the age of 16. If you are under 16, please do not attempt to register for the Services or send any personal information about yourself to us. If we learn that we have collected personal information from a child under age 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us personal information, please contact us at [email protected].\nWill About.me ever change this Privacy Policy?\nWe’re constantly trying to improve our Services, so we may need to change this Privacy Policy from time to time as well, but we will alert you to changes by placing a notice on https://about.me, by sending you an email, and/or by some other means. Please note that if you’ve opted not to receive legal notice emails from us (or you haven’t provided us with your email address), those legal notices will still govern your use of the Services, and you are still responsible for reading and understanding them. If you use the Services after any changes to the Privacy Policy have been posted, that means you agree to all of the changes. Use of information we collect now is subject to the Privacy Policy in effect at the time such information is used.\nWhat Information does About.me Collect?\nInformation You Provide to Us:\nWe receive and store any information you knowingly provide to us. For example, through the registration process and/or through your account settings, we may collect Personal Information such as your name, email address, photo, occupation, location, biographical information, and third-party account (for example, your username for Facebook or other third party sites that you link to from your about.me page). If you sign in to the Services through a third party site or service, you understand certain information in those accounts, such as your name and email (“Third Party Account Information”) may be transmitted to us in connection with the log-in and authentication process. Certain information may be required to register with us or to take advantage of some of our features.\nWe may communicate with you if you’ve provided us the means to do so. For example, if you’ve given us your email address, we may send you promotional email offers on behalf of other businesses, or email you about your use of the Services. Also, we may receive a confirmation when you open an email from us. This confirmation helps us make our communications with you more interesting and improve our services. If you do not want to receive communications from us, please indicate your preference in your account settings, located at https://about.me/user/edit/account/emailprefs.\nInformation Collected Automatically\nWhen you register for the Services, we may use a third-party contact enrichment service provider (such as FullContact) to help us automatically populate certain information in your Website. Such service providers collect publicly available information about you from various sources, including your publicly accessible social media profiles. We use such information to pre-populate certain areas of your About.me Website in order to facilitate the registration, set-up process, and maintenance of your Website. You can modify or delete any information that has been pre-populated.\nWhenever you interact with our Services, we automatically receive and record information on our server logs from your browser or device, which may include your IP address, geolocation data, device identification, “cookie” information, the type of browser and/or device you’re using to access our Services, and the page or feature you requested. “Cookies” are identifiers we transfer to your browser or device that allow us to recognize your browser or device and tell us how and when pages and features in our Services are visited and by how many people. You may be able to change the preferences on your browser or device to prevent or limit your device’s acceptance of cookies, but this may prevent you from taking advantage of some of our features.\nIf you click on a link to a third party website or service, a third party may also transmit cookies to you. Again, this Privacy Policy does not cover the use of cookies by any third parties, and we aren’t responsible for their privacy policies and practices. Please be aware that cookies placed by third parties may continue to track your activities online even after you have left our Services, and those third parties may not honor “Do Not Track” requests you have set using your browser or device.\nWe may use this data to customize content for you that we think you might like, based on your usage patterns. We may also use it to improve the Services – for example, this data can tell us how often users use a particular feature of the Services, and we can use that knowledge to make the Services interesting to as many users as possible.\nInformation Collected From Other Websites and Do Not Track Policy\nThrough cookies we place on your browser or device, we may collect information about your online activity after you leave our Services. Just like any other usage information we collect, this information allows us to improve the Services and customize your online experience, and otherwise as described in this Privacy Policy. Your browser may offer you a “Do Not Track” option, which allows you to signal to operators of websites and web applications and services (including behavioral advertising services) that you do not wish such operators to track certain of your online activities over time and across different websites. Our Services do not support Do Not Track requests at this time, which means that we collect information about your online activity both while you are using the Services and after you leave our Services.\nWill About.me Share Any of the Personal Information it Receives?\nWe may share your Personal Information with third parties as described in this section:\nInformation that’s been de-identified. We may de-identify your Personal Information so that you are not identified as an individual, and provide that information to our partners. We may also provide aggregate usage information to our partners (or allow partners to collect that information from you), who may use such information to understand how often and in what ways people use our Services, so that they, too, can provide you with an optimal online experience. However, we never disclose aggregate usage or de-identified information to a partner (or allow a partner to collect such information) in a manner that would identify you as an individual person.\nAffiliated Businesses: In certain situations, businesses or third party websites we’re affiliated with may sell or provide products or services to you through or in connection with the Services (either alone or jointly with us). You can recognize when an affiliated business is associated with such a transaction or service, and we will share your Personal Information with that affiliated business only to the extent that it is related to such transaction or service. Examples of such services may include an integration with a third-party payment processor (such as PayPal) to enable you to collect payments through your Website or an integration with an email marketing platform (such as MailChimp) to assist with email marketing campaigns for your End Users. Integrations like these may require you to transmit certain information from your Service profile in order to access their functionality. We have no control over the policies and practices of third party websites or businesses as to privacy or anything else, so if you choose to take part in any transaction or service relating to an affiliated website or business, please review all such business’ or websites’ policies.\nAgents: We employ other companies and people to perform tasks on our behalf and need to share your information with them to provide products or services to you; for example, we may use a third-party email delivery service to send marketing and service-related emails on our behalf. Unless we tell you differently, our agents do not have any right to use the Personal Information we share with them beyond what is necessary to assist us. User Profiles and Submissions: Your user profile information, including your name, location, and any video or image content you upload to the Services will be publicly available. We may use such information to facilitate interaction with your End Users within the Services or address your request for our Services. For example, our Services enable you to communicate with your End Users through your Websites on the Services, allow your End Users to schedule meetings with you, and allow your End Users to sign up for a newsletter or similar communication through your Website. Please remember that any content you upload to your Website, along with any Personal Information or content that you voluntarily disclose online in a manner other users can view becomes publicly available, and can be collected and used by anyone.\nBusiness Transfers: We may choose to buy or sell assets, and may share and/or transfer customer information in connection with the evaluation of and entry into such transactions. Also, if we (or our assets) are acquired, or if we go out of business, enter bankruptcy, or go through some other change of control, Personal Information could be one of the assets transferred to or acquired by a third party.\nProtection of Company and Others: We reserve the right to access, read, preserve, and disclose any information that we reasonably believe is necessary to comply with law or court order; enforce or apply our Terms of Use and other agreements; or protect the rights, property, or safety of Company, our employees, our users, or others.\nIs Personal Information about me secure?\nYour account is protected by a password for your privacy and security. If you access your account via a third party site or service, you may have additional or different sign-on protections via that third party site or service. You must prevent unauthorized access to your account and Personal Information by selecting and protecting your password and/or other sign-on mechanism appropriately and limiting access to your computer or device and browser by signing off after you have finished accessing your account.\nWe endeavor to protect the privacy of your account and other Personal Information we hold in our records, but unfortunately, we cannot guarantee complete security. Unauthorized entry or use, hardware or software failure, and other factors, may compromise the security of user information at any time.\nWhat Personal Information can I access?\nThrough your account settings, you may access, and, in some cases, edit or delete the following information you’ve provided to us:\n- name and password\n- email address\n- location\n- occupation\n- biography, including your education history and current employer\n- interests\n- profile picture\n- user profile information, including text, images and videos you have uploaded to the site\nThe information you can view, update, and delete may change as the Services change. If you have any questions about viewing or updating information we have on file about you, please contact us at [email protected].\nUnder California Civil Code Sections 1798.83-1798.84, California residents are entitled to contact us to prevent disclosure of Personal Information to third parties for such third parties’ direct marketing purposes; in order to submit such a request, please contact us at [email protected]. California residents are entitled to ask us for a notice identifying the categories of Personal Information which we share with our affiliates and/or third parties for marketing purposes, and providing contact information for such affiliates and/or third parties. If you are a California resident and would like a copy of this notice, please submit a written request to: [email protected].\nWhat choices do I have?\nYou can always opt not to disclose information to us, but keep in mind some information may be needed to register with us or to take advantage of some of our features.\nYou may be able to add, update, or delete information as explained above. When you update information, however, we may maintain a copy of the unrevised information in our records. You may delete all of your data by deleting your account in the settings panel (https://about.me/user/edit/account). Alternatively, you may ask us to delete your page by contacting us at [email protected]. Some information may remain in our records after your deletion of such information from your account. We may use any aggregated data derived from or incorporating your Personal Information after you update or delete it, but not in a manner that would identify you personally.\nEU Residents\nIf you are a resident of the European Union (“EU”), United Kingdom, Lichtenstein, Norway, or Iceland, you may have additional rights under the EU General Data Protection Regulation (the “GDPR”). Please see our EU Privacy Policy available here https://about.me/legal/privacy/eu.\nWhat if I have questions about this policy?\nIf you have any questions or concerns regarding our privacy policies, please send us a detailed message to [email protected], and we will try to resolve your concerns.",
  "https_about_me_deeshachandra/https_about_me_legal_terms/content_14.html": "PLEASE NOTE THAT YOUR USE OF AND ACCESS TO OUR SERVICES (DEFINED BELOW) ARE SUBJECT TO THE FOLLOWING TERMS; IF YOU DO NOT AGREE TO ALL OF THE FOLLOWING, YOU MAY NOT USE OR ACCESS THE SERVICES IN ANY MANNER.\nTerms of Use\nEffective date: June 7, 2018\nWelcome to About.me. Please read on to learn the rules and restrictions that govern your use of our website(s), products, services and applications (the “Services”). If you have any questions, comments, or concerns regarding these terms or the Services, please contact us at [email protected].\nThese Terms of Use (the “Terms”) are a binding contract between you and About.me, Inc. (“About.me,” “we” and “us”). You must agree to and accept all of the Terms, or you don’t have the right to use the Services. Your using the Services in any way means that you agree to all of these Terms, and these Terms will remain in effect while you use the Services. These Terms include the provisions in this document, as well as those in the Privacy Policy and Copyright Dispute Policy.\nWill these Terms ever change?\nWe are constantly trying to improve our Services, so these Terms may need to change along with the Services. We reserve the right to change the Terms at any time, but if we do, we will bring it to your attention by placing a notice on the About.me website, by sending you an email, and/or by some other means.\nIf you don’t agree with the new Terms, you are free to reject them; unfortunately, that means you will no longer be able to use the Services. If you use the Services in any way after a change to the Terms is effective, that means you agree to all of the changes.\nExcept for changes by us as described here, no other amendment or modification of these Terms will be effective unless in writing and signed by both you and us.\nWhat about my privacy?\nAbout.me takes the privacy of its users very seriously. For the current About.me Privacy Policy, please click here.The Children’s Online Privacy Protection Act (“COPPA”) requires that online service providers obtain parental consent before they knowingly collect personally identifiable information online from children who are under 13. You must be at least 16 years old to use the services. We do not knowingly collect or solicit personally identifiable information from children under 16; if you are a child under 16, please do not attempt to register for the Services or send any personal information about yourself to us. If we learn we have collected personal information from a child under 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us personal information, please contact us at [email protected].\nWhat are the basics of using About.me?\nAbout.me enables users to create a personal website (the “Website”) to provide information about who you are and what you do and to centralize your online presence. Certain Services we provide also enable you to engage with the end users of your Website (your “End Users”), such as booking appointments, sending messages, or capturing leads.\nWhen you sign up for an account, you must provide your email address and select a password and user name (“About.me User ID”). You promise to provide us with accurate, complete, and updated registration information about yourself. You may not select as your About.me User ID a name that you don’t have the right to use, or another person’s name with the intent to impersonate that person. You may not transfer your account to anyone else without our prior written permission.\nYou represent and warrant that you are an individual who is at least 16 years old. You will only use the Services for your own internal, personal use, and not on behalf of or for the benefit of any third party, and only in a manner that complies with all laws that apply to you. If your use of the Services is prohibited by applicable laws, then you aren’t authorized to use the Services. We can’t and won’t be responsible for your using the Services in a way that breaks the law.\nYou will not share your account or password with anyone, and you must protect the security of your account and your password. You’re responsible for any activity associated with your account.\nYour use of the Services is subject to the following additional restrictions:\nYou represent, warrant, and agree that you will not contribute any Content or User Submission (each of those terms is defined below) or otherwise use the Services or interact with the Services in a manner that:\n- Infringes or violates the intellectual property rights or any other rights of anyone else (including About.me); Violates any law or regulation, including any applicable export control laws;\n- Is harmful, fraudulent, deceptive, threatening, harassing, defamatory, obscene, or otherwise objectionable; Jeopardizes the security of your About.me account or anyone else’s (such as allowing someone else to log in to the Services as you);\n- Attempts, in any manner, to obtain the password, account, or other security information from any other user; Violates the security of any computer network, or cracks any passwords or security encryption codes;\n- Runs Maillist, Listserv, any form of auto-responder or “spam” on the Services, or any processes that run or are activated while you are not logged into the Services, or that otherwise interfere with the proper working of the Services (including by placing an unreasonable load on the Services’ infrastructure);\n- “Crawls,” “scrapes,” or “spiders” any page, data, or portion of or relating to the Services or Content (through use of manual or automated means);\n- Copies or stores any significant portion of the Content;\n- Decompiles, reverse engineers, or otherwise attempts to obtain the source code or underlying ideas or information of or relating to the Services.\nA violation of any of the foregoing is grounds for termination of your right to use or access the Services.\nWhat are my rights in About.me?\nThe materials displayed or performed or available on or through the Services, including, but not limited to, text, graphics, data, articles, photos, images, illustrations, User Submissions, and so forth (all of the foregoing, the “Content”) are protected by copyright and/or other intellectual property laws. You promise to abide by all copyright notices, trademark rules, information, and restrictions contained in any Content you access through the Services, and you won’t use, copy, reproduce, modify, translate, publish, broadcast, transmit, distribute, perform, upload, display, license, sell or otherwise exploit for any purpose any Content not owned by you, (i) without the prior consent of the owner of that Content or (ii) in a way that violates someone else’s (including About.me’s) rights.\nYou understand that About.me owns the Services. You won’t modify, publish, transmit, participate in the transfer or sale of, reproduce (except as expressly provided in this Section), create derivative works based on, or otherwise exploit any of the Services.\nThe Services may allow you to copy or download certain Content; please remember that just because this functionality exists, doesn’t mean that all the restrictions above don’t apply – they do!\nDo I have to grant any licenses to About.me or to other users?\nAnything you post, upload, share, store, or otherwise provide through the Services is your “User Submission.” Any User Submissions that you post to your Website will be publicly accessible. In order to display your User Submissions on the Services, and to allow other users to enjoy them, you grant us certain rights in those User Submissions. Please note that all of the following licenses are subject to our Privacy Policy to the extent they relate to User Submissions that are also your personally-identifiable information.\nFor all User Submissions, you hereby grant About.me a license to translate, modify (for technical purposes, for example making sure your content is viewable on an iPhone as well as a computer) and reproduce and otherwise act with respect to such User Submissions, in each case to enable us to operate the Services, as described in more detail below. This is a license only – your ownership in User Submissions is not affected.\nIf you store a User Submission in your own personal About.me account, in a manner that is not viewable by any other user except you (a “Personal User Submission”), you grant About.me the license above, as well as a license to display, perform, and distribute your Personal User Submission for the sole purpose of making that Personal User Submission accessible to you and providing the Services necessary to do so.\nIf you share a User Submission publicly on the Services (a “Public User Submission”), then you grant About.me the licenses above, as well as a license to display, perform, and distribute your Public User Submission for the purpose of making that Public User Submission publicly accessible to all visitors to your Website and providing the Services necessary to do so, as well as all other rights necessary to use and exercise all rights in that Public User Submission in connection with the Services and/or otherwise in connection with About.me’s business, provided that About.me will try to notify you if it uses your Public User Submission for any reason other than displaying it on the Services. Also, you grant all other users of the Services a license to access that Public User Submission, and to use and exercise all rights in it, as permitted by the functionality of the Services.\nIf you provide us (in a direct email or otherwise) with any feedback, suggestions, improvements, enhancements, and/or feature requests relating to the Service (“Feedback”), then you grant us a nonexclusive license to use, commercialize, exercise, and otherwise exploit the Feedback for any purpose.\nYou agree that the licenses you grant are royalty-free, perpetual, sublicenseable, irrevocable, and worldwide, provided that when you delete your About.me account, we will stop displaying your User Submissions to other users (if applicable), but you understand and agree that it may not be possible to completely delete that content from About.me’s records, and that your User Submissions may remain viewable elsewhere to the extent that they were copied or stored by other users.\nFinally, you understand and agree that About.me, in performing the required technical steps to provide the Services to our users (including you), may need to make changes to your User Submissions to conform and adapt those User Submissions to the technical requirements of connection networks, devices, services, or media, and the foregoing licenses include the rights to do so.\nWhat if I see something on the Services that infringes my copyright?\nYou may have heard of the Digital Millennium Copyright Act (the “DMCA”), as it relates to online service providers, like About.me, being asked to remove material that allegedly violates someone’s copyright. We respect others’ intellectual property rights, and we reserve the right to delete or disable Content alleged to be infringing, and to terminate the accounts of repeat alleged infringers; to review our complete Copyright Dispute Policy and learn how to report potentially infringing content, click here. To learn more about the DMCA, click here.\nWho is responsible for what I see and do on the Services?\nYour Website and your End Users are your responsibility. About.me has no control over, and assumes no responsibility for your Website or any interaction with your End Users. You agree that you will comply with all applicable laws and regulations related to your Website and your End Users. If you collect or process any personal information of your End Users or if you send marketing or other electronic communications to any End Users you must comply with all applicable data protection, security and privacy laws and regulations (including, where applicable, the EU General Data Protection Regulation). If applicable law requires, you must provide and make available to your End Users on Website a legally compliant privacy policy.\nAny information or content publicly posted or privately transmitted through the Services is the sole responsibility of the person from whom such content originated, and you access all such information and content at your own risk, and we aren’t liable for any errors or omissions in that information or content or for any damages or loss you might suffer in connection with it. We cannot control and have no duty to take any action regarding how you may interpret and use the Content or what actions you may take as a result of having been exposed to the Content, and you hereby release us from all liability for you having acquired or not acquired Content through the Services. We can’t guarantee the identity of any users with whom you interact in using the Services and are not responsible for which users gain access to the Services.\nYou are responsible for all Content you contribute, in any manner, to the Services, and you represent and warrant you have all rights necessary to do so, in the manner in which you contribute it. You will keep all your registration information accurate and current. You are responsible for all your activity in connection with the Services. The Services may contain links or connections to third party websites or services that are not owned or controlled by About.me. When you access third party websites or use third party services, you accept that there are risks in doing so, and that About.me is not responsible for such risks. We encourage you to be aware when you leave the Services and to read the terms and conditions and privacy policy of each third party website or service that you visit or utilize. About.me has no control over, and assumes no responsibility for, the content, accuracy, privacy policies, or practices of or opinions expressed in any third party websites or by any third party that you interact with through the Services. In addition, About.me will not and cannot monitor, verify, censor or edit the content of any third party site or service. By using the Services, you release and hold us harmless from any and all liability arising from your use of any third party website or service.\nYour interactions with organizations and/or individuals found on or through the Services, including payment and delivery of goods or services, and any other terms, conditions, warranties or representations associated with such dealings, are solely between you and such organizations and/or individuals. You should make whatever investigation you feel necessary or appropriate before proceeding with any online or offline transaction with any of these third parties. You agree that About.me shall not be responsible or liable for any loss or damage of any sort incurred as the result of any such dealings.\nIf there is a dispute between participants on this site, or between users and any third party, you agree that About.me is under no obligation to become involved. In the event that you have a dispute with one or more other users, you release About.me, its officers, employees, agents, and successors from claims, demands, and damages of every kind or nature, known or unknown, suspected or unsuspected, disclosed or undisclosed, arising out of or in any way related to such disputes and/or our Services. If you are a California resident, you shall and hereby do waive California Civil Code Section 1542, which says: “A general release does not extend to claims which the creditor does not know or suspect to exist in his or her favor at the time of executing the release, which, if known by him or her must have materially affected his or her settlement with the debtor.”\nWhat if I sell products or services or collect money through my Website?\nYou are solely responsible for all of all ecommerce activities you conduct through your Website, including your products and services, all applicable taxes and fees, compliance with the Payment Card Industry Data Security Standard (PCI DSS), and compliance with any applicable laws.\nWe are not involved in your relationships or transactions with any End User, customer or potential customer. You are responsible for resolving all support questions, comments, and complaints, including refunds, chargebacks, or pricing questions. You should provide contact information so that customers may contact you with questions or complaints. You are responsible for providing all products and services sold to your customers, and for fulfilling all promises, representations, or warranties you make to them in connection with a sale.\nWe may enable you to collect payment from your End Users via third party ecommerce payment processors through an integration with your Website. Payments from your End Users to you via such integration will be processed in accordance with the applicable payment processors’ terms and policies. Your End Users will submit their payment information directly to such payment processors. We don’t collect or store your End Users’ payment information.\nWill About.me ever change the Services?\nWe’re always trying to improve the Services, so they may change over time. We may suspend or discontinue any part of the Services, or we may introduce new features or impose limits on certain features or restrict access to parts or all of the Services. We’ll try to give you notice when we make a material change to the Services that would adversely affect you, but this isn’t always practical. Similarly, we reserve the right to remove any Content from the Services at any time, for any reason (including, but not limited to, if someone alleges you contributed that Content in violation of these Terms), in our sole discretion, and without notice.\nDoes About.me cost anything?\nThough many of our Services are currently free, we reserve the right to charge for certain or all Services in the future. You shall pay all applicable fees, as described on the About.me website in connection with such Services selected by you. About.me reserves the right to change its price list and to institute new charges at any time, upon notice to you, which may be sent by email or posted on the website. Your use of the Services following such notification constitutes your acceptance of any new or increased charges.\nPremium Services. If you choose to sign up for our premium services (the “Premium Services”), you will be charged an annual or monthly subscription fee, depending on the type of subscription you select. The subscription fee for the Premium Services (“Subscription Fee”) will be charged to you in advance as further described below. You may request a refund within three (3) days after we charge your Subscription Fee (including any renewal fees). Otherwise, Subscription Fees are non-refundable.\nAuto-Renewal for Premium Services. Your enrollment in the Premium Services will be automatically renewed and your Payment Method (defined below) will be charged every twelve (12) months if you choose to pay annually, or every one (1) month if you choose to pay monthly. If you wish to cancel auto-renewal of the Premium Services for the following year, you must cancel your plan in your Billing pane. You are eligible for a refund if you request one from About.me within three (3) days of your receipt of the auto-renewal charge. About.me may change the Subscription Fee upon notice to you, but such change will only take effect once your then-current Premium Services term has ended. If you do not wish to pay the new Subscription Fee, your only remedy shall be to cancel your enrollment in the Premium Services for the following year or month (depending on your type of subscription), prior to the expiration of your then-current Premium Services term. You may cancel your Premium Services subscription at any time, but again, refunds will only be granted if the user meets criteria outlined above.\nBilling. We use a third-party payment processor (the “Payment Processor”) to bill you through a payment account linked to your account on the Services (your “Billing Account”) for use of the Premium Services. The processing of payments will be subject to the terms, conditions and privacy policies of the Payment Processor in addition to these Terms. We are not responsible for error by the Payment Processor. By choosing to use Premium Services, you agree to pay us, through the Payment Processor, all charges at the prices then in effect for any use of such Premium Services in accordance with the applicable payment terms, and you authorize us, through the Payment Processor, to charge your chosen payment provider (for example, a credit or debit card you provide) (your “Payment Method”). You agree to make payment using that selected Payment Method. We reserve the right to correct any errors or mistakes that the Payment Processor makes even if it has already requested or received payment.\nPayment Method. The terms of your payment will be based on your Payment Method and may be determined by agreements between you and the financial institution, credit card issuer or other provider of your chosen Payment Method. If we, through the Payment Processor, do not receive payment from you, you agree to pay all amounts due on your Billing Account upon demand.\nReaffirmation of Authorization. Your non-termination or continued use of a Premium Service reaffirms that we are authorized to charge your Payment Method for that Premium Service. We may submit those charges for payment and you will be responsible for such charges. This does not waive our right to seek payment directly from you. Your charges may be payable in advance, in arrears, per usage, or as otherwise described when you initially selected to use the Premium Service (or as your payment terms may be amended thereafter).\nCurrent Information Required. You must provide current, complete and accurate information for your billing account. You must promptly update all information to keep your billing account current, complete and accurate (such as a change in billing address, credit card number, or credit card expiration date), and you must promptly notify us or our Payment Processor if your Payment Method is cancelled (e.g. for loss or theft) of if you become aware of a potential breach of security, such as the unauthorized disclosure or use of your username or password. Changes to such information can be made in your account settings. If you fail to provide any of the foregoing information, you agree that we may continue charging you for any use of Premium Services under your billing account unless you have terminated your Premium Services as set forth above.\nWhat if I want to stop using About.me?\nYou’re free to do that at any time, by deleting your account from your account settings pane or contacting us; please refer to our Privacy Policy, as well as the licenses above, to understand how we treat information you provide to us after you have stopped using our Services.\nAbout.me is also free to terminate (or suspend access to) your use of the Services or your account, for any reason in our discretion, including your breach of these Terms. About.me has the sole right to decide whether you are in violation of any of the restrictions set forth in these Terms.\nAccount termination may result in destruction of any Content associated with your account, so keep that in mind before you decide to terminate your account. We will try to provide advance notice to you prior to our terminating your account so that you are able to retrieve any important User Submissions you may have stored in your account (to the extent allowed by law and these Terms), but we may not do so if we determine it would be impractical, illegal, not in the interest of someone’s safety or security, or otherwise harmful to the rights or property of About.me.\nIf you have deleted your account by mistake, you can create another one at any time by visiting our homepage. Or, you can contact us at [email protected] – we will try to help, but unfortunately, we can’t promise that we can recover or restore anything.\nProvisions that, by their nature, should survive termination of these Terms shall survive termination. By way of example, all of the following will survive termination: any obligation you have to pay us or indemnify us, any limitations on our liability, any terms regarding ownership or intellectual property rights, and terms regarding disputes between us.\nWhat else do I need to know?\nWarranty Disclaimer. Neither About.me nor its licensors or suppliers makes any representations or warranties concerning any content contained in or accessed through the Services, and we will not be responsible or liable for the accuracy, copyright compliance, legality, or decency of material contained in or accessed through the Services. We (and our licensors and suppliers) make no representations or warranties regarding suggestions or recommendations of services or products offered or purchased through the Services. Products and services purchased or offered (whether or not following such recommendations and suggestions) through the Services are provided “AS IS” and without any warranty of any kind from About.me or others (unless, with respect to such others only, provided expressly and unambiguously in writing by a designated third party for a specific product). THE SERVICES AND CONTENT ARE PROVIDED BY ABOUT.ME (AND ITS LICENSORS AND SUPPLIERS) ON AN “AS-IS” BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR THAT USE OF THE SERVICES WILL BE UNINTERRUPTED OR ERROR-FREE. SOME STATES DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, SO THE ABOVE LIMITATIONS MAY NOT APPLY TO YOU.\nLimitation of Liability. TO THE FULLEST EXTENT ALLOWED BY APPLICABLE LAW, UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY (INCLUDING, WITHOUT LIMITATION, TORT, CONTRACT, STRICT LIABILITY, OR OTHERWISE) SHALL ABOUT.ME (OR ITS LICENSORS OR SUPPLIERS) BE LIABLE TO YOU OR TO ANY OTHER PERSON FOR (A) ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY KIND, INCLUDING DAMAGES FOR LOST PROFITS, LOSS OF GOODWILL, WORK STOPPAGE, ACCURACY OF RESULTS, OR COMPUTER FAILURE OR MALFUNCTION, OR (B) ANY AMOUNT, IN THE AGGREGATE, IN EXCESS OF THE GREATER OF (I) $100 OR (II) THE AMOUNTS PAID BY YOU TO ABOUT.ME IN CONNECTION WITH THE SERVICES IN THE TWELVE (12) MONTH PERIOD PRECEDING THIS APPLICABLE CLAIM, OR (C) ANY MATTER BEYOND OUR REASONABLE CONTROL. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO THE ABOVE LIMITATION AND EXCLUSIONS MAY NOT APPLY TO YOU.\nIndemnity. To the fullest extent allowed by applicable law, You agree to indemnify and hold About.me, its affiliates, officers, agents, employees, and partners harmless from and against any and all claims, liabilities, damages (actual and consequential), losses and expenses (including attorneys’ fees) arising from or in any way related to any third party claims relating to (a) your use of the Services (including any actions taken by a third party using your account), and (b) your violation of these Terms. In the event of such a claim, suit, or action (“Claim”), we will attempt to provide notice of the Claim to the contact information we have for your account (provided that failure to deliver such notice shall not eliminate or reduce your indemnification obligations hereunder).\nAssignment. You may not assign, delegate or transfer these Terms or your rights or obligations hereunder, or your Services account, in any way (by operation of law or otherwise) without About.me’s prior written consent. We may transfer, assign, or delegate these Terms and our rights and obligations without consent.\nChoice of Law; Arbitration. These Terms are governed by and will be construed under the laws of the State of California, without regard to the conflicts of laws provisions thereof. Any dispute arising from or relating to the subject matter of these Terms shall be finally settled in San Francisco County, California, in English, in accordance with the Streamlined Arbitration Rules and Procedures of Judicial Arbitration and Mediation Services, Inc. (“JAMS”) then in effect, by one commercial arbitrator with substantial experience in resolving intellectual property and commercial contract disputes, who shall be selected from the appropriate list of JAMS arbitrators in accordance with such Rules. Judgment upon the award rendered by such arbitrator may be entered in any court of competent jurisdiction. Notwithstanding the foregoing obligation to arbitrate disputes, each party shall have the right to pursue injunctive or other equitable relief at any time, from any court of competent jurisdiction. For all purposes of these Terms, the parties consent to exclusive jurisdiction and venue in the state or federal courts located in, respectively, San Francisco County, California, or the Northern District of California. Any arbitration under these Terms will take place on an individual basis: class arbitrations and class actions are not permitted. YOU UNDERSTAND AND AGREE THAT BY ENTERING INTO THESE TERMS, YOU AND ABOUT.ME ARE EACH WAIVING THE RIGHT TO TRIAL BY JURY OR TO PARTICIPATE IN A CLASS ACTION.\nMiscellaneous. You will be responsible for paying, withholding, filing, and reporting all taxes, duties, and other governmental assessments associated with your activity in connection with the Services, provided that the About.me may, in its sole discretion, do any of the foregoing on your behalf or for itself as it sees fit. The failure of either you or us to exercise, in any way, any right herein shall not be deemed a waiver of any further rights hereunder. If any provision of these Terms is found to be unenforceable or invalid, that provision will be limited or eliminated, to the minimum extent necessary, so that these Terms shall otherwise remain in full force and effect and enforceable. You and About.me agree that these Terms are the complete and exclusive statement of the mutual understanding between you and About.me, and that it supersedes and cancels all previous written and oral agreements, communications and other understandings relating to the subject matter of these Terms. You hereby acknowledge and agree that you are not an employee, agent, partner, or joint venture of About.me, and you do not have any authority of any kind to bind About.me in any respect whatsoever. You and About.me agree there are no third party beneficiaries intended under these Terms.",
  "https_about_me_deeshachandra/https_about_me_legal_privacy_eu/content_8.html": "EU Residents\nLast Updated: June 7, 2018\nIf you are a resident of the European Union (“EU”), United Kingdom, Lichtenstein, Norway, or Iceland, you may have additional rights under the EU General Data Protection Regulation (the “GDPR”) with respect to your Personal Data, as outlined below.\nFor this GDPR Privacy Notice, we use the terms “Personal Data” and “processing” as they are defined in the GDPR, but “Personal Data” generally means information that can be used to individually identify a person, and “processing” generally covers actions that can be performed in connection with data such as collection, use, storage and disclosure. Company will be the controller of your Personal Data processed in connection with the Services.\nWhere applicable, this GDPR Privacy Notice is intended to supplement, and not replace, the Company’s Privacy Policy at https://about.me/privacy (the “Privacy Policy”). If there are any conflicts between this GDPR Privacy Notice and the Company’s Privacy Policy, the policy or portion that is more protective of Personal Data shall control to the extent of such conflict. If you have any questions about this notice or whether any of the following applies to you, please contact us at [email protected].\nWhat Personal Data Do We Collect From You? We collect Personal Data about you when you provide such information directly to us, when third parties such as our business partners or service providers provide us with Personal Data about you, or when Personal Data about you is automatically collected in connection with your use of our Services.\nInformation we collect directly from you: We receive Personal Data directly from you when you provide us with such Personal Data, including without limitation the following:\n- First and last name\n- Email address\n- Password\n- Username\n- Profile photograph\n- Location\n- Occupation\n- Biographical information, including interests, your education history, current employer\n- Your user content, for example, images, text, links to your social profile(s), and any other content you submit publicly on your About.me webpage (which can include Personal Data if you include Personal Data in such content)\nWhen you sign up for Premium Services, we also collect the following information:\n- Zip code\n- Domain username\n- Credit/debit card information\nInformation we receive from third party sources: Some third parties such as our business partners and service providers provide us with Personal Data about you, such as the following:\n- Automatically populated information. When you register for the Services, we may use a third-party contact enrichment service provider (such as Full Contact) to help us automatically populate certain information in your profile. Such service providers collect publicly available information about you from various sources, including your publicly accessible social media profiles. We use such information to pre-populate certain areas of your About.me webpage in order to facilitate the registration and set-up process. You can modify or delete any information that has been pre-populated.\n- Account information for third party services: If you interact with a third party service when using our Services, such as if you use a third party service to log-in to our Services (e.g., Facebook Connect or Twitter OAuth), the third party service will send us certain limited information about you, such as your name and email, to assist with the log-in and authentication process. The information we receive will depend on the policies and your account settings with the third party service.\nInformation we automatically collect when you use our Services: Some Personal Data is automatically collected when you use our Services, such as the following:\n- IP address\n- Device identifiers\n- Web browser information\n- Page view statistics\n- Browsing history\n- Usage information\n- Transaction information (e.g. transaction amount, date and time such transaction occurred)\n- Cookies and other tracking technologies (e.g. web beacons, pixel tags, SDKs, etc.) -- For more information, please review our Cookie Policy.\n- Location information (e.g. IP address, zip code)\n- Log data (e.g. access times, hardware and software information)\nHow Do We Use Your Personal Data? We process Personal Data to operate, improve, understand and personalize our Services. For example, we use Personal Data to:\n- Create and manage your account and Website\n- Temporarily save your registration information for up to 3 months if you do not complete the registration process to allow you to resume the process at a later date\n- Communicate with you about the Services\n- Provide certain features and integrations as part of the Services, including scheduling, calendar, and messaging features\n- Process subscription payments and other payments in connection with the Services\n- Contact you about Service announcements, updates or offers\n- Provide support and assistance for the Services\n- Personalize content and communications based on your preferences, including by customizing and curating the list of domains available for purchase\n- Research, develop, and improve our Services\n- Meet contract or legal obligations\n- Respond to user inquiries\n- Fulfill user requests\n- Comply with our legal or contractual obligations\n- Resolve disputes\n- Protect against or deter fraudulent, illegal or harmful actions\n- Enforce our Terms of Service\nWe will only process your Personal Data if we have a lawful basis for doing so. Lawful bases for processing include consent, contractual necessity and our “legitimate interests” or the legitimate interest of others, as further described below.\n- Contractual Necessity: We process the following categories of Personal Data as a matter of “contractual necessity”, meaning that we need to process the data to perform under our Terms of Service with you, which enables us to provide you with the Services. When we process data due to contractual necessity, failure to provide such Personal Data will result in your inability to use some or all portions of the Services that require such data.\n- First and last name\n- Email address\n- Username\n- Password\nWhen you sign up for Premium Services, we also process the following information:\n- Zip code\n- Domain username\n- Credit/debit card information\n- Legitimate Interest: We process the following categories of Personal Data when we believe it furthers the legitimate interest of us or third parties.\n- First and last name\n- Email address\n- Profile photograph\n- Location\n- Occupation\n- Biographical information\n- Your user content, for example, images, text, links to your social profile(s), and any other content you submit publically on your About.me webpage (which can include Personal Data if you include Personal Data in such content)\nWhen you sign up for Premium Services, we also process the following information:\n- Zip code\n- Domain username\n- Credit/debit card information\nExamples of these legitimate interests include:\n- Operation and improvement of our business, products and services\n- Marketing of our products and services\n- Provision of customer support\n- Research and development of products and services\n- Protection from fraud or security threats\n- Compliance with legal obligations\n- Completion of corporate transactions\n- Consent: In some cases, we process Personal Data based on the consent you expressly grant to us at the time we collect such data. When we process Personal Data based on your consent, it will be expressly indicated to you at the point and time of collection.\n- Other Processing Grounds: From time to time we may also need to process Personal Data to comply with a legal obligation, if it is necessary to protect the vital interests of you or other data subjects, or if it is necessary for a task carried out in the public interest.\nHow and With Whom Do We Share Your Data?\nWith your consent, we may share certain information you provide to About.me with Full Contact or similar service providers that assist us with prepopulating your account information. We will only share your information with such contact enrichment service providers if you expressly grant us the right to do so.\nWe share Personal Data with vendors, third party service providers and agents who work on our behalf and provide us with services related to the purposes described in this Privacy Policy or our Terms of Service. These parties include:\n- Payment processors\n- Fraud prevention service providers\n- Analytics service providers\n- Staff augmentation and contract personnel\n- Hosting service providers\n- Co-location service providers\n- Telecommunications service providers\n- Providers of user research tools\n- Providers of internal communication tools\nWe also share Personal Data when necessary to complete a transaction initiated or authorized by you or provide you with a product or service you have requested. In addition to those set forth above, these parties also include:\n- Other users (where you post information publicly or as otherwise necessary to effect a transaction initiated or authorized by you through the Services)\n- Social media services (if you interact with them through your use of the Services)\n- Third party business partners who you access through the Services\n- Other parties authorized by you\nWe also share Personal Data when we believe it is necessary to:\n- Comply with applicable law or respond to valid legal process, including from law enforcement or other government agencies\n- Protect us, our business or our users, for example to enforce our terms of service, prevent spam or other unwanted communications and investigate or protect against fraud\n- Maintain the security of our products and services\nWe also share information with third parties when you give us consent to do so.\nFurthermore, if we choose to buy or sell assets, user information is typically one of the transferred business assets. Moreover, if we, or substantially all of our assets, were acquired, or if we go out of business or enter bankruptcy, user information would be one of the assets that is transferred or acquired by a third party, and we would share Personal Data with the party that is acquiring our assets. You acknowledge that such transfers may occur, and that any acquirer of us or our assets may continue to use your Personal Information as set forth in this policy.\nHow Long Do We Retain Your Personal Data? We retain Personal Data about you for as long as you have an open account with us or as otherwise necessary to provide you Services. In some cases we retain Personal Data for longer, if doing so is necessary to comply with our legal obligations, resolve disputes or collect fees owed, or is otherwise permitted or required by applicable law, rule or regulation. Afterwards, we retain some information in a depersonalized or aggregated form but not in a way that would identify you personally.\nWhat Security Measures Do We Use? We seek to protect Personal Data using appropriate technical and organizational measures based on the type of Personal Data and applicable processing activity. For example, our Services and users’ Websites are protected by Secure Socket Layer (SSL). We encrypt user passwords and our infrastructure is protected in a private virtual cloud.\nPersonal Data of Children: As noted in the Terms of Use, we do not knowingly collect or solicit Personal Data from anyone under the age of 16. If you are under 16, please do not attempt to register for the Services or send any Personal Data about yourself to us. If we learn that we have collected Personal Data from a child under age 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us Personal Data, please contact us at [email protected].\nWhat Rights Do You Have Regarding Your Personal Data? You have certain rights with respect to your Personal Data, including those set forth below. For more information about these rights, or to submit a request, please email [email protected]. Please note that in some circumstances, we may not be able to fully comply with your request, such as if it is frivolous or extremely impractical, if it jeopardizes the rights of others, or if it is not required by law, but in those circumstances, we will still respond to notify you of such a decision. In some cases, we may also need to you to provide us with additional information, which may include Personal Data, if necessary to verify your identity and the nature of your request.\n- Access: You can request more information about the Personal Data we hold about you and request a copy of such Personal Data. You can also access certain of your Personal Data by emailing us at [email protected].\n- Rectification: If you believe that any Personal Data we are holding about you is incorrect or incomplete, you can request that we correct or supplement such data. You can also correct some of this information directly by editing your account at https://about.me/user/edit.\n- Erasure: You can request that we erase some or all of your Personal Data from our systems.\n- Withdrawal of Consent: If we are processing your Personal Data based on your consent (as indicated at the time of collection of such data), you have the right to withdraw your consent at any time. Please note, however, that if you exercise this right, you may have to then provide express consent on a case-by-case basis for the use or disclosure of certain of your Personal Data, if such use or disclosure is necessary to enable you to utilize some or all of our Services.\n- Portability: You can ask for a copy of your Personal Data in a machine-readable format. You can also request that we transmit the data to another controller where technically feasible.\n- Objection: You can contact us to let us know that you object to the further use or disclosure of your Personal Data for certain purposes, such as for direct marketing purposes.\n- Restriction of Processing: You can ask us to restrict further processing of your Personal Data.\n- Right to File Complaint: You have the right to lodge a complaint about Company’s practices with respect to your Personal Data with the supervisory authority of your country or EU Member State.\nTransfers of Personal Data: The Services are hosted and operated in the United States (“U.S.”) through Company and its service providers, and if you do not reside in the U.S., laws in the U.S. may differ from the laws where you reside. By using the Services, you acknowledge that any Personal Data about you, regardless of whether provided by you or obtained from a third party, is being provided to Company in the U.S. and will be hosted on U.S. servers, and you authorize Company to transfer, store and process your information to and in the U.S., and possibly other countries. You hereby consent to the transfer of your data as set forth herein.\nCompany is committed to the principles of the EU-U.S. Privacy Shield Framework set forth by the U.S. Department of Commerce regarding the collection and use of Personal Data transferred from the EU. These Principles are of (1) notice, (2) consent, (3) accountability for onward transfer, (4) security, (5) data integrity and purpose limitation, (6) access and (7) recourse, enforcement and liability with respect to all Personal Data received from within the EU in reliance on the Privacy Shield. The Privacy Shield Principles require that we remain potentially liable if any third party processing Personal Data on our behalf fails to comply with these Privacy Shield Principles (except to the extent we are not responsible for the event giving rise to any alleged damage). Company’s compliance with the Privacy Shield is subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission. For more information about the Privacy Shield Program, please visit www.privacyshield.gov.\nPlease contact us at [email protected] with any questions or concerns relating to the Privacy Shield. If you do not receive timely acknowledgment of your Privacy Shield-related complaint from us, or if we have not resolved your complaint, you may also resolve a Privacy Shield-related complaint through JAMS, an alternative dispute resolution provider located in the United States. You can visit https://www.jamsadr.com/file-an-eu-us-privacy-shield-or-safe-harbor-claim for more information or to file a complaint, at no cost to you. Under certain conditions, you may also be entitled to invoke binding arbitration for complaints not resolved by other means.\nWhat If You Have Questions Regarding Your Personal Data? If you have any questions about this GDPR Privacy Notice or our data practices generally, please contact us using the following information:\nEmail address for contact: [email protected]",
  "https_about_me_deeshachandra/https_about_me_user_edit_account_emailprefs/content_19.html": "Get started for free\nGet your page\nFeatures\nPricing\nHome\nFeatures\nPricing",
  "https_about_me_deeshachandra/https_about_me_legal/content_6.html": "PLEASE NOTE THAT YOUR USE OF AND ACCESS TO OUR SERVICES (DEFINED BELOW) ARE SUBJECT TO THE FOLLOWING TERMS; IF YOU DO NOT AGREE TO ALL OF THE FOLLOWING, YOU MAY NOT USE OR ACCESS THE SERVICES IN ANY MANNER.\nTerms of Use\nEffective date: June 7, 2018\nWelcome to About.me. Please read on to learn the rules and restrictions that govern your use of our website(s), products, services and applications (the “Services”). If you have any questions, comments, or concerns regarding these terms or the Services, please contact us at [email protected].\nThese Terms of Use (the “Terms”) are a binding contract between you and About.me, Inc. (“About.me,” “we” and “us”). You must agree to and accept all of the Terms, or you don’t have the right to use the Services. Your using the Services in any way means that you agree to all of these Terms, and these Terms will remain in effect while you use the Services. These Terms include the provisions in this document, as well as those in the Privacy Policy and Copyright Dispute Policy.\nWill these Terms ever change?\nWe are constantly trying to improve our Services, so these Terms may need to change along with the Services. We reserve the right to change the Terms at any time, but if we do, we will bring it to your attention by placing a notice on the About.me website, by sending you an email, and/or by some other means.\nIf you don’t agree with the new Terms, you are free to reject them; unfortunately, that means you will no longer be able to use the Services. If you use the Services in any way after a change to the Terms is effective, that means you agree to all of the changes.\nExcept for changes by us as described here, no other amendment or modification of these Terms will be effective unless in writing and signed by both you and us.\nWhat about my privacy?\nAbout.me takes the privacy of its users very seriously. For the current About.me Privacy Policy, please click here.The Children’s Online Privacy Protection Act (“COPPA”) requires that online service providers obtain parental consent before they knowingly collect personally identifiable information online from children who are under 13. You must be at least 16 years old to use the services. We do not knowingly collect or solicit personally identifiable information from children under 16; if you are a child under 16, please do not attempt to register for the Services or send any personal information about yourself to us. If we learn we have collected personal information from a child under 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us personal information, please contact us at [email protected].\nWhat are the basics of using About.me?\nAbout.me enables users to create a personal website (the “Website”) to provide information about who you are and what you do and to centralize your online presence. Certain Services we provide also enable you to engage with the end users of your Website (your “End Users”), such as booking appointments, sending messages, or capturing leads.\nWhen you sign up for an account, you must provide your email address and select a password and user name (“About.me User ID”). You promise to provide us with accurate, complete, and updated registration information about yourself. You may not select as your About.me User ID a name that you don’t have the right to use, or another person’s name with the intent to impersonate that person. You may not transfer your account to anyone else without our prior written permission.\nYou represent and warrant that you are an individual who is at least 16 years old. You will only use the Services for your own internal, personal use, and not on behalf of or for the benefit of any third party, and only in a manner that complies with all laws that apply to you. If your use of the Services is prohibited by applicable laws, then you aren’t authorized to use the Services. We can’t and won’t be responsible for your using the Services in a way that breaks the law.\nYou will not share your account or password with anyone, and you must protect the security of your account and your password. You’re responsible for any activity associated with your account.\nYour use of the Services is subject to the following additional restrictions:\nYou represent, warrant, and agree that you will not contribute any Content or User Submission (each of those terms is defined below) or otherwise use the Services or interact with the Services in a manner that:\n- Infringes or violates the intellectual property rights or any other rights of anyone else (including About.me); Violates any law or regulation, including any applicable export control laws;\n- Is harmful, fraudulent, deceptive, threatening, harassing, defamatory, obscene, or otherwise objectionable; Jeopardizes the security of your About.me account or anyone else’s (such as allowing someone else to log in to the Services as you);\n- Attempts, in any manner, to obtain the password, account, or other security information from any other user; Violates the security of any computer network, or cracks any passwords or security encryption codes;\n- Runs Maillist, Listserv, any form of auto-responder or “spam” on the Services, or any processes that run or are activated while you are not logged into the Services, or that otherwise interfere with the proper working of the Services (including by placing an unreasonable load on the Services’ infrastructure);\n- “Crawls,” “scrapes,” or “spiders” any page, data, or portion of or relating to the Services or Content (through use of manual or automated means);\n- Copies or stores any significant portion of the Content;\n- Decompiles, reverse engineers, or otherwise attempts to obtain the source code or underlying ideas or information of or relating to the Services.\nA violation of any of the foregoing is grounds for termination of your right to use or access the Services.\nWhat are my rights in About.me?\nThe materials displayed or performed or available on or through the Services, including, but not limited to, text, graphics, data, articles, photos, images, illustrations, User Submissions, and so forth (all of the foregoing, the “Content”) are protected by copyright and/or other intellectual property laws. You promise to abide by all copyright notices, trademark rules, information, and restrictions contained in any Content you access through the Services, and you won’t use, copy, reproduce, modify, translate, publish, broadcast, transmit, distribute, perform, upload, display, license, sell or otherwise exploit for any purpose any Content not owned by you, (i) without the prior consent of the owner of that Content or (ii) in a way that violates someone else’s (including About.me’s) rights.\nYou understand that About.me owns the Services. You won’t modify, publish, transmit, participate in the transfer or sale of, reproduce (except as expressly provided in this Section), create derivative works based on, or otherwise exploit any of the Services.\nThe Services may allow you to copy or download certain Content; please remember that just because this functionality exists, doesn’t mean that all the restrictions above don’t apply – they do!\nDo I have to grant any licenses to About.me or to other users?\nAnything you post, upload, share, store, or otherwise provide through the Services is your “User Submission.” Any User Submissions that you post to your Website will be publicly accessible. In order to display your User Submissions on the Services, and to allow other users to enjoy them, you grant us certain rights in those User Submissions. Please note that all of the following licenses are subject to our Privacy Policy to the extent they relate to User Submissions that are also your personally-identifiable information.\nFor all User Submissions, you hereby grant About.me a license to translate, modify (for technical purposes, for example making sure your content is viewable on an iPhone as well as a computer) and reproduce and otherwise act with respect to such User Submissions, in each case to enable us to operate the Services, as described in more detail below. This is a license only – your ownership in User Submissions is not affected.\nIf you store a User Submission in your own personal About.me account, in a manner that is not viewable by any other user except you (a “Personal User Submission”), you grant About.me the license above, as well as a license to display, perform, and distribute your Personal User Submission for the sole purpose of making that Personal User Submission accessible to you and providing the Services necessary to do so.\nIf you share a User Submission publicly on the Services (a “Public User Submission”), then you grant About.me the licenses above, as well as a license to display, perform, and distribute your Public User Submission for the purpose of making that Public User Submission publicly accessible to all visitors to your Website and providing the Services necessary to do so, as well as all other rights necessary to use and exercise all rights in that Public User Submission in connection with the Services and/or otherwise in connection with About.me’s business, provided that About.me will try to notify you if it uses your Public User Submission for any reason other than displaying it on the Services. Also, you grant all other users of the Services a license to access that Public User Submission, and to use and exercise all rights in it, as permitted by the functionality of the Services.\nIf you provide us (in a direct email or otherwise) with any feedback, suggestions, improvements, enhancements, and/or feature requests relating to the Service (“Feedback”), then you grant us a nonexclusive license to use, commercialize, exercise, and otherwise exploit the Feedback for any purpose.\nYou agree that the licenses you grant are royalty-free, perpetual, sublicenseable, irrevocable, and worldwide, provided that when you delete your About.me account, we will stop displaying your User Submissions to other users (if applicable), but you understand and agree that it may not be possible to completely delete that content from About.me’s records, and that your User Submissions may remain viewable elsewhere to the extent that they were copied or stored by other users.\nFinally, you understand and agree that About.me, in performing the required technical steps to provide the Services to our users (including you), may need to make changes to your User Submissions to conform and adapt those User Submissions to the technical requirements of connection networks, devices, services, or media, and the foregoing licenses include the rights to do so.\nWhat if I see something on the Services that infringes my copyright?\nYou may have heard of the Digital Millennium Copyright Act (the “DMCA”), as it relates to online service providers, like About.me, being asked to remove material that allegedly violates someone’s copyright. We respect others’ intellectual property rights, and we reserve the right to delete or disable Content alleged to be infringing, and to terminate the accounts of repeat alleged infringers; to review our complete Copyright Dispute Policy and learn how to report potentially infringing content, click here. To learn more about the DMCA, click here.\nWho is responsible for what I see and do on the Services?\nYour Website and your End Users are your responsibility. About.me has no control over, and assumes no responsibility for your Website or any interaction with your End Users. You agree that you will comply with all applicable laws and regulations related to your Website and your End Users. If you collect or process any personal information of your End Users or if you send marketing or other electronic communications to any End Users you must comply with all applicable data protection, security and privacy laws and regulations (including, where applicable, the EU General Data Protection Regulation). If applicable law requires, you must provide and make available to your End Users on Website a legally compliant privacy policy.\nAny information or content publicly posted or privately transmitted through the Services is the sole responsibility of the person from whom such content originated, and you access all such information and content at your own risk, and we aren’t liable for any errors or omissions in that information or content or for any damages or loss you might suffer in connection with it. We cannot control and have no duty to take any action regarding how you may interpret and use the Content or what actions you may take as a result of having been exposed to the Content, and you hereby release us from all liability for you having acquired or not acquired Content through the Services. We can’t guarantee the identity of any users with whom you interact in using the Services and are not responsible for which users gain access to the Services.\nYou are responsible for all Content you contribute, in any manner, to the Services, and you represent and warrant you have all rights necessary to do so, in the manner in which you contribute it. You will keep all your registration information accurate and current. You are responsible for all your activity in connection with the Services. The Services may contain links or connections to third party websites or services that are not owned or controlled by About.me. When you access third party websites or use third party services, you accept that there are risks in doing so, and that About.me is not responsible for such risks. We encourage you to be aware when you leave the Services and to read the terms and conditions and privacy policy of each third party website or service that you visit or utilize. About.me has no control over, and assumes no responsibility for, the content, accuracy, privacy policies, or practices of or opinions expressed in any third party websites or by any third party that you interact with through the Services. In addition, About.me will not and cannot monitor, verify, censor or edit the content of any third party site or service. By using the Services, you release and hold us harmless from any and all liability arising from your use of any third party website or service.\nYour interactions with organizations and/or individuals found on or through the Services, including payment and delivery of goods or services, and any other terms, conditions, warranties or representations associated with such dealings, are solely between you and such organizations and/or individuals. You should make whatever investigation you feel necessary or appropriate before proceeding with any online or offline transaction with any of these third parties. You agree that About.me shall not be responsible or liable for any loss or damage of any sort incurred as the result of any such dealings.\nIf there is a dispute between participants on this site, or between users and any third party, you agree that About.me is under no obligation to become involved. In the event that you have a dispute with one or more other users, you release About.me, its officers, employees, agents, and successors from claims, demands, and damages of every kind or nature, known or unknown, suspected or unsuspected, disclosed or undisclosed, arising out of or in any way related to such disputes and/or our Services. If you are a California resident, you shall and hereby do waive California Civil Code Section 1542, which says: “A general release does not extend to claims which the creditor does not know or suspect to exist in his or her favor at the time of executing the release, which, if known by him or her must have materially affected his or her settlement with the debtor.”\nWhat if I sell products or services or collect money through my Website?\nYou are solely responsible for all of all ecommerce activities you conduct through your Website, including your products and services, all applicable taxes and fees, compliance with the Payment Card Industry Data Security Standard (PCI DSS), and compliance with any applicable laws.\nWe are not involved in your relationships or transactions with any End User, customer or potential customer. You are responsible for resolving all support questions, comments, and complaints, including refunds, chargebacks, or pricing questions. You should provide contact information so that customers may contact you with questions or complaints. You are responsible for providing all products and services sold to your customers, and for fulfilling all promises, representations, or warranties you make to them in connection with a sale.\nWe may enable you to collect payment from your End Users via third party ecommerce payment processors through an integration with your Website. Payments from your End Users to you via such integration will be processed in accordance with the applicable payment processors’ terms and policies. Your End Users will submit their payment information directly to such payment processors. We don’t collect or store your End Users’ payment information.\nWill About.me ever change the Services?\nWe’re always trying to improve the Services, so they may change over time. We may suspend or discontinue any part of the Services, or we may introduce new features or impose limits on certain features or restrict access to parts or all of the Services. We’ll try to give you notice when we make a material change to the Services that would adversely affect you, but this isn’t always practical. Similarly, we reserve the right to remove any Content from the Services at any time, for any reason (including, but not limited to, if someone alleges you contributed that Content in violation of these Terms), in our sole discretion, and without notice.\nDoes About.me cost anything?\nThough many of our Services are currently free, we reserve the right to charge for certain or all Services in the future. You shall pay all applicable fees, as described on the About.me website in connection with such Services selected by you. About.me reserves the right to change its price list and to institute new charges at any time, upon notice to you, which may be sent by email or posted on the website. Your use of the Services following such notification constitutes your acceptance of any new or increased charges.\nPremium Services. If you choose to sign up for our premium services (the “Premium Services”), you will be charged an annual or monthly subscription fee, depending on the type of subscription you select. The subscription fee for the Premium Services (“Subscription Fee”) will be charged to you in advance as further described below. You may request a refund within three (3) days after we charge your Subscription Fee (including any renewal fees). Otherwise, Subscription Fees are non-refundable.\nAuto-Renewal for Premium Services. Your enrollment in the Premium Services will be automatically renewed and your Payment Method (defined below) will be charged every twelve (12) months if you choose to pay annually, or every one (1) month if you choose to pay monthly. If you wish to cancel auto-renewal of the Premium Services for the following year, you must cancel your plan in your Billing pane. You are eligible for a refund if you request one from About.me within three (3) days of your receipt of the auto-renewal charge. About.me may change the Subscription Fee upon notice to you, but such change will only take effect once your then-current Premium Services term has ended. If you do not wish to pay the new Subscription Fee, your only remedy shall be to cancel your enrollment in the Premium Services for the following year or month (depending on your type of subscription), prior to the expiration of your then-current Premium Services term. You may cancel your Premium Services subscription at any time, but again, refunds will only be granted if the user meets criteria outlined above.\nBilling. We use a third-party payment processor (the “Payment Processor”) to bill you through a payment account linked to your account on the Services (your “Billing Account”) for use of the Premium Services. The processing of payments will be subject to the terms, conditions and privacy policies of the Payment Processor in addition to these Terms. We are not responsible for error by the Payment Processor. By choosing to use Premium Services, you agree to pay us, through the Payment Processor, all charges at the prices then in effect for any use of such Premium Services in accordance with the applicable payment terms, and you authorize us, through the Payment Processor, to charge your chosen payment provider (for example, a credit or debit card you provide) (your “Payment Method”). You agree to make payment using that selected Payment Method. We reserve the right to correct any errors or mistakes that the Payment Processor makes even if it has already requested or received payment.\nPayment Method. The terms of your payment will be based on your Payment Method and may be determined by agreements between you and the financial institution, credit card issuer or other provider of your chosen Payment Method. If we, through the Payment Processor, do not receive payment from you, you agree to pay all amounts due on your Billing Account upon demand.\nReaffirmation of Authorization. Your non-termination or continued use of a Premium Service reaffirms that we are authorized to charge your Payment Method for that Premium Service. We may submit those charges for payment and you will be responsible for such charges. This does not waive our right to seek payment directly from you. Your charges may be payable in advance, in arrears, per usage, or as otherwise described when you initially selected to use the Premium Service (or as your payment terms may be amended thereafter).\nCurrent Information Required. You must provide current, complete and accurate information for your billing account. You must promptly update all information to keep your billing account current, complete and accurate (such as a change in billing address, credit card number, or credit card expiration date), and you must promptly notify us or our Payment Processor if your Payment Method is cancelled (e.g. for loss or theft) of if you become aware of a potential breach of security, such as the unauthorized disclosure or use of your username or password. Changes to such information can be made in your account settings. If you fail to provide any of the foregoing information, you agree that we may continue charging you for any use of Premium Services under your billing account unless you have terminated your Premium Services as set forth above.\nWhat if I want to stop using About.me?\nYou’re free to do that at any time, by deleting your account from your account settings pane or contacting us; please refer to our Privacy Policy, as well as the licenses above, to understand how we treat information you provide to us after you have stopped using our Services.\nAbout.me is also free to terminate (or suspend access to) your use of the Services or your account, for any reason in our discretion, including your breach of these Terms. About.me has the sole right to decide whether you are in violation of any of the restrictions set forth in these Terms.\nAccount termination may result in destruction of any Content associated with your account, so keep that in mind before you decide to terminate your account. We will try to provide advance notice to you prior to our terminating your account so that you are able to retrieve any important User Submissions you may have stored in your account (to the extent allowed by law and these Terms), but we may not do so if we determine it would be impractical, illegal, not in the interest of someone’s safety or security, or otherwise harmful to the rights or property of About.me.\nIf you have deleted your account by mistake, you can create another one at any time by visiting our homepage. Or, you can contact us at [email protected] – we will try to help, but unfortunately, we can’t promise that we can recover or restore anything.\nProvisions that, by their nature, should survive termination of these Terms shall survive termination. By way of example, all of the following will survive termination: any obligation you have to pay us or indemnify us, any limitations on our liability, any terms regarding ownership or intellectual property rights, and terms regarding disputes between us.\nWhat else do I need to know?\nWarranty Disclaimer. Neither About.me nor its licensors or suppliers makes any representations or warranties concerning any content contained in or accessed through the Services, and we will not be responsible or liable for the accuracy, copyright compliance, legality, or decency of material contained in or accessed through the Services. We (and our licensors and suppliers) make no representations or warranties regarding suggestions or recommendations of services or products offered or purchased through the Services. Products and services purchased or offered (whether or not following such recommendations and suggestions) through the Services are provided “AS IS” and without any warranty of any kind from About.me or others (unless, with respect to such others only, provided expressly and unambiguously in writing by a designated third party for a specific product). THE SERVICES AND CONTENT ARE PROVIDED BY ABOUT.ME (AND ITS LICENSORS AND SUPPLIERS) ON AN “AS-IS” BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR THAT USE OF THE SERVICES WILL BE UNINTERRUPTED OR ERROR-FREE. SOME STATES DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, SO THE ABOVE LIMITATIONS MAY NOT APPLY TO YOU.\nLimitation of Liability. TO THE FULLEST EXTENT ALLOWED BY APPLICABLE LAW, UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY (INCLUDING, WITHOUT LIMITATION, TORT, CONTRACT, STRICT LIABILITY, OR OTHERWISE) SHALL ABOUT.ME (OR ITS LICENSORS OR SUPPLIERS) BE LIABLE TO YOU OR TO ANY OTHER PERSON FOR (A) ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY KIND, INCLUDING DAMAGES FOR LOST PROFITS, LOSS OF GOODWILL, WORK STOPPAGE, ACCURACY OF RESULTS, OR COMPUTER FAILURE OR MALFUNCTION, OR (B) ANY AMOUNT, IN THE AGGREGATE, IN EXCESS OF THE GREATER OF (I) $100 OR (II) THE AMOUNTS PAID BY YOU TO ABOUT.ME IN CONNECTION WITH THE SERVICES IN THE TWELVE (12) MONTH PERIOD PRECEDING THIS APPLICABLE CLAIM, OR (C) ANY MATTER BEYOND OUR REASONABLE CONTROL. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO THE ABOVE LIMITATION AND EXCLUSIONS MAY NOT APPLY TO YOU.\nIndemnity. To the fullest extent allowed by applicable law, You agree to indemnify and hold About.me, its affiliates, officers, agents, employees, and partners harmless from and against any and all claims, liabilities, damages (actual and consequential), losses and expenses (including attorneys’ fees) arising from or in any way related to any third party claims relating to (a) your use of the Services (including any actions taken by a third party using your account), and (b) your violation of these Terms. In the event of such a claim, suit, or action (“Claim”), we will attempt to provide notice of the Claim to the contact information we have for your account (provided that failure to deliver such notice shall not eliminate or reduce your indemnification obligations hereunder).\nAssignment. You may not assign, delegate or transfer these Terms or your rights or obligations hereunder, or your Services account, in any way (by operation of law or otherwise) without About.me’s prior written consent. We may transfer, assign, or delegate these Terms and our rights and obligations without consent.\nChoice of Law; Arbitration. These Terms are governed by and will be construed under the laws of the State of California, without regard to the conflicts of laws provisions thereof. Any dispute arising from or relating to the subject matter of these Terms shall be finally settled in San Francisco County, California, in English, in accordance with the Streamlined Arbitration Rules and Procedures of Judicial Arbitration and Mediation Services, Inc. (“JAMS”) then in effect, by one commercial arbitrator with substantial experience in resolving intellectual property and commercial contract disputes, who shall be selected from the appropriate list of JAMS arbitrators in accordance with such Rules. Judgment upon the award rendered by such arbitrator may be entered in any court of competent jurisdiction. Notwithstanding the foregoing obligation to arbitrate disputes, each party shall have the right to pursue injunctive or other equitable relief at any time, from any court of competent jurisdiction. For all purposes of these Terms, the parties consent to exclusive jurisdiction and venue in the state or federal courts located in, respectively, San Francisco County, California, or the Northern District of California. Any arbitration under these Terms will take place on an individual basis: class arbitrations and class actions are not permitted. YOU UNDERSTAND AND AGREE THAT BY ENTERING INTO THESE TERMS, YOU AND ABOUT.ME ARE EACH WAIVING THE RIGHT TO TRIAL BY JURY OR TO PARTICIPATE IN A CLASS ACTION.\nMiscellaneous. You will be responsible for paying, withholding, filing, and reporting all taxes, duties, and other governmental assessments associated with your activity in connection with the Services, provided that the About.me may, in its sole discretion, do any of the foregoing on your behalf or for itself as it sees fit. The failure of either you or us to exercise, in any way, any right herein shall not be deemed a waiver of any further rights hereunder. If any provision of these Terms is found to be unenforceable or invalid, that provision will be limited or eliminated, to the minimum extent necessary, so that these Terms shall otherwise remain in full force and effect and enforceable. You and About.me agree that these Terms are the complete and exclusive statement of the mutual understanding between you and About.me, and that it supersedes and cancels all previous written and oral agreements, communications and other understandings relating to the subject matter of these Terms. You hereby acknowledge and agree that you are not an employee, agent, partner, or joint venture of About.me, and you do not have any authority of any kind to bind About.me in any respect whatsoever. You and About.me agree there are no third party beneficiaries intended under these Terms.",
  "https_about_me_deeshachandra/https_about_me_blowticious/content_20.html": "Niki I.\nArtist and Consultant in Washington, DC\nNiki I.\nArtist and Consultant in Washington, DC\nCiao! I am an artist and consultant currently living in Washington, DC.\nYou can click the button above to view my portfolio. If you’d like to get in touch, feel free to say hello through any of the social links below.",
  "https_about_me_deeshachandra/https_about_me_legal_privacy/content_12.html": "Privacy Policy\nEffective date: June 7, 2018\nWe at About.me, Inc. know you care about how your personal information is used and shared, and we take your privacy seriously. Please read the following to learn more about our Privacy Policy. By using or accessing the Services in any manner, you acknowledge that you accept the practices and policies outlined in this Privacy Policy, and you hereby consent that we will collect, use, and share your information in the following ways.\nRemember that your use of About.me’s Services is at all times subject to the Terms of Use, which incorporates this Privacy Policy. Any terms we use in this Policy without defining them have the definitions given to them in the Terms of Use.\nWhat does this Privacy Policy cover?\nThis Privacy Policy covers our treatment of personally identifiable information (“Personal Information”) that we gather when you are accessing or using our Services, but not to the practices of companies we don’t own or control, or people that we don’t manage. We also host and process certain content for our users. Our users tell us what to do with their content, and we follow their instructions. If you are an end user of one of our user’s webpages and want to know how a user handles your information, you should check the user’s privacy policy.\nWe gather various types of Personal Information from our users, as explained in more detail below, and we use this Personal Information internally in connection with our Services, including to personalize, provide, and improve our services, to allow you to set up a user account and profile, to contact you and allow other users to contact you, to fulfill your requests for certain products and services, and to analyze how you use the Services. In certain cases, we may also share some Personal Information with third parties, but only as described below.\nAs noted in the Terms of Use, we do not knowingly collect or solicit personal information from anyone under the age of 16. If you are under 16, please do not attempt to register for the Services or send any personal information about yourself to us. If we learn that we have collected personal information from a child under age 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us personal information, please contact us at [email protected].\nWill About.me ever change this Privacy Policy?\nWe’re constantly trying to improve our Services, so we may need to change this Privacy Policy from time to time as well, but we will alert you to changes by placing a notice on https://about.me, by sending you an email, and/or by some other means. Please note that if you’ve opted not to receive legal notice emails from us (or you haven’t provided us with your email address), those legal notices will still govern your use of the Services, and you are still responsible for reading and understanding them. If you use the Services after any changes to the Privacy Policy have been posted, that means you agree to all of the changes. Use of information we collect now is subject to the Privacy Policy in effect at the time such information is used.\nWhat Information does About.me Collect?\nInformation You Provide to Us:\nWe receive and store any information you knowingly provide to us. For example, through the registration process and/or through your account settings, we may collect Personal Information such as your name, email address, photo, occupation, location, biographical information, and third-party account (for example, your username for Facebook or other third party sites that you link to from your about.me page). If you sign in to the Services through a third party site or service, you understand certain information in those accounts, such as your name and email (“Third Party Account Information”) may be transmitted to us in connection with the log-in and authentication process. Certain information may be required to register with us or to take advantage of some of our features.\nWe may communicate with you if you’ve provided us the means to do so. For example, if you’ve given us your email address, we may send you promotional email offers on behalf of other businesses, or email you about your use of the Services. Also, we may receive a confirmation when you open an email from us. This confirmation helps us make our communications with you more interesting and improve our services. If you do not want to receive communications from us, please indicate your preference in your account settings, located at https://about.me/user/edit/account/emailprefs.\nInformation Collected Automatically\nWhen you register for the Services, we may use a third-party contact enrichment service provider (such as FullContact) to help us automatically populate certain information in your Website. Such service providers collect publicly available information about you from various sources, including your publicly accessible social media profiles. We use such information to pre-populate certain areas of your About.me Website in order to facilitate the registration, set-up process, and maintenance of your Website. You can modify or delete any information that has been pre-populated.\nWhenever you interact with our Services, we automatically receive and record information on our server logs from your browser or device, which may include your IP address, geolocation data, device identification, “cookie” information, the type of browser and/or device you’re using to access our Services, and the page or feature you requested. “Cookies” are identifiers we transfer to your browser or device that allow us to recognize your browser or device and tell us how and when pages and features in our Services are visited and by how many people. You may be able to change the preferences on your browser or device to prevent or limit your device’s acceptance of cookies, but this may prevent you from taking advantage of some of our features.\nIf you click on a link to a third party website or service, a third party may also transmit cookies to you. Again, this Privacy Policy does not cover the use of cookies by any third parties, and we aren’t responsible for their privacy policies and practices. Please be aware that cookies placed by third parties may continue to track your activities online even after you have left our Services, and those third parties may not honor “Do Not Track” requests you have set using your browser or device.\nWe may use this data to customize content for you that we think you might like, based on your usage patterns. We may also use it to improve the Services – for example, this data can tell us how often users use a particular feature of the Services, and we can use that knowledge to make the Services interesting to as many users as possible.\nInformation Collected From Other Websites and Do Not Track Policy\nThrough cookies we place on your browser or device, we may collect information about your online activity after you leave our Services. Just like any other usage information we collect, this information allows us to improve the Services and customize your online experience, and otherwise as described in this Privacy Policy. Your browser may offer you a “Do Not Track” option, which allows you to signal to operators of websites and web applications and services (including behavioral advertising services) that you do not wish such operators to track certain of your online activities over time and across different websites. Our Services do not support Do Not Track requests at this time, which means that we collect information about your online activity both while you are using the Services and after you leave our Services.\nWill About.me Share Any of the Personal Information it Receives?\nWe may share your Personal Information with third parties as described in this section:\nInformation that’s been de-identified. We may de-identify your Personal Information so that you are not identified as an individual, and provide that information to our partners. We may also provide aggregate usage information to our partners (or allow partners to collect that information from you), who may use such information to understand how often and in what ways people use our Services, so that they, too, can provide you with an optimal online experience. However, we never disclose aggregate usage or de-identified information to a partner (or allow a partner to collect such information) in a manner that would identify you as an individual person.\nAffiliated Businesses: In certain situations, businesses or third party websites we’re affiliated with may sell or provide products or services to you through or in connection with the Services (either alone or jointly with us). You can recognize when an affiliated business is associated with such a transaction or service, and we will share your Personal Information with that affiliated business only to the extent that it is related to such transaction or service. Examples of such services may include an integration with a third-party payment processor (such as PayPal) to enable you to collect payments through your Website or an integration with an email marketing platform (such as MailChimp) to assist with email marketing campaigns for your End Users. Integrations like these may require you to transmit certain information from your Service profile in order to access their functionality. We have no control over the policies and practices of third party websites or businesses as to privacy or anything else, so if you choose to take part in any transaction or service relating to an affiliated website or business, please review all such business’ or websites’ policies.\nAgents: We employ other companies and people to perform tasks on our behalf and need to share your information with them to provide products or services to you; for example, we may use a third-party email delivery service to send marketing and service-related emails on our behalf. Unless we tell you differently, our agents do not have any right to use the Personal Information we share with them beyond what is necessary to assist us. User Profiles and Submissions: Your user profile information, including your name, location, and any video or image content you upload to the Services will be publicly available. We may use such information to facilitate interaction with your End Users within the Services or address your request for our Services. For example, our Services enable you to communicate with your End Users through your Websites on the Services, allow your End Users to schedule meetings with you, and allow your End Users to sign up for a newsletter or similar communication through your Website. Please remember that any content you upload to your Website, along with any Personal Information or content that you voluntarily disclose online in a manner other users can view becomes publicly available, and can be collected and used by anyone.\nBusiness Transfers: We may choose to buy or sell assets, and may share and/or transfer customer information in connection with the evaluation of and entry into such transactions. Also, if we (or our assets) are acquired, or if we go out of business, enter bankruptcy, or go through some other change of control, Personal Information could be one of the assets transferred to or acquired by a third party.\nProtection of Company and Others: We reserve the right to access, read, preserve, and disclose any information that we reasonably believe is necessary to comply with law or court order; enforce or apply our Terms of Use and other agreements; or protect the rights, property, or safety of Company, our employees, our users, or others.\nIs Personal Information about me secure?\nYour account is protected by a password for your privacy and security. If you access your account via a third party site or service, you may have additional or different sign-on protections via that third party site or service. You must prevent unauthorized access to your account and Personal Information by selecting and protecting your password and/or other sign-on mechanism appropriately and limiting access to your computer or device and browser by signing off after you have finished accessing your account.\nWe endeavor to protect the privacy of your account and other Personal Information we hold in our records, but unfortunately, we cannot guarantee complete security. Unauthorized entry or use, hardware or software failure, and other factors, may compromise the security of user information at any time.\nWhat Personal Information can I access?\nThrough your account settings, you may access, and, in some cases, edit or delete the following information you’ve provided to us:\n- name and password\n- email address\n- location\n- occupation\n- biography, including your education history and current employer\n- interests\n- profile picture\n- user profile information, including text, images and videos you have uploaded to the site\nThe information you can view, update, and delete may change as the Services change. If you have any questions about viewing or updating information we have on file about you, please contact us at [email protected].\nUnder California Civil Code Sections 1798.83-1798.84, California residents are entitled to contact us to prevent disclosure of Personal Information to third parties for such third parties’ direct marketing purposes; in order to submit such a request, please contact us at [email protected]. California residents are entitled to ask us for a notice identifying the categories of Personal Information which we share with our affiliates and/or third parties for marketing purposes, and providing contact information for such affiliates and/or third parties. If you are a California resident and would like a copy of this notice, please submit a written request to: [email protected].\nWhat choices do I have?\nYou can always opt not to disclose information to us, but keep in mind some information may be needed to register with us or to take advantage of some of our features.\nYou may be able to add, update, or delete information as explained above. When you update information, however, we may maintain a copy of the unrevised information in our records. You may delete all of your data by deleting your account in the settings panel (https://about.me/user/edit/account). Alternatively, you may ask us to delete your page by contacting us at [email protected]. Some information may remain in our records after your deletion of such information from your account. We may use any aggregated data derived from or incorporating your Personal Information after you update or delete it, but not in a manner that would identify you personally.\nEU Residents\nIf you are a resident of the European Union (“EU”), United Kingdom, Lichtenstein, Norway, or Iceland, you may have additional rights under the EU General Data Protection Regulation (the “GDPR”). Please see our EU Privacy Policy available here https://about.me/legal/privacy/eu.\nWhat if I have questions about this policy?\nIf you have any questions or concerns regarding our privacy policies, please send us a detailed message to [email protected], and we will try to resolve your concerns.",
  "https_about_me_deeshachandra/https_about_me_signup_start/content_4.html": "Features\nPricing\nLog In\nHome\nFeatures\nPricing",
  "https_about_me_deeshachandra/https_about_me/content_9.html": "Freelancers and entrepreneurs use about.me to grow their audience and get more clients.\nCreate a page to present who you are and what you do in one link.\nProfessional\nTake control and centralize your online presence.\nAuthentic\nShowcase all of you—from your work to your passions.\nSimple\nEasy for your audience to learn about you, simple for you to set up.",
  "https_about_me_deeshachandra/https_about_me_pricing/content_7.html": "Pricing\nFree link\nabout.me/yourname\nbilled annually\nConnect a domain\nfor example, https://yourname.com\nFrequently Asked Questions\n- Which plan is best for me?\nLooking to have a personalized domain like yourname.me with a professional page to send people? You’ll want the Pro plan. It allows you to add a custom domain or map a domain you already own to your about.me page.\nWant to be able to capture leads, schedule appointments, or the ability to add photos or videos to your page? Pro is the plan for you.\nNot ready to make your business or personal brand official? Start out with the free about.me page. You’ll get a simple page and free about.me link, like about.me/yourname. That link will always be yours and you can upgrade later when you’re ready.\n- What domains are available to me?\nYou can use a domain you already have, or buy one from us. If you have a domain that you bought that one time just in case, and it’s been sitting there in your registrar just collecting dust (and an annual renewal fee for no return), you can now put it to good use! If you’d like to choose a fresh domain and not worry about all the technical complexities that go into managing your DNS, domains such as yourname.com, .me, .net, .technology, .cooking, .design, .photography, and more are available starting at $10 per year.\n- I already bought a domain. Can I map it to my about.me page?\nYes. With the Pro plan, you can map your domain, bought from a registrar like GoDaddy or Name.com, to your about.me page. Mapping a domain to your about.me page means that your domain will point to your about.me page instead of a different website, if you had one previously.\n- What is lead capture?\nGet new clients or build your email list by capturing email addresses. As a Pro user, you can use the lead capture Spotlight button that is integrated with the Google account of your choice. Choose from “Get notified” “Join my email list,” or “Sign up for my newsletter” as your Spotlight button and a Google spreadsheet will be created. Once someone enters their name and email address, it will be added to your spreadsheet so you can easily access your audiences’ email addresses at any time.\n- What is appointment scheduling?\nAs a Pro user, you can let people book meetings with you right from your page with the appointment scheduling Spotlight button that is integrated with your Google Calendar. Choose from “Book time with me,” “Schedule an appointment,” or “Let’s meet” as your Spotlight button and then set your weekly availability. Upon clicking your Spotlight button, page visitors will be able to select a time that works for them. Both you and the page visitor will receive Google Calendar invitations.\n- What is an email signature?\nAn email signature is a snapshot of your about.me page that is added to every email message you send so people can learn more about you.\nYour email signature can showcase your photo and will always include and link to your page via your free about.me link or custom domain, such as yourname.me.\n- Can I add more photos or videos to my page?\nWith the purchase of Pro, you can create a mini portfolio on your page. A preview of your portfolio will appear below your name and headline. When a visitor clicks on a thumbnail, your photos and videos will pop up in an overlay on your page. You can upload up to 30 photos and captions, snapshots of your product offerings, or videos of your work. Get creative!\nYou can also embed an intro video right on your page. When you showcase a video, visitors can get a better sense of who you are and what you do. Do you have a reel or a video that explains more about your work? Add it to your page!\n- What is a customizable Spotlight Button?\nYour Spotlight button gives you the power to have visitors take action on what’s most important to you. As a Pro user, you can customize your Spotlight button text and functionality. You can choose from “Ask me about…,” which allows visitors to message you from your page, or “Sign up for my…” which allows you to enter a link for the visitor to follow. Examples include “Ask me about social media” and “Sign up for my webinar.”\n- What does “remove about.me branding” mean?\nIt’s all about you. When you upgrade to Pro and use your new personalized domain, your page won’t show any about.me ads or the about.me logo.\n- Can I cancel my plan?\nYou can cancel your plan subscription in the Billing tab at any time. If you would like to request a refund, please see this article for more details about eligibility.\n- Why choose about.me over another service?\nabout.me is built specifically for freelancers, entrepreneurs, and side hustlers. With your personalized domain, a custom email signature, and our integrations, you can easily and quickly grow your audience or attract new clients. about.me makes it easy to manage your business by providing all of the necessary tools in one place. It’s simple, professional, and quick to set up.\n- What visitor details will I be able to see?\nAs a Pro user, you will have access to Google Analytics which gives you real data on your about.me page. This enables you to see what actions visitors take on your page, as well other behavior and audience data (including: how they found your page, where they are located, age, gender, and what language they speak). This will give you the power to market your personal brand to the right people.",
  "https_about_me_deeshachandra/https_about_me_legal_cookies/content_22.html": "Cookie Policy\nEffective: June 7, 2018\nPlease remember that your use of the Services is at all times subject to the Terms of Use and Privacy Policy, which incorporate this Cookie Policy. Any terms we use in this Cookie Policy without defining them have the definitions given to them in the Terms of Use and Privacy Policy.\nCookie Policy\nThe Services use cookies and similar technologies such as pixel tags, web beacons, clear GIFs, JavaScript, and local storage. Cookies are small files – usually consisting of letters and numbers – placed on your computer, tablet, phone, or similar device, when you use that device to visit a Site. We will refer to cookies and similar technologies simply as “Cookies” for the remainder of this Cookie Policy. We use cookies to enable our servers to recognize your web browser and tell us how and when you visit and otherwise use the Services through the internet, to analyze trends, and to learn about our user base.\nWe may combine non-personally identifiable information collected through cookies with other Personal Information that we have about you, for example, to tell us who you are or whether you have an account. We may also supplement the information we collect from you with information received from third parties in order to enhance our Services, or to offer you information that we believe may be of interest to you. Where we use Cookies to collect information that is personally identifiable, or that can become personally identifiable if we combine it with other information, the About.me Privacy Policy will apply in addition to this Cookie Policy.\nYou can control and/or delete cookies as you wish – for details, see aboutcookies.org. Most browsers have an option for turning off the cookie feature, which will prevent your browser from accepting new cookies, as well as (depending on the sophistication of your browser software) allowing you to decide on acceptance of each new cookie in a variety of ways. You can delete all cookies that are already on your computer and you can set most browsers to prevent them from being placed. If you do this, however, you may have to manually adjust some preferences every time you visit a site and some services and functionalities may not work. We strongly recommend that you leave cookies active, because they enable you to take advantage of the most attractive features of the Services.\nFurther information on cookies can be found at http://ec.europa.eu/ipg/basics/legal/cookies/index_en.htm, https://ico.org.uk/for-the-public/online/cookies/, and http://www.allaboutcookies.org/.\nPlease reference the chart and general description below to learn more about the kinds of cookies we use and for what purpose.\nWhat types of cookies do we use and for which purposes?\nWe use the following types of Cookies:\nCookie Name Purpose Duration Time Google Analytics Analytical and Third Party. Track and analyze behavior of users on the about.me site Indefinite Anonymous_id Analytical. For internal analytics to uniquely identify a user and track their actions on our site 1 year Session Cookie Functionality. Keep track of a user’s status for actions they may take during a session As long as the session continues Login Cookie Functionality. Maintain a user’s logged in state when they come back to the site Indefinite Visited Cookie Keep track of a user’s status for visiting certain pages Indefinite Is_User Cookie Customize the experience for a user or visitor to the site Indefinite Accepted_cookies Cookie Keep track of users who accepted cookies Indefinite Local Storage Keep track of profile information submitted in signup process (except credit card and password), check timezone for scheduling appointments, keep track of a user’s status for visiting certain pages Signup process set for 24 hours, others are indefinite Essential Cookies\nThese are cookies that are required to provide you with features or services that you have requested. For example, Cookies that enable you to log into secure areas of our site or use a shopping cart. Disabling these Cookies will encumber the Services’ performance and may make certain features and services unavailable.\nFunctionality Cookies\nThese Cookies are used to recognize you when you return to our Services. This enables us to personalize our content for you, greet you by name, and remember your preferences (for example, your choice of language or region).\nAnalytical Cookies\nThese Cookies allow us to understand how visitors use our site. This includes information about the number of visitors to the site, what pages visitors view on our site and how long visitors are viewing pages on the site.\nThird Party Cookies\nThese are Cookies placed by a third party on your device and may provide information to those third parties about browsing habits (including your visits to our Services, the pages you have visited and the links and advertisements you have clicked) that may help identify if certain services that such third parties provide are being used, identify your interests, retarget you and serve advertisements that are relevant to you. We do not have control or access to such Cookies.\nOpt-out options are also available on the websites of the Network Advertising Initiative (NAI), the Digital Advertising Alliance (DAA), and the European Digital Advertising Alliance (eDAA).\nSession Cookies and Persistent Cookies\nThe types of Cookies described above may be “session Cookies” which are temporary Cookies that are only stored on your device while you are visiting our site or “persistent Cookies” which are Cookies that are stored on your device for a period of time after you leave our site. The length of time a persistent Cookie stays on your device varies from Cookie to Cookie. We use persistent Cookies to store your preferences so that they are available for the next visit, and to keep a more accurate account of how often you visit our Services, how often you return, how your use of the Services may vary over time, and measure the effectiveness of advertising efforts. Through these Cookies, we may collect information about your online activity after you leave our Services. Just like any other usage information we collect, this information allows us to improve the Services and customize your online experience. Your browser may offer you a “Do Not Track” option, which allows you to signal to operators of websites and web applications and services (including behavioral advertising services) that you do not wish such operators to track certain of your online activities over time and across different websites. Our Services do not support Do Not Track requests at this time, which means that we collect information about your online activity both while you are using the Services and after you leave the Services.\nWhat is the Google Analytics Cookie and how is it used?\nOur Services use Google Analytics, a web analysis service provided by Google Inc. (“Google”) which is based on Cookie technology. The information generated by the Cookie is usually sent to a Google server in the USA, where it is stored. On behalf of About.me, Google will use the generated information to evaluate your use of the website, to compile reports on website activities, and to provide the website operator with additional services connected with website and Internet use. The IP address transmitted by your browser in connection with Google Analytics is not collated with other data by Google. To opt out of being tracked by Google Analytics across all websites visit http://tools.google.com/dlpage/gaoptout.\nCookie settings\nYou can decide whether or not to accept Cookies. One way you can do this is through your internet browser’s settings. To find our more information about Cookies, including information about how to manage and delete Cookies, please visit https://ico.org.uk/for-the-public/online/cookies/ or http://www.allaboutcookies.org/.\nTo explore what Cookie setting are available to you, look in the “preferences” or “options” section of your browser’s menu.\nIf you have any queries regarding this Cookie Policy please contact us at [email protected].",
  "https_about_me_deeshachandra/https_about_me_welcome/content_11.html": "Make a name for yourself\nwith a page and a domain.\nFreelancers and entrepreneurs use about.me to grow their audience and get new clients.\nProfessional\nTake control and centralize your online presence.\nAuthentic\nShowcase all of you—from your work to your passions.\nSimple\nEasy for your audience to learn about you, simple for you to set up.",
  "https_about_me_deeshachandra/https_about_me_emailsignature/content_5.html": "The email signature that helps your audience and clients learn more about you.\nAdd to Gmail automatically\nAll it takes is one click to add your new email signature to any Gmail account, and keep it updated.\nInclude your photo\nInclude your photo in your email signature to make it memorable.\nUse it in your favorite app\nEasily paste your new email signature anywhere. It works with your favorite email client.\nGet the stats\nEach week you’ll get an email with the number of clicks your email signature is getting.\nPut your email signature to work\nGet 2x the page visits\nPut your link where it matters—in every email you send—and you’ll get double the page visits.\nGet 20% more responses\nLooking professional means having a link with your name in it. When people click that link in your email signature, they’re more likely to respond since they know more about you.\nMake it easy for your audience\nDon’t clutter your email signature—one link is all you need. Your about.me page will do the rest.\nThe about.me email signature is an excellent, highly effective strategy to sharing my brand and goals. Since setting it up, I’ve seen an increase in followers on my social sites, especially Instagram.\nTeacher, Volunteer, and Writer in Macomb, Michigan\nMike Lerchenfeldt\nabout.me/mikelerchenfeldt\nI have 4 websites, depending on what the client wants. Having my about.me page in my email signature, I’m condensing the number of sites I have.\nWriter, Editor, and Small Business Owner in Canada\nMichael A. Di Iorio\nabout.me/diiorio\nMy email signature used to be really long and confusing. I thought to myself, ‘Nobody is reading any of that!’ Now, I use my about.me email signature because it has my name and my one link where you can find everything. It’s important to attract people.\nArtist and Consultant in Washington, DC\nNiki I.\nabout.me/blowticious",
  "https_about_me_deeshachandra/https_about_me_features/content_3.html": "Features\n- Your about.me Page\n- Email Signature\n- Spotlight Button\n- Visit My Website\n- Lead Capture\n- Appointment Scheduling\n- Connect a Domain\n- Customize Search Results\n- Google Analytics\n- Testimonials\n- Contact Me\n- Portfolio\n- Video Embed\nYour about.me Page\nA simple, yet professional place to showcase\nwho you are and what you do.Email Signature\nAn email signature is a snapshot of your page\nthat is added to every email message you send.Spotlight Button\nYour Spotlight Button helps your visitors\ntake action on what’s most important to you.Visit My Website Spotlight Button\nGet more visits to your portfolio, blog, photos —\nanywhere you’d like to point people to.Lead Capture Spotlight Button\nBuild an email list right from your page\nwhen you connect your Google account.Compare Plans Appointment Scheduling Spotlight Button\nLet people book meetings with you right from your page\nwhen you connect your Google account.Compare Plans Connect a Domain\nAdd a secure, custom domain to your page.\nOr, map one you already own.Compare Plans Customize Search Results\nCustomize how your page appears in search engine results.\nCompare Plans Google Analytics\nGet live statistics about traffic to your page,\nand where visitors go from there.Compare Plans Testimonials\nEarn trust with your page visitors using endorsements from\nclients, past employers, or business partners.Compare Plans Contact Me Spotlight Button\nVisitors will be able to send you a message right from your page.\nCompare Plans Portfolio\nCreate a portfolio of images and videos\nto showcase you or your products or services.Compare Plans Video\nEmbed a video to showcase your products or services."
}