{
  "http_www_meghillier_com/https_www_meghillier_com_post_cladding/content_15.html": "Cladding\n- meghilliermp9\n- Oct 24, 2024\n- 1 min read\nUpdated: Nov 10, 2024\nSeven years since the Grenfell tragedy and many in Hackney still live in housing with unsafe cladding. Their lives are in limbo. I’ll keep fighting for faster action to fix this issue.",
  "http_www_meghillier_com/https_www_meghillier_com_post_creative-industries-and-ai/content_16.html": "Creative Industries and AImeghilliermp9Mar 261 min readUpdated: Mar 28Hackney is renowned for its creative industries. We must make sure that creators and copyright are protected with the rise of AI.",
  "http_www_meghillier_com/https_www_meghillier_com_post_december-january-monthly-report-1/content_22.html": "top of page\nHome\nAbout Meg\nContact\nNews\nHackney News\nMonthly Reports\nParliament News\nCommittee News\nWeekly News\nNews Archive\nWeekly News Archive\nAdvice Surgeries\nFAQs\nMore\nUse tab to navigate through the menu items.\nAll Posts\nWeekly Updates\nMonthly reports\nHackney\nParliament\nTreasury Select Committee\nSearch\nFebruary Monthly Report\nmeghilliermp9\nMar 6\n1 min read\nRead my February report\nhere\n.\nRecent Posts\nSee All\nApril Monthly Report\nMarch Monthly Report\nDecember/January Monthly Report\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_contact/content_2.html": "top of page\nCONTACT ME\nMeg aims to reply to all requests for assistance within 10 working days but sometimes, with very complex cases or at times of peak demand, it may occasionally take a little longer.\nFor enquiries on policy matters, we aim to respond within 10 working days but at busy times we prioritise personal cases and the response time for policy enquiries and write in campaigns can extend.\nIf you have not had a response to an enquiry, please call Meg’s office on 0207 219 5325.\nYou can view Meg's privacy policy here.\nWrite to Meg\nYou can write to me at: House of Commons London SW1A 0AA\nPhone Meg\nYou can phone or fax Meg Telephone: 020 7219 5325\nEmail Meg\nYou can email Meg on meg.hillier.mp@parliament.uk\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_advice-surgeries/content_28.html": "top of page\nADVICE SURGERIES\nI hold regular advice surgeries at Hackney Town Hall, between 10 and 12pm for constituents who would like to speak about their issues face-to face. This is a drop-in service, so no appointment is necessary.\nMy surgeries are for my constituents only. You can find out who your MP is by entering your postcode into this website: www.writetothem.com\nMy next surgery will be on Monday 12 May.\nRecent Posts\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_privacy-statement/content_35.html": "PRIVACY STATEMENT\nPersonal data\nUnder the EU’s General Data Protection Regulation (GDPR) personal data is defined as: “any information relating to an identified or identifiable natural person ('data subject'); an identifiable natural person is one who can be identified, directly or indirectly, in particular by reference to an identifier such as a name, an identification number, location data, an online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity of that natural person”.\nHow we use your information\nThis privacy notice tells you how Meg Hillier MP’s office will collect and use your personal data.\nWhy does Meg Hillier MP need to collect and store personal data?\nIn order for us to deal with casework for constituents, respond to policy enquiries, and to keep residents updated about campaigns and local issues we need to collect personal data. We are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy. The lawful basis for processing casework data has been identified as public interest. In terms of being contacted for marketing purposes/campaigning Meg Hillier MP’s office would contact you for additional consent. As a Labour MP, Meg also has access to other information which Meg Hillier MP’s office may use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/) for details of what information they hold, why, and how they use and process that information.\nWill Meg Hillier MP’s office share my personal data with anyone else?\nWe may pass your personal data on to third-party service providers in the course of dealing with you, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the purpose they were provided. When they no longer need your data to fulfil this service, they will dispose of the details in line with their procedures. Meg Hillier MP’s office contracts third parties to undertake work that involves our data: casework software maintenance, data entry, website hosting and maintenance, email management software and shredding. Our contractors are either EU based or based in countries deemed “adequate” by the EU for data protection terms. In all cases contractors and sub-contractors have signed contracts which guarantee that appropriate technical and organisational measures are in place to protect the data.\nHow will Meg Hillier MP’s office use the personal data it collects about me?\nMeg Hillier MP’s office will process (collect, store and use) the information you provide in a manner compatible with the EU’s General Data Protection Regulation (GDPR). We will endeavour to keep your information accurate and up to date, and not keep it for longer than is necessary. Meg Hillier MP’s office is required to retain information in accordance with the law, such as information needed for income tax and audit purposes. How long certain kinds of personal data should be kept may also be governed by specific requirements and agreed practices. Personal data may be held in addition to these periods depending on individual needs.\nUnder what circumstances will Meg Hillier MP’s office contact me?\nIn order to process casework it may be necessary to contact you in order to get further information from you or to feedback any responses we receive. If you have provided consent to be contacted about local campaigns and news we will contact you when required. You will always have the option of withdrawing consent. If you have contacted Meg Hillier MP about an issue she may, from time to time, send an update about that issue.\nPersonal data and the website of Meg Hillier MP\nOur website uses Google Analytics to track our visitors. This process uses Cookies to recognise returning visitors. For full terms of the Google Analytics process see http://www.google.com/analytics/en-GB/tos.html.\nCookiesA cookie is a tiny text file that is stored on your computer. We may use cookies in order to tailor your experience on our site according to the preferences you have specified.\nLinks to other websites\nThis website contains links to other websites. Meg Hillier MP is not responsible for the content or privacy practices of these websites.\nYour rights\nYou have a number of rights in relation to your personal data and the opportunity to choose how it is used.\nYou can:\nObtain copies of the personal data I hold about you (known as a “subject access request”)\nRequest that I correct or update any personal data held about you\nAsk that we erase or restrict the way in which I use your data\nRequest that personal data you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications form me in any medium at any time.\nAll requests to unsubscribe are dealt with promptly. If you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nThe Data Protection Officer\nOffice of Meg Hillier MP\nHouse of Commons\nWestminster\nSW1A 0AA\nEmail: meghilliermp@parliament.uk\nTelephone: 020 7219 5325\nAlternatively you have right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-weekly-round-up-friday-25-april-2025/content_9.html": "Meg's Weekly Round-Up: Friday 25 April 2025\n- hannahcastle6\n- Apr 25\n- 1 min read\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster.\nThis week\nThe Minister for Women and Equalities gave a statement on the Supreme Court ruling on the Equality Act.\nI met with the National Housing Federation to discuss cladding and service charges.\nThe Treasury Select Committee continued its inquiry into the Lifetime ISA.",
  "http_www_meghillier_com/https_www_meghillier_com_news-archive_meg's-weekly-round-up%3A-friday-26-july-2024/content_17.html": "top of page\nMeg's Weekly Round-Up: Friday 26 July 2024\nBlog entry\n26/07/24\nSee above for my weekly round-up of what I've been up to in Hackney and Westminster.\nbottom of page\nBlog entry\n26/07/24\nSee above for my weekly round-up of what I've been up to in Hackney and Westminster.",
  "http_www_meghillier_com/https_www_meghillier_com_about-meg/content_4.html": "ABOUT MEG\nMeg Hillier is the Member of Parliament for Hackney South and Shoreditch and Chair of the Treasury Select Committee. The committee examines the expenditure, administration and policy of HM Treasury, HM Revenue & Customs, and associated public bodies, including the Bank of England and the Financial Conduct Authority.\nMeg also chairs the Liaison Committee – a committee comprised of all select committee Chairs. It considers the overall work of select committees, promotes effective scrutiny of Government, and questions the Prime Minister.\nFrom 2015-2024, she was Chair of the Public Accounts Committee – the cross-party committee that scrutinises the value for money of public spending and holds the Government to account for the delivery of public services. First elected in 2005, Meg has been a Home Office Minister and Shadow Secretary of State for Energy and Climate Change.",
  "http_www_meghillier_com/https_www_meghillier_com_post_december-january-monthly-report/content_41.html": "top of page\nHome\nAbout Meg\nContact\nNews\nHackney News\nMonthly Reports\nParliament News\nCommittee News\nWeekly News\nNews Archive\nWeekly News Archive\nAdvice Surgeries\nFAQs\nMore\nUse tab to navigate through the menu items.\nAll Posts\nWeekly Updates\nMonthly reports\nHackney\nParliament\nTreasury Select Committee\nSearch\nDecember/January Monthly Report\nmeghilliermp9\nFeb 6\n1 min read\nRead my December/January report\nhere\n.\nRecent Posts\nSee All\nApril Monthly Report\nMarch Monthly Report\nFebruary Monthly Report\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_blog_categories_weekly-updates/content_25.html": "top of page\nNEWS\nWeekly Round-Up: Friday 2 May 2025\nSee here for what I've been up to in Hackney and Westminster this week.\n4 hours ago\nMeg's Weekly Round-Up: Friday 25 April 2025\nSee here for what I've been up to in Hackney and Westminster this week.\nApr 25\nMeg's Weekly Round-Up: Friday 11 April 2025\nSee here for what I've been up to in Hackney and Westminster this week.\nApr 11\nMeg's Weekly Round-Up: Friday 4 April 2025\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster. This week I met with campaigners, MPs and Ministers...\nApr 4\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_post_weekly-round-up-friday-2-may-2025/content_31.html": "Weekly Round-Up: Friday 2 May 2025\n- hannahcastle6\n- 5 minutes ago\n- 1 min read\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster.\nThis week\nThe Treasury Select Committee published its report on the acceptance of cash.\nI met with fintech organisations in Shoreditch.\nI visited Great Beyond Brewing in Haggerston, which houses a food bank drop-off point.",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-weekly-round-up-friday-21-march-2025-1/content_18.html": "Meg's Weekly Round-Up: Friday 21 March 2025\n- meghilliermp9\n- Mar 21\n- 1 min read\nUpdated: Mar 26\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster.\nThis week\nThe Government’s proposals to reform the welfare system\nMy question to ministers about tackling child poverty\nMy work with Diane Abbott MP, Hackney Council, and government officials on schools and school rolls in Hackney",
  "http_www_meghillier_com/https_www_meghillier_com_news-archive/content_5.html": "Home\nContact\nNews\nAdvice Surgeries\nFAQs\nMore\nFriday, 27 September 2024\nSee my monthly report for August and September 2024 here.\nFriday, 13 September 2024\nSee above for my weekly round-up of what I've been up to in Hackney and Westminster.\nFriday, 6 September 2024\nWednesday, 31 July 2024\nSee my Monthly Report for June and July 2024 here.\nFriday, 26 July 2024",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-hackney-gazette-column-impact-of-fire-on-residents/content_32.html": "Meg's Hackney Gazette Column: Impact of Fire on Residents\n- meghilliermp9\n- Dec 17, 2024\n- 2 min read\nIn June, 36 households lost their homes in a fire that tore through their building on Dalston Lane.\nResidents left their homes with only the clothes on their backs, many were barefoot. Thankfully, all residents escaped but the impact on their lives is significant. From the moment they ran to safety their lives have been on hold and their future uncertain.\nThe impact of a fire in the roof of this low-rise block is not just the fire and smoke damage but the water that has ruined most of what the flames did not reach.\nThe support in the days that followed was always going to be a challenge but the long-term impacts on those affected is not discussed enough. The aftermath of the Grenfell tragedy shone a light on the devastation for those who survive a catastrophic fire.\nThe costs are significant. Many people in Hackney South and Shoreditch do not have contents insurance, hoping the worst will never happen. On Dalston Lane some people had cancelled insurance because of the cost-of-living crisis.\nTheir experience since the fire underlines why I am campaigning for it to be a requirement for landlords to have a wider set of plans to help tenants in the aftermath of a fire or other crisis. After the immediate evacuation and support plan there also needs to be coordinated wider support to help people rebuild their lives.\nPeabody Housing has found every tenant somewhere to stay but ten are still living in temporary accommodation that is not self-contained or has limited cooking facilities – typically a hotel room.\nIn the immediate aftermath residents had to purchase clothing and basics. Even those who are insured or receiving subsidence support from Peabody have lost most of their belongings and will need to completely refurnish their homes when they move back in – still several months away. Some are now living outside Hackney so have travel costs to work and school. In many cases precious family photos have been damaged – to restore those that have not been destroyed is costly but represent a lifetime of memories.\nI am relieved that no one was hurt in this fire. But as well as supporting the residents affected I am determined that wider plans need to be a requirement for all landlords.\nIf you would like to help, you can donate here. A local church charity has agreed to administer the fund.",
  "http_www_meghillier_com/https_www_meghillier_com_post_march-monthly-report/content_3.html": "March Monthly Report\n- meghilliermp9\n- Apr 1\n- 12 min read\nHACKNEY'S HIDDEN GEM\nBig Lunch funding\nHackney Council is offering funding to support residents of council estates to take part in the community-building Big Lunch initiative. Bring together your neighbours to share food, friendship and fun on the weekend of 7 and 8 June. Hackney’s Housing Services’ resident participation team are offering people living in Hackney council homes the chance to apply for grants. You can apply for up to £750 to hold an event for all local residents. Applications for funding need to be made by Wednesday 30 April and must be made from a home managed by Hackney Council. For further information see here, and to apply see here.\nPARLIAMENT\nChanges to DWP payments\nThere has been much speculation about changes to welfare benefits – some of which is unfounded. I represent many disabled constituents, and I want to see them protected through the upcoming changes.\nThe Secretary of State for Work and Pensions, Liz Kendall MP, gave a statement to the House of Commons outlining the Government’s proposed changes and why they are needed – see here for her full statement. Some of the recent figures are concerning - one in eight young people are not in education, employment or training, and the Office for Budget Responsibility forecast that the number of working age people claiming Personal Independence Payment was set to more than double this decade from 2 million to 4.3 million.\nThe staff at Hackney Job Centre do a good job supporting vulnerable people, but more support is needed.\nThese reforms are aimed at helping those who want to work to do so and supporting and those who cannot work because of ill health or disability. Disabled people are too often excluded from the workplace and a lot needs to be done to support them into work.\nI will be looking closely at the detailed proposals (many of which are not finalised) because past experience of work programmes is that even the most successful ones help fewer than 10 per cent of people into work. A lot of people need specific health support and support from employers, so making sure there is a joined-up approach between the DWP, health services and employers is key to support people into work.\nThe reforms include investing £1 billion a year for work, health and skills to support people on pathways to work. The Government is scrapping the Work Capability Assessment and is reforming how assessments will be done entirely, including ending the undignified reassessments for those who will never be able to work. To improve security for those looking to try and work, these reforms will legislate a guarantee that starting a job in and of itself will never lead to someone being called for a reassessment – enshrining a right to try. This is alongside existing rules which allow people to try work and return to their old benefit without the need for reassessment if it doesn’t work out.\nThe Government is reforming parts of Universal Credit to protect those with the most severe conditions. The standard allowance will be increased above inflation – equating to a £775 cash increase per year by 29/30 for existing and new claimants. The health top up for new claims will be reduced from April 2026 but this will be alongside active support to help people back to health and work. I raised with the Secretary of State a question about the health top-up – see here.\nPersonal Independence Payments (PIP) are being reformed to focus on those with the greatest needs. Ensuring those who are unable to complete activities at all, or who require more help from others to complete them, still get support is the priority. This will mean some people with lower-level needs will no longer get PIP. This change will not happen overnight – it will apply to new claims and award reviews from November 2026 subject to parliamentary approval. The Secretary of State assured the House that she is not freezing PIP or making it means-tested.\nThese are just a few of the reforms being made – for full details, see the Government’s Green Paper here.\nThe Government is consulting on these proposals and is particularly interested to hear the views of disabled people and people with health conditions. I would urge you to share your views if you are able – the more information the Government receives, the better. You can find out more, and submit to the consultation, here. It is receiving submissions until 30 June.\nI know that the speculation around the reform to benefits has caused uncertainty and fear for many people. More clarity is needed. I raised this with the Minister – see here. Please be assured that for people who need benefits the most, the Government will ensure they are supported.\nChild poverty\nOne in two children in Hackney live in poverty after housing costs are taken into account. As the Government brings forward measures to tackle child poverty, I want to ensure that all families are supported. That’s why I pressed the Department for Work and Pensions Minister on this. You can hear my question and the Minister’s response here. I hosted a meeting in Parliament with child poverty groups about the Government’s child poverty task force.\nNHS England\nThe Government promised to reduce NHS waiting lists (there was a backlog of 7.6 appointments in July 2024). It set up pilots in a number of target areas of the country and these have all seen a drop in the appointments backlog month on month in the last five months – down by almost 200,000 in England since the Government was elected.\nThe Government wants to continue to improve the efficiency of the NHS. As part of this it has decided to absorb NHS England into the Department for Health and Social Care (DHSC). NHS England was established under the previous Government as an arm's length governing body for NHS services in England. The aim is to cut red tape for patients and staff. It is vital that the NHS can manage the extra money it was given in the last Budget to deliver the much-needed reform for patients. I pressed the Health Secretary on the need to improve procurement and he assured me that his reforms aim to reduce deficits and improve spending efficiency – see here to watch my question in full.\nSavers\nPrior to the Spring Statement there was a great deal of speculation about the future of cash ISAs (individual savings accounts). This is a saving account which is in a tax-free wrapper – which means that the holder never has to pay any tax on the interest earned. Currently you can save £20,000 a year in cash.\nMany Hackney residents live week to week, without the safety net of any savings. It can be very difficult to put money aside when you’re trying to make it stretch.\nFor people with a little cash to spare who save for their first home or to help their child at university the cash ISA is popular. The money saved is used by lenders to fund mortgages. Speculation that the cash limit would be reduced turned out to be just speculation. But it is important that we have a wider discussion about savings to support all households, but particularly the poorest to be more financially resilient. I pressed Treasury Ministers on their plans for this – see here for my question in full.\nThe Treasury Select Committee is conducting an inquiry into the Lifetime ISA which is a hybrid savings and pensions product – see here to follow its progress.\nAssisted dying\nA Bill which would legalise assisted dying has passed another parliamentary hurdle. Over the last months it has undergone scrutiny by a Committee which debated hundreds of amendments on issues surrounding capacity, mental illness, eligibility and domestic abuse. I am concerned that some of the safeguards in the initial bill have been dropped – significantly, the High Court stage has been replaced with a non-judicial multi-disciplinary panel – and proposals which could strengthen it were defeated. The Bill will have its report stage – where the Committee reports the newly amended Bill to the House and further amendments are debated – on 25 April. To follow the progress of the Bill, see here. I have tabled amendments that would prevent doctors from raising the subject of assisted dying before a patient and prevent any part of the process happening with an under-18.\nInternational Women’s Day\nThis Parliament has a record number of women MPs – 263, making up 40 per cent of the 650 MPs in the House of Commons. For On International Women’s Day, we met for a photograph to mark the moment. I was the 275th woman ever elected to the UK Parliament – between 1918 and 2024 only 693 women were elected. Both inside and outside Parliament there is a long way to go. In many areas of life, such as pensions and pay, women are still frequently less well off than men and this is even more stark when race and disability are taken into account.\nAI and creative copyright\nHackney is renowned for its creative industries, which contribute both to Hackney’s vibrant culture and to the local and national economy. With the rise of artificial intelligence, I am concerned about protecting creators’ copyright and remuneration. I am pressing Ministers to make sure creatives are protected and I raised this with the Secretary of State for Science, Innovation and Technology – see here.\nTREASURY SELECT COMMITTEE\nWork of the Payment Systems Regulator\nThe Committee heard evidence from the Payment Systems Regulator (PSR) the day after it was announced that it would be absorbed into the Financial Conduct Authority. The PSR has been a champion for consumers in instances of fraud – ensuring that banks pay up to £85,000 compensation if you are a victim of push-payment fraud. We are keen to see how consumers can continue to be protected in this merger – see here for details.\nFinancial Services and AI\nThe Committee is seeking evidence on the impact of how AI is being used, or could be, to support financial services. See here for more information and to submit to the inquiry. The deadline for submissions is Friday 11 April.\nCommittee Corridor Podcast\nCommittee Corridor is the podcast from Parliament which explores the work of Select Committees. I hosted the first two episodes of the new series - see here to listen.\nHACKNEY\nBike thefts\nSeveral residents have raised issues of bike theft with me in my doorstep surgeries. Hackney is a proud cycling borough, and we must ensure our bikes are protected. I am raising this with the police to find a way forward where we can reduce the number of bikes that are stolen in Hackney. If this has happened to you, please do get in touch with me.\nStop and Search Charter\nAfter consulting with Londoners and taking on recommendations from Baroness Casey’s 2023 review, the Metropolitan Police has announced a Stop and Search Charter aimed at improving the relationship between police officers and residents and ensuring stop and search is conducted fairly, respectfully and effectively. Many people, especially from black communities, have had bad experiences and this sours relations between communities and the police. This charter is a step in the right direction for rebuilding the public’s trust in the police through better training, implementation and complaints procedure. See the full charter here.\nLove Dalston shopfront award\nHackney is known for its bustling high streets, filled with local businesses that are integral to its culture and community. As one of our major shopping centres Dalston is home to many thriving businesses. To showcase businesses and celebrate everything Dalston has to offer, I have joined forces with the Hackney Gazette to launch a Love Dalston Shopfront Award. This is a competition where you can nominate your favourite shopfront, which makes it stand out from the crowd – it can be any type of business, as long as it is in Dalston. To nominate your favourite business, see here. The deadline for nominations is Friday 25 April and I will then present the winning business with an award.\nE-bikes\nElectric bikes are now a common form of travel in and around Hackney. Lime Bikes are particularly popular, and I have been liaising with Lime and Hackney Council about general e-bike safety and the introduction of more parking bays in the borough. While these bikes are great for encouraging more environmentally friendly ways to get around, some reckless cycling has worried residents.\nI am also concerned about the speed of e-bikes. I recently asked the Transport Minister to consider lower speed limits for e-bikes, so that they are safer for other residents. See here for the Minister’s response about the speed limit imposed for e-bikes. I am continuing to raise issues around these bikes with the Department.\nSamaritans\nI met with volunteers from the charity Samaritans to promote their campaign Small Talk Saves Lives. The group highlights that two in five of adults in the UK (44%) say they sometimes find themselves struggling to cope, and 67% of people in the UK we would appreciate someone checking on them, offering words of support, if they were struggling to cope. The campaign encourages us to reach out to those who are struggling by chatting to them.\nIf you or anyone you know is struggling and needs someone to talk to, please do contact the Samaritans by phoning 116 123 or see here for other ways to get in touch. If you would like to join in with all the great work that the Samaritans do, see here for information about volunteering.\nSwitch your energy meter\nConsumers with Radio Teleswitch Service (RTS)/Dynamic Teleswitch Service (DTS) energy meters are being urged to change to smart meters. By 30 June 2025, the RTS/DTS will be switched off as it is reaching the end of its operational life. The switch off will affect energy customers that have an RTS meter in their home and may mean that their heating and hot water supply stops functioning as normal.\nYou may have an RTS meter if:\nyour home has a separate switch box near your meter with a Radio Teleswitch label on it\nyour home is heated using electricity or storage heaters\nthere is no gas supply to your area, including high-rise flats\nyou get cheaper energy at different times of day, for example, you might be on an Economy 7, Economy 10, or Total Heat Total Control tariff.\nPlease do get in touch with your electricity supplier if you’re still not sure which meter is in your home – though be assured that, if you need to switch, your supplier should be in touch. See here for more information.\nFundraising five-a-side\nHoxton’s longstanding boys’ community club Crown and Manor are hosting a fundraising five-a-side football tournament. The day will be a way for budding local footballers to enjoy a morning of sport as well as securing sponsorship for the club. Crown and Manor want to expand to allow other groups to use the club’s facilities to serve Hackney’s community better, which will require investment in building maintenance. To donate to the fundraiser, see here. If you’d like to play, gather a team and sign up by emailing Ben Arojojoye at ben.arojojoye@outlook.com. Please also use this email if you would like to find out more. Event info:\nVenue: Haggerston School, Weymouth Terrace, London E2 8LS\nDate: Sunday, 18th May, 2025 Time: 9.30 am – 12.30pm\nVolunteer with a soup kitchen\nStorehouse, a local soup kitchen based in Haggerston, is looking for volunteer drivers. The Storehouse supports anyone who is homeless, vulnerable and unemployed in Hackney with food, clothing and other essential items. If you are interested in becoming a volunteer driver, you can contact Patsy and Errol Francis via email at storehouse20@gmail.com.\nHackney schools promote girls’ sport\nTwo Hackney schools, Ickburgh and Gayhurst, took part in the Biggest Ever Football Session, a national campaign event organised by the FA to encourage more women and girls into football. Schools across the country organised football sessions aimed at girls on the same day, promoting inclusivity and empowering girls into the sport. Research has shown that the number of girls taking part in sport drops as they get older due to lack of confidence, issues with PE kits and barriers such as periods [Youth Sport Trust]. It is so important that we value and support girls’ sport, so it is great to see these Hackney schools making that a priority.\nVE Day Art Competition\nHackney’s Speaker is holding a competition for art to commemorate the 80th anniversary of Victory in Europe Day on Thursday 8 May 2025. Pictures of creations related to the 80th anniversary of Victory in Europe Day are invited to be submitted, of art in any format. There will be prizes for the best three entries which will be announced by 5pm on Friday 2 May.\nThere are three categories for the competition:\n13-18 year olds\n7-12 year olds\n6 years olds and under\nThe winner in each category will win £40 in Amazon vouchers, with the runners up also receiving vouchers, and the top three entrants will have their work displayed in Hackney Town Hall and shared on the Council's social media. All winners will receive an invitation to an exclusive prize presentation reception taking place on Thursday 8 May from 3pm in the Speaker's Parlour at Hackney Town Hall, hosted by the Speaker and also attended by the Mayor and Deputy Lieutenant.\nSubmissions should be sent to speaker@hackney.gov.uk by 5pm, Thursday 1 May.\nDalston Cancer Research event\nCancer Research UK’s Cancer Awareness Roadshow will be coming to Hackney on 10 April at Ridley Road Market between 10am-4pm. Every year, the Cancer Awareness Roadshow sets off to talk to people about cancer. Cancer Awareness nurses will be there to talk about how small health changes can reduce cancer risks, provide information on spotting cancers early and will be available to have private conversations about any of your concerns.\nLearn more about healthcare\nA new podcast where doctor and Hackney resident Dr Brinda Christopher interviews healthcare professionals has recently launched. The podcast hopes to address public misconceptions about healthcare. See here for more information.\nHOW TO CONTACT ME\nVia email on meg.hillier.mp@parliament.uk or you can call me on 020 7219 5325. The main phone line is open Monday to Friday 10am to 5pm.\nVisiting Parliament and Prime Minister’s Questions\nTours of the Houses of Parliament can be arranged for groups of up to 20 people. Tours last up to 75 minutes and start between 9am and 12pm Monday to Wednesday, and between 9am-1:30pm and 3.30pm-5pm on Fridays.\nMPs are also given a very limited number of tickets for Prime Minister’s Questions. I operate a ballot system each month. The ballot is now open to attend PMQs in June.\nTo apply for a tour, or be entered onto the ballot, please send your name, and full postal address (you must live in Hackney South and Shoreditch) to meg.hillier.mp@parliament.uk.\nIf you would like to enter the PMQs ballot, please also supply a contact number. It is easier to arrange viewing tickets for other departmental question times or debates. To see what's on click here.",
  "http_www_meghillier_com/https_www_meghillier_com_post_christmas-opening-hours-and-useful-organisations/content_36.html": "Christmas Opening Hours and Useful Organisations\n- meghilliermp9\n- Dec 17, 2024\n- 2 min read\nPlease note that my office will be shut over the Christmas period from 1pm on Tuesday 24 December and will re-open on Thursday 2 January. During that time, emails and phones will not be monitored daily.\nFor urgent assistance during the Christmas period, please see below for a list of services that should be able to offer assistance.\nCouncil services\nThe Council has updated their Christmas period opening hours and has provided a list of emergency contacts, such as for emergency housing repairs, adult social care and homelessness and antisocial behaviour here.\nMental health support\nIf you are experiencing mental health problems you can contact City and Hackney Crisis Pathway Services 24 Hour Helpline on 020 8432 8020.\nSamaritans: call 116 123 for free or visit their website here.\nFind a local NHS urgent mental health helpline here.\nMental health guides to support and services here.\nUrgent housing and homelessness\nHackney Council: rough sleeping support click here.\nHackney Council: housing guide for single people click here. Call the Council’s helpline on 020 8356 2929 from 9.00am – 5.00pm or the emergency out of hours service on 020 8356 2300 from 6.00pm or by dropping into the Greenhouse centre.\nThe Greenhouse can be found at 19 Tudor Road, London, E9 7SN just off Mare Street.\nStreet link, which exists to help end rough sleeping by enabling members of the public to connect people sleeping rough with the local services that can support them. Find out more here.\nWarm welcome space: search for your closest warm space facility that can offer other services too, click here.\nShelter: housing advice click here.\nList of different organisations\nYou can search for many different types of services and organisations in Hackney, such as foodbanks on the Council’s website here.\nThe Hackney Foodbank website has links to a number of different organisations that provide information warm spaces, housing advice, debt advice and many more. Find out more here.",
  "http_www_meghillier_com/https_www_meghillier_com_news-archive_meg's-weekly-round-up%3A-friday-13-september-2024/content_30.html": "Home\nContact\nNews\nAdvice Surgeries\nFAQs\nMore\nBlog entry\n13/09/24\nSee above for my weekly round-up of what I've been up to in Hackney and Westminster.",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-hackney-gazette-column-shining-a-light-on-dalston/content_11.html": "Meg's Hackney Gazette Column: Shining a light on Dalston\n- meghilliermp9\n- Mar 27\n- 2 min read\nHackney is home to bustling high streets, filled with local businesses that are integral to its culture and community. It has long been a vibrant hub for independent businesses, art and innovation.\nI want to shine a light on a specific corner of Hackney, Dalston. From cafes to bars, music venues, and unique shops, there’s something for everyone in Dalston. Its rich history and popularity have been referenced in pop culture over the years, making it an iconic part of London.\nDalston’s businesses are at the heart of Hackney’s welcoming and inclusive community, and their survival promotes local employment and maintains the distinctive charm of Dalston.\nYet, local businesses have faced several threats over the years.\nThe covid pandemic had a devastating impact on small businesses and its effects are still felt today. Many shops had to close their doors and pull down the shutters for good. I don’t want to see any more shops go through the same scramble to stay afloat and eventually close.\nUnder 14 years of Tory Governments, we saw the decline of high streets across the country. I am proud that this Labour Government is committed to its plan to rejuvenate Britain’s high streets. This plan includes measures to reduce retail crime, level the playing field between online and high street businesses and tackle empty spaces.\nTo showcase businesses and celebrate everything Dalston has to offer, I am launching a ‘Love Dalston Shopfront Award’. This is a competition where you can nominate your favourite shopfront, which makes it standout from the crowd – it can be any type of business as long as it is in Dalston.\nYou can nominate the business by visiting bit.ly/4iMlI6n.\nLook out for posters in shops across Dalston where you can also scan the QR code to nominate them.\nThe deadline to submit your nominations is Friday 25 April and I will then present the winning business with an award.\nYou can do your bit to support Dalston’s businesses by shopping locally. Whether it’s doing the weekly shop or enjoying a meal at one of the area’s many restaurants, every purchase helps support the local economy.",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-weekly-round-up-friday-4-april-2025/content_33.html": "Meg's Weekly Round-Up: Friday 4 April 2025\n- meghilliermp9\n- Apr 4\n- 1 min read\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster.\nThis week\nI met with campaigners, MPs and Ministers to raise the issue of child poverty.\nI visited Hackney Jobcentre to hear their views on the proposals to reform social security.\nThe Treasury Select Committee quizzed the Chancellor on her Spring Statement.\nEducation Minister Stephen Morgan came to visit City Academy in Homerton to see their brilliant work supporting students with special educational needs and disabilities.",
  "http_www_meghillier_com/https_www_meghillier_com_post_dame-meg-hillier-mp-elected-chair-of-the-treasury-committee/content_40.html": "Dame Meg Hillier MP elected Chair of the Treasury Committee\n- meghilliermp9\n- Oct 3, 2024\n- 1 min read\nThe following was announced on the parliament.uk site on 9th September 2024.\n\"Dame Meg Hillier MP has been elected unopposed as Chair of the Treasury Committee. The result was announced in the Chamber by Mr Speaker.\nThe elected MP takes up their position as chair of the committee when the remaining members of the committee have been appointed by the House.\nThe new Chair, Dame Meg Hillier MP, said:\n“It is a privilege to become Chair of the Treasury Committee. I look forward to working with my fellow MPs to scrutinise the actions of this country’s most prominent financial institutions over the course of the next parliament.\n“During my nine-year tenure leading the Public Accounts Committee, I learned a thing or two about the mistakes governments can make with taxpayers’ money. I will work day-in and day-out, as Chair of the Treasury Committee, to ensure His Majesty’s Treasury and its affiliated public bodies are managing the public finances in the best interests of the British public.”",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-hackney-gazette-column-security-for-private-renters/content_19.html": "Meg's Hackney Gazette Column: Security for Private Renters\n- meghilliermp9\n- Feb 13\n- 2 min read\nEveryone should feel secure and comfortable in the place they call home. But this can be a real challenge for the one third of Hackney residents who live in privately rented accommodation.\nHigh costs, unexpected no-fault evictions, and unclear responsibilities for tenants and landlords can often lead to high stress and high anxiety situations for too many in Hackney. Add to this the loophole where landlords can demand multiple months of rent upfront to secure a property (which in Hackney, due to the high levels of rent, can be eye-watering sums of money), and many are left in an impossible situation.\nBut the Labour Government is stepping up and directly tackling these issues head-on through its new Renters’ Rights Bill. New provisions will mean landlords can only require a maximum of one month’s rent in advance. Section 21 ‘no-fault’ evictions - where tenants can be asked to leave without a provided reason – will be abolished. And there’s good news for animal-lovers: there will be a new right for tenants to house a pet that landlords cannot reasonably refuse.\nThere’s also the serious issue of unchecked, unsound properties being let out because desperate renters have nowhere else to go. Social housing already benefits from having minimum safety standards enshrined in law. But once this Bill becomes law, the private rental sector will also be bound by the Decent Homes Standard – a minimum standard for the condition of homes. It will also apply ‘Awaab’s Law’ to the sector - setting clear legal expectations about the timeframes within which landlords must take action to make homes safe where they contain serious hazards.\nIt will give renters safer, better, more secure homes.\nThe Bill is also good news for responsible landlords – it will make tenancy agreements more straightforward for everyone by creating a Private Rented Sector Database. This will help landlords understand their legal obligations and demonstrate compliance whilst also helping tenants to make informed decisions when entering into a tenancy agreement.\nThe Labour Government is wasting no time in delivering and driving up standards for Hackney’s private renters. This is part of a broader package of measures that will see radical reform to the housing sector, so everyone – not just renters - can have a safe and secure roof over their heads.",
  "http_www_meghillier_com/https_www_meghillier_com_copy-of-news-archive/content_24.html": "top of page\nWeekly News Archive\nMeg's Weekly Round-Up: Friday 13 September 2024\nFriday, 13 September 2024\nMeg's Weekly Round-Up: Friday 6 September 2024\nFriday, 6 September 2024\nMeg's Weekly Round-Up: Friday 26 July 2024\nFriday, 26 July 2024\nmeg's weekly round-up: Friday 19 July 2024\nFriday, 19 July 2024\nMeg's Weekly Round-Up: Friday 17 May 2024\nFriday, 17 May 2024\nMeg's Weekly Round-Up: Friday 10 May 2024\nFriday, 10 May 2024\nMeg's Weekly Round-Up: Friday 3 May 2024\nFriday, 3 May 2024\nMeg's Weekly Round-Up: Friday 26 April 2024\nFriday, 26 April 2024\nMeg's Weekly Round-Up: Friday 19 April 2024\nFriday, 19 April 2024\nMeg's Weekly Round-Up: Thursday 28 March 2024\nThursday, 28 March 2024\nMeg's Weekly Round-Up: Friday 22 March 2024\nFriday, 22 March 2024\nMeg's weekly round-up: Friday 8 March 2024\nFriday, 8 March 2024\nbottom of page",
  "http_www_meghillier_com/http_www_meghillier_com/content_1.html": "TREASURY SELECT COMMITTEE\n(Video credit: House of Commons)\nI chair the Treasury Select Committee, which examines the expenditure and policy of HM Treasury, HM Revenue and Customs and public bodies such as the Bank of England. See more in the video above.",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-weekly-round-up-friday-28-march-2025/content_20.html": "Meg's Weekly Round-Up: Friday 28 March 2025\n- meghilliermp9\n- Mar 28\n- 1 min read\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster.\nThis week\nThe Chancellor gave her Spring Statement, including plans for welfare reform. See here to submit to the consultation on these proposals.\nI raised the need to protect content creators with the rise of AI.\nI pressed Ministers on regulating speed for e-bikes.",
  "http_www_meghillier_com/https_www_meghillier_com_post_child-poverty/content_26.html": "Child Poverty\n- meghilliermp9\n- Mar 18\n- 1 min read\nOne in two children in Hackney live in poverty after housing costs are taken into account. As the Government brings forward measures to tackle child poverty, I want to ensure that all families are supported.",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-weekly-round-up-friday-7-march-2025/content_38.html": "Meg's Weekly Round-Up: Friday 7 March 2025\n- meghilliermp9\n- Mar 7\n- 1 min read\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster.\nThis week\nThe Governor of the Bank of England gave evidence about interest rates to the Treasury Select Committee.\nI asked Treasury Ministers about support for savers.\nI met with the Borough Police to discuss tackling anti-social behaviour.",
  "http_www_meghillier_com/https_www_meghillier_com_news-archive_august-and-september-2024-monthly-report/content_27.html": "Home\nContact\nNews\nAdvice Surgeries\nFAQs\nMore\nBlog entry\n27/09/24\nSee my monthly report for August and September 2024 here.",
  "http_www_meghillier_com/https_www_meghillier_com_blog/content_23.html": "top of page\nNEWS\nWeekly Round-Up: Friday 2 May 2025\nSee here for what I've been up to in Hackney and Westminster this week.\n20 hours ago\nMeg's Weekly Round-Up: Friday 25 April 2025\nSee here for what I've been up to in Hackney and Westminster this week.\nApr 25\nApril Monthly Report\nSee here for what I've been up to in Hackney and Westminster in April.\nApr 24\nMeg's Weekly Round-Up: Friday 11 April 2025\nSee here for what I've been up to in Hackney and Westminster this week.\nApr 11\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_post_social-housing/content_39.html": "Social Housingmeghilliermp9Jan 81 min readI raised with the Prime Minister Hackney’s desperate need for more social housing. Everyone deserves a safe and comfortable place to call home.",
  "http_www_meghillier_com/https_www_meghillier_com_blog_categories_hackney/content_8.html": "top of page\nNEWS\nMeg's Hackney Gazette Column: Shining a light on Dalston\nHackney is home to bustling high streets, filled with local businesses that are integral to its culture and community. It has long been a...\nMar 27\nMeg's Hackney Gazette Column: Security for Private Renters\nEveryone should feel secure and comfortable in the place they call home. But this can be a real challenge for the one third of Hackney...\nFeb 13\nChristmas Opening Hours and Useful Organisations\nPlease note that my office will be shut over the Christmas period from 1pm on Tuesday 24 December and will re-open on Thursday 2 January....\nDec 17, 2024\nMeg's Hackney Gazette Column: Impact of Fire on Residents\nIn June, 36 households lost their homes in a fire that tore through their building on Dalston Lane. Residents left their homes with only...\nDec 17, 2024\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_post_valerie-s-law/content_34.html": "Valerie's Law\n- meghilliermp9\n- Oct 10, 2024\n- 1 min read\nUpdated: Nov 10, 2024\nI again raised the need for Valerie’s Law in Parliament. Those who face domestic violence should all be treated with support and care regardless of ethnic or cultural background. I will continue to fight for justice for Valerie and her infant daughter.",
  "http_www_meghillier_com/https_www_meghillier_com_news-archive_june-and-july-2024-monthly-report/content_12.html": "Home\nContact\nNews\nAdvice Surgeries\nFAQs\nMore\nBlog entry\n31/07/24\nSee my Monthly Report for June and July 2024 here.",
  "http_www_meghillier_com/https_www_meghillier_com_blog_categories_parliament/content_6.html": "top of page\nNEWS\nCreative Industries and AI\nHackney is renowned for its creative industries. We must make sure that creators and copyright are protected with the rise of AI.\nMar 26\nChild Poverty\nOne in two children in Hackney live in poverty after housing costs are taken into account. As the Government brings forward measures to...\nMar 18\nSocial Housing\nI raised with the Prime Minister Hackney’s desperate need for more social housing. Everyone deserves a safe and comfortable place to call...\nJan 8\nCladding\nSeven years since the Grenfell tragedy and many in Hackney still live in housing with unsafe cladding. Their lives are in limbo. I’ll...\nOct 24, 2024\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_news-archive_meg's-weekly-round-up%3A-friday-6-september-2024/content_21.html": "Home\nContact\nNews\nAdvice Surgeries\nFAQs\nMore\nBlog entry\n06/09/24\nSee above for my weekly round-up of what I've been up to in Hackney and Westminster.",
  "http_www_meghillier_com/https_www_meghillier_com_post_meg-s-weekly-round-up-friday-11-april-2025/content_13.html": "Meg's Weekly Round-Up: Friday 11 April 2025\n- meghilliermp9\n- Apr 11\n- 1 min read\nSee above for my weekly round-up of what I’ve been up to in Hackney and Westminster.\nThis week\nThe Liaison Committee quizzed the Prime Minister about social security and tariffs.\nI raised the need for affordable social housing with the Deputy Prime Minister.\nI met with residents in London Fields and Homerton.",
  "http_www_meghillier_com/https_www_meghillier_com/content_14.html": "TREASURY SELECT COMMITTEE\n(Video credit: House of Commons)\nI chair the Treasury Select Committee, which examines the expenditure and policy of HM Treasury, HM Revenue and Customs and public bodies such as the Bank of England. See more in the video above.",
  "http_www_meghillier_com/https_www_meghillier_com_blog_categories_treasury-select-committee/content_37.html": "top of page\nHome\nAbout Meg\nContact\nNews\nHackney News\nMonthly Reports\nParliament News\nCommittee News\nWeekly News\nNews Archive\nWeekly News Archive\nAdvice Surgeries\nFAQs\nMore\nUse tab to navigate through the menu items.\nNEWS\nDame Meg Hillier MP elected Chair of the Treasury Committee\nThe following was announced on the parliament.uk site on 9th September 2024. \"Dame Meg Hillier MP has been elected unopposed as Chair of...\nOct 3, 2024\nbottom of page",
  "http_www_meghillier_com/https_www_meghillier_com_post_april-monthly-report/content_10.html": "April Monthly Report\n- hannahcastle6\n- Apr 24\n- 11 min read\nUpdated: Apr 25\nHACKNEY'S HIDDEN GEM\nGreat Beyond Brewing\nNestled in Haggerston, inside a railway arch on Union Walk, is one of Hackney’s many excellent independent craft breweries: Great Beyond Brewing. Founded by three beer loving friends and experienced brewers (Ollie, Nick and John), Great Beyond Brewing’s approach emphasises sustainability, community, and quality. As part of this, it is has teamed up with Hackney Foodbank and is hosting a food drive event on Saturday 26 April called A Can For A Can. In return for donating a can of food you’ll receive a free can of beer. And during the event, £1 from every pint sold of their bestsellers, Hoxton Lager and Hoxton Fresh, will be donated to Hackney Foodbank. And if you’re unable to make it on the day itself, Great Beyond Brewing is now a permanent donation point for Hackney Foodbank so you can pop anytime to donate some food.\nPARLIAMENT\nTemporary Accommodation\nIn Hackney more than 3000 households are in temporary accommodation. These include over 3700 children - enough to fill eight primary schools. As well as creating uncertainty for the families living there the cost of this kind of housing is also mounting. It’s intolerable that so many families and young people are living in limbo. Hackney Council is doing its best in difficult circumstances, but more needs to be done at a national level to help provide stable, healthy housing for these families. The Select Committee for Housing, Communities and Local Government recently announced its recommendations for Government action on temporary accommodation - see here. The severe lack of affordable housing is part of this problem. The Government has committed to building 1.5 million new homes this Parliament, and I am continually pressing to make sure this includes a significant amount of affordable housing. I most recently raised this with the Deputy Prime Minister – see here.\nChild poverty\nOne-in-two Hackney children live in poverty after housing costs are taken into account. Soon after the change in Government, the Prime Minister announced a taskforce to deliver an ambitious strategy to clamp down on child poverty. As part of this, I’ve been looking closely at the two-child benefit limit, which is the most cost-effective way to quickly and efficiently support children living in poverty. I've met with Ministers to raise this and co-hosted a briefing event for MPs with the Child Poverty Action Group, Save The Children, and academics to discuss the next best step forward. The Government has inherited a very difficult fiscal situation, tying its hands in what it is able to quickly do. But I’ll keep raising this issue and will keep a close eye on the child poverty taskforce, which is due to publish its report soon.\nHousing\nHackney has the second-highest number of buildings with cladding in London. The previous Government failed to adequately address cladding and related issues.\nLives are often put on hold and families are left in limbo as they face eye-watering insurance and service charge costs without being able to move on.\nThe current Government has announced the Remediation Acceleration Plan, a set of clear target dates for when building remediation needs to be completed and introducing tough penalties for those who do not meet the targets. This includes a deadline of the end of 2029 for all 18m+ (high-rise) buildings with unsafe cladding in a Government-funded scheme to be fixed, or developers with face severe penalties. By the same deadline, 11m+ buildings with unsafe cladding will either have been fixed or have a date for completion. If not, the landlords will be liable for severe penalties. I know that 2029 seems too far away, but at least there is now a clear timetable.\nCladding is a particularly big problem for social housing and housing associations. That’s why I met with the National Housing Federation, which represents housing associations in England, to discuss the ongoing challenges around building safety remediation.\nIf you would like to receive my email updates on cladding, please reply to this email.\nFor Women Scotland case\nThe Supreme Court has ruled on a definition of woman under the Equalities Act 2010. This Act is one of the previous Labour Government’s crowning achievements – it enshrines protections against discrimination on the basis of various protected characteristics, including sex and gender reassignment. However in recent years some have raised concerns about how sex is defined. In response to a Scottish case, the Supreme Court ruled that terms sex, man, and woman in the Equality Act 2010 refer to biological sex and that Gender Recognition Certificates do not redefine sex for the purposes of the Act.\nFor organisations that operate on a single-sex basis, this ruling does provide some clarity over what they can and can’t do. However, the ruling on its own has thrown up huge concerns about the impact on trans people and how they will be treated. I have been contacted by many people who feel scared and uncertain because of this ruling.\nAmidst this uncertainty it is vital that clear guidance is provided about how the Equality Act will be delivered. As it stands it already included provisions for what would happen if the rights of one group potentially clashed with the rights of others. I have pressed the Government on ensuring that clarity is provided as soon as possible – so that all people are supported and can go about their lives with dignity and respect. Hackney is a welcoming borough and we do not stand for hatred of any kind. I am following this issue closely and engaging with trans people and other groups in Hackney to ensure their voices are heard. See here for my question to the Minister for Women and Equalities.\nSELECT COMMITTEES\nLiaison Committee quizzes the Prime Minister\nI have the privilege of chairing the Liaison Committee, a supercommittee made up of the Chairs of the House of Commons Select Committee. The Committee has the opportunity to question the Prime Minister several times a year and he was in front of us in early April. See here for more information about the Committee’s work.\nSpring Statement\nI also chair the Treasury Select Committee, which examines the expenditure, administration and policy of HM Treasury, HM Revenue & Customs, and associated public bodies, such as the Bank of England. One of our responsibilities is holding the Chancellor to account. We heard evidence from economists and officials from the Office for Budget Responsibility, as well as from the Chancellor herself, about her Spring Statement. See here for more details.\nFiscal rules\nAs part of her Budget the Chancellor announced a commitment to new fiscal rules - restrictions on fiscal policy the Government sets itself to constrain its own decisions on spending and taxes. The Government has been firm in sticking to these rules so far, but the world has changed since the Chancellor announced her first Budget last Autumn. The tariffs introduced by President Trump and the escalation of the war in Ukraine have changed the global economic situation, and this has led to speculation as to the best way to manage taxpayers’ money. I asked the Chancellor what her plans were for her fiscal rules in light of the changing situation - see here.\nHACKNEY\nMinister visits Hackney school\nHackney has a high number of children with special educational needs and disabilities (SEND) and it is leading the way on inclusion and mainstreaming practices. City Academy in Homerton has been doing some fantastic work on inclusion for children with SEND and recently I joined Education Minister Stephen Morgan and the Mayor of Hackney to hear more about this. It is so important that every child feels valued and supported at school and it is great to see the Government wanting to learn from Hackney’s excellent example.\nRoyal Mail delays\nResidents have frequently been in touch with me about postal delays in Hackney. People often receive their post in one bulk delivery, including hospital letters. This is simply not good enough. I have raised this with Royal Mail. If you have been impacted by this situation and would like to be kept updated, please do let me know by emailing me at meghilliermp@parliament.uk.\nJobcentre visit\nIt was great to visit the team at Jobcentre Plus on Mare Street this month. I am always struck by the calm and supportive atmosphere in the building, and constituents often feed back to me how much help they have received from the team.\nWith the social security changes recently announced in the Government’s Pathways to Work Green Paper, it was a timely catch up on the work being done to support people, including those with health issues, into work. We discussed measures including training and upskilling, community outreach, and engagement with employers.\nHackney is a young borough, with over half of the population under 35 years old, and almost a third aged under 24. Post-covid, one in eight young people (16 to 24) in the UK are not in education, employment or training, which is a shocking statistic, with the likely impact clear – a cohort of people ‘left behind’ and facing significant hurdles in subsequent years. There is really good work being done in Hackney around support for young people, including job fairs, internships, work placements, training and mentoring.\nAs the consultation on the Green Paper proceeds, I will be monitoring the changes closely and feeding into government examples of the support measures that are proving effective in Hackney. You can submit to the consultation here.\nCan you help someone seeking a new job – donate your smart workwear\nClothing appropriate for job interviews and work can be expensive, and is a barrier for many people who are seeking a job. To tackle this need, several charities have initiatives to provide smart clothes for people who are unemployed to set them up well for job interviews. Only new or lightly worn clothes and shoes are accepted but contact the organisations for more information. Some nearby initiatives include\nDress for Success, a Camden charity offering outfits for unemployed women, free interview clothing and interview preparation and training as part of one appointment.\nSmart Works also offers free outfits for unemployed women.\nSuited & Booted provides clothes for unemployed men and women with a confirmed interview.\nCancer roadshow\nIt was good to visit Cancer Research’s Cancer Awareness Roadshow at Ridley Road earlier in the month, where volunteers spoke about preventing and spotting cancer with Hackney residents. The Government will announce the National Cancer Plan in the coming months and Cancer Research is developing recommendations to help Britain back to world-leading status on tackling cancer. See here to access Cancer Research’s awareness-raising resources. The Roadshow will be in Hackney again on 8 May, outside Marks and Spencer on Mare Street, so do pop along and you can privately discuss any health related concerns with a nurse or other member of the team.\nLove Dalston shopfront award\nHackney is known for its bustling high streets, filled with local businesses that are integral to its culture and community. As one of our major shopping centres Dalston is home to many thriving businesses. To showcase businesses and celebrate everything Dalston has to offer, I have joined forces with the Hackney Gazette to launch a Love Dalston Shopfront Award. This is a competition where you can nominate your favourite shopfront, which makes it stand out from the crowd – it can be any type of business, as long as it is in Dalston. To nominate your favourite business, see here.\nSmithfield and Billingsgate markets\nA Private Bill which would close Smithfield meat market in the City of London and Billingsgate fish market in Tower Hamlets has been laid in Parliament. Private Bills are a rare form of legislation where external organisations can propose bills to the House of Commons – see here for more information. The City of London is currently bound by law to provide these markets, but it wants to close them. It requires a change in the law in order to do this. However they have not guaranteed any provision for where the traders will go instead (a site in Dagenham which had been purchased and earmarked as a replacement for Billingsgate is now not going ahead). There are fishmongers in Hackney who will be affected by this decision. I know many businesses in East London rely on these markets – if you or your business will be affected by the proposed closures, please do let me know. I am working with other East London MPs to make sure that traders have alternative places to sell and to protect this important part of our city’s heritage.\nSchool closures\nA number of Hackney primary schools have seen a decline in pupil numbers due to a drop in the school age population. This trend is seen across London and has led to the closure of some schools which have unsustainably low intakes, including in Hackney. A summary of the Council’s School Estate Strategy on this issue can be found here.\nIt is very sad to lose a school and I have been working with parents, staff and the council to see if there was any prospect of a merger in place of a closure for St Dominic’s in Balance Road, Homerton. It is a difficult time for the school community but we are united in ensuring that the children and staff are supported. Sadly a combination of a drop in numbers and a large budget deficit means this is not possible. I am now in discussions about what will happen to the site (the Government has to agree, for example, if there is a change of use).\nHackney Council has put together a support package for parents, pupils and staff to support them through upcoming changes. See here for the handbook for parents and carers and here for FAQs for staff.\nSummer Hype fundraiser\nSummer Hype is a Hackney charity which runs a residential summer camp and leadership training programme for young people from Hackney. It is designed to help them to grow in confidence, resilience and aspiration and to be part of a positive, empowering community. From the age of 16, participants train to become leaders, ensuring that Summer Hype is peer-led. So far, 40 young people have graduated from Summer Hype's leadership training, becoming inspiring and relatable role models, leading Summer Hype's residential camps. I attended the most recent cohort’s graduation ceremony, and it was great to hear about the important impact that the course is having on so many young people. On 18 May a group of Summer Hype leaders and one of the founders will be running the Hackney Half to raise money for the charity. To find out more and donate to the fundraiser, see here.\nSantander branch closure\nSantander is closing its Mare Street branch (which was in the Narroway), It will close on 15 July 2025. It is disappointing to hear that Santander will be closing locally. Many people in our community rely on cash and face-to-face interactions, including elderly residents and disabled people. This is something the Public Accounts Committee looked into when I was Chair.\nThe Mare Street Santander team will be there to support customers until the branch closes. Support will also be available in other branches in Islington (15-17 Islington High Street, N1 9LQ) and Stratford (38 The Broadway, E15 4QN)\nSantander is working with LINK to make sure that the right customer support and cash services are still available for customers after this branch closes. For more information, please visit Santander’s Access to cash page.\nHappily Nationwide building society (which expanded only a couple of years ago) remains on the Narroway. We have seen NatWest and other banks close of the high street in recent years.\nThe Treasury Select Committee will be questioning the large banks and building societies in the coming weeks on a range of issues.\nThe loss of high street banking can reduce both access to cash and access for businesses to bank cash which in turn can reduce a business’s desire to accept cash.\nPost office on Kingsland High Street update\nThe Post Office directly manages 108 branches within its network of over 11,500 branches. As part of a wider restructuring of its directly managed branches, the Post Office had earmarked its directly managed branch on Kingsland High Street (120 Kingsland High St, E8 2NS) as at risk of closure. I urged the Government to ensure that Dalston would not miss out on post office services and pressed the Minister to ensure all services that are available at a directly managed branch will also be available at the replacement franchise branch. A franchise post office will now be operating either at or in close proximity to the closed directly managed branch and will host all the services that were previously available at the directly managed branch. These include passport applications, DVLA Photocard Renewals, SIA (Security Industry Authority) license applications, and foreign currency exchange.\nHOW TO CONTACT ME\nVia email on meg.hillier.mp@parliament.uk or you can call me on 020 7219 5325. The main phone line is open Monday to Friday 10am to 5pm.\nVisiting Parliament and Prime Minister’s Questions\nTours of the Houses of Parliament can be arranged for groups of up to 20 people. Tours last up to 75 minutes and start between 9am and 12pm Monday to Wednesday, and between 9am-1:30pm and 3.30pm-5pm on Fridays. MPs are also given a very limited number of tickets for Prime Minister’s Questions. I operate a ballot system each month. The ballot is now open to attend PMQs in July.\nTo apply for a tour, or be entered onto the ballot, please send your name, and full postal address (you must live in Hackney South and Shoreditch) to meg.hillier.mp@parliament.uk. If you would like to enter the PMQs ballot, please also supply a contact number. It is easier to arrange viewing tickets for other departmental question times or debates. To see what's on click here.",
  "http_www_meghillier_com/https_www_meghillier_com_faqs/content_7.html": "WELCOME TO THE FAQS PAGE\nThis page which has been designed to answer many of the most common questions I am asked. If there is something else that you think should be added to it or if you spot any broken links, please let me know by using the form here.\nWHAT DOES AN MP DO?\nMPs are elected to Parliament by the British, Irish and Commonwealth residents of a constituency. Following the 2017 General Election there are 650 constituencies in the UK. (533 of these are in England, 59 in Scotland, 40 in Wales and 18 In Northern Ireland).\nIn Parliament, MPs participate in debates and vote on proposed laws and other matters. Many MPs are also members of parliamentary committees that examine proposed laws or the work of individual government departments. Some will also have a role as a government minister or as an opposition spokesperson.\nMPs can help their constituents by taking up issues caused by Government departments and by representing local concerns in Parliament.\nIS MEG MY MP?\nYou can easily check by using the FindYourMP tool on the Parliamentary website. All you need to do is type your home postcode into the relevant box. The tool can be found here.\nCAN MEG HELP IF SHE IS NOT MY MP?\nNo, even if the problem you experienced happened in Hackney South and Shoreditch. Very strict rules dictate that MPs can only offer assistance to people who live in, and businesses that are located in, the constituency they represent. The FindYourMP tool will provide details for your MP and you should then make contact with him or her.\nWHY SHOULD I VOTE?\nIf you don’t vote, you have no influence over the way in which our country is run. People have fought and died for the right to vote and people in many other countries are still doing so. The more that people from all age and gender groups vote, the more that politicians will have to take account of their views. Also, voting only takes a few minutes and it is really easy to do. If you have never voted before, further information about how you can do so can be found here.\nHOW DO I REGISTER TO VOTE?\nIt’s easy. Just follow the link here. You can register at any time but there are cut off dates for individual elections. After registering your interest you will have to provide some further information so leave enough time. Once you are registered your name is on the electoral register and this can help your credit record.\nHOW CAN I CONTACT MEG?\nYou can email Meg at meg.hillier.mp@parliament.uk.\nYou can use the form here on Meg’s website.\nYou can write to Meg: Meg Hillier MP, House of Commons, Westminster, SW1A 0AA.\nYou can call Meg’s office from 10am to 5pm Monday-Friday on 0207 219 5325.\nYou can also come to one of Meg’s regular advice surgeries.\nWHAT PROBLEMS/ISSUES CAN MEG ASSIST ME WITH?\nMeg can primarily offer assistance with matters that Parliament and Central Government are responsible for. She will also try and help when a private company has caused problems to you.\nMeg is not elected to Hackney Council and has no direct control over the decisions that it makes on the various issues for which it has responsibility. These include council housing, refuse collection, education and planning decisions. For those issues you should contact your locally elected councillors in the first instance. They will be best placed to offer assistance. In Hackney you can find out who your councillors are by using the link here.\nMeg cannot intervene in ongoing legal disputes.\nHOW LONG WILL I USUALLY HAVE TO WAIT FOR A REPLY TO MY ENQUIRY?\nMeg receives many requests for help and assistance and tries, along with her caseworkers, to ensure that all work is dealt with as quickly as possible. All requests for help are looked at on receipt and urgent cases are prioritised whenever possible. Meg aims to reply to all requests for assistance within 10 working days but sometimes, with very complex cases or at times of peak demand, it may occasionally take a little longer. For enquiries on policy matters, we aim to respond within 10 working days but at busy times we prioritise personal cases and the response time for policy enquiries and write in campaigns can extend to 15 working days.\nIf you have not had a response to an enquiry, please call Meg’s office on 0207 219 5325.\nWHAT ACTIONS CAN MEG TAKE TO HELP ME WITH MY PROBLEM?\nMeg can write to senior officials or ministers in government departments and may lobby a minister personally when it is appropriate. Meg may also consider applying for a debate in the House of Commons or in Westminster Hall if the issue is one that needs to be raised more widely. If a lot of constituents feel strongly about an issue, they can organise a petition to Parliament which Meg can present on the floor of the House of Commons. Please contact Meg in advance as there are Parliamentary rules about how petitions are worded.\nWHAT IS AN ADVICE SURGERY?\nThese are opportunities for constituents with problems to come along and speak to Meg about personal issues or problems that they are experiencing. Meg and her caseworkers take details of the problems and will then make enquiries about them. Advice surgeries are only for constituents of Hackney South and Shoreditch.\nHOW DO I GET AN APPOINTMENT AT AN ADVICE SURGERY?\nMeg's surgeries are run on a \"drop-in\" basis - no appointments are required. You will be seen by Meg or or one of her caseworkers. Full details of Meg’s upcoming surgeries can be found here.\nIf you are not able to attend an advice surgery you can ring Meg’s office from 10am to 5pm Monday-Friday on 0207 219 5325.\nMeg also conducts roving surgeries and holds open coffee mornings regularly. These are advertised locally in advance.\nWHAT IS THE BEST WAY TO INVITE MEG TO AN EVENT?\nPlease send Meg an email or write to her at Meg Hillier MP, House of Commons, Westminster, SW1A 0AA. When sending an invite, please be as clear as possible about what the event is, where it will be and what times it will run from and to.\nHOW CAN I FIND OUT HOW MEG VOTED ON A PARTICULAR ISSUE?\nThe most user friendly option is the search function on the PublicWhip website. The same information is also available (in a less accessible form) on the website of Parliament.\nWHERE CAN I FIND DETAILS OF WHAT MEG HAS SAID IN THE HOUSE OF COMMONS?\nThe most user friendly option is the TheyWorkForYou.com website.\nThe same information is available at Parliament’s website.\nWHAT ARE EARLY DAY MOTIONS (EDMS) AND WHY DOESN’T MEG SIGN THEM?\nEarly Day Motions (EDMs) are supposed to be a formal request for a debate in the House of Commons. They rarely, if ever, actually lead to a debate though and there are several other ways in which MPs can seek time in the House of Commons or Westminster Hall to discuss issues. EDMs are therefore used mainly as a way of recording opinion on certain issues.\nMeg does not sign EDMs. Not only do EDMs cost a lot of money for what they achieve but many are calling for money to be spent. As Chair of the Treasury Select Committee Meg does not support spending commitments in this way. Meg prefers to lobby ministers or officials in person or in writing on the many issues constituents raise with her.\nFurther information on EDMs can be found here.\nWHERE CAN I FIND OUT MORE ABOUT MEG’S WORK ON THE TREASURY SELECT COMMITTEE?\nMeg has been the Chair of the Treasury Select Committee since 2024. This cross party Select Committee of MPs examines the expenditure, administration and policy of HM Treasury, HM Revenue & Customs, and associated public bodies, such as the Bank of England. The committee has its own website which allows access to the reports that it produces. You can find it here.\nWHERE CAN I FIND MORE INFORMATION ABOUT THE EXPENSES THAT MEG HAS CLAIMED FOR?\nFull information is available at the website of the Independent Parliamentary Standards Authority (IPSA). Please click here for further details.\nHOW DO I APPLY FOR A JOB WITH MEG?\nLike many MPs, Meg advertises vacant roles, when they arise, in the jobs section of the Working for an MP website. Please click here for further information.\nCAN I GET WORK EXPERIENCE IN MEG’S OFFICE?\nMeg will always consider requests for short periods of work experience from constituents who have a genuine interest in politics. However, the decision to accept or decline requests will depend on her schedule and space in the office. She wants to make sure that any work experience offered is worthwhile. Priority will be given to constituents. Meg will always offer, as a minimum, travel and lunch expenses. If you are interested, please email Meg’s office.\nWHERE CAN I FIND MORE INFORMATION ABOUT HOW PARLIAMENT WORKS?\nThere are many resources available on the internet and in books. A good source of information for younger readers is the website of Parliament’s Education Service, which can be found here. Older readers might want to start their research here.\nHOW CAN I APPLY FOR A TOUR OF PARLIAMENT?\nMeg is always happy to try and help to arrange a tour of Parliament for her constituents. These tours are free of charge when the House is sitting. Tours are very popular and are booked up many months in advance. Further information on MP booked tours of Parliament here.\nIf you would like Meg to arrange a tour of Parliament, please contact her via email.\nCommercial tours of Parliament are also run at weekends and when Parliament is in recess. The commercial tours can be personally guided as part of a group or with an audio headset. You can also book a commercial tour that includes an afternoon tea. Further details can be found here.\nHOW CAN I WATCH A HOUSE OF COMMONS DEBATE?\nMPs can often arrange for you to watch a debate in the House of Commons. Please contact Meg’s office directly with details of your requirements. Further information on watching debates can be found here. You can often get tickets just by queueing on the day, but not for popular sessions such as Prime Minister’s Question Time.\nHOW CAN I GET A TICKET FOR PRIME MINISTER’S QUESTIONS?\nThe Public Gallery for the House of Commons is very small. MPs receive a limited number of tickets for Prime Minister’s Questions each month. Meg operates a ballot for her tickets. If you would like to have your name added to the list, please contact Meg’s office on meg.hillier.mp@parliament.uk.\nCAN MEG HELP ME NOMINATE SOMEBODY FOR A UK HONOUR?\nThe UK honours system has been made more open in recent years and anybody is welcome to make a nomination. Further information can be found here. Meg is always happy to consider supporting nominations – please contact her to discuss.\nCAN MEG HELP ME TO GET A 100TH BIRTHDAY MESSAGE OR 60TH WEDDING ANNIVERSARY MESSAGE FROM THE KING FOR MY RELATIVE?\nNo. These are coordinated by the Anniversaries Office of Buckingham Palace. The process of sending the 100th birthday message should be automatic as the Department for Work & Pensions works with Buckingham Palace on those. Wedding anniversary messages do though need to be organised several weeks in advance. Further information can be found here.\nCAN MEG COUNTERSIGN THE BACK OF MY OR MY CHILDREN’S PASSPORT PHOTOS BEFORE I SEND OFF THE APPLICATION TO HM PASSPORT OFFICE?\nMeg does not counter sign passport forms. Counter signatories for British passports have to have known you or your children well for at least two years. Further information on the rules for countersigning passport photos can be found here.",
  "http_www_meghillier_com/https_www_meghillier_com_blog_categories_monthly-reports/content_29.html": "top of page\nNEWS\nApril Monthly Report\nSee here for what I've been up to in Hackney and Westminster in April.\nApr 24\nMarch Monthly Report\nSee here for what I've been up to in Hackney and Westminster in March.\nApr 1\nFebruary Monthly Report\nRead my February report here .\nMar 6\nDecember/January Monthly Report\nRead my December/January report here .\nFeb 6\nbottom of page"
}