{
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_thank-you-me/content_7.html": "I would like to take a moment to say thank you from the bottom of my heart for the overwhelming volume of support I have received following the election result. As you can imagine I have been absolutely inundated with emails and messages over the past few days. I can’t thank you enough for the kind wishes, commiserations and genuine support.\nThe outpouring has been humbling to say the very least. To serve your home, where you were born and grew up, is a role few get to do in their lives, and I have always tried to do it with absolute dedication, decency and integrity. So, I leave Parliament with my head held high and certainly enriched by the incredible experience the past 4.5 years have given. For me, the privilege to serve in Parliament was driven simply by the desire to help people. I never set out in life to do it, but compassion and public service to help those around me was my core belief.\nOver the last few years, myself and my dedicated office team have helped thousands upon thousands of constituents, day in, day out. It has been a blessing and the most rewarding aspect of representing you. This election was an incredibly close call, and we were fighting an uphill battle with the national picture. However, we did very well in North Norfolk to buck the national trend by gaining 16,903 votes. However, as many people have rightly mentioned, Reform did gain an exceptional number of votes not only in North Norfolk but across the country, and in no small way cost us the win in North Norfolk. However, this message is not to analyse what went wrong, it is simply to say thank you. I am so proud of the many accomplishments in this period, proud of the huge amount of money raised for local charities which I know has benefited so many and my leading role of caring for those fleeing Ukraine and taking aid to the region.\nMore than anything I want to thank my wonderful office team. They go above and beyond to help residents and I couldn’t do this role without them.\nI am looking to return to working in the business, commercial or charitable sector after a short break with my family. Norfolk has a lot of wonderful businesses and I look forward to new opportunities life affords me.\nI am easily contactable if people wish to get in touch. Thank you once again to everyone who has taken the time to write to me and my team, we really appreciate all of the support we have received.\nYours sincerely,\nDuncan",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_category_Westminster-News/content_11.html": "Duncan Baker MP speaks up in support of the WASPI campaign 22nd March 2024 Statement on the WASPI Campaign Ombudsman Report. Yesterday the long-awaited report on whether the Department for Work and Pensions (DWP) adequately... Westminster News\nDuncan Baker MP launches the Young Carers All Party Parliamentary Group 20th July 2022 This morning I chaired the inaugural meeting of the Young Carers APPG. I have always campaigned to support carers and in my spare time away from Parliament... Westminster News\nDuncan appointed PPS 25th February 2022 North Norfolk’s MP Duncan Baker has been appointed as Parliamentary Private Secretary to three Ministers in the Department for Levelling Up, Housing and... Westminster News\nLevelling Up: Arts & Culture 24th February 2022 The government has announced a further investment in arts and culture between 2022 and 2025, with almost £250m to support cultural organisations across the... Westminster News\nChristmas Party 8th December 2021 Like many constituents, I am extremely upset at the lack of respect and dignity that people working in the very heart of government, who were supposedly leading... Westminster News\nSir David Amess 15th October 2021 I was just contacted, at the opening of the new Cromer MacMillan Cancer Centre, by my Chief of Staff who passed on the horrific news of Sir David Amess' murder... Westminster News\nChancellor announces extra £4.6bn in lockdown grants 5th January 2021 Chancellor Rishi Sunak has today announced a further £4.6bn in lockdown grants to support businesses and protect jobs. The new grants include: One-off top-up... Westminster News\nPM announces biggest investment in British defence since the Cold War 19th November 2020 Prime Minister Boris Johnson today announced the biggest investment in British defence since the end of the Cold War. In total, the military will now see a cash... Westminster News\nTen-Point Plan for the Green Industrial Revolution 18th November 2020 Today the Prime Minister has announced his ambitious ten-point plan for the Green Industrial Revolution, which will create and support up to 250,000 British... Westminster News",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_duncan-baker-mp-speaks-support-waspi-campaign/content_6.html": "Statement on the WASPI Campaign Ombudsman Report.\nYesterday the long-awaited report on whether the Department for Work and Pensions (DWP) adequately communicated changes to the pension age for women born on or after April 6, 1950, finally reached its conclusion. For the women affected, there will be a big sigh of relief after a long fight to be heard.\nThe Ombudsman’s Report has found that maladministration, under the last Labour Government between 2005 and 2007, led to a delay in the DWP writing to women about their State Pension age changing. The report finds that only 43% of all women affected by the 1995 Pensions Act knew their State Pension age was 65 in 2004.\nThroughout this investigation, I have spoken to many women in my constituency about the impact these changes have had on them. I have consistently been supportive of their campaign and lent my support when I could. While I am still reading in detail the full 100 page report, I wanted to set out my initial views, as this is a matter that means a great deal to the many impacted women across North Norfolk.\nI’ve always been vocal in my support for pensioners. As the MP representing the oldest demographic in the country, with just over 33% of the constituency being of pensionable age, it is something that is of the utmost importance to me. I was one of the loudest voices in Parliament when it came to securing the maximum triple lock uplift after the pandemic. I think it is absolutely vital that after a life of hard work, people are properly rewarded and receive the pension they have rightly earned.\nI am pleased to see that the Ombudsman has called for compensation for the women affected by the state pension age changes. I cannot imagine the hardships some women have suffered and as the report makes clear, they were not at fault. Injustice has such an impact on people’s livelihoods, mental wellbeing and financial standings. We saw this with the Post Office scandal. As the only former sub-postmaster to be sitting in the House of Commons, I have been incredibly vocal in my support of those affected by this scandal. I want to try and reflect that same support for WASPI women.\nOf course, I have always recognised the need for sensible and pragmatic solutions to resolve matters such as this. I do understand that the Government have not yet responded in full to the findings of this report, but I want to assure my constituents who are affected that I will take your views with me to Parliament and continue to support both you, and this campaign wherever possible. My recommendation is the Government works to help as many of the impacted women as we possibly can.\nI am aware that this is not a matter that can be resolved quickly due to its scale and cost, but similarly to my stance on other injustices, I will continue to follow this closely as it develops and do my utmost to ensure that your voices are heard.\nYours sincerely,\nDuncan\nDuncan Baker MP",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_raising-profile-cte-dementia-football/content_2.html": "Today I was honoured to speak up in Parliament on behalf of Chris Sutton (former Norwich legend) to raise the profile on the issue of CTE Dementia in professional footballers.\nMr Sutton recently brought to my attention the incredibly distressing fact that former professional footballers are four times more likely to die of CTE Dementia than the wider population due to repeated head impacts.\nThe Minister assured me that he has been in discussions with the Professional Footballers Association (PFA) regarding the Premier League’s promise to allocate funding towards the new Football Brain Health Fund for players that have been impacted by dementia.\nI was also pleased to hear that this fund is only a temporary measure until a proper charity can be established to provide more long term support for players and their families who are suffering from CTE Dementia.\nI would like give special thanks to Chris for bringing this to my attention and I will certainly continue to monitor this closely.",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_events_feed/content_16.html": null,
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_join-my-office-team/content_5.html": "Closing Date: 21st March 2024\nJob Title: Communications Officer\nWorking for: Duncan Baker MP (North Norfolk)\nLocation: North Walsham\nSalary: £24,000 – £26,000\nLength of Contract: Permanent\nDetails:\nDuncan Baker MP is looking to employ a hardworking and motivated Communications Officer based in his constituency office in North Walsham, Norfolk. The role is full-time (5 days per week).\nThe successful candidate will be proactive, with strong design, IT and organisational skills. The role will also require a flexible attitude and the ability to manage, at times, a significant workload, and therefore the ability to prioritise will be essential.\nThe ideal candidate will have knowledge of North Norfolk and knowledge of local issues, but this is not a requirement of the role. Previous experience in a similar role, or experience working in media, journalism, PR or communications would be preferred.\nThis is an entry-level, junior role that would suit anyone looking to gain more experience working firsthand curating an outstanding social media and traditional media presence while also working closely behind the scenes within the political sphere.\nMain duties will include, but are not limited to:\n· Producing graphics and video content for social media and website\n· Drafting press releases, and supporting engagement with media\n· Production of e-newsletter and other materials on constituency issues and the MP’s work\n· Monitoring media coverage and social media channels\n· Organising constituency visits and assisting with local projects\n· Assisting with constituency correspondence when required\nCandidates should have the following skills or qualifications:\n· Excellent written and communication skills\n· Be politically aware, with an interest in current affairs\n· Understanding and experience in using a variety of social media platforms\n· Be sympathetic to the aims and objectives of the Conservative Party\n· A degree in marketing or communications would be a bonus, but by no means essential.\nUpon appointment, you will be required to apply for a security clearance, undertaken by the Security Vetting and Pass Office.\nFor more information on this process, please visit\nInterview/Start Dates\nWe may appoint before the closing date if the right candidate is identified.\nStart date: By mutual appointment.\nApplication Details:\nPlease send your CV and covering letter, with ‘Communications Officer’ in the subject line, to Duncan’s Chief of Staff. ([email protected])\nPlease also include: Current and expected salary.\nApplication deadline: 21/03/2024\nReference ID: Duncan Baker MP - Communications Officer\nJob Types: Full-time, Permanent\nSalary: £24,000.00 - £26,000.00 per year",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_map-locations/content_13.html": "Skip to main content\nMain navigation\nHome\nNews\nCampaigns\nContact\nA thank you from me\nSummer Tour",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_campaigning-sheringham-roundabout/content_12.html": "God loves a trier!\nI will not stop campaigning for this infrastructure in Sheringham.\nThe community wants it, it will improve safety into and out of Sheringham and have economic benefits as a gateway into the town. Come on - give us the money!\nGod loves a trier!\nI will not stop campaigning for this infrastructure in Sheringham.\nThe community wants it, it will improve safety into and out of Sheringham and have economic benefits as a gateway into the town. Come on - give us the money!",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_duncan-baker-mp-speaking-following-announcement-new-legislation-exonerate-victims-post-office/content_8.html": "Duncan speaking up for residents of North Norfolk, and all those affected by the Post Office scandal following the major news today that new legislation will be brought forward to exonerate all those wrongfully prosecuted.\nDuncan speaking up for residents of North Norfolk, and all those affected by the Post Office scandal following the major news today that new legislation will be brought forward to exonerate all those wrongfully prosecuted.",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_cdn-cgi_l_email-protection/content_14.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_category_Articles/content_4.html": "Strep A 6th December 2022 Many of you who are reading this will be parents, and I am sure you are worried about the recently reported cases of Group A streptococcus (GAS) across the UK... Articles\nCarbon Emissions (Buildings) Bill - My New 10 Minute Rule Bill to tackle Embodied Carbon in our Buildings 23rd January 2022 The United Kingdom continues to be at the forefront of addressing climate change and in so doing, is decarbonising sectors all across society, whether it be in... Articles\nOverseas Operations (Service Personnel and Veterans) Bill 23rd September 2020 Thank you Mr Deputy Speaker. For those that give their livelihoods to protect us and our nation, it is fundamentally right that we create the laws and... Articles\nUK Internal Market Bill 14th September 2020 We have now had the 2nd reading this evening of the UK Internal Market Bill and I'm pleased to explain how I voted. This issue and the public concern has deeply... Articles\nJanuary News 27th January 2020 Each month, Duncan will provide an update on his work both in Westminster and in his North Norfolk constituency. I would like to start by thanking all those who... Articles\nYour new MP 17th December 2019 Dear constituents, Firstly let me say how grateful I am that you have chosen me to represent North Norfolk as your MP. It has been my dream to represent the... Articles\nCampaigning in North Walsham 7th September 2019 On Saturday I was supported by a small group of local Conservative Association members and visited some 200 households in the Brick Kiln Road area of North... Articles",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_duncan-appointed-pps/content_18.html": "North Norfolk’s MP Duncan Baker has been appointed as Parliamentary Private Secretary to three Ministers in the Department for Levelling Up, Housing and Communities.\nIn addition to his constituency work, Duncan will be assisting the Rt Hon Stuart Andrew (Minister for Housing), Eddie Hughes MP (Minister for Rough Sleeping and Housing), and Lord Stephen Greenhalgh (Minister for Building Safety and Fire).\nDuncan said: “Housing is a key issue for many people. In tourism areas such as Cornwall, North Wales, the Lake District, and North Norfolk, there are real concerns about the provision of affordable housing for local people, second home ownership, and building development. I know these concerns are reflected in much of the correspondence I receive from constituents.\n“I’m delighted to have been appointed as a PPS, and am looking forward to working with Ministers as we seek to level up right across the country.”",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_campaigns_blakeney-surgery/content_21.html": "You may have heard of recent plans where Holt Medical Practice is considering closing Blakeney Surgery. For many that use this facility in the nearby villages, this is worrying news.\nIn a rural area, many older residents rely on this facility to collect their prescriptions and may struggle to make the alternative journey to the remaining Holt or Melton Constable practices. It is vital we retain our local healthcare services, not lose them.",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_your-new-mp/content_10.html": "Dear constituents,\nFirstly let me say how grateful I am that you have chosen me to represent North Norfolk as your MP. It has been my dream to represent the constituency that I was born, grew up, and live in. I will work as hard as I possibly can over the next 5 years to ensure that the people of North Norfolk's voice is heard in Westminster. It would like to say a huge thank-you to Sir Norman Lamb who served this constituency graciously during his time as MP and I look forward to having the opportunity to improve the mental health services we have in North Norfolk.\nNow that the Conservatives have a large majority in Government I shall be able to strongly put forward many of the concerns that North Norfolk residents face:\nInfrastructure for the 21st century - We plan to invest £29 billion to upgrade England's roads and now that we have a strong Conservative voice representing North Norfolk I hope to make sure that we receive as much as funding possible. During our election campaign improving our roads was a main issue for voters and I hope to rectify this as your MP, I understand how vital they are for our public transport and for commuting. We are also investing £5 billion to deliver gigabit broadband across the country, transforming the country's digital landscape and levelling the playing field for rural communities and businesses in North Norfolk. To prepare the country's roads for the future, we will be investing almost £1 billion to complete a fast-charging network for electric cars, reducing our footprint in the process.\nBuilding homes for the future - Emissions from heating homes are the single largest contributing factor to the UK's carbon footprint. As a result we plan to raise requirements set out in the building regulations for new homes, ensuring we decrease our co2 emissions. We hope to build 1 million homes in the next 5 years, with plans for community developments already in place in North Norfolk. I am committed to ensuring first time buyers onto the property ladder more easily, making sure that there is enough supply to meet current demands in North Norfolk. I am fully behind devolving power to local authorities so they have more control over the future of their economy and public services, so we can have a tailor made solution for North Norfolk.\nProtecting and Investing in our Environment - North Norfolk is full of areas of natural outstanding beauty, we need to maintain and preserve these areas to allow locating tourism to develop and conserve these places for generations to come. Once we leave the EU we will ensure that farmers have more of say in how they farm their land, as well as creating initiatives to enable restorative agriculture to take place. We have published an Environment Bill stating our ambition to protect and enhance our precious natural environment ensuring generations to come will be able to cherish our wonderful countryside. This will aim to improve air and water quality, tackle plastic pollution that often ends up on our beaches and restoring wildlife.\nThe NHS and Social Care - While out campaigning one key issue that resonated throughout the constituency was the need for increasing funding and provisions for the NHS and social care. The NHS should always be free at the point of use, and over the next 5 years we are going to be insuring it gets the help it needs across the board and crucially in vital services. We are going to be working cross-party here in North Norfolk to ensure that Ambulance response times are decreased as well as ensuring that government NHS funding comes to North Norfolk. I have already spoken to Matt Hancock MP, Health Secretary, to express my concern over the current response times and have begun dialogue to rectify this. In addition, we are aiming to boost mental health funding by at least £2.3 billion over the next five years, with this I hope to improve upon the health outcomes of constituents by providing more power to patients in how they are treated and creating additional GP appointments to reduce waiting times and ensuring patients can be seen by the right person, when it's most convenient for them. I hope to help stabilise the current social care system, which has seen an increase in demanding especially in areas like North Norfolk with an ageing population. We have boosted social care funding by an additional £3.9 billion in 2019, this injection of funding will aide councils to support people to live longer and live more independently.\nSchools - I believe that everybody deserves an exceptional education here in North Norfolk. Nationally we have 1.9 million more children in good and outstanding schools since 2010, but I believe we can improve on this even more. We plan to increase school funding by £14 billion over the next 3 years so that every child can get a good education and are offering a new £90 million arts premium to secondary schools to help fund enriching activities as well as advocating for primary schools to promote physical literacy and competitive sport. Furthermore, we plan to increase funding for pupils with Special Education Needs, we have announced an additional £780 million in high needs funding, an increase of 12pc bringing the SEND budget to over £7 billion a year.\nEconomy - Rural areas like North Norfolk have often been left out of the spotlight by previous governments. I am the Conservative's group leader at North Norfolk District Council, as well as having a background in business and accountancy, I believe I am best suited alongside my knowledge of the area to provide the opportunities for local businesses to flourish. I know how vital small businesses are to our economy, and I want to make sure that they receive the necessary support from the government to thrive. We are increasing the business rates retail discount, reducing tax for small businesses, to 50pc from 33pc. This would be an effective tax cut that enables small businesses to retain more of the money they earn, enabling them to invest in the future of our economy.\nOnce again I would like to express my sincere gratitude for allowing me this opportunity to represent you, lets get Brexit done so that we can focus on solving other issues facing the United Kingdom, like the NHS. Thank-you.\nDuncan Baker\nMember of Parliament for North Norfolk",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_category_Local-News/content_17.html": "Campaigning for a Sheringham Roundabout 5th March 2024 God loves a trier! I will not stop campaigning for this infrastructure in Sheringham. The community wants it, it will improve safety into and out of Sheringham... Local News\nDouble Marathon Charity Draw! 4th March 2024 Well, the time has come! The big announcement day! 52 miles for 52 charities over two full marathons - it's not going to be easy! You can watch the full draw... Local News\nJoin my office team! 14th February 2024 Closing Date: 21st March 2024 Job Title: Communications Officer Working for: Duncan Baker MP (North Norfolk) Location: North Walsham Salary: £24,000 – £26,000... Local News\nFLOODING PUBLIC MEETING MINUTES 13th February 2024 As promised, the full 16 pages of minutes from my public meeting on flooding which took place on Friday 2nd February. Given the technical nature and... Local News\nDuncan Baker MP speakes out on the Post Office Scandal 10th January 2024 Mr Baker, the only former postmaster who currently sits in Parliament, speaks out on the injustices faced by countless postmasters who were wrongfully... Local News\nJanuary News from Duncan Baker 3rd January 2024 Welcome to the New Year. I do hope you have had a very Happy Christmas and may I wish you the very best for 2024. My latest newsletter rounds up everything I... Local News\nWishing you a Happy Christmas 21st December 2023 May I take this opportunity to briefly wish you and all your family a very Happy Christmas. Whether in Parliament or back in the constituency, it's continues to... Local News\nLatest News from Duncan Baker MP 11th December 2023 It's been another busy month of delivering for North Norfolk. From lighting up the first Christmas tree of the year to working on some significant problems for... Local News\nDuncan Baker MP welcomes North Norfolk Youth Council to Parliament 27th November 2023 🙌 North Norfolk Youth Council visits Parliament! 👋 It was brilliant to welcome the North Norfolk Youth Council to Parliament today for a tour of the estate and... Local News",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news_january-news/content_9.html": "Each month, Duncan will provide an update on his work both in Westminster and in his North Norfolk constituency.\nI would like to start by thanking all those who voted for me in the recent General Election. A 14,000-strong majority was a clear mandate from North Norfolk to get Brexit done, and to move forward with addressing the many important issues you talked to me about during the election campaign.\nI’m pleased to say that within weeks I’m doing just that. The EU Withdrawal Agreement has been passed and, on the 31st January, we will leave the European Union with the votes of the 58.9% in North Norfolk finally respected.\nBoth locally and in Westminster, my team is taking shape. I’m proud to have a constituency office in North Walsham – where I have had so much support during the last year. Soon I will look forward to hosting regular surgeries around the constituency.\nNorth Norfolk will be my first priority. In these first few weeks I have hit the ground running, working hard on behalf of many constituents. You may have seen me asking questions in the House about improving our ambulance response times, protecting our farming community, the environment, and what the government is doing to help our High Streets.\nI have met with Matt Hancock, Secretary of State for Health and Social Care, to discuss the urgent issues surrounding ambulance response times, the need for improved facilities at Cromer Hospital (with additional mental health support), and met with local ambulance staff to discuss their concerns and learn how we might provide a more responsive ambulance service for this area. This is being followed up by meeting with the Norfolk & Norwich University Hospital chiefs: I want to see our Accident & Emergency unit radically improved, which will benefit many North Norfolk residents.\nI have been made the Vice-Chairman of the All-Party Parliamentary Group on moving towards carbon Net Zero, and am meeting with ministers to urge them to help the farming community who are under serious threat, with some of their irrigation licences being revoked.\nOf course, every day, I’m helping many people with queries and issues, and am loving meeting incredible constituents all around North Norfolk who do so much for their communities.\nThere is much to do, but I am enjoying representing you and trying to make our lives better in our wonderful North Norfolk home.\nI look forward to seeing you soon.",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_campaigns/content_19.html": "The First Pitch Named in Lauren Hemp's Honour MUST be in North Walsham Following the Lionesses winning the Euro 22 and being finalists in the recent World Cup, the Football Foundation announced a legacy would be created for each of...\nBlakeney Surgery You may have heard of recent plans where Holt Medical Practice is considering closing Blakeney Surgery. For many that use this facility in the nearby villages...\nNorth Norfolk Power 4 Ukraine SUPPORT THE CAMPAIGN - https://www.justgiving.com/crowdfunding/duncan-baker-nnpower4ukraine In mid November, a group of North Norfolk constituents and myself...\nDuncan appeals for veterans to complete Office of Veterans’ Affairs survey Duncan Baker MP is urging all veterans to complete the Government’s first UK-wide survey of veterans and their families, aiming to better understand the unique...\n100 New Apprenticeships for North Norfolk I'm trying to get 100 new apprenticeships in North Norfolk over the next two years. I challenged the team headed by the fantastic Julia Nix to deliver 100 new...\nCampaign Morning in Briston Another great morning canvassing out in Briston where we were talking to local residents and handing out our plan for North Norfolk. They were happy to see a...\nWetherspoons petition going strong Our petition to get the Wetherspoons discussion back on the table is finally working. It would be a great addition to the town as well as the local economy!\nClimate Change This is my latest letter to feature in the local press. I was proud to support the motion at the final council meeting of the administration, in declaring that...\nBacton bird netting scandal The Bacton bird netting scandal has dominated the headlines not just in North Norfolk but around the Country this week. I have today been to see the cliffs at...\nNNDC Budget A really disappointing budget evening on Wednesday 27th February. The Conservatives made some really good suggested amendments to the budget. We didn't want...\nSantander bank branch closures Whilst there are many problems facing the High Street, I would make swift decisive moves to force the banks to act with social responsibility in our communities...\nNorth Walsham new homes concern Large scale new housing sites often cause concerns to communities but well thought out schemes can have benefits, read mine and Fiona Turner's letter published...",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk/content_1.html": "Constituency Office\nTudor House, Grammar School Lane, North Walsham, NR28 9JH\n01692 557140\nI would like to take a moment to say thank you from the bottom of my heart for the overwhelming volume of support I have received following the election result. As you can imagine I have been absolutely inundated with emails and messages over the past few days. I can’t thank you enough for the kind wishes, commiserations and genuine support.\nThe outpouring has been humbling to say the very least. To serve your home, where you were born and grew up, is a role few get to do in their lives, and I have always tried to do it with absolute dedication, decency and integrity. So, I leave Parliament with my head held high and certainly enriched by the incredible experience the past 4.5 years have given. For me, the privilege to serve in Parliament was driven simply by the desire to help people. I never set out in life to do it, but compassion and public service to help those around me was my core belief.\nOver the last few years, myself and my dedicated office team have helped thousands upon thousands of constituents, day in, day out. It has been a blessing and the most rewarding aspect of representing you. This election was an incredibly close call, and we were fighting an uphill battle with the national picture. However, we did very well in North Norfolk to buck the national trend by gaining 16,903 votes. However, as many people have rightly mentioned, Reform did gain an exceptional number of votes not only in North Norfolk but across the country, and in no small way cost us the win in North Norfolk. However, this message is not to analyse what went wrong, it is simply to say thank you. I am so proud of the many accomplishments in this period, proud of the huge amount of money raised for local charities which I know has benefited so many and my leading role of caring for those fleeing Ukraine and taking aid to the region.\nMore than anything I want to thank my wonderful office team. They go above and beyond to help residents and I couldn’t do this role without them. I am looking to return to working in the business, commercial or charitable sector after a short break with my family. Norfolk has a lot of wonderful businesses and I look forward to new opportunities life affords me.\nI am easily contactable if people wish to get in touch. Thank you once again to everyone who has taken the time to write to me and my team, we really appreciate all of the support we have received.\nYours sincerely,\nDuncan",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_about-rss/content_15.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_news/content_3.html": "Raising the profile on CTE Dementia in football! Thursday, 18 April, 2024 Today I was honoured to speak up in Parliament on behalf of Chris Sutton (former Norwich legend) to raise the profile on the issue of CTE Dementia in professional footballers. Mr Sutton recently brought to my attention the incredibly distressing fact that former professional footballers are four times more likely to die of CTE Dementia than the wider population due to repeated head impacts. The... Speeches in Parliament\nDuncan Baker MP speaks up in support of the WASPI campaign 22nd March 2024 Statement on the WASPI Campaign Ombudsman Report. Yesterday the long-awaited report on whether the Department for Work and Pensions (DWP) adequately... Westminster News\nNorth Norfolk MP makes a stand on the unlawful importation and smuggling on dogs, cats and ferrets 18th March 2024 As a well known animal lover, I’m very proud to have stayed in Parliament today, normally a constituency day, to pass more Animal Welfare laws, specifically to... Speeches in Parliament\nCampaigning for a Sheringham Roundabout 5th March 2024 God loves a trier! I will not stop campaigning for this infrastructure in Sheringham. The community wants it, it will improve safety into and out of Sheringham... Local News\nDouble Marathon Charity Draw! 4th March 2024 Well, the time has come! The big announcement day! 52 miles for 52 charities over two full marathons - it's not going to be easy! You can watch the full draw... Local News\nJoin my office team! 14th February 2024 Closing Date: 21st March 2024 Job Title: Communications Officer Working for: Duncan Baker MP (North Norfolk) Location: North Walsham Salary: £24,000 – £26,000... Local News\nFLOODING PUBLIC MEETING MINUTES 13th February 2024 As promised, the full 16 pages of minutes from my public meeting on flooding which took place on Friday 2nd February. Given the technical nature and... Local News\nEnding Veteran Homelessness 18th January 2024 Duncan Baker MP asks for an update on the ending of veteran homelessness over the Christmas period. Speeches in Parliament\nDuncan Baker MP speaks on North Norfolk Cable Corridors 17th January 2024 In action again today, raising the environmental damage we’ve experienced this Autumn from the cable corridors being trenched through North Norfolk for the off... Speeches in Parliament\nDuncan Baker MP speaking following the announcement of new legislation to exonerate victims of the Post Office scandal 10th January 2024 Duncan speaking up for residents of North Norfolk, and all those affected by the Post Office scandal following the major news today that new legislation will be... Speeches in Parliament",
  "https_www_duncanbaker_org_uk_/https_www_duncanbaker_org_uk_campaigns_campaign-morning-briston/content_20.html": "Another great morning canvassing out in Briston where we were talking to local residents and handing out our plan for North Norfolk. They were happy to see a local person running as well as someone wanting to get Brexit done!\nMany of those we spoke to were dismayed by the way many in Parliament have been handling Brexit and want us to get out and focus on other important issues like housing, jobs and tackling climate change."
}