{
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_make-your-voice-heard-mp-calls-residents-register-their-objections-ilkley-20mph-scheme/content_24.html": "Ilkley MP Robbie Moore is calling on residents across Ilkley and Ben Rhydding to voice their opposition to plans for a blanket 20mph zone across the town.\nRobbie Moore MP said:\n\"On Monday, Bradford Council launched its consultation on its misjudged plans for a blanket 20mph zone across Ilkley and Ben Rhydding, including the proposed construction of over 100 speed bumps along roads throughout the town.The whole project anticipated to cost well over £200,000.\nWe all support increasing road safety measures through targeted means including the implementation of 20mph zones outside schools and in specific areas of concern. But imposing a blanket 20mph zone on residents across the whole of Ilkley and Ben Rhydding is not the answer.\nIn my view, Bradford Council’s plans - backed by the Greens and Lib Dem’s on Ilkley Town Council is not the best use of taxpayers money to improve either safety or enhance active travel.\nIt is clear that what we need is a targeted and effective approach, applying traffic measures in specific areas of concern.\"\nCLICK HERE to register your objections to these plans.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_mp-backs-local-railway-ticket-offices/content_26.html": "Keighley & Ilkley MP Robbie Moore has backed local railway ticket offices after Northern Rail announced plans for closure.\nIndustry body the Rail Delivery Group (RDG) unveiled the proposals, which could lead to nearly all ticket offices being shut, with facilities only remaining open at the busiest stations.\nUnder new plans for Keighley and Ilkley from Northern, passengers will be asked to pay for journeys by tapping contactless cards on barriers, using self-service machines, or buying tickets from staff on station concourses or trains.\nBut Mr Moore said the potential move would be \"completely and utterly misjudged\", with the local MP calling ticket offices a \"vital service provision\" and urging residents to submit their objections to the plans.\nObjections to the proposals can be made directly to Northern by emailing [email protected] or by writing to, RTEH-XAGE-BYKZ, Transport Focus, PO Box 5594, Southend on Sea, SS1 9PZ.\nThe consultation deadline is 23.59 on 28 July 2023.\nIn a statement, Robbie Moore MP said:\nToday, Northern revealed they plan to CLOSE their Ticket Offices at Keighley and Ilkley Railway Stations - and have now launched a public consultation on these plans.\nIn my view, closing our local ticket offices would be completely and utterly misjudged.\nTicket office closures will erode a vital service provision impacting those in our community who rely on their service to get around. Despite this closure proposal being put forward by Northern, they admit that more than 1 in 6 customers still use their Ticket Offices, so by going ahead with their plan, many passengers will be impacted.\nNorthern’s closure plans also severely negatively impact passengers because they have accessibility issues and require face-to-face assistance.\nAs your MP, I will be making my opposition to these plans clear to Northern.\nI urge all passengers to officially submit their objections to these plans directly to Northern by emailing [email protected] or by writing to RTEH-XAGE-BYKZ, Transport Focus, PO Box 5594, Southend on Sea, SS1 9PZ before their consultation deadline - 23.59 on 28 July 2023.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_campaigns_tackling-child-sexual-exploitation/content_13.html": "Keighley's MP Robbie Moore is calling for an independent, ‘Rotherham-style’ inquiry into child sexual abuse in West Yorkshire.\nIn August 2020, a damning report was released into Child Sexual Exploitation and Child Safeguarding Practices across the Bradford District over the last 20 years. The Review which only focused on 5 children found they had experienced grotesque sexual abuse and there had been multi agency failings by Bradford Council and others which are still missing clear signs of child sexual abuse.\nChild sexual abuse has long been in issue within Keighley and across West Yorkshire. In 2016, a group of 12 men who committed serious sexual offences against two girls in Keighley and Bradford were jailed for a collective 132 years and 8 months. Last October, 21 men from Keighley and Bradford were arrested for being linked to offences that allegedly occurred against a young female between 2001 and 2009. Further investigations are ongoing.\nAnn Cryer, Keighley’s MP between 1997 and 2010 was one of the first MP’s to raise concerns about grooming gangs and child sexual exploitation within the Pakistani community in West Yorkshire over 20 years ago. However, in that time, little has changed, with Keighley’s former Labour MP John Grogan previously saying a new inquiry into the sexual exploitation of children in Keighley and Bradford would not be in the best interest of young people.\nA ‘Rotherham style’ inquiry – which could be commissioned by Bradford Council would be similar to that established by Rotherham Council in 2013, and conducted by an independent chair. The aim of the inquiry would be to look at the handling of child-sexual-exploitation reports by Bradford Council, West Yorkshire Police and other agencies, ‘common threads’ of where abuse has taken place, and to look at what needs to change to avoid these crimes happening again.\n“Since becoming Keighley’s MP, I have heard abhorrent stories from victims of child sexual exploitation and grooming gangs. These are vile and disgusting crimes. It is high time this issue was finally tackled once and for all. That is why I am calling on Bradford Council to launch an independent ‘Rotherham-style’ inquiry into child sexual abuse so these issues can be looked at independently, bring this criminal minority to justice, and protect children and young people. I will also raise these issues in Parliament. It is my firm view that in order to move forward we need to understand the true scale of this issue. A Review which only looks at 5 children just isn’t good enough. This is just the tip of the iceberg.”\nRobbie Moore MP",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_join/content_14.html": "Tweet Sign up for regular updates from Robbie Moore MP Sign up for local updates from Robbie Moore MP Current Your details Leave this field blank First name Last name Email Mobile number Postcode Address ID Address Parliamentary constituency Admin county Admin district CED Admin ward Parish I would like to be kept up-to-date by Robbie Moore MP on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_campaigners-present-new-road-nanny-regulation-propsosals/content_18.html": "Keighley and Ilkley MP Robbie Moore has met with local nannies and campaigners Maria Culley and Allie Bell to hear new proposals for nanny regulation.\nThe pair’s new ”Road to Nanny Regulation Propsosal” advocates for greater regulation of nannies in the industry, calling for minimum safeguarding standards, a mandatory registration on the Ofsted register and a dedicated Nanny register via a national Nanny association.\nCurrently, Nannies, who play a vital role in a child’s upbringing, are not required by law to go through through DBS checks or first aid training. The campaign aims to push for further regulation across the nanny industry, preventing those who are unsafe, untrained or qualified from caring for children.\nBoth Maria and Allie argue that once nannies are regulated and licensed, it will provide parents with another viable and flexible option – whilst keeping families around the UK safe from harm.\nAlso in the proposals are plans for a similar Care Inspectorate System to that of Wales and Scotland, nannies to be included in the 30 hours funded childcare scheme, new incentive programmes and a dedicated National Nanny Association.\nWith 16 years of experience, Maria Culley was recently was awarded Nanny of the Year 2023 for West Yorkshire. She is currently a Nanny and believes more regulation this is the way forward for the nanny industry.\nAllie Bell, the second co-founder of the campaign, has worked within the childcare industry for over 30 years and recently won the 2023 Nanny Agency of Year Award. She has worked as a Norland Nanny, in nurseries, in schools and now as a Nanny agency owner.\nThe campaign also met with Mr Moore in July and January to discuss their campaign.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_CouncilTax/content_9.html": "On Behalf of Residents across the Bradford District\nDear Councillor Hinchcliffe,\nWe are writing to express our outrage at Bradford Council’s shameful decision to impose a 9.99% council tax hike on local residents across the Bradford District which will hit working families hard.\nThis punishing rise is nothing short of an insult to hardworking taxpayers and comes after years of financial mismanagement, reckless spending, and scandal after scandal under your leadership.\nYour catastrophic failure to manage Children’s Services alone has cost local taxpayers nearly £150 million – more than the £130 million black hole you now say justifies this tax rise.\nThis is just one example of a litany of financial disasters. From the Bradford Live fiasco costing taxpayers £50million to millions wasted on vanity projects in the city centre, the story is always the same: Keighley, Ilkley, Craven, the Worth Valley and residents from our wider area are expected to pick up the tab for your Council’s incompetence.\nInstead of making hardworking families suffer even more, you should be taking responsibility for the financial mess you have created and focusing on providing statutory services first.\nI, alongside the many residents who have signed this letter, urge you to reverse this damaging decision immediately and stop the continued wastage of public funds on projects the Council shouldn’t be involved with.\nWe also urge your local councillors to vote against this tax increase when it is comes to the vote on 6th March.\nYours sincerely,\nRobbie Moore MP\nMember of Parliament for Keighley and Ilkley",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk/content_1.html": "Contact Robbie Moore\nOffice of Robbie Moore MP\nShan House, 80-86 North St, Keighley, BD21 3AG\n01535 600538\nWhen writing to me by letter or email please always include your full name and home address including postcode.\nPlease be aware I receive a large volume of correspondence, but will endeavour to respond as quickly as possible.\nIs Robbie your MP?\nEnter your postcode",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_column-why-we-must-say-no-walshaw-moor-wind-farm/content_4.html": "As many may have read, proposals have been put forward to build what will be England’s largest onshore wind farm. 65 colossal turbines towering over the wild, beautiful landscape of Walshaw Moor on the edge of Bronte country.\nOn paper, it sounds like a triumph for renewable energy. But in reality, it is anything but.\nBecause behind the shiny headlines and government soundbites lies a proposal so environmentally reckless, so damaging to our local landscapes and heritage, that it should alarm anyone who genuinely cares about local habitats, our history and our natural environment.\nFirst of all, Walshaw Moor is an area of national and global environmental significance. As one of the largest areas of protected peatland in England, it is an area that performs one of the most vital climate functions – storing carbon.\nPeatland stores 26 times more carbon than forests in the UK and disturbing that land by ripping into it to will not only destroy that delicate ecosystem, it will release vast quantities of stored carbon straight back into the atmosphere.\nThere is therefore a supreme irony here that a development being hailed as an environmental triumph and progress will in fact risk unleashing a carbon bomb into the atmosphere, originating right here in our beautiful part of the world.\nThe developers, Calderdale Wind Farm Limited, much to the astonishment of many, seem completely unfazed by this. In fact, there is little to no clear evidence in their proposals that they have factored this monumental loss of carbon into their carbon savings calculations.\nBut the dangers don’t just end here. Walshaw Moor is also home to many rare and endangered bird species including the Curlew, Lapwing, Golden Plover, Merlin and Short-Eared Owl which all nest there. Building this wind farm will bring a huge amount of noise, habitat destruction which will pose a profound threat to these already fragile species.\nFurthermore, Walshaw Moor serves as a natural flood defence for the Calder Valley. Walshaw Moor is largely composed of blanket bog, a special type of bog inhabited by Sphagnum moss. These moss species, of which Walshaw Moor has 10, allow the bog to absorb water and reduce rain runoff. Disturbing the land by constructing this wind farm risks killing large volumes of this moss, which prevents the bog from absorbing rainwater increasing flooding risks downstream.\nThe Calder Valley knows all too well the devastation that flooding can cause. Hebden Bridge, Mytholmroyd, Todmorden all have suffered repeated, catastrophic floods in recent years. Millions of pounds of public money and thousands of hours of community effort have gone into flood prevention. To now threaten all of that by tearing up the moor above these communities is an act of staggering short-sightedness that threatens the safety and protection of thousands of residents.\nAnd finally, this development is also on the edge of historic Bronte country, the inspiration for much of the Bronte sister's literary works. Indeed, the famous tree believed to have inspired Wuthering Heights is located within the boundaries of the proposed wind farm.\nThe construction of wind turbines on this beautiful, pristine natural landscape would thus be a huge loss to the cultural and natural heritage of the country and deprive many tourists and local people of experiencing the same landscape that inspired the Bronte sisters.\nWhat a tragic irony it would be if future generations were left to read about those wild moors in books, while the real landscape lies buried beneath concrete and steel.\nThe construction of this wind farm is expected to take at least two years, during which time some of the area’s most cherished and scenic walking routes including parts of the Pennine Way would be unusable and closed off. These routes are nationally renowned and used regularly by tourists from across Yorkshire, Lancashire and beyond. Public access may also be restricted during the decommissioning of the site.\nIn my view this represents a significant threat to local tourism and hospitality businesses as well the long-term stability of the local economy. But this is not just significant for the imminent two year construction period. As a wind farm, when decommissioning of these wind farms takes place in decades time, similar disruption will also be caused again.\nAn RSPB study has also shown there is more than enough suitable land across England to meet all onshore wind targets without building on protected peatlands. The government’s obsession with size and scale, being able to boast about the ‘biggest onshore wind farm in England’, should never come at the cost of our environment, our wildlife, or our cultural heritage.\nIf we are to truly defeat these proposals, we will of course need strong voices both inside and outside of Parliament and we have seen strong campaigns locally thanks to Stop Calderdale Wind Farm, Stronger Together and Worth Valley against Walshaw Moor Wind Farm.\nBut so far, Parliament has been relatively quiet on this issue.\nThat is why earlier this year, I wrote to Anna Dixon MP for Shipley, Kate Dearden (Halifax), Jonathan Hinder MP (Pendle and Clitheroe), Oliver Ryan MP (Burnley) and Josh Fenton-Glynn MP (Calder Valley) asking them to form a cross-party group with me to provide a strong voice against these proposals in Parliament.\nBut as of yet, I haven't recieved a single response.\nSo I would urge everyone to write to your local MP making sure our voices are heard loud and clear. And please continue to sign the petition to ban wind farms on protected peatlands: https://petition.parliament.uk/petitions/701290 donate to the Stronger Together campaign: https://www.crowdfunder.co.uk/p/protect-our-peat-dont-build-wind-farms-on-it\nThis is not nimbyism. This is common sense. This is about environmentalism grounded in reality.\nRenewable energy can be an essential part of our future, but not like this, not here, and not at the cost of everything Walshaw Moor represents and provides our ecosystem with.\nFor all these reasons, we must oppose the Walshaw Moor Wind Farm.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_breaking-away-bradford-council/content_2.html": "Local representation matters, and individuals need to have trust in their local authority to act in their best interests. For far too long, Bradford Council have eroded this trust across my constituency, and many residents have quite rightly felt completely unrepresented and ignored by our local authority.\nThat’s why I presented my new Local Authority Boundaries bill to Parliament, which will seek to enable residents across the Keighley and Ilkley, and Shipley constituencies to form our own unitary authority which is focused on delivering for our area.\nBradford Council is far too large, with the City getting complete precedence over any local expenditure, despite the outlying areas being the biggest net contributor of taxpayers hard earned money. They lack in capacity and competence to deliver statutory services and have failed us time and time again, whether it be on children’s services, highways, unfair proposals to rip up our green belt, the CAZ tax, or ignoring a decisive Public Poll in Keighley to keep our Green Space green. It is time for a new smaller, more efficient local authority that puts our interests first.\nRobbie Moore MP",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_events_feed/content_6.html": null,
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_robbie-moore-mp-attacks-toxic-incinerator-plans-aire-valley/content_22.html": "In a scathing speech in Parliament, Keighley and Ilkley’s MP Robbie Moore has condemned the long-standing decision by Bradford Council to green-light the proposed Aire Valley Incinerator in 2016— a decision Mr Moore says says poses a grave threat to public health and the local environment.\nIt comes after recent independent studies from Europe have revealed alarming levels of toxic pollutants—including dioxins, PFAS, and heavy metals such as lead, mercury, and arsenic—accumulating in and around waste incinerators.\nThese pollutants have been detected in soil, water, vegetation, and even food in areas surrounding existing facilities.\nSuch contamination is particularly dangerous for vulnerable groups, notably children, due to their increased sensitivity to toxic exposures.\nSpeaking on incineration, Mr Moore said:\n“This is exactly what local campaigners have been warning about for far too long. Despite Labour’s pre-election promises to end incineration, Labour Ministers are now pushing through plans to construct more than 40 incinerators across the country. It is an unacceptable contradiction that a government which claimed to protect our future is now enabling decisions that will condemn communities to long-term environmental harm. The Aire Valley Incinerator should never be built.”\nThe MP concluded by urging the Government to commit to a clear, long-term strategy that phases out incineration and reinforces efforts to reduce, reuse, and recycle.\nHe called on ministers to deliver on their promises to protect local air quality and ensure the safety of our communities.\nMr Moore said:\n“The time for incinerators is over. It is therefore extremely shocking that despite promising an “end to incineration” prior to the general election, Labour Ministers are instead pushing through plans to build a new generation of more 40 incinerators across our country.\nMy view remains - the Aire Valley Incinerator should never be built - and the government should bring forward an immediate stop to this.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_privacy/content_17.html": "This document outlines how Robbie Moore MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Robbie Moore MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Robbie Moore MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Robbie Moore MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Robbie Moore MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_ilkley-has-pride/content_15.html": "Organisers of Ilkley’s second annual Pride event to celebrate the town’s LGBTQ+ community say the event was a “beacon of hope” for the community.\nLarge crowds attended the event on Saturday, which featured workshops, talks and performances at the King’s Hall and Winter Gardens.\nThe event was attended by Ilkley's MP Robbie Moore who said:\n“It has been incredibly humbling to see the whole of our community come together to support Ilkley Pride & Diversity\nWith lots of information, support, music, food, drink and entertainment, the event was absolutely brilliant, and a I’d like to pay tribute to everyone involved in organising this fantastic event, including David Shaw and Ilkley Pride’s Youth Ambassador, Noah.\nAttitudes have quite rightly changed dramatically over the last 50 years, with much progress made, but there is a long way to go and events like this absolutely help to break down barriers.\nLove is love and love is for everyone - all should be able to lead the life they choose.\"",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_bradford-district-identified-area-main-concern-new-independent-inspection-police-forces-child/content_27.html": "Keighley and Ilkley MP Robbie Moore has welcomed the Home Secretary’s announcement of an independent inspection into the police’s response to Child Sexual Exploitation, with the Bradford District being highlighted as a specific area of concern. The news follows a longstanding campaign by Moore for an inquiry into Child Sexual Exploitation in the Bradford District, in which the police have been identified as one of the organisations where failings have been known to have taken place.\nSince being elected, Moore has used Westminster debates to raise his deep concerns regarding child sexual exploitation, grooming gangs and child sexual abuse on numerous occasions, and has met with the Home Secretary multiple times to discuss the issue. At the end of last year, Moore held his own personal debate on child sexual exploitation within the Bradford District, to specifically shine a light on these issues which have haunted his constituency of Keighley for decades. Moore used the debate to highlight concerns of multi-agency failings that included West Yorkshire Police and Bradford Council. In response, Home Office Minister for Safeguarding Rachel Maclean, who has departmental responsibility for Child Sexual Exploitation, announced the Government’s support for Moore’s calls that additional action be taken to address failings within the Bradford District, so that victims could be better supported and protected.\nThe inspection announced by the Home Secretary will look at inadequacies in past responses to Child Sexual Exploitation by police forces, and will assess current policing practice across England and Wales. It aims to ensure all police forces are employing the most effective approaches in protecting victims from child sexual exploitation and relentlessly pursuing offenders. The Home Office argue it “will ensure learning from past mistakes is being applied by police forces across the country, so that they can respond effectively to all victims and bring more offenders to justice.”\nFollowing Mr Moore’s request, the Bradford District has been specifically referenced by the Home Office as an area which has specific concern. Moore has stated that, when examining the local area, other local matters must be considered for the full scope of the problem to be addressed. This includes the ethnicity of the perpetrators and victims, as well as the role of other local agencies, such as Bradford Council’s Children’s Services.\nMoore is still calling on Bradford Council and our West Yorkshire Mayor to approve his demands for a ‘Rotherham Style’ inquiry into Child Sexual Exploitation in the Bradford District, but has very much welcomed the Home Secretary’s announcement that failings of the police force will be properly reviewed.\nKeighley and Ilkley MP Robbie Moore said: “Since being elected, I have on many occasions raised my deep concerns regarding child sexual exploitation and grooming gangs which have haunted our community for far too long, and still do. I have spoken with the Home Secretary and Home Office Ministers on countless occasions to make sure we finally do something about this atrocious crime, and that where failings have been identified we get to the bottom of this so that we can best protect victims and their families.\nThere can be no denying that this horrific crime happens under everyone’s noses in our area. There has been identified failings within West Yorkshire Police and at Bradford Council in how they have dealt with such cases. Therefore, it is absolutely right that the Bradford District has been specifically highlighted by the Home Secretary as an area of focus for this inspection into police forces. In my view, it is paramount that the inquiry will focus on certain local factors, such as the ethnicity of the perpetrators and the victims of Child Sexual Exploitation, as well as the multi-agency failings of local bodies such as Bradford Council’s Children’s Services. I have heard time and time again from victims of child sexual exploitation that they have been failed by these organisations in the name of political correctness, and in my view this has to stop.\nThis is an extremely difficult issue, but unless we talk openly and honestly about it, we are failing. As I have expressed to the Home Secretary, we need to ensure current practice is relentless in protecting children, supporting victims and bringing perpetrators to justice.”\nFor more information on the Home Secretary's announcement, please click here; https://www.gov.uk/government/news/home-secretary-commissions-inspectio…",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_campaigns_stopthefarmtax/content_12.html": "Labour have broken their promise to British farmers with the Family Farm Tax.\nLabour's Family Farm Tax will stop farms being passed to the next generation\n- Threatening our food security\n- Risking jobs\n- Leading to food prices rising\nStop this. Sign our petition:-\nThis petition will be presented to the Labour Party by Christmas. We will use your contact details to update you about Labour's tax rises.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_its-official-constituency-name-change-keighley-ilkley/content_23.html": "The Boundary Commission have officially adopted local MP Robbie Moore’s proposals to change the name of the Keighley constituency to “Keighley and Ilkley”, it has been confirmed today.\nMr Moore launched his campaign to change the name of the constituency in 2021, arguing that the Commission should “make sure that no part of our constituency feels forgotten about or left behind.”\nThe proposals were recognised in the Boundary Commission’s Initial report, and have now been officially adopted in the Final Report released today (28th June).\nWith a population of around 15,000 Ilkley is the second most prominent town within the constituency, and given that many refer to Ilkley in the constituency name, Mr Moore argued that it was right to officially ensure the name change takes place before the next general election.\nMr Moore’s full comments to the Commission last year can be found here: https://www.bcereviews.org.uk/node/75768/view.\nRobbie Moore MP said:\n“It is fantastic to see that the Boundary Commission have now officially adopted my proposals to change the name of our constituency to “Keighley and Ilkley”, which will better reflect our two principal towns. With a population of around 15,000, Ilkley is the second most prominent town within the constituency. Given that many people already refer to Ilkley in our constituency name, it is only right that both areas are recognised in this name-change, and I would like to thank everyone who helped contribute to this campaign during the consultation process.”",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_category_Local-News/content_21.html": "COLUMN: Why we must say no to Walshaw Moor Wind Farm 22nd April 2025 As many may have read, proposals have been put forward to build what will be England’s largest onshore wind farm. 65 colossal turbines towering over the wild... Local News\nWork Progressing Well on ‘missing link’ Towpath Ahead of expected Summer Opening 19th April 2025 Local MP Robbie Moore has welcomed the progress being made to upgrade the Silsden to Kildwick towpath, with improvement works now well underway and an expected... Local News\nRobbie Moore MP attacks “toxic” Incinerator Plans at Aire Valley 16th April 2025 In a scathing speech in Parliament, Keighley and Ilkley’s MP Robbie Moore has condemned the long-standing decision by Bradford Council to green-light the... Local News\nEssential extension to Grange Park Surgery opened 13th April 2025 The extension to Grange Park Surgery in Burley-in-Wharfedale has been opened. The existing building opened in 1987 to house 4600 patients and 8 members of staff... Local News\nWork Progressing Well on ‘missing link’ Towpath Ahead of expected Summer Opening 10th April 2025 Local MP Robbie Moore has welcomed the progress being made to upgrade the Silsden to Kildwick towpath, with improvement works now well underway and an expected... Local News\nNew era for Keighley station after £9.9m transformation 5th April 2025 Keighley station’s stunning transformation is complete following a £9.9m investment. The grade II-listed station – built in 1885 – had been showing signs of age... Local News\nRobbie Moore MP: Bradford Council has run out of excuses 27th March 2025 Watching Bradford Council’s latest budget meeting, it was impossible not to feel a mix of both fury and second-hand embarrassment for the controlling Labour... Local News\nStanbury school council quizzes MP 24th March 2025 Keighley and Ilkley MP Robbie Moore has visited Stanbury Village School for a special assembly and question and answer session with pupils. The local MP took a... Local News\nNew banking hub recommended for Ilkley 20th March 2025 Following Santander’s announcement that it will close its Ilkley branch, LINK has confirmed that Ilkley will receive a banking hub—ensuring that local residents... Local News",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_home-secretary-sees-local-crime-first-hand-following-visit-hosted-local-mp/content_16.html": "Home Secretary sees local crime first-hand following visit hosted by local MP\nKeighley and Ilkley MP Robbie Moore recently hosted Home Secretary Priti Patel for a visit to his constituency to show her some of the issues facing the local community first-hand. Moore also set up a meeting with Inspector John Barker and his team from the Keighley Neighbourhood Policing Team to talk through some of the frontline policing operations which are happening across our area, as well as a walk through the town to see some of the crime hotspots.\nTackling local crime has been one of Moore’s main priorities since being elected, and he has regularly met with the Home Secretary to discuss these challenges, including drug crime, speeding and anti-social behaviour. Following these meetings and lobbying by Moore for more action to be taken, the Home Secretary agreed to a visit, where Moore was also able to show some of the good local partnership work which is happening and the recent progress which is being made.\nMoore also hosted a separate meeting with the Home Secretary and some of the parents whose children have gone through horrendous circumstances having been victims of child sexual exploitation and gang related grooming over past years and decades. Multi-agency failings in both how cases were handled by the Police, local authorities and other stakeholders were discussed, as well as local factors including the ethnicity of the perpetrators and victims of this horrific crime. Moore has regularly raised these matters in Westminster, and following an announcement by the Home Secretary of an independent inquiry into the police response to Child Sexual Exploitation, Patel has assured Moore he will be personally consulted as part of the inquiry.\nRobbie Moore MP said: “I was delighted to host the Home Secretary in Keighley for a visit. This follows my repeated meetings in Westminster where I have raised with the Home Secretary my deep concerns regarding local crime issues, particularly drug related crime, but also child sexual exploitation.\nThe Home Secretary met with our local neighbourhood policing team to talk through frontline policing operations which are happening without our area to tackle drug crime and county lines, but we also discussed some of the more complex cases such as those linked to mental health. Drug crime has a huge impact on our town. Not only does it affect those who sadly get caught up in these crimes, but also has such a large knock-on effect for local businesses who suffer from a reduced footfall by people being put off visiting our town. It is only through raising these issues with those at the very top that we can begin to see real change to improve our area.\nI was also able to host a meeting with the Home Secretary and a group of parents whose children have gone through horrendous circumstances having been victims of child sexual exploitation. Whilst I have raised these issues directly with her on many occasions, it was also vitally important for her to hear directly from local people about these tragic events, and where failings have taken place.\nAs your MP, I want to make our community safer and will do all I can to tackle the harrowing issues which have haunted our community for far too long.”",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_robbie-parliament/content_28.html": "As your local MP, Robbie Moore is in Parliament every week it sits, standing up for Keighley and Ilkley and fighting for more investment for our community.\nBelow, you can see Robbie's speeches, as printed in Hansard.\nBelow, you can see Robbie's speeches, as printed in Hansard.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_its-time-tackle-child-sexual-abuse-once-and-all/content_19.html": "The issue of child sexual exploitation is one that has often been difficult to talk about, but it has been an issue of huge concern in West Yorkshire for many years. That is why we need a Rotherham-style inquiry into Child Sexual Exploitation in the Bradford District, so we can tackle this issue once and for all.\nTwenty years ago, my predecessor, Ann Cryer, bravely took the decision to raise her concerns about grooming gangs and child exploitation within the Pakistani community in West Yorkshire. Ann did a good job, ensuring the issue received national attention. However, the reality is that two decades on, nothing has really changed.\nIn 2016, a group of 12 men who committed serious sexual offences against two girls in Keighley and Bradford were jailed for a collective 132 years and 8 months, and last October, 21 men from Keighley and Bradford were arrested for being linked to offences that allegedly occurred against a young female between 2001 and 2009. Grooming cases are still making their way through the Courts today, and horrific events are still being investigated.\nI believe that those of us in positions of responsibility - like I am, as a Member of Parliament - have a responsibility to tackle these issues, so we can ensure that the horrific crimes that have happened to children across West Yorkshire never happen again.\nIt was only eight weeks ago when a review was released which looked at child sexual exploitation in the Bradford District over the last 20 years. This review was narrow in scope, and only looked at 5 children, before concluding that there had been multi-agency failing, identifying there are still children which remain unprotected, whilst some perpetrators remain unknown and unchallenged. I believe that this is just the tip of the iceberg, as this review failed to identify just how many children have been subjected to sexual exploitation over this period.\nI am afraid that Bradford District’s institutions have failed and continue to fail. Indeed, last month, the government was forced to step in and appoint a commissioner to oversee Children’s Services at Bradford Council, after Ofsted criticised the slow rate of improvement, almost three years after the services were rated ‘inadequate’.\nThings need to change. That is why, earlier this month, I called for a full, Rotherham-style inquiry into Child Sexual Abuse in the Bradford District, so we can make sure protections are in place - as has happened in Rotherham - so these crimes cannot go unnoticed again.\nI will admit to be somewhat taken aback by the reaction from many experienced local politicians who have been around for decades.\nAlison Lowe, our Deputy Mayor for Policing and Crime – appointed by our West Yorkshire Mayor Tracy Brabin has said she is not supporting an inquiry, and has claimed ‘this is a national problem, not a Bradford problem’, whilst the Leader of Bradford Council; Susan Hinchcliffe has claimed that “writing another report would not save one child or prosecute one additional perpetrator”. The evidence from Rotherham suggests they are both wrong. The findings of the inquiry in Rotherham led to a criminal inquiry by the National Crime Agency, and saw 42 people jailed after being convicted for a range of horrific acts, including child abduction, rape, false imprisonment, and sexual intercourse with girls under 13. It also held authorities to account for the failings they had made so that real learning can be made.\nPerhaps Bradford’s institutions are so against a full ‘Rotherham style’ report because they are scared the findings?\nBBC Look North recently covered a story of one girl, who goes by the name of Anna. She was abused by gangs of men whilst in care, and aged 15, had an Islamic wedding to her abuser, which was allegedly attended by her social worker.\nThese are horrific crimes. We need to be honest with ourselves. This is a major issue - and an issue that too many politicians have been afraid to tackle. This is a difference between right and wrong, and I urge those in positions of reasonability to set up.\nThere have been some who have said we should just sweep this issue under the carpet and forget about the past.\nI am afraid they are wrong. Perpetrators of child sexual abuse are still roaming the streets, and abuse is still taking place.\nIf we fail to address this, the very worst of humanity will exploit child sexual abuse for their own gain. This has already happened. In 2005, Nick Griffin stood in Keighley and made our town the BNP’s Number 1 target seat. I do not want to see that happen again.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_local-veteran-celebrated-downing-street/content_8.html": "A local Veteran has been celebrated at Downing Street this week.\nIlkley's own Mark Sugrue, a former Royal Air Force Police Operative who has served across the globe, including in the Northern Ireland and Bosnia conflicts, was nominated by the town’s MP Robbie Moore as Ilkley’s Local Veterans Champion for his contribution to veterans in the town.\nFormer service men and women from across the UK journeyed to London for the Downing Street event, hosted by Johnny Mercer MP, the government’s Minister of State for Veterans’ affairs who served three tours in Afghanistan.\nMark Sugrue received high praise from the town’s MP for his role in organising the Ilkley Armed Forces & Veterans Breakfast Club for the community, alongside fellow Ilkley resident Jason Sands.\nA part of the national network of Armed Forces and Veterans Breakfast Clubs, the Ilkley Armed Forces & Veterans Breakfast Club meet on the last Saturday of each month from 10am until 12.30pm at The Listers Arms in Ilkley town Centre, offering veterans of both sexes a welcoming space to connect and share experiences.\nRobbie Moore MP said:\n”I was immensely proud to nominate Mark Sugrue as our Local Veterans Champion at Downing Street. Mark really is a standout guy and it was great to welcome him to Parliament before the event to hear more about his experiences serving in the Royal Air Force Police - and for a quick tour!\nBoth Mark and Jason are doing such a service in providing a vital support network for our veterans in Ilkley, and I’d like to pay tribute to all those involved in making Ilkley Armed Forces & Veterans Breakfast Club a success.\nWe are forever indebted to our veterans, their families and all who serve, and I will continue to do all I can in Parliament to make sure that we celebrate and support all of our current and former armed service personnel.”\nMark Sugrue said:\n\"It was an absolute privilege to be among so many great people who are doing so much good work in support of veterans. Meeting these stalwarts has shown me that we in Ilkley are on the right path but there is so much more we can do. Our club will strive to meet these goals. It was also pleasing to see so many MPs that genuinely have veteran issues high on their agendas. Per ardua ad astra.\"",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_category_Speeches/content_5.html": "MP makes plea for more early diagnosis of Special Education Needs 9th February 2022 Keighley and Ilkley MP Robbie Moore has used a debate in Parliament to raise his concerns about the lack of early diagnosis for Special Education Needs, such as... Speeches\nGrooming gangs brought to the forefront in Parliament. 9th February 2021 Keighley and Ilkley MP Robbie Moore brought the abhorrent problem of child sexual exploitation and grooming gangs to the forefront last week in a Parliamentary... Speeches",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_category_Westminster-News/content_7.html": "Campaigners present new Road to Nanny Regulation Propsosals 4th November 2023 Keighley and Ilkley MP Robbie Moore has met with local nannies and campaigners Maria Culley and Allie Bell to hear new proposals for nanny regulation. The pair... Westminster News\nLocal Veteran celebrated at Downing Street 15th September 2023 A local Veteran has been celebrated at Downing Street this week. Ilkley's own Mark Sugrue, a former Royal Air Force Police Operative who has served across the... Westminster News\nFirst Look at new Airedale Hospital at Showcase Event in Parliament 28th July 2023 A first look at the plans for a new Airedale Hospital have been showcased in Parliament. VR technology, videos and models were on hand to give a view of the... Westminster News\nRenewed calls to Scrap Council's Clean Air Zone Tax 21st July 2023 Keighley’s MP Robbie Moore has renewed his opposition to Bradford Council's Clean Air Zone Tax, raising concerns from residents across East Morton with the... Westminster News\nMP joins young people in parliament to discuss how to level-up apprenticeships 17th July 2023 Keighley and Ilkley’s MP, Robbie Moore, has joined young people, major business organisations and policy leaders to discuss how to level-up apprenticeships for... Westminster News\nMP backs local railway ticket offices 5th July 2023 Keighley & Ilkley MP Robbie Moore has backed local railway ticket offices after Northern Rail announced plans for closure. Industry body the Rail Delivery Group... Westminster News\nIlkley has Pride 4th July 2023 Organisers of Ilkley’s second annual Pride event to celebrate the town’s LGBTQ+ community say the event was a “beacon of hope” for the community. Large crowds... Westminster News\nResidents urged to make their views known on Bradford Breakaway 3rd July 2023 Two Bradford district MPs who are campaigning to break away from Bradford Council and form a separate authority are urging people to comment on a new... Westminster News\nIt’s Official - Constituency name to change to “Keighley & Ilkley” 2nd July 2023 The Boundary Commission have officially adopted local MP Robbie Moore’s proposals to change the name of the Keighley constituency to “Keighley and Ilkley”, it... Westminster News",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_cdn-cgi_l_email-protection/content_29.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_campaigns_ps336m-investment-keighley/content_25.html": "Keighley is receiving £33.6m as part of our Town Deal from our Conservative government to make our community an even better place to live.\nKeighley has been forgotten and ignored for too long - no more. This Town Deal is a major stepping stone in helping us transform our community.\nThe bid submitted to government was put together last autumn and winter by the Keighley Towns Fund Board. The board was chaired by local businessman Ian Hayfield of Hayfield Robinson, with Keighley College Principal Steve Kelly acting as Vice Chair. Local MP Robbie Moore was delighted to sit on the board too, and I want to thank them both for their fantastic work in helping to get this project off the ground.\nSince we submitted the bid, Robbie Moore has been constantly lobbying hard in Westminster to secure the best deal for our town, and is delighted with the announcement.\nSkills and Jobs\nThe £33.6m Town Deal will fund the creation of a new Manufacturing, Engineering and Future Technology Hub to specialise in training local people in critical manufacturing and engineering skills, to help create more local jobs.\nA new Skills Hub will also be established, delivering training in digital, communication and personal development skills.\nHealthcare\nThe government funding will contribute towards a new Keighley Health and Wellbeing Centre to improve local healthcare services and cut waiting times.\nI have, however, reiterated my view to both the government and Bradford Council that this must be built on a brownfield site, not on our precious green open spaces.\nRegeneration\nThe Town Deal includes the regeneration of Low Street, improvements to Church and Albert Yards, as well as a major tree planting programme.\nTransport\nPublic transport infrastructure will also be upgraded to provide better and more reliable services, including real time bus information.\nCulture and Community\nCommunity groups will benefit through a new Community Grant Scheme specifically for Keighley and parts of the Worth Valley to help smaller community projects get a share of the funds. A new Keighley Creative Art Hub has also been secured, alongside the development of Keighley Art and Film Festival.\nDevelopment\nA £15m Development Investment Fund will be established to bring brownfield sites back into use, creating new spaces for businesses to grow, as well as space for new start-ups.\nRobbie is extremely excited for what the Town Deal means for our town, having lobbied the government in Westminster. This is just the start of the journey as we recover from the pandemic, but will ensure we can build back better.",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_news_grooming-gangs-brought-forefront-parliament/content_10.html": "Keighley and Ilkley MP Robbie Moore brought the abhorrent problem of child sexual exploitation and grooming gangs to the forefront last week in a Parliamentary debate on the matter.\nThe debate was brought about to consider the two e-petitions entitled ‘We the British People Request a Public Inquiry into Grooming Gangs’ and ‘Release the Home Office's Grooming Gang Review in full’ which were signed by 31,211 people and 131,625 people respectively.\nIn his opening remarks, Robbie paid tribute to the former MP for Keighley and Ilkley, Ann Cryer (1997-2010) who was one of the first MP’s to raise concerns about grooming gangs and child sexual exploitation within the Pakistani community in West Yorkshire over 20 years ago. However very little has changed since this issue was first brought to light. Indeed, Robbie commented on how much correspondence he still receives on this matter and that grooming gang cases are still being investigated and working their way through the courts.\nIn 2016, a group of 12 men who committed serious sexual offences against two girls in Keighley and Bradford were jailed for a collective 130 years. Last October, 21 men from Keighley and Bradford were arrested for being linked to offences that allegedly occurred against a young female between 2001 and 2009.\nSpeaking in the Chamber, Robbie said: “ My view is that unless we talk about these heinous crimes openly we are failing, so let us call this problem out for what it is: predominantly a small minority of largely Muslim men in West Yorkshire, including, I am sad to say, in Keighley, that have been sexually exploiting young children for far too long. The Muslim community are quite rightly outraged at the entire community being branded with the same accusation. It is not fair and it is deeply offensive.”\nRobbie also made reference to the risk of not addressing the issue, commenting “at the centre of this are innocent, vulnerable young girls whose lives have been ruined through no fault of their own. If we fail to address this, the worst of humanity may exploit it for their own gain. This has already happened of course in the 2005 general election when the far-right BNP made Keighley their No. 1 target seat. We cannot let that happen again.”\nRobbie concluded his speech by stating “these are difficult issues to tackle, but all of us in Parliament have a responsibility to take action, because if we do not, we will have failed, and the consequences for our communities will be far too great.”\nYou can view Robbie’s full speech in the House of Commons here: https://hansard.parliament.uk/Commons/2021-02-03/debates/65D3BAF4-00FF-…",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_search/content_20.html": "As many may have read, proposals have been put forward to build what will be England’s largest onshore wind farm. 65 colossal turbines towering over the wild, beautiful landscape of Walshaw Moor on the edge of Bronte country.On paper, it sounds like a triumph for renewable energy.\nLocal MP Robbie Moore has welcomed the progress being made to upgrade the Silsden to Kildwick towpath, with improvement works now well underway and an expected completion date in June.Following a recent update meeting with the Canal & River Trust, who are delivering the works alongside contracto\nIn a scathing speech in Parliament, Keighley and Ilkley’s MP Robbie Moore has condemned the long-standing decision by Bradford Council to green-light the proposed Aire Valley Incinerator in 2016— a decision Mr Moore says says poses a grave threat to public health and the local environment.It comes a\nThe extension to Grange Park Surgery in Burley-in-Wharfedale has been opened.The existing building opened in 1987 to house 4600 patients and 8 members of staff.\nLocal MP Robbie Moore has welcomed the progress being made to upgrade the Silsden to Kildwick towpath, with improvement works now well underway and an expected completion date in June.Following a recent update meeting with the Canal & River Trust, who are delivering the works alongside contracto\nKeighley station’s stunning transformation is complete following a £9.9m investment.The grade II-listed station – built in 1885 – had been showing signs of age, with parts closed off because of safety concerns.An 18-month overhaul has seen it restored in its classic colours of yellow vanilla and “Ke\nWatching Bradford Council’s latest budget meeting, it was impossible not to feel a mix of both fury and second-hand embarrassment for the controlling Labour group. Over the past few years, the Council’s leadership has been a slow-motion car crash.\nFollowing Santander’s announcement that it will close its Ilkley branch, LINK has confirmed that Ilkley will receive a banking hub—ensuring that local residents and businesses still have access to vital in-person banking services.Banking hubs provide a shared space for multiple banks to offer in-per\nLocal MP Robbie Moore has praised the “extraordinary” work of Keighley Community Transport, a service that has been a lifeline for vulnerable people in the town for 40 years.Founded in 1984, Keighley Community Transport operates a fleet of minibuses, including wheelchair-accessible vehicles, to supp",
  "https_www_robbiemoore_org_uk_/https_www_robbiemoore_org_uk_localauthorityboundariesbill/content_11.html": "My Local Authority Boundaries Bill is the latest part of my campaign to get Keighley and Ilkley, along with neighbouring Shipley, out of Bradford Council and forming their own local authority.\nPassing its first reading unanimously on 7 December 2022, my bill's second reading is due on 24 March 2023.\nThe outline of the bill provides for two or more parliamentary constituencies to form their own unitary authority on the basis that:\n- Public support for the new authority is gained through a referendum\n- The newly created and residual local authorities are organisationally and financially viable, and capable of delivering services to local residents.\nCampaigns"
}