{
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_2024_04_07_white-ribbon-vigil/content_13.html": "Tackling violence against women and girls demands a “whole society approach”. Here is the video I did in support of the White Ribbon Campaign.\nTackling violence against women and girls demands a “whole society approach”. Here is the video I did in support of the White Ribbon Campaign.",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com/content_1.html": "Hello,\nHave just been reading Labour’s crime and justice manifesto in which it clearly states the plan to scrap PCCs.\nCan I sense-check if this is still the case, and what plans are being put in place for local accountability? Moreover, how will this you impact on you – i.e. local electorate voting for you only to be replaced by ? at a later date! Thanks.\nHi Gary,\nLabour did oppose the introduction of PCCs in 2012. A lot of the concern at the time was about the politicisation of the operational delivery of policing. That hasn’t happened, and since 2016 Labour policy has been to retain PCCs.\nAn important part of the role of the PCC is to hold the police to account, to scrutinise their work, ranging from how well they support victims of sexual offences, for example, to ensuring they are more visible and accessible.\nBut how is the PCC held to account? An important mechanism is the Police and Crime Panel, which was specifically set up for that purpose. However, I am keen to develop numerous ways of engaging with the residents of Thames Valley, both in person and online, to listen to their concerns and represent them as well as possible.\nI completely agree. Rebuilding community policing is a key element of restoring trust in policing, which is badly needed. This is what Yvette Cooper had to say on the subject: https://www.bbc.co.uk/news/uk-politics-64652746\nI will definitely vote labour but please, your opening line on the leaflet,, ‘bobbies’…… come in, they’re ‘Officers.’ The term Bobby is old fashioned. It’s like calling all nurses ‘dear’ as they’re all female.\nGreat if you can say your policy on 20 mph enforcement. Some in Labour are for it. I am just sad that my local Labour Councillor is just unresponsive on the topic.. i suspect thag\nPlease can say your policy on 20 mph enforcement? Some in Labour are for it. I am just sad that my local Labour City Councillor here in Oxford is just unresponsive on the topic, despite him and I living to a road where a fatality attributable to 20 mph non compliance is just waiting to happen. I know the City cant control enforcement but am genuinely confused as to what the Labour position is. On the doorstep labour blame resources, but my hunch is that Police culture is the issue here…plus lack of PCC care about the issue of near total 20mph non-compliance.\nI am in favour of the enforcement of 20mph speed limits. Unfortunately, these have very rarely been enforced. I have also been in discussion with councils across Thames Valley about the possibility of delegating enforcement powers to local councils for speed limits. Councils are often frustrated by the lack of support from the police and are very willing to undertake enforcement on certain roads themselves. However, it is done, there needs to be better enforcement. I further support the Vision Zero mission adopted by Oxfordshire County Council to end all deaths and serious injuries on our roads by 2050.\nWe need more bobbies on the beat policing the streets not sitting in their cars. They are not integrating with the public that’s why there’s so much dislike from the public towards them. We just see them quickly driving through the housing estates very occasionally … totally out of touch! Bring back the local bobbies. what is the view on this by Labour.\nI completely agree. A big problem is both cuts to neighbourhood policing over many years but also the fact that neighbourhood policing teams are now mainly made up of Police Officers rather than PCSOs. Police officers need to be in, or near, a car so they can respond if called. PCSOs are on foot and so will spend more time engaging with their communities. Strengthening neighbourhood policing would be my priority as Police and Crime Commissioner. A Labour government would legislate to require police forces to conduct foot patrols of town centres. Thanks you for getting in touch.\nI would broadly welcome the return of PCSOs, but they DO need powers of arrest and a lot more clout behind them. Otherwise there would not be much point. For example, in Reading town centre, where PCSOs were often able to arrive well before the “main” Police, I have seen a very troublesome drug user just running off, knowing that he would not be arrested. There must have been numerous other examples.\nHello,\nHave just been reading Labour’s crime and justice manifesto in which it clearly states the plan to scrap PCCs.\nCan I sense-check if this is still the case, and what plans are being put in place for local accountability? Moreover, how will this you impact on you – i.e. local electorate voting for you only to be replaced by ? at a later date! Thanks.\nLikeLike\nHi Gary,\nLabour did oppose the introduction of PCCs in 2012. A lot of the concern at the time was about the politicisation of the operational delivery of policing. That hasn’t happened, and since 2016 Labour policy has been to retain PCCs.\nAn important part of the role of the PCC is to hold the police to account, to scrutinise their work, ranging from how well they support victims of sexual offences, for example, to ensuring they are more visible and accessible.\nBut how is the PCC held to account? An important mechanism is the Police and Crime Panel, which was specifically set up for that purpose. However, I am keen to develop numerous ways of engaging with the residents of Thames Valley, both in person and online, to listen to their concerns and represent them as well as possible.\nLikeLike\nWe need the return of proper community policing. Local police officers liaising, walking and talking to people.\nLikeLike\nI completely agree. Rebuilding community policing is a key element of restoring trust in policing, which is badly needed. This is what Yvette Cooper had to say on the subject:\nhttps://www.bbc.co.uk/news/uk-politics-64652746\nLikeLike\nHi i would like to support you with your election campaign how can i get involved\nLikeLike\nBrilliant! Please send me an email at TimStarkeyLabour@gmail.com\nLikeLike\nI will definitely vote labour but please, your opening line on the leaflet,, ‘bobbies’…… come in, they’re ‘Officers.’ The term Bobby is old fashioned. It’s like calling all nurses ‘dear’ as they’re all female.\nLikeLike\nGreat if you can say your policy on 20 mph enforcement. Some in Labour are for it. I am just sad that my local Labour Councillor is just unresponsive on the topic.. i suspect thag\nLikeLike\nPlease can say your policy on 20 mph enforcement? Some in Labour are for it. I am just sad that my local Labour City Councillor here in Oxford is just unresponsive on the topic, despite him and I living to a road where a fatality attributable to 20 mph non compliance is just waiting to happen. I know the City cant control enforcement but am genuinely confused as to what the Labour position is. On the doorstep labour blame resources, but my hunch is that Police culture is the issue here…plus lack of PCC care about the issue of near total 20mph non-compliance.\nLikeLike\nI am in favour of the enforcement of 20mph speed limits. Unfortunately, these have very rarely been enforced. I have also been in discussion with councils across Thames Valley about the possibility of delegating enforcement powers to local councils for speed limits. Councils are often frustrated by the lack of support from the police and are very willing to undertake enforcement on certain roads themselves. However, it is done, there needs to be better enforcement. I further support the Vision Zero mission adopted by Oxfordshire County Council to end all deaths and serious injuries on our roads by 2050.\nLikeLike\nWe need more bobbies on the beat policing the streets not sitting in their cars. They are not integrating with the public that’s why there’s so much dislike from the public towards them. We just see them quickly driving through the housing estates very occasionally … totally out of touch! Bring back the local bobbies. what is the view on this by Labour.\nLikeLike\nI completely agree. A big problem is both cuts to neighbourhood policing over many years but also the fact that neighbourhood policing teams are now mainly made up of Police Officers rather than PCSOs. Police officers need to be in, or near, a car so they can respond if called. PCSOs are on foot and so will spend more time engaging with their communities. Strengthening neighbourhood policing would be my priority as Police and Crime Commissioner. A Labour government would legislate to require police forces to conduct foot patrols of town centres. Thanks you for getting in touch.\nLikeLike\nI would broadly welcome the return of PCSOs, but they DO need powers of arrest and a lot more clout behind them. Otherwise there would not be much point. For example, in Reading town centre, where PCSOs were often able to arrive well before the “main” Police, I have seen a very troublesome drug user just running off, knowing that he would not be arrested. There must have been numerous other examples.\nLikeLike",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_2024_04_28_rooting-out-misogynist-misconduct/content_9.html": "(Press release 1st Feb 2024)\nA BBC investigation has revealed how Newbury based police officers made sickening comments about an assault victim while watching body-worn video showing her groin. Police had arrested the woman in Newbury Town Centre last year, after mistakenly believing that she had committed an assault. She had, in fact, been the victim. On the way back to the police station she suffered from a seizure, which left her chest and genitals exposed. Officers watching footage of the incident insulted her looks, used derogatory language about her genitals and discussed what they would need to be paid to sleep with her.\nLabour’s candidate for Police and Crime Commissioner in Thames Valley, Tim Starkey, says the incident raises serious questions about the police force’s approach to rooting out misogynist behaviour. He asks:\n“Why did it take a police investigation for Thames Valley Police to report this case to the Independent Office for Police Conduct? Why were details of this misconduct kept from the public eye? What were the circumstances in which the student officer reporting this came to be dismissed?”\nTim added “Holding the police to account goes to the heart of the role of Police and Crime Commissioner. In my work as a barrister prosecuting rape and domestic abuse cases I see how vital it is that victims have trust in the police. I have worked with incredibly dedicated and professional officers. However, it is vital that misogynistic attitudes and behaviour are rooted out, so that victims can approach police with confidence”.\nNotes to editor:\nLink to BBC story Police officers mock body-worn video of semi-naked woman – BBC News",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_2024_04_27_questions-from-coalition-for-healthy-streets-and-active-travel/content_2.html": "1. Within policing overall, what are your priorities, if you are elected PCC? What are the resource implications?\nMy mission will be to rebuild trust in police. I would do this through a) Strengthening neighbourhood policing. Whilst there have been recent increases, just a year ago community policing had been decimated to a point that there were only about 150 police officers across 108 Neighbourhood “teams” in Thames Valley b) an overhaul of the vetting and misconduct procedures so that victims of domestic abuse or sexual offences can have trust in the officers dealing with their cases.\nI would focus on:\n- Reducing violence against women and girls. In my work as a criminal barrister, I see first hand the impact on victims of lengthy delays and poor communication from the police.\n- Education, mentoring and targeted interventions to steer young people away from gangs, county lines and knife crime.\n- Making our roads safe for all users. Thames Valley was one of only 2 police areas in the country to see an increase in road traffic incidents last year.\n- Stopping the surge in shoplifting (up 37% in the last year) by working with businesses to identify prolific offenders and ban them from crime hotspots.\n- Working with our thriving local tech industry to help keep us safe online.\n2. Within roads policing, what are your priorities, if you are elected PCC? Are there any specific initiatives that you plan? What are the resource implications?\nI fully support the “vision zero” aim to end deaths and serious injuries on Oxfordshire’s roads by 2050. Whilst technological change has, long term, made the roads safer for those driving cars, there has not been a corresponding fall in fatalities and serious injuries for cyclists and pedestrians. So it is urgent to ensure the protection of all road users.\nSpeeding remains the biggest factor in road deaths, (see my response to the next question). However, drink and drug driving causes nearly 15% of road deaths. As PCC I will call for the police to be given the power to conduct random breathalyser checks near night clubs, pubs etc, as happens in most EU countries.\nI will extend the use of 3rd party reporting of dangerous driving, mobile phone use etc. Used widely, this has a significant deterrent effect.\nDangerous parking – for example near junctions or forcing those with mobility scooters into the road or putting children walking to school at risk – is an issue people across Thames Valley have raised with me. Introducing the Park Safe scheme (piloted in Sheffield) would making it far easier for residents to report and upload evidence of dangerous parking to police.\n3. Speeding is highlighted as the greatest danger in the survey, and post-investigation recording. How will you tackle speeding, on both urban and rural roads? What are your views on 20mph speed limits?\nI welcome the introduction of 20mph speed limits, when done with support from local residents. However, the enforcement of 20mph limits has been almost non-existent. Having consulted with councillors across Thames Valley I am in favour of local councils being given the power to enforce 20 mph speed limits themselves.\nAverage speed cameras are an important tool that should be used across Thames Valley. Whilst I welcome the fact that in the last couple of months TVP has finally begun installing average speed cameras, in other forces they have been a widespread and common part of enforcement for years.\nFinally, an important part of the mix is in making the work of volunteer Speedwatch groups more effective, in collaboration with neighbourhood policing (see my answer to the next question).\n4. Law enforcement can be improved by working in partnerships and with communities. How will you work with other organisations and citizens to reduce crime if you are elected?\nThe Police and Crime Commissioner is uniquely placed to forge partnerships between police and organisations in wider society. One such vital partnership is with schools: whether it comes to messages about knife crime or about the meaning of consent in healthy sexual relationships.\nAnother example, is in relation to tackling the growth of online fraud – something traditional policing has proved ill equipped to deal with. I want to build partnerships with local tech firms to provide volunteering opportunities for their employees to give advice to small businesses, or through charities such as Age UK.\nA final example relates to volunteer Speedwatch groups. They can be made more effective by:\n- Sometimes working alongside neighbourhood officers using speed guns so that passing motorists can’t assume they are only at risk of a warning letter if speeding.\n- Getting letters out to speeding motorists faster, it currently often takes 6 weeks.\n- Follow the West Berkshire example of local authority involvement to facilitate a data led approach of where Speedwatch groups should target their activity.",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_about-tim/content_4.html": "I live with my family in Chalfont St Giles, Bucks. I have worked for the last 22 years as a barrister, both prosecuting and defending in all types of cases from speeding to murder, from rape to drug importation. This range of experience has shown me how all too often the criminal justice system fails people, and what needs to change.\nAt the heart of my campaign is the need to rebuild trust in policing. Over the last few months I have been travelling widely across Thames Valley, listening to residents’ concerns over the lack of visible, neighbourhood policing, road safety, the surge in shoplifting, knife crime, the explosion of internet fraud and improving the response of the criminal justice system to offences of Violence against Women and Girls.\nPlease get in touch to share your views or if you wish to volunteer to help with my campaign.\nI am very touched by this endorsement from former TVP Detective Superintendent and policing academic, Roy Bailey.\nI am a newly re-joined Labour member with centrist instincts. I have had slight peripheral involvement with a school for abused children and probation office dealing with rehabilitating young offenders. I believe it is very important to help young disadvantaged people to get back on/choose the right track at their potentially pivotal age. What are your/the party’s views on short term prison sentences for young offenders where they are just parked for a few weeks with no help, and reinstating the youth clubs, sports and other facilities for young people to keep them off the streets and give them some interest and pride?\nRobert\nrobert@thehockett.com\nLikeLiked by 1 person\nHi Robert\nThank you very much for getting in touch.\nThe one criminal justice measure that I agreed with in the King’s Speech was introducing a presumption against short prison sentences. For the most part they are counter-productive. No meaningful rehabilitative work is done, the defendant is put in touch with more experienced criminals and sometimes they lose their accommodation whilst in prison.\nI think your emphasis on diverting youth away from crime is absolutely right. Yvette Cooper has spoken about creating a network of “youth hubs” across the country, a form of “sure start for teenagers”. The Police and Crime Commissioner has some spending powers in relation to crime prevention measures as well as simply policing. I’m looking forward to working in partnership with local councils (of all political colours) across TV to help prevent youth crime in the first place.\nI would be very interested in drawing on the experience you outline in your comment. To speak further, please email me on TimStarkeyLabour@gmail.com\nLikeLike\nHi Gary – I’m a Labour member in Reading – I do a lot of work training in custody and ex -offenders how to start their own business. Ran a few programmes with pcc in Sussex. Happy to have a chat about rehabilitation etc if your interested\nLikeLike\nHi Phil\nThank you so much for getting in touch. Yes -I’d be really interested in talking to you. Could you send an email to TimStarkeyLabour@gmail.com ?\nLikeLike",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_2023_10_29_stop-the-surge-in-shoplifting/content_14.html": "Video of me in Woodley talking about shoplifting:\nShoplifting has soared by 25% in the last year, costing the UK around £1 billion. This is far from a victimless crime. As a consequence, in the middle of the cost of living crisis we are all paying higher prices, and it has become so bad that some shops are struggling to survive. Here are 5 actions Labour would take to tackle this:\n- Restore visible neighbourhood policing to deter thieves and reassure the public.\n- Work with businesses to identify and tackle crime “hotspots” and repeat offenders.\n- Introduce “respect orders” to ban prolific offenders from particular shopping malls or town centres.\n- End the Tory change to the law that re-categorised thefts under £200 leading to them all too often not being prosecuted.\n- Restore funding for drug treatment programmes to tackle one of the root causes of the problem, as 70% of those arrested for shoplifting are addicted to Class A drugs.\nDear Tim,\nAs a retired magistrate I agree with you that shoplifting is not a “victimless” crime. But your proposals will be met with the usual rebuffs from the Conservative Party.\nVisible neighbourhood policing – not enough police.\nBanning persistent offenders – see above: would need to be policed.\nRecategorising offences – more work for the police and the courts.\nFunding for drug abuse programmes – funding where from?\nSo I think that the problem is far deeper than the rather superficial remedies that you propose. We have to go far deeper and be prepared to spend much more on education from the nursery up. It is about changing society’s attitudes to wrong doing.\nLikeLike\nStephen,\nThank you very much for getting in touch. I think you make an excellent point that policing and criminal justice solutions alone are not enough. A “whole society” approach is needed for tackling many different types of crime, which is focussed on changing attitudes. This is true of shoplifting, but also relates, for example, to tackling violence against women and girls.\nIn terms of the “usual rebuffs”:\n– On “visible policing” it isn’t simply about total police numbers, it’s about how police are deployed. Since 2010 the proportion of police involved in neighbourhood policing has reduced from 19% to 12%. It’s also about “churn”. The boom and bust of police numbers under the Tories (getting rid of 20,000 officers, then recruiting 20,000 new ones has contributed to a lack of consistency in neighbourhood policing teams.\n– Banning offenders would need to be policed, but would give the police an immediate tool in dealing with the small number of persistent offenders who commit the majority of shoplifting offences. I had a fascinating conversation with the manager of a Co-op store that has sadly been repeatedly targeted by the same offenders. In the situation he described I believe banning orders would make the police job easier and protect his store.\n– I think it was a mistake for the Tories to re-categorise theft under £200 in 2014. I don’t actually think that prosecution is always the right answer for every low level shoplifter. There will be occasions when a conditional caution and restorative justice would be appropriate. It depends on the type of shoplifter: many are drug addicts, some are in very difficult financial circumstances, some are kids messing around and others are part of organised gangs. The problem is that I am frequently told that often the police simply don’t investigate at all.\n– On drug treatment. This largely falls outside the PCC’s direct control. However, I think it is important to use the role as a platform to put pressure on other bodies to do their part in reducing crime. Up until 2012, the amount of money each council had to spend on drug and alcohol treatment services was ringfenced, until the government decided to give councils autonomy overt how much they spent on this. This has been a disaster. IN 2013/14 councils spent a total of £828 million on substance misuse services.in 2023/24 they have budgeted to spend £617 m. In Windsor and Maidenhead there has been a reduction of nearly 50%. Of course, money is tight for everything. However, I believe that highlighting this issue and making it a priority is important.\n– I would add that there has been a re-distribution of resources under the current PCC away from higher crime urban areas eg. with very big cuts to the community safety fund payments to Reading and Slough. I think it is important to be a PCC for the whole of Thames Valley and focus resources where crime is highest.\nSorry about writing a mini-essay. I would be very keen on drawing on your experience as a retired magistrate and any ideas / observations you have if you want to email me on TimStarkeyLabour@gmail.com\nLikeLike\nThank you for addressing the necessity of focussing on core social issues which cause spikes in crime and shoplifting. We must tackle the issues which perpetuate poverty and addiction – issues which should not, and cannot be solved, by criminalization.\nLikeLike",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_my-priorites/content_5.html": "Despite the dedication of its hard working officers, TVP is under performing. Recently inspected, it ranked “inadequate” for protecting vulnerable people and “requiring improvement” for investigating crime, responding to the public, managing offenders and leadership. My priorities:\nRebuilding trust in police by a) strengthening neighbourhood policing, restoring the link between police and the communities they serve, b) overhauling vetting and misconduct procedures.\nCutting knife crime – not youth services. Working with schools and targeted interventions, including 1:1 mentoring to divert young people away from gangs and county lines, and provide positive role models.\nStopping the surge in shoplifting, working with local businesses to identify repeat offenders and ban them from crime hotspots.\nHere’s a video about shoplifting:\nProtecting women and girls from violence. Rape cases often take 5 years from being reported to coming to trial, causing many victims to drop out. Fast track sexual and domestic abuse cases, improve the sharing of information with women at risk from a violent partner (highlighted in the recent inspection) and work to change the behaviour of perpetrators. However, it goes wider than police, a “whole society” approach is needed to confront and change the type of misogynistic attitudes which allow these offences to happen. Here is a video about the “”White Ribbon” campaign:\nKeeping us safe online. Online grooming has quadrupled since 2016, whilst AI drives ever more sophisticated scams. Use innovative ways of working with our thriving local tech industry to prevent fraud and keep kids safe.\nKeeping all road users safe. TVP was one of only two forces to see a rise in road traffic incidents last year. Through better enforcement and use of third party reporting, TVP can play its part in ending deaths and serious injuries on our roads.\nIn this video I went for a cycle with Paul Gittings, chair of the Reading Cycling Forum, and discussed making the roads safer for cyclists:",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_contact/content_11.html": "Contact Email: TimStarkeyLabour@gmail.com Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading...\nSend me an email at TimStarkeyLabour@gmail.com and I’ll send you details of how to make a donation. Thanks!! LikeLike\nWell done Tim\nLikeLike\nThanks!\nLikeLike\nHow do we donate to your campaign?\nLikeLike\nSend me an email at TimStarkeyLabour@gmail.com and I’ll send you details of how to make a donation.\nThanks!!\nLikeLike",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_2024_04_28_protecting-victims-of-domestic-abuse-clares-law/content_3.html": "[Press release Feb 2024]\nTim Starkey, Labour’s candidate in May’s election for a new Police and Crime Commissioner in Thames Valley has expressed great concern at ongoing failings to protect women and girls in the region. Under Clare’s law – named after Clare Wood, who was murdered in 2009 by her ex-boyfriend George Appleton – people have a right to ask police whether a partner or ex-partner has a history of abusive behaviour.\nFollowing an investigation by the Guardian, it has emerged that one of the police forces doing least to protect women was Thames Valley where the disclosure rate was 18.43% in the two years to March 2023, less than half the national average.\nNicole Jacobs, the Domestic Abuse Commissioner for England and Wales said that while information provided under Clare’s law was “potentially life-saving”, rejected or poorly conducted applications could give “a false sense of security which further endangers the victim”.\nHis Majesty’s Inspectorate of Constabulary has separately sent warnings over Clare’s law to Thames Valley, after inspections highlighted problems including resourcing issues and long delays.\nTim, a local barrister, said that especially at a time of escalating levels of violence against women and girls, this was completely unacceptable and left hundreds of people at risk. “In my work I see the consequences of these failures. We need much more focus on protecting women and girls from violence, whether it is in the streets or in their homes. I work with police all the time and know that officers are dedicated to providing as good a service as possible. Labour will improve their training and resourcing to ensure they can and will improve.”",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_2024_04_23_fight-motorcycle-theft-pledge/content_7.html": "I have been very happy to commit to the following pledge and would like to thank the Motorcycle Action Group for their work in highlighting how motorcyclists are 11 times more likely to suffer theft of their vehicle than a car owner.\n1. I will work to halve motorcycle theft in my jurisdictional area by\nthe end of my four-year term in office.\n2. I will work for the victims – motorcyclists – to hold the Chief\nConstable to account for the performance of the operational police\nresponse, requiring regular published progress reports toward my goal of\nhalving motorcycle theft by 2028.\n3. I will proactively work with the victims – motorcyclists – to\nensure that a local multi-agency approach to creating a meaningful\nprevention strategy is adopted, including riders’ groups, police, local\nauthorities, crown prosecution service, and the judicial system.",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_how-well-are-thames-valley-police-performing/content_10.html": "The starting point for taking over the role of Police and Crime Commissioner is to understand how well or badly Thames Valley Police is serving the public and tackling crime, and what needs to change.\nInspection\nAn objective assessment comes from the regular inspections carried out by His Majesty’s Inspectorate of Constabulary and Fire and Rescue Service (HMICFRS). The most recent PEEL report (judging Police Effectiveness, Efficiency and Legitimacy) was in December. Here is a link:\nHere is a short video explaining the changes in the inspections since Matthew Barber became PCC:\nIs crime going up or down?\nConservative Party leaflets in this election have cherry picked statistics to support their narrative and leaving out, for example, the fact that shoplifting has soared by 37.5% in the year to March 2024. Or that robbery of business premises has increased by 120% in the same period.\nEqually, when it is claimed that crime across Thames Valley has fallen by 1.8% in the last year, it should be noted that:\n- The year before crime increased by 4% in Thames Valley. So crime has gone up not down in the time that Matthew Barber has been Police and Crime Commissioner.\n- These figures do not include fraud.\nTaking a long view, the best description is that the nature of crime is changing. Many types of crime have, in fact, been declining since the mid-1990s. On the other hand, online grooming has quadrupled since 2016 and internet based fraud is the type of crime we are all most likely to experience.\nHere is a link to the statistics:\nSummary of notifiable offences in Thames Valley March 2023 To February 2024\nWhat about police numbers?\nThere has been a boom and bust of police numbers since 2010.\nFirst, the Conservative / Lib Dem coalition government cut police by 20,000. Then, in 2019 the Conservatives decided to recruit 20,000 more police. The Conservatives claim that there are more police in Thames Valley than ever before. However, this is not true per head of population. Thames Valley has the fastest growing population of any police force anywhere in the country outside London (Metropolitan Police).\nConservative leaflets also claim to have “doubled neighbourhood policing”. However, it should be noted that this is not over the time the Conservatives have been in charge, or even over the time that Matthew Barber has been Police and Crime Commissioner. Instead, this is from a point last year when neighbourhood police teams had been reduced to just 150 officers, for 108 neighbourhood police teams. Crucially, it also doesn’t take into account PCSOs. Neighbourhood teams are made up of a mix of officers and PCSOs. However, PCSOs have been reduced from 472 in Thames Valley in 2015 to 252 now. So neighbourhood teams have not been doubled in strength.",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_what-is-a-police-and-crime-commissioner/content_8.html": "The starting point for understanding the role is that the police need civilian oversight. Nobody would argue that the police should have tax raising powers – so it’s down to the PCC to set the police precept (the part of your council tax that goes to the police). Nobody would argue that the police alone should decide what the priorities for policing should be – so it’s down to the PCC to be the voice of the public in setting the police and crime plan for the area. Equally nobody would say the police should police themselves. So its for the PCC to hold the police to account.\nBut the role goes wider than just the police. The PCC has responsibility for victims services, crime prevention and partnership working with a whole range of agencies.\nIts often argued that the role shouldn’t be political. However, it seems to me that issues of taxation, public money and public safety are inherently political. What is most important is make sure the operational side doesn’t become political. For this reason, the PCC can’t make operational decisions, such as to who to arrest for example.\nHere is a link to the BBC Politics South debate (aired on Sunday). This has a very good explainer at the start about what the PCC role is about.\nhttps://www.bbc.co.uk/iplayer/episode/m001yv27/politics-south-28042024",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_2024_04_28_another-wayne-couzens-could-be-operating-in-plain-sight/content_6.html": "[Press release from March 2024]\nOn the third anniversary of the murder of Sarah Everard, Tim Starkey, Labour’s candidate for Police and Crime Commissioner, is supporting Labour’s call for mandatory national vetting standards for police.\nFollowing a report into the murder of Sarah Everard by serving Met police officer Wayne Cozens, Labour has called for urgent reform to vetting and misconduct procedures in all police forces, including Thames Valley.\nThe Angiolini inquiry has found that the serving Met Police officer Wayne Couzens who kidnapped, raped and murdered Sarah Everard had been reported to police eight times for indecent exposure. He was also alleged to have committed other sexual offences over a number of years.\nLabour’s candidate for Thames Valley Police and Crime Commissioner warns “another Wayne Cozens could be operating in plain sight”.\nMr Starkey described as shocking the multiple failures in investigating Mr Couzens’ indecent exposure offences, which could have stopped him in his tracks, adding “better training and higher priority must be given to tackling this type of offending that all too often escalates, with tragic consequences.”\nLabour has called for mandatory national vetting standards, so no-one with a history of domestic abuse or sexual offending would be allowed to join the police and any officer facing an investigation for such offences would be automatically suspended.",
  "https_timstarkeylabour_wordpress_com_/https_timstarkeylabour_wordpress_com_author_timlukestarkey/content_12.html": "1. Within policing overall, what are your priorities, if you are elected PCC? What are the resource implications?\nMy mission will be to rebuild trust in police. I would do this through a) Strengthening neighbourhood policing. Whilst there have been recent increases, just a year ago community policing had been decimated to a point that there were only about 150 police officers across 108 Neighbourhood “teams” in Thames Valley b) an overhaul of the vetting and misconduct procedures so that victims of domestic abuse or sexual offences can have trust in the officers dealing with their cases.\nI would focus on:\n- Reducing violence against women and girls. In my work as a criminal barrister, I see first hand the impact on victims of lengthy delays and poor communication from the police.\n- Education, mentoring and targeted interventions to steer young people away from gangs, county lines and knife crime.\n- Making our roads safe for all users. Thames Valley was one of only 2 police areas in the country to see an increase in road traffic incidents last year.\n- Stopping the surge in shoplifting (up 37% in the last year) by working with businesses to identify prolific offenders and ban them from crime hotspots.\n- Working with our thriving local tech industry to help keep us safe online.\n2. Within roads policing, what are your priorities, if you are elected PCC? Are there any specific initiatives that you plan? What are the resource implications?\nI fully support the “vision zero” aim to end deaths and serious injuries on Oxfordshire’s roads by 2050. Whilst technological change has, long term, made the roads safer for those driving cars, there has not been a corresponding fall in fatalities and serious injuries for cyclists and pedestrians. So it is urgent to ensure the protection of all road users.\nSpeeding remains the biggest factor in road deaths, (see my response to the next question). However, drink and drug driving causes nearly 15% of road deaths. As PCC I will call for the police to be given the power to conduct random breathalyser checks near night clubs, pubs etc, as happens in most EU countries.\nI will extend the use of 3rd party reporting of dangerous driving, mobile phone use etc. Used widely, this has a significant deterrent effect.\nDangerous parking – for example near junctions or forcing those with mobility scooters into the road or putting children walking to school at risk – is an issue people across Thames Valley have raised with me. Introducing the Park Safe scheme (piloted in Sheffield) would making it far easier for residents to report and upload evidence of dangerous parking to police.\n3. Speeding is highlighted as the greatest danger in the survey, and post-investigation recording. How will you tackle speeding, on both urban and rural roads? What are your views on 20mph speed limits?\nI welcome the introduction of 20mph speed limits, when done with support from local residents. However, the enforcement of 20mph limits has been almost non-existent. Having consulted with councillors across Thames Valley I am in favour of local councils being given the power to enforce 20 mph speed limits themselves.\nAverage speed cameras are an important tool that should be used across Thames Valley. Whilst I welcome the fact that in the last couple of months TVP has finally begun installing average speed cameras, in other forces they have been a widespread and common part of enforcement for years.\nFinally, an important part of the mix is in making the work of volunteer Speedwatch groups more effective, in collaboration with neighbourhood policing (see my answer to the next question).\n4. Law enforcement can be improved by working in partnerships and with communities. How will you work with other organisations and citizens to reduce crime if you are elected?\nThe Police and Crime Commissioner is uniquely placed to forge partnerships between police and organisations in wider society. One such vital partnership is with schools: whether it comes to messages about knife crime or about the meaning of consent in healthy sexual relationships.\nAnother example, is in relation to tackling the growth of online fraud – something traditional policing has proved ill equipped to deal with. I want to build partnerships with local tech firms to provide volunteering opportunities for their employees to give advice to small businesses, or through charities such as Age UK.\nA final example relates to volunteer Speedwatch groups. They can be made more effective by:\n- Sometimes working alongside neighbourhood officers using speed guns so that passing motorists can’t assume they are only at risk of a warning letter if speeding.\n- Getting letters out to speeding motorists faster, it currently often takes 6 weeks.\n- Follow the West Berkshire example of local authority involvement to facilitate a data led approach of where Speedwatch groups should target their activity."
}