{
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_wp-login_php/content_12.html": "For security and auditing purposes, a record of all of your logged-in actions and changes within the WordPress dashboard will be recorded in an audit log. The audit log also includes the IP address where you accessed this site from.\nLost your password?\n← Go to Carol Linton",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_category_uncategorized/content_3.html": "Physical Activities\nSports England has lots of free exercise classes https://www.sportengland.org/jointhemovement\nThe local Active Fitness club is running upto 8 different online exercise classes a day for members. https://burnham.activefitnessclub.co.uk/\nThere are lots of videos on https://www.youtube.com/ for exercise instruction.\nFavourite walks\nGames\nBurnham Bridge Centre https://www.bridgewebs.com/burnham/\nhttps://www.bridgebase.com/ is an American site and has been recommended. You can play for free in friendly games but also for more competitive games you can pay in dollars on your credit card.\nChess At https://www.chessos.com/home, you can play with a friend or unknown opponents. There are many apps also for playing chess against a computer available on your phone or tablet app shop.\nThere are many apps also for playing chess against a computer available on your phone or tablet app shop.\nPuzzles and Apps are available on a smart phone from the Apps store or online, including from the main newspaper sites. You can access more than thousands of crosswords and sudoku and solve puzzles online – for free.\nGuardian https://www.theguardian.com/info/2020/feb/10/the-guardian-puzzles-app?device=other\nIndependent https://puzzles.independent.co.uk/?utm_campaign=navbar&utm_medium=nav&utm_source=navpuzzles\nhttps://www.sporcle.com/ is the world’s largest trivia quiz website.\nOnline courses on just about anything are available, to further your professional or personal development, or understand the world around you. Here are just a few examples\nhttps://www.futurelearn.com/ online courses to continue studying, build professional skills, and connect with experts.\nhttps://www.edx.org/ with nearly 3000 different courses\nhttps://www.open.edu/openlearn/ from the Open University\nTo Make\nPaper models\nIf you have a printer, great free models to make are at https://creativepark.canon/en/contents/CNT-0024615/index.html\nKnitting or crochet? Create an account at https://www.ravelry.com/about",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_choosing-a-secondary-school/content_9.html": "Since the non-selective school in Burnham closed in 2019, local parents are left with difficult choices and little information. Please contact newschool@burnhamparish.gov.uk with comments and corrections.\nKnow your options and be realistic about your expectations and your child’s needs.\nConsiderations\n- Is a grammar school the right option for your child?\n- What is the catchment area now? The nearest school is measured in a straight line, and may differ that determined from the transport rules.\n- Is transport available, at what cost and time?\n- Is disability support, special needs or behaviour strategy a consideration?\n- Is the religious affiliation and practice a concern?\n- What subjects are available and what is compulsory?\n- What sports and arts facilities are available, and which clubs are of interest?\n- Popular schools are likely to be over-subscribed and not available of out of area pupils.\n- Where are friends going? Implication on child’s social activities and interests.\nInvestigate\n- Check the school website and make a list of questions.\n- Visit the school with the child but manage their expectations.\n- Talk to existing pupils and parents (not those from 3 years ago). Schools change fast with a rotation of staff and a different pupil intake every year.\n- Support for any special needs whether diagnosed or not.\n- Check transport arrangements for individual schools. If free transport is not provided, it is the parents responsibility, and there may not be any public transport.\n- Ofsted reports are an indication but may be out of date.\n- Check school facilities (breakfast clubs, after hours homework space, sports), and alternative transport arrangements (after a school outing or detention).\n- Consider cost of school trips (skiing in Switzerland !) and events (ticketed presentations). This can vary greatly depending on the school.\n- Uniform and equipment requirements and costs. Is a computer provided?\nMost popular local Secondary schools\nThe local authorities aim to have full school roles so vacancies are limited, and school catchment areas may restrict your choice. Contact the schools and local authorities (see later) for up-to-date details.\nBurnham Grammar School is in Burnham. Pupils are admitted into year 7 if they achieve sufficient marks in the Buckinghamshire 11+ exam taken at the start of year 6. Approximately 30% of pupils who take the exam pass. Contact the school for information on joining in later years.\nCox Green is a comprehensive school in Maidenhead. Comprehensive schools cater for all abilities, but Maidenhead pupils can take an 11+ exam and attend a grammar school in another area. About a third of local Burnham pupils go there. Coaches are provided from several points in Burnham and cost about £1400 a year.\nBeechwood is a non-selective school near Farnham Royal just in Slough, 2 miles from Burnham High Street. The 53 bus passes nearby. Cycling might be possible through the Britwell Estate.\nBourne End Academy is a non-selective school about 4 miles from the Gore. There is no public transport available, but Buckinghamshire Council must organise transport for those entitled to free transport (see later). The roads are unsuitable for cycling or walking.\nPioneer Academy is a non-selective school about 4 miles from the High Street. It is Sikh ethos and the curriculum reflects that. There is no public transport available, but Buckinghamshire Council must organise transport for those entitled to free transport (see later). The roads are unsuitable for cycling or walking.\nAtwood in Maidenhead is Church of England and St Josephs in Slough is Roman Catholic. Both take a number of local pupils.\nLocal non-selective Secondary Schools\n| Buckinghamshire schools | Maidenhead schools | Slough west schools | Slough schools | Slough East |\n| BEA Bourne End PAS Pioneer Academy BS Beaconsfield Secondary CCC Chalfont Community College | FP Furze Platt NGS Newlands Girls School A Altwood CG Cox Green D Desborough | BW Beechwood WG Westgate EG Eden Girls School GA Grove Academy | LH Lynch Hill Enterprise BC Bayliss Court S&E Slough & Eton WSS Wexham | StJ St Joseph’s Catholic DP Ditton Park LA Langley Academy |\nCheck school admissions\nIn Buckinghamshire, https://schools.buckinghamshire.gov.uk/school-admissions\nIn Slough, https://www.slough.gov.uk/directory/18/slough-schools/category/35\nIn Maidenhead, https://www.rbwm.gov.uk/schools-and-education\nSt Peter’s school has published the Bucks Council presentation https://www.stpeterscofe.org/secondary-transfer/\nFree transport rules\nFree transport rules for Slough (red recycling bins)\nhttps://www.slough.gov.uk/schools-learning-skills/home-school-transport-policy-guidance\nFree transport rules for Buckinghamshire (blue recycling bins)\nFree transport should be available for\n- SEN, Disability and Mobility Problems—apply to Bucks or Slough council— need an EHCP in place\n- Low income—apply to Bucks or Slough councils—available for more than 2 miles and considers religious criteria\n- Unsafe walking route—apply to Bucks or Slough council—have any routes been designated unsafe?\n- More than 3 miles to nearest suitable school measured along the roads\nIf you don’t qualify for free transport to the school, it is the parents’ responsibility to organise. Some schools will be able to advise on existing arrangements. Historically the authorities offered ‘paid for’ seats on the coaches used for free transport. This may not apply in future.\nFree transport arrangements are handled by the local authority. They need numbers and routes to finalise the plans so parents won’t hear until just before term starts in September.\nFree Transport Map\nApproximate areas, check details on the Bucks Council website https://schools.buckinghamshire.gov.uk/school-admissions/transport enter your postcode and exclude grammar schools.\nBEA = Bourne End Academy\nPSA = Pioneer Secondary Academy\nCCC = Chalfont Community College\nBSS = Beaconsfield Secondary School\nIn Slough, most schools are within 3 miles of Slough residents.\nGrammar Schools\nAdvice from Bucks Council\nThe Secondary Transfer Test (11+exam) is not compulsory.\nThink about your child’s attainment in school to date. The national expectation for a child in Year 6 is to achieve a standardised score of 100 in the National Tests. Most children starting at grammar school in 2025 will have qualified in the Secondary Transfer Test and are likely to have gained a score of at least 100 in the National Tests.\nIf a grammar school is not something you would expect your child to attend then you can discuss this with your child’s headteacher and agree if it is not appropriate for your child to take part in the Secondary Transfer Test (11+).\nHeadteachers are asked to provide a recommendation about the suitability of children for grammar school before the outcomes of the test are known.\nThere are three levels of recommendation:\n- Exceptionally able so very highly recommended\n- Very able so recommended without any reservation\n- Recommended with reservation (the headteacher must be prepared to say what that reservation is based on)\nThere is a 4th ’recommendation’ – ‘not recommended for grammar school’\nThere are three levels of attitude to work:\n- Enjoys challenge and is a highly motivated independent learner.\n- Consistently hardworking and reliable.\n- Output varies.\nThere is a 4th level – ‘Lacks self organisation, requires support’.\nThese are combined together to make the overall recommendation (e.g. 2:1 = Very able so recommended without any reservation: Enjoys challenge and is a highly motivated independent learner)\nSlough Advice\nRegistration for Sept 2026 entry examination closes on June 2025.\nhttps://atomlearning.com/blog/slough-consortium-11-plus for information on entry to the 4 Slough Grammar schools.\nOur Advice\nIf a grammar school is your preference, the child is recommended to take the 11+ for both Slough and Buckinghamshire in September of year 6\nFor the 13 Bucks grammar schools, information about the test and any changes will always be on the Buckinghamshire Grammar Schools website thebucksgrammarschools.org\nThere are 4 Slough Grammar schools, and 13 in Buckinghamshire, and they can be very different.",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_burnham-needs-a-secondary-school/content_7.html": "Our community deserves a high-performing, well-run new non-selective secondary school to deliver an excellent education to the 70% of our children who do not qualify for a grammar school.\nRequest for your support\nPlease write your representatives with your personal concerns about the lack of a non-selective secondary school in Burnham. Copy the campaign team newschool@burnhamparish.gov.uk.\nIf you live in Buckinghamshire (blue recycling bins),\nthe MP is joy.morrissey.mp@parliament.uk\nBuckinghamshire Council leader is Martin.Tett@buckinghamshire.gov.uk\nMember for Education is Anita.Cranmer@buckinghamshire.gov.uk\nCouncil Chair is Mimi.Harker@buckinghamshire.gov.uk\nIf you live in Slough (red recycling bins),\nthe MP is tan.dhesi.mp@parliament.uk\nSlough Council leader is dexter.smith@slough.gov.uk\nMember for Education is Puja.Bedi@slough.gov.uk\nThere is a post box in Burnham Parish Hall for postcards.\n- The problem\n- Benefits of a local school\n- Difficulties\n- Current schools\n- Demand for school places\n- Opendale site\n- History\n- Campaign Objective\n- Council responsibility\n- Buckinghamshire Council response to the campaign\n- Department for Education response\n- Conclusion\nFacebook group Burnham needs a secondary school\nBurnham and the surrounding area have a population of over 20,000 and NO secondary school to complement Burnham Grammar school. Every other town in Buckinghamshire with a grammar school also has a non-selective school for the other 70% of pupils.\nThis discriminates against the 70% who do not pass the 11+. They have a more tiring, stressful and costly journey. They are separated from siblings and friends and miss out on social activities.\nThe community suffers from lack of facilities normally provided by a school. Families move away to get a local school affecting house prices. Every day around 2000 children leave at 7.30am and don’t get back until 4.30pm. So many coaches and cars pollute the environment and block the roads.\nA local school has many other advantages for pupils.\n- Walking or cycling to school\n- Joining in after school activities\n- Sharing village events and clubs with school friends\n- Saving an hour each way on bus or rail journeys\nWith a local school, children can travel independently, and parents avoid work interruptions when travel arrangements fail. Neighbours are more likely to have children at the same school as a backup. The children have local friends and clubs which they can visit independently. Siblings are more likely to be at the same school. There is a saving upto £1400 pa on travel costs for many parents.\nFor the community, the coaches and cars become unnecessary, reducing pollution and traffic jams. The school facilities can be used for sports, performance acts and other educational offerings. There are more activities to engage young people and prevent boredom and the resultant criminal behaviour.\nSchool days are typically from 7.30 to 4.30pm. Parents report problems with getting children ready before 7.30 am and how children are tired and stressed from the travel. Poor behaviour on the coaches causes difficulties withh the rise in mental health issues. About of a quarter for pupils are driven by parents; half use coaches and a quarter the train. Less than 5% are able to walk or cycle (to Slough schools). Parents report having to leave work when trains are cancelled or through other disruption to schedules. 40 or so coaches and hundreds of cars pollute the environment and block the roads, when there should be a local school within walking distance for most children.\nLocal clubs report that children drop out after starting secondary school, due to tiredness and cost caused by the travel. Over half say that they cant attend after school activities as there is no transport available, so they miss out on both school and local activities.\nMaidenhead comprehensive schools are accepting fewer Burnham pupils each year, down from 130. Maidenhead is developing rapidly and with proposals for major new housing developments. Should schools become over subscribed, it is Burnham pupils who will be dropped.\nThe 2 nearest Slough schools (Beechwood and Westgate) take about 50 pupils from the Burnham area. Although Slough Council forecasts falling numbers and spare places, there is considerable redevelopment occurring with blocks of flats replacing retail and industrial buildings. Historically, half the pupils at the Burnham school lived in Slough.\nIn 2025, 25 pupils choose St Joseph’s catholic school in Slough.\nAs the reputation Bourne End Academy has improved, it is now oversubscribed and having to squeeze additional class rooms onto its small site. 22 local children choose that in 2024 but transport is a problem. Bucks Council is legally obliged to provide transport from part of Burnham, but the majority of children are reliant on parents for the 5 mile trip on narrow lanes.\nPioneer Secondary Academy is the closest school for the south and east of the village, so Bucks Council must provide transport. It is a Sikh ethos school housed in a converted office block in Stoke Poges. Most pupils at Pioneer are bused from Slough and further afield. Recent government changes remove the obligation to consider non-Sikh pupils for at least 50% of places. Punjabi is the compulsory language and only religious music is taught.\n| Buckinghamshire schools | Maidenhead schools | Slough west schools | Slough schools | Slough East |\n| BEA Bourne End PAS Pioneer Academy BS Beaconsfield Secondary CCC Chalfont Community College | FP Furze Platt NGS Newlands Girls School A Altwood CG Cox Green D Desborough | BW Beechwood WG Westgate EG Eden Girls School GA Grove Academy | LH Lynch Hill Enterprise BC Bayliss Court S&E Slough & Eton WSS Wexham | StJ St Joseph’s Catholic DP Ditton Park LA Langley Academy |\nThere are 7 local primary schools: Priory (82*), Our Lady of Peace (68), St Peters (25), Lent Rise (58), St Nicolas (26), Dorney (27) and Farnham Royal (41). 70% of these (230) need a non-selective secondary school. (* Year 6 students in January 2022). In addition, historically, Cippenham and Lynch Hill pupils also came to Burnham secondary school.\nBuckinghamshire council officials under-report the demand for secondary school places, because the school site is on the border with Slough and traditionally at least half the pupils have come from across the border. In 2019, they said the demand (for a failed school) was less than 20 per year.\nThere are school buildings at the Opendale site in Burnham, with a relatively new sports hall and all-weather pitches. Those extra facilities were funded by a local charity and the community but have been unused since 2019.\nThere are covenants on the site for educational purposes. These could be overcome. The playing fields are registered with Sports England, but Bucks Council are preventing their use.\nThe site has already been moved from the Education portfolio at Buckinghamshire Council, to the Assets portfolio. It is being used for filming, to generate income for the council.\nThe Burnham school was closed in 2019 at the request of E-Act, the academy group that had been running the school for 7 years. They had closed the sixth form a few years earlier. The reputation was poor, staff were leaving and there was no investment. School numbers had dropped to about 20 a year and the school was no longer viable as it was.\nExisting pupils were transferred to Bourne End which has been turned around in the last 3 years, with strong management and investment. Those children have now left school and E-Act no longer provide transport from Burnham.\nCampaign Objective\nThe campaign is to open a new non-selective school for pupils aged 11 to 18. Other schools are demonstrating that non-selective secondary schools can provide a nurturing environment for pupils who choose not to attend grammar schools, with parental and community support and a strong leadership team.\nWe want a non-selective school, to complement the grammar school, offering a broad curriculum, with the ethos and culture for success, with extracurricular activities locally to productively engage children in the evenings and at weekends. The large site can provide a facilities for Special Needs and a centre for Adult Education, with skills based training and sport amenities that are available to hire for the local clubs.\nThe local council has a responsibility for providing adequate school places for local children. For decades, Buckinghamshire has been dependent on other authorities in Maidenhead and Slough to provide places for our children. Those authorities have plans to develop many more houses which will fill their existing and planned school places.\nThe government guidelines are that travel upto 90 minutes each way is acceptable. That is unacceptable when there is sufficient demand for a successful school almost within walking distance. For comparison, Burnham Grammar (taking just 30% of pupils) has a catchment area of only 2.1 miles.\nThe management of the school site on Opendale Road has been moved from the Education Department to the Planning Department at Bucks Council. 52 dwellings were built on the police station site. The school site would have room for hundreds more. This would create the need for a new secondary school, but with nowhere to build it.\nBuckinghamshire Council response to the campaign\n“Ultimately any decision to re-open a school . . . sits with the DfE and current population projections are unlikely to support the need for a new school”\n“ the closure of the school was the decision of the Secretary of State for Education”. That decision was based on pupil numbers provided by Bucks Council who only considered half of the catchment area and did not take account of the lack of investment by E-Act in management and teachers.\nBucks council say there has been a “trend for parents to attend a comprehensive secondary schools in Maidenhead”. BUT this is NOT a campaign for comprehensive education.\nDepartment for Education response\nDepartment for Education depends on data provided by Bucks Council to determine the needs for a new school. It is accepting statements we would refute, such as\n“At point of closure (2019) there was insufficient demand” (for a failed school).\n“If anything demand is expected to fall.” Bourne End and Great Marlow school are both oversubscribed with strong management and parental support. Parents are having to look even further afield to find available places.\n“Maidenhead projection suggest no significant change in demand” – but there is a proposal for a 7-form entry secondary school.\n“The demand for secondary school places in Slough is projected to fall resulting in surplus places” except that the 3 schools nearest to Burnham are all oversubscribed and accepting very few Buckinghamshire pupils.\nBurnham needs a secondary school. Local people of all parties and none are fighting to ensure that Burnham is not neglected in this matter.\nVisit the Facebook group Burnham needs a secondary school",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_wp-admin/content_11.html": "For security and auditing purposes, a record of all of your logged-in actions and changes within the WordPress dashboard will be recorded in an audit log. The audit log also includes the IP address where you accessed this site from.\nLost your password?\n← Go to Carol Linton",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_author_carollinton/content_5.html": "Physical Activities\nSports England has lots of free exercise classes https://www.sportengland.org/jointhemovement\nThe local Active Fitness club is running upto 8 different online exercise classes a day for members. https://burnham.activefitnessclub.co.uk/\nThere are lots of videos on https://www.youtube.com/ for exercise instruction.\nFavourite walks\nGames\nBurnham Bridge Centre https://www.bridgewebs.com/burnham/\nhttps://www.bridgebase.com/ is an American site and has been recommended. You can play for free in friendly games but also for more competitive games you can pay in dollars on your credit card.\nChess At https://www.chessos.com/home, you can play with a friend or unknown opponents. There are many apps also for playing chess against a computer available on your phone or tablet app shop.\nThere are many apps also for playing chess against a computer available on your phone or tablet app shop.\nPuzzles and Apps are available on a smart phone from the Apps store or online, including from the main newspaper sites. You can access more than thousands of crosswords and sudoku and solve puzzles online – for free.\nGuardian https://www.theguardian.com/info/2020/feb/10/the-guardian-puzzles-app?device=other\nIndependent https://puzzles.independent.co.uk/?utm_campaign=navbar&utm_medium=nav&utm_source=navpuzzles\nhttps://www.sporcle.com/ is the world’s largest trivia quiz website.\nOnline courses on just about anything are available, to further your professional or personal development, or understand the world around you. Here are just a few examples\nhttps://www.futurelearn.com/ online courses to continue studying, build professional skills, and connect with experts.\nhttps://www.edx.org/ with nearly 3000 different courses\nhttps://www.open.edu/openlearn/ from the Open University\nTo Make\nPaper models\nIf you have a printer, great free models to make are at https://creativepark.canon/en/contents/CNT-0024615/index.html\nKnitting or crochet? Create an account at https://www.ravelry.com/about",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_feed/content_10.html": null,
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_carol-linton-cv/content_8.html": "My first job was teaching Physics to girls in Freetown, Sierra Leone, still one of the poorest countries on earth. I gained a lot from the experience, but I’m not sure how much Physics the girls learnt.\nDuring decimalisation in 1971, I was working as an IBM consultant advising clients on converting their computer systems from pound, shillings and pence. In 1973, I was working on an elementary system to diagnose patients. Over 50 years later, such systems are now mainstream.\nAt Xerox, I worked on Logistics systems and processes for 26 years, as technology changed, and global supply chains became a reality. When I left, I was responsible for the European Logistics and Finance systems for a division of Xerox. In that job, my team stabilised the existing computer system, implemented the Euro across Europe, ensured no problems at the change of millennium and always upgraded to new versions of the system on time and budget.\nWith UpToDate technical skills, I worked as a contractor for several years before becoming frustrated as a junior team member. That was when I accepted the challenge to research for a PhD in Cybernetics / Mathematics. It was lovely to work alongside young engineers from around the world. My knowledge of statistics and many programming languages and applications came in useful for me and other students.\nSince completing my studies, I continue to learn new skills to support the community.\nI am a Parish Councillor, a campaigner and volunteer in the community, with a special interest in wellbeing and the future of Burnham and its environment.",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk/content_1.html": "I have been a Burnham Parish Councillor since 2019. My interest is prudent financial management. The council must balance protecting what we have and evolving to meet new expectations. Burnham Park Hall and the park are great assets which need maintaining and enhancing for the future, whilst providing a variety of affordable activities for residents. Burnham Care and Share runs twice weekly sessions. George Pitcher memorial grounds, buildings and the Cherry Orchard nature park are heavily used by families and dog walkers. They need to be economical viable and environmentally friendly, with additional and updated facilities.\nI joined the team working on the Neighbourhood Development Plan when it started in 2018. Many of the appendices were written during Covid. They identify special features, areas and facilities; some of which could be improved such as revitalising the High Street or joining up the footpaths. After many changes of clerk and team members, in 2025, the Plan is ready for submission to Buckinghamshire Council.\nAn approved Neighbourhood Plan directs 25% of the infrastructure funds to be spent locally, rather than in other town and villages. The Design Code provides developers with guidance if land is released for development (and that is dependent on government policies). It gives a stronger voice to the Parish planning committee on local planning applications.\nI have been chair of the Burnham Patient Participation Group (PPG) for about 10 years. We are running monthly sessions to help patients use the new digital processes. A quarterly newsletter brings together information from the NHS, local health facilities and Healthwatch Bucks. The Burnham Resources Centre in Minniecroft Road currently houses on the Adult Care Centre (which is at risk). The whole building could be used for community health and wellbeing activities but the proposal was rejected by Bucks Council some time ago.\nI am secretary and a volunteer at Burnham Youth Club. The team provides weekly sessions for local children from 8 years onwards in a safe and nurturing environment. Older children are encouraged to become mentors for the juniors and eventually adult volunteers. The premises in Minniecroft Road are well equipped with dance and sound studios, games room, outdoor court, garden and meeting room for various crafts.\nI am the parent contact for the ‘Burnham needs a Secondary School’ campaign.\nHere is information on choosing a secondary school.\nHere is a brief summary of my career.\nPlease get in touch with any queries",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_ppg/content_2.html": "Burnham Patient Participation Group\nThe aims are\n- To facilitate good relations between Burnham Health Centre (the practice) and patients\n- To work collaboratively with the practice to improve services.\n- To build communication and cooperation between patients (the wider community) and health and social care providers\n- To support the practice and influence local health and social care provision.\nThe core committee organises events and communications for the community. They meet with NHS health and social care providers.\nVirtual PPG (VPPG) Any patient can join the VPPG. The aim is to obtain a wider involvement in identifying and addressing specific matters. They will be asked to sign a code of contact to maintain patient confidentiality.\nAll registered patients can ask to receive a PPG newsletter. They can send views and suggestions to the PPG for consideration.\nActivities\nPublicise the services available to patients\n- By holding workshops around the village\n- By other methods such as digital media, leaflets, posters, ‘Round and About’\nPromote national and local health campaigns\nCooperate with Burnham Health Promotion Trust promoting health and wellbeing in the community\nConduct targeted surveys of patients, and work with the health centre on implementing improvements\nSupport the health centre with non-medical activities (such as Flu clinics)\nShare good practice through networking with the PPG network and Integrated Care Board (CCG) activities\nOrganisation\n- Chair – elected from the Patient Participation Group – Carol Linton\n- Health Centre representatives –\n- Core members – up to 9 patients, elected from the wider membership\n- PPG members – any registered patient of BHC over 16 years\nFull Meetings – quarterly, attended by\n- a Burnham Health Centre representatives,\n- a medical representative,\n- core members of PPG\nInterim meetings – as, when and where required\n- core members of the PPG\n- others required to progress the agenda\nFor further information contact me at bobicb-bucks.burnham.ppg@nhs.net or https://buckshealthservices.co.uk/burnham-health-centre/your-practice/about-us/your-patient-participation-group/",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_2020_05_28_online-actitives-and-games/content_6.html": "Physical Activities\nSports England has lots of free exercise classes https://www.sportengland.org/jointhemovement\nThe local Active Fitness club is running upto 8 different online exercise classes a day for members. https://burnham.activefitnessclub.co.uk/\nThere are lots of videos on https://www.youtube.com/ for exercise instruction.\nFavourite walks\nGames\nBurnham Bridge Centre https://www.bridgewebs.com/burnham/\nhttps://www.bridgebase.com/ is an American site and has been recommended. You can play for free in friendly games but also for more competitive games you can pay in dollars on your credit card.\nChess At https://www.chessos.com/home, you can play with a friend or unknown opponents. There are many apps also for playing chess against a computer available on your phone or tablet app shop.\nThere are many apps also for playing chess against a computer available on your phone or tablet app shop.\nPuzzles and Apps are available on a smart phone from the Apps store or online, including from the main newspaper sites. You can access more than thousands of crosswords and sudoku and solve puzzles online – for free.\nGuardian https://www.theguardian.com/info/2020/feb/10/the-guardian-puzzles-app?device=other\nIndependent https://puzzles.independent.co.uk/?utm_campaign=navbar&utm_medium=nav&utm_source=navpuzzles\nhttps://www.sporcle.com/ is the world’s largest trivia quiz website.\nOnline courses on just about anything are available, to further your professional or personal development, or understand the world around you. Here are just a few examples\nhttps://www.futurelearn.com/ online courses to continue studying, build professional skills, and connect with experts.\nhttps://www.edx.org/ with nearly 3000 different courses\nhttps://www.open.edu/openlearn/ from the Open University\nTo Make\nPaper models\nIf you have a printer, great free models to make are at https://creativepark.canon/en/contents/CNT-0024615/index.html\nKnitting or crochet? Create an account at https://www.ravelry.com/about",
  "https_carollinton_mycouncillor_org_uk_/https_carollinton_mycouncillor_org_uk_about/content_4.html": "I have been a Burnham Parish Councillor since 2019. My interest is prudent financial management. The council must balance protecting what we have and evolving to meet new expectations. Burnham Park Hall and the park are great assets which need maintaining and enhancing for the future, whilst providing a variety of affordable activities for residents. Burnham Care and Share runs twice weekly sessions. George Pitcher memorial grounds, buildings and the Cherry Orchard nature park are heavily used by families and dog walkers. They need to be economical viable and environmentally friendly, with additional and updated facilities.\nI joined the team working on the Neighbourhood Development Plan when it started in 2018. Many of the appendices were written during Covid. They identify special features, areas and facilities; some of which could be improved such as revitalising the High Street or joining up the footpaths. After many changes of clerk and team members, in 2025, the Plan is ready for submission to Buckinghamshire Council.\nAn approved Neighbourhood Plan directs 25% of the infrastructure funds to be spent locally, rather than in other town and villages. The Design Code provides developers with guidance if land is released for development (and that is dependent on government policies). It gives a stronger voice to the Parish planning committee on local planning applications.\nI have been chair of the Burnham Patient Participation Group (PPG) for about 10 years. We are running monthly sessions to help patients use the new digital processes. A quarterly newsletter brings together information from the NHS, local health facilities and Healthwatch Bucks. The Burnham Resources Centre in Minniecroft Road currently houses on the Adult Care Centre (which is at risk). The whole building could be used for community health and wellbeing activities but the proposal was rejected by Bucks Council some time ago.\nI am secretary and a volunteer at Burnham Youth Club. The team provides weekly sessions for local children from 8 years onwards in a safe and nurturing environment. Older children are encouraged to become mentors for the juniors and eventually adult volunteers. The premises in Minniecroft Road are well equipped with dance and sound studios, games room, outdoor court, garden and meeting room for various crafts.\nI am the parent contact for the ‘Burnham needs a Secondary School’ campaign.\nHere is information on choosing a secondary school.\nHere is a brief summary of my career.\nPlease get in touch with any queries"
}