{
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_wp-admin/content_24.html": "For security and auditing purposes, a record of all of your logged-in actions and changes within the WordPress dashboard will be recorded in an audit log. The audit log also includes the IP address where you accessed this site from.\nLost your password?\n← Go to Cllr Eleanor Rylance",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_category_local-council/content_8.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 16 May, 2018\nI apologise for the length of this- it’s been much on my my mind and I hope you find it enlightening about how things happen at district council at present. When I was elected a year ago, I didn’t really understand how things worked at district council. I fondly imagined that councillors would be focused […]\nRead more Leave a comment",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_11_21_what-happens-to-my-rubbish-the-green-bag-part-2/content_30.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 November, 2018\nIf you’ve just moved into or you already live in a house in East Devon, you’ll have a green recycling bag.\nThe contents of this bag have a very special fate. Everything in this bag is taken to a huge machine called a “Materials Recycling Facility” (MRF) on the Greendale industrial estate near Woodbury. That’s where the waste and recycling company Suez, that runs our service, has their site for East Devon.\nThis machine has been up and running for several months now and has enabled the district council to make significant savings on the cost of the rubbish collection service. Here’s blow.\nRecyclables have a value, but the less “contaminated” they are, the higher the value. The MRF sorts our recycling in such an accurate way that the bundles of recyclable stuff that come out of can be sold at a good price to companies that use recycled materials.\nInto the green bag iat our back door go cans, tins, hard plastics like veg trays, meat trays, yoghurt pots, milk and juice bottles, tetra packs, metal and plastic lids. You can even put tin foil in the bag- it’s aluminium and is VERY recyclable. The MRF doesnt cope at all well with flimsy plastic like cling film or the plastic top of ready meals, so please put them in the wheelie.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_04_27_welcome/content_27.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 27 April, 2018\nI’m Eleanor Rylance, and I’m honoured to be one of two councillors for Broadclyst Ward in gorgeous East Devon. My ward is huge, and ranges from lovely rural areas, through vibrant villages to very active growth areas including one new town. There are 7 parishes and town councils serving 7,600 residents in this ward, so as you can imagine, my council workload is very varied and interesting!\nIssues within the ward range from a lack of public transport, the perennial pothole situation, poor broadband, house build quality, as well as managing the effects of the building of a large number of houses in the ward. I do my best and it’s definitely been a steep learning curve!\nIn late spring/ early summer, I am trying to get out with a paper newsletter to every household and meet as many residents as I can while the weather is bearable! I look forward to meeting more of you.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_lib-dem-news/content_15.html": "Cllr Eleanor Rylance\nWorking hard for Broadclyst District Ward\nLearn more\nGet in touch\nVolunteer\nReport a problem\nHelp in election\nEmail Eleanor at:\n[email protected]\nCall Eleanor on:\n01404822821\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nRead the blog\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_about/content_7.html": "Cllr Eleanor Rylance\nWorking hard for Broadclyst District Ward\nLearn more\nGet in touch\nVolunteer\nReport a problem\nHelp in election\nEmail Eleanor at:\n[email protected]\nCall Eleanor on:\n01404822821\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nRead the blog\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nAbout Me",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_getting-in-touch_volunteer/content_19.html": "Cllr Eleanor Rylance\nWorking hard for Broadclyst District Ward\nLearn more\nGet in touch\nVolunteer\nReport a problem\nHelp in election\nEmail Eleanor at:\n[email protected]\nCall Eleanor on:\n01404822821\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nRead the blog\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nVolunteer",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_who-am-i/content_12.html": "Working hard for Broadclyst District Ward Learn more\nI’m a translator living in rural Broadclyst Parish in lovely East Devon, where I’ve been lucky to live since 2003.\nI’m married to Adrian, and we have have four children- one at primary school and three at university. We keep a few chickens, and own a large soppy dog and a cat that thinks it’s a dog.\nI’ve been a parish councillor for Broadclyst since 2006, a role in which I thoroughly enjoy being able to help bring positive change to my large village. I was honoured to also be elected district councillor in a by-election in May 2017, and have since then helped many people with problems with their bins, and more seriously with the quality of their newly-built houses. Since my election I’ve sat on scrutiny committee at district council, which scrutinises the council’s actions, as a crucial part of the accountability process. This year I am also on the Waste and Recycling think tank, and on Strategic Planning.\nMy ward includes the villages of Clyst St Lawrence, Rockbeare (inc Marsh Green and Rockbeare Hill), Poltimore, Clyst Honiton, Clyst Hydon, and Broadclyst (including Westclyst, Budlake, Beare, half of Hele, Killerton, Westwood, Broadclyst Station), and the brand new town of Cranbrook which has the youngest population in Devon. It has nearly 10,000 residents! As you can imagine it keeps me quite busy. It takes nearly 3 months to get around it the way I like to- walking around talking to people. I am always available to you via email, Facebook, messenger or text- please do get in touch if there’s something you’d like help with.\nDistrict Council covers:\n-Bins: Waste and Recycling\n-Planning: not only individual applications but also the large growth areas in my ward.\n-some Council-owned homes\n-licensing\nIn practise though I’ve found I can also point people in the right direction on a much bigger range of topics. I’ve a strong personal interest in food security and community cohesion and resilience.",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_06_20_women-in-politics-and-why-it-needs-us/content_34.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 20 June, 2018\nIn this sad anniversary time of the appalling murder of Jo Cox MP, there is much discussion in the media of why there are far fewer women in politics than men. Jo Cox’s murder was one of the reasons I decided to enter active politics. Because if entire sections of people are put off because of the threat of violence, then our politics will never be representative. I wanted the voice of women, especially mothers, heard.\nThere’s nothing special about me. I look around me at district council and I see many people who broadly have the same corporate/ business background. I have not had a corporate background. Like many women of my age, I’ve spent the last twenty-five years juggling my home and working life. And that is *precisely* why it’s important for people like me to do this. Unless we join in the fray, our voices will not be heard will not be heard and the culture of political organisations will continue to be articulated around older men. The current lack of diversity is a problem, not a model to follow.\nI was hugely cheered at the March for Europe in March in Exeter, to see a young female city councillor on stage, a baby under her arm and a child at her side, on stage addressing the crowd. What a wonderful, practical role model for other mothers and young women! Because although we are busy, largely rushed off our feet, we also have enormous personal reserves of motivation, energy, organisation and a perspective that *needs* to find its voice.\nSome of the barriers appear to be practical- it is very difficult to add yet another role into the usual juggling mix that most if not all women do already in their daily lives. The thought of going through a day’s work, doing all the things one usually does at home, and then going to meetings in the evenings can be enough to put many parents off. My district council, East Devon, is unusually sensitive to the needs of working parent councillors, even though there are not many of us. Other district councils nearby appear to run their activities more around the needs of retired male councils than ours does, with important meetings arranged at school drop-pff of pick up times. All I can say is that maybe they should examine their commitment to diversity if they still think this is a good idea.\nIf the last three years have taught us anything, it’s that a lack of cultural diversity in an organisation is largely a bad thing, If a monoculture sets the tone of any organisation it can in my view lead to a kind of group think, without proper challenge of the group’s assumptions. As we all know, ASSUME makes an ASS of U and ME. And look where assumptions have got us.\nSo what politics needs, really, really *needs*, even though some of the current incumbents may resist the idea, is for a much wider range of people to put themselves forward. It’s still difficult, especially for women, who can easily fall foul of some very unpleasant people simply by being women and trying to change things, but it’s extremely worth doing. Only by joining the fray can we help to make it adapt to a diversity of people. Join in!\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_11_21_what-happens-to-my-rubbish-the-optional-garden-waste-wheelie-part-6/content_4.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 November, 2018\nRecently a new service was brought in- a garden waste recycling service. We live in a fairly rural area, and many people in the countryside have their own compost heaps or chickens and dogs to eat their scraps, but there a few towns where this isn’t as common.\nSo East Devon brought in an optional garden waste collection service. It’s a chargeable extra but to be honest, the cost is very reasonable and compares very favourably with taking it to the tip in your car. If you have a garden compost heap you may very well prefer to continue using that, but the service is there if you want it.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_how-you-can-help/content_26.html": "Working hard for Broadclyst District Ward Learn more\nRead more on this\nClick here to join the Liberal Democrats online\nLiberal Democrat Privacy Policy",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_11_21_what-happens-to-my-rubbish-the-box-part-3/content_3.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 November, 2018\nThe box used to receive all the recycling, but since the materials recycling facility was installed, and plastics have been sorted and recycled, we’ve had to do things a bit differently.\nNow all that goes in the box is glass, and card and paper. If you watch the crews at the kerbside, you’ll see they have to sort these out by the side of the road. They have to sort out paper from card as they can’t be recycled in the same way- this takes a bit of time. It’s also not a perfect idea because sometimes, broken glass ends up mixed up with the paper and card, so the officers and the waste company are constantly searching for solutions that householders will accept that enable the sorting to to done more quickly. It’s a constant balancing act!\nThere are some tests going on in Woodbury for a few months to see if asking residents to sort out their card from their paper in advance is a good idea- watch this space.\nSorting out the recyclables is the tricky and time-consuming bit, and therefore the most expensive part of the process, so anything we as householders can do to help cuts our council tax.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_get-involved/content_28.html": "Cllr Eleanor Rylance\nWorking hard for Broadclyst District Ward\nLearn more\nGet in touch\nVolunteer\nReport a problem\nHelp in election\nEmail Eleanor at:\n[email protected]\nCall Eleanor on:\n01404822821\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nRead the blog\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nGet involved\nΔ",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_category_education/content_2.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 3 July, 2018\nWe are extremely lucky to live in such a rich and varied natural environment. Yesterday, I learned what to do if you find a floored (but still alive) bat. The answer is, pick it up delicately with a cloth, put it in a box and call the bat conservation trust immediately. This happened to me […]\nRead more Leave a comment",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_getting-in-touch_help-in-the-election/content_25.html": "Cllr Eleanor Rylance\nWorking hard for Broadclyst District Ward\nLearn more\nGet in touch\nVolunteer\nReport a problem\nHelp in election\nEmail Eleanor at:\n[email protected]\nCall Eleanor on:\n01404822821\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nRead the blog\nRead more on this\nBroadclyst Station Rd traffic\nRead more on this\nWhat happens to my rubbish, the food caddy, part 5\nRead more on this\nHelp in the Election",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk/content_1.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 15 October, 2019\nAt the risk of dragging this blog into the bin… I was happy to be able to ring up to talk to Janet Kipling on BBC Radio Devon on Friday, to talk about how well the people of East Devon are doing at recycling. My colleague Geoff was on just before me, talking about the […]\nRead more Leave a commentby cllreleanorrylance on 15 June, 2019\nAll of who have been stuck in stationary traffic jams in Station Road of a morning will know that the constant 2 way HGV circulation is not helping what was already a bit of a bottle-neck around the parish. The ford floods regularly, as it is designed to, but add to that the beautiful Victorian […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nYou will see that you have a blue food caddy and its kitchen friend, the small green caddy, for kitchen scraps. This is actually one of the most exciting parts of the whole process (even possibly more exciting than the Materials Recycling Facility!). The contents of your food caddy- food scraps, tea bags, even cooked […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nRecently a new service was brought in- a garden waste recycling service. We live in a fairly rural area, and many people in the countryside have their own compost heaps or chickens and dogs to eat their scraps, but there a few towns where this isn’t as common. So East Devon brought in an optional […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nEven though older wheelie bins are labelled “landfill waste”, none of our wheelie bin waste in East Devon now goes into a hole in the ground. We still has to pay money to maintain landfill sites, but that is because even after they are closed, landfill sites need very careful management for decades, to avoid […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nAs you may already know, in East Devon district area, a very large district of 140,000 people, we have two main rubbish collections schedules. Recyclables are taken every week, and what’s left over, “residual waste” that is put into the wheelie bins (inaccurately marked “landfill waste”- see a later post), goes every 3 weeks. Much […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nThe box used to receive all the recycling, but since the materials recycling facility was installed, and plastics have been sorted and recycled, we’ve had to do things a bit differently. Now all that goes in the box is glass, and card and paper. If you watch the crews at the kerbside, you’ll see they […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nThe people of East Devon are doing very well at recycling. In a bit over a year, we’ve gone from among the worst areas in Britain for recycling to being in the top ten, which is amazing. How has this been done? By starting a plastics recycling scheme and a garden waste collection. Both of […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nIf you’ve just moved into or you already live in a house in East Devon, you’ll have a green recycling bag. The contents of this bag have a very special fate. Everything in this bag is taken to a huge machine called a “Materials Recycling Facility” (MRF) on the Greendale industrial estate near Woodbury. […]\nRead more Leave a commentby cllreleanorrylance on 10 October, 2018\nThe CEO of Gigaclear has issued an apology for delays to the rollout of fibre broadband under the Connecting Devon and Somerset scheme. His press release explains how they plan to tackle the delays.\nRead more Leave a comment",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_11_21_what-happens-to-my-rubbish-the-wheelie-part-4/content_6.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 November, 2018\nEven though older wheelie bins are labelled “landfill waste”, none of our wheelie bin waste in East Devon now goes into a hole in the ground. We still has to pay money to maintain landfill sites, but that is because even after they are closed, landfill sites need very careful management for decades, to avoid poisons leaching into the environment.\nInstead, our wheelie bin waste now goes to the incineration plant on the Marsh Barton industrial estate, where it is incinerated and the heat captured and used to power electrical turbines. The incinerator at Marsh Barton takes “residual waste” (ie wheelie bin waste) from East Devon, Exeter, and Teignbridge.\nThe plant operates at about 800 to 850 C centigrade, so clearly it won’t dispose of things that don’t burn at that sort of temperature. During our visit we were shown the calcified remains of gas bottles, bicycle racks, and radiators. Clearly these do not burn at such a low temperature, and actually have a good value on the metals market!\nThe plea from the staff at the incinerator was please do not send them things that are too “wet”. The best heat comes from dry waste. So garden waste and kitchen scraps are a bit of a pain to them as they make the temperature in the turbine drop.\nAll sanitary waste- tampons, nappies, wet wipes etc, should go into the wheelie bin.\nAgain, because the plant generates power, this offsets the price of the service and helps to keep our council tax for this service as low as possible.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_report-a-problem/content_17.html": "Use this space to report a problem with the local area, and we will do our best to help you sort this out.",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_08_21_1000-years-ago/content_35.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 August, 2018\nDoing some research the other day for a planning application response, I chanced upon the entry for the Cliston Hundred in the Domesday Book. It is very sobering to realise that Broadclyst was already a “very large” settlement in the 11th century, with 83 households, but that there were other almost as large settlements around, that have since disappeared or are now tiny hamlets much smaller than they were then. Rockbeare was also “very large” at 35 households, Poltimore also “very large” with 36 households.\nClyst Honiton was “quite small” at 9 households, Clyst St Lawrence “quite large” at 30 households. In the area of the modern day Westwood, there were several medium sized settlements of around 15 households each. Clyst Hydon was “quite large” at 22 households.\nYou can click on each little pin and find out how many ploughing teams there were in each village, and how much money they paid in tax.\nThe most fascinating thing is that Broadclyst Ward essentially still pretty much matches the boundary of the old Cliston Hundred and will do so until Cranbrook and Rockbeare become a separate ward at the next local elections in May 2019.\nhttp://opendomesday.org/place/SX9897/broadclyst/\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_04_27_potholes-groan/content_31.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 27 April, 2018\nI’ve think we’ve all got a bit of thing about potholes. We’ve all had the experience of driving across a patch of what looks like water, only to discover too late that a crater has opened up in the night and you’ve just dented your wheel rims -or worse! I recently came across a person by the side of the road who’d punctured two tyres at once driving unwittingly though one such pothole.\nI used to recommend FixMyStreet.com to everyone I met- I’ve used it for years and it’s a really simple way of passing on a problem and making sure it gets to the right team- highways, green space management, police etc… Fix my Street has a handy and easy to use app, and However, Devon County Council has now withdrawn from FixMyStreet and are using their own online reporting tool. In my view it’s not as easy to use as fix my street was, and if there’s an app for the phone I haven’t found it yet, but I would urge anyone who spots a pothole to use the online reporting tool at Devon County (link below) as the contractor has to come out to inspect a reported pothole, whether it meets their new criteria for being fixed or not. Many eyes make light work, and unfortunately thanks to budget cuts, highways are having to run to a very tight budget.\nSo what to do if you spot a pothole? Click on this link and follow the instructions. If you find you can’t work out how to do it, or don’t have the right sort of phone or computer, please drop me a message- I’ll come and take a photo and report it.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_11_21_what-happens-to-my-rubbish-the-food-caddy-part-5/content_13.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 November, 2018\nYou will see that you have a blue food caddy and its kitchen friend, the small green caddy, for kitchen scraps.\nThis is actually one of the most exciting parts of the whole process (even possibly more exciting than the Materials Recycling Facility!). The contents of your food caddy- food scraps, tea bags, even cooked food like meat and bones, go off to an anaerobic digester in Wiltshire.\nThey are rotted down into a perfectly good compost, the methane that the plant gives off is captured and turned into electricity. This is a much better way of “recycling” wet things like old cold spaghetti, rotten lettuce and bones. Every single scrap you put in the food caddy instead of the wheelie bin can be recycled into compost far more efficiently than if it is sent to the incinerator.\nAnd efficient recycling means, you guessed it! Lower council tax bills. And some good compost.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_10_10_gigaclear-rollout-delayed/content_16.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 10 October, 2018\nThe CEO of Gigaclear has issued an apology for delays to the rollout of fibre broadband under the Connecting Devon and Somerset scheme. His press release explains how they plan to tackle the delays.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2019_06_15_broadclyst-station-rd-traffic/content_10.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 15 June, 2019\nAll of who have been stuck in stationary traffic jams in Station Road of a morning will know that the constant 2 way HGV circulation is not helping what was already a bit of a bottle-neck around the parish.\nThe ford floods regularly, as it is designed to, but add to that the beautiful Victorian bridge over the railway, designed for nothing larger than the 19th century station waggon running from the old station into the village of Broadclyst, and we have a regular problem in Station Road, particularly with the large HGVs running back and forth all day to the various Lodge trading estate sites.\nStation Road may be a hamlet of Broadclyst, but it has as many houses and residents as some full-blown villages, concentrated around an impossible road.\nLong-term there will doubtless be a solution- this situation cannot continue like this, but in the meantime, unhappy people are stuck every day either side of the bridge, or at the end of the road (often all the way back to the bridge) waiting to turn right onto the old A30.\nThere is unfortunately not much that either the parish council or the district council can do about the presence of any business there. The site has had a haulage designation since the 1960s, and once Devon highways department deemed it suitable for the purpose, local councillors could not argue against the second haulage business moving in.\nIt is a shame that Highways saw fit to deem it suitable, especially given the size of the vehicles used by the new business on the site. They are however the owners of the site, and the site is designated for the purpose for which it is being used.\nIt is horrible and frustrating far too often, and I know it’s also frightening. I report every incident that people report to me, passing it on to the person or organisation I think can tackle it the best. We can but hope that eventually even those businesses will feel that a different site might be more suitable for their purposes- it must be annoying for them too to be stuck in intractable traffic for so many hours a week.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_feed/content_21.html": null,
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_11_21_what-happens-to-my-rubbish-part-1/content_29.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 November, 2018\nAs you may already know, in East Devon district area, a very large district of 140,000 people, we have two main rubbish collections schedules. Recyclables are taken every week, and what’s left over, “residual waste” that is put into the wheelie bins (inaccurately marked “landfill waste”- see a later post), goes every 3 weeks.\nMuch of what used to go into the grey wheelie bin was recyclable, but East Devon district council did not have the facilities for it. Sorting the recycling correctly into the bags and boxes takes seconds and helps the whole process hugely- if you’ve ever seen the kerbside crews picking up your waste, you’ll know they don’t have much time to sort it.\nAs with everything, time is money. And every bit of extra time spent sorting out waste goes on our council tax bills. So sorting out our recycling saves us all money- nifty!\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_getting-in-touch/content_14.html": "Send us your Views Help us represent you best and stand up for our local area by letting us know what you think. Please use this space to get in touch.",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_07_03_bats-and-a-big-thank-you-to-dedicated-volunteers/content_11.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 3 July, 2018\nWe are extremely lucky to live in such a rich and varied natural environment. Yesterday, I learned what to do if you find a floored (but still alive) bat. The answer is, pick it up delicately with a cloth, put it in a box and call the bat conservation trust immediately.\nThis happened to me yesterday (or rather, to a juvenile Pipistrelle). The first question the BCT asked was “do you have a cat?”. I do, so I was asked to take the bat to a lovely Bat Lady in Exeter. She looked after it yesterday afternoon, rehydrated it (given that it had spent most of yesterday lying in a corner of my house, it was probably a little thirsty…). She said it was about 2 weeks old, and that many bat babies are getting lost at the moment as they lose their milk teeth which allow them to cling to their mums, can’t really fly yet and are also a little too large for their mums to hold onto.\nTo cut a long story short, wonderful Bat Lady returned the bat at dusk last night to our house. She put him (for he was a he, and I’d named him Vladimir) in a tray perched on a stepladder, turned on her bat monitor, and we sat back to wait for its relatives to turn up.\nTwo bats in particular became very interested in the stepladder, and began circling it in 5 m circles, at what Bat Lady Sarah said were very low altitudes for bats.\nAfter a few minutes of this (and bearing in mind it was getting quite dark by then), everything went quiet. Bat Lady said she’d check on the baby to make sure he hadn’t jumped off the stepladder. He’d gone! Mum must have picked him up really quickly without us noticing. So a successful reunification with his family. Nice job, mum!\nAnd a big shout our to Bat Lady Sarah who brought him back despite feeling very unwell! Where would we be without wonderful volunteers?\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_category_uncategorized_page_2/content_33.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 August, 2018\nDoing some research the other day for a planning application response, I chanced upon the entry for the Cliston Hundred in the Domesday Book. It is very sobering to realise that Broadclyst was already a “very large” settlement in the 11th century, with 83 households, but that there were other almost as large settlements around, […]\nRead more Leave a commentby cllreleanorrylance on 3 July, 2018\nWe are extremely lucky to live in such a rich and varied natural environment. Yesterday, I learned what to do if you find a floored (but still alive) bat. The answer is, pick it up delicately with a cloth, put it in a box and call the bat conservation trust immediately. This happened to me […]\nRead more Leave a commentby cllreleanorrylance on 20 June, 2018\nIn this sad anniversary time of the appalling murder of Jo Cox MP, there is much discussion in the media of why there are far fewer women in politics than men. Jo Cox’s murder was one of the reasons I decided to enter active politics. Because if entire sections of people are put off because […]\nRead more Leave a commentby cllreleanorrylance on 27 April, 2018\nI’ve think we’ve all got a bit of thing about potholes. We’ve all had the experience of driving across a patch of what looks like water, only to discover too late that a crater has opened up in the night and you’ve just dented your wheel rims -or worse! I recently came across a person […]\nRead more Leave a commentby cllreleanorrylance on 27 April, 2018\nI’m Eleanor Rylance, and I’m honoured to be one of two councillors for Broadclyst Ward in gorgeous East Devon. My ward is huge, and ranges from lovely rural areas, through vibrant villages to very active growth areas including one new town. There are 7 parishes and town councils serving 7,600 residents in this ward, so […]\nRead more Leave a comment",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_category_uncategorized/content_22.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 15 October, 2019\nAt the risk of dragging this blog into the bin… I was happy to be able to ring up to talk to Janet Kipling on BBC Radio Devon on Friday, to talk about how well the people of East Devon are doing at recycling. My colleague Geoff was on just before me, talking about the […]\nRead more Leave a commentby cllreleanorrylance on 15 June, 2019\nAll of who have been stuck in stationary traffic jams in Station Road of a morning will know that the constant 2 way HGV circulation is not helping what was already a bit of a bottle-neck around the parish. The ford floods regularly, as it is designed to, but add to that the beautiful Victorian […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nYou will see that you have a blue food caddy and its kitchen friend, the small green caddy, for kitchen scraps. This is actually one of the most exciting parts of the whole process (even possibly more exciting than the Materials Recycling Facility!). The contents of your food caddy- food scraps, tea bags, even cooked […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nRecently a new service was brought in- a garden waste recycling service. We live in a fairly rural area, and many people in the countryside have their own compost heaps or chickens and dogs to eat their scraps, but there a few towns where this isn’t as common. So East Devon brought in an optional […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nEven though older wheelie bins are labelled “landfill waste”, none of our wheelie bin waste in East Devon now goes into a hole in the ground. We still has to pay money to maintain landfill sites, but that is because even after they are closed, landfill sites need very careful management for decades, to avoid […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nAs you may already know, in East Devon district area, a very large district of 140,000 people, we have two main rubbish collections schedules. Recyclables are taken every week, and what’s left over, “residual waste” that is put into the wheelie bins (inaccurately marked “landfill waste”- see a later post), goes every 3 weeks. Much […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nThe box used to receive all the recycling, but since the materials recycling facility was installed, and plastics have been sorted and recycled, we’ve had to do things a bit differently. Now all that goes in the box is glass, and card and paper. If you watch the crews at the kerbside, you’ll see they […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nThe people of East Devon are doing very well at recycling. In a bit over a year, we’ve gone from among the worst areas in Britain for recycling to being in the top ten, which is amazing. How has this been done? By starting a plastics recycling scheme and a garden waste collection. Both of […]\nRead more Leave a commentby cllreleanorrylance on 21 November, 2018\nIf you’ve just moved into or you already live in a house in East Devon, you’ll have a green recycling bag. The contents of this bag have a very special fate. Everything in this bag is taken to a huge machine called a “Materials Recycling Facility” (MRF) on the Greendale industrial estate near Woodbury. […]\nRead more Leave a commentby cllreleanorrylance on 10 October, 2018\nThe CEO of Gigaclear has issued an apology for delays to the rollout of fibre broadband under the Connecting Devon and Somerset scheme. His press release explains how they plan to tackle the delays.\nRead more Leave a comment",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_11_21_what-happens-to-my-rubbish-introduction/content_20.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 November, 2018\nThe people of East Devon are doing very well at recycling. In a bit over a year, we’ve gone from among the worst areas in Britain for recycling to being in the top ten, which is amazing.\nHow has this been done? By starting a plastics recycling scheme and a garden waste collection. Both of these used to go to landfill, apart from the garden waste from householders who had signed up to Otter Rotters, until that organisation folded.\nSince the introduction of the green bag alongside the box, a lot of things have changed. I’ll try to give a run down of them in the following posts.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_page_2/content_18.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 21 August, 2018\nDoing some research the other day for a planning application response, I chanced upon the entry for the Cliston Hundred in the Domesday Book. It is very sobering to realise that Broadclyst was already a “very large” settlement in the 11th century, with 83 households, but that there were other almost as large settlements around, […]\nRead more Leave a commentby cllreleanorrylance on 3 July, 2018\nWe are extremely lucky to live in such a rich and varied natural environment. Yesterday, I learned what to do if you find a floored (but still alive) bat. The answer is, pick it up delicately with a cloth, put it in a box and call the bat conservation trust immediately. This happened to me […]\nRead more Leave a commentby cllreleanorrylance on 20 June, 2018\nIn this sad anniversary time of the appalling murder of Jo Cox MP, there is much discussion in the media of why there are far fewer women in politics than men. Jo Cox’s murder was one of the reasons I decided to enter active politics. Because if entire sections of people are put off because […]\nRead more Leave a commentby cllreleanorrylance on 16 May, 2018\nI apologise for the length of this- it’s been much on my my mind and I hope you find it enlightening about how things happen at district council at present. When I was elected a year ago, I didn’t really understand how things worked at district council. I fondly imagined that councillors would be focused […]\nRead more Leave a commentby cllreleanorrylance on 27 April, 2018\nI’ve think we’ve all got a bit of thing about potholes. We’ve all had the experience of driving across a patch of what looks like water, only to discover too late that a crater has opened up in the night and you’ve just dented your wheel rims -or worse! I recently came across a person […]\nRead more Leave a commentby cllreleanorrylance on 27 April, 2018\nI’m Eleanor Rylance, and I’m honoured to be one of two councillors for Broadclyst Ward in gorgeous East Devon. My ward is huge, and ranges from lovely rural areas, through vibrant villages to very active growth areas including one new town. There are 7 parishes and town councils serving 7,600 residents in this ward, so […]\nRead more Leave a comment",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2018_05_16_democracy-its-like-nothing-id-imagined/content_32.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 16 May, 2018\nI apologise for the length of this- it’s been much on my my mind and I hope you find it enlightening about how things happen at district council at present.\nWhen I was elected a year ago, I didn’t really understand how things worked at district council. I fondly imagined that councillors would be focused on issues affecting their residents, and keen to collaborate with others to bring about the best possible result for the largest possible number of people.\nBefore you accuse me of naivety, please understand that this is why I stood, and I believe that quite few other councillors as well. We’re certainly not “in it for the money”. I do about 20 hours a week on council business (and still not enough time to get out speaking to people) and my take-home allowance is £290.73 a month. Not complaining at all, just trying to set a record straight.\nSo, back to democracy.\nAs you may know there are three parties and some independents represented at East Devon Council. The largest is the Conservatives (henceforth Cons), followed by the East Devon Alliance (EDA) (who describe themselves as independents), then the Liberal Democrats (LD), then a few “independent independents” (Ind)\nFrom time to time, a motion is submitted for debate at full council meeting. A motion is a way of changing council policy on something. It is written and proposed by one councillor, seconded by another, and formally supported by as many others as the first two can find. On the day of the meeting, the proposer and the seconder are allowed 5 mn each to explain why they think it would be a good idea to vote for their motion, and bring all the relevant evidence to the debate. The supporters get 3 mn to supply extra arguments. Then anybody else can add to the debate. Anybody else can also submit an amendment to the original text. This is meant to be to bring improvements.\nI’ve been at District Council now for a year and I have never yet seen a motion submitted by EDA, LD or Inds, however sensible, well-intentioned or well-drafted, not be entirely deconstructed by the Cons, who ^always^ submit an amendment. They submit an amendment they’ve had a fortnight to prepare, and then force a vote in a few minutes on a motion text that the LDs, Inds and EDAs have not seen. Is this democracy?\nMotion proposals are sent out two weeks in advance to all councillors. The Cons gather together in that fortnight and plan their “amendments” (rewrites) and then submit them to council for voting with only a few minutes to consider them. Sometimes they submit “amendments” that are three times larger than the original motion and are so convoluted that they require a printed version. In one farcical situation last week (of which more in a future article), the printouts were slapped down in front of a roomful of bemused councillors, some of who are visually impaired, some of whom are severely dyslexic and unable to absorb that much text in one go, and then a vote was forced through. “This is not democracy!” I stated to council. “Sit down!” thundered the Chairman, “this is more than democracy, it’s better than democracy!”. It seems that the Cons prefer autocracy at district council.\nAn amendment to my mind should not be something that changes the entire motion Into something else entirely. Then the Cons use their majority at council to railroad through their “amendment”, even if they personally disagree with the amendment and would rather vote for the original motion. The Cons then take credit for the motion. They are quite frankly no better than playground bullies pinching your homework, copying you in the test and then getting you into trouble for copying.\nTake the motion on single-use plastics jointly submitted by EDA and LD in February. The intention was to stop district council from purchasing single use plastics such as cups and spoons for use within the building. Our reasoning was that we could hardly exercise proper leadership on reducing the use of plastics if our own house was not in order. We honestly couldn’t see how it could possibly be controversial. How foolish we were.\nBecause it seems that there is no motion, however small, however sensible, that will not be utterly eviscerated and re-written by the Cons.\nThis single use plastics motion was all but scuppered by the Cons, who replaced it with one kicking the date at which we would stop using such things into the long grass entirely. There was no sensible reason for doing this. They simply didn’t want to pass a thing not proposed by themselves. They use specious arguments to destroy the motion, citing the unavailability of non-plastic sample jars and those sticky covers for parking tickets.\nIn a scene of chaos that wouldn’t be out of place in an emerging country, the Cons rounded on the LDs and shouted that they were being completely sensible to kick the deadline for this motion into 2040, when in fact all it really required was a decision about which pack of cups to order from the cash and carry, and a proviso in the motion that it would apply as and when other alternatives became available.\nIs this democracy? I think not. It’s the behaviour of a bunch of playground bullies more keen on maintaining what they see as their natural position in the order of things. They behave with thuggery and smuggery at council and on every committee they belong to. They are often not acting in the best interests of residents, but the best interests of their own party. They get away with it because nobody sees how they behave, and because they are re-elected.\nThe only way to counter this is by delivering them a good kicking at the ballot box, because you are sure as heck not getting adequate representation right now.\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_2019_10_15_a-really-rubbish-blog/content_23.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 15 October, 2019\nAt the risk of dragging this blog into the bin…\nI was happy to be able to ring up to talk to Janet Kipling on BBC Radio Devon on Friday, to talk about how well the people of East Devon are doing at recycling. My colleague Geoff was on just before me, talking about the nuts and bolts of what East Devon district council does. My point was that even the contractor, Suez, had been caught unawares by the enthusiasm of people for recycling.\nI sent a big shout-out also to Debbie at the Broadclyst Post Office stores, who has recently opened a packaging-free area in her shop. This is doing really well, even though it’s only been open a fortnight, because there is a lot of demand for buying goods in this way.\nWe as consumers have power. If we demand to buy unwrapped goods, then shops will start to provide. And really, who needs to buy a cucumber or swede wrapped in plastic? They already come with skin you can peel or wash!\nLeave a comment\nLeave a Reply",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_category_education_natural-environment/content_5.html": "Working hard for Broadclyst District Ward Learn more\nby cllreleanorrylance on 3 July, 2018\nWe are extremely lucky to live in such a rich and varied natural environment. Yesterday, I learned what to do if you find a floored (but still alive) bat. The answer is, pick it up delicately with a cloth, put it in a box and call the bat conservation trust immediately. This happened to me […]\nRead more Leave a comment",
  "https_cllreleanorrylance_focusteam_org_uk_/https_cllreleanorrylance_focusteam_org_uk_getting-in-touch_report-a-problem/content_9.html": "Use this space to report a problem with the local area, and we will do our best to help you sort this out."
}