{
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_people/content_12.html": "Party Officers for Guildford and Waverley\nSam Peters\nCo-Chair\nSteve Brooks\nCo-Chair\nSunethra Mendis\nNominating Officer\nNeil Jameson\nTreasurer\nBorough Councillors\nSteve Williams\nWaverley Borough Councillor\nTown Councillors\nAlistair Bayliss\nHaslemere Town Councillor\nNina Clayton\nGodalming Town Councillor\nBob Crooks\nGodalming Town Councillor\nClaire Matthes\nHaslemere Town Councillor\nClare Weightman\nGodalming Town Councillor\nSteve Williams\nGodalming Town Councillor",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_11_03_green-party-litterpick-november/content_17.html": "Join local Greens for our next litterpick on Sunday 19 November, 10-11.30am around Stoke in Guildford!\n.\nAll are welcome, member or not. We will meet in front of the King’s Head pub on Kings Road, Guildford, GU1 4JW. Grabbers, hi-viz and bags will all be provided – just bring something warm (and cross your fingers that the no-rain forecast is accurate…)\n.\nAny tips for areas with lots of litter is always very appreciated, and we can help run local litterpicks in your area (or guide you to borrowing the grabbers and other kit) if you’d like – just get in touch.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2022_05_19_godalmings-first-green-mayor/content_16.html": "On 19 May, Cllr Shirley Faraday, who represents Godalming’s Farncombe & Catteshall ward, was unanimously elected as Godalming Town Mayor for the civic year 2022/23!\nShirley was elected as a Green councillor in 2019 – the first time she has been a councillor. She said “It is my privilege to serve the people of Godalming as their Mayor for this Jubilee year. I will enjoy seeing what projects are being developed in Godalming and participating in the wide range of artistic, entertaining and celebratory events.\n“One of the Mayor’s tasks is to recognise what has been achieved in Godalming. Godhelmians worked together to support each other through the pandemic; this type of working together will still be needed as we face the cost of living crisis and further changes owing to the climate crisis.”\nAs Mayor of Godalming, Shirley nominated What Next? Climate Emergency Centre for Waverley as her charity of the year. The team at What Next? have dedicated themselves to providing information and support to people who are concerned about the climate. Shirley hopes to have soon set up other community services such as a Library of Things, free home energy surveys, and much more via the centre.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_waverley-climate-plans/content_5.html": "29 January 2022\nFantastic news for Waverley Borough Council – a new report on council climate plans has found WBC are the best council in Surrey, and fifth across the whole country, with a score of 76%!\nThe report, released by released by Climate Emergency UK, examined council Climate Action Plans in nine different sections. It was certainly no surprise to us that the Green Party is represented on four of the top five district councils, including as part of the governing alliance on two. On both these councils – including WBC – a Green councillor heads the Environment Committee.\nGuildford Borough Council scored relatively poorly with just 39%, performing below average. We hope that better integration with WBC – including with Green councillor Steve Williams, who is portfolio holder for environment at Waverley – will enable GBC to catch up with the neighbouring borough quickly.\nWaverley is surging ahead on sustainable housing, with all new social builds to be net zero carbon, including several Passivhaus-standard homes finished last year – among the first built and rented by local authorities nationwide. On green transport, WBC is making significant investment in walking and cycling infrastructure, EV charging and improving public transport. The council also strongly opposes fossil fuel drilling locally, with Green Party and other councillors heavily represented at the recent Toe2Toe demonstration in Dunsfold.\nMeanwhile, Surrey County Council scored slightly higher, at 48% – but along with our Green county councillors, we have serious concerns about SCC’s climate strategy and delivery plans. Targets in the strategy plan are frequently far behind where they need to be to avoid significant climate and ecological impacts, and some key areas have no targets at all. On top of that, the delivery plan fails to lay out paths to meet all targets. Some schemes the plan relies on to achieve its goals – like the Green Homes Grant – had already been scrapped by the government long before the plan was approved by Conservative councillors.\nSteve Williams, Green councillor for WBC and Godalming Town Council, said “I’m delighted to see Waverley’s ranking in this Climate Emergency UK report. I want to thank my fellow Green Party councillor on WBC, Martin D’Arcy, and the many Green members and supporters across the borough for their hard work in the development of this plan. I would also like to thank all the local residents who responded to our consultation on the draft plan.\n“I look forward to continuing to work with other progressive councillors – Greens, Liberal Democrats, Labour, Residents and Independents – as well as the excellent council officers to make this Action Plan a reality. In particular, WBC’s Sustainability Team led by Fotini Vickers will be instrumental in our work to make the borough a greener, fairer, healthier and happier place to live. The biggest challenge we face is not feasibility or ambition – it is continued Tory funding cuts to local authority budgets.”\nThis success proves once again that when Greens are elected, we deliver the positive changes that people voted for, working collaboratively to move forward an agenda for a Green New Deal locally. It is possible to tackle the climate and ecological emergencies in a way that ultimately not only saves money, but also creates healthier towns and villages, cuts bills, provides green jobs, and builds community. We look forward to working cross-party in Guildford and Waverley (and on Surrey County Council) to realise this greener future in a fair and sustainable way.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_greening-waverley/content_18.html": "Save our High Streets\nWaverley Borough Council is trying to preserve our High Street by buying shop premises to help meet the needs of local people by supporting independent, sustainable businesses, as well as providing genuinely affordable homes for sale and for rent.\nRethink council work\nWaverley is consulting on how to reshape The Burys council offices (currently unsuitable and with massive energy costs), without incurring huge financial problems. One proposal enables us to provide high-quality, efficient services to local people, expand genuinely affordable town centre housing, relocate some car parking spaces and preserve our riverside – all while leaving the Burys Field untouched and transferring its management to Godalming Town Council for more effective local oversight.\nProvide youth services\nGodalming Town Council has acted to make provision for the young people of our area, and has made huge leaps forward with the youth centre and other projects – at a time when many councils are scrapping services and closing doors to young people. GTC has recently appointed a full-time youth worker, based in Broadwater.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_category_uncategorised_page_2/content_28.html": "Skip to content\nSkip to footer\nGuildford & Waverley\nMenu\nNews\nEvents\nPeople\nCampaigns\nAbout us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nUncategorised\nHome\nUncategorised\nGodalming’s first Green mayor!\n19 May 2022\n/\n14 November 2023\nby\nspeters\nRead more »\nTo top",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_author_speters/content_11.html": "20 April 2024 / 27 May 2024 by speters\nRead more »\n11 December 2023 by speters\n10 November 2023 / 14 November 2023 by speters\n3 November 2023 / 15 November 2023 by speters\n1 November 2023 / 15 November 2023 by speters\n5 October 2023 / 15 November 2023 by speters\n23 September 2023 / 14 November 2023 by speters\n19 May 2022 / 14 November 2023 by speters",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_local-actions/content_15.html": "Fighting for Green Spaces and Biodiversity\nSteve has been Portfolio Holder for Environment & Sustainability on Waverley’s cross-party Executive since 2019.\nHe has worked on a number of local issues in Charterhouse Ward, including opposing inappropriate development, such as proposals by developers to build\non Green Belt land and over-ride the wishes of local neighbourhoods.\nHe has also been pushing Surrey County Council to reduce traffic speed on Charterhouse Road and down to 20mph in residential areas, expand walking and cycling routes and provide better public transport.\nWorking for local families, looking after green spaces\nClare has been keeping a close eye on the health of the young trees planted opposite the Binscombe Crescent shops, and liaises regularly with the Waverley tree officer about their care.\nThe sudden closure of the Busy Bees nursery on Green Lane has been a real blow for local parents, for whom the difficulty of finding affordable childcare is an added stress. She surveyed all the nurseries in Godalming and produced a report on the worsening capacity in our town.\nWorking to keep Godalming Green\nCouncillor Bob Crooks is the Green Party councillor for Holloway Ward. Apart from the casework for his ward, he has been working tirelessly for all the people of Godalming as Chair of Godalming Town Council’s Environment & Planning Committee. As Chair of the committee, he aims to ensure environmental issues are not ignored in planning decisions, and has been helping to ensure that Godalming Town Council keeps to its robust targets for reductions in its carbon footprint.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_events/content_8.html": "Green Party Quiz Night\nSaturday 22nd February 2025 at St John’s Church, Farncombe, GU7 3EJ. Doors open at 7pm Quiz starts at 7.30pm.\nBring along a team or join a team for an evening of quizzing. This fundraising event for our local party. Prize for winning team and Raffle prizes to be won.\nThere will be a bar throughout the evening. Feel free to bring along your own food or snacks.\nTicket price £10 a head, enter a team ( average team size 6) or join a team.\nGreen Party Fundraiser Event: Positive Vibes\nSaturday 29th March, KEEP THE DATE.\nPositive Vibes is an evening of live music that will get you up on your feet and having a dance or if you prefer a toe tapping evening. More information will be available soon.\nGreen Drinks\nGodalming Green Drinks: We meet up on the first Monday of every month at the White Hart Pub, 19 Bourne Road, Farncombe GU7 3NH from 7.30pm. The pub has a car park at the rear and is a 5min walk from Farncombe Railway station. Join us for an informal chat and meet local party members and friends. We are looking forward to the year ahead and will be planning ways in which our local party can move forward and become more active within our community. If you have any questions or want to find more, please come along.\nWe look forward to seeing you, Guildford and Waverley Green Team\nMonday 6th January: Happy New Year. Come and join us for the first Green Drinks of 2025.\nMonday 3rd February\nMonday 3rd March\nSubsequent dates: 7th April, 5th May, 2nd June.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_news_page_2/content_29.html": "The homepage of your local Green Party for Guildford and Waverley boroughs\n19 May 2022 / 14 November 2023 by speters\nRead more »",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk/content_1.html": "At the last AGM our new Guildford and Waverley Green Party banner was revealed. A massive THANK YOU to Trish Johnston who spent many days and hours making it. Trish came along to our Green Quiz last February and was keen to contribute to our local party. She moved from the Isle of Wight where… Read more: New G&WGP Banner",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2025_01_02_new-gwgp-banner/content_14.html": "At the last AGM our new Guildford and Waverley Green Party banner was revealed. A massive THANK YOU to Trish Johnston who spent many days and hours making it. Trish came along to our Green Quiz last February and was keen to contribute to our local party. She moved from the Isle of Wight where she had previously made their banner. We are so grateful and will now be able to proudly display it at all the events we attend.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_10_05_godalming-library-of-things-now-open/content_27.html": "Many of our members, current and former councillors were pleased to join the launch of Godalming Library of Things yesterday!\nA Library of Things acts like a normal library, but instead of borrowing books you borrow items you’d use every so often but that it makes no sense for you to buy – for example, a hedge-trimmer, carpet cleaner or gazebo. Instead of each of us buying our own – and wasting money, space, resources and energy – you can instead borrow one for free as and when you need it!\nThis fantastic project is the result of collaboration between What Next? Climate hub, Godalming Town Council and Godalming Library. Former Green mayor Shirley Faraday and former Green candidate David Faraday in particular have dedicated huge amounts of time to getting the Library established over the past year.\nIt will soon be saving literal tonnes of carbon emissions – not to mention a huge amount of money, storage space and time – and helping build a more collaborative local community. Congratulations and a huge thanks to all involved! Click here for more information, or click here for a full inventory of items and to register to borrow.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_09_23_guildford-greens-question-angela-richardsons-claims/content_23.html": "This Wednesday’s episode of Politics Live (20/09/2023) was viewed with particular interest by Guildford constituency-based members of Guildford & Waverley Green Party, given that it featured both the Green Party co-leader Carla Denyer, and Angela Richardson MP.\nHowever, Richardson made several claims during the episode which, while unfortunately not scrutinised by the presenter, we felt needed some clarification. Members have sent the below questions to her office, and will update with answers if we ever receive one!\n-\nYou claimed that the economy has grown by 60% since 2010. This will not only be news to the thousands of local people still suffering through an ongoing cost-of-living crisis, but also to the Office for National Statistics. ONS figures show an average growth since 2010 of just 1.6% per year – a long way off the purported ‘60% growth since 2010’ claim. Could you please lay out what figures this claim is based on, and what assumptions have been made that result in a percentage so different from those given by official statistics?\n-\nSecondly, you claim that “we have cut emissions in this country since 2010 by 40%”. Could you please again clarify what data this claim are based on, and what assumptions have been made, given that reports from the Department for Energy Security & Net Zero suggest that in fact, territorial emissions have dropped by less than 30% excluding aviation, shipping and externalised emissions in for example imported products. As recommended by the government’s own Committee on Climate Change, when we include aviation, shipping and consumption-based emissions – which appear to have increased since 2010 – the UK’s real emissions cuts are a fraction of the headline figure, mainly due to the ongoing switch from expensive fossil fuels to cheap renewables which has largely been hampered, rather than supported, by successive Conservative governments.\n-\nThirdly, you claim that ‘most emissions come out of people’s homes and buildings that aren’t insulated correctly’. Government figures show the ENTIRE built environment sector – including construction, materials production, land change, transport infrastructure, and heating – account for up to 40% of the UK’s total emissions. Heating is a significant by no means the largest portion of even this 40% figure, and therefore certainly does not generate ‘most emissions’. Could you also comment on the fact that since David Cameron’s government famously ‘cut the green crap’, insulation installations have plummeted by 96% in the UK, with significantly more loft, cavity wall and solid wall insulation measures installed in 2012 alone than in all subsequent years combined? The current Great British Insulation Scheme would take over 300 years to insulate all UK homes to meet your government’s own targets on fuel poverty, even if it is not cut in the recent trashing of our net zero commitments – costing households hundreds or potentially thousands of pounds per year in higher energy bills and leaving thousands of Guildford residents in cold, damp homes, choosing between heating or eating with some suffering unnecessary ill health and even early death as a result.\nBeside these three clarifications, it is unclear how your position in government and support for Rishi Sunak’s announcement remains tenable and consistent with your membership of the Conservative Environment Network, which has opposed Rishi Sunak’s plans and pointed out that many of the u-turns Sunak has made, such as delaying the transition to electric cars or allowing landlords to continue failing to insulate homes, will actually cost the public billions of pounds more. Will you be resigning your government role or your membership of the CEN in light of this contradiction? And if not, what does your membership of the CEN mean to your decision-making in parliament, given that analysis of your voting record by They Work For You shows you ‘generally vote against measures to prevent climate change’?\nWe hope to bring you an answer soon. It is a shame that a BBC presenter would let such claims go without even a mention, let alone a challenge to determine where these figures have come from and how they have been generated, when even a cursory look suggests they may not fully reflect an accurate picture of the economy or this government’s record on climate.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_author_neiljameson/content_25.html": "19 March 2023 / 23 September 2023 by neiljameson\nRead more »\n18 March 2023 / 18 March 2023 by neiljameson\nThe Guildford and Waverley Green Party will be standing it’s largest ever group of candidates for the forthcoming elections this May.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_11_10_sam-peters-launches-idling-petition/content_6.html": "After over a month of back and forth, our co-chair Sam Peters has finally managed to get Surrey County Council to host a petition asking them to take action on idling!\nSign the petition hereIdling – which is leaving a vehicle engine running unnecessarily while stationary – generates around 150 balloons of exhaust fumes a minute, or more for larger vehicles like SUVs. These gases are of course bad for climate change – but can be devastating for human health, and particularly those of children, babies and people with existing respiratory problems.\nIt is estimated that air pollution causes up to 60,000 premature deaths in the UK every year, with the effects of exhaust fumes damage every cell in the body. Idling is in fact already against the law – but most councils still don’t enforce this. Surrey County Council had consistently refused to take action on idling, telling Sam it was ‘a matter for local councils’ despite it being SCC that has authority over transport and parking.\nOther councils have massively cut air pollution, especially around schools and densely populated areas, by enabling parking officers to ask idling drivers to switch off engines. They’d be able to give a £20 on-the-spot fine (but only for repeated refusals to switch off, after explaining why switching off benefits both the driver and everyone around them).\nSam has calculated that idling generates thousands of tonnes of exhaust fumes across Surrey per year – so even tackling a small fraction of them would be hugely beneficial to our air quality, as well as saving drivers money and cutting Surrey’s transport emissions, which account for over 40% of its total emissions.\nWe have six months to reach 10,000 signatures for SCC to consider it – so please do sign and share with friends and family in Surrey who’d like to breathe cleaner air! The link is https://mycouncil.surreycc.gov.uk/mgEPetitionDisplay.aspx?Id=543.\nSign the petition here (or at the link above)",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_about-us/content_4.html": "The Green Party is growing fast. We now represent people in Westminster and in a record number of local councils, as well as in the London Assembly.\nFollowing the 2019 local elections, we have three borough councillors, one on Guilford Borough Council and two on Waverley Borough Council. We also have six town councillors In Waverley, four on Godalming Town Council and two on Haslemere Town Council. In Waverley and in Godalming, our councillors are part of progressive coalitions.\nAll our Green Councillors add that much needed voice to the Council chambers of Guilford and Waverley, addressing critical local issues and providing alternative viewpoints.\nWe’re working progressively on local issues; to improve the lives of all people in Guildford and Waverley, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Guildford and Waverley.\nThe Green Party Political Programme sets out what Greens are in politics to do: to end the system that keeps hurting the environment and all of us who rely on it – and to build a better alternative.\nThis Programme isn’t like other parties’ manifestos, it has not been squeezed through focus groups and stripped down according to the latest polling. Instead it has been built from policies proposed and voted on by our members, looking to secure the long term future of the places and people they love.\nIt’s a vision of a better world, and together we can deliver it.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_contact/content_3.html": "Skip to content\nSkip to footer\nGuildford & Waverley\nMenu\nNews\nEvents\nPeople\nCampaigns\nAbout us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_stop-oil-drilling-in-dunsfold/content_10.html": "Despite the proposal twice being rejected by Surrey County Council, the government has forced through the go-ahead for UK Oil & Gas (UKOG) to drill for fossil fuels in Dunsfold. This beautiful bit of countryside is in an Area of Great Landscape Value, bordering an Area of Outstanding Natural Beauty.\nLed by Green councillor Steve Williams, portfolio holder for Environment on Waverley Borough Council, the council challenged this decision in the courts. The case was heard on 2nd March 2023, and won the right to take the government to court! Steve said “This is a great outcome for the people of Waverley. Without doubt, allowing this exploration would lead to irreversible harm to our environment and to local people. Hopefully now that harm will be avoided”.\nGreen councillor Steve Williams speaks at the Toe2Toe protest against oil drilling in Dunsfold\nJeremy Hunt MP was more than happy to show up for a photo op at the ‘Toe2Toe’ protest at the Dunsfold site – but has so far remained silent when it actually matters. His voting record shows he generally votes against measures aimed at reducing climate change. In 2021, he voted against requiring public authorities to avert environmental damage; follow the precautionary principle; rectify environmental damage at source; and against polluters being made to pay for environmental damage they cause.\nMeanwhile, Green councillors have been subject to intimidation – including an extremely spurious threat of ‘libel action‘ against Steve, which unsurprisingly has gone nowhere. We will not be intimidated, and we will not back down from protecting Dunsfold.\nOn 8th June 2023, the High Court heard arguments from WBC and Protect Dunsfold, including that similar recent fossil fuel proposals have rightfully been stopped due to the impacts of climate change that would result from these projects. Unfortunately the Judicial Review judgement favoured UKOG, who are now pushing to drill as fast as possible. WBC and Protect Dunsfold are appealing this ruling in the courts and will continue to fight against all new fossil fuel extraction, in line with climate science and the government’s own advisers, the Climate Change Committee.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_donate/content_7.html": "Help us get more Greens Elected\nGuildford & East Waverley Green Party, like The Green Party nationally is not supported by big business, hedge fund managers or vested interests. We have to raise all our own money to support our local campaigns and activities.\nIt takes £20 to print 100 Green window posters, £50 to produce a banner, £80 to print a ward newsletter and £800 to print a general election leaflet.\nEvery contribution, however small, helps. Working together, combining our resources, can make a vital contribution to our next electoral breakthrough. If you can donate easily by PayPal, cheque or bank transfer (see below).\nFull record of our annual income and expenditure is shared with our members and the Electoral Commission.\nBank Transfer:\nGuildford & Waverley Green Party\nAccount: 16682896\nSort code: 230580\nRef: ‘Donation’ & your name\nBy Cheque\nPlease make payable to Guildford & Waverley Green Party and send it to our treasurer at: Neil Jameson, 21 Kingfisher Walk, Ash, Surrey, GU12 6RF.\nIf you would rather donate some of your time that is just as helpful and equally valued, please get in touch.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_campaigns/content_2.html": "Skip to content\nSkip to footer\nGuildford & Waverley\nMenu\nNews\nEvents\nPeople\nCampaigns\nAbout us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nCampaigns\nCampaigns\nGreening Waverley\nStop oil drilling in Dunsfold\nLocal Action from your Green Councillors\nTackle air pollution\nWaverley Borough Council 5th in UK for Climate Plans\nTo top",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_11_01_cllr-steve-williams-at-green-talks/content_21.html": "Solar Sisters, Guildford’s first zero-waste shop and café, runs regular ‘Green Talks’ – and on Thursday 16 November our very own Green councillor Steve Williams will be speaking!\n.\nCome along from 18.30-20.00 to hear Steve discuss how progressives working together in local politics can overcome our undemocratic system and create a more equal and sustainable society. Steve has always been a believer in, and worked tirelessly for, collaboration over narrow self-interest in politics – and the results speak for themselves across our local area.\n.\nFor more information, and to reserve a spot, go to https://www.solarsisters.uk/event-details/green-talk-with-steve-williams.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_03_19_green-campaign-meetings/content_30.html": "19 March 2023 / 23 September 2023 by neiljameson\nGreen Party members, councillors and candidates will be having regular meetings in the run up to the elections on 4th May.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2024_04_20_sam-peters-selected-as-green-parliamentary-candidate-for-guildford/content_13.html": "Sam has been a member of the Green Party since 2010. He says, “My first ever vote, as a student, was for the Lib Dems – shortly before they abandoned their election pledges and propped up a Conservative government, which has since led to 14 years of total disaster for the country. I joined the Greens immediately after.\n“I’m often told I must have particular opinions or beliefs because I’m a Green. It’s completely the reverse – I’m a Green because of my opinions and beliefs. On everything from climate to equality, public services to peace, democracy to tax, I find the Greens are the only party committed to genuine change, while the others increasingly follow the ruinous Conservative lead”.\nAware of the enormous damage successive Conservative governments had done to the country, and the impacts of our undemocratic voting system, the Green Party did not stand in Guildford in 2019. This was to avoid further splitting the vote of the majority of local residents who did not want a Conservative MP. Unfortunately, less than 45% of the vote was enough to hand them the seat.\nSam believes now is the perfect time to stand again for Guildford. Not only will the Conservatives lose this election heavily as things stand, but also both Labour and Liberal Democrats have never been so far from the bold, transformative policies the Green Party offers.\nHe continues, “No other party will end sewage dumping and rank corruption by renationalising water; cut bills and end fuel poverty by properly insulating all homes; provide jobs and real energy security with clean, cheap renewables; ensure those with the broadest shoulders pay their fair share to support a decent and healthy society for all; reverse hundreds of disastrous new fossil fuel licences; run public services for the public good, rather than private profit; and so on. Merely tinkering around the edges of a failed system is simply not good enough.\n“I will champion these values and policies in this general election campaign – the first in decades where voters can feel free to vote for the policies they want, rather than just against the worst option. These policies will set the standard for all candidates, and I’m thrilled to see the support we’ve had so far from people across the constituency from all walks of life”.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_03_18_local-elections-2023/content_26.html": "The Guildford and Waverley Green Party will be standing it’s largest ever group of candidates for the forthcoming elections this May.\nThe Guildford and Waverley Green Party will be standing it’s largest ever group of candidates for the forthcoming elections this May.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_tackle-air-pollution/content_19.html": "Whether through making active travel safer and more accessible, ensuring better access to public transport, pushing for sensible planning, reducing emissions or in many other ways, Greens are at the forefront of tackling air pollution locally and nationally.\nAnti-idling campaign\nAfter over a month of back and forth, our co-chair Sam Peters has finally managed to get Surrey County Council to host a petition asking them to take action on idling!\nIdling – which is leaving a vehicle engine running unnecessarily while stationary – generates around 150 balloons of exhaust fumes a minute, or more for larger vehicles like SUVs. These gases are of course bad for climate change – but can be devastating for human health, and particularly those of children, babies and people with existing respiratory problems.\nIt is estimated that air pollution causes up to 60,000 premature deaths in the UK every year, with the effects of exhaust fumes damage every cell in the body. Idling is in fact already against the law – but most councils still don’t enforce this. Surrey County Council had consistently refused to take action on idling, telling Sam it was ‘a matter for local councils’ despite it being SCC that has authority over transport and parking.\nOther councils have massively cut air pollution, especially around schools and densely populated areas, by enabling parking officers to ask idling drivers to switch off engines. They’d be able to give a £20 on-the-spot fine (but only for repeated refusals to switch off, after explaining why switching off benefits both the driver and everyone around them).\nSam has calculated that idling generates thousands of tonnes of exhaust fumes across Surrey per year – so even tackling a small fraction of them would be hugely beneficial to our air quality, as well as saving drivers money and cutting Surrey’s transport emissions, which account for over 40% of its total emissions.\nWe have six months to reach 10,000 signatures for SCC to consider it – so please do sign and share with friends and family in Surrey who’d like to breathe cleaner air! The link is https://mycouncil.surreycc.gov.uk/mgEPetitionDisplay.aspx?Id=543.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_news/content_20.html": "New G&WGP Banner 2 January 2025 / 2 January 2025 by dfaraday At the last AGM our new Guildford and Waverley Green Party banner was revealed. A massive THANK YOU to Trish Johnston who spent many days and hours making it. Trish came along to our Green Quiz last February and was keen to contribute to our local party. She moved from the Isle of Wight where […] Read more »\nSam Peters selected as Green Parliamentary Candidate for Guildford 20 April 2024 / 27 May 2024 by speters Read more »\nGuildford Greens question Angela Richardson’s claims 23 September 2023 / 14 November 2023 by speters Read more »\nLocal Elections 2023 18 March 2023 / 18 March 2023 by neiljameson The Guildford and Waverley Green Party will be standing it’s largest ever group of candidates for the forthcoming elections this May. Read more »",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_2023_12_11_thames-water-and-mps-absent-from-water-meeting/content_9.html": "Following the ongoing issues with water outages across Godalming, Guildford and surrounding villages, Green councillors and members were disappointed to see Thames Water and both MPs for the area fail to attend a meeting convened by Waverley Borough Council to discuss the outages.\nGreens had been calling for an inquiry alongside our WBC coalition partners since the early days of the most recent Thames Water failure. Surrey County Council repeatedly refused to declare a Critical Incident, significantly delaying the response from Thames that – when it came – was confused, uncommunicative, and wholly inadequate.\nCllr Clare Weightman, Deputy Leader of Godalming Town Council, spoke for many local residents with a passionate and highly critical look not just at the latest failures, but also the culture of failure that privatisation and cuts to regulators has caused over the past 30 years.\nResidents present agreed with Cllr Steve Williams, who said “an excellent meeting on the water outage this evening organised by Waverley Borough Council – but shameful that Thames Water refused to attend”. One Conservative councillor tried to claim WBC had made the meeting ‘political’ by not holding it at a time when Thames could attend – but as was noted at the meeting, there was plenty of notice given. Could not one of the 7000+ employees make a weekday at 7pm?\nAs mentioned by another speaker shortly after, another meeting next week in Guildford – which Thames Water and the area’s MPs have said they will attend – is being held on a weekday at 5.15pm, and will only hear a pre-selected set of questions and comments. That conveniently means anybody who works a standard day will be unable to attend, let alone have their voice heard…\nGreens in Guildford and Waverley will continue to push for a full investigation into exactly what went wrong in November, why it happened, and why the response was so poor. We continue to hear more stories from residents who were abandoned without water even on the Priority Register – leaving elderly and disabled residents reliant on town councillors, who drove round the borough long past midnight throughout the outages dropping water which should have been organised by Thames.\nOf course, the ultimate cause of these failures – and countless others, from rampant sewage dumping to asset stripping to shareholder siphoning off billions of pounds while infrastructure crumbles – is privatisation, backed up by a government determined to cut regulations and hamstring regulators to ensure private profits.\nYet it is still ONLY the Green Party who is committed to renationalising our water, to run this vital public service for the public good rather than private profit. Tinkering around the edges is simply not good enough – if water is in private pockets, the priority will always be to increase profits for shareholders, whether that’s through dumping sewage, cutting jobs, failing to maintain infrastructure, or piling up dangerous levels of debt.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_category_uncategorised/content_22.html": "2 January 2025 / 2 January 2025 by dfaraday\nAt the last AGM our new Guildford and Waverley Green Party banner was revealed. A massive THANK YOU to Trish Johnston who spent many days and hours making it. Trish came along to our Green Quiz last February and was keen to contribute to our local party. She moved from the Isle of Wight where […]\nRead more »\n20 April 2024 / 27 May 2024 by speters\n11 December 2023 by speters\n10 November 2023 / 14 November 2023 by speters\n3 November 2023 / 15 November 2023 by speters\n1 November 2023 / 15 November 2023 by speters\n5 October 2023 / 15 November 2023 by speters\n23 September 2023 / 14 November 2023 by speters\n19 March 2023 / 23 September 2023 by neiljameson\n18 March 2023 / 18 March 2023 by neiljameson\nThe Guildford and Waverley Green Party will be standing it’s largest ever group of candidates for the forthcoming elections this May.",
  "https_guildford_greenparty_org_uk_/https_guildford_greenparty_org_uk_author_dfaraday/content_24.html": "2 January 2025 / 2 January 2025 by dfaraday\nAt the last AGM our new Guildford and Waverley Green Party banner was revealed. A massive THANK YOU to Trish Johnston who spent many days and hours making it. Trish came along to our Green Quiz last February and was keen to contribute to our local party. She moved from the Isle of Wight where […]\nRead more »"
}