{
  "http_www_simonbaynes_co_uk_/http_www_simonbaynes_co_uk_news_category_Senedd-News/content_5.html": "Looking Out for the Most Vulnerable during the Covid-19 Crisis 4th April 2020 I’ve been contacted by some of the most vulnerable constituents, identified as being at high risk from Covid-19, who are worried that they’re not getting the... Senedd News\nLaunch in Clwyd South of Welsh Conservatives' new deal for older people 20th April 2016 Simon Baynes, the Welsh Conservative Assembly Candidate for Clwyd South, organised today at Glyn Wylfa, the social enterprise centre in Chirk, the launch of the... Senedd News\nSimon Baynes supports a St David's Day Bank Holiday for Wales 29th February 2016 Simon Baynes, the Welsh Conservative Assembly Candidate for Clwyd South, strongly supports the introduction of a St David’s Day Bank Holiday. Senedd News",
  "http_www_simonbaynes_co_uk_/http_www_simonbaynes_co_uk_cdn-cgi_l_email-protection/content_7.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_simonbaynes_co_uk_/http_www_simonbaynes_co_uk_cookies/content_6.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_simonbaynes_co_uk_/http_www_simonbaynes_co_uk_news_thank-you-your-support/content_3.html": "With the General Election now announced for 4th July, I will no longer be the Member of Parliament for Clwyd South after the dissolution of Parliament, which takes place at the very start of Thursday 30th May. It has been a huge privilege to serve as your MP for the past four-and-a-half years and to champion week-in-week-out your interests in the House of Commons.\nMy team and I have handled a total of 16,669 cases for constituents since I was elected in December 2019, of which 5,939 were casework and 10,730 were answering policy issues. During the General Election my office will remain open for emergency casework and enquiries and can be contacted via my email at [email protected].\nI thank you all for your support and engagement during my time as your MP since December 2019. It has been the honour of a lifetime to serve you.",
  "http_www_simonbaynes_co_uk_/http_www_simonbaynes_co_uk_campaigns_raising-betsi-cadwaladr-concerns-uk-government/content_2.html": "I co-signed the above letter to the Secretary of State for Health and Social Care, Rt Hon Victoria Atkins MP, alongside 5 other MPs from North Wales in relation to the extremely worrying state of NHS services in North Wales.\nWe are extremely concerned about the safety of NHS services in our region, with the Betsi Cadwaladr University Health Board having been placed recently in special measures for a second time by the Welsh Government. Despite being in special measures for six years, the situation has only worsened.\nIt is our view that what has been taking place within the NHS in North Wales for over a decade constitutes a national scandal at least as significant as others previously exposed within the NHS elsewhere in the UK.\nWe have pushed for a public inquiry to be launched; for the restoration of UK-wide healthcare audit, inspection and investigatory mechanisms; and for patients in our constituencies to be given the right of access to NHS services in England.",
  "http_www_simonbaynes_co_uk_/http_www_simonbaynes_co_uk_news_our-achievements-working-together-clwyd-south/content_4.html": "With your support and help we have achieved a great deal for Clwyd South including the news in the last few days that the UK government has awarded step-free Access for All accessibility funding for Ruabon Station. This brings the total of investment that we have secured from the UK government to over £15 million over the last four-and-a-half years, including the £13.3 million Clwyd South Levelling Up Fund (which we won in conjunction with Wrexham and Denbighshire Councils), work on which has progressed significantly at the Trevor Basin and Pontcysyllte Aqueduct, Llangollen and Corwen where it enabled the reopening of Corwen Station last year.\nIn addition to the Levelling Up Fund, we have secured from the UK government £452,000 for the Owain Glyndwr Hotel in Corwen, £374,000 for the Llangollen Railway Trust and £146,000 for the Llangollen Museum, on top of funds for grassroots sports facilities and churches across the constituency, amongst others.\nWe have also helped to secure community-ownership of the Llwyneinion Woods near Rhos and assisted residents at Plas Power, Pant Glas and Plas Brymbo to negotiate better conditions. Given that Clwyd South covers half the Wrexham Council area, we have helped secure from the UK government the North East Wales Investment Zone worth £160 million, City Status for Wrexham and making the shortlist for the City of Culture. We have helped improve connectivity across Clwyd South (including securing the first Universal Service Obligation in Wales to improve broadband for residents in the Ceiriog Valley) and assisted those fleeing the war in Ukraine to find a new home in Clwyd South.\nThese are just some of our achievements over the past four-and-a-half years and a fuller list will be provided on my website in the coming days. Being an MP allows you to work with communities and make a real change, and I take great pride in having had the opportunity to work with you all.",
  "http_www_simonbaynes_co_uk_/http_www_simonbaynes_co_uk/content_1.html": "Campaigns Celebrating Ruabon Station Access for All Announcement Great news announced today by the UK government that Ruabon Station has been… Raising Betsi Cadwaladr Concerns with UK Government I co-signed the above letter to the Secretary of State for Health and Social… Celebrating UK Government Grant for Owain Glyndwr Hotel in Corwen After the wonderful announcement of the grant of £452,700 by the UK government… Latest news Thank You for Your Support With the General Election now announced for 4th July, I will no longer be the… Our Achievements by Working Together in Clwyd South With your support and help we have achieved a great deal for Clwyd South… Recognising Our Amazing Businesses and Residents After visiting Glyn Wylfa on Saturday 18th May, Craig Williams MP and I visited… Find me on Twitter\nCelebrating Ruabon Station Access for All Announcement Great news announced today by the UK government that Ruabon Station has been…\nRaising Betsi Cadwaladr Concerns with UK Government I co-signed the above letter to the Secretary of State for Health and Social…\nCelebrating UK Government Grant for Owain Glyndwr Hotel in Corwen After the wonderful announcement of the grant of £452,700 by the UK government…\nThank You for Your Support With the General Election now announced for 4th July, I will no longer be the…\nOur Achievements by Working Together in Clwyd South With your support and help we have achieved a great deal for Clwyd South…\nRecognising Our Amazing Businesses and Residents After visiting Glyn Wylfa on Saturday 18th May, Craig Williams MP and I visited…"
}