{
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_news/content_2.html": "1st July\nThe North Hackney MRLP Victory Party will be held at The Royal Soverign, 64 Northwold Rd. E5 8RL on Wed 3rd July - The day before the election ! That's how confidant we are. Short speech from Knigel and a 45 min set from The Faux Fibbers + DJs. All welcome. Show starts at 8.00 ish.\n26th June\nKnigel was out campaigning at the weekend with his personnel photographer Ewan Bruce. And he - Ewan, not Knigel, has knocked up this little viddy thing...... https://drive.google.com/.../1AJPggtnRWVCtZisuUV2jI7.../view\n24th June\nIt seems that the contact page on this here website ain't working - so if anybody wants to get in touch please contact me at - This email address is being protected from spambots. You need JavaScript enabled to view it. Also I seem to be unable to load my Manicfesto to this site (when I get Elected I shall have an IT person to do all this sort of thing for me) so I will just have to print some of it here -\nMANICFESTO 2024\nThe congestion charge will be abolished - no one should be taxed for having a heavy cold.\nAnyone who leaves a lime bike in the middle of the pavement will have to provide a gin and tonic to everybody who has to walk around it.\nA Frivilous Fraud Office will be set up to investigate fraud too silly for the Serious Fraud Office\nSupport and finance properly the NHS - Sorry that's not very loony - but all nurses and junior doctors should be given a decent wage.\nWe will stop the small boats. All we've got to do is put tons and tons and tons of concrete into the English Channel. That will stop the small boats. Then people will be able to walk here - That will save them from drowning. Or why dont we just put them on big boats - ferries ?\nTax the rich and pay the workers a decent wage - sorry that's not very loony.\nThe Tories want to bring back National Service. Well I think we should - but only for ex PMs and all MPs who loose their seat or have stepped down at this election.\nStop water companies dumping shit in our rivers and seas - Sorry that's not very loony. In fact all water company bosses should have to swim in their own shit - in our rivers and seas.\nfor more policies see www.loonyparty.com\nVOTE FOR THE MONSTER RAVING LOONY PARTY - THE ONLY SANE THING TO DO IN A WORLD GONE MAD.\n16th June\nKnigel Knapp and Two-faced Pete were out on the streets of Stoke Newington yesterday afternoon trying to drum up support for The MRLP. Well when we say streets we really mean the pubs on Church St. - but they did have to walk between them. A fab time was had by all with many people promising to vote for Knigel on 4th They will be doing something similar next weekend. Keep yours eyes peeled and your cameras ready for that MRLP themed selfie.\n11th June\nAnd The MRLP has a new General Election single out now ! - with Video. Knigel Knapp has got together with Loony legend Joe Jammer, formed 'The Jammy Fibbers' and recorded their version of Alice Cooper's 'Elected'. View the video here - https://www.youtube.com/watch?v=J_HQ8USqk_w . It will be available on all the usual download sites general election week beginning 1st July. Lets get it in the Top 10 !\n10th June 2024\nSo they've sprung another General Election on us - but this time I'm standing - in Hackney North & Stoke Newington - thanks to the people who have donated to my crowdfunder page - https://www.crowdfunder.co.uk/p/mrlpdeposit . You have got another 10 days to go if you wish to make a contribution.......... I shall be publishing my own personal Manicfesto shortly and I shall be walking the streets of Stoke Newington with a bunch of MRLP supporting mates at the weekends hoping to talk to anyone who wants to talk to us about anything that concerns them. Actually it will probably be easier to find us in one of the local hostelries.......\nNov/Dec 2019\nWhat a bloody stupid time for a General Election ! I won't be involved this time - I'm in the middle of making my Christmas puddings - 800 this year. I'm far to busy to at this time of the year to get into any sort of politics - even for The M.R.L.P.\n29th November 2019 -\nJust found out I have been made deputy leader of The Monster Raving Loony Party - along with 4 others -\nthis was back in October - nobody told me !\n- Deputy Leaders\nIn the wake of the Labour Party trying to get rid of their Deputy Leader,\nthe OFFICIAL Monster Raving Loony Party now has 5 deputy leaders!\nKnigel Knapp, Baron Von Thunderclap, Chinners, The Incredible Flying Brick & RU Seerius.\nAnother First for the Loony Party The Dream Team\nHooowling Laud Hope\nJune 2017\nKnigel Knapp stood in Islington North in the General Election and got 106 votes and came 7th out of 10 - Not bad at all considering he did almost no campaigning. And he got loads of coverage in the papers and on telly. Photos of him \"nodding sagely\" behind Jeremy Corbyn while he was delivering his victory speech were beamed alll over the world via facebook. And he even got a photo with a speech bubble in Private Eye. - see campaign 2017.\nMay 2017\nSo it's True ! - Knigel Knapp, Knight of the unKnown and Monster Raving Loony Party Minister for Blatant Lies and Big Fibs, will be standing in the forthcoming General Election ! And just for a change he will be standing in Islington North. Isn't that where a certain Jeremy Corbyn is MP ? So why has Knigel forsaken Hackney and jumped ship (or double decker bus) for Islington ? Nothing to do with all the TV cameras that will be there on the night surely ? And why is he standing against the future (possibly?!??!?) Prime Minister ? Knigel says \" I'm not standing against Jeremy, I'm standing with him - just in case he needs to form a coalition goverment ! \"\nApril 2017\nWell there are rumours flying around that Knigel might be standing in this years General Election - they might be true - watch this space ! In the meantime enjoy The Monster Raving Loony Party's Official General Election Campaign Song - https://www.youtube.com/watch?v=ltsHbFXM4Cw&feature=youtu.be\nI know it's the same as the one we used in 2015 but this election was rather sprung on us and we haven't had time to record a new one. So much for fixed parliaments eh ?\nMay 2016\nKnigel knapp stood as a MRLP candidate for the Welsh Assembly. The MRLP put up over 25 candidates and this entitled us to our first ever Party Election Broadcast. Watch it here - https://www.youtube.com/watch?v=t1bUIycOELw&feature=player_embedded\nVeiw the Monster Mash Video here - https://www.youtube.com/watch?v=ltsHbFXM4Cw&feature=youtu.be\nApril 1st 2015\nApril Fool's Day saw the release of The Official Monster Raving loony General Election Song 'Monster Mash' by The Bigger Fibbers. The Fibbers take on the old 50's hit with an amazing pop concrete remix on the bside. Let's get it in the charts during the week of the general election ! Check out https://www.facebook.com/TheBiggerFibbers?ref=ts&fref=ts for more info and to view the fantastic video.\nApril/May 2014\n3rd Jan It's 2012\nAnd there are no bendy buses on the streets of London ! The Mayor of London has nicked another one of The MRLP policy ideas. See my 2005 manifesto.And where have they gone?? - Malta!! I told u Boris was one of us!\nHere's to 2012 being a Raving Loony year!\nFri/Sat 23th/24thSept 2011\nSo conference time is upon us - The Monster Raving Loony Party will be holding their annual conference in Fleet, Hampshire.At The Links Hotel - oppisite the railway station We shall be discussing politics - a bit, and drinking some beer - a lot. The BIG Fibbers will be performing on both days. See www.omrlp.com for more details.\nHey Hey Hey ! We've finally got hold of the 2010 campaign video - View it here now !\n{youtube}http://www.youtube.com/watch?v=2E7TcX21YoE&feature=youtu.be{/youtube}\nOld News - Thurs 1st July 2010\nKnigel was persuaded to take the loony floating bicycle out onto the River Thames again. (doesn't take much persuading - just the promise of an attentive photographer) This time he was water cycling in the Kingston-upon-Thames area much to the amusement of everyone on the river bank and on the pleasure boats. There was suppossed to be an article in the Surrey Advertiser about this - If anyone saw it can they let us know.",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_campaign-2010/content_4.html": "I wasn't going to stand in the election this time round. I'd done what I wanted last time (had a bloody good time and raised awareness about the MRLP and got people thinking about their vote). And I knew everyone was really pissed off with politicians of all parties - what with the expenses scandal and everything. But then two strange scotsmen in The Rochester persuaded me I should. ( also people had been coming up to me in the pub to tell me they would vote for me this time.) So this is what happened........\n182 votes ! Thanks very much all you loonies out there. If everyone had been allowed in to vote might have got a few more!???!??!?\nThurs night was a very strange affair. We arrived at the town hall at about 11.30 to find some very angry people who hadn't been allowed to vote. I'd be angry too. After talking to them we wandered inside and began the long wait. The very long wait. The 15 hour wait! It was supposed to be all over by 4.00 am but it took until almost 11.30am on the fri morn just to finish verificating the three votes. I don't think I've ever drank so much coffee or watched so much political TV. It took just 2 1/2 hours to actually count the the parliamentary vote and so by 2.30 - surprise, surprise - Diane Abbot was announced the winner. Hey! - she actually spoke to me this time! (Actually her entourage were really friendly.) It had been an interesting but Knackering night - so home to bed. - No photo's of the announcements I'm afraid - My official photographer had wimped out hours before.\nWe couldn't organise a victory party in Stokey because of the Tottenham v Man City game last night so The Big Fibbers went over to East Mosely to join in Chinners' celebrations at The Poyntz Arms. Along with Crucial Chris & Monkey the drummer and their bands 'What's Next?' and 'Mojo Crew'. Chinners was playing with 'Duvet'. Lady Titian was there too. We all had a jolly good time. Got back about lunch-time today for some last minute campaigning in Dalston. Then home and a lie down.\nRight - I'm off to vote now. And I think I'm going to vote for myself!\nOut campaigning on the streets again - Met Suzanne Moore - don't really understand why she's standing or what she's standing for. Then to The Rochester to draw the raffle- raising money for clic sargent. Lots of interesting conversations with the locals.\nFri night we spoke to loads of people in every pub in Brecon. Lord Offa got promises of votes from pretty much everyone he met! He's gonna do really well - Maybe even be the first Loony to retain his deposit! - Now is it worth placing a bet on that? Saturday night was Lord Offa's Victory Party - He's celebrating already! We all had a great time. Sunday a slow drive back to London and now back campaigning in Hackney. Been answering a load of email enquiries.\nSo there are nine other people standing in North Hackney. The usual three, the greens, the christain party, 3 independants and a bloke from something called the magna carta party - who they?\nI handed in my nomination papers and £500 at the town hall yesterday. I haven't heard anything from them so I'm presuming it's all alright. Which means I'm doing it! - Vote for me, vote for me and the Raving Loonies!\nActually you will be voting for me, the MRLP and William Hill. William Hill - the bookies - are sponsoring us during the election and it has been decided that the name that appears on the ballot paper will be 'Monster Raving Loony William Hill Party'. I'm not sure that I think this is a good idea - I hope it doesn't put you off. We are still The Official Monster Raving Loony Party - it just doesn't say that on the ballot paper .( more crazy election rules to confuse people). Anyway at least you know now who is sponsering us. All the other parties are sponsored by loads of different people and organizations but do they tell you who they are on the ballot paper? Do they hell. But The Monster Raving Loony Party does. We are sponsored by William Hill. Which means you should be able to get some good loony bets at your local bookies.\nOn Sunday 18thApril Knigel Knapp will be demonstrating the new Loony-bike on the river Thames near the houses of parliament.\nThe Loony-bike is a floating bicycle, capable of speeds up to 10mph.\nKnapp says” They’re great - environmentally friendly and they will get the nation fit if everyone starts using them. And what with global warming everyone might have to use them when the sea levels rise. In the meantime we might have to build a few more canals (but Birmingham has got more canals than Venice) and that can only be good for the unemployment figures.”\nSee Knigel Knapp - and MRLP friends - at about 11.00/11.15 am at the south end of Lambeth Bridge. Meet at Lambeth Pier opposite Lambeth Palace.\nCome along and join in the fun - Dressing up -in party colours, yellow & black or leopard skin print - would be greatly appriciated ! Don't forget your camera ! Help turn the new transport policy into a bit of a party - A Monster Raving Loony Party!\nI gave away loads of badges and posters and even a few copies of the manifesto ! The pub was packed, The Fibbers were great , even my speech went ok. The raffle was rather marvelous and people asked questions and I managed to answer some of them.We drank lots of beer and had a bloody good time ! And Reuters was there to film it all ! - Coming to a TV near you soon - or more likely somewhere in the far east.\nThere being The Royal Sovereign, Northwold Rd. E5 7.00 onwards\n( for more details see entry for 29th March - below )\nKnigel Knapp MRLP posters now available! If any of you lovely people of North Hackney want any to put up in your windows please contact me at This email address is being protected from spambots. You need JavaScript enabled to view it.\nThere are also some more posters available to download free at www.omrlp.com\nThe cover star on this issue (writes N16) is Knigel Knapp. Aside from looking like a derranged Captain Beefheart from his Trout Mask Replica incarnation (google it,younger readers) Knigel is our local Christmas pudding expert and also indulges in musical antics and Shenanighans withhis band The Big Fibbers. He stood at the last General Election as official Monster Raving Loony candidate for Hackney North & Stoke Newington, andhe's doing it again this year. He gathered nearly 500 votes last time around(just a few thousand less than Diane Abbot) and in order to save his £500 deposit this time, he requires over 1200 people to put an 'X' next to his name. Dissappointed as we at N16 are with the identikit posturings and pious platitudes of the main political parties, we have decided to support Knigel, largely as a protest vote against the current Westminster expenses-dodgers, duckpond architecs and the like, and we urge our readers to do the same. We look forward to quaffing celebratory champagne on the house of comms the day after the election. Indeed, so confident is Knigel of victory that he is having his victory party the day before the election. There's chutzpah for you. Vote Knapp : you know it makes sense.\nI couldn't have put it better myself ! - And I like the fact that they are fibbing on my behalf - 500 votes??\nAnd how do we know?\nBecause Knigel Knapp & The NorthHackney branch of The MRLP will be holding a Grand Manifesto Launch on Sat 10th April at The Royal Sovereign, Northwold Rd. E5 .\nThere will be political speeches - sort of, a raffle, a question and answer session - so bring along your questions - and some answers too - cus I haven't got very many - and musical entertainment from The BIG Fibbers.\nSo come along - 7.00 pm onwards - Bring any manifesto ideas that you may have - we want to do what you want to do - we want to have a party - A Monster Raving Loony Party!\nThe weekend of 20th/21st March saw a vist to London by Chris Rogers - Lord Offa of the Dykes. He's standing in Brecon & Radnorshire in the forthcoming General Election. He met up with Knigel Knapp in North Hackney and they spent some valuable time discussing their campaigns and manifestos. They also spent some valuable time sampling the beer that the local hostelries had to offa. It was decided that Chris should try and appeal to the farmers of Mid Wales by offa-ring to collect all their bull-shit. He wants to turn it into energy and feed it into the national grid. Chris also attended the fabulous gig by The BIG Fibbers at The Royal Sovereign on Saturday night. He promptly booked them for his Victory Celebration Monster Raving Loony Party- at his local pub in Llandrindod Wells- to be held on Sat. 24th April - almost two weeks before the probable date of the election .That's confidence for you - or is he just a loony???\nAnother pub quiz will be visited by the Monster Raving Loonies. This time they are descending upon The Nobody Inn on Newington Green on Thurs 4th March. If any one feels like joining us and being part of another humiliating win or a fabulous last place please come along and join in the fun. We will be there from about 7.30 onwards.\nTHE TORIES SAY VOTE FOR CHANGE. THE MRLP SAYS NO! - BRING IN A 99p COIN!\nWe came last. (see below) Hooray!\nNext mrlp pub quiz team appearance will be on Tue 23rd Feb at The Rose and Crown on Stoke Newington Church St.\nStart time - 7.30/8.00 See you there!!\nSo here I am - The campaign for 2010 is under way! It's been a bit of a slow - and late - start but things are beginning to happen.\nI had a brilliant photo shoot with David Green - www.davidxgreen.com - around Dalston . You can see some of the results on this newly updated site - Yes, I've updated the website! -\nWe've also got the MRLP quiz team up and running again. It's a great way of telling a whole pub full of people that The Monster Raving Loony Party is on the scene again. Five of us attended the pub quiz at The Shakespeare on Mon 8th Feb and we came first! (BIG FIB)\nIf anyone is interested in coming along to the next one please get in touch at This email address is being protected from spambots. You need JavaScript enabled to view it. Not sure where we will be but maybe The Nobody or The Sovereign or The old Sheila or....... and it will probably be next week sometime. I will let you know - keep checking here for details.\nAnd we've organised a Manifesto Launch. This will take place on Sat 10th April at The Shakespeare on Allen rd N16. There will be a raffle, some speeches, musical entertainment from The Big Fibbers, lots of beer drinking and a bit of a party - a monster raving loony party! I'm not sure about the speeches because I've pretty much decided that there will be NO POLICIES. This time round a vote for the MRLP will be PURELY A PROTEST VOTE! see manifesto 2010\nSo now we are waiting for them to call the election. - Why can't we have fixed terms? That would stop all this not knowing when - and not being able to plan for - the election will be. And stop that nonsense that happened when Gordon Brown took over running the country and none of us having a vote on the matter.\nBlimey - some real politics! - well that's enough of that.\nTo be continued..............................",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_manifesto-2005/content_7.html": "Knigel knapp - Knight of the unKnown, is standing in the general election as a member of The Official Monster Raving Loony Party. Against Diane Abbott in North Hackney & Stoke Newington (North London)\nSo who is this Knigel Knapp then? This is what he says, when asked.......\n\"I sing in a band called The Big Fibbers. My previous band was The Blatant Lies Big Band.\"\n\"I'm the OMRLP Shadow Minister for blatant lies and big fibs, and as such\nI think I would make a perfect opponent for Diane Abbot (Lab).\"\n\"I'm going to be honest about the fact that I'm lying!\"\n\"Vote for me - and I'll make the world a better place, give everyone a free banana,\ndo anything you want me to, etc. etc.\"\n(If anyone has got anything they want included in our manifesto please contact me at:\nThis email address is being protected from spambots. You need JavaScript enabled to view it.\nand we will do our best to squeeze it in, totally change it or just disregard it all together.)\"\nMore people don't vote than do. If you spoil your vote it doesn't get counted.* A lot of people are pissed off with politics - so let the Powers-that-be know. A vote for The Monster Raving Loony Party is a real protest vote! If you vote for the Greens or Lib Dems is Tony Blair really going to notice? But if all those people who don't normally vote, all those unknown people, voted for the OMRLP then he would have to stop ignoring us. At least we can now have a say..... and a song and a dance and a bloody good party - The Monster Raving Loony Party. Vote for Knigel Knapp - Knight of the unKnown. Don't go unknown any longer.\nOMRLP TRANSPORT\nWe will ban the bendy bus - They're too big and too bendy\nWe will remove all traffic lights. This will mean that everyone will have to drive much more carefully and look out for and after their fellow road users. Otherwise they will all die. We will obviously have to install more zebra crossings. And probably a few people crossings too.\nOMRLP EDUCATION\nWe will bring a 'laughter hour' into all primary schools (like the literacy hour but more useful.) In fact we might extend this scheme to secondary schools and all work places too. We believe that people aren't having enough fun, they should be able to have a laugh and enjoy themselves and if they can't we will have to teach them.\nOMRLP HEALTH\nsee Education - laughter is the best medicine\nOMRLP LAW AND ORDER\nWe will get rid of ASBOs and bring back the stocks. - SFOs (Soft Fruit Only - to be thrown at the incarcerated - pineapples might cause too much injury)\n(Any more Loony ideas greatly appreciated)\n*That was a blatant lie - they do get counted but nobody ever takes any notice of them.\nphoto's by Rob Mason",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_campaign-2005/content_8.html": "Size isn't everything. I have a large, eye catching top hat but that doesn't really mean a thing. So it gets me attention in the street. Along with the tartan trousers and the tailcoat and badges. Which can be very useful when you are trying to get people to vote for you in a general election. But they are just bright colourful items of clothing. They aren't important. They don't mean anything. Which is what a few people said about The Monster Raving Loony Party. But actually very few. The majority of people on the streets and in the pubs were pleased to see us. By 'us', I mean myself and my small band of loyal supporters - about four of us most days, all dressed in suitable attractive attire. It's true many people were surprised to learn that the Party was still going strong (we fielded 19 candidates across the country)Loony coat after Screaming Lord Sutch's untimly death in 1999. I told them that it had been a big blow to us all but that the party had decided to party on. Sutchie was an inspiration to us all and we were determined to keep his brand of loony politics flying in the face normality.\nMost people were glad that we were. There were an awful lot of disillusioned people on the streets of Hackney - fed up with New Labour, Diane Abbott and politics in general. I had been one of them for a fair few years - \"Don't Vote, the government always get in\", and \"Anyone who wants to be a politican shouldn't be allowed to\", was my way of thinking until I joined The Offical Monster Raving Loony Party. Then I realised that a vote for The OMRLP was a real protest vote. If I could persuade all those people who don't normally vote (so don't vote normally) to vote for me I wouldn't win but at least they would have a say. And if they wanted, a bit of a song and dance too. On the road againAnd I got 248 of them! Not a lot by normal standards but as I said before size isn't everything. I knew I was getting somewhere when a middle-aged man came up to me while I was having a quiet pint in The Rochester. \"You're that Raving Loony bloke aren't you?\", he said. I nodded. \"Well you've got my vote -there's no other c*** worth voting for.\"\nI'd launched my election manifesto at the beginning of March at The Shakespeare in Allen Road. The pub was beautifully decorated with yellow and black balloons and streamers. There had been a small 'Don't Miss' article in that week's Time Out and the place was packed. Entertainment was provided by my band The Big Fibbers. I am a Big Fibber! - I'm the OMRLP shadow minister for Blatant Lies and Big Fibs. Fed up with Labour lies? Well vote for me and I'll make the world a better place, give everyone a free banana, do anything you want me to, etc. etc. At least I was going to be honest about the fact I was lying.\nOne of my most popular policies (or big fibs) was the banning of the bendy bus because they are too big and bendy and they don't make accordian type sounds as they go round the corners. I think a lot of people are missing the old 73 routemaster. I was surprised that I didn't get more stick for wantng to bring back the stocks in place of Anti-Social Behavour Orders but people really seem to want something done about this yob culture. I know - Lets ban hoodies!!!!? We're supposed to be the loonies!\nAnd another thing.\nThe count, at the town hall on election night, was pretty interesting too. Lots of boring standing around waiting for the results but we managed to have some jolly good fun. Everyone seemed really pleased to see us, oh, except Dianne Abbot - she wouldn't even say hello. She's obviously a far too serious politican to be seen with people like us. And we are just ordinary people who want to put a bit of fun back into politics. If anyone would like to help us please contact knigelknapp@hackneyloonies. We need someone to stand in South Hackney as well next time.\nPhotographs ©Luigi Cifali, Amy Scaife.",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk/content_1.html": "KNIGEL KNAPP\nKnight of the unKnown\nHackney's Official Monster Raving Loony Party representative\nAnd now one of the five Deputy Leaders !\nThe M.R.L.P. Shadow Minister for big fibs & blatant lies.\nHe sings in a band called The Fibbers (see www.bigfibbers.co.uk).\nAt last a politician who is honest about the fact he is going to lie!\nKnigel Knapp stood in the 2005 and the 2010 general elections in N. Hackney & Stoke Newington.\nIn the 2017 general election he stood in North Islington\nAnd he will be standing once again in Hackney North in 2024\nCheck out the new 'news page'\nto see what he's been up to since.",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_manifesto-2017/content_6.html": "VOTE FOR\n& THE MONSTER RAVING LOONY PARTY !\nMonster Raving Loony Party parliamentary candidate for Islington North\nMRLP Minister for Blatant Lies and Big Fibs\nI’m not standing against Jeremy Corbyn but with him – in case he needs to form a coalition government !\nI sing in a band called The BIG FIbbers. At Last ! An honest politician ! - I'm going to be honest about the fact that I'm lying !\nVote for me and I'll make the world a better place, give everyone a free woolly hat (not that I want to pull the wool over your eyes), do\nanything you want me to (all lies, lies, lies but at least I‘m telling you I‘m lying)\nSOME MANIFESTO PROMISES\n(or big fibs)\n- We will pump loads of money into schools and the N.H.S. How will we be able to afford to do this ? – by scrapping\nTrident. We will replace it with a 3-Pronged Toasting Fork – which we will NEVER use.\n- We want to bring in more cycle ways - across the rooftops of London. A big wide track along the top of Oxford street for instance. Up there cyclists would be safe and the views would be great.\n- The MRLP wants to stop the country going to the dogs - so we will ban greyhound racing.\n- We will build more canals (which will be good for the unemployment figures) and promote the use of floating bicycles.\n- The MRLP still opposes capital punishment - It's unfair on Londoners.\n- We will bring in a 99p coin to get rid of some of that loose change\n- The MRLP will replace the English symbol of 3 lions with 3 badgers. How often to you see lions roaming around the english country side - Stop the badger cull !\n- And as for Brexit ? - I'll have a full English please - Bacon,egg sausage, beans, toast, with maybe a bit of Bubble on the side…….\n…... “There may be Bubble ahead, But while there's music and The Loonies and love and romance, Let's face the music and dance.”\n- And can we fix the health service ? – Well laughter is the best medicine……..\nVote for The Monster Raving Loony Party -\nThe only sane thing to do in a world gone mad.\nWant to know more?\nSee – www.loonyparty.com",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_manifesto-2010/content_5.html": "12th April\nSo there is a manifesto now and here it is -\nTransport -\nWe will ban the bendy bus. They are still too big and bendy - and they don't even make accordian noises as they go round the corners.\nWe want to bring in more cycle ways - across the rooftops of London. A big wide track along the top of Oxford St. for instance. Up there cyclists would be safe and the veiws would be great.\nWe will build more canals (which will be good for the unemployment figures) and promote the use of floating bicycles. See demonstration of the loony floating bicycle on The Thames by Knigel Knapp on 18th April\nEconomy -\nThe Tories say vote for change. We say No ! - We will bring in a 99p coin.\nLaw & Order -\nWe will abolish ASBOs and instead superglue young offenders together . If you can't beat them - you're not allowed to - join them.\nHousing & The Enviroment -\nIt's no use building new houses on flood plains - unless we also build some airports and runways. Then the flood planes will be able to take off, circle around for a bit and wait for the floods to subside.\nEducation -\nSATs will be abolished. This is due to our concern with the rise in childhood obesity. Instead we shall introduce STOODUPs and RANAROUNDs.\nHealth -\nLaughter is the best medicine\n15th Feb\nWell that's not entirely true. In fact it's a big fib.\nThe trouble with policies is that they get nicked. It was Lord Sutch who first came up with the idea that people should be allowed to vote at the age of 18. And he was the first to campeign for the all day opening of pubs. Both these policies were eventually hijacked by the so called normal parties and have now become law. Since then we have got passports for pets, which was another loony idea originally.. And independent local radio, abolition of the 11+ exam and even devolution - all ideas first put forward by the MRLP.\nEven some of my ideas from my 2005 campaign have been nicked. Ban the bendy bus I said - and along comes Boris Johnson* who promises to do just that. Not that he has yet - but the 38 has reverted back to a double decker, along with others all over london . All we've got to do know is turn the 73 into a double decker once more and Church st. will be safe again.\nAnd my idea for removing all traffic lights has sort of been taken up by some authorities. Ok so they're not removing them all ( I still think that would make everyone drive more carefully - because they would have to!) but they have been removed from Exhibition rd., Sloane Sq. and on parts of Camden High st. - (along with some of the kerbs and the street furniture) in the hope that it make people slow down.\nSo - will there be any policies in 2010? Well Go to www.omrlp.com for the party manifesto - frankly they are a bit nuts - but then what do you expect. And check out my manifesto from 2005 I'm recycling all my old proposals - see green too.\nTo be honest I can't be bothered - that's what we like - an honest politician!. The main reason to vote for us is to register your PROTEST VOTE\nBut if any of you have any loony ideas that you would like me to take on board then just let me know and they could well become policy\nOh look Jeff da Vinci has done just that. He says -\n\"I want to see cycle paths all over London - running over the tops of buildings. Just imagine a big wide track running over the rooftops along oxford st for instance. Up there we cyclists would be safe from all the other road traffic and the views would be magnificent.\"\nAlso he asks -\n\"Do you remember those vacum tube things they used to have in factories and offices used for delivering messages? I think they still have something simlar in supermarkets for delivering money up stairs. Well couldn't we build a much bigger version and use it for delivering freight all over the country?\"\nTHE TORIES SAY VOTE FOR CHANGE. THE MRLP SAYS NO! - BRING IN A 99p COIN!\n* I think Boris is secretly one of us really - put him in the right top hat and he looks just the ticket and we've all seem him on 'News for you' and other more recent tv appearances. - We know he's a looney",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_campaign-2017/content_9.html": "So Theresa May sprung a General Election on us – there we all were thinking that it wouldn’t be until 2020 – So much for fixed parliaments eh ? Well it meant that I wouldn’t be able to stand cus I hadn’t got any money saved for my deposit – I thought I’d got another 3 years ! Ah well\nBut then I got a call from Nick the Brick and he persauded me I should stand, but not in my normal constituency, Hackney North, were I live, but in Isligton North, against Jeremy Corbyn, and that he and R U Seerious would help me out with almost half of my deposit money. “Think of the publicity,” he said, “the TV cameras are bound to be there.”\nAfter much deliberation I decided I would do it. But I didn’t have much time. It was now the beginning of May so I’d got about 5 weeks to get everything into gear. The trouble was I was rather busy, what with gigs and work, and I’d booked a weeks holiday in Spain months before – I wasnt going to give that up.\nSo I started campaigning on Facebook, managed to get my nomination forms signed – one afternoon in a little pub I know - and came up with a few ideas for my personal manifesto.\nAnd to be perfectly honest - Ha, now there’s a thing - an honest politican - that was all I did. - Except for a very brief, prerecorded, interview which went out on Jeremy Vine’s Radio 2 show. - I didn’t spend any time pounding the streets with afew friends all dressed up in loony gear handing out flyers and talking to as many people as we could in as many pubs as we could vist, like I’ve done when I’ve stood in previous elections.\nI did find time to organise a Victory Party though. And by June 8th I’d even printed a few copies of my Manifesto. The response on Facebook had been very positve and lots of people had promised to turn up To The Liquor Works on Holloway rd to see my band The Big Faux Fibbers perform . And they did. By 10.00 the place was packed and we all had a great time.\nAt about 11.30 we took two taxis to The Sobell Sports Center. There was myself and 7 counting agents. I thought security would be tighter – It didn’t take long at all to get in. And then the long wait. We wanderd around, chatted to a few people – everyone was really pleased to see us – they always are - drank coffee and had our photos taken by and with numerous people.\nNick the Brick had decided I needed some training and when we heard that J.C. was on his way he insisted that I stood by the entrance to greet him – which I did – his training was paying off ! As Jeremy walked into the hall he was surrounded by a mass of phtographers – the only time I’ve ever seen a real media scrum !\nHalf an hour later the results were announced and there I was on stage right behin Jeremy Corbyn as he was giving his winners speech – pure luck – or was it Nick’s training ?\nI got 106 votes – came 7th out of 10. I was really pleased seeing as I had done no campaigning.\nAnd the response since then has been great. Loads of photos and TV of me behind Jeremy -beamed all over the world via Facebook – see www.facebook.com/nigel52 and I even got a photo – with a speech bubble – in Private Eye !\nYes it was all very good – would I do it again ? – well maybe – but certainly not in the next 6 months - Which is maybe looking likely – ARGH !",
  "http_www_hackneyloonies_co_uk_/http_www_hackneyloonies_co_uk_index_php/content_3.html": "KNIGEL KNAPP\nKnight of the unKnown\nHackney's Official Monster Raving Loony Party representative\nAnd now one of the five Deputy Leaders !\nThe M.R.L.P. Shadow Minister for big fibs & blatant lies.\nHe sings in a band called The Fibbers (see www.bigfibbers.co.uk).\nAt last a politician who is honest about the fact he is going to lie!\nKnigel Knapp stood in the 2005 and the 2010 general elections in N. Hackney & Stoke Newington.\nIn the 2017 general election he stood in North Islington\nAnd he will be standing once again in Hackney North in 2024\nCheck out the new 'news page'\nto see what he's been up to since."
}