{
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_how-we-link-to-the-national-labour-party_html/content_15.html": "The Labour party fights for social and economic justice for everyone. This means that it cares for the interests of all people who receive wages, earn an income as self-employed workers, and receive pensions or State benefits. It does not support inequality of any kind. The UK is a very unequal society - the richest 10% of households hold 45% of all wealth. The poorest 50%, by contrast, own just 8.7%. The Labour Party considers this to be unfair. Current Government policies seek to protect and advance the interests of the rich at the expense of everyone else. This is why the Labour Party opposed the 2016 Budget and has publically criticised the tax avoidance strategies of multinational companies and wealthy individuals, including politicians.\nA recent Devon County Council report shows that North Devon is a relatively poor area of the county, with Ilfracombe Central and Barnstaple Central being in the most deprived 10% of all areas in England. Much of the area ‘is dominated by small/micro businesses, most of which are operating in low value-added sectors and paying low wages. From this starting point, accelerated economic growth is a real challenge.’ The Labour party nationally is committed to helping small businesses develop and grow, to improve the pay and conditions for people who work in them. This is a challenging issue in North Devon, where County Council policies seem focussed on reallocating social and economic resources to the Exeter area, when the opposite is needed. For example, it takes 2 hours to travel by train from Exeter to London, whereas it takes approximately 4 hours from Barnstaple.",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_fire-service-cuts_html/content_10.html": "North Devon Labour oppose dangerous cuts to North Devon Fire Service\n|\nDevon and Somerset Fire and Rescue Service are consulting on a range of savage cuts that will pose a real threat to the safety of our communities. North Devon Labour Party absolutely opposes unnecessary closures and reductions to our fire service dressed up as innovative changes that are in truth driven by ongoing austerity target at isolated regions of the country. |\nNorth Devon Labour supports the Fire Brigades Union in opposing these dangerous proposals. Make your voice heard by taking part in the public consultation online and if you can, attend a public 'drop-in' exhibiton and find out from firefighters themselves what these proposals could cost to the safety of North Devon.\nTo take part and find a drop in exhibition near you, click the button below.\nTo take part and find a drop in exhibition near you, click the button below.",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_jobs-board_html/content_13.html": "North Devon CLP Jobs Board\nWe are a thriving and ambitious CLP! We do not have any paid members of staff and rely on volunteers to help us with our party activity. We know that we have an incredibly generous membership with a wide range of skills. Below are a list of areas that we are looking for some additional help. If you feel able to contribute in any way, please do fill out the appropriate contact form and we will get in touch with you to give you some more details. This list is certainly not exhaustive, and if you would like to get more involved in any area of our CLP's activity, please don't hesitate to bring it up at a meeting or contact Nick our secretary via [email protected]\nEntering the marked register from the 2019 general election\nThe Marked Register is a record of every single person who voted, either in person, by post or by proxy, and is a vital tool to help us reach voters in the most effective way. We are looking for volunteers to help enter data into 'Contact Creator' - the Labour database. If you are able to contribute a few hours during September and October, you can help us by entering the data from home on your own computer. We will provide you with all the information and guidance you require.\nIf you are able to help, please let us know by filling out the form below, or contact CLP Secretary Nick Agnew via [email protected]\nIf you are able to help, please let us know by filling out the form below, or contact CLP Secretary Nick Agnew via [email protected]\nSocial Media Admins\nSocial media is one of the most important ways we communicate with voters in North Devon. If you have experience with social media management and would like to help us get our message out accross Instagram, Twitter and Facebook, we'd love to hear from you.\nRural Affairs Officer\nNorth Devon is a rural area and our relationship with farmers and the rural community is vital to understanding the needs of the constituency. Labour stands on the side of rural communities and it is vital that we are able to communicate this, as well as to make it clear that Labour is listening to rural concerns. It is also important that we take up the responsibility of being the voice of rural constituencies within the Labour Party. If you have experience, expertise or interests in rural affairs and would like to know more about what a role on the Executive Committee would entail, please fill out the form below or get in touch with Nick Agnew via [email protected]\nYouth Officer\nThe role of Youth Officer in a local Labour Party is more important than it’s ever been. Their job is to welcome young members into the local Labour Party, help them feel engaged by putting on interesting events and socials, and turn them into active members who campaign for change in the community and to get Labour elected. Youth Officers are also responsible for making sure that the voices of young members are heard and respected within a local Labour Party. You can find out more about the role of Youth Officer at https://labour.org.uk/activist-hub/local-party-resources/local-party-guides/local-roleholder-descriptions/clp-youth-officer/\nIf you would like to be considered please fill out the form below or contact Nick Agnew via [email protected]\nIf you would like to be considered please fill out the form below or contact Nick Agnew via [email protected]",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_labour-party-conference-2019_html/content_4.html": "North Devon CLP sent a full delegation to the Labour Party Conference this year. There they represented the priorities of North Devon and voted to shape national party policy.\nDay 1. |\nDay 2. |\nDay 3. |\n|\n|\n|\n|",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_councillors_html/content_11.html": "Home\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate\nMenu\nHome\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate\nTerry Elliott\nIlfracombe Town Council\nEmail:\n[email protected]\nTelephone:\n01271 866932\nToby Ebert\nIlfracombe Town Council\nEmail:\n[email protected]\nVal Cann\nBraunton Parish Council\nEmail:\n[email protected]\nMark Cann\nBraunton Parish Council\nEmail:\n[email protected]\nSteve Hinchliffe\nSouth Molton Town Council\nEmail :\n[email protected]\nOliver\nBell\nMortehoe Parish Council\nTelephone:\n01271 870925\nRhys Jones\nBarnstaple Town Council\nLongbridge Ward\nEmail:\n[email protected]\nCecily Blyther\nChittlehampton Parish Council\nHome\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_holiday-hunger_html/content_16.html": "Holiday Hunger Breakfast ClubA new breakfast club has been set up in Torrington to combat holiday hunger over the summer break.\nThe Holiday Hunger Breakfast Club is running on weekdays throughout the summer holidays, offering free cereal and fruit for the town's children. The club runs out of the 1646 cafe in Castle Hill between 8am and 9am. |\nThe initiative is being organised by North Devon Labour's Vice Chair, Councillor Siobhan Strode.\nWith a reliance on food banks increasing and the danger that parents of children from disadvantaged backgrounds struggle to make ends meet during the school holidays, North Devon Labour is proud to support the Holiday Hunger Breakfast Club and has donated funds to go towards food and drink.\nWith a reliance on food banks increasing and the danger that parents of children from disadvantaged backgrounds struggle to make ends meet during the school holidays, North Devon Labour is proud to support the Holiday Hunger Breakfast Club and has donated funds to go towards food and drink.",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_podcasts_html/content_3.html": "The North Devon Labour\nPodcast\nWelcome to the North Devon Labour Podcast! In these podcasts we aim to tell you more about who we are, what we do, and put the spotlight on some of the amazing people, both inside the Labour Party and out, that are doing amazing things in our community. Why not subscribe to the podcast and our YouTube channel to keep up to date!\n03. Val Cann\nListen |\nWatch |\n|\n|\n|\n02. Steve Hinchliffe\nListen |\nWatch |\n01. Mark Cann\n|\nListen\n|\nWatch\n|",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_contact-us_html/content_14.html": "Donate to the North Devon\n|\n|\nDonate to the North Devon\n|\n|\n© 2017 North Devon Constituency Labour Party. Promoted by Mark Cann on behalf of North Devon Labour Party at 70 Saunton Road , Braunton, EX33 1HF.\" |\nStay in touch |",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_north-devon-survey-summer-2020_html/content_9.html": "Home\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate\nMenu\nHome\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate\nThank you for taking the time to fill out this survey. The information you provide helps us identify local issues that we need to focus on and how we can best fight for the needs of the constituents of North Devon.\nAs a political party, Labour has a key role in engaging with voters as part of our democracy. We use information you provide about your views, as well as other information we have, for our purposes as a political party. For more information about the data we process, please see the privacy policy on Labour’s website. If you add your email address and/or ‘phone number to a survey or petition and return it to us, you confirm that you would like the Labour Party and its elected representatives to contact you about campaigns, events, and opportunities to get involved.\nWhat do you think has been the most positive thing to come out of lockdown? What do you hope we can hold onto?\n*\nHow worried are you about the future, as the country emerges from the current crisis?\n*\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n0 = Not worried at all, 10 = Extremely worried\nWhat are your biggest areas of concern for North Devon over the next year?\n*\nThinking about what could improve things in the area where you live, complete the following sentence: \"Wouldn't it be nice if...\"\n*\nComplete the sentence: \"Wouldn't it be nice if...\"\nWhat do you think should be the main priority for local and regional government over the next year? What does a plan for the future need to address?\n*\nIn which town or village do you live?\n*\nWhat are the biggest problems that need sorting out in your local neighbourhood? (Please tick your top three items for action.)\n*\nAccess to social care\nSocial/ affordable housing\nPolicing and tackling crime\nStreet cleaning and litter\nRoad and pavement repairs\nMore reliable rubbish bin collections\nMore places for children in local schools\nRough sleeping and street begging in the local area\nSpeeding traffic\nDangerous parking\nOTHER\n(Pleas tick your top three items for action.)\nIf Other please specify:\n*\nDo you feel more or less safe in your neighbourhood than you did a year ago?\n*\nMuch more safe\nA little more safe\nAbout the same\nA little less safe\nMuch less safe\nWhat do you think your Council should be focussing on in the next year? (Please pick your top two)\n*\nTackling the climate crisis\nMaking sure we have provided accommodation for the homeless\nSupporting local businesses and jobs\nImproving public transport\nTackling dirty air quality\nDealing with crime and anti-social behavior\nMaking sure our streets are clean and tidy\nProviding more social/ affordable housing\nPLease pick your top two\nIf your local councillor was to pass on one message from you to the leader of the Council, what would that message be?\n*\nWho did you vote for at the last General Election?\n*\nLabour\nConservative\nLib Dem\nGreen\nOther\nIf there was a general election tomorrow, who would you vote for?\n*\nLabour\nConservative\nLib Dem\nGreen\nOther\nWe'd love to keep you up to date with how we are tackling the issues you have raised. If you provide us with your name and email we can best serve you and keep you up to date with our campaigning efforts.\nName (optional)\n*\nFirst\nLast\nEmail (optional)\n*\nSubmit\nHome\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org/content_1.html": "Welcome to the North Devon Labour Party website!\nHere you'll find information about the party, our activity and campaigns as well as how to get involved.\n|\nFollow us on Facebook\n|\nTake our community survey\nWe'd like to hear from you! Let us know what issues are important to you and how we can best serve the needs of our communities.\n|",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_about-us_html/content_12.html": "The North Devon Constituency Labour Party (NDCLP) stands up for the needs of our local communities, and supports policies designed to make North Devon economically and socially prosperous for all, not just the privileged few who benefit from the policies of the Tory party. The values of social and economic justice underpin a fairer society, and are key to Labour nationally, and in North Devon.\nThe North Devon Constituency Labour Party (NDCLP) is a thriving active group whose membership has recently grown to over 600 members.\nThe North Devon Parliamentary constituency area covers the communities centred around Barnstaple, Ilfracombe, Braunton, South Molton, Combe Martin and Lynton.\nThe North Devon Parliamentary constituency area covers the communities centred around Barnstaple, Ilfracombe, Braunton, South Molton, Combe Martin and Lynton.\nThe NDCLP functions as a single branch, holding meetings at various locations throughout the area. We meet every 6 weeks and hold regular social events. We also hold public meetings and carry out and support a range of local and national campaigns.\nWe want to hear from you about the issues affecting you and your community, and how best the NDCLP can engage with you.\nWe want to hear from you about the issues affecting you and your community, and how best the NDCLP can engage with you.",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_policy-survey_html/content_18.html": "Home\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate\nMenu\nHome\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate\nNDCLP Policy Survey\nPlease take a moment to answer the following questions. Your feedback will really help us\nset up a process for members to get involved in the party’s policy development system.\nAs a political party, Labour has a key role in engaging with voters as part of our democracy. We use information you provide about your views, as well as other information we have, for our purposes as a political party. For more information about the data we process, please see the privacy policy on Labour’s website. If you add your email address and/or ‘phone number to a survey or petition and return it to us, you confirm that you would like the Labour Party and its elected representatives to contact you about campaigns, events, and opportunities to get involved.\nName (optional)\n*\nThe National Party has established eight Policy Commissions through which policy will be developed. Which of the following are you most interested in (please rank in order of preference)\n1\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\n5\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\n2\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\n6\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\n3\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\n7\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\n4\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\n8\n*\nEarly Years, Education and Skills\nEconomy, Business and Trade\nEnvironment, Energy and Culture\nHealth and Social Care\nHousing, Local Government and Transport\nInternational\nJustice and Home Affairs\nWork, Pensions and Equality\nOn more general issues which of the following would you be interested in (Please rank in order of preference)\n1\n*\nThe electoral process and voting reform\nPotential for Constitutional change\nWomen’s Rights\nNotions of nationhood\nClimate change\nOther (please state below)\n4\n*\nThe electoral process and voting reform\nPotential for Constitutional change\nWomen’s Rights\nNotions of nationhood\nClimate change\nOther (please state below)\n2\n*\nThe electoral process and voting reform\nPotential for Constitutional change\nWomen’s Rights\nNotions of nationhood\nClimate change\nOther (please state below)\n5\n*\nThe electoral process and voting reform\nPotential for Constitutional change\nWomen’s Rights\nNotions of nationhood\nClimate change\nOther (please state below)\n3\n*\nThe electoral process and voting reform\nPotential for Constitutional change\nWomen’s Rights\nNotions of nationhood\nClimate change\nOther (please state below)\n6\n*\nThe electoral process and voting reform\nPotential for Constitutional change\nWomen’s Rights\nNotions of nationhood\nClimate change\nOther (please state below)\nOther\n*\nIf sessions are held on the above topics would you attend:\nOn line via zoom\n*\nYes\nNo\nIn person\n*\nYes\nNo\nDo you have any particular interest in helping to present a session? If so on which topic?\n*\nYes\nNo\nTopic\n*\nDo you have any suggestions on speakers or pre-recorded materials that could help in any of the sessions?\nPlease describe:\n*\nAre there any other comments or other ways you think NDCLP can help you get engaged in the policy process?\nPlease describe:\n*\nSubmit\nHome\nAbout Us\nJoin\nMembers\nContact Us\nEvents & Meetings\nCouncillors\nPodcasts\nDonate",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_campaigns_html/content_2.html": "North Devon CLP campaigns tirelessly on your behalf, tackling issues affecting North Devon and challenging the damage caused by the austerity introduced by the Conservative's and Liberal Democrats. If you would like to support any of our campaigns but have questions, please don't hesitate to get in touch here.\nCurrent Campaigns\nLabour Party Conference 2019Catch up with North Devon's news from the Labour Party Conference!\n|\nClimate StrikeOn Friday 20th September, North Devon Labour activists joined over 1000 young people and adults as part of an international strike to protest against the government's lack of action to tackle the climate emergency.\n|\nDefend Our Democracy\nWith Boris Johnson attempting to silence parliament, North Devon Labour immediately organised a protest in Barnstaple which brought together individuals and organisations from across the political spectrum opposed to his attempts to disrupt democracy.\n|\nFire Service CutsDevon and Somerset are facing unjustified and swinging cuts that will put residents and visitors to North Devon at risk. North Devon Labour are fighting to oppose these dangerous proposals.\n|\nHoliday HungerA new breakfast club has been set up in Torrington to combat holiday hunger over the summer break.\nThe Holiday Hunger Breakfast Club is running on weekdays throughout the summer holidays, offering free cereal and fruit for the town's children. The club runs out of the 1646 cafe in Castle Hill between 8am and 9am. |",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_members_html/content_5.html": "This area is password protected\nPlease enter the password below",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_defend-our-democracy_html/content_17.html": "Thanks to everyone who turned out to the Anti Prorogation - Defend our Democracy protest in Barnstaple on Thursday 29th August. Over 200 people gathered in The Square to protest this smash and grab raid on our democracy. After hearing from Labour's Mark Cann, David Worden from the Lib Dems, Teresa Tinsley from Devon for Europe, Liz Wood from the Green Party and Barnstaple Mayor, Alan Rennles, the crowd moved on to the North Devon Conservative Association offices to hand in a letter of protest to local MP, Peter Heaton-Jones. (Thanks to Dave Sharratt, Malcolm Cowburn, Helen Cooper and Natasha Quarmby of Fields of Light Photography for the pics)",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_events--meetings_html/content_6.html": "Thursday 6th March 2025\nNDCLP Meeting -The Castle Centre, Barnstaple, 7pm\n© 2017 North Devon Constituency Labour Party. Promoted by Mark Cann on behalf of North Devon Labour Party at 70 Saunton Road , Braunton, EX33 1HF.\" |\nStay in touch |",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_climate-strike_html/content_8.html": "|\n|\nOn Friday 20th September, North Devon Labour activists joined over 1000 young people and adults as part of an international strike to protest against the government's lack of action to tackle the climate emergency. Labour are dedicated to tackling the crisis and have a comprehensive plan to deliver a 'Green Industrial Revolution'. North Devon faces some very specific problems as a result of climate change and only a Labour government will protect our incredible natural environment, creating jobs and including the voice of the rural community.\n|",
  "http_www_northdevonlabour_org_/http_www_northdevonlabour_org_cdn-cgi_l_email-protection/content_7.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}