{
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_about-douglas-ross/content_16.html": "I represented my home constituency of Moray as MP from June 2017 until May 2024 and have also represented the Highlands and Islands Region since May 2021. I was born and brought up in Moray and served as a local councillor for ten years and it is an honour to represent my home area. I have served as Leader of the Scottish Conservative and Unionist Party since August 2020.\nIn my maiden speech in the House of Commons, I made it clear that my number one priority would be serving the interests of my constituents. I have always been passionately engaged in local issues and that remains as true today as it did when I was first elected as a local Councillor in 2007.\nIn my free time, I am a qualified football referee, officiating games for the Scottish FA, UEFA and FIFA. Growing up I attended Alves Primary and Forres Academy before studying at the Scottish Agricultural College. I went on to work as a dairyman and worked on farms across Moray.\nLocally, I have campaigned on delivery charges, broadband coverage, investment in the local NHS such as the Keith Health Centre and Moray Maternity Unit, business rates, bus provision and the Moray Growth Deal. On a national level, I hold the SNP Scottish Government to account, urging them to focus on the day job and deliver a better Scotland, instead of dividing our country further.",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_msp-contact/content_4.html": "If you wish to contact me as your Highlands and Islands Regional MSP, you can do so using the following details or fill in the form below.\nThe Scottish Parliament\nEdinburgh\nEH99 1SP\n0131 348 6161\nIf you wish to contact me as your Highlands and Islands Regional MSP, you can do so using the following details or fill in the form below.\nThe Scottish Parliament\nEdinburgh\nEH99 1SP\n0131 348 6161",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_power-grab-speech/content_21.html": "Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers.\nThe contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home O",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_matthew-freeman/content_11.html": "Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers.\nThe contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home O",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_privacy/content_13.html": "This document outlines how Douglas Ross processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Douglas Ross\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Douglas Ross.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Douglas Ross, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Douglas Ross via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_local-mp-launches-new-policy-paper-healthcare/content_28.html": "Local MP Douglas Ross has launched a new policy paper for the Scottish Conservatives aimed at delivering 1,000 new GPs, with a focus on improving rural healthcare in areas such as Moray.\nThe paper, which was unveiled the party’s with shadow health secretary Dr Sandesh Gulhane, also guarantees that every Scot will be able to get an appointment with a GP within a week by raising the proportion of NHS funding going on GP services to 12%.\nIt comes after Mr Ross previously raised concerns that there had been a minimal increase in the number of GPs working in Moray despite an influx of more than 1200 new patients across the area.\nEntitled ‘Modern, Efficient, Local: A new contract between Scotland’s NHS and the Public’, the policy document outlines solutions to a host of problems that have left the health service “in permanent crisis” under the SNP.\nAs part of the major proposals, Mr Ross wants to ban the closure of any NHS facility, unless it is to be replaced by a new one, following the decision to close GP surgeries such as Burghead and Hopeman.\nScottish Conservative leader and Moray MP Douglas Ross said: “The most common way that people interact with our health service is through GP appointments, yet the share of the budget allocated to GP services has declined under this failing SNP Government.\n“And the result has been that, since 2012, 86 local medical facilities have been shut down in favour of increased centralisation.\n“As we have seen here in Moray, patients in areas such as Burghead and Hopeman have had to deal with the impact of losing their medical practices.\n“As a bare minimum, people expect to be able to see a GP in a manner convenient to them but in rural areas such as Moray, this is often not the case which is completely unacceptable. That is why we would increase the portion of NHS funding given to GP services.\n“This would enable us to recruit 1,000 more GPs; introduce a ban on local health closures, while reopening practices to ensure there are no blank spots across the country; make appointments as accessible as possible by offering online booking and consultations; and introduce a new national standard of one week for waits for a GP appointment.”\nOther plans within the policy paper include the creation of an app enabling patients to book appointments, view live waiting times and access their medical records.\nThe Scottish Conservatives also want a “patient guarantee” that would introduce maximum waiting times for different treatments, with sanctions for health boards that exceed them.\nThe proposals would also see the development of a Vaping Restrictions Bill to bring the regulations on vaping in line with those for smoking.\nMr Ross added: “We can all see the cracks in a system that is well past breaking point.\n“Despite the best efforts of hardworking staff, one in seven Scots – over 800,000 people – are on an NHS waiting list.\n“Our health service in areas such as Moray is in permanent crisis. Yet the SNP Government offer no vision to turn around the NHS’s fortunes.”",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_videos/content_6.html": "Skip to main content\nMain navigation\nHome\nAbout Douglas Ross\nNews\nVideos\nMSP Contact\nRight to Recovery Bill\nVideos\nTweet\nNews\nThe Fiona Elcock Vaccination Centre\nThursday, 20 May, 2021\nUpdate on Restrictions\nSaturday, 15 May, 2021\nDuke of Edinburgh Tribute\nMonday, 12 April, 2021\nSuspension of Tariffs\nWednesday, 10 March, 2021\nMatthew Freeman\nMonday, 8 February, 2021\nFishing Compensation Scheme\nThursday, 14 January, 2021\nArmed Forces Pandemic Response\nWednesday, 9 December, 2020\nMoray Growth Deal to be Fast Tracked\nWednesday, 25 November, 2020\nProject Wingman\nFriday, 17 July, 2020\nPower Grab Speech\nWednesday, 15 July, 2020\nLoad More",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk/content_1.html": "Latest News Ross welcomes Home Office confirmation over future use of Eight Acres Hotel Moray MP Douglas Ross has welcomed confirmation from the Home Office that the… Ross praises Moray council leader for \"doing the right thing\" on Cloddach Bridge funding Moray MP Douglas Ross has hailed council leader Kathleen Robertson for “doing… Ross hails \"fantastic news\" of Point of Light awards for Abbie's Sparkle Foundation Moray MP Douglas Ross says it is “fantastic news” that two of his constituents… Facebook Twitter\nRoss welcomes Home Office confirmation over future use of Eight Acres Hotel Moray MP Douglas Ross has welcomed confirmation from the Home Office that the…\nRoss praises Moray council leader for \"doing the right thing\" on Cloddach Bridge funding Moray MP Douglas Ross has hailed council leader Kathleen Robertson for “doing…\nRoss hails \"fantastic news\" of Point of Light awards for Abbie's Sparkle Foundation Moray MP Douglas Ross says it is “fantastic news” that two of his constituents…",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_cdn-cgi_l_email-protection/content_27.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-slams-snp-presiding-over-appalling-mental-health-waiting-times-nhs-grampian/content_30.html": "Moray MP Douglas Ross has slammed the SNP for presiding over “appalling” waiting times for children and young people seeking mental health treatment in NHS Grampian.\nA response to a Freedom of Information Request made by the Scottish Conservatives has revealed the “shocking” length of time patients are either having to wait for a first appointment or the time taken between first and follow-up appointments.\nThe longest wait a young patient suffered before a first appointment with NHS Grampian Child and Adolescent Mental Health Services (CAMHS) was 57 weeks, while another patient had to wait 64 weeks between appointments.\nOn average, patients are enduring waits of over seven months after first being seen, which Douglas says will be “hugely damaging” for young people in his constituency.\nDouglas added that the pandemic has only exacerbated the mental health crisis among young people, which the SNP had already failed to get on top of before Covid struck.\nWith the FOI revealing that the CAHMS workforce in NHS Grampian is below the national average, Douglas has urged “discredited and distracted” SNP health secretary Michael Matheson to “urgently” ensure the health board have the resource to support all those seeking treatment as quickly as possible.\nMoray MP Douglas Ross said: “The waiting times for children and young people desperate for mental health support in NHS Grampian are utterly appalling.\n“It is shocking that any vulnerable young person would have to wait over a year for their first appointment and equally shocking that anyone would have to wait even longer to be seen again.\n“Those sort of intolerable waits will be deeply damaging for those young people in my constituency who are struggling with mental health issues.\n“Even before the pandemic, the SNP had failed to get a grip of the mental health crisis among young people across NHS Grampian. Since Covid struck, those issues have only exacerbated.\n“The discredited and distracted SNP health secretary Michael Matheson must urgently respond to these waiting times. With staffing resources in NHS Grampian CAMHS services significantly lower than the national average, he must ensure that they have every resource they need to treat young people as quickly as possible.”",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news/content_23.html": "Ross welcomes Home Office confirmation over future use of Eight Acres Hotel Friday, 29 March, 2024 Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers. The contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home Office’s contractual arrangements. They aim to complete all relocations in advance of the contract... Local News\nRoss praises Moray council leader for \"doing the right thing\" on Cloddach Bridge funding 27th March 2024 Moray MP Douglas Ross has hailed council leader Kathleen Robertson for “doing the right thing” and ensuring that plans to re-open the Cloddach Bridge will... Local News\nRoss hails \"fantastic news\" of Point of Light awards for Abbie's Sparkle Foundation 26th March 2024 Moray MP Douglas Ross says it is “fantastic news” that two of his constituents have been awarded Points of Light Awards by the Prime Minister. Douglas was... Local News\nRoss raises \"serious concerns\" over lack of support for just transition for oil and gas sector 25th March 2024 Moray MP Douglas Ross has raised “serious concerns” over the SNP-Green government’s lack of support for a “Just Transition” for the oil and gas industry in the... Holyrood News\nRoss pays tribute to \"tireless\" Save our Surgeries campaigners in Scottish Parliament debate 21st March 2024 Moray MP Douglas Ross has paid tribute to “tireless” Save our Surgeries campaigners who have “worked their socks off” after leading a debate in the Scottish... Holyrood NewsLocal News\nRoss \"delighted\" to be leading Holyrood debate on \"Save our Surgeries\" campaign 20th March 2024 Highland and Islands MSP Douglas Ross says he is “delighted” to be bringing forward the case from “Save our Surgeries” campaigners to the Scottish Parliament on... Holyrood NewsLocal News\nRoss \"deeply concerned\" over what NHS Grampian cuts mean for Dr Gray's long-term plan 19th March 2024 Moray MP Douglas Ross says he is “deeply concerned” that nearly £80 million worth of cuts at NHS Grampian have forced changes to a 10-year plan for Dr Gray’s... Holyrood NewsLocal News\nRoss \"delighted\" to attend official opening of Forres Banking Hub 15th March 2024 Moray MP Douglas Ross says he was “delighted” to be at the official opening of the Banking Hub in Forres. Douglas was joined by the local manager of the banking... Local News\nRoss hails \"strength and resilience\" of whisky industry after value of exports revealed 19th February 2024 Moray MP Douglas Ross has hailed the “strength and resilience” of the Scotch Whisky industry after figures showed the value of its exports hit £5.6 billion in... Local News\nRoss: Humza Yousaf has a \"brass neck\" pretending to be a friend of Moray's oil and gas workers 19th February 2024 Moray MP Douglas Ross says Humza Yousaf has a “brass neck” to pretend he is standing up for the oil and gas industry and the workers employed in it, many of... Holyrood News",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_update-restrictions/content_29.html": "Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers.\nThe contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home O",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_duke-edinburgh-tribute/content_12.html": "Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers.\nThe contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home O",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_right-recovery-bill/content_22.html": "Douglas Ross MP MSP's Right to Recovery Bill proposal has been developed by frontline experts to guarantee everyone gets the treatment they need.\nThe consultation for the Bill has now closed.\nYou can view the responses below.\nDouglas Ross MP MSP's Right to Recovery Bill proposal has been developed by frontline experts to guarantee everyone gets the treatment they need.\nThe consultation for the Bill has now closed.\nYou can view the responses below.",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_events_feed/content_9.html": null,
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-urges-snp-be-fully-transparent-over-crown-offices-role-post-office-scandal/content_19.html": "Moray MP Douglas Ross has urged the SNP Government to be “fully transparent” over what the Crown Office knew about the Post Office Horizon scandal which resulted in the wrongful conviction of sub-postmasters.\nDouglas – who has raised the issue in both the Scottish Parliament and the House of Commons over the last week – says that those innocently convicted in Scotland will want the Crown Office to fully explain when they were made aware of issues with Horizon, as well as what correspondence they had with successive SNP justice secretaries in relation to the “appalling miscarriages of justice.”\nDouglas says he welcomes the action outlined by the UK Government to exonerate those who were wrongly found guilty and to speed up the delivery of compensation to them.\nHe has urged SNP ministers to work with their UK counterparts to ensure that process is delivered swiftly in Scotland, where the Crown Office were responsible for prosecutions and not the Post Office.\nDouglas added that he welcomes the Lord Advocate’s willingness to come to the Scottish Parliament to outline the role of the Crown Office, but that she cannot try and “dodge” answering the questions tireless campaigners deserve to hear the truth about.\nMoray MP Douglas Ross said: “The Post Office Horizon scandal is arguably the most appalling miscarriage of justice the country has ever seen.\n“I pay tribute to Alan Bates and the other tireless sub-postmasters who have never given up on their fight for justice.\n“The plans announced by the Prime Minister were extremely welcome and I hope the emergency legislation being brought forward will finally right the wrongs of the past and deliver compensation as quickly as possible to all those who had their lives ruined.\n“With the Crown Office leading prosecutions in Scotland, the situation is slightly different which is why I challenged Humza Yousaf at First Minister’s Questions on the matter. It appears they were aware of issues with Horizon over a decade ago.\n“The SNP need to ensure that the Crown Office are fully transparent with victims and give them the answers they deserve to hear.\n“I’d also encourage SNP minsters to work closely with their UK counterparts to ensure these new laws will be passed as quickly as possible in all parts of the United Kingdom, as so many people know someone in their local community who deserves their name to be cleared.”",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-praises-moray-council-leader-doing-right-thing-cloddach-bridge-funding/content_14.html": "Moray MP Douglas Ross has hailed council leader Kathleen Robertson for “doing the right thing” and ensuring that plans to re-open the Cloddach Bridge will continue apace.\nDouglas slammed SNP and Labour councillors for working “hand in hand” to try and scupper the £1.5 million investment that was given by the Chancellor Jeremy Hunt in the Budget in March 2023.\nHe said that their planned amendment to Councillor Bridget Mustard’s motion – which would have seen the council refusing UK Government investment and been a slap in the face to the Community Council and local campaigners who want this bridge re-opened – shows how “out-of-touch” they are with the needs of the communities affected by the ongoing closure.\nBy contrast, all Conservative councillors voted for the motion including Kathleen after a vote was tied at 12 apiece.\nDouglas says the votes by SNP and Labour councillors show that they preferred to prioritise “party politics” rather than welcoming the significant investment in the community.\nCouncil leader Kathleen Robertson says her casting vote delivers a “major boost” to the local community who are desperate for the bridge to be re-opened and one that will be welcomed by them.\nHeldon and Laich Conservative Councillor Bridget Mustard – who put forward the motion asking councillors to back the funding plans – says she is “delighted” at the outcome and thanked the commitment from the community in progressing the business case to access the funding.\nMoray MP Douglas Ross said: “I am delighted that Kathleen Robertson – as council leader – did the right thing with her casting vote and ensured that the council will accept the £1.5million I secured from the UK Government and fund the remainder of the construction to re-open Cloddach Bridge.\n“It was bitterly disappointing to see SNP and Labour councillors working hand in hand and were hellbent on trying to stop this from happening, which they should be ashamed of.\n“They were playing party politics – because they didn’t want to welcome the funding given by the Chancellor and the UK Conservative Government – instead of welcoming that significant investment from them in our communities.\n“That just shows how out of touch they are with their priorities. By sharp contrast, all of Moray’s Conservative councillors voted to support the local community and finally get this bridge re-opened.\n“I also want to pay tribute to Heldon Community Council for their tireless efforts to get to this stage. They secured the funding for the business case which shows there is a clear benefit to re-opening this bridge.\n“Years on from the bridge being closed we now have positive news for the area that funding from the UK Government and the council will ensure the bridge finally re-opens. Against all the odds and significant reluctance from council officers, along with outright opposition from Labour and SNP councillors, the right decision has been reached and this critical route will be re-opened.”\nCouncil leader Kathleen Robertson said: “I used my casting vote to ensure that local residents who have been deeply impacted by this closure were not ignored.\n“Ensuring that the Cloddach Bridge gets re-opened will deliver a major boost to the local community.\n“As Council leader, I will always put local people first and act on their priorities and that is why I backed the motion put forward by Conservative colleague, rather than the SNP’s amendment.”\nHeldon and Laich Councillor Bridget Mustard added: “I am delighted that the decisions allows us to finally progress with repairing the vital route. I know it will be warmly welcomed by the local community who have been tirelessly fighting to get this crucial bridge re-opened.\n“By working together with our local Conservative MP and the UK Government, we have been able to deliver a plan that can now deliver what the local community wants.\"",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_feed/content_24.html": null,
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_category_Local-News/content_15.html": "Ross welcomes Home Office confirmation over future use of Eight Acres Hotel 29th March 2024 Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers. The... Local News\nRoss praises Moray council leader for \"doing the right thing\" on Cloddach Bridge funding 27th March 2024 Moray MP Douglas Ross has hailed council leader Kathleen Robertson for “doing the right thing” and ensuring that plans to re-open the Cloddach Bridge will... Local News\nRoss hails \"fantastic news\" of Point of Light awards for Abbie's Sparkle Foundation 26th March 2024 Moray MP Douglas Ross says it is “fantastic news” that two of his constituents have been awarded Points of Light Awards by the Prime Minister. Douglas was... Local News\nRoss pays tribute to \"tireless\" Save our Surgeries campaigners in Scottish Parliament debate 21st March 2024 Moray MP Douglas Ross has paid tribute to “tireless” Save our Surgeries campaigners who have “worked their socks off” after leading a debate in the Scottish... Holyrood NewsLocal News\nRoss \"delighted\" to be leading Holyrood debate on \"Save our Surgeries\" campaign 20th March 2024 Highland and Islands MSP Douglas Ross says he is “delighted” to be bringing forward the case from “Save our Surgeries” campaigners to the Scottish Parliament on... Holyrood NewsLocal News\nRoss \"deeply concerned\" over what NHS Grampian cuts mean for Dr Gray's long-term plan 19th March 2024 Moray MP Douglas Ross says he is “deeply concerned” that nearly £80 million worth of cuts at NHS Grampian have forced changes to a 10-year plan for Dr Gray’s... Holyrood NewsLocal News\nRoss \"delighted\" to attend official opening of Forres Banking Hub 15th March 2024 Moray MP Douglas Ross says he was “delighted” to be at the official opening of the Banking Hub in Forres. Douglas was joined by the local manager of the banking... Local News\nRoss hails \"strength and resilience\" of whisky industry after value of exports revealed 19th February 2024 Moray MP Douglas Ross has hailed the “strength and resilience” of the Scotch Whisky industry after figures showed the value of its exports hit £5.6 billion in... Local News\nRoss urges SNP-Green government to re-think \"wholly misguided\" plans to cut funding for tree planting 15th February 2024 Moray MP Douglas Ross has urged the SNP-Green government to re-think their “wholly misguided” plans to cut funding for tree planting. Douglas’ call comes after... Local News",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-hails-fantastic-news-point-light-awards-abbies-sparkle-foundation/content_3.html": "Moray MP Douglas Ross says it is “fantastic news” that two of his constituents have been awarded Points of Light Awards by the Prime Minister.\nDouglas was responding after it was confirmed that Tammy Main and Jennie Cameron have been given the daily award, which recognises outstanding volunteers across the country.\nTammy and Jennie have been recognised for their fundraising through the Abbie’s Sparkle Foundation in 2018, following the tragic passing of their daughter and granddaughter aged just 15 from Sarcoma on Christmas Day in 2017.\nSince then her family have helped to raise awareness of childhood cancer as well as supporting almost 1,700 children with gifts and experiences, known as sparkles.\nThese include offering respite breaks at ‘Abbie’s Sparkle Lodge’ in Cairngorms National Park, with overall fundraising activities now totalling £770,000.\nDouglas says the awards are “richly deserved” for Tammy and Jennie, who have been “incredibly inspirational” in the wake of losing Abbie at such a young age.\nMoray MP Douglas Ross said: “I am absolutely delighted that Tammy and Jennie have been recognised for their tireless fundraising efforts, since the tragic death of their daughter and granddaughter on Christmas Day in 2017.\n“This is fantastic news and the awards from the Prime Minister are richly deserved.\n“Their fundraising in the wake of such a tragedy has been incredibly inspirational and has helped to support so many other children and families going through difficult times in their lives.\n“I know that Tammie, Jennie and all of those in Team Sparkle will continue to work non-stop to deliver wonderful experiences for children across the country, which is a fitting tribute to Abbie.”",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_cookies/content_7.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_accessibility/content_8.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_suspension-tariffs/content_20.html": "Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers.\nThe contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home O",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-raises-serious-concerns-over-lack-support-just-transition-oil-and-gas-sector/content_31.html": "Moray MP Douglas Ross has raised “serious concerns” over the SNP-Green government’s lack of support for a “Just Transition” for the oil and gas industry in the North East.\nDouglas’ call comes following a “damning” report by the Scottish Parliament’s Economy and Fair Work Committee – who heard several evidence sessions surrounding a Just Transition for the North East and Moray – highlighting a 75 per cent cut in the Just Transition Fund for the coming year.\nThe 10-year fund was launched in 2021 and was set to be backed by £500 million. However, funding for this year has dropped to just £12 million.\nDouglas says that will “deeply alarm” highly-skilled workers in the oil and gas sector – many of whom live in Moray – who already feel “completely abandoned” by politicians who want to turn the taps off immediately in the North Sea.\nThe committee also raised concerns over the suspension of the flexible workforce development plan, substantial cuts to employability budgets as well as the ongoing delays to the SNP-Greens climate change plan.\nDouglas says that ministers must act “urgently” on the report and says their “eye cannot be off the ball” when it comes to protecting tens of thousands of jobs across the North East for generations to come.\nMoray MP Douglas Ross said: “I share the committee’s serious concerns about the SNP-Green government’s lack of progress towards securing a Just Transition for our oil and gas sector.\n“This damning report highlights how Shona Robison’s disastrous tax-and-axe budget has slashed funding for the very fund designed to support the future of the industry.\n“That means highly-skilled workers – many of whom are in my Moray constituency – are facing a double whammy from this SNP-Green government. Not only do they threaten tens of thousands of jobs with a presumption against new licences, but they are now failing to provide proper funding as we aim to support workers in the coming years.\n“Only last week, we saw the SNP-Greens climate change targets being torn apart and exposed as unrealistic. It is simply not good enough that they have still failed to produce a climate change plan.\n“The energy sector is one of huge importance here in Moray and across the North East. Ministers cannot have their eye off the ball and must act urgently on this report and deliver a Just Transition that is fair and does not turn the taps off overnight in the North Sea.”",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_category_Holyrood-News/content_17.html": "Ross raises \"serious concerns\" over lack of support for just transition for oil and gas sector 25th March 2024 Moray MP Douglas Ross has raised “serious concerns” over the SNP-Green government’s lack of support for a “Just Transition” for the oil and gas industry in the... Holyrood News\nRoss pays tribute to \"tireless\" Save our Surgeries campaigners in Scottish Parliament debate 21st March 2024 Moray MP Douglas Ross has paid tribute to “tireless” Save our Surgeries campaigners who have “worked their socks off” after leading a debate in the Scottish... Holyrood NewsLocal News\nRoss \"delighted\" to be leading Holyrood debate on \"Save our Surgeries\" campaign 20th March 2024 Highland and Islands MSP Douglas Ross says he is “delighted” to be bringing forward the case from “Save our Surgeries” campaigners to the Scottish Parliament on... Holyrood NewsLocal News\nRoss \"deeply concerned\" over what NHS Grampian cuts mean for Dr Gray's long-term plan 19th March 2024 Moray MP Douglas Ross says he is “deeply concerned” that nearly £80 million worth of cuts at NHS Grampian have forced changes to a 10-year plan for Dr Gray’s... Holyrood NewsLocal News\nRoss: Humza Yousaf has a \"brass neck\" pretending to be a friend of Moray's oil and gas workers 19th February 2024 Moray MP Douglas Ross says Humza Yousaf has a “brass neck” to pretend he is standing up for the oil and gas industry and the workers employed in it, many of... Holyrood News\nLocal MP launches new policy paper on healthcare 12th February 2024 Local MP Douglas Ross has launched a new policy paper for the Scottish Conservatives aimed at delivering 1,000 new GPs, with a focus on improving rural... Holyrood NewsLocal News\nMoray MP disappointed wifh First Minister's speech to farmers 9th February 2024 Moray MP Douglas Ross has called Humza Yousaf’s speech to the Scottish NFU conference in Glasgow today a clear indication that the SNP/Green Government is... Holyrood News\nRoss slams SNP for presiding over \"appalling\" mental health waiting times in NHS Grampian 18th January 2024 Moray MP Douglas Ross has slammed the SNP for presiding over “appalling” waiting times for children and young people seeking mental health treatment in NHS... Holyrood NewsLocal News\nRoss urges SNP to be \"fully transparent\" over Crown Office's role in Post Office scandal 12th January 2024 Moray MP Douglas Ross has urged the SNP Government to be “fully transparent” over what the Crown Office knew about the Post Office Horizon scandal which... Holyrood News",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-humza-yousaf-has-brass-neck-pretending-be-friend-morays-oil-and-gas-workers/content_18.html": "Moray MP Douglas Ross says Humza Yousaf has a “brass neck” to pretend he is standing up for the oil and gas industry and the workers employed in it, many of whom are based in his constituency.\nDouglas’ call comes after the SNP leader and First Minister gave a speech in Aberdeen to attack the Labour Party’s hostility to the industry.\nHowever, he says highly-skilled workers from his Moray constituency and across North East communities “won’t be fooled” by Humza Yousaf’s “shameless spin” and know that the SNP are prepared to abandon them too.\nDouglas highlighted that the SNP were the first to call for a windfall tax on the industry and also have a policy of a presumption against any new oil and gas licences.\nHe says that the First Minister’s speech displayed “breathtaking hypocrisy” and that he is no friend of oil and gas workers based in Moray.\nDouglas says that it is only his party – the Scottish Conservatives – who are standing up for the industry against “reckless” plans by the SNP and Labour and recognising the important role the industry has to play in achieving net zero targets.\nMoray MP Douglas Ross said: “Humza Yousaf has some brass neck making this speech. He is no friend of the oil and gas workers from Moray and across the North East.\n“He is trying to rewrite history with some shameless spin. The highly-skilled workers here based in the industry won’t be fooled by the SNP leader and First Minister.\n“They will remember that it was the SNP that first backed plans for a windfall tax and they will know that the SNP still have a presumption against any new licences for the industry.\n“Humza Yousaf’s speech only exposed his breathtaking hypocrisy. It is only a matter of months since he flew to New York and boasted about Scotland no longer being the oil and gas capital of the world.\n“Both the SNP and Labour’s plans would be reckless for our industry. They are risking tens of thousands of jobs – including many based here in Moray – and would make us more reliant on costly imports.\n“It is only the Scottish Conservatives who are standing up for this crucial industry, recognising the important role it has in Scotland’s economy and how it will play a key role in achieving ambitious net zero targets in the years to come.”",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-welcomes-home-office-confirmation-over-future-use-eight-acres-hotel/content_5.html": "Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers.\nThe contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home Office’s contractual arrangements.\nThey aim to complete all relocations in advance of the contract ending in July.\nDouglas says that while this was a short-term measure to house asylum seekers, it was only a ever a temporary solution and the letter he received from the Minister confirms this will come to an end at the conclusion of the notice period.\nHe added that he will continue to work closely with local authorities to ensure that relocation efforts are as “smooth” as possible both for the asylum seeker, and the hotel at the heart of his constituency.\nMoray MP Douglas Ross said: “I welcome this news from the Home Office.\n“The Eight Acres Hotel in Elgin was appropriate as a short-term solution to house asylum seekers, but better long-term solutions must be found in terms of their accommodation.\n“With this news being announced months ahead of the contract ending, I will continue to work closely with the Home Office and local authorities to ensure that relocation efforts run smoothly as possible for all those involved.\n“There were some concerns raised when the hotel was initially designated as asylum accommodation, but there have been very few issues with it. That said I know people will be pleased to see the hotel soon able to return as accommodation for tourists to our area.\"",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-delighted-attend-official-opening-forres-banking-hub/content_26.html": "Moray MP Douglas Ross says he was “delighted” to be at the official opening of the Banking Hub in Forres.\nDouglas was joined by the local manager of the banking hub and Forres postmaster Councillor Paul McBain, and fellow Forres councillor Kathleen Robertson and other local representatives at the officia opening.\nDouglas praised the “tireless” work of local campaigners – including Paul – who have engaged closely with him and those behind the banking hub to ensure people and businesses in Forres still have access to physical banking services.\nHe says that being able to access services from major banks is “crucial” for customers in rural and remote communities in Moray who have seen branches disappear at an “alarming” rate in recent years and for those who cannot access mobile or online banking.\nPaul McBain – who also represents Forres as a councillor – says he was “incredibly proud” to have played a key role in returning banking services to Forres and says he is already seeing the demand for banking services from loyal customers in Forres.\nKathleen Robertson – who is also the General Election candidate in the new Nairn, Strathspey and Moray West seat – says “fighting for vital local services” like bank branches would be a top priority if she is elected and that banking firms must look at the demand at the hub and stop plans to shut more branches.\nMoray MP Douglas Ross said: “I was delighted to cut the ribbon to officially open the banking hub in Forres.\n“This is now the most Northerly bank hub in the UK and is the result of tireless work of local campaigners – including the new banking manager Paul McBain – and I have been delighted to be alongside them every step of the way and fighting the case with those behind the hub for Forres to be one of their new sites.\n“It is fantastic to see it all come to fruition and for loyal customers in the town to once again have access to banking services from major branches on their doorstep throughout the week.\n“That is crucial for customers in communities across Moray who have seen their branches disappear at an alarming rate and simply cannot rely on mobile or internet banking.\n“I look forward to seeing the Banking Hub used by customers in Forres and for it to continue to go from strength to strength.”\nLocal Manager of the banking hub and Forres Postmaster Paul McBain said: “I am so proud to have the Banking Hub in Forres officially opened.\n“It has not been easy getting here, but I was determined to ensure that banking services returned to the heart of Forres High Street. In the first couple of weeks since it took up its new home at 96 High Street, we have seen that customers in our town need that access to a physical branch.\n“It has been great to work closely with Douglas and Cash Access UK to make the positive case for a Banking Hub to come to our area.\n“I am confident that demand will only continue to grow among customers and the hub will be on hand to support them.”\nForres Councillor and General Election candidate Kathleen Robertson said: “It was great to attend the official opening of the Banking Hub and it has created a real buzz in Forres High Street.\n“It has been deeply disappointing to see many of our bank branches across Moray close in recent years and it was dreadful to see every major bank abandon Forres.\n“If I am fortunate enough to be elected as the next MP to represent Forres, then fighting for physical banking branches to be retained in our communities will be a top priority of mine.”",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_armed-forces-pandemic-response/content_10.html": "Moray MP Douglas Ross has welcomed confirmation from the Home Office that the Eight Acres hotel in Elgin will no longer be used to house asylum seekers.\nThe contract is set to cease as of July this year, with residents notified a minimum of five days in advance and relocated in line with the Home O",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_about-rss/content_2.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_douglasross_org_uk_/https_www_douglasross_org_uk_news_ross-urges-snp-green-government-re-think-wholly-misguided-plans-cut-funding-tree-planting/content_25.html": "Moray MP Douglas Ross has urged the SNP-Green government to re-think their “wholly misguided” plans to cut funding for tree planting.\nDouglas’ call comes after he met with local nursery owner Ronald Christie in Fochabers on Wednesday who has described the planned cuts as “an absolute shocker”.\nMr Christie has also warned that he fears many of the trees on his nursery will have to be destroyed as a result of the budget being cut from £77.2million to £45.4million by ministers in December.\nDouglas says that the cuts will “deeply harm” the industry which is “crucial” to rural communities like Moray and also setback efforts to hit ambitious net zero targets.\nHe says the meeting with Ronald Christie was “positive and constructive” and that the nursery owner of the firm which has operated for 200 years left him in “no doubt” as to the impact the cuts from the SNP-Green government will have on the firm going forward.\nMoray MP Douglas Ross said: “These planned cuts from SNP-Green ministers are wholly misguided and ministers must urgently re-think them.\n“I was pleased to have the opportunity to meet with Ronald Christie in Fochabers and discuss this crucial issue. He has rightly made his feelings known about what these substantial cuts will mean for his firm and the forestry sector.\n“If minsters go ahead with these cuts, they will deeply harm an industry which is so crucial in rural communities like Moray. Christie’s has operated for 200 years and is an important local employer as well as being highly regarded for the quality the nursery produces for plantations across the country.\n“It was shocking to hear about how many trees would have to be destroyed by Christie’s due to SNP-Green ministers financial mismanagement.\n“The meeting with Ronald was positive and constructive and I’m grateful to him for taking the time to discuss his major concerns with me. He left me in no doubt as to what these cuts will mean for his firm and how they will impact on our ability to hit net zero targets. Following this meeting I have written to Scottish Government Ministers echoing the concerns that have been raised by so many.\n“Ministers must listen to Ronald and others who will be impacted by these proposed cuts and ensure that this industry is properly supported going forward.”"
}