{
  "https_www_clwydeastconstituency_com_/https_www_clwydeastconstituency_com/content_1.html": "Paul Penlington\nI have always lived here and have worked for my community most of my adult life. I volunteer at the local foodbank and for a children’s charity and was a County Councillor from 2012-2022 when I lost my seat. I was, without bragging, probably the most active and dedicated Councillor in the county.\nAs an elected member I was very conscious of my responsibility to serve the public honestly and with accountability. I was determined not to be an invisible Cllr who only turned up at election times.\nI always fought for residents, from basics like getting the right bin provided to larger campaigns against the local authority. I responded to every e: mail, phone call and Facebook message and built a solid reputation as a Cllr who worked for the community and was always available.\nI also ensured I delivered every single one of my election pledges during my term of office, there’s nothing worse than a politician who scraps their promises as soon as they're elected. I’m not a career politician, I’m someone who has a deep-rooted belief in a more equal society, working for others and seeking social justice for all.\nIn my youth I worked in the building trade before returning to education as a mature learner. After University I worked for a children’s charity working my way up to project management before moving into education in 2006. I currently teach English at Coleg Cambria, at all levels from basic skills to GCSE, across sites, Deeside, Northop and Llysfasi. My main academic and teaching interest is working with young people with Autism and ADHD.\nMy charity and education work has brought me into contact with many people living in very difficult circumstances. I think seeing children and families suffer as a direct result of the failures and actions of politicians is what led me to try to change things myself. Under Labour and Tory governments things are getting harder with neither planning to help our community.\nRwyf bob amser wedi byw yma ac wedi gweithio i fy nghymuned y rhan fwyaf o fy mywyd fel oedolyn. Rwy’n gwirfoddoli yn y banc bwyd lleol ac i elusen plant ac roeddwn yn Gynghorydd Sir o 2012-2022 pan gollais fy sedd. Fi, heb frolio, oedd y Cynghorydd mwyaf gweithgar ac ymroddedig yn y sir.\nFel aelod etholedig roeddwn yn ymwybodol iawn o'm cyfrifoldeb i wasanaethu'r cyhoedd yn onest ac yn atebol. Roeddwn i'n benderfynol o beidio â bod yn Gynghorydd anweledig a ddaeth i fyny adeg etholiad yn unig.\nRoeddwn bob amser yn ymladd dros drigolion, o bethau sylfaenol fel cael y bin cywir wedi'i ddarparu i ymgyrchoedd mwy yn erbyn yr awdurdod lleol. Ymatebais i bob e-bost, galwad ffôn a neges Facebook a meithrin enw da fel Cynghorydd a oedd yn gweithio i'r gymuned ac a oedd bob amser ar gael.\nFe wnes i hefyd sicrhau fy mod yn cyflawni pob un o fy addewidion etholiadol yn ystod fy nhymor yn y swydd, does dim byd gwaeth na gwleidydd sy'n dileu eu haddewidion cyn gynted ag y bydd yn cael ei ethol. Dydw i ddim yn wleidydd gyrfa, rydw i'n rhywun sydd â chred ddofn mewn cymdeithas fwy cyfartal, yn gweithio i eraill ac yn ceisio cyfiawnder cymdeithasol i bawb.\nYn fy ieuenctid bûm yn gweithio yn y diwydiant adeiladu cyn dychwelyd i addysg fel dysgwr aeddfed. Ar ôl y Brifysgol bûm yn gweithio i elusen plant gan weithio fy ffordd i fyny at reoli prosiectau cyn symud i fyd addysg yn 2006. Ar hyn o bryd rwy’n addysgu Saesneg yng Ngholeg Cambria, ar bob lefel o sgiliau sylfaenol i TGAU, ar draws safleoedd, Glannau Dyfrdwy, Llaneurgain a Llysfasi. Fy mhrif ddiddordeb academaidd ac addysgu yw gweithio gyda phobl ifanc ag Awtistiaeth ac ADHD.\nMae fy ngwaith elusennol ac addysg wedi dod â mi i gysylltiad â llawer o bobl sy'n byw mewn amgylchiadau anodd iawn. Rwy’n meddwl mai gweld plant a theuluoedd yn dioddef o ganlyniad uniongyrchol i fethiannau a gweithredoedd gwleidyddion yw’r hyn a’m harweiniodd i geisio newid pethau fy hun. O dan lywodraethau Llafur a Thorïaidd mae pethau'n mynd yn anoddach gyda'r naill na'r llall yn cynllunio i helpu ein cymuned."
}