{
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_stop-sewage-dumping/content_7.html": "Back Sarah Dyke's Campaign to Protect our Rivers and Streams\nIn 2021, water companies nationwide pumped sewage into our waterways nearly 400,000 times and it has not improved since. Local provider Wessex Water is just as guilty, pumping sewage into many of our rivers and streams. The amount of sewage discharged by Wessex Water in 2021 totalled 375,372 hours as a result of 28,994 spill events!\nWe can't let this go on. Back Somerset campaigner Sarah Dyke and the Liberal Democrats as we seek to make real change.\nStop Dumping Sewage in our Rivers and Streams\n“We the undersigned call on the Government to tax water companies’ profits until they take substantial action to improve our waterways.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_page-4/content_23.html": "Somerton and Frome Lib Dems slam Wessex Water’s apology as far too late after years of sewage scandal\nWessex Water’s apology is far too late after years of sewage scandal Somerton & Frome Liberal Democrats have called for Wessex Water to be overhauled following an overdue apology for sewage dumping.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_signup/content_6.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_liberal-democrat-success-in-castle-cary/content_26.html": "Liberal Democrat Success in Castle Cary\nThe Somerset Liberal Democrats are delighted to have gained a seat on Somerset Council in Castle Cary after the by-election on Thursday 10th August. This increases their total councillors on Somerset Council to 62 and a majority of 14.\nKevin said: “I’m truly humbled by the support shown to me by the many residents I’ve met during this campaign. I will work hard alongside Cllr Henry Hobhouse to ensure the best for all the residents in Castle Cary and all the villages I now represent – I look forward to getting started!”\nBill Revans, Leader of Somerset Council, said “I would like to thank the residents of Castle Cary for their support of the bold initiatives Somerset Council are taking. We are determined to clean up our environment and help those in need during this cost-of-living crisis as part of our vision to build a fairer, greener and more resilient council for Somerset.\n\"Kevin is exactly the sort of councillor we want, someone local and determined to do the best for his community. ”\nSarah Dyke, MP for Somerton and Frome, added “ I am delighted to see this result which builds on the back of my recent success in the Somerton and Frome By-election.\n\"The people I spoke to in Castle Cary told me they want politicians who listen to them and will deliver change.\n\"I look forward to working with Kevin to achieve as much as possible for the area. We need people like Kevin to protect our precious environment and deliver on vital local projects.\"",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_sarahs-summer-highlights/content_3.html": "Somerset Voice: Sarah Dyke\n\"I’m delighted and humbled to have been elected as the first MP for the new seat of Glastonbury and Somerton and I look forward to serving the entire constituency and all who live within it.\nPlease keep reading to learn all about my activity over the summer recess. I hope it provides you with an interesting overview of the work I have been doing recently to represent the constituency.\nPlease don’t hesitate to contact me if you require assistance with anything at all: sarah.dyke.mp@parliament.uk.\"\n- Sarah Dyke MP\nDrop-in Advice Surgeries\nI have already held a number of advice surgeries across the new constituency since the General Election. From Glastonbury and Street in the north to Norton Sub Hamdon, Ilton, Barrington, and Montacute in the south. I am committed to working hard for everyone across the new seat of Glastonbury and Somerton - and not just the people living and working in the towns but those in the villages, too.\nStaying in touch with residents is important to me, and not just at election time but all year round. If you know of anyone in your Parish who needs my help, please remind them to contact me for assistance. If you would like me to hold an Advice Surgery in your area, please get in touch: sarah.dyke.mp@parliament.uk\nLove Glastonbury Visit\nI was humbled to meet all the people behind Love Glastonbury to learn more about their amazing work in the community. An estimated 4 million people across the country have been driven to use food banks and holiday hunger is a growing problem for people dependent on free school meals to feed children.\nWe discussed how it’s simply not acceptable that so many have been pushed into food poverty and that it’s utterly shocking that in 2024, record numbers of people are turning to food banks in order to feed themselves and their families. I will use my voice in Parliament to work towards a day where everyone is food secure and food banks are a thing of the past.\nIf you live in the BA6/BA16 postcodes and are experiencing food insecurity please contact Love Glastonbury or the Glastonbury Foodbank for help:\nStreet Post Office Closure\nThose of you who visit Street’s branch of WHSmith will know it is set to close in January 2025 and, along with it, the town’s main Post Office counter. I met with the Street & Glastonbury Chamber of Commerce and local businesses and residents to hear about how this closure will affect them. I am really concerned about this because access to high street services like Post Offices is vitally important to rural communities. The Post Office is looking to find a new location for the counter they have in WHSmith, and a new franchise is currently being advertised on www.runapostoffice.co.uk. The Post Office would welcome interest from any local retailers who may wish to set up a counter in their existing store.\nHam Hill Visitor Centre update\nEarlier in August, I visited Ham Hill Country park for an update on the planned Visitor and Learning Centre. It is being delivered by Somerset Council with a grant of £1.6million from the National Lottery Heritage Fund. I was delighted to learn that the team is expecting to \"break ground\" in January 2025, with some of the enabling works (services, paths etc) starting before then. I plan to visit during the build phase and will keep you updated on progress.\nHaving been involved in this project from the outset in my previous role as Portfolio Holder for Environment at South Somerset District Council, I am so proud of the work the team are doing to deliver an ambitious vision for Ham Hill despite all the challenges involved with working on such a unique heritage asset.\nMeeting at Street Police Station\nI was pleased to spend time with Sgt. Lancey at the end of August. It was fascinating to learn more about the work our neighbourhood policing teams do to keep us safe in our homes and walking down our streets. We talked about some of the challenges facing officers who need to have more time and resources to focus on preventing and solving crime. The Liberal Democrats are committed to enabling and encouraging local forces to restore community policing in their areas. We also discussed the provision of appropriate sites for our Gypsy, Roma and Traveller community in Glastonbury. I am committed to working alongside all stakeholders to find a better solution for everybody.\nPolice and Crime Plan - Consultation\nThis month I received a letter from Clare Moody, the new Police & Crime Commissioner (PCC) for Avon & Somerset. The PCC is running a public consultation on her Police and Crime Plan and wants your suggestions on how to achieve the priorities set out in the Plan, including:\n- Strengthen neighbourhood policing\n- Reduce violent crime\n- Prevent crime\n- Support victims\n- Improve standards of policing\nThe plan, a link to the consultation survey, and details about public forums being held by the Commissioner can be found here (The consultation is open until 21st October): https://www.avonandsomerset-pcc.gov.uk/about/police-crime-plan24-29/\nVisit to Wessex Water Sewage Works\nRecently I met with Operations Managers at Wessex Water, who talked me through their upgrades at local sewage treatment works. The health of our rivers and watercourses is important to me, and I am committed to holding water companies to account as they work to reduce their impact on rivers across Somerset. Our water industry needs top to bottom reform. That must start with abolishing Ofwat and replacing it with a new regulator with real teeth to clampdown on firms causing pollution, end the sewage scandal and get bill payers the fair deal they deserve.\nStrode College Results Day\nAttending the A-Level results day at Strode College was a real privilege. It was so lovely to share such a joyful day with so many students who received their exam results and hear about their dreams and aspirations. I also took the opportunity to meet with Principal John Revill, to discuss the challenges currently faced by those working in the Further Education sector.\nIt’s clear from this year’s A-Level, T-Level, and BTEC results that the staff at Strode College are doing amazing things with overstretched resources. I’m looking forward to working with John and his team to get a fair deal for his students and for everyone in the FE sector.\nSomerset Skills & Learning\nA few weeks ago I met with Kathryn and Jason (pictured) from Somerset Skills & Learning (SS&L) to discuss the importance of adult education in Glastonbury and Somerton.\nAdult education plays a crucial role in empowering individuals to adapt to changing circumstances, pursue new career opportunities, and contribute meaningfully to society. SS&L engages 6,500 learners in adult community education across Somerset annually, covering everything from pre-entry to Level 5 qualifications and facilitates over 600 different courses.\nThe sector faces numerous challenges, from ensuring accessibility and inclusivity to adapting to emerging trends in digital learning. I look forward to supporting SS&L navigate these challenges effectively and take the opportunities that lie ahead.\nGlastonbury Pride\nI was invited to speak at Glastonbury Pride, held on the last Saturday of July. There was a wonderful parade through the town centre followed by speeches, food and celebration at St Benedict’s Church. The Liberal Democrats have always been at the forefront of the battle for equality. 10 years ago we successfully legalised same-sex marriage - one of our proudest achievements in government. We will always champion the rights and the dignity of all LGBTQ+ individuals.\nBarrington Fete\nI was delighted to join in the fun at Barrington Fete this year - what a fantastic afternoon! Well done to all the organisers for putting on such a wonderful show. I had the pleasure of meeting Ollie the owl as well as Bill and Ben (not forgetting Little Weed!) I enjoyed some lovely conversations with visitors and stall holders and my mother really enjoyed the Biscoff sponge and Ginger cake I took home from the cake stall!\nIf you are organising an event, I would love to come along to support it. Please email details to: sarah.dyke.mp@parliament.uk",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_cidertaxnews/content_29.html": "Sarah Dyke calls on Chancellor to scrap ‘punitive’ cider tax\nOn the 1st of August, the cider industry is facing a hammer blow tax hike due to the government’s reform of alcohol duty. It means an 11p hike on alcohol duty for a 500ml bottle of traditional cider with a typical 6.5% ABV.\nIt will make traditional cider more expensive and local businesses will be less able to compete with industrial alcopop producers. Consumers who are already struggling with the cost-of-living crisis will also be adversely affected as the price of traditional cider will rise.\nDuring the Somerton and Frome by-election campaign, Liberal Democrat Leader, Ed Davey visited Burrow Hill Cider Farm, owners of the iconic Glastonbury Festival Somerset Cider Bus alongside Sarah Dyke.\nAfter founder Julian Temperley and managing director Matilda Temperley shared some of the traditional cider industry’s concerns, the Lib Dems made scrapping the new cider tax a key campaign issue.\nSarah Dyke made the call in a joint letter to the Chancellor co-signed by Liberal Democrat Leader Ed Davey. The two Lib Dem MPs pointed out that in the last three years alone, growers have lost 1,000 of their 17,000 acres of orchard - around 8%. They said they feared that if this trend continued there might be no cider orchards left in 20 years time, with dire environmental repercussions.\nThe cider industry is immensely important to rural areas, especially in the South West. It sustains 11,500 jobs, 300 farmers, and is responsible for 35% of the UK’s annual apple crop.\nWith the deadline to save cider farmers from the tax hike rapidly approaching, Sarah Dyke and Ed Davey urged Mr Hunt to “do what’s right for traditional, small-scale cider producers in Somerset and across the country” and urgently scrap the cider tax.\nSarah Dyke, Liberal Democrat MP for Somerton and Frome, commented:\n“Somerset is world-renowned for the quality of its cider but instead of supporting our farmers, the government has made things more difficult at every turn. Now it’s set to hit them with this punitive cider tax.\n“Conservative ministers like to talk about our world-leading British industries, yet when it comes to taking action they let our globally recognised producers down. It is high time the government gave our cider farmers the support they deserve and scrapped the unfair cider tax.\n“I will make it my mission to stand up for the rural communities in the West Country and give them the voice that so many of this region's Conservative MPs have completely failed to do. That starts by telling the Chancellor that if he cares about the cider industry here in the West of England, he must get rid of this damaging levy.”\nLiberal Democrat Leader Ed Davey said:\n“The traditional cider industry has been utterly abandoned by this government. Instead of standing by our small-scale producers, the Conservative party’s tax changes will benefit the multinational alcopop companies at farmers’ expense. Local communities, jobs and the environment are at stake.\n“It is typical of this government to put barrier after barrier in front of our small and medium-sized businesses. Once again, Conservative ministers are proving to be completely out of touch.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_liberal-democrat-success-in-somerton/content_21.html": "Liberal Democrat Success in Somerton\nSomerset Liberal Democrats are delighted to have held a seat on Somerset Council after the Somerton division by-election on Thursday 28th March. The by-election was prompted by the sad death of Councillor Dean Ruddle. Stephen Page’s win takes the number of Liberal Democrat councillors on Somerset Council to 61, with a majority of 13.\nStephen Page said: “I’m delighted to have won the support of fellow residents and to have been asked to continue Dean’s legacy. I intend to work hard alongside Councillor Tim Kerley on behalf of everyone in Somerton and the surrounding villages and I’m very much looking forward to getting on with the job.”\nBill Revans, Leader of Somerset Council, said: “I would like to thank the residents of Somerton and nearby villages for their support. It’s not an easy time in local government right now, with a broken funding model and extraordinary pressures on social care, but we’re determined to find a way through, to help those in need during the cost-of-living crisis and to continue building a fairer, greener and more resilient council.\n“Stephen knows the Somerton area well and will be a very hard-working councillor, as was his predecessor.”\nSarah Dyke, MP for Somerton and Frome, added: “This is a fantastic result and a fitting tribute to all the hard work that Councillor Dean Ruddle did on behalf of Somerton residents.\n“The people I spoke to in the town and surrounding villages told me they want politicians who listen to their concerns and are prepared to take action to bring about change.\n“I’m looking forward to working with Stephen to protect the environment, improve access to healthcare and fight for vital transport links for the people of this area.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_pharmacies/content_24.html": "Back Sarah Dyke's Campaign to Protect our Community Pharmacies\nHealth campaigner Sarah Dyke is fighting to protect community pharmacies after Glastonbury was left with no high street pharmacy, and calling for emergency funding to prevent more closures.\nThe financial situation in community pharmacies remains unsustainable, however, and Sarah and the Liberal Democrats are calling on the Government to implement a long-term plan for pharmacy services.\n“Sarah is fighting for the vital support our community pharmacies need to survive.”\nSarah Dyke said, “Local pharmacies provide a vital frontline health service. With GP appointments scarce and other health services stretched beyond breaking point, it is more important than ever that community pharmacies are supported.”\nAmid mass closures across the country, Sarah Dyke is fighting for emergency funding from the government to keep community pharmacies open.\n\"But the sad reality is that the Conservatives undervalue them. Even now, when they’re under critical pressure and closing their doors, the Conservative Government won’t step in with emergency funding.\"\nSave our local Community Pharmacies\nBack Sarah Dyke's campaign to protect our vital local pharmacies",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_campaigns_new-train-station/content_11.html": "A new train station for the Somerton and Langport area\nLangport Transport Group and Somerset Council have been waiting since July 2022 for a Government response to plans submitted for a new train station for Somerton / Langport.\nIt’s time to get this vital project off the ground.\nSupport Sarah's campaign for a train station for the Somerton and Langport area\nSign below to back Sarah Dyke’s campaign to get the proposals approved by Government.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_volunteer/content_18.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_sarah-dyke-improving-local-nhs-services-is-my-priority/content_14.html": "Sarah Dyke: Improving local NHS services is my priority\nLiberal Democrat MP Sarah Dyke has announced she will stand for the new Glastonbury & Somerton constituency at the next election, promising to make fixing local health services her main focus if re-elected.\nThe Somerton & Frome constituency is being abolished at the next election. Frome and the surrounding area are to join with the Midsomer Norton and Radstock area in Bath & North East Somerset while Somerton, Wincanton, Langport, Castle Cary, and Martock are set to unite with Glastonbury, Street and Ilchester.\nSarah was elected to represent Somerton & Frome in July in a stunning by-election win with her spectacular victory showing the Liberal Democrats are firmly back in the West Country.\nSince then, she’s been working hard to give voters the MP they deserve, after more than a year of having no representation.\nTogether with her team, she has spent her first 100 days holding surgeries across the constituency, catching up on the backlog of casework that simply wasn't happening under her predecessor, and acting as a strong voice for local people in Parliament.\nAnnouncing her candidacy, Sarah Dyke MP said:\n“It is humbling to represent the area my family have lived in for generations and farmed for over 250 years. When I was elected, I promised to be an active, hard-working MP who would reach out and properly represent people and be the pro-active and visible MP we’ve been lacking in this area for just too long.\n“I believe that everyone deserves a strong local champion, acting as their voice in Parliament. This is what I’ve done, and I am passionate about continuing to do that – because there is so much that needs fixing after years of Conservative neglect.\n“Too many people in Somerset struggle to get a GP appointment, can’t access NHS dental treatment, and face hours of waiting for an ambulance to arrive.\n“That’s why I am putting the NHS at the heart of everything I do. On my very first day in Parliament I demanded a meeting with the Health Secretary to discuss the shocking lack of GP services in our area and the dangerously long ambulance wait times.\n“I am disappointed that I cannot keep representing all our communities but am determined to ensure we still have a local champion standing up for us in Somerset. That’s why I am standing for the new Glastonbury & Somerton constituency at the next General Election.\n“I will continue to work for everyone living in Somerton & Frome, while also being a voice for those across Somerset who also feel they’re being let down and taken for granted by this Conservative Government.\n“Local people have a clear choice at the next election; more neglect, failure, and crumbling services with the Conservative candidate, or myself as a strong local champion fighting to fix our NHS, invest in our towns and villages, and get you the fair deal you deserve.\n“I look forward to getting out and about over the coming months to listen to your concerns and earn your support. If you want to see things change for the better, then support the Liberal Democrats and get involved to help my campaign.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_page-3/content_9.html": "Who will fight for Somerset?\nMore and more people are backing local champion Sarah Dyke to fight for Somerset.\nMore and more people are backing local champion Sarah Dyke to fight for Somerset.\nOnly local champion Sarah Dyke can beat the Conservatives here.\nThe Liberal Democrats have criticised David Warburton after he voted with the Conservatives to hide detailed data of crumbling school buildings in Somerset.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_campaigns/content_16.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_sarah/content_4.html": "Sarah Dyke MP\nThe local champion for Glastonbury and Somerton\n- A strong voice for Somerset\n- Fixing our NHS and cutting the cost of living\n- A positive plan to get a fairer deal for our area\nPeople across Glastonbury & Somerton backed local resident Sarah Dyke to become their MP.\nSomerset is a special place, and Sarah as our MP is a strong voice for our towns and villages. An MP who will always campaign to protect our rural way of life.\nSarah lives in the heart of Somerset and her farming family can trace their local roots back over more than 250 years.\nSarah loves our area and wants to get things done as our local MP.\nSarah said: “This is my home. I grew up locally, my family live here. We’re all so lucky to live in such a special part of the country. But I also know first-hand the issues facing local residents.\n“A lot of people round here put their faith in the Conservatives but have been let down.\n“The NHS is in crisis, the cost of living is rocketing, local farmers have been sold out. The Conservatives have been more interested in scandal or fighting each other rather than fighting for us.\"\n“We can tell the Government that they need to do more to cut the cost of living. We need urgent action to ensure people can get the treatment they need on the NHS. And we need to do much more to back our local farming industry.\n“Enough is enough. It’s time that Somerset got a fairer deal. That's what I’m fighting for as our MP.\n“My priority will always be to do what is best for the people of Glastonbury & Somerton.\n“I’ve always fought for what I believe in. As our MP I will work every day to get real action on the issues that matter most for people in our community: standing up for farmers, cutting the cost of living and fixing our NHS.\n“I understand why people are worried about the future for their children and grandchildren. But we can change the direction of the country and get a better future for everyone in Somerset.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news/content_19.html": "Liberal Democrat Success in Somerton\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nLiberal Democrat MP Sarah Dyke has announced she will stand for the new Glastonbury & Somerton constituency at the next election, promising to make fixing local health services her main focus if re-elected.\nThe Leader of Somerset Council has written to Michael Gove, Secretary of State for the Department of Levelling Up, Housing and Communities (DLUHC), calling for urgent action to fix the social care funding crisis.\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral.\nThe Somerset Liberal Democrats are delighted to have gained a seat on Somerset Council in Castle Cary after the by-election on Thursday 10th August. This increases their total councillors on Somerset Council to 62 and a majority of 14.\nNewly elected Liberal Democrat MP for Somerton and Frome Sarah Dyke has written to the Chancellor calling on him to scrap the ‘punitive’ cider tax set to come into force next week.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_gp/content_2.html": "Local GP Crisis\nPatients in Somerset are having to wait weeks to see a GP, as the Conservative NHS crisis deepens.\nNew figures show there are now more than 2,100 patients for every GP in our part of Somerset.\nSarah Dyke and the Liberal Democrats are calling for urgent action to fix the problem.\nThe Lib Dem GP plan would guarantee people can see a doctor quickly. And we’d introduce a new 24/7 hotline so people could book an appointment anytime, rather than have to wait in a long queue every morning hoping to get through.\nBack Sarah's campaign for more GPs\nHealth campaigner Sarah said: “Local doctors are working as hard as they can but they’ve been let down by this Conservative Government. Back my campaign for more GPs to make sure people can see their GP within a week, or within 24 hours if in urgent need.\"",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_contact/content_5.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_page-2/content_15.html": "Sarah Dyke calls for two-month cancer treatment guarantee\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral.\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral.\nThe Somerset Liberal Democrats are delighted to have gained a seat on Somerset Council in Castle Cary after the by-election on Thursday 10th August. This increases their total councillors on Somerset Council to 62 and a majority of 14.\nNewly elected Liberal Democrat MP for Somerton and Frome Sarah Dyke has written to the Chancellor calling on him to scrap the ‘punitive’ cider tax set to come into force next week.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_somerton-frome-mp-votes-to-cover-up-dangerous-school-buildings/content_20.html": "Somerton & Frome MP votes to cover up dangerous school buildings\nThe Liberal Democrats have criticised David Warburton after he voted with the Conservatives to hide detailed data of crumbling school buildings in Somerset.\nOn 23rd May, 296 Conservative MPs, including David Warburton voted against publishing detailed information regarding the condition of every school building in the country.\nThe Department for Education was given the data following the Condition Data Collection survey conducted between 2017 and 2019.\nAfter pressure from Liberal Democrat Education spokesperson Munira Wilson, the Government revealed parts of the survey data, including that:\n7,158 schools in England contain at least one building component, such as a roof, door or light fittings, deemed to be “life expired and/or at serious risk of imminent failure”; Almost nine in 10 schools have at least one building component that has a “major defect” or is “not operating as intended”.\nOverall, more than 240,000 fixtures and fittings were found to be defective. However, the Government has still refused to confirm if schools in Somerset have these defects and today voted to keep the information concealed despite a previous pledge to publish the data in full Somerton & Frome Liberal Democrat Parliamentary Candidate Cllr Sarah Dyke (pictured) said: “It is an absolute disgrace that David Warburton would vote to cover up whether our school buildings are built with dangerous or ‘life-expiredmaterials.\n“Parents in Somerset deserve to know whether their child is being sent to a school that is safe and fit for purpose, or to a school liable to collapse at any moment.\n“Somerton & Frome Liberal Democrats believe that investing in education is investing in our future generation. Every crumbling school is a concrete sign of years of Conservative neglect of our public services. Parents, staff and pupils have all had enough of being taken for granted.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_childrens-operations-cancelled-in-somerset/content_32.html": "Children's Operations Cancelled in Somerset\nMore than 500 children’s operations have been cancelled at hospitals in Somerset Foundation Trust in the past five years, many due to a shortage of staff and beds, shocking figures uncovered by the Liberal Democrats have revealed.\nThe data, obtained by the Liberal Democrats through Freedom of Information requests, shows that 97 children’s operations have been cancelled due to a lack of beds and 56 due to staff shortages since 2018.\nAnother 37 were cancelled due to equipment problems, such as machines being faulty or not being available.\nSome children at the local NHS trust were left waiting up to 711 days for an operation, the data suggests.\nA total of 136 children’s operations were cancelled in 2022, an increase of 43.16% compared to the year before.\nThe Liberal Democrats are urging the Government to come up with a rescue plan to bring health services back from the brink.\nThis would include bringing in a proper plan to tackle workforce shortages in the NHS, investing in newer equipment and increasing bed capacity at local hospitals.\nSarah Dyke, Liberal Democrat Parliamentary Candidate for Somerton & Frome, said: “These new figures are shocking and reveal that there are hundreds of children and parents in our community having to wait in pain and distress.\n\"Years of neglect of the NHS by this Government have led to chronic staff shortages and a lack of hospital beds, and now local families are paying the price.\n“The Liberal Democrats are calling for a rescue plan now to bring local health services back from the brink. That must include increasing bed capacity and tackling staff shortages, so people aren’t left waiting so long for the care they deserve.\"",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_page-1/content_27.html": "Liberal Democrat Success in Somerton\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nLiberal Democrat MP Sarah Dyke has announced she will stand for the new Glastonbury & Somerton constituency at the next election, promising to make fixing local health services her main focus if re-elected.\nThe Leader of Somerset Council has written to Michael Gove, Secretary of State for the Department of Levelling Up, Housing and Communities (DLUHC), calling for urgent action to fix the social care funding crisis.\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral.\nThe Somerset Liberal Democrats are delighted to have gained a seat on Somerset Council in Castle Cary after the by-election on Thursday 10th August. This increases their total councillors on Somerset Council to 62 and a majority of 14.\nNewly elected Liberal Democrat MP for Somerton and Frome Sarah Dyke has written to the Chancellor calling on him to scrap the ‘punitive’ cider tax set to come into force next week.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_who-will-fight-for-somerset/content_13.html": "Who will fight for Somerset?\nMore and more local people are backing local champion Sarah Dyke to fight for Somerset.\nAcross the large rural Somerton & Frome constituency, Lib Dem Sarah Dyke is the only person who can beat the Conservatives. No one else can win. Labour and the Greens are out of the race. This election is your chance to send the Government a message - but only by voting for Sarah\nSarah says…\nI’m fighting to get a better deal for people across our part of Somerset.\nWe’ve been let down by the Conservatives for too long. This election is our chance to send them a message they can’t ignore - we won’t be taken for granted any more.\nI will never stop working for our area - to fix our NHS, protect our rural way of life and cut the cost of living.\nAs our next MP, I’ll always put local people first and make sure your voice is heard.\nI’m proud to live in the heart of our area, proud to be from a farming family who can trace their local heritage back 250 years. I want the best for our community. With your support on 20th July, I’ll be a local MP you can be proud of.\nSarah’s plan for Somerset:\n- Fix our NHS: cut waiting times and make sure you can get a local GP or dentist appointment when you need one.\n- Action on the cost of living: more support for energy bills. Bring down food and fuel costs. Help households hit by skyrocketing mortgages.\n- Protect our rural way of life: champion local farmers, end sewage dumping, safeguard our environment and protect rural services.\nSarah vs the Conservatives\nAcross the Somerton & Frome constituency, local Lib Dem champion Sarah Dyke is the only person who can beat the Conservatives.\nNo one else can win. Labour and the Greens are out of the race. This election is your chance to send the Government a message - but only by voting for Sarah.\nI'll vote for Lib Dem Sarah\nBack Liberal Democrat Sarah Dyke in the Somerton & Frome by-election to send the Government a message they can’t ignore.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_donate/content_17.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowThe Conservatives have let us down locally and nationally. It's time for a change in Glastonbury and Somerton - to give our communities the strong voice in parliament that we need. Help us win by sending a donation right now.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_page-1/content_22.html": "Liberal Democrat Success in Somerton\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nThe Leader of Somerset Council has written to Michael Gove, Secretary of State for the Department of Levelling Up, Housing and Communities (DLUHC), calling for urgent action to fix the social care funding crisis.\nLiberal Democrat MP Sarah Dyke has announced she will stand for the new Glastonbury & Somerton constituency at the next election, promising to make fixing local health services her main focus if re-elected.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_lib-dem-sarah-leads-the-way/content_12.html": "Lib Dem Sarah leads the way\nMore and more people are backing the Lib Dems to send a message\n-\nOnly local champion Sarah Dyke can beat the Conservatives here\n-\nLocal residents are backing Sarah to get a local MP who will put our area first\nResidents from across our community are switching to back Liberal Democrat Sarah Dyke to be our new local MP.\nThere is no doubt the Lib Dems are the only party who can beat the Conservatives here.\nThe Lib Dems finished second in our area at the last General Election. We had a Lib Dem MP between 1997 and 2015.\nAnd in last year’s local elections, the Lib Dems took control of Somerset Council.\nNo wonder the bookies make the Lib Dems odds-on favourites to beat the Conservatives here.\nBy-election Betting Special\nThe latest odds on the parties racing to beat the Conservatives in the Somerton & Frome election.\nLib Dems: 1/14\nOdds-on favourites to beat the Conservatives here.\nLabour: 25/1\nOut of the race here already. Support is switching to Lib Dems.\nGreen Party: 150/1\nRank outsiders. No chance of winning across our area.\nOdds correct 20th June 2023\nThis by-election is a unique opportunity to send this failing Government a strong message.\nThat’s why supporters of all parties are backing Lib Dem Sarah.\nA win for Sarah would send the Government a message they can’t ignore: that Somerset has had enough of being overlooked and taken for granted.\nI'll vote for Lib Dem Sarah\nBack Liberal Democrat Sarah Dyke in the Somerton & Frome by-election to send the Government a message they can’t ignore.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_somerton-and-frome-lib-dems-slam-wessex-waters-apology/content_25.html": "Somerton and Frome Lib Dems slam Wessex Water’s apology as far too late after years of sewage scandal\nIn a statement issued through Water UK today, water and sewage companies admitted to dragging their heels on taking action to stop sewage discharges into our coastlines, rivers and lakes.\nIn the wake of this announcement, local Liberal Democrat parliamentary candidate Sarah Dyke says the apology is far too late, and that it is meaningless unless the firm is completely reformed.\nThe Liberal Democrats are calling for water firms to become “public benefit companies,” making environmental goals more important than profits, and making it compulsory for environmental experts to sit on their company boards.\nThis would put an end to billions of pounds being wasted in dividends whilst sewage destroys waterways.\nSomerton & Frome Liberal Democrats are also demanding an apology from the Government for voting down tougher action on water firms.\nLiberal Democrat parliamentary candidate for Somerton & Frome, Sarah Dyke said:\n“This announcement is too little too late after years of putting public health at risk and large-scale environmental damage, which has previously been arrogantly dismissed by the water industry.\n“This apology means nothing unless the firm is completely reformed from top to bottom. Protecting the environment should be more important than making overseas investors rich. Sadly, Wessex Water still has their priorities all wrong.\n“To add insult to injury, this Conservative Government have spent recent years voting down tougher action on polluting water firms. They too owe people an apology.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_page-2/content_30.html": "Who will fight for Somerset?\nMore and more people are backing local champion Sarah Dyke to fight for Somerset.\nMore and more people are backing local champion Sarah Dyke to fight for Somerset.\nOnly local champion Sarah Dyke can beat the Conservatives here.\nThe Liberal Democrats have criticised David Warburton after he voted with the Conservatives to hide detailed data of crumbling school buildings in Somerset.\nMore than 500 children’s operations have been cancelled at hospitals in Somerset Foundation Trust in the past five years, many due to a shortage of staff and beds, shocking figures uncovered by the Liberal Democrats have revealed.\nSomerset County Council has today approved the budget for the first year of the new Somerset Council.\nWessex Water’s apology is far too late after years of sewage scandal Somerton & Frome Liberal Democrats have called for Wessex Water to be overhauled following an overdue apology for sewage dumping.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_a-budget-that-delivers-for-somerset/content_31.html": "A Budget that Delivers for Somerset\nSomerset County Council has today approved the budget for the first year of the new Somerset Council.\nThe balanced budget was tabled by the Liberal Democrat administration and was supported by members of the Labour and Green groups. The Conservative group chose to play political games by failing to support the proposals.\nIn a context of inflation and increasing costs to services the budget ensures key services are protected and the needs of the most vulnerable are met. From Library Services to Household Waste and Recycling to supporting the voluntary sector, the budget prioritises the health and wellbeing of Somerset’s residents.\nThe budget includes an increase in Council Tax for Somerset’s residents, however this is at half the rate of current inflation and is not a unique decision with nearly all similar sized councils having already passed or proposing an increase1.\nCommenting on the proposed budget, Cllr Bill Revans, Leader of Somerset County Council said:\n\"It is disappointing that the Conservatives chose to play political games today rather than standing up for Somerset’s residents. Despite not supporting the budget, they failed to provide any alternative plans. After all, it is the actions of their government that mean we are continuing to reap the legacy cuts to preventative services leading to a surge in demand for key services.\nThe failure of the Tories in Westminster to provide sufficient funding and resources for local councils has left us short-changed in Somerset and their legacy is a difficult financial situation.\nWhilst this budget does include an increase in Council Tax, the level proposed is half that of inflation and we have put in place a robust council tax reduction scheme and an exceptional hardship fund for those residents who are continuing to struggle through the cost of living crisis.\nWhen the Liberal Democrats were given the responsibility of delivering the new council by Somerset’s residents, we committed to putting the heart back into Somerset and to be a council that listens. Since becoming the administration that’s what we’ve done.\nDespite the difficult economic circumstances, we have been able to commit ourselves to maintaining vital services and delivering important capital projects across the County. From the Octagon in Yeovil to Firepool in Taunton to supporting the Town Deals for Glastonbury and Bridgwater, we are an administration for the whole of Somerset.\nThe next few years will continue to be challenging but I am confident that we are building a Council that is fit for purpose. A council that doesn’t rely on grand statements and rhetoric but instead on hard work, careful consideration, and responding to the needs of the people we are here to serve.”",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk/content_1.html": "Liberal Democrat Success in Somerton\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nThe Leader of Somerset Council has written to Michael Gove, Secretary of State for the Department of Levelling Up, Housing and Communities (DLUHC), calling for urgent action to fix the social care funding crisis.\nLiberal Democrat MP Sarah Dyke has announced she will stand for the new Glastonbury & Somerton constituency at the next election, promising to make fixing local health services her main focus if re-elected.",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_council-leader-calls-for-government-to-fix-social-care-funding-crisis-1/content_10.html": "Council Leader calls for Government to fix social care funding crisis\nThe Leader of Somerset Council has written to Michael Gove, Secretary of State for the Department of Levelling Up, Housing and Communities (DLUHC), calling for urgent action to fix the social care funding crisis.\nIn his letter, Cllr Bill Revans says the current funding formula for local government does not reflect the actual needs and costs of providing essential public services.\nLast week Somerset Council’s Executive declared a financial emergency with budget papers showing a funding gap of £100m for 2024/25 – due mainly to an expected increase of £70m in the cost of adult social care.\nWithout immediate action this could lead to Somerset being forced to follow the likes of Birmingham and Woking councils by issuing a S114 notice – effectively declaring the council bankrupt.\nCllr Revans wrote: “Our overspend position is not because of poor control or oversight, nor policy decisions or legal action – rather it is simply an exceptionally large increase in our costs for demand-led services, set against our constrained ability to raise additional income. The model for funding social care is broken and we urgently need your support to ensure we can continue to care for those most in need.”\nCllr Revans explained how Somerset Council is managing its finances prudently and responsibly – delivering a unitary council to streamline public services, working in partnership with the NHS, voluntary sector and city, town and parish councils, selling assets and reviewing all areas of spending. However, he warned it will not be enough to close the gap between income and spending on demand-led services.\nHe ended by asking Mr Gove to take action to ensure adult social care funding is addressed as part of the forthcoming Autumn Statement and Local Government Finance Settlement.\nCllr Revans has also written to all Somerset’s MPs to highlight the emergency and ask for their support by lobbying government on behalf of all residents in their constituencies.\nMeanwhile Cllr Dean Ruddle, Somerset Council’s Lead Member for Adult Social Care, recently wrote to Helen Whately, the Minister of State for the Department of Health and Social Care to explain how numerous external factors have contributed to the soaring costs of adult social care.\nYou can read both letters at",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_search/content_8.html": "Help Sarah Dyke and the Liberal Democrats win in Glastonbury and Somerton by becoming a volunteer today.\nBack Sarah Dyke's Campaign to Protect our Community Pharmacies Health campaigner Sarah Dyke is fighting to protect community pharmacies after Glastonbury was left with no high street pharmacy,…\nA new train station for the Somerton and Langport area Langport Transport Group and Somerset Council have been waiting since July 2022 for a Government response to plans submitted for a…\nSomerset Liberal Democrats are delighted to have won the Somerton division by-election, decisively beating the Conservatives.\nBack Sarah Dyke's Campaign to Protect our Rivers and Streams In 2021, water companies nationwide pumped sewage into our waterways nearly 400,000 times and it has not improved since. Local…\nThe Leader of Somerset Council has written to Michael Gove, Secretary of State for the Department of Levelling Up, Housing and Communities (DLUHC), calling for urgent action to fix the social care…",
  "https_www_sarahdyke_uk_/https_www_sarahdyke_uk_news_article_sarah-dyke-calls-for-two-month-cancer-treatment-guarantee/content_28.html": "Sarah Dyke calls for two-month cancer treatment guarantee\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral.\nThis is part of a plan to boost survival rates and improve treatment for those affected by the disease.\nThe latest NHS figures show that, in the last year, 588 cancer patients in Somerset NHS Foundation Trust waited more than 62 days to start treatment after being referred.\nThis means only 58.85 per cent of patients in the area were treated within two months, below the government target of 85 per cent.\nLiberal Democrat Leader Ed Davey used his Autumn Conference speech to set out proposals to invest an extra £4 billion in NHS cancer treatment over the next five years, The Liberal Democrat plan includes new radiotherapy machines, cutting the time for new medicines to reach patients, a new cancer research law, and better support for cancer patients and their families.\nThe new policy builds on existing proposals from the party on health such as introducing a right to see a GP within a week and expanding NHS dentistry so people aren’t forced to pay for private dental treatment.\nLiberal Democrat MP for Somerton & Frome, Sarah Dyke MP said: “Everyone knows someone whose life has been turned upside down by cancer.\n“Far too many people are still waiting far too long for a diagnosis, or to start treatment after being diagnosed. We must do right by them and get them the care they need when they need it.\n“The Liberal Democrats would give cancer patients a new legal right to treatment within two months of an urgent referral, to make sure they get the care they deserve.\n“This forms part of our ambitious plan to end unacceptable cancer delays and boost survival rates.”"
}