{
  "https_peaceparty_org_uk/https_peaceparty_org_uk_cookie-policy/content_2.html": "Volunteers\nIf you would like to help us but are not sure you want to commit to becoming a supporter why not volunteer? We can put you in touch with your local Peace Party organisation, who would really appreciate your help and input. Make sure we have your details by completing the form on this page, and we will send you our newsletters and keep you in touch with our activities.\nSupporters\nMost of us have very busy lives these days and we quite understand if you don’t feel you have enough time to be a volunteer. But perhaps you could help us with a financial contribution. If so, use the form on this page to give us your details and we’ll email you information on how to become a financial supporter.\nMembers\nIf you agree with our policies and would like to help us promote them, please consider joining us as a member. We need people who want to ‘give peace a chance’ and are prepared to give up some time to help change the political climate for the better. Get in touch using the form on this page and we’ll get back to you. Leave a phone number if you’d like us to call you!\nMake A Donation\nThe Peace Party’s work is made possible only with the support of people like you, our members and supporters. Your donation will help us to promote peace. Donations are processed via PayPal. Alternatively, you can donate by cheque payable to ‘The Peace Party’ sent to The Treasurer of the Peace Party, 5 Rosehill Cottages, Alexandra Road, MAYFIELD TN20 6UE.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_page_4/content_26.html": "Candidate writes of the Futility of War\nThe inability of world leaders to see the futility of war. Peace starts by being kind to one’s inner anger.\nVoting for The Peace party means...\nThe inability of world leaders to see the futility of war. Peace starts by being kind to one’s inner anger.\nBecoming a conscientious objector to military service in the Second World War – CO describes his experience, averring that ‘War begets war – Violence always begets violence.\nIn the face of the failure of war, The Peace Party points to three alternatives to it, describing them as practical and realistic.\nPeace starts with you and me – When you and I share wellbeing and happiness, We are at Peace. This time, vote for John Morris,\nDeterring people coming to the UK is not going to stop people coming here for sanctuary. Long term, the solution lies in eradicating war, ending poverty, tackling global warming, being at ease with those who are different.\nThe Peace Party intends to contest seats in the forthcoming General Election. Watch this space for further information.\nVolunteers\nIf you would like to help us but are not sure you want to commit to becoming a supporter why not volunteer? We can put you in touch with your local Peace Party organisation, who would really appreciate your help and input. Make sure we have your details by completing the form on this page, and we will send you our newsletters and keep you in touch with our activities.\nSupporters\nMost of us have very busy lives these days and we quite understand if you don’t feel you have enough time to be a volunteer. But perhaps you could help us with a financial contribution. If so, use the form on this page to give us your details and we’ll email you information on how to become a financial supporter.\nMembers\nIf you agree with our policies and would like to help us promote them, please consider joining us as a member. We need people who want to ‘give peace a chance’ and are prepared to give up some time to help change the political climate for the better. Get in touch using the form on this page and we’ll get back to you. Leave a phone number if you’d like us to call you!\nMake A Donation\nThe Peace Party’s work is made possible only with the support of people like you, our members and supporters. Your donation will help us to promote peace. Donations are processed via PayPal. Alternatively, you can donate by cheque payable to ‘The Peace Party’ sent to The Treasurer of the Peace Party, 5 Rosehill Cottages, Alexandra Road, MAYFIELD TN20 6UE.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_the-pursuit-of-peace-is-the-most-essential-of-all-human-endeavours/content_7.html": "The Peace Party National Organiser noted with interest that the Secretary General of the United Nations, Antonio Guterres, posted on social media on 12th February 2024:\n“There is so much anger and hate and noise in our world today.\nEvery day and at every turn, it seems – it’s war.\nAround the globe and across the range of issues, peace is the missing piece.\nYet, people want peace and security.\nThey want peace and dignity.\nFrankly, they want peace and quiet.\nThe pursuit of peace is the most essential of all human endeavours.\nPeace is more than a noble vision.\nPeace is a rallying cry. It is a call to action.”\nThe Peace Party follows that call when its candidates stand for Parliament and Councils on a radical but realistic programme.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_vision/content_22.html": "Vision\nIntroduction\nThe Peace Party gives people the opportunity to express their support for a radically new world based on the principle of compassion, where others are treated as we would wish to be treated ourselves. Compassion requires each one of us, to work tirelessly to alleviate the suffering of others and to treat everybody with love, justice, equity and respect.\nThe Peace Party envisages a society where peaceful conflict resolution, social and economic justice, and environmental issues are paramount. The concept of true peace is life-enhancing and rests with everyone cultivating peace and harmony among themselves and with people and their environment.\nPeace has the qualities of vitality and power, heroism and fearlessness; peace is protective, nourishing and irresistible. Peace begins with each one of us. Peace enables the full development of humanity guided by the “Universal Declaration of Human Rights”.\nThe Peace Party:\n- Promotes the resolving of disputes by means of dialogue and other well-tried techniques of conflict resolution\n- Is open to ideas of all kinds in the expectation that peace and peaceful people will enhance the quality of human existence, experience and understanding\n- Values & Promotes respect and friendship between all peoples\n- Works for the collective interest of humankind, recognising that we are all affected by each other, that everything is interconnected\n- Works for world citizenship; there can be no borders in a truly peaceful, democratic global society\n- Is radical, if not revolutionary, in its views and outlook, acknowledging the true worth of everyone and celebrating diversity\n- Believes in truth and transparency when developing and supporting those policies that are most thoroughly conducive to lasting worldwide and peaceful co-existence\n- Works with individuals or groups that are like-minded in seeking to bring about a global peaceful society\n- Considers the needs of all living things in relation to the needs of each one and the environment\nThe Peace Party is an independent, secular political party. It welcomes people of all religions – and of none.\nVALUES AND THE PEACE PARTY\nFor the Peace Party, the development of a peaceful way of life by an individual or community depends on their cultivation of a whole range of values, or principles. These come from the heart & from the feelings people have about themselves and the world and the standards by which they live.\nThe basic value behind our programme is unconditional reverence for all life. The Peace Party embraces its unity and its integrity so that we can support, nourish and protect the richness of life on Earth and uphold the supreme worth of every being.\nLife is sacred. We honour and respect it in different ways, one of which is our support for wildlife conservation programmes.\nWe seek to promote a compassionate world where people are patient and considerate with one another.\nWe believe we should care not only for each other but for our children and grand-children and future generations.\nEmpathy, caring about and for others, is the basis of humanity and the way in which we can identify with one another’s thoughts, hopes and fears.\nIn addition to empathy we value self-awareness, in addition to awareness of the needs of others and of concern about problems at a world level.\nHumility, seeing others as equal to ourselves, means treating each other fairly, without discrimination or prejudice.\nWe value co-operation, where people cooperate generously and unselfishly, contributing towards the common good.\nKindness is one of the keys to humanity, friendship and contentment.\nBelonging is the sense of being part of a family and of a whole variety of communities, from local to the global.\nThe foundations of truth and of honesty in our lives make for clean, open and humble government as well as the peaceful resolution of conflict.\nWe value tolerance, which involves accepting differences with good grace – in the way others may think, look, speak or act. Being tolerant is being free of prejudice while knowing that all people have feelings, needs, hopes and dreams. Tolerance is accepting things you may wish were different with patience and flexibility.\nA VISION FOR A BETTER WORLD\nA world at peace is one where everyone feels fully in control of their lives and can thus feel that they can play a full part in the life of the community. In that world power would be equally distributed making real democracy possible. All human life would be acknowledged to be of equal worth.\nProgress would be measured in terms of well-being and happiness rather than by gross domestic product.\nThe cost of caring is great but the cost of not caring is even greater. The world we envisage would be one that is strongly caring for people and for the natural world.\nWe would have come to understand that non-violence is the best way of dealing with conflict. Non-violence aims to resolve conflicts through reconciliation rather than achieving victory or obtaining the spoils of triumph.\nBorders would cease to be barriers in a world at peace and nations would have truly democratic institutions.\nIn the world envisaged no-one would be in poverty any more; systems would be in place to ensure that wealth is distributed fairly as the world contains enough for everyone’s needs.\nThere would be a full range of public services including social security: these would be better than anything that can be provided by private, profit-making organisations.\nPeople would fulfil their responsibilities to help in maintaining stable and peaceful global communities and would respect and guarantee human and civil rights.\nPeople would have learned to live in harmony with the environment; using only enough of the earth’s resources as they need.\nWe would have adopted all human rights, as set out in the Universal Declaration of Human Rights and the European Convention on Human Rights.\nSociety would be free from oppression, discrimination and violence and would be based on the compassionate application of justice and law.\nThe society that has been built would have brought capital under the control of all the people. Profits would be for the benefit of all and not for private gain. In that way, there would be abundance for all.\nSociety is built on the principle of co-operation.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_page_3/content_13.html": "Ignoring growing Global Heating threatens Humanity\nKey findings from the latest State of the Climate report shows that we ignore them at Humanity’s peril.\nVoting for The Peace party means...\nKey findings from the latest State of the Climate report shows that we ignore them at Humanity’s peril.\nEvery year, the two-child benefit cap plunges hundreds of thousands more families into poverty. It’s now time for the new Government to remove the cap.\nIt is high time for the parties involved in Israel/Palestine to show the political courage and political will to finally reach a deal.\nA government influenced by The Peace Party might have made real changes to the way UK citizens would be kept safe and secure. These changes would be based on accepted and common Human Values such as Compassion and Kindness.\nHow the Peace Party candidates fared in the 4th July 2024 UK General Election.\nNATO is an anachronism in today’s multipolar world: an aggressive, expansionist military alliance whose inherent institutional myopia and blinkered, self-serving threat assessments condemn us all to endless war and potential nuclear annihilation.\nVolunteers\nIf you would like to help us but are not sure you want to commit to becoming a supporter why not volunteer? We can put you in touch with your local Peace Party organisation, who would really appreciate your help and input. Make sure we have your details by completing the form on this page, and we will send you our newsletters and keep you in touch with our activities.\nSupporters\nMost of us have very busy lives these days and we quite understand if you don’t feel you have enough time to be a volunteer. But perhaps you could help us with a financial contribution. If so, use the form on this page to give us your details and we’ll email you information on how to become a financial supporter.\nMembers\nIf you agree with our policies and would like to help us promote them, please consider joining us as a member. We need people who want to ‘give peace a chance’ and are prepared to give up some time to help change the political climate for the better. Get in touch using the form on this page and we’ll get back to you. Leave a phone number if you’d like us to call you!\nMake A Donation\nThe Peace Party’s work is made possible only with the support of people like you, our members and supporters. Your donation will help us to promote peace. Donations are processed via PayPal. Alternatively, you can donate by cheque payable to ‘The Peace Party’ sent to The Treasurer of the Peace Party, 5 Rosehill Cottages, Alexandra Road, MAYFIELD TN20 6UE.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_peace-means-clean-energy-says-u-n/content_6.html": "The UN Secretary General, Antonio Guterres has just posted this important message for every government and peoples:\n“This year, renewables are projected to become the world’s largest source of electricity generation for the first time.\nMeanwhile, their prices keep plummeting.\nThe end of the fossil fuel age is certain. But governments must ensure that it comes swiftly and fairly.\nThis is crucial to save us from the worst of the climate crisis, and to connect every person to clean energy – lifting millions out of poverty.\nOn the International Day of Clean Energy, let’s commit to an international era of clean energy with speed, justice, and collaboration at its core.”\nAs he says, “Break up with fossil fuels”!",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_peace-candidate-for-horsham-jim-duggan-looks-at-three-alternatives-to-war/content_30.html": "Three alternatives to war\nIn the face of the failure of war, The Peace Party points to three alternatives. The first is the global turn toward nonviolent resistance movements. They have helped to defeat the various forms of totalitarianism and become an effective way to counter the armed aggressor. Nonviolence is more powerful than violence.\nThe second is preventing war in the first place by strengthening international institutions, laws, and norms that promote mutual aid and delegitimize war in favour of diplomacy and mediation. There are now an ever-extending network of societies and organizations which set their sights beyond the aims and interests of individual countries to promote collaboration for the global common good.\nThe Peace Party advocates greater political authority exercised at the level of the international community to facilitate collective security. Peace and international law are closely linked: the Party would work to urge countries to embrace reliable procedures for the resolution of conflicts with tireless recourse to negotiation, mediation, and arbitration.\nThe third alternative is targeting the underlying causes of war by alleviating the economic and political injustices that drive it: to achieve Peace, work for Justice. This means state and nonstate actors working around the globe to reduce poverty, exploitation, and political oppression, since these are at the root of war.\nThere can be no true peace unless the Government shows itself capable of developing a more just economic system, which involves sacrificing the positions of income and of power enjoyed by the more developed economies. The Peace Party advocates full-blown democracy (including voting by PR), the rule of law, effective governance ensuring freedom and peace, and respect for human rights.\nThe Peace Party’s three alternatives to war. Are they realistic?\nAre they practical? Are they realistic? The Peace Party says they are! It notes that its policies are backed up by what research has discovered about the nature of armed conflict.\nA few examples:\n- Military action has a dreadful record of achieving its objectives. Warfare is much more likely to lead to mass atrocities against civilians than prevent them.\n- Military action is especially unsuccessful in preventing terrorism.\n- Nonviolent civil resistance methods are two-to-three times more effective in defeating domestic dictators or foreign occupiers compared to armed force, and when successful, they are much more likely to produce democracy, human rights, and lasting peace.\n- Most wars today are civil wars, which are usually relapses of previous conflicts that experience chronic cycles of stop-and-start fighting, and there are effective ways the international community can help break these cycles of violence.\n- International agreements can create norms and institutions that really do shape the behaviour of state and nonstate actors without resorting to military force.\n- Widely shared prosperity, inclusive democratic institutions, the rule of law, effective governance and human rights protections are all associated with reductions in the likelihood of war.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_non-violence-is-life-affirming/content_8.html": "Al Charlton (in the Metro, March 8 2024) complains that the Chancellor in Wednesday’s Budget is allocating very little extra money to spend on “defence”.\nNo one would disagree that protecting its population from harm is a major duty of a government. But I have always thought that preparation to kill and destroy fellow beings in some future war is definitely not the way for a civilised nation to behave.\nWe have only to watch the actions of Russians, Ukrainians, Israelis, Palestinians, Sudanese, Yemenis and others on our screens day by day to realise that war and violence solve nothing.\nA future government could resolve to set its face against militarism, the bomb and the bullet, against death and destruction, by building on the wide range of alternatives. These would ensure the UK population is far safer and more secure than it can ever be threatening others with terrible weapons and women and men trained to kill.\nOn the international stage, largely through a reformed United Nations, the government could be continually working with others to recognise and de-fuse potential conflicts, as well as developing all techniques of non-violent conflict resolution. That would be far more life-affirming – and a good deal cheaper – than the prospect of violence.\nAs someone much wiser than myself once said, “If war is the answer, it must have been a very stupid question.”",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_white-poppy-to-remember-all-who-have-died-as-the-result-of-war/content_21.html": "John addressed this letter to The Editor of The Surrey Advertiser explaining why he wears a white poppy at Remembrance time:\n“The news bulletins remind us, every day, and even every hour, that we are witnessing the greatest intensity of war and violence so far this century.\n“The destruction of Gaza and the attacks on Lebanon continue unabated, the war in Ukraine grinds on with no end in sight, devastating civilian life. In Sudan, the civil war has led to a humanitarian catastrophe, with tens of thousands dead and millions displaced and facing starvation.\n“I feel that it is vitally important that, with many others, I continue standing up for peace.\n“I will be remembering not just the those in the military and civilians who have been killed as the result of war, but also those who have faced – and still face – persecution, social isolation, violence and imprisonment for refusing to take part in it.\n“By wearing a white poppy, I bear witness to the full human cost of war both in the past and today. This act of remembrance only sharpens my resolve to oppose war and to work for a culture of peace.\n“White poppies may be obtained in Guildford from the Quaker Meeting House, from Zero Carbon Guildford or direct from the original suppliers, the Peace Pledge Union. I pass any donation I receive to the United Nations High Commission for Refugees.”\n(John Morris was the candidate in the 2024 General Election for Guildford for The Peace Party – Non-violence, Justice, Environment)",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_peace-is-much-more-than-just-the-absence-of-violence-and-war/content_20.html": "David Lorimer, Programme Director of the Scientific and Medical Network, has written and had published a poem so relevant to the mission of the Peace Party. We reproduce here two stanzas.\nWe are here to love and not to hate,\nTo seek the paths of peace, not war,\nTo forgive and not to avenge,\nTo learn deep life lessons\nFrom each other.\nWe are here to learn the practice of kindness,\nThe practice of compassion,\nThe practice of empathy,\nThe practice of trust,\nThe practice of reconciliation.\nOver the coming months, these will be developed into statements of Positive Peace and a Peace Party manifesto for the forthcoming election for the UK Parliament.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_peace-party-general-election-2024-the-results/content_19.html": "Jim Duggan contested the Horsham Constituency on behalf of The Peace Party in the 2024 General Election. He was supported by 276 members of the electorate (0.5% of the votes cast) – and came in sixth place out of the seven candidates standing.\nJohn Morris contested the Guildford seat and was supported by 255 voters (0.5%). Both Jim and John lost their deposits (they would have needed to have polled at least ten times the percentages obtained to receive their 500 Pounds back).\nThe Peace Party advocates a change in the country’s voting system to one using a system of “proportional voting” such as the single transferable vote. That could allow the Party some representation in Parliament.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_page_2/content_24.html": "White Poppy to remember All who have died as the Result of War\nPeace Party candidate will be remembering not just the those in the military and civilians who have been killed as the result of war, but also those who have faced – and still face – persecution, social isolation, violence and imprisonment for refusing to take part in it.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_privacy-policy/content_23.html": "Volunteers\nIf you would like to help us but are not sure you want to commit to becoming a supporter why not volunteer? We can put you in touch with your local Peace Party organisation, who would really appreciate your help and input. Make sure we have your details by completing the form on this page, and we will send you our newsletters and keep you in touch with our activities.\nSupporters\nMost of us have very busy lives these days and we quite understand if you don’t feel you have enough time to be a volunteer. But perhaps you could help us with a financial contribution. If so, use the form on this page to give us your details and we’ll email you information on how to become a financial supporter.\nMembers\nIf you agree with our policies and would like to help us promote them, please consider joining us as a member. We need people who want to ‘give peace a chance’ and are prepared to give up some time to help change the political climate for the better. Get in touch using the form on this page and we’ll get back to you. Leave a phone number if you’d like us to call you!\nMake A Donation\nThe Peace Party’s work is made possible only with the support of people like you, our members and supporters. Your donation will help us to promote peace. Donations are processed via PayPal. Alternatively, you can donate by cheque payable to ‘The Peace Party’ sent to The Treasurer of the Peace Party, 5 Rosehill Cottages, Alexandra Road, MAYFIELD TN20 6UE.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_peace-party-outlines-its-thinking-on-the-climate-emergency/content_12.html": "“The Climate Emergency”\nGuildford Quakers wrote recently to John Morris, explaing that their members were very concerned that 2023 was the warmest year on record and that “If your party were elected to government, what would you do about this?”\nThe Peace Party, in its reply, said that it too is concerned to learn that last year 2023 was the warmest one on record with a global average temperature of 14.98oC. Indeed, 2023 replaced 2016 as the warmest calendar year on record with a global average temperature of 14.81oC.\nThe Peace Party recognises that greenhouse gases including carbon dioxide and methane have been increasing in the atmosphere over many decades in step with increasing temperatures. Greenhouse gases have long been recognised as responsible for the atmospheric global heating, helping to trap solar energy like the glass in a greenhouse.\nA government in which Peace Party members of parliament might participate would urgently support all measures to reduce greenhouse gas emissions to levels close to pre-industrial revolution levels. The Party notes that, in order of descending order of importance, the emissions come from:\n- energy, including electricity generation and heat.\n- industry, including cement, chemicals, and metals.\n- agriculture, forestry, and other land uses.\n- transport (road, international shipping, and aviation)\n- residential and non-residential sources\nOutline of Peace Party Policy on the Climate Emergency:\n- Alternative ways of generating electricity, and producing heat and energy, will be supported wholly by government funding with the industry taken back into public ownership.\n- Alternative ways of manufacturing essential materials will also be supported by government funding which may well require industries being taken into public ownership.\n- The soil is recognised as an important store of G.H.G. and this will be nurtured and protected by government funding for farming and forestry. Non-meat sources of dietary protein would be promoted and subsidised by government: farmed animals are a major source of G.H.G.\n- Government must recognise the importance of road, rail, water, and air transport for the movement of goods and services and the functioning of the economy. That recognition requires a high level of state funding to assist in the replacement of the petrol, diesel oil and other fuels as the power sources for vehicles with electricity, for example. Again, public ownership may be required in this sector. Movement of people: ideally this should be through a big increase in the use of public (shared) transport (bus, rail, ship, and aircraft), funded very heavily by government. People have become used to having their privately-owned vehicles so, government funding must be used to replace these vehicles with those powered by electricity and, perhaps, other power sources.\n- The production of materials normally used for the building of houses and flats – as well as factories and other non-residential buildings – involve the emission of G.H.G. Alternative ways to producing those materials, again, should be funded by government. The use of timber and stone should be encouraged where appropriate, as replacements for brick and concrete.\nFootnote on funding:\nPeace Party policies rely on the principle that when something needs doing, the government can always afford to do it:\nEvery day,\nThe government creates money through its proxy, the Bank of England, and it can spend as much as it wishes.\nThe limits to government spending depend on availability of resources – people and materials (but not finances).\nTaxes levied by the government do not pay for anything.\nGovernment spending doesn’t necessarily cause inflation.\nA little inflation is normal and is not a problem.\nAmounts of government spending described as “Debt” are just a tally of money issued; it is never required to be “paid back”.\nFinancial affordability per se is never an issue.\nOnce this economic view has been established, social justice and thus community happiness and well-being will be achieved.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_israel-palestine-antonio-guterres-appeals-for-a-deal/content_17.html": "The Secretary General of the UN, Antonio Guterres, wrote on 16 July, 2024, “Just when we thought it couldn’t get any worse in Gaza – somehow, appallingly, civilians are being pushed into ever deeper circles of hell.”\n“Recent days have brought yet more evacuation orders by Israeli authorities, yet more civilian suffering, and yet more bloodshed.”\n“Palestinians in Gaza keep being forced to move like human pinballs across a landscape of destruction and death.”\n“The extreme level of fighting and devastation is incomprehensible and inexcusable.”\n“Nowhere is safe. Everywhere is a potential killing zone.”\n“It is high time for the parties to show the political courage and political will to finally reach a deal.”",
  "https_peaceparty_org_uk/https_peaceparty_org_uk/content_1.html": "War in Ukraine is Grave Threat to Europe’s Peace and Security\n“The war in Ukraine stands as a grave threat not only to the peace and security of Europe but also to the very foundations and core principles of the UN.”\nVoting for The Peace party means...\n“The war in Ukraine stands as a grave threat not only to the peace and security of Europe but also to the very foundations and core principles of the UN.”\nThe UN Secretary General, Antonio Guterres has just posted this important message for every government and peoples: “This year, renewables are projected to become the\nThe Earth has just endured the hottest decade on record – with 2024 topping the list, and likely to be the first calendar year with a global mean temperature of more than 1.5°C above pre-industrial levels. But is the UK doing its mightiest to reduce global heating?\nOn New Year’s Day 2025, voters and other supporters of the Peace Party believe it is possible to envisage a country and a world that will be free from violence and the threat of war.\nExpanding the Nation’s Budget does not automatically translate to a safer country and world. Rather, it diverts attention and resources from what really matters: the well-being of people and the protection of the planet.\nVolunteers\nIf you would like to help us but are not sure you want to commit to becoming a supporter why not volunteer? We can put you in touch with your local Peace Party organisation, who would really appreciate your help and input. Make sure we have your details by completing the form on this page, and we will send you our newsletters and keep you in touch with our activities.\nSupporters\nMost of us have very busy lives these days and we quite understand if you don’t feel you have enough time to be a volunteer. But perhaps you could help us with a financial contribution. If so, use the form on this page to give us your details and we’ll email you information on how to become a financial supporter.\nMembers\nIf you agree with our policies and would like to help us promote them, please consider joining us as a member. We need people who want to ‘give peace a chance’ and are prepared to give up some time to help change the political climate for the better. Get in touch using the form on this page and we’ll get back to you. Leave a phone number if you’d like us to call you!\nMake A Donation\nThe Peace Party’s work is made possible only with the support of people like you, our members and supporters. Your donation will help us to promote peace. Donations are processed via PayPal. Alternatively, you can donate by cheque payable to ‘The Peace Party’ sent to The Treasurer of the Peace Party, 5 Rosehill Cottages, Alexandra Road, MAYFIELD TN20 6UE.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_policies/content_11.html": "Peace Party Policies\nHere are our main policies. Simply click the plus signs below to read them in full.\nWe seek a radical reorientation of the underlying principles on which our relationships are founded, so that they are based on co-operation rather than competition.\n- Resolve conflict by non-violent means, finding common interest, and purpose by listening, talking, mediation, negotiation, arbitration, conciliation and reconciliation.\n- Establish systems of conflict resolution\n- Disband the armed forces, decommission all weapons, and withdraw from all current military commitments and military alliances. Peace has been shown to be extremely cost effective.\n- Close armaments factories and research facilities, and subsidise their conversion to peaceful purposes such as alternative energy equipment manufacture.\n- Ban the design, development, sale and distribution of weapons and military equipment.\n- Ban all trade in any type of weapon or military equipment.\n- Regulate the possession of guns\n- Establish a highly-trained ‘disasters emergency organisation’ to help deal with national and international emergencies.\n- Set up a Ministry for Peace to develop and promote a peace-oriented foreign policy agenda.\n- Respect absolutely the sovereignty of countries with borders ceasing to be barriers.\nPeace and the resolution of conflict\nThe Peace Party works for peaceful coexistence and does not support war which is a morally unacceptable way to resolve conflict. It must never be an instrument of government policy. Governments should always foster and promote peace, and work to remove of the causes of war.\nPeace is not only desirable in international relations. It also needs to be expressed nationally through a proper regard for the interests of those with little or no political power, and by preventing commercial exploitation and domestic violence.\nResponsibility\nWe are all responsible for our own actions – but we also share in the responsibility for the actions of government, since these are carried out in our name and with our collective consent. Just as we have a responsibility, as individuals, not to harm one another, so we have a responsibility as citizens and members of a community not to consent to harm being done, whether through military force, oppressive or discriminatory legislation, or other means. We share in a ‘duty of care’ to our fellow human beings.\nNon-violence\nIt is generally taken for granted that when, inevitably, conflicts arise the only way to deal with them is through force. But there is plenty of evidence to the contrary. The principles of non-violent conflict resolution have been the subject of academic study and research for several decades, but have not yet entered public discourse to any extent, nor formed a significant part of any UK political party’s programme until now.\nThe Peace Party will work for a better and wider understanding of the principles and practice of non-violence, and will explore ways of incorporating into government sound and accepted techniques for peaceful conflict resolution.\nMilitarism and the armed forces\nA society that is determined to resolve conflicts by peaceful means can have no use for armed forces or their weapons. This will also help to assuage some countries’ legitimate concerns about our intentions, and send a message of support to other peaceful countries.\nThe manpower thus released should be retrained to act on the country’s behalf, both at home and abroad and hardware redeployed. This would enable us to help in disaster relief on a massive scale, to support rebuilding programmes in countries that have been ravaged by war, and generally to foster peace rather than adding to international tension.\nWe should immediately withdraw from NATO, cancel plans to replace Trident, and dismantle nuclear and all other weapons. Arms manufacturing facilities must cease production immediately, as must the construction, sale, distribution or use of arms of whatever kind.\nGiving minorities a voice\nIt is a fundamental principle of natural justice that no one person or group has the right to impose its will on another person or group — and much of politics, whether national or local, is concerned with settling conflicts of interest between competing groups. Frequently the interests of the stronger group prevail, to the detriment of, for example, ‘travellers’, women, and the poor.\nThe balance must be redressed by taking seriously the concerns of the poor and the politically weak, providing platforms where their voices can be heard, and bringing competing groups together in a positive atmosphere in an attempt to increase the level of mutual understanding.\nDomestic issues\nOver recent years there has been a move away from adversarial models of conflict-resolution in domestic issues such as divorce and custody of children. The Peace Party supports this trend and will encourage it to be carried further.\nSecurity and human rights\nIt has been said that the first duties of a government are the safety, security and protection of the people, but it must be remembered that this duty is to all the people, and not just the majority or the mainstream. A legitimate concern for security must never be used to excuse the repression, harassment or persecution of groups within the larger community, or the attenuation of basic human rights.\nWe are particularly concerned about popular attitudes to immigrants and minority religious groups, and will seeks ways of enhancing their security, freedoms, opportunities for advancement, and status within our society.\nThe Peace Party supports human rights legislation as a way of setting limits on the power of the state over the individual and on the power of the majority over minorities.\nA government can properly claim to be democratic only insofar as its policies and actions have the informed and willing consent of the people.\n- Hold annual elections for all public decision-making bodies, electing one third or one quarter of them at a time. This will avoid sudden changes and allow those bodies to evolve.\n- Hold all elections using the system of proportional representation which most closely reflects all shades of opinion within the electorate\n- Set up and support local committees for small neighbourhoods\n- Ensure that there is full education and information on voting – where to vote, how to vote, and, most importantly, why to vote.\n- Expand the teaching and discussion of constitutional matters in schools.\n- Limit the term to be served by any one political official.\n- Devise a new Constitutional Settlement, incorporating a written Constitution that would enshrine the rights of individuals and the limits of State power.\nPrinciples\nA balance must be struck that promotes and encourages effective involvement in policy-making at all levels from the national to the local, while guarding against the manipulation of popular opinion to the detriment of minority interests. It is imperative that there should be proper channels for individuals and groups to express their views, and that no one should feel that their opinions have been ignored.\nThis can only be achieved through political and social structures that allow people to decide issues at the appropriate level, combined with legislation that protects human rights.\nThe right to vote\nThe right to play a formal part in the democratic process through voting should not be withdrawn from any individual, regardless of status or conduct. We believe, for example, that prisoners should have the right to vote.\nChanging the voting system\nThe Peace Party supports the move towards a proportional voting system for General Elections, in the belief that this will result in government that is more representative of the population.\nReferendums and other forms of consultation\nReferendums are not part of the “British Constitution”. Where a government believes there is a need to implement a policy that was not envisaged in its manifesto, and which may not be whole-heartedly supported by the people, a referendum may be a reasonable way to establish a mandate, provided it is honestly and fairly organised. But too heavy a reliance on such an ad hoc form of mandating would be at odds with the ideal of representative democracy, and must be avoided.\nIt must also be recognised that democracy is not just a matter of voting when there’s an election or a referendum. The role of the government must be to represent, and as far as is possible and proper, to implement, the will of the people. This can only be done if the will of the people is known, and it is therefore both the responsibility of the people to make their views known, and of the government to canvass the views of all sections of the community.\nThe importance of education\nA government can only be democratic to the extent that it has the informed consent of the people for its policies. For this to be real, it is essential that young people be properly educated about the role of politics in their lives, and their role, when they become adults, in influencing policies. They should be encouraged to consider the purpose of government, its social and economic functions, and how it affects their lives and those of other people.\nSpace should be made in the curriculum for the unbiased teaching of constitutional, social and economic issues, as well as an introduction to the ideas underpinning different political theories and philosophies.\nSovereignty of Parliament — and its limitations\nIt is generally supposed (in the UK) that the best guarantee of fair and just laws is the ‘sovereignty of Parliament’ as the institution that best reflects the will of the people.\nThis whole area has become confused and is probably not, as many have assumed, ‘the best of all possible worlds’. As we argue elsewhere, the fault lies partly in the assumption that the will of the people, as expressed through its representative institution, Parliament, and ratified by the Crown as Head of State, must always be paramount.\nThe problem with this assumption is that it is possible for the will of the people as a whole, particularly in times of stress or general hardship, to ride roughshod over the rights and proper interests of individuals and minority groups, in ways that could amount to democratic tyranny. A defence against such excesses would be a written Constitution.\n- Work for the provision of conditions to support and encourage a healthy life-style.\n- Provide full and independent information about health care — which must continue to be free at the point of delivery and promptly delivered.\n- Ensure that mental health services are properly supported.\n- Legalise the sale, distribution and use of psycho-active substances, while improving the quality of education so that people can make informed and sensible decisions.\n- Drastically improve the provision of advice, help and rehabilitation services under the National Health Service.\n- Promote healthy food and sustainable and efficient farming practices, shifting the emphasis away from resource-inefficient animal farming towards crop-based agriculture.\n- Eliminate all farming practices that involve cruelty to animals.\n- Ensure that any imported GM substances are properly labelled; we believe that genetically modified foods may be harmful to health.\nHealth\nThe Peace Party believes that physical and mental health are basic human rights, and that it is our collective responsibility to ensure that proper health care is available to all members of the community whenever needed.\nWe recognise that individuals have a responsibility not to place an unreasonable or unnecessary burden on a community’s resources, but failure to discharge this responsibility should not jeopardise an individual’s right to health care. Health care should be equally available to every individual according to his or her needs.\nWe are well aware that there is strong evidence that in many circumstances the human body is able to heal itself without the intervention of “traditional” medicine.\nControl of narcotics\nWhile it is proper for the state to ensure as far as possible that people are aware of the consequences of their actions — in particular those that may be detrimental to their physical or mental health, we do not believe it is the government’s job to tell people how to live their lives. Partly for this reason, and partly because criminalisation of the illegal drugs trade is counter-productive (it keeps prices high and helps the trade and related criminal activities to flourish), we believe that a strong case can be made for the legalisation of the sale and use of drugs.\nIn many ways government policies have tended to exacerbate the drugs problem. Too little attention has been paid to the need to raise the living standards and expectations of people in areas regarded as ‘deprived’, and the support that is provided for the victims of the drugs trade is woefully inadequate. Employment opportunities should be developed in these areas by encouraging and promoting suitable enterprises, and no one suffering from an addiction should be denied appropriate help, support and medical care.\nMedical research and testing\nIn no circumstances should testing of potentially or actually harmful substances be carried out on animals or people for cosmetic or other non-essential products. For medical purposes we must, as a matter of urgency, develop effective alternatives to the use of animals in research and testing, and such alternatives should always be used where available.\nFood\nAlthough there is generally plenty of food in the UK, not all of it is healthy. For reasons of culture and sometimes necessity many people are more concerned with cheapness and convenience than with quality. This attitude is encouraged by the major food concerns, which routinely resist attempts by government to introduce legislation, and treat conformance primarily as a ‘selling point’.\nThe implications for health are serious. The situation is not helped much by the media, which tends to present food issues as a series of scare stories, often contradicting one another, or in the form of rival, ineffective and probably unhealthy slimming regimes.\nTo help people to make intelligent and informed decisions about what to eat, we would collate the latest genuine, independent and reliable research findings of the effects of diet on health in publicly accessible reports. We would also look for ways to encourage small growers to distribute and sell their produce through ‘farmers’ markets’ and vegetable-box schemes.\nGenetically-modified foods\nThere can be no doubt that genetic modification (GM) of crops has brought about, in many parts of the world, significant increases in crop-yields, disease-resistance and other desirable attributes, and that there are as yet no reported cases of serious damage to the environment resulting from the leakage of the modifications into other organisms.\nNevertheless objections to GM remain. Some people are concerned on moral grounds, arguing that the structure of life is too fundamental and ‘sacred’ to permit interference by humans, while others feel that the possibility of catastrophic error cannot be ignored. We understand too little, they argue, of the complex ecology of life to be sure that our changes will always be benign.\nIn Europe, unlike the USA, these arguments have prevailed so far, and of course, like the USA, we have the luxury of not actually needing to increase our crop yields anyway. In view of this it does seem sensible to apply the precautionary principle: ‘If you are not sure it’s a good idea, and it isn’t absolutely necessary, then don’t do it.’\nThere remains the question of imported food, which is not under our control and may consequently be genetically modified. Here the principle must be one of freedom to choose. If I do not want to consume GM food I must have the right not to, and this implies that all GM foods, or foods that may contain GM substances, must be clearly labelled as such.\nWater\nA good supply of clean water is available to every household in the UK, and for this we must be grateful to, among other things, the far-sightedness of Victorian engineers. Inevitably there are now increasing pressures on the ageing infra-structure, and substantial spending is necessary to keep the supply and waste disposal systems in good order, as well as water-conservation measures and avoidance of wastage.\nAt the same time we must be conscious of the fact that many parts of the world are not so fortunate, and that competition for water is becoming a significant source of tension between countries. The UK must play its part in helping to defuse these tensions.\nEveryone, whether young, single, single parents with children, older or disabled people, or conventional families, should be entitled to a safe, secure and peaceful home.\n- Ensure that at least 300,000 “housing units” are built every year for the foreseeable future so that everyone has a home of their own that they can afford to rent or buy.\n- Ensure that all land is taken into public ownership in order that sufficient land is available for more homes.\n- Make full use of sites for new housing that have ceased to be used for other purposes.\n- Suspend for up to 25 years all green belts that surround major towns and cities.\n- Require local councils to be responsible for the construction and operation of homes for rent.\n- Bring all rented homes under public control with responsibility for their operation being given to local councils.\n- Bring large homes-building firms under public control to prevent profiteering and to ensure government funds intended for the creation of homes are well spent.\n- Bring firms manufacturing and supplying building materials under public control to prevent profiteering.\n- Ease controls on immigration for those seeking work in home-building.\n- Ensure funding for further education colleges is sufficient to ensure an adequate supply of well-trained workers in building trades.\n- Improve existing housing stock.\n- Institute shared ownership schemes with housing trusts.\n- Ensure that housing programmes contain a mixture of social, rented housing and owner-occupied homes.\n- Build all new housing to the highest environmental standards, minimising its negative impact on its surroundings.\nSomewhere to live\nAlthough a decent home is one of the most basic requirements of a happy and well-regulated life, many people have nowhere to live, and many more live in unsatisfactory accommodation or are barely able to pay for the accommodation they occupy.\nThis country has a tradition of ‘home-ownership’ that is often regarded as fundamental to the ‘British way of life’. Arguably, however, this is a model that has only ever benefited a minority of the population, and mortgages are probably the country’s principle form of debt.\nIt needs to be recognised that housing is first and foremost a basic essential in people’s lives, and should only secondarily be a source of profit, whether from interest on mortgages or from capital gains arising from increases in house and flat values.\nOver recent decades there has been a continuing move away from public provision in housing, first promoted in the Thatcher era when local authorities were forced to sell off housing stock into the private sector but forbidden to use the funds accrued to build more public housing. This trend must be reversed.\nNational government, local government, and housing associations have crucial roles to play in remedying the situation. National government has its role in mandating and financially supporting local authorities, and in developing policies for urban renewal; local authorities should translate the vision to fit local realities and housing associations are in a position to supply expertise and experience.\nHomelessness\nBut even with enlightened housing policies there will still be many people for whom there would be virtually no prospect of having a ‘home of their own’ without more direct and personal intervention. Provision, such as a basic income for all adults, must be made for those who have little chance of achieving a regular income sufficient to pay either a mortgage or rent at a market rate.\nThis could be done either by certified housing associations or by government organisations that would acquire and retain ownership of properties while transferring all right of use and access to its occupier. Such accommodation would be integrated into housing developments and programmes, and there would be an obligation on private developers to release a certain proportion of the accommodation they construct for this purpose.\nPrivate ownership of land, while undeniably a legal fact, is morally dubious, and we have a responsibility and duty of care to the land we, in effect, hold ‘in trust’.\n- Ensure that we work with nature, using only our fair share of resources and recognising that apparently insignificant actions can have far-reaching consequences.\n- Regard land as being held in trust on behalf of the whole community.\n- Develop high-quality, free local transport systems and low-cost, government-supported efficient forms of long-distance transport.\n- Promote the development of non-polluting energy provision that will meet everyone’s basic needs.\n- Work towards levels of carbon dioxide emissions to at least those set out in the Paris Agreement.\nWhy the environment matters\nWe see environmental concerns as part of a political philosophy based fundamentally on the replacement of competition in our society with a culture of peaceful co-operation.\nHumanity has for centuries, or perhaps millennia, seen nature largely as something to be conquered. This was not much of a problem when the total world population was only two million, and our distant ancestors are unlikely to have had a major impact on the environment as a whole. Now that there is a global human population of nearly eight billion and advanced technology on a vast scale we need to have a deep awareness of the existence of the global village.\nIt’s not just that it’s dangerous to ignore the damage we are doing to our environment. An increasing number of people are finding that a life lived in tune with nature is more rewarding, and somehow more ‘right’. This is a difficult thing to define without becoming unfashionably mystical, but it seems to be strongly felt at some level by many, if not most people. We are an integral part of nature and no domineering is needed.\nOwnership of land, responsibility and stewardship\nIn many traditional societies land could not be owned; there was no such concept. In developed ‘Western’ societies land ownership now seems perfectly natural, but it has not always been so, and relics of an older tradition still survive in the form of ‘common land’ and public ‘rights of way’, for instance.\nIt would not be easy to put the clock back, but there is much to be said for the idea of land as a common resource. Certainly the ownership of vast swathes of land by people whose ancestors acquired it by force or as a gift from the king for services rendered in battle, seems to have little moral justification.\nThere is a sense that, morally, all land is held in trust, so that while an individual may be its legal owner, in a deeper sense we can only be custodians, with a responsibility, or even a duty, to take care of it, not to deny its proper use to other people who have a legitimate claim on it, and eventually to pass it on to future generations in good order and repair.\nPollution due to energy generation\nIt is generally recognised that the major environmental issue of the moment is pollution of the atmosphere. It is reasonable to suppose, and innumerable scientific studies confirm, that this not only causes health problems by poisoning the air we breathe, but also contributes to dramatic changes in climate that will have unpredictable consequences. Much of this pollution is caused by the burning of carbon-based non-renewable fuels such as gas, oil and coal in order to generate energy for transport, manufacturing, and domestic use.\nThe other major source of energy, nuclear fission, produces a different form of pollution — radio-active waste — that does not directly pollute the atmosphere (unless there is an accident as in the case of Three-Mile Island and, much more seriously, Chernobyl), but is hazardous, difficult to dispose of, and long-lasting. The close link between nuclear power and nuclear weapons is well-known; the Peace Party works to eliminate both.\nIt is clear that the use of fossil-fuels is unsustainable. The amount of ‘anthropogenic (human-caused) greenhouse gases’ in the atmosphere (principally carbon dioxide but also methane and nitrous oxide) is already too high and is increasing. Greenhouse gases must be phased out as soon as possible, unless ways can be found to extract virtually all carbon and other pollutants from their emissions. The winning of natural gas and oil using “fracking” must be ended to prevent, among other things, damage to underground water sources.\nWhile there is some political agreement in principle on these points, progress remains too slow. Ways must be found to accelerate the process, whether through taxation, pollution-levies, emissions regulation or more intensive promotion of schemes like carbon credits. Wide-scale re-afforestation can also help by re-absorbing some of the carbon dioxide that has already been released.\nUsing less energy\nGood, well-organised land-based public transport (trains, buses, trams) can be much more efficient than private cars. But it needs to be affordable, comfortable, to run at convenient times, and to connect a much wider range of destinations.\nProviders should be required to work together to ensure that their services connect reliably and conveniently.\nGovernment funding should be increased to enable prices to be reduced and standards improved dramatically. It needs to be recognised that a good transport service is of major benefit but cannot be operated as a profit-making business. Nationalisation coupled with more stringent licensing conditions should be considered as possible ways of bringing about the desired changes.\nAt present around 50% of the cost of the railways system (for example) is carried by the government and 50% by passengers. We should aim for 90% of the cost to be a public expense and 10% to be paid by individual passengers.\nCompanies should be encouraged, by fiscal and other means, to enable their employees to work from home, and grants should be made available to companies wishing to develop secure intranets to facilitate this. Working from home should replace commuting wherever possible, thus relieving the burden on the transport system. Video-conferencing must replace long-distance travel in all but exceptional circumstances.\nSafe cycle-lanes should be mandatory on all new urban roads, and on existing roads where practicable. These should be combined with traffic control systems that give priority to cyclists and pedestrians.\nNo new inter-city roads should be built unless they can be clearly shown to be of overall environmental benefit, and the same criteria should be applied to any proposals for road-widening projects.\nEnergy-efficiency of moving vehicles decreases at higher speeds. Serious consideration should be given to the possible reduction of the national speed limit to 60 m.p.h. and speed limits should be rigidly enforced.\nAlternative sources of energy\nReduction of energy consumption is not an end in itself — it is primarily a means towards reducing atmospheric pollution and the consequent climatic changes. The longer term objective must be the implementation of non-polluting sources of energy. This must be tackled far more seriously than is the case at present.\nOther forms of environmental degradation\nAlthough atmospheric pollution and its effect on the climate is a primary concern, there are numerous other ways in which humans are seriously damaging the environment, polluting the oceans, destroying fish-stocks, damaging the sea-bed, destroying habitats and causing massive rates of extinction.\nThere are, of course, numerous conferences on these issues, but we believe we should take a lead not only in pressing for but also in developing and implementing solutions. We should, for example introduce much tighter legislation on fishing practices, encourage the development of advanced methods of recycling, and discourage use of land-fill.\nSummary of detailed policies for the environment\nThe Peace Party will promote the need for the right relationship with our natural and man-made surroundings, a relationship that is holistic and organic. There is an overriding responsibility to pass on to future generations the world’s resources, wildlife and plants, cities and transport links, landscapes, water and air, in a far better condition than they are at present.\nThe Peace Party aims to:\n- Ensure that everyone has an equal right to, and use of, the natural and man-made resources of the Planet.\n- Ensure that humans, who are part of nature, are aware of the total connectivity of all life on earth and that every action rapidly affects every other across the globe.\n- Make sure that all land is held in trust for the use of the whole community.\n- Ensure amenities are within walking distance of every home when planning towns and that everyone in a town is within a five minute walk of a bus route.\n- Make sure that everyone has access to free local travel with longer overland journeys being more heavily subsidised than they are at present. Ensure that there are good interchange facilities between modes of transport.\n- Have well-thought out, rolling 30-year plans in place for transport and development in towns and cities (a far longer time scale than at present).\n- Everyone should have access to sufficient , non-polluting energy by subsidising the research into, and development of, photovoltaics for the generation of electricity, nuclear fusion, wind, wave, hydro-electric power, including tidal, waste biomass burning and fuel cells (fromstored hydrogen).\n- Replace, as soon as possible, nuclear fission power and phase out the burning of all carbon-dioxide producing fuels – coal, oil and gas.\n- Subsidise the storage of “wastes” from burning and nuclear reactions for possible future use.\n- Reduce carbon dioxide emissions eventually to mid-nineteenth century levels, to counteract global warming by, for example,\n- Subsidising reductions in energy consumption through insulation of buildings and installation of efficient boilers and air-conditioning units\n- Encouraging walking and cycling\n- Giving car-owners incentives to leave vehicles at home\n- Taxing, even more heavily, petrol and diesel in private vehicles and aircraft fuels\n- Subsidising the development of, for example, hydrogen- and electrically- powered vehicles (where batteries for the latter are charged from non-polluting electricity)\n- Subsidising companies to convert from carbon dioxide-producing to non-polluting processes\n- Taxing companies producing carbon-dioxide\n- Taxing timber that cannot be shown to be from forests that are re-planted with trees of similar species\n- Working with the international community to do all the above throughout the world.\n- Reduce methane emissions, to counteract global warming, by\n- Subsidising more energy-from-waste schemes, including those combining the production of heat and power\n- Managing waste effectively – someone’s waste is someone else’s resource\n- Subsidising more re-cycling and re-use of materials and products\nTaxing waste put into landfill - Promote the production and use of plant sources of protein, such as pulses and nuts, soya and hemp, thus reducing the number of methane-producing animals.\n- Work with everyone, to combat climate change, to reduce the proportion of atmospheric carbon dioxide to the mid-nineteenth century level of 275 parts per million by volume (ppmv) by\n- Subsidising tree-planting, including the re-afforestation of land, such as the tropical rain forest, cleared for animal rearing\n- Promoting “edible landscaping” i.e. the planting of fruit and nut trees in towns and cities.\n- Reduce the possible effects of climate change, e.g. rise of temperature, changes in rainfall patterns, increased windiness and possible local cooling, by\n- Subsidising changes in forestry and agriculture – draining fields, introducing irrigation, bringing new land into cultivation to maintain and increase food production, as sea level rises and agricultural land is flooded\n- Protecting lands liable to flood as sea levels rise by constructing coastal defences and making existing ones higher. (Such engineering works may have limited life but they will allow time for populations to be moved and for new agricultural land to be brought into use.)\n- Planning to re-locate residents, factories, offices, roads and railways, as sea level rises\n- Improving water supply, for example by creating canals and pipelines from high to low rainfall areas, by improving water storage both underground and in reservoirs, by the desalination of sea/salt water and by subsidising rain-water collection\n- Improving or introducing flood-relief schemes\n- Working with the international community to do all the above throughout the world.\n- Reduce other man-produced pollutants by\n- Subsidising companies to convert from polluting to non-polluting processes\n- Taxing the polluters.\nWithout a trial a ‘suspect’ is just a suspect, and an injustice is done whenever someone is imprisoned without trial and without even the prospect of a trial.\n- Introduce a Written Constitution enshrining basic human rights, based on the models of the European Convention on Human Rights and the Universal Declaration of Human Rights.\n- Use imprisonment only for violent and serious crime where the public needs to be protected.\n- Shift the focus of the penal system away from retribution and towards rehabilitation.\n- Extend the use of restorative justice (an approach to justice in which the response to a crime is to organize mediation between the victim and the offender, and sometimes with representatives of a wider community.)\n- Promote public awareness of the factors leading to criminal behaviour and extend the concept of justice to include a responsibility to compensate and support its victims.\n- Reduce the use of CCTV and other aspects of the ‘surveillance-society’.\n- Destroy DNA records, fingerprints, and all other information obtained from those not found guilty of an offence.\n- Repeal the legislation that prevents prisoners from voting.\nJustice\nMuch has been written about justice, a concept that dates back thousands of years, but there are differing views as to what it means. Like education, it is a notion that evokes strong feelings, controversy, and competing definitions. For some, it is summed up by the Old Testament phrase ‘an eye for and a tooth for a tooth’, while others of a more compassionate disposition would place the emphasis on rehabilitation and education of offenders and ‘restorative justice’ rather than deterrence and retribution.\nPre-requisites for justice\nHowever justice is defined, it presupposes at least three things: (1) that there exists a recognised system of laws that require a society’s members to act towards each other within certain normative constraints, (2) that the laws are fair, equitable, and reasonable, and (3) that members of the society can obtain redress should they be wronged or in any way made to suffer as a result of a breach of the laws.\nNecessarily, the ‘law of the land’ must be administered by institutions that have nation-wide recognition, and in most modern democracies (including, of course, the UK) it is accepted that these institutions (the ‘judiciary’) must be independent of the government (the ‘legislature’). This arrangement is intended to ensure that the laws themselves are framed and enacted according to the moderated will of the people, by Parliament, but administered independently and without interference by government.\nLimiting state power — Human and Civil Rights and a Written Constitution\nThe sole task of the Courts is to interpret the laws and determine how they should be applied in each case. So, in a sense, the Courts are no more than agents of the government, despite the separation of powers. Admittedly they are sometimes called upon to weigh up the competing claims of domestic law and European Community and Human Rights legislation, but this does not mean that they are in a position, of themselves, to constrain or restrain Parliament, since it would be possible (if difficult) for Parliament to tear up the Human Rights legislation.\nThe Peace Party holds the view that the ‘sovereignty of parliament’ should not be absolute, but should be constrained within a framework defining the limits to its powers — in other words a Written Constitution. Such a Written Constitution would incorporate (among other things) the fundamental principles of Human Rights such as habeas corpus, the right to a fair trial, the unacceptability of torture and ‘cruel and unusual punishment’, and innocence until proven guilty.\nUnequal access to legal processes\nIt has often been said that the rich and the poor (but not those in between) have access to the law — the poor because they can call upon Legal Aid, and the rich because they don’t need to. The Peace Party will ensure that there is legal aid available to all who need it, otherwise we could very well find ourselves in the position where only the rich have access to justice.\nA legal system that disenfranchises most of the population is in danger of losing the respect of that population and of being seen as operating only for the benefit of the rich minority who can afford it. This is not only unjust but also socially dangerous. We recognise that Legal Aid is expensive and would argue for serious investigation into alternatives to costly and divisive adversarial legal processes and penal systems.\nMediation, arbitration, and restorative justice all have a part to play, as could a change, in certain circumstances, to an inquisitorial rather than an adversarial approach.\nEnforcement and police accountability\nIn tyrannical states, the forces of law and order rapidly become conscripted as agents of the regime. Typically this is through a system of under-payment, corruption, and sponsorship, not to mention intimidation. A civilised democratic society by contrast expects its police forces, like its politicians, to be its servants, not its masters — in the sadly out-dated cliches, to help old ladies across the road, to tell you the time, and to look after lost children.\nEven in a civilised democratic society however, there is still a tendency for police forces to drift towards increasing authoritarianism in the belief that the more powers they have at their disposal the more effectively they can do their job.\nWe believe that strict and clear guidelines should be laid down for police behaviour and that where breaches occur (such as the unnecessary use of violence towards demonstrators) the offender should no longer be allowed to continue as a police officer. We recognise that there have been many changes for the better in police culture over the years, but there is considerable room for improvement.\nThe role of quasi-judicial systems\nThe then Archbishop of Canterbury was much vilified in the press in 2010 for his suggestion that there could be a place under the British legal system for ‘Sharia Law’ – a code of conduct regulated by Muslim courts. His suggestions were generally taken as suggesting two parallel legal systems – one for Muslims and one for everyone else.\nThis was of course an absurd and unfair caricature. There are many quasi-judicial systems within the UK, from the rules of the golf-club, to the standing orders of a Trade Union, to the rules of a local school. None of these systems is binding in the sense that the ‘law of the land’ is binding. They are systems that are entered into voluntarily and can equally easily (in most cases) be opted out of, even if this means leaving the organisation they are associated with. Where there is a conflict with the law of the land (vide the case over the admission of women to golf-clubs on an equal footing to men), the law of the land takes precedence. There is no problem.\nThe Peace Party is sympathetic to the recognition of the cultural traditions of many of the Muslims in our society that would be expressed by supporting the establishment of Sharia Courts subject to the over-riding requirements of British law. Indeed, it is difficult to see how it could legally be prevented in any case.\nDetention without trial — ‘innocent until proved guilty’\nAn absolutely fundamental aspect of our traditional view of justice is that an individual is ‘innocent until proven guilty’. Without a trial a ‘suspect’ is just a suspect, and an injustice is done whenever someone is imprisoned without trial and without even the prospect of a trial.\nThe rhetoric of ‘the war on terror’ has made it easier for politicians to detain people, albeit not very many, without trial, but it is a short-sighted approach. In a war there are no ‘good guys and bad guys’ — it’s just ‘us and them’. Consequently using the language of war rather than the language of law makes it easier for people to decide to be, as George Bush put it, ‘against us’ rather than ‘for us’.\nWe believe that terrorism should be regarded as criminal, not military, activity, and be dealt with respecting the normal and proper constraints of legal enforcement and investigation.\nEducation should be free at all levels, and clearly distinguished from training for employment.\n- Encourage and facilitate constructive dialogue between parents and teachers.\n- Abolish the National Curriculum and ensure curricula are developed by teachers and appropriate educationalists.\n- Develop new approaches to teaching that respect the place of the pupil as an active participant in the learning process.\n- Encourage the study of the place of the individual in society and politics, and of alternative approaches to conflict resolution.\n- Encourage critical thinking and an awareness of cultural and nationalistic propaganda in conventional historical narratives.\nEducation or training\nToo often in our society, education is seen as little more than training for employment. This is a model that it is in the narrow political interests of the government to promote, as it implies that the principle beneficiaries of education, higher education particularly, are its recipients. From there it is just a small step to the argument that education should be paid for mainly or entirely by those who benefit from it.\nEducation and the civilised society\nAs long as we see the country’s wealth in purely economic terms there may be something to be said for this attitude, but even then it needs to be recognised that higher education itself contributes directly to the gross domestic product by training engineers, scientists, teachers, and even artists and musicians.\nBut in fact many of the things we value most cannot be traded and therefore cannot be measured economically. Higher education develops greater understanding, critical faculties, reasoning, and historical, artistic and political awareness. Higher education is one of the marks of a civilised society and if we want to live in a civilised society we need to make adequate provision for it out of the public purse.\nThe Peace Party believes that society benefits as much from the education of its members as do the recipients of that education, and that education should therefore be funded by the state. This idea is largely accepted for primary and secondary education, partly because they are compulsory, and partly because people tend to see lack of basic education as diminishing the individual’s ability to make a contribution to society. We would like to see the same principle applied to any individual, of whatever age, seeking to develop his or her potential in ways that would enrich society.\nWhat is a ‘good education’?\nEducational theorists, politicians and pundits have tended to approach this question from one of two main directions. There are those who see education primarily as a way of fitting individuals into society – teaching them their responsibilities, what is expected of them, the traditions of their country, how to gain employment that will make them an asset to the community, and so on. On the other hand there are those that see education as enabling people to develop their full potential, to get the most out of life, and to become ‘well-integrated’ individuals.\nA moment’s reflection will make it clear that a really good education would aim to do all these things, but all too often the two approaches are seen as mutually exclusive. There are important insights on both sides and we would like to see an education system that sought to pass on the high points of traditional culture (classical music, literature, the Arts in general) while at the same time recognising that a child that is not motivated and curious is unlikely to learn much at all.\nSupporting schools\nSchools, whether by that term we mean primary or secondary schools, colleges, Universities, or other institutions of teaching, learning and enquiry, exist, we believe, to enable people to achieve their ‘potential’. A good school is one that does this successfully, not necessarily one whose pupils achieve high examination grades, but unfortunately schools are still seen by many people (but not, generally, by teachers) as places that should fit their pupils for pre-determined roles in the work-place.\nThis viewpoint, we believe, under-values people. It betrays a fear that unless people – particularly young people – are properly trained and constrained they will come to no good. There is little independent evidence to justify this anxiety, natural though it is. We would welcome, and will promote, a more open approach to education that tries to support the natural curiosity and enthusiasm of the young (and in many cases, the old) and to guide, rather than constrain.\nMost teachers are well-suited to this task. They usually have a natural and genuine sympathy with their pupils, and do not by and large need government edicts to tell them how to do their jobs. The continual controversy over ‘educational methods’ and constant obsession with ‘league tables’ sets school against school, and encourages parents to view every school with suspicion. This does both schools and teachers a disservice. We would abolish league tables and encourage a natural, constructive and friendly dialogue between teachers and parents – all of whom have the best interests of the pupils at heart.\nEveryone has a moral responsibility to make a contribution to society if at all possible.\n- Develop policies to ensure that secure, worthwhile and fulfilling occupations are available for everyone, and that everyone is assured of an income that is sufficient for their needs.\n- Ensure that working conditions are compatible with the Universal Declaration of Human Rights, including the right of representation in the work place.\n- Enact legislation that will ensure that immigrants have the same working conditions, remuneration, and opportunities as indigenous workers.\n- Support fair trade.\nWork and leisure\nMeaningful work can give people a role in society for which they can be respected; paid work provides them with an income. However, there are many forms of work that are financially unrewarded or socially undervalued, but which nevertheless are essential to the smooth functioning of society, or in other ways of real value.\nEconomic systems\nCapitalism is essentially ‘value-free’, in the sense that moral principles and notions of good and bad practice are not inherent in it, even if they appear to emerge in practice. Admittedly it tends to cause things to be produced that satisfy a demand, and it can therefore be seen on balance as a mechanism for good that has served human society well. There is much to be said for this point of view, but it is only part of the story. Capitalism has also produced exploitation, the arms trade, drugs dealers, and slavery.\nUnfortunately alternative economic systems, however humane their theoretical rationales, have also created appalling excesses, and the verdict of history at the present time favours a regulated capitalism as the system that gives the greatest scope for enterprise, creativity, and ‘progress’.\nThe idea of work as a social imperative\nWhat most modern economic systems have in common is that they see ‘work’ (that is, paid employment by someone else) as a social imperative: the maxim is, ‘If any would not work, neither should he eat.’ This makes sense from an economic perspective since economic theories can only quantify the creation of wealth that can be traded.\nBut this is a narrow, inconsistent and, we believe, inadequate view. It is inconsistent in that it exempts the rich entirely, but more importantly it overlooks the many contributions people make to society in ways other than through paid work, and the fact that paid work is not always beneficial to society. A stand-up comedian gets paid, but someone who makes people laugh in the bus queue is also making a contribution. A carer gets paid (though not usually enough), but people all over the country are caring for others in return for neither reward nor recognition. Cigarette manufacturers get paid, but their main contributions to society are lung cancer, emphysema and huge NHS bills.\nFrom time to time some of these discrepancies are recognised and there is an attempt to canvass public opinion on what would be ‘fair’ wages for different occupations. The result is always and inevitably inconclusive, for the reasons we have already considered – and because what is of value for one individual at one point in time is not the same as for another individual at another point in time.\nAn alternative approach\nThe Peace Party would disentangle the basic human right (as we see it) to a decent quality of life from the moral responsibility to make a contribution to society. That is to say, everyone is entitled to a ‘decent life’. Everyone also has a moral responsibility to make a contribution to society. But each of these principles stands on its own – if they are linked in practice it is only by economic necessity.\nOf course it is possible to take the view, as many do, that you should only ‘take out’ of the system as much as you ‘put in’, and this is no doubt an excellent guiding principle for one’s own actions. The difficulties arise when it is applied to the conduct of others – who is to decide ‘how much’ a person ‘puts in’? How is it to be measured? The conventional answer to the last question is that it is that economics will decide. But as we have just seen, capitalist economics is amoral. It can only value commodities that can be traded, and ‘demand and supply’ can be a perverse indicator of value. There is a huge demand world-wide for AK47s and crack cocaine, but the world would be a much better place without them.\nImmigration\nIn principle, the Peace Party supports the view that people have a right to live and work wherever they wish. There is something strange about a system in which capital is able to move freely across national boundaries (sometimes, it has to be said, with disastrous consequences), but people cannot.\nIn times of national stress immigrants make a convenient target for blame and resentment. It is easy to find, and easier to invent, stories in which immigrants appear to have been favoured over the indigenous population in the allocation of social housing and other resources. Then there is the argument that immigration cannot be supported because resources are not available, an argument which generally overlooks the fact that resources may actually be increased by the immigrant population.\nOf course, there are limits to the rates of immigration a country can support without undergoing radical change, but it is doubtful if such levels would ever be reached in practice. Instead of panicking about the possible effects of excessive immigration it would be much more sensible to concern ourselves with how immigrants are treated when they are here. For example it makes no sense to bar an immigrant from employment, and then deny him or her access to social security.\nIt is sometimes claimed that employing immigrants tends to reduce the standard of working conditions for everyone else. There is some justice in this view. Immigrants will usually come from a part of the world where standards are lower than they are in the UK, and they may be prepared to work for lower wages and in poorer conditions than their British counterparts. Consequently they can be exploited by unscrupulous employers to reduce costs and increase profits, with the result that standards are lowered and indigenous employment is decreased.\nPart of the solution to this difficulty is to make it illegal for an employer to employ immigrants for lower wages or in poorer conditions than British employees. This would only have an impact on employers that relied primarily on British workers, and would not help very much in seasonal casual work, and in these situations proper enforcement of minimum wages is the only solution.\nBritish immigration policy is at present openly hostile to immigrants. This seems to be a deliberate policy designed to ‘send a message’ to potential immigrants that the UK is not a good destination. The Peace Party would reverse this policy and set up a Department charged with the specific task of finding ways to settle immigrants, be they economic or political. There would have to be co-operation with other European countries, up to and including arrangements for helping immigrants to settle in the most appropriate place.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_ignoring-growing-global-heating-threatens-humanity/content_14.html": "The latest State of the Climate report published on Thursday 22 August 2024 confirms that 2023 was a record year for a whole suite of climate indicators.\nThe findings, co-ordinated by NOAA’s National Centers for Environmental Information, are based on contributions from more than 590 scientists, including from the UK Met Office. The report is published by the Bulletin of the American Meteorological Society (AMS).\nKey findings from this year’s report include:\n• Earth’s greenhouse gas concentrations were the highest on record during 2023. Carbon dioxide, methane and nitrous oxide all reached their highest measured atmospheric concentrations during the year.\n• 2023 was the warmest year since records began in the mid-1800s, surpassing the previous record set in 2016. The global average surface temperature reached 1.46°C (± 0.1 °C) above pre-industrial levels, according to the HadCRUT5 global temperature dataset. Individually, the last seven months of 2023 (June to December) were also the record warmest. 2023 was the 9th consecutive year >1°C above the pre-industrial average (calculated over the period 1850-1900).\n• The highest average annual global sea-surface temperature was recorded during 2023, beating the previous record by 0.13°C. A series of marine heatwaves affected widespread regions of the North Atlantic beginning in June, with local temperature anomalies sometimes exceeding +3°C. Overall, 94% of the global ocean surface experienced at least one marine heatwave.\n• Ocean heat content – the measure of heat from the sea surface to a depth of two kilometres – was the highest on record.\n• The average global sea level in 2023 was the highest on record for the twelfth successive year.\n• Antarctic sea ice reached a record low during 2023.\nThe Peace Party – and every member of the community – needs to consider the implications of these findings and then to take appropriate action. The Peace Party submits that inaction (or even delayed action) spells danger for everyone’s futures:\nGreehouse gas emissions must be urgently brought down to pre-industrial revolution levels.\nOtherwise, atmospheric heating will continue with health implications, food production and environmental implications and more extreme weather events (increased rainfall and flooding, prolonged droughts with accompanying wildfires).\nHigher ocean temperatures will adversely affect fisheries – as well as raising of sea levels as water expands on heating.\nContinued melting of glaciers and icecaps on Greenland and Antarctica (as well as polar sea ice) will massively contribute to rising sea levels, threatening the populations of coastal towns and cities over decades to come.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_war-in-ukraine-is-grave-threat-to-europes-peace-and-security/content_28.html": "The Peace Party is so grateful to the United Nations General Secretary, Antonio Guterres, reminding the world that “Monday marks three years since the Russian Federation launched its full-scale invasion of Ukraine, in clear violation of the United Nations Charter and international law.”\nHe continues, “On this tragic occasion, I reaffirm the urgent need for a just, sustainable and comprehensive peace – one that fully upholds Ukraine’s sovereignty, independence and territorial integrity within its internationally recognized borders, in accordance with the UN Charter, international law, and resolutions of the General Assembly.\n“From the very first day of the war, the UN has stood in full solidarity with the people of Ukraine, delivering life-saving humanitarian assistance to millions in need and supporting long-term recovery and reconstruction efforts.\n“The war in Ukraine stands as a grave threat not only to the peace and security of Europe but also to the very foundations and core principles of the UN.\n“Enough is enough. After three years of death and destruction, I once again call for urgent de-escalation and an immediate end to the hostilities. I welcome all efforts towards achieving a just and inclusive peace. The UN stands ready to support such efforts.”",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_john-stands-for-peace-wellbeing-and-happiness-in-2024-uk-election/content_27.html": "Peace starts with you and me – When you and I share wellbeing and happiness, We are at Peace.\nThis time, vote for John Morris, Candidate for The Peace Party – Non-violence, Justice, Environment – For Parliament – for Guildford on 4th July\nSo starts the leaflet being distributed in the Guildford Constituency in the west of Surrey.\nJohn asks readers, “What do Happiness and Wellbeing look like? (as described in The World Happiness Report 2023)“\nAnd then provides the answers, “They come from each of us having: a. Adequate income, b. Support from those around, c. Healthy Life, d. Freedom to make life choices, e. Generosity: positive community engagement, f. Trust in the Government.\nJohn then asks the key question, “How can a Peace Party-influenced government ensure widespread happiness and well-being?\nAnd suggests the answers – “Adopt policies to match with the Pillars of Positive Peace” (As defined in the publications of The Institute for Economics and Peace)”:\na. The Integrity of well-functioning government, b. A Sound business environment, c. Equitable distribution of resources, d. Acceptance of the rights of others, e. Good relations with neighbours, f. Free flow of information, g. High levels of human capital (there’s a well-educated population), and h. Low levels of corruption.\nFurther sections in the leaflet, describe what John says the Peace Party is for – those who seek Peace through non-violence and those who are revolted by War and Violence. There’s a section on “Three alternatives to war” and a follow-up section, “Are they realistic?” Importantly, the leaflet covers “Headline Policies of The Peace Party”.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_page_5/content_4.html": "Peace Party outlines its thinking on The Climate Emergency\n“The Climate Emergency” Guildford Quakers wrote recently to John Morris, explaing that their members were very concerned that 2023 was the warmest year on record\nVoting for The Peace party means...\n“The Climate Emergency” Guildford Quakers wrote recently to John Morris, explaing that their members were very concerned that 2023 was the warmest year on record\nWorld military expenditure increased for the ninth consecutive year in 2023, reaching a total of $2443 billion. The 6.8 per cent increase in 2023 was the steepest year-on-year rise since 2009 and pushed global spending to the highest level the Stockholm International Peace Research Institute has ever recorded.\nA future government could resolve to set its face against militarism, the bomb and the bullet, against death and destruction, by building on the wide range of non-violent alternatives.\nThe Peace Party is well aware that if something needs doing, the government can always afford to do it.\nPeace Party Prospective Parliamentary Candidate is appalled that the UK Government has potentially taken on the responsibility for the killing of hundreds – if not thousands – as it prepares to supply ammunition and armaments to the Ukraine.\nThe Peace Party agrees whole-heartedly that “The pursuit of peace is the most essential of all human endeavours”.\nVolunteers\nIf you would like to help us but are not sure you want to commit to becoming a supporter why not volunteer? We can put you in touch with your local Peace Party organisation, who would really appreciate your help and input. Make sure we have your details by completing the form on this page, and we will send you our newsletters and keep you in touch with our activities.\nSupporters\nMost of us have very busy lives these days and we quite understand if you don’t feel you have enough time to be a volunteer. But perhaps you could help us with a financial contribution. If so, use the form on this page to give us your details and we’ll email you information on how to become a financial supporter.\nMembers\nIf you agree with our policies and would like to help us promote them, please consider joining us as a member. We need people who want to ‘give peace a chance’ and are prepared to give up some time to help change the political climate for the better. Get in touch using the form on this page and we’ll get back to you. Leave a phone number if you’d like us to call you!\nMake A Donation\nThe Peace Party’s work is made possible only with the support of people like you, our members and supporters. Your donation will help us to promote peace. Donations are processed via PayPal. Alternatively, you can donate by cheque payable to ‘The Peace Party’ sent to The Treasurer of the Peace Party, 5 Rosehill Cottages, Alexandra Road, MAYFIELD TN20 6UE.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_news/content_10.html": "War in Ukraine is Grave Threat to Europe’s Peace and Security\n“The war in Ukraine stands as a grave threat not only to the peace and security of Europe but also to the very foundations and core principles of the UN.”\n“The war in Ukraine stands as a grave threat not only to the peace and security of Europe but also to the very foundations and core principles of the UN.”\nThe UN Secretary General, Antonio Guterres has just posted this important message for every government and peoples: “This year, renewables are projected to become the\nThe Earth has just endured the hottest decade on record – with 2024 topping the list, and likely to be the first calendar year with a global mean temperature of more than 1.5°C above pre-industrial levels. But is the UK doing its mightiest to reduce global heating?\nOn New Year’s Day 2025, voters and other supporters of the Peace Party believe it is possible to envisage a country and a world that will be free from violence and the threat of war.\nExpanding the Nation’s Budget does not automatically translate to a safer country and world. Rather, it diverts attention and resources from what really matters: the well-being of people and the protection of the planet.\nVolunteers\nIf you would like to help us but are not sure you want to commit to becoming a supporter why not volunteer? We can put you in touch with your local Peace Party organisation, who would really appreciate your help and input. Make sure we have your details by completing the form on this page, and we will send you our newsletters and keep you in touch with our activities.\nSupporters\nMost of us have very busy lives these days and we quite understand if you don’t feel you have enough time to be a volunteer. But perhaps you could help us with a financial contribution. If so, use the form on this page to give us your details and we’ll email you information on how to become a financial supporter.\nMembers\nIf you agree with our policies and would like to help us promote them, please consider joining us as a member. We need people who want to ‘give peace a chance’ and are prepared to give up some time to help change the political climate for the better. Get in touch using the form on this page and we’ll get back to you. Leave a phone number if you’d like us to call you!\nMake A Donation\nThe Peace Party’s work is made possible only with the support of people like you, our members and supporters. Your donation will help us to promote peace. Donations are processed via PayPal. Alternatively, you can donate by cheque payable to ‘The Peace Party’ sent to The Treasurer of the Peace Party, 5 Rosehill Cottages, Alexandra Road, MAYFIELD TN20 6UE.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_2069-2/content_5.html": "The Peace Party wishes to be associated with the following statement issued recently by Antonio Gutteres, Secretary General of the United Nations:\n“No matter where they live. No matter who they are.”\n“Every child and young person deserves an education.”\n“To achieve a better future for all, we must ensure inclusive access to quality education.”\n“It can transform lives by helping people overcome poverty, inequality and discrimination.”\n“Quality education is not a luxury — it is a human right.”\nA government influenced by The Peace Party would ensure that inclusive access to the highest quality education for everyone.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_rethinking-security-why-expanding-military-spending-wont-make-the-country-safer/content_16.html": "On November 12th, 2024 the American peace group, “The Peace Economy Project” published an article on ‘Rethinking Security’.\nThere follows a Peace Party adaptation of the article to fit with the UK situation: The well-aired proposals to increase military spending might sound like a step toward improved national security, but at what cost? Plans to expand the armed services, modernise the nuclear arsenal, and boost defence manufacturing overlook what truly strengthens our communities: the National Health Service, education, green energy, and infrastructure. At the Peace Economy Project, members of the PEP believe that a sustainable, peace-centred economy offers real, lasting security and that means rethinking how UK Government allocate its resources.\nThe Opportunity Cost of Military Spending\nIncreasing military spending means diverting funds from areas that directly impact the quality of life. Right now, communities across the country are grappling with issues like under-funding of the NHS, of schools and higher education, and outdated infrastructure in the transport and water supply and disposal industries. Imagine if the billions allocated for more fighter jets and warships were redirected to build a safer, healthier future here at home.\nBy prioritizing defence spending over essential services, we risk undermining our own social and economic resilience. Investing in public health, education, affordable housing, and renewable energy offers sustainable benefits that military expansion simply can’t match.\nWhat Real Security Looks Like\nTrue security extends beyond military strength. It includes the ability to withstand and adapt to economic, environmental, and health challenges. Here are a few examples of how shifting our investments from military expansion to community development could improve our security in a meaningful way:\n• Healthcare: When the nation invests in accessible healthcare, a foundation of resilience follows. Healthier communities are stronger communities, capable of adapting to crises without the devastating impacts seen during the COVID-19 pandemic.\n• Education and Job Training: By supporting educational initiatives and workforce development, we empower individuals and foster economic growth. A well-educated workforce is essential to keeping the economy competitive and adaptable, especially in emerging fields like green technology.\n• Clean Energy and Climate Resilience: Climate change poses one of the greatest threats to global security. Instead of spending billions on defence, imagine those funds fuelling clean energy initiatives that combat climate change, create jobs, and reduce dependence on fossil fuels.\n• Affordable Housing and Infrastructure: Infrastructure projects provide immediate employment opportunities and long-term community benefits. With increased investment, we could address affordable housing shortages, update outdated infrastructure, and improve overall quality of life.\nWhy Investing in Peace Makes Economic Sense\nIt’s not just a matter of the principle of investing in peace that also makes economic sense. Studies show that spending on education, healthcare, and clean energy produces more jobs per Pound than military spending. Every time more funds are allocated to war production, the potential to grow other sectors that create stable, long-term jobs and directly enhance our communities are missed out.\nBy investing in green jobs, clean energy, and infrastructure, not only are more employment opportunities created but also the economy is made more adaptable to future challenges. In contrast, increased military spending primarily benefits defence contractors and perpetuates a cycle of dependency on defence by violence and thus killing and destruction. It’s time to break that cycle.\nA Call for a New Kind of Security\nLike the Peace Party, the Peace Economy Project, has been working for years for a shift from militarization to sustainable development. Security isn’t about having the largest military budget or the most advanced weapons. It’s about having healthy, resilient communities equipped to face the challenges of tomorrow.\nExpanding the Nation’s Budget does not automatically translate to a safer world. Rather, it diverts attention and resources from what really matters: the well-being of people and the protection of the planet. We urge our leaders and communities to envision a different future, one where peace and sustainability drive our national priorities.\nThe Peace Party advocate for a future where security is rooted in resilience, equity, and opportunity. Instead of investing in war, the Party wants to see more investment in people and a world where peace is a priority, not just a possibility.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_more-ammo-and-armaments-prolongs-war/content_15.html": "John Morris, Prospective Peace Party candidate for Guildford at the next election of Parliament, was appalled to hear on 24th February 2024 that “Political leaders in the UK have reaffirmed their support for Ukraine on the second anniversary of Russia’s full-scale invasion.”\n“Britain [the UK Government – but not the Peace Party] was prepared to pledge almost £250m towards producing artillery shells.”\n“The Prime Minister signed a new security agreement with Ukraine and announced £2.5bn of military aid to Ukraine over the coming year.”\nPotentially, then, the Government has taken on its shoulders the killing of thousands more men, women and children. What a responsibility! And totally contrary to the position of The Peace Party – Non-violence, Justice, Environment which supports the non-violent resolution of conflict.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_peace-party-calls-for-peace-across-the-earth-in-its-new-year-message-2025/content_9.html": "On New Year’s Day 2025, voters and other supporters of the Peace Party believe it is possible to envisage a country and a world that will be free from violence and the threat of war.\nWe think of those for whom the devastating effects of the wars that afflict the Middle East, Central Europe, parts of Africa and elsewhere which pose a daily threat to so many people’s lives and livelihoods. We also think of the humanitarian organisations working to bring vital relief.\nGovernments in the UK and across the world, now, and in the future, must never have to consider ordering the young women and men to kill others and destroy the efforts of fellow human beings in the name of security and safety – all at the cost of their lives and the misery of relatives and friends losing their loved ones.\nThe Peace Party campaigns not just for the country and world abolishing the military mind-set but of ensuring the elimination of poverty and homelessness, of the suffering from ill-health and division within communities and society in general that lead to unnecessary conflict.\nThe Peace Party feels a depth of hope in the response to anger and lawlessness in several towns this summer where communities came together, determined to repair relationsips in their communities. Through listening, it is possible to respect differences, to defeat prejudice, and to open new possibilities.\nThe Peace Party wishes its supporters now, and in the future, a peaceful and happy New Year.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_no-change-from-new-government-on-security-and-defence/content_25.html": "The King yesterday (17th July) read from his script:\n“. . . My Government will ensure a strong defence based on the North Atlantic Treaty Organisation’s common values of individual liberty, democracy, human rights and the rule of law. Its commitment to NATO will remain unshakeable. It will maintain a strong Armed Forces, including the nuclear deterrent. To ensure that the United Kingdom’s defence capabilities are matched to the changing nature of global strategic threats, my Government will conduct a Strategic Defence Review.\nMy Government will continue to give its full support to Ukraine and its people and it will endeavour to play a leading role in providing Ukraine with a clear path to NATO membership.\nMy Government will seek to reset the relationship with European partners and work to improve the United Kingdom’s trade and investment relationship with the European Union. My Ministers will seek a new security pact to strengthen cooperation on the mutual threats faced by the United Kingdom and the European Union.\nMy Government will play its part in trying to secure long term peace and security in the Middle East. It is committed to a two-state solution with a safe and secure Israel alongside a viable and sovereign Palestinian state.”\nA Government influenced by The Peace Party might have said instead:\n(Readers of this post are invited to say what a Peace Party-influenced government might have said at this point. Responses to john4peace@msn.com, please.)",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_say-no-to-nato/content_18.html": "When North Atlantic Treaty Organisation (NATO) leaders met in Washington on 9 to 11 July, 2024 on its 75th birthday, what they should have been doing was conducting a clear-eyed review of how this organisation that claims to be a force for peace keeps escalating unwinnable wars and leaving countries in ruins.\nThe fundamental question is whether NATO can ever be a force for peace or whether it can never be anything but a dangerous, subservient extension of the U.S. war machine.\nThe Peace Party believes that NATO is an anachronism in today’s multipolar world: an aggressive, expansionist military alliance whose inherent institutional myopia and blinkered, self-serving threat assessments condemn us all to endless war and potential nuclear annihilation.\nThe Peace Party suggests that the only way NATO could be a real force for peace would be to declare that, by this time next year, it will take the same steps that its counterpart, the Warsaw Pact, took in 1991, and finally dissolve what Secretary Austin would have been wiser to call “the most dangerous military alliance in history.”\nHowever, the world’s population that is suffering under the yoke of militarism cannot afford to wait for NATO to give up and go away of its own accord. Our fellow citizens and political leaders need to hear from us all about the dangers posed by this unaccountable, nuclear-armed war machine, and use the occasion of this NATO summit to sound the alarm loudly.\nAdapted from a longer article by: Medea Benjamin and Nicolas J. S. Davies entitled “Confronting NATO’s War Summit in Washington”.",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_is-the-uk-government-acting-on-global-heating/content_3.html": "“We”, writes Antonio Gutteres, UN Secretary General, “have just endured the hottest decade on record – with 2024 topping the list, and likely to be the first calendar year with a global mean temperature of more than 1.5°C above pre-industrial levels.”\n“Individual years pushing past the 1.5 degree limit do not mean the long-term goal is shot. It means we need to fight even harder to get on track.”\n“Governments must deliver new national climate action plans this year to limit long-term global temperature rise to 1.5°C, and support the most vulnerable in dealing with devastating climate impacts.”\n“There’s still time to avoid the worst of climate catastrophe.”\n“But leaders must act – now.”\nIs the UK Government acting?",
  "https_peaceparty_org_uk/https_peaceparty_org_uk_spending-on-militarism-highest-ever/content_29.html": "The Peace Party was shocked to read today (22 April 2024) that World military expenditure increased for the ninth consecutive year in 2023, reaching a total of $2443 billion. The 6.8 per cent increase in 2023 was the steepest year-on-year rise since 2009 and pushed global spending to the highest level the Stockholm International Peace Research Institute (SIPRI) has ever recorded.\nThe world military burden—defined as military spending as a percentage of global gross domestic product (GDP)—increased to 2.3 per cent in 2023. Average military expenditure as a share of government expenditure rose by 0.4 percentage points to 6.9 per cent in 2023 and world military spending per person was the highest since 1990, at $306.\nThe rise in global military spending in 2023 can be attributed primarily to the ongoing war in Ukraine and escalating geopolitical tensions in Asia and Oceania and the Middle East. Military expenditure went up in all five geographical regions, with major spending increases recorded in Europe, Asia and Oceania and the Middle East.\nThis SIPRI Fact Sheet (https://www.sipri.org/…/trends-world-military…) highlights trends in military expenditure for 2023 and over the decade 2014–23. The data, which replaces all military spending data previously published by SIPRI, comes from the updated SIPRI Military Expenditure Database."
}