{
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-welcomes-transformative-new-northumberland-college-campus-ashington/content_6.html": "Plans to build a state-of-the-art college campus in Ashington have been approved by Northumberland councillors.\nThe new campus, comprising of three blocks, will be built on a 5.7 acre site in Wansbeck Business Park. The new buildings will be built to a net-zero specification and will provide teaching spaces for a wide range of courses, including advanced manufacturing and engineering as well as academic subjects.\nThe plans came before Northumberland County Council’s Strategic Planning Committee on Tuesday. Ellen Thinnesen, chief executive of the college’s parent organisation Education Partnership North East, explained the importance of the scheme.\nShe said: “This is a major, transformative investment of over £50m for the people of Ashington its surrounding areas, and, more broadly, the county and the north east of England. We are seeking to construct three college blocks for technical and academic education and skills. Considering the ambition we have, the current campus at Ashington is not fit for purpose. The approval of this application is absolutely crucial. It will result in significant benefits to the local community.”\nCllr Guy Renner-Thompson, the Conservative administration’s cabinet member for education, added: “It is no surprise that I would be in favour of this. The council have worked very closely with the college and the Department for Education to get this investment into Ashington.\n“I am really excited about this level of investment coming into Northumberland and we have to get fully behind it.”",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_conservative-mayor-candidate-reacts-video-labour-mps-celebrating-train-union-christmas-party/content_36.html": "Conservatives from the North East have responded as four Labour MPs were featured in a video posted on Kate Osborne MP's tiktok page, partying while their constituents are unable to travel due to strike action.\nThe post, initially covered by the Daily Mail is available here: Rail union bosses spark fury by enjoying Christmas 'bash' with Labour MPs while wrecking festive party plans for millions by staging week of train strikes set to cost Britain's pubs and restaurants '£800m' | Daily Mail Online\nGuy Renner-Thompson, Conservative Candidate for Mayor of the North East which stretches from Bishop Auckland to Berwick-upon-Tweed, said:\n'Families and businesses will be dismayed to see prominent Labour MP’s from across the region cracking open the fizz with union chiefs while their own Christmas plans are is chaos due to these inconsiderate rail strikes.\n'First they have made driving into city centres impossible by clogging up our streets with cycle lanes, ‘low traffic areas’ and clean air zones, now they're supporting the stopping of train services at the busiest time of year.\n'It's typical of Labour MPs to be pouring bubbly and celebrating while the real workers are left struggling.'",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-calls-bring-tory-conference-tyne/content_9.html": "Conservative Candidate for North East Mayor Guy Renner-Thompson has said he wants his party to back the visitor economy in Newcastle & Gateshead and bring the Tory Party Conference to town during his first term of office.\nGuy, who is campaigning to become the first North East Mayor said, “Newcastle & Gateshead together have exactly what it takes to host the country’s biggest party conference. The work on the new Gateshead Quayside arena which is backed up by government levelling up funding helps create an ideal location when coupled with the Sage, Baltic and many fantastic hotels which can be found on both sides of the Tyne.\nThe Conservative Party Conference currently alternates between Manchester and Birmingham and when it’s in town brings anything up to £20m to the local economy. Bringing it to the true North would give a shot in the arm to our visitor economy. It would show we can host huge set piece conference events and importantly will allow me as Mayor to showcase our region and get its priorities pushed up the national political agenda.”\nThe Conservative Party conference is a 4 day event which happens every October. It attracts around 12,000 attendees.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-joins-fight-save-sunderland-national-glass-centre/content_28.html": "Conservative candidate for North East Mayor, Guy Renner-Thompson, has pledged to save Sunderland's National Glass Centre following a meeting with local councillors, members of the Save the National Glass Centre campaign and Lord Parkinson of Whitley Bay, Minister for Arts, Heritage and Libraries.\nThe £17m glass and steel building was opened by Prince Charles in October 1998. It houses installation spaces, resident glass-makers and the Northern Gallery for Contemporary Art. It was cited as a “world-class cultural asset” in Sunderland’s 2021 UK City of Culture bid, and was the venue of a government cabinet meeting on the first day of Brexit.\nSunderland University plans to permanently close the Centre over mounting costs to repair the building.\nGuy Renner-Thompson said, \"Glass making in Sunderland has a proud 1350 year history, ever since Benedict Biscop brought the first glaziers in 674 AD. The National Glass Centre has an iconic location on the banks of Wear and I want it to stay there. The Save the National Glass Centre campaign has identified a way forward for the centre and I will use my powers as Mayor to support them and keep the tradition of glass making on the banks of the Wear going.\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_campaigns_home-jobs-future/content_33.html": "A North East Mayoral Development Corporation will be created to bring our employment and housing sites to life. It will champion business acting as a gateway to investors and push our region’s talent and capability to a global audience. It will have a key role in delivering our economic plan for the region.\nAlongside the Mayoral Combined Authority, it will identify key studies that we need to build the case for investment from the public, private and third sector.\nIt will involve our local councils, major employers, representatives from small and medium size enterprises and the regions universities and colleges.\nOur Coast & Rivers\nOur metropolitan belt sits on our two great rivers that have been the life blood of our region for centuries.\nThere is a huge opportunity in offshore renewable energy, oil & gas decommissioning, and other marine based industries.\nWorking with site owners and the Government I will break down the barriers to markets for sites up and down the Tyne, Wear and Blyth rivers. Where needed I will intervene directly through Mayoral Development Zones including land acquisition and planning powers to bring sites to life. I will not tolerate people seeking to obstruct progress sought on behalf of our people and will use compulsory purchase powers where necessary to achieve our objectives.\nWhilst the rivers are the catalyst for the growth in these sectors our current economy has shown that there is major opportunity across all our communities for the wider ecosystem connected to these industries to grow and flourish. I will seek to promote and assist all such businesses through targeted support.\nI will seek to deploy Investment Zones and lobby for free port status for land holdings where this will bring more jobs and investment.\nKey actions\n- Work with the National Grid to remove overhead electricity cables over the River Tyne, which restricts the size of vessels able to use the river.\n- Work with our 3 major ports to ensure proper, environmentally friendly river dredging.\n- Work with key stakeholders, land owners and councils to identify barriers to development and growth, where necessary taking land into public ownership.\n- Create a development zone capturing large areas of our river sites to speed up growth. This will include use of Local Development Orders where appropriate.\n- Create a single point of contact with support team working with the 7 local authorities to provide a compelling international offer in offshore/marine industry providing a show case for growing businesses.\nOur existing jobs hubs.\nThe Mayoral Development Corporation will undertake an immediate assessment of all key employment sites across the region. Where sites need investment to facilitate growth this will be brought forward at pace.\nThe Mayoral Development Corporation will aggressively market all available employment land to a local, national, and international audience working closely with local authorities and government.\nMany of our existing employment centers are performing well and will receive support and encouragement from the Mayoral Development Corporation as required. We want these centers to expand and thrive.\nCASE STUDY: The Metro Centre once an engine of economic activity has taken a knock from the move to online retail. There is an opportunity to revitalize the site making it the center of a vibrant community, well connected to the wider metropolitan area, once more a destination that brings people to the region from across the UK. We will seek early engagement with interested parties and the LPA to work up a plan for the areas improvement and support investment in the site and its surroundings.\nThe Mayoral Development Corporation will work with government to build on the North of Tyne High Streets and Town Centre investment and the government’s High Street Fund and Town Deals. This deal seeks to set the basis for levelling up our towns, market towns, high streets and coastal communities in areas like Ashington, Gateshead, Houghton le Spring, Hebburn, Jarrow, North Shields and Wallsend in line with the constituent authorities’ priorities. Housing delivery will also be the catalyst for the levelling up and regeneration of a number of former mining villages in East Durham including Horden and Easington Colliery.\nKey sectors and clusters\nWhere necessary we will make interventions to boost existing and future economic clusters, providing incentives for locating in targeted sites.\nAutomotive and Advanced Manufacturing. The North East is a globally significant region for advanced manufacturing, home to the UK’s largest car plant, three of the UK’s top five off-highway manufacturers and an internationally competitive supply chain. We have specialisms in automotive manufacturing, rail, aerospace, electronics, pharmaceuticals and subsea engineering, plus a well-connected supply chain.\nElectrification is a key part of the Government’s plan to bring all greenhouse gas emissions to Net Zero by 2050 and this represents a huge opportunity for the North East of England. I will encourage additional car and battery manufacturing to the region including to the International Advanced Manufacturing Park in Sunderland, the Northumberland Energy Park and Aycliffe Business Park.\nDigital. The North East is well placed to take advantage of the next industrial revolution, Artificial Intelligence. We sit on the national and international fibre optic cable network and have access to cheap offshore energy required by the next generation of data centers to allow for the computing power necessary to power up the AI revolution. I will seek to facilitate a multibillion-pound investment in data centres across the region, bringing with them direct and indirect jobs. North East England is already paving the way for future advancements in digital technology that will benefit all of society. In 2021, Newcastle was ranked the smartest city in the UK, and above Hong Kong, San Francisco and Dublin in the Smart City Index. I will turbocharge that growth and make the North East the No.1 region for tech investment in the U.K.\nPharmaceutical & Life Sciences. The North East is a one stop shop for life sciences. Our science parks Newcastle Helix and NETPark are centres of excellence for R&D combined with our world class universities. We need more work to translate that research and development expertise into growth of the pharmaceutical manufacturing sector.\nPassionate People, Passionate Places. I will relaunch the ‘Passionate People, Passionate Places’ campaign to celebrate the best of the North East to tell the story of our region projecting a confident image, rooted in our history but excited for the future. I will project this image nationally and on the world stage.\nI will showcase our traditional attractions like Bamburgh Castle, Hadrian’s Wall, Durham Cathedral and Beamish Museum. But I will also look to new opportunities to grow the urban visitor economy such as the new Gateshead Conference Centre. As Mayor I will lobby the Conservative Party to lead by example and hold our own party conference in the region bringing £20m to the visitor economy.\nWe will commission a tourism strategy on a regional level to understand the visitor economy better, identifying how we can get people to spend more money whilst in the region and using it to provide a compelling case for investment into hospitality businesses.\nHowever, as a councilor on the Northumberland Coast, I know that over-tourism can hurt local communities. My tourism strategy will look at the overall impact of tourism on the environment and communities and where tourism growth is deemed no longer sustainable, I will direct promotion of destinations elsewhere in the North East. I will not repeat the mistakes of parts of Cornwall, the Lake District or the Highlands and Islands of Scotland with an overreliance on tourism, unaffordable housing, and winter ghost towns.\nSport. Sport plays a huge role in our society and economy. Football, rugby, racing, running, international golf amongst others all have clubs and hubs across the North East.\nOur football clubs are internationally renowned.\nNewcastle United are destined to play regular European football whilst Sunderland AFC seems destined to return to the Premier League.\nI will seek early meetings with the owners of Newcastle United and Sunderland AFC to understand their redevelopment plans and make sure we maximize the amount they invest and that the offer ties in with our objectives for the region.\nI will act as a bridge between the football clubs and the hospitality sector in the region, to make sure any investment is complimentary to each other and encourage joined up thinking.\nReaching Across the Border\nI will target investment from Scottish Businesses, many of whom are actively looking to relocate to the North East to escape the SNP Government and their regressive tax regime.\nThe North East will promote a program to welcome Scottish professionals.\nOil, gas and offshore renewable energy companies are strong sectors off the east coast of Scotland I will target to bring to the North East\nOur Rural Economy\nI come from a farming family and studied agriculture at Newcastle University. I know devolution is a major opportunity for our rural economy to grow and thrive, and has the power to influence our countryside for generations.\nThe devolution deal acknowledges the unique and complex rural environment in the North East. Acting as a rural exemplar is already at the heart of the North of Tyne Devolution Deal and the North East would expect to work with the government on opportunities to expand this into a wider area.\nIn the deal the government and the mayor commit to the development of a clear joint plan for rural growth, stewardship and net zero. A Rural Growth and Stewardship Board will be chaired by Northumberland County Council and driven by Northumberland, Gateshead and County Durham Councils, DEFRA and its arms-length agencies.\nFood production must be at the heart of any plan produced by my combined authority. The U.K has a growing population in an increasingly uncertain world where the foreign supply of food cannot allows be guaranteed and the price of agricultural commodities like wheat, barley and oilseed rape is increasingly volatile.\nInnovation in agriculture will be key. Newcastle University is already a world leader in the sector with two of its own farms and the world’s oldest continuous grassland experiment which began in 1896. I will champion the regions educational facilities ensuring that our rural communities have the skills and knowledge to lead the world.\nFollowing our departure from the EU, new subsidy and environmental schemes are constantly evolving. Additionally, there are significant rewards for farmers and land managers who are able to use their natural capital to help developers who are now required to deliver a Biodiversity Net Gain of 10%. This means a new property development will result in more or better-quality natural habitat than there was before development.\nWorking with the NFU and existing farm advisory services, I will establish an advice and brokerage service to help land managers navigate this new landscape and take advantage of new opportunities. For example, the service could connect a land manager in County Durham to a developer in North Tyneside to sell off-site biodiversity units.\nThis is a potentially major source of funds for the North East in terms of inward investment and cash flow but if done incorrectly we could see the money leave the region. The brokerage service would only accept individuals and businesses that pursue a means of biodiversity net gain that will not damage rural communities will not take productive land out of use.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-standing-north-east-residents-against-proposed-tax-rise/content_46.html": "Guy Renner Thompson has attacked Labour rival and current Northumbria Police and Crime Commissioner, Kim McGuinness, over her proposed council tax rise.\nKim McGuinness is running a consultation on raising the police precept by an inflation busting 7.7%, on top of a 9.75% increase last year and 6.95% the year before.\nGuy, who is campaigning to become the first North East Mayor said, “Despite an increase in Government Grant to Northumbria Police of £21.8 million pounds this year, Kim McGuinness is yet again asking to ramp up taxes for working families in the North East.\nAt the same time police funds have been used for bowling equipment, dance classes and a project to explore gender identity. In the latest police inspection, Northumbria Police was found to be failing to record crimes and provide an effective service to tackle anti-social behaviour, the scourge of many communities in the North East.\nI have pledged not to raise council tax or business rates if elected Mayor. Kim McGuinness and the Labour Party can not be trusted to keep taxes down or look after your money well.”",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-brings-next-stage-investment-blyth/content_25.html": "The Energy Central Learning Hub is one of the flagship projects of Energising Blyth, a £90m regeneration programme from our Conservative Government to grow, renew, and connect the town.\nThe programme is being delivered by Conservative led Northumberland County Council and funded in partnership with the UK Government, Northumberland County Council, North of Tyne Combined Authority and support from other partners.\nNorthumberland Skills, the post-16 training arm of Northumberland Skills, will use the Hub to deliver training in advanced manufacturing and the energy sector.\nGuy Renner-Thompson is the cabinet member for Inspiring Young People at Northumberland County Council and has responsibility for Northumberland Skills. He said: “This is an incredible opportunity for people across Northumberland, and beyond, to seize the opportunity to follow a career in clean energy and engineering.\nThere is no point in bringing the jobs of the future to Blyth if those jobs can't be accessed by local people, which is why our training facilities are so important.\nAs mayor these are exactly the types of programs I want to bring to the whole region”\nCouncillor Wojciech Ploszaj, cabinet member for Supporting Business and Opportunities at Northumberland County Council, added: “It’s fantastic to see the Blyth regeneration continue to take shape.\n“This cutting-edge training and skills facility will be a thriving place of learning for our engineers of the future - especially within the clean energy space.”\nIf you are interested in finding out more and enrolling for September 2024, visit www.northumberlandskills.co.uk/energy",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-vows-support-aycliffe-hitachi-factory-slams-driscoll-and-labour-over-swiss/content_7.html": "The £82 million Hitachi factory in Newton Aycliffe began building trains in 2015. The first factory Hitachi built in Europe, the plant keeps 750 people in work on-site, alongside another 1,400 jobs indirectly. Hitachi in the North East contributes more than £400million to the UK economy and is a key part of the region’s status as a manufacturing powerhouse.\nNow its reported the future of the factory is at risk with order books for new trains running dry. Hitachi has the order for 52 new HS2 trains for the London to Birmingham route but the first train isn't expected to roll off the production line until 2027, leaving a gap in production.\nIn 2020 the Newton Aycliffe factory controversially missed out on a £700m contract with Nexus for the delivery and maintenance of 42 new trains to serve the Tyne and Wear Metro.\nConservative candidate for the new North East Mayor, Guy Renner-Thompson, says it's that decision which has put the factories future in doubt. He says \"It was absolute madness for the contract for the new Metro trains to go to a Swiss company. That decision was made by Labour council leaders in Tyne and Wear and the North of Mayor at the time, Jamie Driscoll, sat back and did nothing about it.\nCreating and keeping hold of local jobs must be our No.1 priority. The value of those jobs to the local economy for outstrips any savings in getting the trains a few quid cheaper.\nIf elected Mayor I will have a local jobs first policy in all major projects and be a voice for the North East singing from the rooftops about our fantastic industries here in the North East who are ready to export around the globe\"\nAt the time of the Metro announcement Conservative Mayor for Tees Valley Ben Houchen slammed the decision saying it would cost jobs across the North. Conservative MP for Sedgefield, which contains Newton Aycliffe, said he was 'absolutely devastated' following a decision to give the Metro contract to an overseas firm.\nSedgefield MP 'devastated' by Tyne and Wear Metro announcement | The Northern Echo",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-welcomes-huge-investment-northumberland/content_38.html": "Conservative-led Northumberland County Council have secured a major investment in the county as an agreement has been reached to build one of Europe’s largest data centres in the county.\nThe site, previously earmarked for the unsuccessful battery startup BritishVolt, will instead be sold to Blackstone Group, raising up to £110 million which will directly benefit taxpayers in Northumberland. The deal is one of the biggest ever private investments into artificial intelligence in the UK. It could lead to investment of up to £10 billion into the area, creating up to 1600 direct jobs with thousands more in supply chain and construction.\nBlackstone Group will buy the 235-acre site near Cambois in Northumberland for £110 million after the council invoked a ‘buy-back clause’, allowing them to take back control of the site for £4m, the price BritishVolt paid. The deal follows extensive work by Northumberland Conservatives to ensure the site would still receive major investment following the failure of BritishVolt to raise the capital needed to deliver what they promised for the area.\nCouncil Leader, Cllr Glen Sanderson said: “Driving growth and jobs is a key priority for this Council. Next week, Cabinet will consider this really unique opportunity for Northumberland which offers a huge boost to the regeneration and renaissance of the local area.\"\n\"The project would represent a significant inward investment of up to £10 billion, putting our County at the forefront of developments in the digital economy, and delivering over 1,600 direct jobs, including 1,200 long-term construction jobs, and over 2,700 indirect jobs over the course of the development.\"\n“If agreed, the Council would receive up to £110M in exchange for amending the buy-back option on the NEP3 land site, and use the proceeds to establish a fund which will drive investment, including in the economic corridor along our fantastic, new Northumberland Line.\"\n“Through the Council’s investment company, Advance, we have worked tirelessly to make this site such an attractive place for global companies to do business. We look forward to considering this opportunity at Cabinet next week. Northumberland is indeed a Land of Great Opportunities and this potentially significant investment opportunity underlines this.”\nBlyth Valley MP Ian Levy said: “I have worked closely with the Council and Government to ensure the best possible outcome for the Blyth Estuary, South East Northumberland and the wider region. The initial construction jobs and then the longer-term jobs on the site will continue the transformation of our area and I will be doing everything I can to make sure that as many of these jobs as possible go to local people. The spin offs for education and skills development will be outstanding. This is a great example of a Conservative Council working with a Conservative Government to bring opportunity and transform an area and I am very proud to have been able to play a part in this.”\nConservative Council cabinet member for Education in Northumberland and candidate for the new North East Mayor job, Guy Renner-Thompson, said \"This is one of the biggest ever private investments into the UK. It will create up to 1,600 direct jobs with thousands more in supply chain and construction. Once completed the project will contribute around £15 million in annual business rates to the North East, half to the Council and half to the new North East Combined Authority.\nThis is yet another example of our Conservative team delivering for Northumberland and the North East. We will be at the forefront of the global tech revolution and, through our skills and learning programs, local people will be the ones getting those highly skilled jobs. I have the plan and the experience to spread this success across the region.\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-supports-beadnell-road-safety-campaign/content_17.html": "Campaign organiser John Rhind is seen handing a list of supporters calling for improved safety at Swinhoe to County Councillor and North East Combined Authority Mayoral Candidate, Guy Renner-Thompson.\nThe campaign calls for a radical redesign of the crossroads at Swinhoe just west of Beadnell which has been the scene of multiple road traffic accidents dating back to 1928.\nIn addition to the support of more than 1000 residents, MP Anne-Marie Trevelyan and Bamburgh, North Sunderland and Beadnell Parish Councils have all registered their support for the aims of the campaign\nThe campaign will be presented at a meeting of a County Councillors in the New Year.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_gateshead-fc-failed-labour-council-incompetence/content_22.html": "Gateshead F.C have had their dreams snatched away from them and have been barred from taking part in the National League play-offs after failing to meet the entry criteria for membership of the English Football League.\nThe club failed to secure a \"10-year security of tenure\" from Labour controlled Gateshead Council at the International Stadium, where they have played since 1971-72, by 1 March. The stadium is under the councils portfolio of crisis hit leisure services. Gateshead Council closed Birtley Swimming Centre and Gateshead Leisure Centre in July last year.\nNorth East Mayoral Candidate Kim McGuiness has been quick to point the blame at English Football League rules.\nConservative candidate for North East Mayor and Northumberland Council said, \"Labour run Gateshead Council have stopped the club having any chance of promotion to the football league. This is the same Labour Party Kim McGuinness is asking people to vote for on May 2nd. Be in no doubt that Kim McGuinness and the Labour Party do not have the future of the club at heart.\nLabour will try and lay the blame on the Government instead of their own incompetence. Yet in Conservative controlled neighbouring Northumberland we've built new leisure centres which are booming, including Berwick in which has a much smaller population than Gateshead.\"\nSince the Conservative Party took control of Northumberland County Council in 2017 there has been investment in leisure services totalling just over £73m.\n- Morpeth - £21.46m (New build) 2023\n- Berwick - £23.30m (New build) 2022\n- Ponteland - £20m (New build) 2020\n- Blyth - £5.94 million (major upgrade) 2021\n- Newbiggin - £2.39m (major upgrade) 2021",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-welcomes-government-statement-double-cab-pickup-tax-status/content_18.html": "Conservative North East Mayor candidate Guy Renner-Thompson has welcomed Government u-turn on double cab pickup tax status.\nHMRC announced last week that double-cab trucks with a payload of one tonne or more would cease to be commercial vehicles and would instead be taxed as cars. The change to the tax set-up would have led to users of double-cab trucks being charged thousands of pounds a year extra in tax.\nThe Government have now reversed the decision and will continue to tax the trucks as commercial vehicles the same as vans.\nConservative North East Mayor candidate Guy Renner-Thompson said, \"I'm mightily relieved the Government has listened to the NFU and others in reversing the decision of HMRC, and the announcement that the change will be made permanent at the next Finance Bill.\nPickups are a staple feature on roads across the North East. I'm in the building trade. This tax bombshell would have hurt tradesmen, farmers and small businesses in the region. My plan for the region is un-ashamedly pro small business with capital grants and loans available for SME's a key pledge.\nLevying extra tax is not the way to grow the economy and secure jobs for the future\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_about-rss/content_11.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_category_Local-News/content_21.html": "Guy Renner-Thompson brings next stage of investment to Blyth 23rd January 2024 The Energy Central Learning Hub is one of the flagship projects of Energising Blyth, a £90m regeneration programme from our Conservative Government to grow... Local News\nGuy is standing up for North East residents against proposed tax rise 17th January 2024 Guy Renner Thompson has attacked Labour rival and current Northumbria Police and Crime Commissioner, Kim McGuinness, over her proposed council tax rise. Kim... Local News\nGuy Renner-Thompson welcomes North East culture showcase in No 10 16th January 2024 The Laing Art Gallery in Newcastle has been chosen as the new ‘Number 10 Museum in Residence’. Nine artworks the gallery will be on display at Number 10 Downing... Local News",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-pledges-support-support-crown-works-film-studios-sunderland/content_39.html": "Conservative North East Mayor candidate Guy Renner-Thompson has backed plans for a North East film studio in Sunderland that would bring 8,500 jobs to the region and make us a leading centre for film and TV production.\nThe multimillion-pound Crown Works Studios plans envisage the creation of up to 20 sound stages for use in blockbuster film and TV productions, bringing stars and other creative talent to the area as well as creating thousands of jobs across a range of professions.\nFilm company Fulwell 73 - the company behind Netflix football documentary Sunderland ‘Til I Die, the re-boot of Byker Grove and a recent Grammy Award-winning Elton John special - has raised £450m from backers wanting to make the North East one of Europe’s top locations for the film and TV sector.\nThe company has asked the Government to provide financial backing to help bring their plans to reality, with next month’s Budget the key date if the scheme is to remain on track.\nGuy Renner-Thompson said “I fully support the vision to create Crown Works film studios in Sunderland, and the Chancellor said in November that he wanted to see a 'Sunderland Barbie' and was in talks with investors.\nI can't comment on the budget which is due to be released in only two weeks time.\nHowever, in May voters go to the polls to elect a Mayor of the North East who comes with a £48million-per-year investment fund to be invested in the region to drive growth and economic regeneration.\nI would leverage that money to support Crown Works film studios in Sunderland and bring the jobs of the future to the North East.\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-sets-out-his-vision-north-podcast/content_47.html": "Welcome to ‘This Is The North’ Podcast, your source of transformative conversations. An intentional challenge to the systems holding back the North of England. Hosted by Alison Dunn, an award-winning charity chief executive and former solicitor. This podcast is supported by Society Matters Community Interest Company and is dedicated to curating and sharing knowledge, powering the change we need from a more equal and inclusive society.\nIn today's episode, Alison is joined by Northumberland County Councillor and Portfolio Holder for Children’s Services, Guy Renner-Thompson. Guy is also the Conservative Party Candidate for the North East Mayoral Elections.\nGuy shares his vision and plans for the North East, highlighting the region's historical significance and its potential for a prosperous future. With a focus on leveraging the new Devolution Deal, Guy aims to usher in a new era of growth and opportunity, focusing on investment designed to shift power closer to the communities it aims to benefit.\nBorn and raised in the North East, and a local businessman, Guy brings a personal commitment to advocating for the region’s needs. His track record as a Councillor for education in Northumberland, where he has improved school performance, demonstrates his dedication to enhancing local education and training facilities to the regions needs.\nApple: https://podcasts.apple.com/gb/podcast/this-is-the-north/id1716538462?i=1000652455297\nSpotify: https://open.spotify.com/episode/2cRV9kIxamnGFg209z4Idk?si=p5iIwKCNQxWmzoS9l4sqSw",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_st-james-park-must-stay-city-centre/content_42.html": "Conservative North East Mayor candidate Guy Renner-Thompson has weighed in on St. James' Park move talks\nBosses at Newcastle United have asked supporters whether they would be in favour of building a new stadium from scratch on the current St James' Park site - similar to what Premier League rivals Tottenham Hotspur did at White Hart Lane. The supporter survey, emailed to season ticket holders, also included questions on the matchday experience at St James' Park, ticket prices and hospitality.\nConservative hopeful for Mayor of the North East Guy Renner-Thompson said, \" St James' Park must stay in the city centre! Its has been the heart of football in Newcastle since 1892. It's an icon of the city and a mecca for toon fans across the region and the world. I used to live on the other side of Leazes Park and the roar from the stadium was magical. Its city centre location means on match days the whole town comes alive with hustle and bustle. The bars and restaurants are rammed with punters before, during and after the game. As the Mayor of the North East I would resist any move to relocate St James Park away from the city centre.\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-calls-out-labour-hypocrisy-tyne-bridge/content_14.html": "The Tyne Bridge, linking Newcastle and Gateshead, is an international icon. In June 2022 our Conservative Government announced it would put £35.3m into a project to refurbish both the bridge and the Central Motorway. Following the cancellation of HS2 and the reallocation of funds into 'Network North' the Government promised to cover the full £41.4m cost.\nEleven Labour MPs have written to the Prime Minister, calling on him to ensure that the Department for Transport (DfT) hands over more than £40m of promised cash for the massive refurbishment project “at the earliest opportunity”.\nGuy Renner-Thompson, the Conservative candidate for the new Mayor of the North East job, said \"It's sad to see local Labour politicians try to jump on the bandwagon of Government money for the Tyne Bridge, over a year since the announcement was made. I've spoken to senior Government colleagues who tell me the the money for the bridge is there, ready and waiting. The delay has been caused by Labour councils not submitting the required information on time. If Labour MP's want to question anyone, it should be their friends at the council who failed to make this project a priority.\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news/content_19.html": "Guy Renner-Thompson welcomes 'Transformative' new Northumberland College campus in Ashington Wednesday, 5 June, 2024 Plans to build a state-of-the-art college campus in Ashington have been approved by Northumberland councillors. The new campus, comprising of three blocks, will be built on a 5.7 acre site in Wansbeck Business Park. The new buildings will be built to a net-zero specification and will provide teaching spaces for a wide range of courses, including advanced manufacturing and engineering as well as... Articles\nGuy Renner-Thompson comes 3rd in North East Mayor election 3rd May 2024 Guy Renner-Thompson has come 3rd in North East Mayor election. Following the counting of the votes Guy said, \"Thank you to everyone who gave me their votes... Articles\nGateshead F.C failed by Labour council incompetence 22nd April 2024 Gateshead F.C have had their dreams snatched away from them and have been barred from taking part in the National League play-offs after failing to meet the... Articles\nGuy Renner-Thompsons calls for more services at new Berwick Hospital 19th April 2024 Conservative Candidate for North East Mayor, Guy Renner-Thompson, has called for more services at the £35 million new state-of-the-art hospital in Berwick-upon... Articles\nGuy Renner-Thompson sets out his vision in ‘This Is The North’ podcast 15th April 2024 Welcome to ‘This Is The North’ Podcast, your source of transformative conversations. An intentional challenge to the systems holding back the North of England... Articles\nGuy Renner-Thompson welcomes huge investment into Northumberland 15th April 2024 Conservative-led Northumberland County Council have secured a major investment in the county as an agreement has been reached to build one of Europe’s largest... Articles\nTen questions with Guy Renner-Thompson 9th April 2024 Conservative North East mayoral candidate, Guy Renner-Thompson, answers 10 questions about himself and his policies. Ahead of the mayoral election on 2 May, The... Articles\nGuy Renner-Thompson joins the fight to save the Sunderland National Glass Centre 8th April 2024 Conservative candidate for North East Mayor, Guy Renner-Thompson, has pledged to save Sunderland's National Glass Centre following a meeting with local... Articles\nGuy Renner-Thompson says no to Northumberland Lynx release 1st April 2024 The Missing Lynx Project, a partnership between Northumberland Wildlife Trust, The Lifescape Project and The Wildlife Trusts, are running a touring exhibition... Articles\nGuy Renner-Thompson plans to attract Scots to North East over SNP tax rises 29th March 2024 Around 1.5 million Scots with a salary over £28,850 are on course to pay more in income tax from April than if they lived in England as the Scottish National... Articles",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-visits-new-college-durham/content_43.html": "Conservative North East Mayor candidate Guy Renner-Thompson has toured New College Durham.\nNew Collage Durham teaches over 5000 pupils every year and offers apprenticeships, A-levels, T-levels and Degrees.\nGuy said, \"Adult Education and Skills Training are a huge part of my plan for the North East. It was great to be able to tour the collegeand see their amazing facilities. We toured The Copper Pot, T.H.E Hub, and the North East Institute of Technology. It’s fantastic to witness first-hand the innovative work being done and the valuable resources available to students\nWe also discussed how getting better bus links to the college from the community would make access to education easier and would be a priority for me as Mayor.\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_category_Articles/content_40.html": "Guy Renner-Thompson welcomes 'Transformative' new Northumberland College campus in Ashington 5th June 2024 Plans to build a state-of-the-art college campus in Ashington have been approved by Northumberland councillors. The new campus, comprising of three blocks, will... Articles\nGuy Renner-Thompson comes 3rd in North East Mayor election 3rd May 2024 Guy Renner-Thompson has come 3rd in North East Mayor election. Following the counting of the votes Guy said, \"Thank you to everyone who gave me their votes... Articles\nGateshead F.C failed by Labour council incompetence 22nd April 2024 Gateshead F.C have had their dreams snatched away from them and have been barred from taking part in the National League play-offs after failing to meet the... Articles\nGuy Renner-Thompsons calls for more services at new Berwick Hospital 19th April 2024 Conservative Candidate for North East Mayor, Guy Renner-Thompson, has called for more services at the £35 million new state-of-the-art hospital in Berwick-upon... Articles\nGuy Renner-Thompson sets out his vision in ‘This Is The North’ podcast 15th April 2024 Welcome to ‘This Is The North’ Podcast, your source of transformative conversations. An intentional challenge to the systems holding back the North of England... Articles\nGuy Renner-Thompson welcomes huge investment into Northumberland 15th April 2024 Conservative-led Northumberland County Council have secured a major investment in the county as an agreement has been reached to build one of Europe’s largest... Articles\nTen questions with Guy Renner-Thompson 9th April 2024 Conservative North East mayoral candidate, Guy Renner-Thompson, answers 10 questions about himself and his policies. Ahead of the mayoral election on 2 May, The... Articles\nGuy Renner-Thompson joins the fight to save the Sunderland National Glass Centre 8th April 2024 Conservative candidate for North East Mayor, Guy Renner-Thompson, has pledged to save Sunderland's National Glass Centre following a meeting with local... Articles\nGuy Renner-Thompson says no to Northumberland Lynx release 1st April 2024 The Missing Lynx Project, a partnership between Northumberland Wildlife Trust, The Lifescape Project and The Wildlife Trusts, are running a touring exhibition... Articles",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-plans-attract-scots-north-east-over-snp-tax-rises/content_49.html": "Around 1.5 million Scots with a salary over £28,850 are on course to pay more in income tax from April than if they lived in England as the Scottish National Party tax bombshell lands across Scotland.\nRishi Sunak has said the Scottish Budget was “very concerning” and said the SNP had “made Scotland a high tax capital of the UK.” Scotland is to have six income tax bands in 2024/25 compared to three in England. A 42p rate kicks in at earnings over £43,665 while in England it is a 40p rate starting at £50,271.\nThe SNP introduced a 45p rate for those earning more than £75,000 and pushed up the rate for earnings above £125,140 by a penny to 48p. In England the top tax rate of 45p kicks in at £125,140. Nearly 300 Scottish civil servants have been living south of the Scottish border so they can pay lower income tax, according to an Freedom of Information request obtained by the Scottish Tories.\nGuy Renner-Thompson says this represents a golden opportunity for North East England that he wants to seize on if elected the regions first Mayor in the 2nd of May. He said, \"I will target investment from Scottish Businesses, many of whom are actively looking to relocate to the North East to escape the SNP Government and their regressive tax regime. My North East will promote a program to welcome Scottish professionals to the region.\nOil, gas and offshore renewable energy companies are strong sectors off the east coast of Scotland I will target to bring to the North East\"\nSee Guys full plan here - The home of the jobs of the future | Guy Renner-Thompson (guyrennerthompson.uk)",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_contact/content_34.html": "Get in touch with Guy to support our campaign\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-breaks-ground-ps50m-seaton-delaval-super-school/content_32.html": "Work is underway on Northumberland Conservatives latest 'Super School' in Seaton Delaval in South East Northumberland.\nGuy Renner-Thompson, Cabinet member for Inspiring Young People and North East Mayor candidate, led the ceremony with Head Teachers and pupils from Astley Community High School and Whytrig Middle School.\nThe “super-school” is part of Northumberland Conservatives major investment in school facilities across the county and aims to transform education for young people in Seaton Valley for generations to come.\nBAM Construction will deliver the £50m contract that will see the two schools rebuilt on a new shared campus to create a state-of-the-art learning environment for over 1,000 students opening in September 2025.\nSports facilities including a fitness studio, swimming pool and 3G pitch will be available for use by the wider community.\nCllr Guy Renner-Thompson said: “It’s absolutely fantastic to stand here and see the plans for this amazing new super-school start to take shape.\n“This investment in our young people and the wider community will transform education and sports facilities in Seaton Valley for generations to come, bringing wide-ranging benefits to education, health and well-being.\nMy family have lived and farmed in Seaton Delaval for generations. This is the latest mega-project transforming this part of the world and a template for what I want to see across the North East.”",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompsons-calls-more-services-new-berwick-hospital/content_37.html": "Conservative Candidate for North East Mayor, Guy Renner-Thompson, has called for more services at the £35 million new state-of-the-art hospital in Berwick-upon-Tweed.\nThe 21st-century hospital to replace the old infirmary will create 295 full-time equivalent jobs per year during the construction and operational phases, and generate more than £17million to the local economy during the build.\nGuy said, \"It's fantastic to see this investment into Berwick for the replacement hospital. But for too long people in and around Berwick have had to travel all the way to Cramlington or Newcastle for basic hospital treatment, like me when I dislocated my shoulder playing rugby for Berwick RFC.\nAs Mayor I will make sure Berwick gets the best out of its state of the art £35 million new hospital when it’s finished next year. Northumbria NHS Trust has already announced the hospital will include endoscopy and colposcopy services which is good news, but I wan't to make sure we get as many services in there as possible so people can be treated as close to home as possible\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_campaigns_real-help-small-businesses/content_12.html": "The North East is bottom of the league when it comes to small business start ups. Even where we have successful start ups small businesses in the North East are reluctant to scale up and power our economy.\nUnderstanding why our region has fewer small business startups and why our existing small and medium sized businesses are reluctant to grow is key to unlocking an improved performance in this sector.\nMy aim is very straightforward. The North East will be recognised as the best place to set up and grow a small or medium-sized company in the UK. I will do this by making access to finance easier. My own business benefits from the North East Property Fund, a fund backed by our Local Enterprise Partnership to give loans to small businesses which would be overlooked by the high street banks. I will launch a new SME Investment Fund which will give low interest loans to small businesses based in the North East.\nI was on the Coast and Lowlands LEADER grant panel and saw how grants to small and medium sized businesses made a huge difference. Money to invest in buildings, vehicles and equipment led to growth and job creation. I will use the UK Shared Prosperity Fund to launch an SME Grant Scheme that will give out grants of up to £50,000 to small businesses that can show the investment will lead to job creation. Unlike similar schemes before where the criteria was decided by the European Union, my SME Grant Scheme will be open to all job creating small businesses across the region.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_campaigns_education-education-education/content_13.html": "Education is my passion. It is the route to those Tory ideals of aspiration and opportunity, and out of poverty. There is little point in bringing the jobs of the future to the North East if those jobs aren’t filled by local people. If we do not upskill our population to take advantage of the opportunities granted to us by devolution, the whole concept will have been a failure. If we can upskill our region and get household incomes in the North East the same as the South East it will be worth £19 billion per year to the regional economy.\nThe devolution deal gives the Combined Authority an indicative budget of around £1.8bn, or £60m a year, for adult education and skills.\nMy first priority as mayor is to map out the existing adult education across the North East which is currently spread across College's, Councils, Universities and Independent Providers. Once the Combined Authority has a clear understanding of what provision is out there we can begin to work with partners to set up the adult skills courses that are missing in either parts of or the whole region.\nA key part of this work will be liaising with existing businesses on what they require out the workforce that they are not already getting from our existing providers.\nAs the combined authority moves forward, education and skills must be an integrated part of encouraging business into the region. When business is thinking of moving here the first thing I will ask is ‘what training do you need, and how can we help you achieve it’.\nGetting local people into jobs created by new investment in the area will be a silver thread that runs through my entire mayoral strategy for the North East.\nSchools\nNot everybody thrives doing academic subjects, A-levels and GCSE’S. I will focus on practical trades and apprenticeships and will get my skills team into schools as early as possible so students know that those routes are available to them.\nI will lobby government to get the powers of the Regional Schools Commissioner office transferred to the Combined Authority to better link up our strategy for school improvement alongside meeting the needs of employers and industry.\nOur primary schools are high performers. Our secondary schools are much more mixed and outcomes are below national averages. Fewer North East school leavers go on to attend the top performing UK universities compared to other areas of the country.\nI will lobby government for a ‘North East Education Challenge’, copying the London Education Challenge, to give us a wide range of powers and new funding over children’s education.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-says-no-northumberland-lynx-release/content_48.html": "The Missing Lynx Project, a partnership between Northumberland Wildlife Trust, The Lifescape Project and The Wildlife Trusts, are running a touring exhibition on the reintroduction of the lynx to the countryside.\nThe group believes an area including Northumberland and bordering parts of Scotland could support a population of the solitary predator wildcats.\nA previous bid to introduce lynx to Northumberland by the Lynx UK Trust was rejected by the government in 2018. The rejection was welcomed by the National Sheep Association, NFU and NFU Scotland.\nThe latest plans to re-introduce lynx come as the North East gears up to elect its first regional mayor. The new mayor has a raft of new money and powers relating to the economy, transport and housing. The devolution deal also makes the region a 'rural exemplar' with joint working with DEFRA and other government agencies baked into the deal.\nConservative candidate for North East Mayor, Guy Renner-Thompson, who comes from a farming background, said, \"I 100% oppose the reintroduction of lynx to Kielder Forest and if I'm elected mayor I will do everything in my power to stop it. Kielder and the North Tyne Valley are living, working communities, not lives to be experimented on. Lynx are a danger to sheep and other livestock. The same reasons for refusal given 6 years ago stand today.\nI will always stand up for our traditional working communities like I did in successfully opposing the Lindisfarne Highly Protected Marine Area which would have banned fishing and devastated lives on the Northumbrian coast\"\nGuy Renner-Thompson is Vice-Chair of Northumberland Inshore Fisheries Conservation Authority which led opposition to the Lindisfarne HPMA. Controversial plans for the fishing ban at Northumberland's Holy Island were dropped in 2023.\nSee Guys plan for the rural economy here - The home of the jobs of the future | Guy Renner-Thompson (guyrennerthompson.uk)",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_mayor-candidate-guy-renner-thompson-visits-aycliffe-business-park/content_44.html": "Guy Renner-Thompson has joined Sedgefield Paul Howell MP for a tour of Aycliffe Business Park.\nSpread across 400 hectares, Aycliffe Business Park is home to more than 500 companies employing around 10,000 people. Major employers include Hitachi, Gestamp and Husqvarna.\nGuy said \"I’ve hit the ground running on my tour of region, first off to Newton Aycliffe with the Paul Howell and the team discussing the issues important to the area.\nAycliffe Business Park is a perfect example of what can be achieved in the North East. But there is still work to do. Those companies need need proper transport links for employees to get to work. Local people need to be able to access skills and employability training to help them into the jobs of the future. I would use my powers as Mayor to make this a reality with joined up transport, business and education policy.\nDevolution is huge opportunity for the North East. We need to make sure Newton Aycliffe and County Durham gets its fair share\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_about-guy-renner-thompson/content_5.html": "I’m Guy Renner-Thompson and I’m your Conservative candidate.\nThe North East is a region with a proud history. Celts, Romans, and Vikings. The Cradle of Christianity, The Dukes Of Northumberland and the Prince Bishops of Durham. The home of the Industrial Revolution and the Welfare State. The North East has been leading Britain for centuries.\nOur new Devolution Deal, delivered by your Conservative Government, is the next chapter in our long story. The deal unlocks £4.2 billion of investment and transfers power from Whitehall to local leaders with real knowledge of what our communities need and want.\nI am one of those local leaders. I was born here. Went to my local school here. Run my construction business here. I will always stand up for the North East like I’ve stood up for Bamburgh, the community I was elected to represent in 2017. My family have lived and worked around Blyth and Whitley Bay for generations.\nThe Government expects the deal will create 24,000 extra jobs, create 70,000 skills courses to get people into good jobs and leverage £5.0 billion of private sector investment. But I know we can do better than that.\nI’m a Conservative because I know our party is the party of aspiration and opportunity. The party of the hand up, not the handout. The party of hard-working people who want to be able to own their own house, send their children to a good school and live in a safe neighbourhood. And for too long the Labour Party has failed those people in the North East and taken the region for granted.\nAs the Councillor responsible for education in Northumberland I’ve overseen our schools climbing the league tables. Under Labour in 2017 only 76% of schools were being rated ‘Good’ or ’Outstanding’. Now that figure is 95%. I’ve started employer forums and opened world-class manufacturing training facilities, which industry leaders have said are the best training facilities in the country. I want to expand this upgrade in education across the region.\nOur region is unique. Deep water ports give our industry access to the world. Our universities are global leaders in their fields. Our beautiful countryside helps feed the nation and attracts millions of visitors every year.\nBut there is still work to do. I am a proven local politician with a track record of improving lives. I can lead the North East into a thriving future to live, work and raise a family.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_ten-questions-guy-renner-thompson/content_29.html": "Conservative North East mayoral candidate, Guy Renner-Thompson, answers 10 questions about himself and his policies.\nAhead of the mayoral election on 2 May, The Chronicle asked all six candidates the same 10 questions to give voters a sense of both their policies and their personalities.\nTory candidate Guy Renner-Thompson has his say on creating jobs, his favourite pubs, and improving school standards.\nWhy should people care about the North East mayoral election?\nThe North East has been leading Britain for centuries. Our new devolution deal, delivered by our Conservative government, is the next chapter in our long story. The deal unlocks over £4.2 billion of investment and transfers power from London to local leaders like me with real knowledge of what our communities need and want. The mayor will have massive powers over taxes and spending on important areas like transport, housing and the economy. But just as importantly they will be the figurehead for the region who will travel the world touting for business for the North East.\nIf you could do one thing as mayor to improve people’s lives, what would it be?\nJobs, jobs and more jobs. There is no better way out of hardship for families than secure, well-paid employment. The devolution deal is 48 pages long but it can be summed up in four words. Make. North. East. Richer. My whole plan revolves around making the region the home of the jobs of the future. We’ve seen the Tees Valley under Ben Houchen power ahead of the rest of the North East in jobs growth. We need a strong leader too who will focus our economy.\nWhat is your favourite place in the North East, and why?\nAny pub that sells Guinness. The people are the best thing about the North East and there is nothing I love more than sitting in a pub on a weekend with friends or strangers putting the world to rights.\nWhat is (or was) your day job outside of politics?\nI have my own small building company. I started it in 2019 doing house renovations and now we’re building new-build homes. I project manage and jump on the tools when needed but as we get bigger, I rely more and more on the fantastic self-employed tradesmen we have in the region. Being self employed means I’m lucky enough to have the time to take part in politics, and it shapes my policies like grants for small businesses and being against the Clean Air Zone charges.\nWhat is your proudest achievement in your political career so far?\nAs the councillor responsible for education in Northumberland I’ve overseen our schools climbing the league tables. When we took over the council from Labour in 2017 only 76% of schools were being rated ‘Good’ or ’Outstanding’. Now that figure in 95%. I’m really proud of this because a good education is the foundation for young people to have a good start in life and, in some cases, break the cycle of families who might have been on benefits for more than one generation.\nOther than becoming the North East Mayor, what would your dream job be?\nI spent my teenage years in the Army Cadets and I always wanted to go into the Army or the Royal Navy. Unfortunately I was diagnosed with Crohn’s disease when I was 17 which scuppered that. I love travelling, so my dream job now would be a pilot or a ship’s captain.\nWho is your role model in life?\nMy dad.\nIf you could ban one thing in the North East, what would it be?\nI don’t like banning things, people should be allowed to get on without endless preaching about how they should live their lives. I will always take more powers from London but never seek to take them away from people and their local communities.\nIf you could erect a statue somewhere in our region, who would it commemorate?\nSir John Hall. To be the son of a miner from Ashington to go onto build the Metrocentre and own and be a driving force in Newcastle United. That makes him a role model for young boys and girls across the North East that says we can be successful and make it in the world.\nIf you didn’t win the mayoral election, which of the other candidates would you most like to win?\nNone of the above. Only I have the plan and vision to push the North East forward and realise our full potential.\nCredit to Dan Holland - North East mayor election: 10 questions for Conservative candidate Guy Renner-Thompson - Chronicle Live",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-welcomes-north-east-culture-showcase-no-10/content_30.html": "The Laing Art Gallery in Newcastle has been chosen as the new ‘Number 10 Museum in Residence’.\nNine artworks the gallery will be on display at Number 10 Downing Street for one year and will be seen by VIPS from around the world, showcasing art and heritage from across the North East.\nConservative Candidate for North East Mayor Guy Renner-Thompson said, \"It is fantastic news that artwork from the Laing in Newcastle has been chosen as the new 'Number 10 Museum in Residence’ with North East paintings hanging for the Prime Minister and his esteemed guests from the UK and abroad\"\nThe first thing visitors to No 10 will see after walking through the famous front door is a huge portrait of the Tyne Bridge under construction. Great promotion for our region and its history, and well timed with restoration already underway after the Government announced £35 million to complete the work!\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_ourplan/content_20.html": "In the Devolution Deal the Mayor has the power to set a precept on council tax to fund mayoral functions and to ask to charge a business rate supplement.\nThe Labour Party and their candidate are already dreaming up new ways to add to the region’s tax burden.\nGetting the region moving on cheap and reliable public transport is good for residents and businesses alike.\nOur Devolution Deal includes a city region sustainable transport settlement of up to £563 million.\nA North East Mayoral Development Corporation will be created to bring our employment and housing sites to life. It will champion business acting as a gateway to investors and push our region’s talent and capability to a global audience.\nEducation is my passion. It is the route to those Tory ideals of aspiration and opportunity, and out of poverty. There is little point in bringing the jobs of the future to the North East if those jobs aren’t filled by local people.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-promotes-taster-sessions-be-held-northumberland-skills-blyth-welding-and/content_15.html": "Two free taster sessions will be held to encourage young people in Northumberland to enrol in engineering and manufacturing courses.\nCouncil-run post-16 education provider Northumberland Skills is hosting a welding taster and a renewables engineering taster for young people aged 15 and above to spread the word about its courses starting in September.\nBoth events will be held at the Welding and Fabrication Technical Training Centre at the Port of Blyth and will cover courses at the venue and the under construction Energy Central Learning Hub next door.\nBoth sessions run from 10am to 1pm on Saturday, March 16.\nRichard Waterston from Northumberland Skills said: “If becoming an engineer in the renewables sector is something you want to explore when you leave school, or if you have recently left school and are looking for a new direction, these taster days are a great way to find out more from our team of lecturers.”\n“As well as taking a tour of our Welding and Fabrication Technical Training Centre, you will also be able to find out more about our new campus at Energy Central Learning Hub, where we will be training the next generation of power engineers, maintenance experts, and technicians.\n“Young people can attend with or without their parents. If parents do want to stay, they can enjoy a free cuppa and ask our experienced team of lecturers about our school leaver courses and future career opportunities.”\nCllr Guy Renner-Thompson, Northumberland cabinet member for education and conservative candidate for North East Mayor added: \"We hope these taster days will ignite a spark of enthusiasm for young people, giving them an insight into the many opportunities careers in this rapidly expanding sector can bring.\nAs mayor this is the template I want to expand across the North East. Bring the job of the future in green energy and manufacturing but making sure those jobs are filled with home grown talent”\nTaster sessions take place on Saturday 16th March 2024, 10am-1pm.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_accessibility/content_16.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_work-gets-underway-ps39m-amble-schools-masterplan/content_26.html": "Northumberland County Council is investing £39m into the Coquet Partnership of schools as it prepares to move from a three to a two-tier system from September 2024.\nIn the first phase of the wider masterplan, the former Amble Middle School site on South Avenue will be redeveloped into two new schools.\nAmble First School will expand and relocate to become the 210-place primary school along with a 26-place nursery.\nBarndale House School will open a new 50-place satellite site called Barndale-by-the-Sea for pupils with special educational needs including autism; social and emotional mental health; speech, language and communication, and moderate learning difficulties.\nCllr Guy Renner-Thompson, Cabinet member for Inspiring Young People and North East Mayor candidate, said: “It is fantastic to reach this milestone and to see our ambitious plans for Amble schools taking shape.\n“We’re investing in education right across the county so that all our young people can have access to the right education for them as close to home as possible.\nThis is the sort of ambition I want to expand across the North East if I'm elected on May the 2nd”",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_campaigns_conservative-party-conference-north-east/content_2.html": "Guy Renner Thompson has pledged that if elected he will bring the Conservative Party Conference to the North East in his first term.\nGuy, who is campaigning to become the first North East Mayor said, “Newcastle & Gateshead together have exactly what it takes to host the country’s biggest party conference. The work on the new Gateshead Quayside arena which is backed up by government levelling up funding helps create an ideal location when coupled with the Sage, Baltic and many fantastic hotels which can be found on both sides of the Tyne.\nThe Conservative Party Conference currently alternates between Manchester and Birmingham and when it’s in town brings anything up to £20m to the local economy. Bringing it to the true North would help a short in the arm to our visitor economy. It would show we can host huge set piece conference events and importantly will allow me as Mayor to showcase our region and get its priorities pushed up the national political agenda.”\nThe Conservative Party conference is a four day event which happens every October. It attracts around 12,000 attendees.\nHave your say on his plan here.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk/content_1.html": "No Mayoral tax rises A public transport plan Latest news Guy Renner-Thompson welcomes 'Transformative' new Northumberland College campus in Ashington Plans to build a state-of-the-art college campus in Ashington have been… Guy Renner-Thompson comes 3rd in North East Mayor election Guy Renner-Thompson has come 3rd in North East Mayor election. Following the… Gateshead F.C failed by Labour council incompetence Gateshead F.C have had their dreams snatched away from them and have been… Backing the motorist The home of the jobs of the future Find me on Facebook Real help for small businesses Education. Education. Education\nGuy Renner-Thompson welcomes 'Transformative' new Northumberland College campus in Ashington Plans to build a state-of-the-art college campus in Ashington have been…\nGuy Renner-Thompson comes 3rd in North East Mayor election Guy Renner-Thompson has come 3rd in North East Mayor election. Following the…\nGateshead F.C failed by Labour council incompetence Gateshead F.C have had their dreams snatched away from them and have been…",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_cdn-cgi_l_email-protection/content_50.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_feed/content_41.html": null,
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_events_feed/content_31.html": null,
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_labour-failure-shields-ferry/content_27.html": "The Shields Ferry is a vital link across the Tyne between North and South Sheilds, but over a decade of local labour party failure means its future is in doubt.\nThe existing north landing is expected to fall into an unusable condition in 2025. Labour leaders have so far failed to build a replacement terminal closer to the North Shields Fish Quay.\nConservative mayor candidate Guy Renner-Thompson has pledged to use the transport powers and funding that the regional mayor will hold following the agreement of a new, multi-billion pound devolution deal for the North East. The deal includes an initial five-year City Region Sustainable Transport Settlement (CRSTS) of up to £563m available to be spent up to 2027.\nGuy said \"Sheilds Ferry is an integral part of our transport system and as Mayor I would guarantee its future by allocating funding to a ferry terminal in North Sheilds. Building a new ferry terminal is certainly a lot cheaper than a tunnel!\nLabour, who control both North and South Tyneside councils, have failed local people with dither and delay on this project for far too long. They can't be trusted to deliver important infrastructure projects across the region\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_campaigns_backing-motorist/content_8.html": "78% of all miles travelled are by car, more in our vast rural areas. My plans will never penalise the motorist with low traffic areas or “Clean Air Zones” which just line the pockets of local councils.\nI will prioritise key road duelling and junction upgrades and will make the case for the upgrading of A19 junctions North of Newcastle (particularly Moor Farm roundabout and associated work at Seaton Burn and White Mare Pool), full A1 dualling and will press for further work to improve the safety, capacity and speed of the A69. I will put £100 million into fixing potholes on our current road network.\nAll of my transport projects will recognise the importance of car travel and any developments that hinder car access to our cities will be discouraged.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_privacy/content_3.html": "This document outlines how Guy Renner-Thompson processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Guy Renner-Thompson\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Guy Renner-Thompson.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Guy Renner-Thompson, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Guy Renner-Thompson via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_campaigns_public-transport-plan/content_35.html": "Getting the region moving on cheap and reliable public transport is good for residents and businesses alike.\nOur Devolution Deal includes a city region sustainable transport settlement of up to £563 million. This settlement can be used to develop mass transit networks and sustainable transport options, open up new areas of the region for employment, leisure and housing, and create real innovation in transport to solve problems. The Deal also includes £73.8 million of capital funding and £89.8 million resource funding to deliver the combined Bus Service Improvement Plan for the North East.\nBuses\nBuses are a vital part of our transport network. The Devolution Deal gives the Mayor the power to franchise buses to take control of routes are fares. In week one of being elected I will launch a region wide review with bus companies, schools, colleges, large employers, councils and communities to find and fill the gaps in the bus network. I will work with bus companies and councils to fill those gaps.\nI will mandate that live digital timetables are installed at bus stops, linked with GPS trackers on the buses, so just like the Tube in London travellers know exactly when the bus is coming.\nRail\nI will lead a railway renaissance in the North East. I’ve seen firsthand how our local Conservative team can deliver new rail services with the new Northumberland Line running from Newcastle to Ashington.\nI can do the same with the Leamside Line which runs from Gateshead to County Durham. Re-opening Leamside will enable parts of the region – who have no access to rail – to be connected with Newcastle, Sunderland and Teesside, as well as with significant employers like Nissan and Amazon.\nThe East Coast Main Line runs down the spine of the region, but the priority has been fast trains between London and Edinburgh at the expense of local stopping services. I will prioritise a regular stopping service north of Newcastle calling at all stations including a re-opened Belford station. By investing in passing loops we can have a local service without compromising on intercity connectivity.\nThe Northumberland Line passenger service will be extended with a station at Newbiggin-by-the-Sea and the potential for a station at Lynemouth to support the development of the former Alcan Aluminium Smelter site.\nI will work with the Government on the business case for heavy rail services to Newcastle Airport, upgrades to the Tyne Valley and Durham Coast lines; new rail services between Newcastle and Consett, and major investments in Sunderland and Newcastle Central stations.\nMetro\nOur government is currently providing £337 million of funding to Nexus to support the £362 million introduction of a new Metro train fleet and maintenance depot, expected to be fully implemented by the end of 2024. I will continue to invest in the Metro to make it safer, cleaner, and greener.\nI will expand the metro with the Washington Metro Loop. The 13·5 km loop would link the existing Tyne & Wear Metro stations at Pelaw and South Hylton via Washington, serving the UK’s ’fourth largest town without access to a rail service’. I will also seek expansion to Cobalt Business Park and Team Valley, the Metro Centre, and lengthening the line at Newcastle Airport into Ponteland.\nFerry\nThe Shields Ferry is a vital link across the Tyne between North and South Shields, but over a decade of local labour party failure means its future is in doubt. The existing north landing is expected to fall into an unusable condition in 2025. Labour leaders have so far failed to build a replacement terminal closer to the North Shields Fish Quay.\nI will guarantee its future by allocating funding to a ferry terminal in North Shields.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-comes-3rd-north-east-mayor-election/content_10.html": "Guy Renner-Thompson has come 3rd in North East Mayor election.\nFollowing the counting of the votes Guy said, \"Thank you to everyone who gave me their votes yesterday. I came 3rd with 52,446 votes. Enough to fill St James’ Park!\nCongratulations to Kim McGuinness for her victory. I look forward to working with her on taking the North East forward with the new North East Combined Authority\"",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_guy-renner-thompson-wants-north-east-become-uk-capital-innovation/content_23.html": "The North East has all the right ingredients to become the country’s ‘capital of innovation’, the Conservative candidate to become North East mayor has said.\nAnd Guy Renner-Thompson says he will champion the region as a world leader in digital technologies, pharma and life sciences and automotive and advanced manufacturing.\n“The North East is absolutely the right place to lead the way and become a capital of innovation, our part of the world is already at the forefront in a range of specialisms including advanced manufacturing, digital technology and life-sciences. Newcastle was recently described as the smartest city in the UK and one of the smartest in the world.\n“We have the brains here to lead the way, and if I become Mayor, I will make it my mission to ensure everything is in place to continue to be world leaders. I will intervene to boost existing and future economic clusters and I’ll be an ambassador for the area at home and abroad. I want to the world to see we have some of the brightest minds living and working here and some of the country’s most innovative and exciting companies working on groundbreaking technologies across a wide range of industries.\nI will go out and encourage more of those companies and people to bring their talents to the North East, as well as producing our own, to the benefit of everyone living and working in the region. It is clear to me the North East should become the UK’s capital of innovation.”\nGuy was speaking after a meeting with the Secretary of State for Science, Innovation and Technology, Michelle Donelan MP, who visited Wooler in Northumberland as part of the Government’s Project Gigabit roll-out.\nShe said “I’m really excited about Guy’s plans to boost the local economy and drive forward innovation. The North East is an area of the country which has so much potential and that could be realised if the energy and enthusiasm demonstrated by people like Guy is unlocked.”\nPhoto - Secretary of State for Science, Innovation and Technology, Michelle Donelan, left, talking to Conservative North East mayoral candidate, Guy Renner-Thompson",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_news_government-investing-ps35-million-protect-iconic-tyne-bridge/content_24.html": "The Government is investing £35 million to protect the iconic Tyne Bridge.\nToday, Roads Minister, Guy Opperman, confirmed that the Tyne Bridge will undergo an extensive renovation programme, alongside major improvements on the Central Motorway East (CME) A167 to tackle congestion and improve journey times in and out of Newcastle.\nThis is part of the government’s Network North plan which will improve local transport across the North East, with today’s announcement following our record £544 million in funding for a long-term plan to resurface local roads across the North East.\nEvery penny of the £19.8 billion committed to the Northern leg of High Speed 2 (HS2) will be reinvested in transport across the North.\nWith the centenary of the bridge’s opening approaching in 2028, the investment will safeguard the iconic structure for future generations and help grow the economy in Newcastle and the North East.\nGuy Renner-Thompson, Conservative candidate for North East Mayor, said \"This is a fantastic day for Newcastle, Gateshead, and the North East. The Government has delivered on its pledge as soon as the information was given by local councils. This is further proof the Conservatives are committed to the North.",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_cookies/content_4.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_guyrennerthompson_uk_/https_www_guyrennerthompson_uk_campaigns_no-mayoral-tax-rises/content_45.html": "In the Devolution Deal the Mayor has the power to set a precept on council tax to fund mayoral functions and to ask to charge a business rate supplement.\nThe Labour Party and their candidate are already dreaming up new ways to add to the region’s tax burden. The Conservative Party utterly reject the idea that what the region needs more of is unnecessary new taxes.\nWe will sign a pledge alongside any other candidate in the election who wishes to state that we will never increase the existing tax burden by introducing more taxes for residents or businesses."
}