{
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_cdn-cgi_l_email-protection/content_13.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_news_paignton-post-office-campaigners-react-franchise-announcement/content_11.html": "Local campaigners against the closure of Paignton Post Office have today (Wednesday 9th April 2025) pledged to continue their campaign until a final decision is made on its future.\nTheir comments followed the Post Office announcing it is moving to a fully franchised network as part what it calls a ‘New Deal for Postmasters.’\nThe Post Office announcement means the last 108 Directly Managed Branches which are operated by the Post Office, including Paignton, will be franchised by the autumn. As a result, the Post Office will no longer directly run branches, although it states it will maintain its commitment to meeting the current requirement to have a minimum of 11,500 branches across the UK.\nThe 1,000 staff who work in the Post Offices affected, including Paignton, will be offered a choice of moving to work for any new owner of their branch or taking voluntary redundancy.\nThe Post Office expects most to be franchised in their existing locations, although it states some may move to locations “nearby”, yet no details of the plans for Paignton Post Office have been confirmed. The Post Office has indicated further details on proposals for individual branches, including Paignton, will be shared with local communities and “stakeholders” in the coming weeks.\nThe Post Office states it will work with franchise partners with “a clear track record of successfully running Post Office services”. Yet given the potential uncertainty around the future of WH Smith, whose high street operations including their Torquay & Paignton Branches were recently sold, it is unclear what this will mean in practice.\nKevin Foster said:\n“This announcement still leaves many questions to be answered about the future of Paignton Post Office, especially for the dedicated staff who now face moving to a new employer or redundancy. Certainty is needed quickly for a much-valued service which lies at the heart of Paignton Town Centre.”\n“The Post Office remains publicly owned, but these changes mean all Post Office counter services will, in future, be operated by the private sector.”\nOver 800 people signed a petition organised by Peter Middleton and Kevin Foster.\nOther Post Offices in Paignton, Torquay and Brixham are not affected by this announcement. They are mostly small businesses owned by a sub-postmaster who provides Post Office services. Campaigners are urging residents to continue supporting and using them, alongside the Paignton Crown Post Office.\nRoyal Mail’s Paignton delivery office, located next to Paignton Crown Post Office, is also not affected by this announcement.",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_events_feed/content_8.html": null,
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_pledge-honoured-final-fosters-fund-grants-paid-out/content_6.html": "Seven local good causes have received a boost with awards totalling £3,500 to support their work, after the final round of donations from Foster’s Fund, a scheme set up by Torbay’s former MP Kevin Foster.\nFoster’s Fund is based on a pledge made by Kevin when he was first elected to parliament in 2015. He pledged to not only oppose the 10% pay rise proposed for MPs at the time, but to reject it via donations to local charities if IPSA implemented it despite his objections. Kevin renewed this pledge at the last General Election in December 2019 and promised to continue Foster’s Fund until the end of the last parliament.\nOver the last 9 years this pledge has seen over £60,000 donated to local charities working in Torbay via Foster’s Fund.\nAs Kevin was not re-elected, he made a final round of donations to fulfil the pledge made in 2019 and clear the outstanding balance in the Charity Account. The final round of awards saw the following donations made:\n1. Catholic Children’s Society (£500) – For work supporting vulnerable children.\n2. 10th Torbay (Babbacombe) Sea Scouts (£500) – Replacing 20 buoyancy aids for sailing and kayaking.\n3. Pheonix Rising (£500) – Support for domestic and sexual abuse victims.\n4. Babbacombe & St Marychurch Local History Society (£500) – A new projector to help promote interest in local history.\n5. Torbay Prostate Support Association (£500) – Work to raise awareness and provide support.\n6. Hector’s House Cat Rescue (£500) – Washing machines to support pens at the new cat rescue centre.\n7. Swim Torquay Ltd (£500) – To purchase a new laptop need for administration work.\n(Some of the cheques were made payable to Torbay Community Development Trust who are supporting the projects of the group concerned. This is because payments from Foster’s Fund must be made into the bank account of a registered charity.)\nProjects funded by the final round of donations included a new projector for history talks, work to raise awareness of prostate cancer, washing machines to support new cat pens, replacing 20 buoyancy aids and support for domestic abuse victims.\nKevin Foster said: “When I first made this pledge, it was part of doing things differently and not just taking the pay rise being implemented when I had known the salary for the job when I was first selected to stand in 2013.”\n“Over the last 9 years dozens of groups and good causes have benefitted from Foster’s Fund, with lots of work done to make a difference. This final set of awards will make a difference for a range of good causes in our bay and fulfils the pledge I made in 2019.”\nFoster's Fund is now closed and no new applications can be made for funding from it.",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_campaigns_save-paignton-post-office/content_7.html": "The Post Office has announced 115 Crown Post Offices could close, including Paignton’s Crown Post Office.\nCrown Post Offices are owned and run directly by the Post Office, with Paignton’s located next to a Royal Mail Delivery Office (Which is not affected by this announcement). The full range of Post Office services are available at them. Nearly 1,000 Post Office staff work at the 115 affected branches. The Post Office is owned by the Government, so Ministers will consider the plan.\nWhilst the announcement indicates other franchising options may be looked at, local campaigners are concerned at the potential loss of a facility valued by many and the helpful team of staff who work there. The news comes despite the Post Office expanding its work into areas like banking hubs and the growing demand for online retail and supported access to digital services.\nA petition has been launched opposing the closure and demanding other options are considered, which you can sign below. It will be presented to the Post Office ahead of any decision on the future of Paignton Post Office. Other post offices in Torbay are not affected by this announcement and residents are encouraged to continue supporting them alongside the Crown Post Office in Torquay Road, Paignton.\nWe the undersigned oppose the proposal to close Paignton’s Crown Post Office and call for alternatives to be considered which would enhance the services provided.",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_campaigns/content_9.html": "Save Paignton Ambulance Station 🚑 A petition has been launched to Save Paignton's Ambulance Station and calling for an alternative site to be found, after it was revealed it must move from its current location.\nSave our local pubs Labour's War on Pubs Will Close Your Local Labour's pub tax hike will force landlords to raise prices or shut their doors for good. £1,000s extra in business...\nSave Paignton Post Office A petition has been launched opposing the closure of Paignton Post Office and demanding other options are considered.\nTorbay Hospital Rebuild Must be Delivered Before the recent General Election there had been cross-party support for the delivery of this project and suggestions a change of government would threaten it were dismissed by those arguing for one. Now we must make clear the promises made to local people should be honoured, not dismissed or denied.\nPerformance of South West Water Delivering the work needed to get all our beaches to “Excellent” water quality ratings by 2030 was the focus for Kevin Foster MP's speech in a debate on the...\nGaza SNP Motion The way yesterday’s debate (21/02/24) was handled did not reflect the gravity of the issues being debated and I will briefly explain what occurred. As you may...\nEdginswell Station Survey A good local transport network is more than just a way to get around, it is the key to unlocking new jobs, growing the economy and a better standard of living...\nPost Office (Horizon) Scandal Kevin Foster MP comments on the Post Office Scandal: Whilst I have not had chance to watch the ITV programme myself, I am aware of the appalling treatment of...\nPensioner and Childcare Support Guides Kevin has produced two short guides covering issues commonly raised with him and his team, namely support for Childcare and Pensioners.\nRemoval of Palm Trees in the Italian Gardens A number of residents and local businesses have contacted Torbay's MP Kevin Foster in the last 24 hours, voicing concern at the culling of between 30-40 palm...\nVote ceasefire in the conflict between Israel and Hamas. For clarity the Speaker only selected motions R (Leader of the Opposition) and H (SNP Motion) for debate and vote on the King’s Speech. The human cost in Israel...",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_contact/content_3.html": "Kevin is really keen for you to get in touch, you can contact him by email or phone via the details listed.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com/content_1.html": "Campaigns\nLatest News\nContact Kevin Foster\nConstituency Office\nTorquay Central Conservative Club, Hill Gardens, 226 Union Street, Torquay, TQ2 5QS\n01803 557753\nI'm Kevin Foster, a campaigner and former Member of Parliament for Torbay. On this website you can find my latest news, campaigns and more about me, including how to get in touch.",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_privacy/content_5.html": "This document outlines how Kevin Foster processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Kevin Foster\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Kevin Foster.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Kevin Foster, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Kevin Foster via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_news_category_Articles/content_12.html": "New Measures to Support Health and Wellbeing as Women’s Health Strategy Celebrates First Anniversary 25th July 2023 Torbay’s MP, Kevin Foster, has welcomed the announcement of new measures to support the health and wellbeing of women and girls, includes taking action to... ArticlesLocal News\nCommunity Organisations Invited to Bid for Life-Saving Defibrillators 28th June 2023 £1 million fund to increase the number of AEDs in public places where they are most needed. Funding will provide an estimated 1000 new defibrillators in... ArticlesLocal News\n£403K Torbay Bus Funding Boost as £2 Fare Cap Extended 17th May 2023 £2 bus fare extended until 31 October to help passengers with cost of living and then £2.50 until November 2024. £403,923 of additional funding for Torbay... ArticlesLocal News\nKevin joins Dogs Trust to urge the Government to bring back the Kept Animals Bill 11th May 2023 Dogs Trust recently welcomed Kevin Foster MP to an event at the House of Commons, to raise awareness of the urgency to progress the Kept Animals Bill which... ArticlesLocal NewsWestminster News\n£2.4m Torbay Household Support Fund Extension Goes Live 3rd April 2023 Department for Work and Pensions’ £842 million Household Support Fund extension came into effect on 1st April, including a further £2.4 million of funding for... ArticlesLocal News\nEaster Boost For 5 Good Causes as Foster’s Fund Pays Out 2nd April 2023 Five local good causes have received an Easter Boost as awards totalling £2,350 to support their work, after the latest round of donations from Foster’s Fund, a... ArticlesLocal News\nAnti-Social Behaviour Action Plan 27th March 2023 Local MP Kevin Foster met this week with a major local retailer in Torquay, to discuss anti social behaviour including persistent begging and shop lifting in... ArticlesLocal NewsSpeeches in Parliament\nFinally……Crossways Demolition Contractor Agreed! 20th March 2023 Torbay’s MP Kevin Foster has today (Monday 20th March 2023) welcomed news Torbay Council has finally agreed a demolition contractor for Crossways Shopping... ArticlesLocal News\nEnergy Support for the Tourism and Hospitality Sectors 28th February 2023 Local MP Kevin Foster asked today in Parliament about Government plans to support the energy reliant tourism and hospitality sectors after April this year. You... ArticlesLocal NewsSpeeches in Parliament",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_campaigns_post-office-horizon-scandal/content_10.html": "Kevin Foster MP comments on the Post Office Scandal:\nWhilst I have not had chance to watch the ITV programme myself, I am aware of the appalling treatment of the sub-postmasters who were wrongly accused of theft based on flawed evidence from the Horizon IT system. Victims' accounts of the impact of these prosecutions are harrowing: some served prison sentences; many had their livelihoods and life savings decimated; marriages broke down; four committed suicide; others passed away before being able to clear their names; and many were ostracised by their local communities and as a result failed to find alternative work.\nThe scandal itself occurred before my time in Parliament, but I congratulate my former colleagues, like Lord James Arbuthnot, and current colleagues including Kevan Jones MP and Nadhim Zahawi MP (Who played himself in the ITV drama) who supported those affected and helped bring this scandal to light. This contrasts to the actions of Sir Ed Davey, who as then Postal Services Minister, refused even to meet Alan Bates to hear his case.\nYesterday (08/01/2024) the Government gave a statement to the House of Commons, which you can watch by following the link below:\nThe Minister giving the statement had, as a Backbencher, campaigned on behalf of Sub-Postmasters affected, so is acutely aware of the need to make rapid progress. Two hours of questions followed.\nIn terms of further debates in the House of Commons, as a Member of the Backbench Business Committee, I know myself and other members of the Committee would be very happy to consider applications for a debate on this matter in order to allot some of the time available to us. There was also a full day's debate on compensation for those affected by this scandal held in the House of Commons on Tuesday 19th December 2023.\nWhilst many convictions based on flawed Horizon evidence have already been overturned, I welcome moves to look at how this can be done on a larger scale, as has been done since 2015 with convictions from past decades based on now repealed homophobic laws. The ability of the Post Office to prosecute cases itself should also be reconsidered, independent review of files by the CPS or Police may have helped bring this scandal to an end much sooner. Although this is almost certain to be a point the inquiry I mention below will cover.\nI am aware nobody at either the Post Office or Fujitsu has been held directly accountable so far, yet I fully agree with the sentiments of my friend and colleague Priti Patel MP (Her Dad was a Sub-Postmaster) writing in The Sun. You can read her thoughts by following this link:\nhttps://www.thesun.co.uk/news/politics/25252343/priti-patel-subpostmaster-itv-punish-bosses/\nThe Government has placed a public inquiry into the scandal on a statutory footing, which allows its Chair, Sir Wyn Williams, the necessary powers and time to conduct an in-depth analysis of the decision-making processes led to the scandal. Sir Wyn has already publish his interim report on Compensation, and my ministerial colleagues will provide a formal response shortly. You can read Sir Wyn’s interim report here:\nhttps://www.postofficehorizoninquiry.org.uk/interim-report-compensation-17-july-2023 .\nThe Post Office (Horizon System) Compensation Bill, which cleared the House of Commons on Tuesday 19th December, will ensure the trailblazers who exposed the scandal do not miss out on compensation because of an arbitrary deadline. I understand the Government is determined to make compensation claims as soon as possible, and by the current deadline of August 2024. However, time needs to be taken to assess more complex claims, so postmasters receive full and fair compensation and are not unduly rushed into making a decision on their claims. The UK Government has also announced every Postmaster who was wrongfully convicted and has had their conviction overturned as it was reliant on Horizon evidence will be offered an optional sum of up to £600,000 in compensation.\nAll reasonable legal fees will continue to be covered and any Postmaster who does not want to accept this offer can continue with the existing process. Those postmasters who have already received initial compensation payments or have reached a settlement with the Post Office of less than the £600,000, will be paid the difference to ensure they don’t lose out.\nIn total, £132 million has been paid to over 2,700 claimants across the Horizon Shortfall Scheme, Overturned Convictions Scheme and Group Litigation Order scheme.\nFinally, all those involved with this scandal at a senior level in the Post Office should not retain any honours they received due to their role given the damage done to the service and those affected. It is therefore right Paula Vennells returned her CBE, but it should not have taken the recent ITV Drama to shame her into doing so.",
  "https_www_kevinjfoster_com_/https_www_kevinjfoster_com_campaigns_saveourlocalpubs/content_2.html": "Labour's War on Pubs Will Close Your Local\nLabour's pub tax hike will force landlords to raise prices or shut their doors for good.\n- £1,000s extra in business rates per pub\n- £800 extra per worker in National Insurance\n- Higher pint prices for everyone\n- Landlords forced to police conversations that could offend\n- Making pubs no go zones for smokers"
}