{
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_about-richard/content_5.html": "My Background\nI was born in Bedford and raised and educated locally before attending Oxford University, where I earned my BA and I later completed an MBA at Harvard Business School.\nReal World Experience before becoming an MP\nBefore entering Parliament, I was a partner at the strategy consulting firm LEK Consulting and a founding partner at Investcorp's venture capital group.\nMy business career includes helping start numerous small businesses and working in Australia, the United States, the Philippines, and South Korea. Between 2017 and 2019, I chaired an educational technology company.\nMy passion for creativity, innovation, and the potential of start-ups and small businesses drives my commitment to putting this broad experience to work in Parliament.\nMy Roles in Politics\nI served as the Member of Parliament for Bedford from 2010 to 2017 and was elected as the MP for North East Bedfordshire in December 2019 and re-elected as the MP for North Bedfordshire in 2024. I have been a member of the Business, Energy and Industrial Strategy Select Committee and, briefly, the Public Accounts Committee. I served as Economic Secretary to the Treasury from July to October 2022 and from July to October 2024 I was the Interim Chairman of the Conservative Party. I am currently the Shadow Chief Secretary to the Treasury.\nAn Accessible Member of Parliament\nI take the concerns of local residents seriously, and I believe it is essential to understand your views to provide effective representation in Parliament. In the December 2019- May 2024 Parliament, I held 220 in-person and online/telephone surgeries, averaging four per month, along with 24 Town Halls since Covid restrictions were lifted and dealt with over 30,000 casework, policy, and campaign queries. I continue to dedicate myself to addressing key issues affecting our community.\nA Strong Local Voice\nOne of my significant campaigns has been about the East West Rail project. I have consistently advocated for the interests and concerns of residents, pressing for the best outcomes regarding environmental impact and community benefits. I have opposed the plans in their current form, recognising that the consultation held by East West Rail was neither comprehensive nor transparent. I remain committed to keeping residents informed and engaged on this critical issue.\nAchieving Real Change on Matters that Concern You\nIn May 2024, a major milestone was achieved with the passing of the Leasehold and Freehold Reform Act 2024. This legislation, which I championed following concerns raised with me by constituents, tackles unfair practices in freehold estate management charges, providing more rights and protections for homeowners.\nI also introduced the Hare Coursing Bill, targeting the cruel and illegal practice of hare coursing. This bill received strong support and underscores our commitment to animal welfare and rural crime prevention. The Government adopted my proposals in full, incorporating them into the Police Crime Sentencing and Courts Act 2022.\nRecognising the importance of sustainable development, I have been actively involved in discussions and actions concerning solar farm proposals in North Bedfordshire. My focus has been on balancing the need for renewable energy with the preservation of our beautiful countryside, ensuring that local voices are heard in planning processes.\nAddressing environmental concerns, I have worked on issues related to wastewater overflows and flooding. After meeting with affected constituents, I engaged with local authorities and stakeholders including the Mayor of Bedford Borough and the Leader of Central Bedfordshire to find solutions that protect our communities from pollution and flood risks. This led to proposing the formation of a North Bedfordshire Water Management Alliance, uniting Anglian Water, local Drainage Boards, the Environment Agency, Parish Councils, and local environmental groups to create a coherent, shared action plan.\nThrough these efforts, I strive to make a tangible difference in North Bedfordshire, ensuring that your needs and priorities are represented and acted upon both locally and in Parliament.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-welcomes-government-commitment-protect-best-and-most-versatile-agricultural-land-solar/content_7.html": "Earlier this month, Richard wrote to Energy Secretary Ed Miliband, to seek clarification on whether Best and Most Versatile (BMV) agricultural land remains a criterion in solar project assessments, and if its weighting in approval decisions has changed. Richard's letter can be read here. Richard welcomes that Ed Miliband's response has confirmed that BMV land should not be used for solar projects. Ed Miliband's response can be read here.\nRichard Fuller MP says:\nI'm aware that Mr Miliband has faced criticism for his decisions when it comes to solar projects, but I was pleased to see his commitment to protecting the UK’s Best and Most Versatile (BMV) agricultural land.\nIn his recent letter, he confirmed that BMV land should not be used for solar projects unless necessary. This is an important position to ensure our farmland is safeguarded. It’s reassuring to see the government commit to not weaken these protections.\nAs a CPRE Rooftop Solar Champion, I strongly believe that rooftop solar is a far better alternative to using productive farmland. I have written to the government to propose installing a connection pipe along the A1 and A421 to facilitate the connection of commercial rooftop solar to the National Grid. While I have yet to receive a response, I hope this idea will be seriously considered as a more sustainable and efficient solution.\nProtecting our agricultural land must remain a priority, and I am pleased to see the government confirm its commitment to this.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-attends-national-prayer-breakfast-parliament/content_27.html": "Last week, Richard attended the National Parliamentary Prayer Breakfast in Westminster Hall - an annual recognition of the contribution that Christianity makes to the national life of the UK.\nSpeaking after the event, Richard Fuller MP said:\nThe Annual Prayer Breakfast is an opportunity for Parliamentarians to connect with the Christian faith and to share how the Bible continues to influence their lives and the people and communities they represent.\nOver 180 MPs joined 500 church and community representatives from across the UK. A special word of thanks to Eve Burt who each year helps coordinate volunteers arranging the event.\nThis year, the National Parliamentary Prayer Breakfast was chaired by Lord Curry of Kirkharle and the main speaker was Dr Amy Orr-Ewing, honorary lecturer at the University of Aberdeen School of Divinity.\nFor more information, please visit this page.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_parliament/content_8.html": "Tweet Here, you can find my latest speeches and appearances in Parliament (provided by theyworkforyou):\nBuses: Electric Vehicles | Department for Transport | Written Answers To ask the Secretary of State for Transport, what initiatives her Department has considered to help encourage the conversion of buses to ele\nEmployers' Contributions: Supply Teachers | Treasury | Written Answers To ask the Chancellor of the Exchequer, what assessment she has made of the potential impact of changes to employer National Insurance contr\nPlanning and Development: Bedfordshire | Westminster Hall debates I am very grateful for the Minister’s thoughtful speech.\nPlanning and Development: Bedfordshire | Westminster Hall debates I am very grateful for the Minister’s thoughtful speech.\nPlanning and Development: Bedfordshire | Westminster Hall debates I am grateful to my hon. Friend for securing this debate.\nPlanning and Development: Bedfordshire | Westminster Hall debates I am grateful to my hon. Friend for securing this debate.\nEconomic Growth | Treasury | Commons debates Two weeks ago, the spring statement rushed through changes to disability benefits, or “pocket money” to the Chief Secretary to the Treasury,\nEconomic Growth | Treasury | Commons debates Two weeks ago, the spring statement rushed through changes to disability benefits, or “pocket money” to the Chief Secretary to the Treasury,",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-raises-supermarket-fuel-pricing-parliament/content_21.html": "Recently in Parliament, during an urgent question on road fuel pricing, Richard thanked the government for accepting the recommendations in a Competition and Markets Authority's (CMA) report but said he thought we were putting too much faith in price transparency to solve the market problem. The exchange can be watched at https://youtu.be/WUqp_3F7H_U\nIn its report, which can be read here, the CMA said a new fuel finder scheme would enable drivers access to live, station-by-station fuel prices on their phones or satnavs to help revitalise competition in the retail road fuel market.\nCommenting afterwards, Richard Fuller MP said:\nMany motorists feel that petrol prices have remained stubbornly high even as the price of oil has declined and the recent report from the Competition & Markets Authority gives some support to this view.\nThere is a particular worry with petrol sold by supermarkets but I worry that the main recommendation – a price comparison app – will not really prove effective in bringing prices down. We need one supermarket chain to see petrol pricing as a “loss leader” – a means to attract new customers to their stores – to get pricing moving down consistently.\nThe Minister replied that one of the recommendations in the report was to maintain a monitoring function, which will help provide market intelligence and data on which to base any further intervention if required.\nThe scheme would be made possible by new compulsory open data requirements and backed by a new ‘fuel monitor’ oversight body. The proposals are the key recommendations by the Competition and Markets Authority (CMA) to UK government following its in-depth study into the road fuel market which found a weakening of competition in retail since 2019.\nAt present, retailers only provide information on prices at the petrol stations themselves, making it hard for drivers to compare prices and weakens competition. The fuel finder open data scheme would need statutory backing through legislation to ensure fuel retailers provide up-to-date pricing and make that available to drivers in an open and accessible format that can be easily used by third party apps such as satnavs or map apps, through a dedicated fuel finder app, or a combination of both.\nThe fuel monitor would monitor prices and margins on an ongoing basis and recommend further action if competition continues to weaken in the market. As the UK transitions to net-zero the demand for petrol and diesel will reduce. The fuel monitor will help us understand the impact of this on vulnerable consumers that remain dependent on petrol and diesel for longer, as well as those living in areas with limited choice of fuel stations.\nThe fuel monitor will ensure ongoing scrutiny of retail prices for petrol and diesel. We observed that following the interim update issued by the CMA in May 2023, the average price of road fuel fell in large parts of the UK. Over the last year, the CMA has investigated the road fuel market in detail and reached the conclusion that competition is not working well and greater transparency in pricing is needed to improve consumer confidence and bring down prices for drivers.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_housing-communities-and-local-government/content_14.html": "Skip to main content\nMain navigation\nAbout\nNews\nCampaigns\nSurgeries\nPolicy and Campaign Responses\nContact\nHousing, Communities and Local Government\nTweet\n.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_privacy/content_2.html": "This document outlines how Richard Fuller MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Richard Fuller MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Richard Fuller MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Richard Fuller MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Richard Fuller MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_kemi-launches-conservative-policy-renewal-programme/content_17.html": "On Tuesday morning, Kemi Badenoch launched the Conservative Party's Policy Renewal Programme.\nSpeaking from the event, Richard Fuller MP said:\nKemi has broken the political consensus of myth making about Net Zero by 2050 and seeks to replace it with a set of detailed plans that maintain progress to net zero but at a pace that British families can afford and which protects our national security.\nIn a powerful and clear sighted speech, Kemi dissected the risks of continuing on a pathway based on an arbitrary target. She called on everyone: from climate change sceptics to renewables enthusiasts to join in helping to create more pragmatic plans that the country can afford. She also indicated that a future Conservative government would look for ways to reduce significantly the costs of energy which are holding back our industrial base and squeezing family finances.\nYou can watch Kemi's speech at https://youtu.be/giTVeVVSy3g\nYou can take part by sharing your views here: https://policy.conservatives.com/?deliveryName=DM58290",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_freehold-management-and-service-charges-update-richard/content_32.html": "In January, Richard spoke in the House of Commons about the urgent need for reform of the law regarding freehold management charges.\nRichard raised the concern that freehold homeowners do not yet have the same rights as leaseholders to challenge excessive estate management fees and cited a lack of transparency and poor service by estate management companies.\nThe exchange with the minister is here: Richard raises the issue of excessive estate management fees in Parliament | Richard Fuller\nThe Government has committed to introduce legislation when Parliamentary time allows but since the debate, Richard has continued to press the Government to bring forward the promised legislation to improve the rights of freeholders to scrutinise and challenge excessive management fees.\nRichard Fuller MP said:\n\"I know from my work with local councillors including Jim Weir, Jon Gambold, Sarah Gallagher and Steve Dixon that in areas with new housing there are all too often concerns about the way that management charges are being levied, usually without transparency and often for excessive amounts for the services actually being provided.\"\nEarlier this month, Richard wrote to the Prime Minister to urge him to introduce legislation at the earliest possible opportunity. More than 30 MPs joined with Richard by signing his letter, a copy of which is below.\nIn addition, Richard has also secured a debate in Parliament on the 20th April which will be an opportunity for him to present the case for reform to the Minister during a 30 minute debate.\nFuture updates, including the response to the letter to the Prime Minister and details of the debate will be posted on Richard's website and if you are not already signed up to receive Richard's weekly e-newsletter, you can sign up on the following link so that you receive updates direct to your inbox: Richard Fuller | MP for North East Bedfordshire",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-holds-debate-freehold-management-charges/content_25.html": "On Thursday Richard secured an Adjournment Debate in Parliament on Freehold Management Charges.\nThere is a half-hour adjournment debate at the end of each day's sitting which provides an opportunity for an individual backbench MP to raise an issue and receive a response from the relevant Minister.\nRichard's adjournment debate on Thursday and the Minister's response can be watched here.\nSpeaking after the debate, Richard Fuller MP said:\nFor several months I have championed the cause of unfair freehold management charges cause alongside Councillors Jim Weir, Sarah Gallagher, Steve Dixon, and groups including the New Cardington Residents Association.\nIt is long overdue that Estate Management Companies were held to account over the fees they charge and are obliged to treat residents fairly with better provision of services and full transparency over how and why the charges are decided.\nI asked the Minister for a meeting to discuss my concerns with me and the other thirty Conservative MPs who co-signed the letter who are also concerned about these issues. I also asked her to confirm there would be no dilution of the government's current commitments on this and to set out the timetable to legislate for these existing commitments.\nI was encouraged by the Minister's response and her plans on this and look forward to meeting with her soon.\nThis week, Richard also recently received a reply from the Prime Minister to his letter, co-signed by 30 Conservative MPs, stating the government's intention to act when parliamentary time allows. The letter can be read here. The letter from Richard and the 30 MPs to the Prime Minister can be found here.\nFreehold service charges can cover the provision of a variety of services on an estate, such as the upkeep of play areas, communal gardens, private (unadopted) roads and communal parking areas such as parking courts.\nWhile the requirement to make a financial contribution is usually defined in the deed of transfer when the property is first sold by the developer or by a liability that might arise as a result of an estate rent charge that forms part of the purchase contract, these fees often increase after completion of a purchase and lead to a number of issues which include a lack of transparency, where it is often unclear what the charges relate to or why they are being applied to a particular property; no accountability, where it is often difficult to obtain information about the charges, or challenge the quality of the work carried out and where there is no regulation or oversight of the practices of the management companies.\nThe government has in the past committed to legislate to give freeholders on private and mixed tenure estates equivalent rights to leaseholders to challenge the reasonableness of estate rent charges and has also confirmed an intention to regulate letting and property management agents.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_energy-and-climate-change/content_19.html": "Skip to main content\nMain navigation\nAbout\nNews\nCampaigns\nSurgeries\nPolicy and Campaign Responses\nContact\nEnergy and Climate Change\nTweet\n.\nCampaigns\nOffshore Petroleum Licensing Bill: January 2024",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_campaigns_wastewater-overflows-and-flooding-0/content_10.html": "Since December 2023, Richard has been actively supporting constituents across the constituency including in Wyboston, Tempsford, and Great Barford, who have suffered from sewage backup and flooding due to heavy rainfall. In February, Richard visited affected households to understand the extent of the problem.\nRecognising the urgency, Richard has been collaborating with Anglian Water, which bears primary responsibility, to address the issue. Acknowledging that a quick fix is unlikely, Richard has prioritised developing a long-term solution.\nHe has engaged with the Mayor of Bedford Borough and proposed the formation of a North Bedfordshire Water Management Alliance. This alliance will unite Anglian Water, local Drainage Boards, the Environment Agency, Parish Councils, and local environmental groups. The function of the alliance is to create a coherent, shared action plan, ensuring each agency is accountable. This collaborative approach, inspired by Norfolk Council's successful response to similar flooding issues, aims to deliver a sustainable solution for North Bedfordshire.\nThe alliance, under the leadership of Paul Leinster CBE, aims to improve coordination and to come forward with shared plans for flood management and for improvements to the water quality of the River Great Ouse and had its first meeting in February 2025.\nSee below for all of Richard's news on Water Management and Flooding.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-joins-rural-crime-action-team-ride-along-north-beds/content_6.html": "Over the Easter break from Parliament, Richard returned to the police station at Riseley for a visit and also joined the Rural Crime Action Team (RCAT) on a ride along.\nSpeaking afterwards, Richard Fuller MP said:\nOur rural officers are wonderful examples of policing, building strong connections and adept at combatting crime. The number of frontline officers stationed at Riseley had fallen for many years but over the last five years numbers have been built back up to a total contingent of 11.\nDuring the ride along, I got to see a range of policing activities, talked about the pressures facing our officers and even got to recover a stolen motorcycle!\nI can be critical of back office processes at our police but our frontline officers have my full support and grateful thanks.\nYou can follow RCAT and the North Beds Rural Community Policing teams on facebook at Beds Rural Crime Action Team - RCAT and North Bedfordshire Rural Community Policing",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-asks-government-introduce-new-annual-assessments-and-scrutiny-regulators/content_24.html": "In Parliament last week, during an Urgent Question on the financial resilience of the water industry, Richard asked the Environment Minister whether ministers would work to improve oversight of regulators such as Ofwat as the House and Parliament does not have the toolkit to assess regulators’ performance on a systemic basis. The full question and the Minister's reply can be watched at https://youtu.be/RcbOJ8kB5_E.\nRichard Fuller MP said:\nThere was - and remains - a strong underlying logic to tapping private capital rather than taxpayers' money for the significant investments needed by our water industry. However, as I tried to point out in my question to the Minister, doing so effectively requires that our regulators perform well. Though not the worst regulator, I do think that the water industry, OFWAT, has made mistakes.\nUltimately, and ironically perhaps, it is Parliament (not government) that has the responsibility to monitor the performance of regulators. MPs have not done a good job over the years and I have been pressing the Speaker and the Government to introduce new annual assessments and scrutiny.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_policy-campaign-email-responses_offshore-petroleum-licensing-bill-january-2024/content_28.html": "Dear Constituent,\nThank you for taking the time to contact me about oil licenses.\nAs we have seen over the last year, global energy supplies have been disrupted and weaponised by the likes of Vladimir Putin, causing household bills to soar and economic growth to slow around the world.\nIt is therefore essential that the UK has energy independence and security, and the Government is determined to safeguard our energy supply and power up Britain from Britain. As such, the Government is not only backing our oil and gas sector, but also investing in renewable energy and carbon capture.\nThe UK, like most major economies, is highly dependent on oil and gas and will be for decades to come. According to the Committee on Climate Change, oil and gas will still provide more than half of our energy needs in 2035, and 24 per cent of our energy needs even in a net zero 2050.\nThe Government remains firmly committed to its net zero target. However, oil and gas will be required in the transition to net zero, simply turning off the taps would mean we would have to import oil and gas, leaving us susceptible to global circumstances. Further, importing oil and gas harm our ambition to reach net zero. According to the North Sea Transition Authority, imported gas has a carbon footprint which is three times that of domestically produced gas.\nThe Government is therefore boosting our energy security by committing to hundreds of new oil and gas field licences in the North Sea, making sure we are not reliant on expensive, foreign imports. It is also investing in Carbon Capture and Storage, delivering on our net zero ambitions while creating 25,000 jobs and driving £10 billion of investment.\nI therefore welcome that the Government is introducing legislation to support the future licensing of new oil and gas fields, helping the country transition to net zero by 2050 without adding undue burdens on households. The Offshore Petroleum Licensing Bill will strengthen the country's energy security and reduce reliance on volatile international energy markets and hostile foreign regimes.\nThis will cut bills, cut emissions, and cut our dependence on foreign imports, safeguarding our long-term energy security, supporting families with the cost of living, and delivering on the Prime Minister’s pledge to grow the economy. It is for these reasons and the ones laid out above that I intend to support the Government on the 22nd January.\nThank you again for taking the time to contact me.\nSincerely,",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-asks-secretary-state-update-animal-welfare-measures/content_30.html": "This week during DEFRA questions, Richard was keen to ensure that the Government is keeping up the momentum of the work already done on animal welfare measures. His question to the Secretary of State and her reply can be watched at https://www.youtube.com/watch?v=JN0lURaZU2A.\nThe Kept Animals Bill, introduced in June 2021, was designed to implement several of the Government’s ambitions for animal welfare. This included banning the live exports of animals, seeking to prevent pet theft, and new measures to tackle livestock worrying. The Bill’s multi-issue nature means that there has been considerable scope-creep, and the Bill risks being extended far beyond the original commitments in the Conservative Manifesto and the Action Plan for Animal Welfare. Therefore, the Government will now be taking forward measures in the Kept Animals Bill individually during the remainder of the Parliament.\nRichard Fuller MP said\nThis week, I asked a question of the Secretary of State, Therese Coffey, regarding the Government’s progress on two specific elements of the Bill, importing dogs with cropped ears and the keeping of primates as pets. In her response, the Government confirmed that both primary and secondary legislation is being brought forward to implement policies originally designated for the Kept Animals Bill.\nI am assured that the Government remains fully committed to delivering its manifesto commitments on animal welfare. The UK has a long and proud record of supporting animal welfare and this government has taken a number of measures to further strengthen legislation in this area.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_highlighting-once-more-impact-employers-nics-increase-hospices/content_13.html": "Labour’s Employer’s National Insurance rise from April this year risks having a catastrophic impact on hospices and their ability to provide the outstanding care that so many rely on. Richard Fuller MP again raised this with Treasury Ministers in the House of commons last week. You can watch his intervention at https://youtu.be/3AfIxl0h0mA?si=YwYY2VJBrfleJmXL\nRichard said:\nDuring the recent debate on the NI increases, I highlighted that although the government says that it has provided additional funding for hospices, a quirk of healthcare funding means that this money can only be used for capital expenditure, not to offset NICs increases. This is an arbitrary distinction and it is within the Chancellor’s gift to carve out an exemption for the hospice sector if she sees fit and I hope she addresses this sooner rather than later.\nI don’t believe for a second that the Labour government set out to cause such harm to hospices in October’s budget. There is however, no escaping the reality of the enormous collateral damage caused by their Jobs Tax and I urge them to recognise this and show compassion and understanding to those who were never intended to be in the Chancellor’s crosshairs.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_category_Westminster-News/content_4.html": "VE and VJ Day 2025 Commemorations 1st May 2025 May 8th is the 80th anniversary of Victory in Europe (VE Day) when the country will pay tribute to the Second World War generation from British, Commonwealth... Westminster News\nRichard attends UKCVFamily charity meeting who support the Covid 19 vaccine-injured and bereaved 28th April 2025 Richard recently attended a meeting in Parliament held by U KCVFamily, a support and advocacy charity for the Covid 19 vaccine-injured and bereaved. Richard... Westminster News\nRichard responds as Shadow Minister to Green Book Review debate 11th April 2025 Last week, Richard spoke in a Westminster Hall Debate on the Green Book Review as Shadow Chief Secretary to the Treasury. The Green Book is guidance issued by... Westminster News\nReaction to the Chancellor's Emergency Budget 27th March 2025 On Wednesday, the Chancellor delivered her Spring Statement. Richard Fuller MP, Shadow Chief Secretary to the Treasury, commented: It is time the Chancellor... Westminster News\nHighlighting once more the impact of Employers NICs increase on hospices 23rd March 2025 Labour’s Employer’s National Insurance rise from April this year risks having a catastrophic impact on hospices and their ability to provide the outstanding... Westminster News\nRichard attends All Party Parliamentary Group for Shooting and Conservation meeting to discuss firearms licensing and reply from Policing Minister 23rd March 2025 Richard Fuller MP recently joined a meeting of the All Party Group for Shooting and Conservation. Speaking afterwards, he said: I recently signed a joint letter... Westminster News\nKemi launches Conservative Policy Renewal Programme 19th March 2025 On Tuesday morning, Kemi Badenoch launched the Conservative Party's Policy Renewal Programme. Speaking from the event, Richard Fuller MP said: Kemi has broken... Westminster News\nRichard welcomes Government Commitment to Protect Best and Most Versatile Agricultural Land in Solar Project Applications 24th February 2025 Earlier this month, Richard wrote to Energy Secretary Ed Miliband, to seek clarification on whether Best and Most Versatile (BMV) agricultural land remains a... Westminster News\nRichard attends Autism event in Parliament 26th January 2025 Last week, Richard attended the National Autistic Society's 'A Constant Fight' event at Portcullis House in Parliament. Commenting, Richard Fuller MP said: It... Westminster News",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_flooding-bedfordshire-discussed-house-commons-and-richard-follows-council-and-highways-chiefs/content_12.html": "Last week in Parliament, Richard spoke in a debate called by fellow Bedfordshire MP, Blake Stephenson, on flooding in Bedfordshire. Richard's contribution can be watched here.\nSpeaking afterwards, Richard Fuller MP said:\nWe have already seen significant disruption this Autumn and with the awful conditions endured by many constituents last winter, I suggested that the North Bedfordshire Water Management Alliance, which has now been picked up by Bedford Borough Mayor, Tom Wootton is the best way to help residents with flood related issues, as well as offering preventative measures to minimise the impacts upfront. I suggested this approach could become a test case that could be rolled out to other areas.\nI originally set up the Water Management Alliance specifically to bring together all of the relevant agencies and groups that either impact, or are impacted by the risk of flooding, and who too often operated in silos with insufficient communication and collaboration. I am delighted that Mayor Tom has taken this on board to champion and drive forward.\nSpeaking of the flooding of A421 last month, Richard added:\nWe are naturally all very happy that the A421 at Marston Moretaine has reopened following a significant length of closure due to the recent flooding. Whilst it is true that the rainfall that caused the problem was largely unprecedented, indeed Martin Fellows, the Regional Director for National Highways in the East of England described the flooding as a “one in a 100-year event”, there are nevertheless many questions that need to be answered as to why this happened and what mitigation can be put in place to minimise the chances of a recurrence in the future.\nI will be following up with both Martin Fellows and Marcel Coiffart, Chief Executive of Central Beds Council to discuss:\n- The dip in the road that allows water to congregate at the bottom and whether any remedial action is possible at this point.\n- Why the pumps failed and where they should be relocated to so as to avoid them being submerged in the future.\n- An assessment of whether the highway drainage channels are well maintained and up to the challenge of such heavy rainfall.\n- An overview of the surrounding land and water courses and whether blockages or a build up of debris contributed to the flooding on the A421.\n- Details of where excess water is able to be pumped to, and how capacity can be increased to deal with such events in the future.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-continues-fight-rights-freehold-homeowners/content_22.html": "Before the House of Commons rose for summer recess, Richard continued his fight for rights of homeowners on privately managed estates by speaking in a debate on Freehold Estate Management Fees. His full contribution can be watched at https://youtu.be/CbNHC2V9X0s\nRichard Fuller MP said:\nWestminster Hall provided another opportunity for me to continue my campaign to make the Government introduce legislation to protect homeowners from excessive estate management charges and to rein in what is becoming an increasing problem for many residents in Bedfordshire, particularly those who have bought a new house within the last ten years.\nThe Minister seems supportive to my key points: rights equivalent to leaseholders to challenge charges that are imposed; reasonableness in the calculation of charges with more transparency, and a proper system of redress when residents are ripped off. Later in the debate I pressed the Minister to ensure that if the law does change, then home owners who currently face undue charges will be able to access any future system of redress to enable them to be reimbursed. Watch this space!\nThe full debate can be read here.\nRichard has met with a number of constituents across the constituency affected by this issue. At the start of this year, Richard raised the issue with the relevant Minister, then he wrote to the Prime Minister and he held a debate on freehold management charges. More information can be read here.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-raises-issue-excessive-estate-management-fees-parliament/content_31.html": "On Monday, during Levelling Up, Housing and Communities question time in Parliament, Richard raised the issue of freehold homeowners having the same rights as leaseholders to challenge excessive estate management fees, lack of transparency and poor service by estate management companies.\nThe Minister confirmed that the government is committed to building on the Leasehold Reform (Ground Rent) Act 2022 and delivering the second phase of its major two-part leasehold reform programme within this Parliament. This will make it easier for leaseholders to purchase their freeholds and will establish greater fairness between those parties.\nRichard Fuller MP said:\nMany residents in North East Bedfordshire are being charged excessive “estate manager” fees and this week I raised freehold homeowners' rights to challenge estate management companies with the Housing and Planning Minister, Lucy Frazer during, to bring parity with leaseholders' rights.\nSeveral Councillors in my constituency; Jim Weir in Great Denham, Sarah Gallagher in Shortstown and Steve Dixon in Stotfold, Fairfield and Langford have all worked hard to raise the issue of excessive fees, a lack of transparency and poor service provided by many estate management companies.\nHomeowners often feel powerless to hold these companies to account given the monopoly they enjoy in their communities.\nI was reassured by the Minister's commitment to provide greater rights for homeowners on privately managed estates as well as the requirement for such companies to join a redress scheme.\nWe should go further and change the terms of reference of the Property Ombudsmen to make it easier for home owners to challenge these unfair practices.\nRichard's question and the Minister's response can be watched here.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_cdn-cgi_l_email-protection/content_16.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_policy-campaign-responses/content_11.html": "Much of the content on this website was established while I was a Member of Parliament under a Conservative Government from December 2019 - May 2024.\nDear constituent,\nThank you for reading this section of my website.\nI am grateful to constituents who contact me on a wide range of issues. Every week, I receive hundreds of template campaign \"click and send\" style emails from constituents which have been arranged by third party organisations such as charities and campaign/lobby groups.\nI am always pleased to read those emails and to be aware of the concerns which matter to constituents.\nIndividual constituency and casework enquiries will always be answered by email or letter, but as a result of the increase in the volume and similarity of campaign emails being generated, my responses are posted on this section of my website within the relevant sections.\nIf you have recently sent me an email about an issue where my response has not yet been posted, please do check back as this page is refreshed on a regular basis.\nIn addition, if you would like to discuss your concerns in more detail, please do arrange an appointment to see me at one of my regular surgeries which take place across the constituency and are held in a number of ways: face to face by appointment surgeries, drop in surgeries without an appointment and online/telephone surgeries. Further details are available here: Surgeries | Richard Fuller\nThank you for getting in touch.\nYours sincerely,\nRichard Fuller",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_contact/content_9.html": "Skip to main content\nMain navigation\nAbout\nNews\nCampaigns\nSurgeries\nPolicy and Campaign Responses\nContact\nContact\nLeave this field blank\nConstituency Office\nRichard Fuller MP, Biggleswade Conservative Club, St Andrews Street, Biggleswade, SG18 8BA\n01767 317224\nHouse of Commons Office\nHouse of Commons, London, SW1A 0AA\n0207 219 8602\n[email protected]\nRichard on Facebook\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_digital-culture-media-and-sport/content_20.html": "Skip to main content\nMain navigation\nAbout\nNews\nCampaigns\nSurgeries\nPolicy and Campaign Responses\nContact\nDigital, Culture, Media and Sport\nTweet\n.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-raises-issues-administration-help-buy-scheme-house/content_26.html": "On Thursday, Richard raised the administration of the Help to Buy scheme during Business Questions to the Leader of the House. Recent changes in the administration have been communicated very poorly and have caused a great deal of anxiety and distress to a number of Richard's constituents. The full exchange can be watched at https://youtu.be/fYO3XSbruYU.\nExplaining the problem, Richard Fuller MP said:\nFive years ago, the Government agency, Homes England, contracted out the administration of their Help to Buy (HTB) scheme to Target HCA. This 5-year contract came to an end in mid-June 2023 and the new contract was secured by Lenvi.\nPeople have purchased properties with the help of the Help to Buy scheme using Target as the administrator and are now trying to re-mortgage, however Target have not communicated to stakeholders that they are no longer administering the scheme other than a statement on their website. Furthermore, people are unable to reach anyone for assistance using the contact details they have provided on their website.\nRemortgaging can often be a highly time-sensitive process, so the lack of information for customers, coupled with the absence of any guidance is extremely worrying and needs to be resolved urgently.\nI was pleased that the Leader of the House recognised this seriousness and urgency of this issue and vowed to ensure the Secretary of State was fully briefed ahead of further questions on Monday.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news/content_3.html": "Richard enjoys a fun afternoon at Harrold Pit Run Friday, 2 May, 2025 Last Saturday, Richard attended the annual Harrold Pit Run - a highlight in the North Bedfordshire calendar. The Pit Run has been running since 1983 with only two missed because of Covid and a shortened course in 1998 due to severe flooding. The event encompasses four races, from a short kids race up to a fully marshalled 3 mile race around the village of Harrold and around the lakes in the... Local News\nVE and VJ Day 2025 Commemorations 1st May 2025 May 8th is the 80th anniversary of Victory in Europe (VE Day) when the country will pay tribute to the Second World War generation from British, Commonwealth... Westminster News\nRichard highlights to government that services in Bedfordshire have not kept up with housing growth 30th April 2025 Last week Richard took part in a Westminster Hall debate called by neighbouring MP for Mid Bedfordshire, Blake Stephenson, on Planning and Development in... Local News\nHave your say in the Staploe Parish Neighbourhood Plan Consultation 29th April 2025 If you are a resident, have a business or are involved in a community organisation in the three hamlets of Staploe, Honeydon and Duloe, then the Parish Council... Local News\nRichard attends UKCVFamily charity meeting who support the Covid 19 vaccine-injured and bereaved 28th April 2025 Richard recently attended a meeting in Parliament held by U KCVFamily, a support and advocacy charity for the Covid 19 vaccine-injured and bereaved. Richard... Westminster News\nRichard asks the Chancellor, Rachel Reeves, if more taxes are coming 26th April 2025 During Treasury Questions in the House of Commons this month, in his capacity as Shadow Chief Secretary to the Treasury, Richard asked Rachel Reeves if we can... Local News\nNAO says regulators have failed to deliver a trusted and resilient water sector 25th April 2025 On Friday, an important report was released on our water companies by the National Audit Office (NAO), the body tasked to review value for money and performance... Local News\nRichard joins Rural Crime Action Team on a ride along in North Beds 24th April 2025 Over the Easter break from Parliament, Richard returned to the police station at Riseley for a visit and also joined the Rural Crime Action Team (RCAT) on a... Local News\nUpcoming National Highways works to the A421 Wootton to Marston Moretaine Noise Barrier 23rd April 2025 National Highways have contacted Richard regarding the final phase of work to replace A421 noise barriers. Work will begin on 28 April 2025 and will continue... Local News\nRichard meets with Harpur Trust 23rd April 2025 Earlier this month, Richard met with The Harpur Trust, which has provided charitable support in the form of educational opportunities and community support for... Local News",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_category_Speeches-in-Parliament/content_15.html": "Richard raises concerns about the Chancellor's economic strategy of raising taxes and increasing regulations on businesses 22nd January 2025 This week during Treasury Question Time in the House of Commons, Richard asked Treasury Ministers when they would change course on their economic strategy given... Speeches in Parliament\nRichard sits on Special Envoy for Freedom of Religion Bill Committee 15th May 2024 Earlier this month, Richard was appointed to the Bill Committee for the Special Envoy for Freedom of Religion or Belief Bill 2023-24. The bill is a Private... Speeches in Parliament\nCulture Secretary asked about Universal proposal for Bedfordshire 24th April 2024 Last week in Parliament. Richard Fuller MP asked the Culture, Media and Sport Secretary, Lucy Frazer KC MP to confirm that she is working closely with the... Local NewsSpeeches in ParliamentWestminster News\nRichard continues fight for rights of freehold homeowners 28th July 2023 Before the House of Commons rose for summer recess, Richard continued his fight for rights of homeowners on privately managed estates by speaking in a debate on... Local NewsSpeechesSpeeches in Parliament\nRichard raises supermarket fuel pricing in Parliament 18th July 2023 Recently in Parliament, during an urgent question on road fuel pricing, Richard thanked the government for accepting the recommendations in a Competition and... Speeches in ParliamentWestminster News\nRichard asks Secretary for State for update on animal welfare measures 13th July 2023 This week during DEFRA questions, Richard was keen to ensure that the Government is keeping up the momentum of the work already done on animal welfare measures... SpeechesSpeeches in ParliamentWestminster News\nRichard raises issues with the administration of the Help to Buy scheme in the House 9th July 2023 On Thursday, Richard raised the administration of the Help to Buy scheme during Business Questions to the Leader of the House. Recent changes in the... Local NewsSpeeches in ParliamentWestminster News\nRichard asks government to introduce new annual assessments and scrutiny of regulators 6th July 2023 In Parliament last week, during an Urgent Question on the financial resilience of the water industry, Richard asked the Environment Minister whether ministers... Speeches in ParliamentWestminster News\nRichard attends the National Prayer Breakfast in Parliament 5th July 2023 Last week, Richard attended the National Parliamentary Prayer Breakfast in Westminster Hall - an annual recognition of the contribution that Christianity makes... Speeches in Parliament",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_culture-secretary-asked-about-universal-proposal-bedfordshire/content_23.html": "Last week in Parliament. Richard Fuller MP asked the Culture, Media and Sport Secretary, Lucy Frazer KC MP to confirm that she is working closely with the Treasury to provide a response to the proposal before the summer. Richard's question and the Secretary of State's reply can be watched at https://youtu.be/u-bF7fkhESc?si=RtQa2CHMHFs0EcQU\nRichard said:\nThe proposed Universal Theme park is very significant for Bedfordshire businesses and employment and, representing a £10 billion investment, is a major vote of confidence in the UK.\nI fully support it going ahead as long as financial and environmental conditions are met.\nAs part of their public engagement, Universal are conducting a survey to hear the views of local residents and you can take part by visiting https://universalukproject.co.uk/ until Friday 3 May 2024.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-responds-shadow-minister-green-book-review-debate/content_18.html": "Last week, Richard spoke in a Westminster Hall Debate on the Green Book Review as Shadow Chief Secretary to the Treasury. The Green Book is guidance issued by HM Treasury on how to appraise policies, programmes and projects. It also provides guidance on the design and use of monitoring and evaluation before, during and after implementation. The debate was brought forward by Sarah Russell MP who was making the case for the Government's 10-year infrastructure strategy to address the historic imbalance of infrastructure funding between London and the North.\nRichard Fuller MP said:\nIn my contribution, I highlighted that although there is a widespread belief that the 'levelling up' programme of the last government underperformed objectives, the level of public expenditure on services per head outside the South and South East of the country was significant.\nBetween 2018/19 and 2022/23, real capital per head decreased by 3% in the East and 5% in the South East. London did increase by 20% but the North West and North East saw increases of 25%, 24% in the West Midlands and 22% in the East Midlands. Impacts were not always commensurate with investment and more needs to be done, but the foundations are there to be built on and progress is being made.\nReferring to my own area of the country, I also highlighted the enormous amount of 'growth' projects currently planned or proposed in Bedfordshire. They say a week is a long time in politics, and I'm delighted that the Treasury did indeed 'pull it's finger out' regarding the Universal Studios theme park and this week's excellent news that that project will be going ahead. And again pointed out to the Treasury that East West Rail loses 70p for every pound of taxpayers' money invested into this 'growth' project.\nRichard's contribution can be watched at https://youtu.be/4TY5USeIH_c?si=rdb5QZt8JUOvbFCW",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk/content_1.html": "Intro Video (background video that auto-plays without sound)\nRichard Fuller MP\nMember of Parliament for North Bedfordshire\nI am Richard Fuller, your Member of Parliament for North Bedfordshire. Here, you can find my latest news, campaigns and more about me. Please don't hesitate to get in touch.",
  "https_www_richardfuller_co_uk_/https_www_richardfuller_co_uk_news_richard-sits-special-envoy-freedom-religion-bill-committee/content_29.html": "Earlier this month, Richard was appointed to the Bill Committee for the Special Envoy for Freedom of Religion or Belief Bill 2023-24.\nThe bill is a Private Members' Bill presented by Fiona Brice MP and proposes that the Prime Minister’s Special Envoy for Freedom of Religion or Belief (FoRB), is secured as a statutory requirement. It means all further governments must appoint an FoRB envoy and guards against the deprioritisation of this concern.\nRichard Fuller MP said:\nI value freedom of religion highly. Each year I endeavour to attend the Parliamentary report by Open Doors into the persecution of faith – particularly the Christian faith – across the globe.\nFiona Bruce presented her Bill to put the Prime Minister’s Envoy for Religious Freedom on a statutory basis and her Bill had widespread support across Parliament. I was honoured to be asked by Fiona to be one of the members of the Bill Committee which met last week to consider this short, but important, Bill.\nIn part it is testimony to Fiona’s tireless work on behalf of people of faith but, as she herself said, the role has an importance far greater than one individual. The Bill passed Committee Stage and will return for its final stage in the House of Commons shortly."
}