{
  "https_reformfolkestonehythe_co_uk_/https_reformfolkestonehythe_co_uk/content_1.html": "Our Freedom Our future\n“BRITAIN IS BROKEN.\nBRITAIN NEEDS REFORM”\nUPCOMING events\nSaturday 19th April\nSaturday 26th april\nTuesday 22nd April\nReform UK Branch Meeting\nDate: SATURDAY 19 APRIL, 2025\nVenue:\nFOLKESTONE HARBOUR\nFairly close to the Harbour Inn where lots of people congregate\nTiming: 1100-1300 (or later if busy)\nDate: SATURDAY 26 APRIL, 2025\nVenue:\nDYMCHURCH TOWN CENTRE\nProbably on the high street close to the car park\nTiming: 1100-1300 (or later if busy)\nWe are also holding the next Reform UK branch meeting as scheduled in New Romney. The details are as follows:\nDate: TUESDAY 22 APRIL, 2025\nVenue:\nNew Romney Bowls Club\nSussex Rd, New Romney TN28 8HL\nTime: 7pm – 9pm (approx)\nMeetings in the Romney Marsh area are normally lively and fun. And a chance to meet new friends with similar common sense views. It would be great to see you there. Do feel free to invite friends and family.\nAs always, your support in person at any event is very much appreciated. And as some of us are suffering from tired feet and blisters, if you do feel like a bit of last minute campaigning (e.g. leafleting your street) please reach out to your local candidate directly. Their contacts details are:\nRomney Marsh – David Wimble – alliedents@aol.com\nCheriton, Sandgate & Hythe East – Gary Burton – gary@wolftransport.co.uk\nFolkestone East – Mary Lawes – marylawes57@ntlworld.com\nFolkestone West – John Baker – mail@countyhardware.com\nHythe West – Peter Osborne – osbr1@aol.com\nIf you are not sure about the boundaries between the KCC divisions please check out this set of helpful maps.\nFinally, tickets for the Gala Dinner on Saturday 14 June 2025 are selling fast and if you would like to attend please enquire soon. At the time of writing there is still plenty of capacity for the afternoon conference. Details of both events can be found at www.reformfh.co.uk.\nBest wishes as always\nBill Wright\nReform UK Branch Chairman, Folkestone, Hythe & Romney Marsh\nJune 14th 2025 – 12:30pm\nOur Summer Conference and Gala Dinner"
}