{
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_privacy-policy/content_5.html": "David Tooke\nA strong Voice for Cranborne and Alderholt\nHome\nManifesto for Dorset\nDorset Under the Tories\nPlanning\nHow I will fight the Over Development of Alderholt\nElderly Care in Dorset\nYouth Services in Dorset\nEducation in Cranborne and Alderholt\nVolunteer\nReport a Problem\nContact Me\nPrivacy Policy\nPrivacy Policy\nPlease see the link below to\nhttps://www.libdems.org.uk/privacy",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_dorset-under-the-tories/content_8.html": "The Conservative record in Dorset is one of rising Taxes and reduced services.\nThe Tory controlled County Council, although many of its members are well meaning, was ineffective and unable to resist the programme of cuts from the their colleagues in Government.\nIt has overseen cuts in NHS Services and Hospital Closures.\nIt has overseen cuts to funding for Schools.\nIt has cut the Services it provided to residents.\nWe now have fewer Police Officers thanks to funding cuts.\nIn 2019/20 Dorset will get NO grant from central Government. Instead we will all be forced by the Conservative Government to REPAY £10 Million to the Treasury.\nThe new Dorset Council must stand up for the residents. Sadly, the Conservative controlled previous administrations have signally failed to do so.\nLiberal Democrats have a strong history of fighting Conservative excesses, and holding them to account.\nVote Liberal Democrat on May 2nd.\nVote for a strong voice for Cranborne and Alderholt.\nVote for David Tooke",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_getting-in-touch_report-a-problem/content_4.html": "Hi my name is Steve Adams and I live in Wren Gardens problem is the street lighting overnight. It seems very random rather than safe. Our end of the close is in complete darkness when the lights go off which is not only an opportunity for thieves but also dangerous for anyone coming home late or leaving for work early. The one light that is on further down the road does not work properly. I hope you can give this your attention,thank you\nSteve, this is a point that has been raised a few times. The Conservative County Council has cut street lighting in many residential streets, claiming a saving of £300,000 pa. They have said that they have done this only in low risk areas, where their is no increased risk of accidents or crime – I am not sure what statistics they are gathering to support this, and if elected will make it my business to check on this.\nA part of their reasoning is that they have suffered a cut in the grant from central Government, indeed Dorset will shortly be paying some £10 million TO the Treasury. The County Council went through a process that led to them agreeing the Treasury deal, rather than fighting it.\nOr if you let me know the code on the faulty lamp I’ll report it your behalf – the code will be a number 1 – 9 followed by W289 – 1 is at the birchwood drive end and 9 the far end.\nHi my name is Steve Adams and I live in Wren Gardens problem is the street lighting overnight. It seems very random rather than safe. Our end of the close is in complete darkness when the lights go off which is not only an opportunity for thieves but also dangerous for anyone coming home late or leaving for work early. The one light that is on further down the road does not work properly. I hope you can give this your attention,thank you\nSteve, this is a point that has been raised a few times. The Conservative County Council has cut street lighting in many residential streets, claiming a saving of £300,000 pa. They have said that they have done this only in low risk areas, where their is no increased risk of accidents or crime – I am not sure what statistics they are gathering to support this, and if elected will make it my business to check on this.\nA part of their reasoning is that they have suffered a cut in the grant from central Government, indeed Dorset will shortly be paying some £10 million TO the Treasury. The County Council went through a process that led to them agreeing the Treasury deal, rather than fighting it.\nAs far as faulty street lights are concerned the light in question should have an ID code on it, and you can report the fault by following the link at: https://www.dorsetforyou.gov.uk/travel-dorset/roads-and-driving/road-information/street-lighting\nOr if you let me know the code on the faulty lamp I’ll report it your behalf – the code will be a number 1 – 9 followed by W289 – 1 is at the birchwood drive end and 9 the far end.",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_getting-in-touch_volunteer/content_3.html": "If you would like to be part of the team and help spread the word about the Liberal Democrats please get in touch.\nLet me know if you would be able to:\n- Deliver Local Leaflets\n- Display a Window Poster\n- Display a Stakeboard\n- Help bundle and address envelopes\nAll help is valuable and your contribution will be very much appreciated.\nCall me on 07789 692492 or email [email protected]\nPlease follow the link below to see how we securely store any data you provide to us and what use we make of it – and your right to unsubscribe at any time.",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_get-involved/content_11.html": "Δ\nYour email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_feed/content_10.html": null,
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_education-in-alderholt-and-verwood/content_9.html": "Falling numbers at St James First School in Alderholt are creating a problem for the village, with many parents choosing to send their children out of County to Fordingbridge. Having spoken to several parents the main reason seems to be down to the eventual travel to Wimborne QE Upper School, and some preferences for the Burgate pyramid over the QE pyramid.\nAt the same time, pupils from Verwood Middle Schools are also faced with a long journey into Wimborne when they move up. This has created a longstanding demand for a new Upper School in Verwood that could feed from Verwood, Alderholt, and Cranborne catchments.\nThis would help all of these communities, and provide a more coherent education for our children. The current Conservative administration has paid lip service to this need for many years – and achieved nothing.",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_wp-admin/content_14.html": "For security and auditing purposes, a record of all of your logged-in actions and changes within the WordPress dashboard will be recorded in an audit log. The audit log also includes the IP address where you accessed this site from.\nLost your password?\n← Go to David Tooke",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_manifesto-for-dorset/content_13.html": "Manifesto for Dorset Please follow the link below to see the Manifesto as a downloadable pdf https://lookaside.fbsbx.com/file/Manifesto%20Liberal%20Democrats%20Demand%20Better%20for%20Dorset.pdf?token=AWxJ1bHJXaOA8GR5du8NAj6jVz4Spo6gdNOsZJga5xdZZ5C-UHt9awqAAkfTVM4Po8gLJXqk3r_rDlJQQdY1vhc_lrJQ–jGCqbY6hS2JDTS6YcGoqIL0J_pFXBTxUBHDXnT12VDT9_BpyqzSfW9sErFpOcS2VQPH-DMDh6j4OvZ9Ox-EUr3fK3uuiqa6MM9pSU",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk/content_1.html": "Hello, I’m David Tooke and I’m a Liberal Democrat.\nMy wife, Elizabeth, and I have lived in this corner of North East Dorset for the last 30 years and more, raising our two children and growing deep roots here.\nI have served on the Parish Council in Alderholt for several years and am a past Chairman of the Council. I was particularly active getting the Multi-Use Games Area installed, chairing the committee and working closely with other Councillors and residents. I have also been Chairman of the local Rugby Club (now sadly defunct) as well having been a local Scout and Cub Scout Leader for about 10 years. Working together with Cllr Martin Smethers, our local First Responder, we have raised funds for Community Defibrillators and have managed the installation of four functioning AED devices around Alderholt – I believe that these devices are life saving options and should be available in all of the villages within the ward.\nI am concerned about a number of local issues.\n-\n-\n- The Conservative East Dorset District Council, not long before its disappearance, proposed that Alderholt should be at least doubled, and possibly trebled in size. This proposal is wholly unsustainable. Our roads and services are inadequate to support such a gross over-development. We are remote from employment centres so this proposal would lead to much increased car travel. We have virtually no public transport, 1 bus 3 times a week at off peak hours. Health and education will suffer. And the surrounding villages – Cranborne, Sandleheath, and Rockbourne in particular will be choked with up to three times the traffic they suffer from now.\n- The Conservative Council has been cutting subsidies to the local bus services. These are a vital resource helping many people get to the shops, to Doctor and Hospital appointments, to out of hours school activities, and to take a full part in a social life that others take for granted. It is only the efforts of Local Parishes that has saved our 97 Green Bus – for a very limited service.\n-\n-\n- The Conservative controlled County Council cut funding to youth organisations, libraries and other essential services such as, very significantly – care provision for our parents and grandparents. Whilst they may claim that austerity is imposed by central (Conservative) government it is worth noting those areas of service which they feel are disposable.\n-\n-\n- I believe that any building development across the region should include proper provision for Affordable Housing, so that our local young people are able to set up home and raise families, as I was able to. Planning guidelines for the District suggest around 40% of any scheme should be “affordable housing”. Whilst we must build new homes, we must ensure that they are not simply there to be second homes or luxury country getaways. Our Planners seem not to be interested in enforcing this. We already lost the affordable housing promised for Alderholt’s Surplus Stores site – because it was too expensive – a decision unchallenged by the Conservative East Dorset District Council.\n-\n- The road network around Verwood and Alderholt is unable to cope with the amount of traffic it currently carries, both communities are faced with Developer led expansion applications, which would, if permitted, impose even greater burdens on our transport facilities. We badly need improvements to the road network.\n- Both County and District Councils have spent millions of pounds a year on Consultants who are advising on how to make things better. Significant amounts were spent recently on re-organising Dorset Waste Partnership for example, which immediately suffered setbacks with collection rounds missed across the area. The Council must realise they cannot continue to spend OUR money without getting a return.\n-\nI am a Liberal Democrat because:\nI believe in a free, fair, and open society to which people can all contribute, and where all the layers of government exist to help people attain these ideals. I believe that we all need to co-operate as much as possible: locally, nationally and internationally. I believe in individual freedom and human rights, and a strong and competitive economy where the market operates as freely as possible, but where the state takes responsibility for ensuring that this freedom does not abuse vulnerable or minority groups.\nIf you want to know more about Liberal Democrat values please follow the link to the\nPlease feel free to contact me with any questions, and if I can help then I will.\nPlease Like Follow my Facebook Page –",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_my-priorities-for-dorset/content_7.html": "I have been opposed to the plans to build up to 2,400 houses here in Alderholt, and have been opposing them publicly ever since they were published by the Conservative controlled District Council.\nI’ve heard lots of comments from Conservative Councillors that these proposals were put out for Consultation simply as part of the process – but it seems perverse to ask for consultation on plans which you don’t feel reasonably happy with. Consultation is supposed to be a stage to refine plans that you already feel are generally about right, but need refinement. These proposals are NOT “about right” they are fundamentally flawed.\nI have been active within the Parish Council in encouraging all my colleagues there to oppose the plans, and I am a founder member of Action4Alderholt (https://action4alderholt.org.uk/). In those capacities I have had meetings with the original East Dorset District Planners, and the new team from Dorset Council who have now taken responsibility for getting a Local Plan for the whole of the new Dorset Council Area.\nThe Conservative Shadow Council that is currently in charge have said they want to foreshorten the timescale for this process by a year. This is short sighted, and will mean that the planners cannot do a proper job. If elected I would work with the Council and the Planning team to make sure adequate time was allocated for them to look professionally at the whole of Dorset, and not do a rush job where they must try and shoehorn in ill-conceived proposals simply to save time.\nAlong with colleagues in Action4Alderholt we are looking at viable alternative plans that are sustainable and in keeping with local needs. If elected I will ensure that the Planners at Dorset Council are aware of these options and investigate them properly.\nAs a Parish Councillor I have been a champion for the setting up of a Neighbourhood Plan. This is a new option that has been very successful in other parts of Dorset, and across the country. It enables the Local Community to have a greater and more significant influence on any Local Plan that is being developed by the Dorset Council. I intend to continue championing this both at Parish, and within Dorset Council.\nI believe it is important that housing development happens in places close to centres of employment, where good road and rail links exist, and which minimise travel – and therefore minimise pollution leading to Climate Change. Alderholt does not fit that bill.\nIn order to meet targets for housebuilding, and we undoubtedly have a need for new housing across Dorset:\n- I will prioritise brownfield development across Dorset\n- getting empty properties back into use\n- Encourage small scale developments in appropriate areas\n- Require that all private developments contain at least 35% affordable housing\n- Develop Council Owned land for Social Housing\n- Work with and encourage the growth of Community Land Trusts\nDorset as a whole has been one of the greatest victims of Government cuts – in 2018 Dorset County Council received £21.4 Million less than the average Rural County and if elected I will join in campaigning with my colleagues to increase the money allocated to us from Central Government, and begin to end the Conservative Austerity measures that have blighted so many lives.\nP",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_elderly-care-in-dorset/content_6.html": "According to a recent report from the Better Care Fund – of which the new Dorset Council is a major stakeholder, the number of older people living in Dorset will continue to grow, adding to increased demand for health and care services\n24% of the current population are over retirement age (65 and over) which is greater than the equivalent values for both the South West (21%) and England and Wales (18%). 28,500 people are aged over 85 (4% of the current population);\nWith regard to physical health, the most common single causes for admission to hospital for individuals aged 65 – 84 years are cancer and circulatory conditions. In the 85+ population the single largest admission cause is circulatory conditions;\nWith regard to mental health, dementia and depression are the most common mental health disorders of later life. The prevalence of dementia increases with age, affecting 5% of people over the age of 65 and 20% of those over the age of 80;\nAll of these issues face us at a time when the Conservative Government is drastically cutting the Revenue grant to Dorset.\nIt is also happening at a time of unprecedented stress on workforce levels – with many EU carers returning home rather than facing the uncertainty of Brexit.\nThe main thrust of the Dorset Care Plan is an acceptance of the funding cuts and a reliance on providing information to people as to how they can help themselves. Which sounds good in principle, but leaves the elderly with a mass of confusing and self-contradictory information to sort through, and provides no additional real practical help for them.\nThe elderly are part of our community, our parents and grandparents, they deserve better.",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_youth-services-in-dorset/content_12.html": "In 2016 the Conservative County Council voted to slash funding to Dorset Youth Services by £1 Million\nThis resulted in job losses, with the Council backing out of support for youth groups across the county, and asking for local volunteers to pick up the slack.\nMany of the children using these centres are from vulnerable backgrounds, and the loss or downgrading of these facilities will have a disproportionate effect on those who already suffer the most.\nLiberal Democrats believe that support for our most vulnerable is a duty of care that the Council must not shirk.",
  "https_davetooke_focusteam_org_uk/https_davetooke_focusteam_org_uk_planning/content_2.html": "Planning is supposed to help communities improve their environment, providing housing and infrastructure that is in keeping with the needs of the local community.\nCurrently Alderholt is facing a huge challenge, following the mis-guided proposals by the old East Dorset District Council to double or possibly treble the size of the village.\nThese proposals are mis-guided for several reasons :\nTransport Infrastructure –\nAlderholt is located on the north east edge of the District and has been identified as a Rural Service Centre (Draft Policy 3.2). The village has a number of surrounding isolated houses together with some smaller villages and hamlets. Alderholt has a small Co-Op convenience store, a second hand baby clothes shop, one pub, one social club, and a part-time doctors surgery (a part of the Fordingbridge practice). It also has a motor repair garage. Other than these facilities there is no real service centre here, and residents in the outlying areas tend to use Fordingbridge, Verwood, and Ringwood for most facilities – as indeed do Alderholt residents.\nThe roads connecting Alderholt to these larger towns are very poor and constricted in places and would be extremely expensive to improve – and indeed the roads to Fordingbridge and Ringwood are mostly within Hampshire, rather than Dorset.\nThe National Planning Policy Framework (NPPF) recently revised by the Government (2018) requires in Para 102 that: “Transport issues should be considered from the earliest stages of plan-making and development proposals…” No such issues have as yet been considered, rather they are in progress. They should have been done as a pre-requisite, before drafting the plan. Para 103 also requires that: “Significant development should be focused on locations which are or can be made sustainable, through limiting the need to travel and offering a genuine choice of transport modes.”\nThere are currently very limited options for employment within Alderholt, and the Plan does not seek to address this by providing any workshops or commercial premises as part of the development. Mention has been made of live/work accommodation, but it must be apparent that this would be of use in only a very limited number of cases.\nEducation\nAlderholt has a First School, but currently no provision for older children. The natural Dorset Pyramid would then send children to Cranborne Middle School and then on to QE at Wimborne. Both of these later stages involve children being bussed several miles every day.\nMany of our children are actually attending Fordingbridge or Downlands for their primary education, and entering the Burgate Pyramid rather than QE for easier travel.\nSchools in Fordingbridge will be affected by the development of Alderholt, combined with planned developments in Fordingbridge itself and other surrounding locations. These, in combination, will undoubtedly increase demand for school places in Fordingbridge, which will presumably cater for its Hampshire catchment first – potentially denying this option to Aderholt residents.\nThe Local plan offers simply the vague wording that: “The impact of new development on education provision in Alderholt is an important consideration. The impact on education provision of potential new sites identified in this Local Plan review is being assessed. Any new housing allocations at Alderholt would be required to make provision for new facilities or provide developer contributions to enhance provision locally.”\nVerbally we have been told that this might involve enlarging St James. There is also the long standing issue of building an Upper School in Verwood – which has being a topic of discussion the last quarter century, without resolution.\nWithout concrete proposals being made then this seems to be unsatisfactory, merely kicking the issue into the long grass. There is no reason to suppose that anything will actually be done.\nHealth\nMost residents in Aderholt use the Fordingbridge practice, though a few do use Cranborne, Verwood and 6d Handley. Fordingbridge is of course a Hampshire based practice, whilst (I understand) 6d Handley has transferred to Wiltshire.\nFordingbridge practice is currently under some strain, being unable to attract as many GPs as it ideally needs. If this development in Alderholt goes ahead, along with the planned growth in Fordingbridge itself, then the practice may be unable to cope with the numbers. Its possible that under such circumstances it would close its doors to new out of county (ie none Hampshire) patients.\nCurrently the service offered by Fordingbridge is – whilst under some strain, as are most NHS facilities – comprehensive, with access to several GPs if your own doctor is unavailable, and there are excellent nurse facilities, with Nurse Practitioners on site.\nEven if there is a full time Practice created in Alderholt, in the event that the developments go ahead, this will inevitably be a much smaller organisation, with far fewer Doctors and limited access to Nurse Practitioners. I do not believe that Alderholt residents will be able to get as good service as we currently get.\nI believe that there are far better solutions to meeting the housing requirements for Dorset than dumping 40% of East Dorset’s quota on a small rural village .\nWe should look at either spreading the load across the whole of the Dorset area – or creating a Garden Town close to decent transport, road and rail links, and employment. This would minimise the need for travel to work, relieving congestion, pollution, and reducing any impact on Climate Change.\nAs a Liberal Democrat I believe in the principles of Localism, and have been instrumental in getting the Parish of Alderholt declared a Neighbourhood Area – with a view to Alderholt developing its own Neighbourhood Plan. We are one of the very first such areas in East Dorset.\nClimate Change\nClimate change is the single most important challenge we face in this country, indeed across the world. Climate change will create famine and trigger a migration crisis that makes our current problems seem trivial.\nThe proposals to put a dormitory of over 3,000 houses in this area, where there is very little local employment and no commuter based public transport, will mean that residents will have to drive to places of work, many miles away.\nThis can only increase levels of pollution and fail climate change targets."
}