{
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_david-sidwicks-speech-following-declaration-results-friday-7th-may-2021/content_6.html": "Having been returned by the people of Dorset as their Police and Crime Commissioner, David Sidwick stated that he was humbled by the support he has had. He thanked his wife, agent and area campaign manager and went on to particularly thank the local Conservative Associations and all the many people who had volunteered to deliver or donate to his campaign. They had wrestled with hailstones, letterboxes and hidden canines to get the message out there and he was deeply grateful.\nThe job starts now to drive towards the vision of Dorset being the safest county in the UK. Our mission will be to cut crime and anti-social behaviour. We will get there by having more visible community focussed policing connected to the neighbourhoods they serve. We will fight violent and organised crime and tackle hidden harms such as domestic abuse, child abuse and fraud. We will tackle rural crime and put victims and communities first. Every penny will count for Dorset.\nAbove all else it is the people of Dorset that have given David a strong mandate – it is they he works for and with their help our police will be crimefighters again.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-tomlinson-welcomes-clear-plan-stay-course-prosperity-mid-dorset-and-north-poole/content_67.html": "Michael has welcomed the Autumn Statement, echoing the Chancellor’s argument that it is only by working through the Conservatives’ long-term economic plan that we can achieve prosperity and security for families in Mid Dorset and North Poole.\nThe new forecasts for the British economy in the Autumn Statement shows the Government’s long-term economic plan is working:\n- Deficit will be halved this year\n- British economy expected to grow by 3 per cent this year\n- Employment up and unemployment down – with over half a million new jobs forecast this year\nThe Chancellor set out the next steps in his long-term economic plan in the Statement:\n- We will overhaul stamp duty so that 98% of stamp duty payers pay less tax when they buy their home.\n- We will continue to back businesses to create jobs in all parts of the country - with action on business rates and more help for the high street.\n- We will abolish the jobs tax on apprenticeships for people under 25 to help more young people get the skills they need.\n- We will raise the personal allowance, and higher rate taxpayers will also benefit – a down-payment on our promises to raise the personal allowance to £12,500 and the higher rate threshold to £50,000 in the next parliament.\n- We will cut tax for families by abolishing the air passenger duty paid for children.\n- And we will support savers by letting husbands and wives inherit their partner’s ISA and keep its tax free status.\nThis is excellent news for hardworking families in Mid Dorset and North Poole. The fundamental reform of stamp duty will cut taxes for the overwhelming majority of people trying to buy a house here – and the personal allowance rise and change to the ISA rules back people who want to work hard and save.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_branches/content_28.html": "We have a number of branches across Mid Dorset and North Poole. Our branches cover the following areas:\nBere Regis and Bloxworth\nBroadstone\nCanford Heath\nCorfe Mullen\nLytchett Matravers\nLytchett Minster and Upton\nMerley and Bearwood\nWareham and Sandford\nWimborne and Colehill",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_hustings-2/content_90.html": "Tweet Date Tuesday, 5th May 2015 Time 7pm Church Hustings at The Lantern, MerelyAll Welcome!Please come along to this FREE event and show your support for Michael.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_mdnpca-annual-general-meeting/content_87.html": "Tweet Date Friday, 18th March 2016 Time TBC MDNPCA Annual General MeetingSt Nicholas Church HallContact Nicola Wiggins - [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_mp-news-february/content_3.html": "If you are a regular reader of my column you will know that I very much enjoy visiting schools, or speaking to pupils when they visit Parliament (perhaps it’s in my genes as my family are all teachers!). There are grants available for transport for schools to visit Parliament – please get in touch with my office if you want more information. I have always been passionate about education, and making sure that children in Mid Dorset and North Poole get the very best start in life. Since being elected, I have visited over 30 nurseries, schools and colleges across Dorset and Poole.\nWe are expanding free government-funded childcare, so that eligible working parents will be entitled to 30 hours of free childcare for children from age 9 months. There’s a gradual rollout starting from April, for children over 2. Nurseries, like Bizzybeez in Lytchett Minster that I visited in the autumn, will be able to offer government-funded quality childcare, making it more affordable for people with young children to return to work.\nAt the other end of the scale are our senior schools and colleges. A senior school visit Q&A is very different from a nursery visit for an MP, and students often ask the most challenging questions! I think it is important that our children understand the political process, and I’m always keen to encourage them to get involved. As part of that, I host work experience students every year – to give young people a taste of what it is like to work in politics – either as an MP, councillor, or in an MP’s office. Sometimes this is in the summer, but this coming year I will also be running a work experience program for anyone in year 12 or above during the Easter holidays. I ask the students to write a diary of their time in my office – you can read these on my website. There are also details of how to apply for the Easter week – please do encourage any young people who might be interested to apply. www.michaeltomlinson.org.uk/work-experience\nAs well as our maintained schools, I also visit our independent schools, and have recently heard about some of the excellent work of Canford School in its sponsorship of a local academy, and its work with local community organisations and charities. We are incredibly lucky in Dorset and Poole to have such a wide range of excellent schools for parents to choose from. 99% of children in State schools in Mid Dorset and North Poole are in schools which are classed by Ofsted as Good or Outstanding. I will continue to support our school and teachers across the constituency – and I thank them for their hard work for our children.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_cllr-peter-wharf/content_52.html": "Background: After a successful business career, Peter studied Philosophy, Politics and Economics at Oxford University as a mature student. That failed to dampen his passion for politics and combined with a desire to help people, that passion has been a feature of Peter’s work as a councillor.\nCouncillor: Peter was originally elected as Purbeck District Councillor for Bere Regis and Bloxworth in 2000. He then won the Egdon Heath county council seat from the Lib Dems in 2012 serving a rural area stretching from Bere Regis to Lytchett Matravers.\nWith the emergence of a new Dorset unitary authority Peter was elected with Laura Miller in 2019 to serve the people of West Purbeck.\nAfter taking on a huge variety of key Council roles in the last 20 years, Peter was Deputy Leader of Dorset Council and assumed overall charge of the huge transformation programme as Dorset Council has taken on the former responsibilities of the county council and several district councils. Peter was also responsible for digital Human Resources and Diversity\nPeter serves as a Parish Councillor for Bere Regis.\nContact: Mobile: 07986600799",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_kemis-speech-foreign-policy/content_35.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_new-year-lunch-party/content_86.html": "Tweet Date Sunday, 31st January 2016 Time 12:00 New Year Lunch Party38 Greensleeves Avenue , BroadstoneContact: Liz Beeson email: [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_kemi-gives-speech-alliance-responsible-citizenship-conference/content_73.html": "Tweet Tuesday, 18 February, 2025 National News On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_get-postal-vote/content_70.html": "If you will be away on polling day, at work or on holiday, are physically unable or just don't have the time to get to a polling station to vote in person, you can still exercise your democratic right to vote. You may have moved house since the electoral register was drawn up and have not yet joined the register at your new address.\nYou can choose either to vote by post or to appoint someone else - a proxy - to vote on your behalf.\nTo find out more about voting by post, please visit the Government's official site at:\nhttps://www.electoralcommission.org.uk/i-am-a/voter/apply-vote-post\nFrom this site, you can download an application form to vote by post. Simply print the form out, complete the details and send it to the local Electoral Registration Officer at the local council's offices.\nBournemouth, Christchurch and Poole Council\nBCP Council Civic Centre, Bourne Avenue, Bournemouth BH2 6DY\nTel: 01202 451451\nwww.bcpcouncil.gov.uk\nDorset Council\nDorset Council, County Hall, Colliton Park, Dorchester, Dorset DT1 1XJ\nTel: 01305 221000\nwww.dorsetcouncil.gov.uk",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-visits-wimborne-town-fc/content_40.html": "Michael visited Wimborne Town FC, and was shown round by their club manager Jimmy Glass. Jimmy updated Michael about the club's plans for their site, and they discussed the recent successes of the team. Michael was then delighted to be invited to join the Chairman for lunch before a key game the following day. Ever since going viral for his brilliant knowledge about the club when chatting to Kay Burley of Sky News, Michael has been following the clubs results carefully.\nWhen the club won the Division One South title, Michael ensured that Kay was informed of the result!",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_cllr-stewart-mckell/content_23.html": "Community Campaigner (The Lytchetts and Upton)\nStewart is also a Town Councillor for Lytchett Minster and Upton, serving as Deputy Mayor of the town since 2023.\nStewart is also a Town Councillor for Lytchett Minster and Upton, serving as Deputy Mayor of the town since 2023.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_letter-chair/content_5.html": "Dear Member,\nFull Marks to anyone who saw this coming, it certainly took me by surprise, anyway we have a General Election on Thursday 8th June, and we as an Association must do everything we possibly can to get our candidate Michael Tomlinson re-elected.\nI am not taking anything for granted, and am ignoring the 20 plus point lead the pollsters say we have, and regardless of what the result is Nationally, our priority must be to keep MN&NP blue, and put Michael back into the House of Commons as our MP. We cannot underestimate the Liberal Democrats in this Constituency, as we know they will be working extremely hard to get their candidate elected. If that was to happen it would be a complete travesty, as since Michael was elected in May 2015, he has worked extremely hard establishing himself as a good and caring Constituency Member of Parliament. He deserves the right to continue working on behalf of the Constituents of MD&NP.\nTo achieve this I am appealing to you to help in the campaign, and there are a number of ways in which you may be able to help us, and please do not be put off thinking that if you volunteer we will be loading you with days of work, every hour you are able to offer will be a great help.\nThe most important task is getting our message to every constituent in MD&NP, and this is where deliverers are so important. Not all delivery rounds have hills and long drives, and delivering to 60 or 70 houses in an hour is easily achievable, your branches will be able to select rounds which are within your capabilities.\nIf you are able to help in any way please contact me by email [email protected] or telephone on 01202 604306\nKindest Regards\nAllen Lewis\nChairman of MD&NP Conservative Association",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_type_Association-Officers/content_7.html": "Cllr Bill Pipe Community Campaigner (The Lytchetts and Upton) President of Mid Dorset and North Poole Conservative Association CampaignerAssociation Officers",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_accessibility/content_47.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_membership/content_51.html": "Being a member of the Conservatives means that you have joined the most open and democratic political party in Britain. After the first three months of your membership, you will be entitled to a vote in Party ballots. You will also have a chance to influence Party policy by letting us know your views.\nAny person living in the United Kingdom is eligible to join the Conservative Party. Applicants are not required to be registered voters or UK nationals. There is no upper or lower age limit on membership, although children under the age of 15 cannot be enrolled as full voting members.\nWe must capitalise on this current resurgence, and strive for a larger, stronger and co-ordinated membership.\nYou can join online today!\nFor information about joining, please contact us: [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_cllr-bill-pipe/content_60.html": "Background: Poole-born, Bill served in the Royal Navy for 25 years until 1997 when he set up an auction company selling items of postal history such as historic letters. His children range in age from 7 to 18 and are being educated at local state schools.\nCouncillor: First co-opted on to Lytchett Minster and Upton Town Council in 1999, he rejoined the Council in 2020\nBill has twice unseated existing Liberal Democrat councillors, firstly in 2007 in Lytchett Minster & Upton West where he served 12 years as a District Councillor. He also won the Lytchetts and Upton County Council seat in 2016 and served on both Dorset County Council and Purbeck District Council until councils were merged in 2019.\nAs a Purbeck Councillor, for four years Bill chaired the Licensing Board while also the portfolio holder for Inclusion & Communities; with responsibility for all things health, policing and community. He was also interim chairman of the Police & Crime Panel.\nAs a County Councillor, Bill served as chairman of the Health Scrutiny Committee and also chaired the regional Joint Health Scrutiny Committee.\nAs a Dorset Councillor, Bill chaired the Appeals Committee for the whole of Dorset and served as the Vice-Chairman of the Western & Southern Planning Committee.\nOther: A key figure in the local Conservative branch for many years Bill is also President of the constituency-wide Association.\nHe served 12 years as a Governor at Upton Junior School including three years as the Chair of Governors\nHe has introduced and run many schemes to make the area a safer and better place to live including the still active Upton and Lytchett Minster Speedwatch and P.A.C.T [Partners And Communities Together]. He campaigned for many years for a Zebra Crossing on Dorchester Road, Upton and was successful in getting it sited opposite Sea View Road in 2020.\nIn Spring 2020, Bill, always a champion of the underdog, established and then led Upton Together, a community organisation with 50 volunteers which helps many hundreds of our community and beyond to access shopping, prescriptions, financial assistance, anonymous access to our food bank and much more. He is committed to ensuring Upton Together continues to deliver vital local services. “My Community is my beating heart and I am at the heart of my community”\nContact: Mobile: 07880 504379",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_mp-news-march/content_17.html": "As a Minister in the Home Office, my focus has changed slightly from the legal perspective as Solicitor General, to a more overall view of crime and law and order. As a former barrister, I have always had a particular interest in upholding law and order and justice, and I’m pleased this can continue. Of course, I’m still a local MP, as well as being a Government Minister.\nSometimes these two roles combine – as with my recent visit to the Dorset Police Marine Unit. I was there as a Government Minister to discuss their progress on stopping organised crime, and protecting our borders, and it’s also my local force. Amongst other things, I saw first-hand the important role the Marine Unit plays in protecting our border and stopping people smugglers and illegal migrants from reaching our shores undetected. It was useful to discuss the challenges they face on the coastline – and I got the chance to get out on the water with the team. It is clear that the challenge we’re facing with illegal Channel crossings affects the whole south coast, not just Kent.\nDuring Apprenticeship week I chatted to some Border Force apprentices about their work. Our Border Force work tirelessly 24/7 to keep our country secure, and it was great to see the work that they are doing at our airports.\nOne of my responsibilities as a Minister is speaking on behalf of the Government in debates. This might be to open the debate and introduce the topic, or it might be to close the debate after other colleagues have spoken. Recently I have spoken in various different debates about knife crime. I was pleased to be able to highlight the work being done here in Dorset by our Police and Crime Commissioner David Sidwick. We have the second lowest rate of knife crime across England and Wales, but we are not complacent. I am pleased that in Parliament we have passed strong legislation to ban zombie-style knives, and we are increasing the penalties for carrying knives. I will continue to support our police forces in the work that they do, and I thank them for their service to our communities.\nI continue to hold regular surgeries in the constituency so please do get in touch if there is something you need help with, or if you’d like me to visit your organisation or business. Email me on [email protected] or contact my office on 01202 624216. You can also follow what I’ve been doing on Twitter @Michael4mdnp or Facebook www.facebook.com/michael4MDNP or on my website www.michaeltomlinson.org.uk",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/content_1.html": "Tweet Community Campaigner (Colehill and Wimborne Minster East) Campaigner KD is also a Parish Councillor for Colehill.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_dinner-rt-hon-dr-liam-fox-mp/content_84.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nDinner with Rt Hon Dr Liam Fox MP\nTweet\nDate\nFriday, 23rd January 2015\nTime\nTBA\nKeep the date, more details to follow!",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-tomlinson-standing-mid-dorset-and-north-poole/content_26.html": "Mid Dorset and North Poole conservatives are delighted that Michael Tomlinson is standing again for election to Parliament.\nIf you would like to get involved in the campaign, please email [email protected]\nMid Dorset and North Poole conservatives are delighted that Michael Tomlinson is standing again for election to Parliament.\nIf you would like to get involved in the campaign, please email [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_category_National-News/content_32.html": "The Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News\nKemi gives a speech at the Alliance for Responsible Citizenship Conference 18th February 2025 On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values National News\nRebuilding Trust with our new Immigration Policy 10th February 2025 Kemi’s new plan for immigration shows the Party is back in the service of the British people National News\nKemi’’s First Speech of 2025: Rebuilding Trust 27th January 2025 Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party National News",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_contact/content_41.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nContact\nLeave this field blank\nMid Dorset & North Poole Conservative Association\nthegreenhouse, Mannings Heath Road, Poole, Dorset BH12 4NQ\n01202 624216\n[email protected]\nMid Dorset & North Poole Conservatives\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-tomlinson-attends-remembrance-parade/content_15.html": "Michael Tomlinson was proud to take part in the Remembrance Parade and service in Wareham, as a guest of the Royal British Legion, to honour the fallen who have served our country.\nMichael Tomlinson was proud to take part in the Remembrance Parade and service in Wareham, as a guest of the Royal British Legion, to honour the fallen who have served our country.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_hustings-1/content_85.html": "Date\nWednesday, 29th April 2015\nTime\n7pm\nElection Hustings at St Johns Church, 13 Tudor Road, Poole\nAll welcome!\nPlease come along to this FREE event and show your support for Michael.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_about-rss/content_22.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_sean-gabriel-prospective-conservative-candidate-canford-heath-ward-bcp-council-election/content_11.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_conservative-response-labours-emergency-budget/content_24.html": "Tweet Wednesday, 26 March, 2025 National News Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_type_Unitary-Councillors/content_69.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nUnitary Councillors\nCllr Laura Beddow\nDorset Councillor for West Purbeck\nUnitary Councillors",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_kemi-launches-policy-renewal-programme/content_50.html": "Tweet Tuesday, 18 March, 2025 National News At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_type_Campaigner/content_16.html": "Cllr Bill Pipe Community Campaigner (The Lytchetts and Upton) President of Mid Dorset and North Poole Conservative Association CampaignerAssociation Officers",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_broadstone/content_68.html": "Tweet Broadstone Committee Allen Lewis (Chairman) Julia Wenham (Deputy - Political) David Wenham (Deputy - Membership) Stella Lewis (Deputy - Treasurer) Liz Beeson (Secretary)",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_Join/content_57.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_lytchett-matravers/content_62.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nLytchett Matravers\nTweet",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_michael-tomlinson/content_14.html": "Parliamentary Candidate for Mid Dorset and North Poole\nThe Right Honourable Michael Tomlinson KC is the Conservative Parliamentary Candidate for Mid Dorset and North Poole.\nYou can find out more about Michael and his work at www.michaeltomlinson.org.uk.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_punch-lunch-1/content_83.html": "Date\nSunday, 13th December 2015\nTime\n12:00\nPunch Before Lunch\nDeans Court Wimborne\nGuest of Honour Simon Hoare, MP\nby kind invitation of Sir William and Lady Hanham\nContact Mike Bartlett:\nTel: 01202 885160\nMobile: 07847 271198\nemail: [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_cdn-cgi_l_email-protection/content_42.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_cookies/content_36.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_pmqs-and-ventriloquist/content_76.html": "There was a curious sight at PMQs today. There appeared to be a ventriloquist in the house as the leader of the opposition was delivering his lines. John Denham, sitting directly behind Ed Miliband, was mouthing what the leader of the opposition was saying. Louise Mensch MP had asked a question of the Prime Minister about the forthcoming strikes. She tweeted later that John Denham was \"mouthing the rehearsed lines literally word-for-word.\" She added, \"The ventriloquist act went on for questions after question, word perfect. Our benches couldn't believe it.\"\nHave a look for yourself at PMQs here.\nIf you spot curious goings on at Westminster in general or PMQs in particular, then let me know. I will publish the best responses. [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events/content_37.html": "Association Dinner at Merley House with Alex Burghart MP 6th June 2025 6:30pm Join the Members of Mid Dorset & North Poole Conservative Association on Friday 6th June at 6:30pm for another sociable event at: Merley House BH21 3AA Both...",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-tomlinson-mp-lobbies-more-funding/content_58.html": "Following his meeting with school head teachers and governors, Michael Tomlinson MP organised a meeting for Dorset MPs with the Chief Secretary of the Treasury, Liz Truss.\nThey discussed the importance of ensuring that all schools get fair funding, including grammar schools, small schools and rural schools. They also discussed the additional funding needs for pupils with Special Educational Needs.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_hustings-0/content_80.html": "Date\nTuesday, 28th April 2015\nTime\n7pm\nChurch Hustings at Corfe Mullen Baptist Church, Newtown Lane.\nAll Welcome!\nPlease come along to this FREE event and show your support for Michael.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_category_Local-News/content_12.html": "May MP News 2nd May 2024 News from Westminster Last month I hosted a group of work experience students in the constituency office. Ten students from six different schools gave up a week... Local News\nMichael Visits Wimborne Town FC 1st May 2024 Michael visited Wimborne Town FC, and was shown round by their club manager Jimmy Glass. Jimmy updated Michael about the club's plans for their site, and they... Local News\nMP News - March 1st March 2024 As a Minister in the Home Office, my focus has changed slightly from the legal perspective as Solicitor General, to a more overall view of crime and law and... Local News\nMP News - February 1st February 2024 If you are a regular reader of my column you will know that I very much enjoy visiting schools, or speaking to pupils when they visit Parliament (perhaps it’s... Local News\nMike Barron joins the Conservative Group at Dorset Council 15th December 2021 Leader of the Conservative Group at Dorset Council – Cllr Spencer Flower is delighted that Mike Barron has joined the Group. It can be seen as a ringing... Local News\nDavid Sidwick's speech following declaration of results on Friday 7th May 2021 12th May 2021 Having been returned by the people of Dorset as their Police and Crime Commissioner, David Sidwick stated that he was humbled by the support he has had. He... Local News\nSean Gabriel, prospective Conservative candidate for Canford Heath Ward, BCP council election on Thursday 6th May. 5th February 2021 Local News\nMichael Tomlinson attends Remembrance Parade 10th November 2019 Michael Tomlinson was proud to take part in the Remembrance Parade and service in Wareham, as a guest of the Royal British Legion, to honour the fallen who have... Local News\nMichael Tomlinson standing for Mid Dorset and North Poole 10th November 2019 Mid Dorset and North Poole conservatives are delighted that Michael Tomlinson is standing again for election to Parliament. If you would like to get involved in... Local News",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-tomlinson-meets-assistance-dog-owners/content_78.html": "Michael Tomlinson MP supported a campaign to tackle discrimination against guide dog owners at an event in Parliament organised by the charity Guide Dogs.\nOn Wednesday, 19 June, more than a hundred guide dog owners from across the country converged on Westminster Hall in Parliament to share their experiences of being turned away by businesses because of their dog. At the event, the MP for Mid Dorset and North Poole spoke to guide dog owners about the lasting impact of these refusals.\nIt is against the law to refuse access to a disabled person accompanied by an assistance dog except in the most exceptional circumstances. Despite this, a new Guide Dogs survey found that three out of four (76%) assistance dog owners had been turned away because of their dog.\nTaxis and minicabs were the worst offenders – experienced by 73% of those reporting refusals in the last twelve months. Refusals at restaurants (54%), newsagents (42%) and high street shops (36%) were also common.\nGuide Dogs are calling for all taxi and minicab drivers to be required to take disability equality training so they are aware of the rights of disabled passengers. Guide Dogs also supports changes to equality legislation to make action against businesses who refuse access easier.\nMichael Tomlinson MP said:\n“It was disturbing to hear how common these incidents of discrimination are for assistance dog owners. No one should be turned away on their local high street because of their assistance dog.\n“I support Guide Dogs’ Access All Areas campaign to tackle the ignorance that causes access refusals, and make sure businesses are held accountable when they occur.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_feed/content_66.html": null,
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_campaign-merley-economic-secretary-treasury-andrea-leadsom-mp/content_88.html": "Date\nThursday, 5th March 2015\nTime\n3pm\nCome along and join us for an afternoon of campaigning with Andrea Leadsom MP for South Northamptonshire and Economic Secretary to the Treasury.\nMeet at The Willett Arms 3pm. All welcome.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_kemis-statement-ukraine/content_45.html": "Tweet Monday, 3 March, 2025 National News Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_type_Police-and-Crime-Commissioner/content_9.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nPolice and Crime Commissioner\nDavid Sidwick\nPolice and Crime Commissioner for Dorset\nPolice and Crime Commissioner",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-tomlinson-encourages-mps-be-youth-friendly/content_77.html": "As part of his work with the Youth Employment All Party Group, on the 17th of June Michael hosted a drop-in session for MPs to sign the Youth Friendly MP Charter.\nSigning the Charter pledges support to five key principles of youth employment in Mid Dorset & North Poole:\nYouth Voice, Developing Young People, Creating Opportunities, Recognising Young Talent, Fair Employment,\nMichael said \"as a Youth Friendly MP, and chair of the Youth Employment all party group, I will be leading the charge for creating Youth Friendly Communities; communities where every stakeholder (young people, government, educator, employer, parent, and youth group) is working together to create a place where all young people can fulfil their potential.\"",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_merley-and-bearwood/content_44.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nMerley and Bearwood\nTweet",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_police-and-crime-commissioner-candidate-dorset/content_82.html": "Why Vote for David Sidwick?\nI have spent more than 18 months learning about policing both within Dorset and by working with other PCCs. In addition, I have met with residents and other stakeholders across the county, from Lyme Regis to Alderholt, from Weymouth to Gillingham. These experiences coupled with the interaction with residents, means I can state categorically I shall be the most prepared for the role if you decide to elect me.\nMy background in strategy, communication and resource allocation is perfect for the role of acting as the people’s champion and holding the police to account through the office of the Chief Constable. My vision is to make Dorset the safest county in the UK through making it my mission to reduce crime and anti-social behaviour. My values are Justice, Fairness, Community and Respect and my purpose is to keep people safe and secure. For more about David see his page here.\nShould I become your Police and Crime Commissioner, I pledge to work tirelessly to keep the people of Dorset safe and secure. Below I have listed the steps I will take to ensure that happens:\nMy 6 Point Plan:\n-\nTo make the first priority to cut crime and anti-social behaviour.\nThis will be the number one priority for the police to provide a robust focus to cut violent crime, rural crime and the constant grind of ASB - so people across Dorset see a clear difference and feel safer.\n-\nTo make policing more visible to prevent crime.\nTo increase the number and visibility of police officers in our neighbourhood teams so police again fulfil a prevention role and the people and businesses across Dorset experience less crime. Contact will be improved so people know their police, see them around and can contact them easily when needed.\n-\nTo fight organised and violent crime.\nTo tackle organised gangs, be tough on drugs and the violence around drugs and to tackle “hidden harms” such as child abuse, domestic violence, hate crime, modern slavery and cyber crime.\n-\nTo fight rural crime.\nTo significantly increase the rural crime team and their capabilities and to have specific strategies to address burglary, anti-social behaviour and farm theft in the rural community.\n-\nTo put victims and communities first.\nSupport all victims - particularly the elderly and vulnerable - and build community strength by working together with councils and agencies - supporting volunteers such as Neighbourhood Watch, Community Speedwatch, and increasing opportunities for the young with initiatives like Police Cadets.\n-\nTo make every penny count for the needs of the people of Dorset.\nTo resource and transform the front-line and reduce administration so patrol and response teams can spend more time out on the beat - Engaging with our communities, gathering intelligence and making residents feel safer on our streets.\nMore details:\nFor more details about David Sidwick's campaign see his website here, or email him on [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_category_Articles/content_4.html": "Letter from the Chair 9th May 2017 Dear Member, Full Marks to anyone who saw this coming, it certainly took me by surprise, anyway we have a General Election on Thursday 8th June, and we as an... Articles\nMichael Tomlinson welcomes increased funding for school buildings in Mid Dorset and North Poole 27th March 2015 Michael has welcomed the news that Corfe Hills, Poole Grammar and St Michaels, Colehill will all receive funding to improve the school buildings. This is part... Articles",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_helen-lawrence/content_25.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nHelen Lawrence\nTweet\nDeputy Chair (Political)\nAssociation Officers\nContact Helen:",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_john-kent/content_56.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nJohn Kent\nTweet\nTreasurer\nAssociation Officers\nContact John:\nVia emailing\n[email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_rebuilding-trust-our-new-immigration-policy/content_74.html": "Tweet Monday, 10 February, 2025 National News Kemi’s new plan for immigration shows the Party is back in the service of the British people\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_hustings/content_91.html": "Tweet Date Wednesday, 15th April 2015 Time 7.30pm Election Hustings at Wimborne Minster Church.All Welcome!Please come along to this FREE event and support Michael.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_canford-heath/content_38.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nCanford Heath\nTweet",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_about-us/content_18.html": "The Conservative Party in Mid Dorset attracts members and volunteers from across the County of Dorset. There are regular Conservative Policy Forum meetings, where members and guests can discuss policy issues. We also hold a number of social and political events in what is a packed social calendar! We are a broad church, and we encourage open debate and accept differences of opinion.\nWhat unites the Party are the core Conservative principles which provide our foundation.\nFreedom\nConservatives believe in less interference from the State - freedom for individuals, families, voluntary groups and businesses.\nEnterprise\nConservative want to keep taxes low and set businesses free from red tape to help Britain compete in the global economy.\nResponsibility\nConservatives stand for the rule of law and support for all members of our society. We recognise our duty to protect the environment for future generations.\nNation\nConservatives want to safeguard the Union of Great Britain and Northern Ireland, maintain strong defence and uphold our right to national self-government.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_mike-barron-joins-conservative-group-dorset-council/content_13.html": "Leader of the Conservative Group at Dorset Council – Cllr Spencer Flower is delighted that Mike Barron has joined the Group. It can be seen as a ringing endorsement of the positive work this Conservative administration has achieved in driving transformation, economic development, the environment, Adult Social Care, children's services and much more. It demonstrates that having an optimistic and positive vision for Dorset will achieve far more than negativity, cynicism and party politicing. I feel sure that Mike will be a great asset to our team at Dorset Council and I, as Leader, along with Paul Harrison as his Corfe Mullen Ward colleague, look forward to working with Mike. A warm welcome to our Group.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_kemis-first-speech-2025-rebuilding-trust/content_54.html": "Tweet Monday, 27 January, 2025 National News Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_cllr-sean-gabriel/content_39.html": "Community Campaigner (The Lytchetts and Upton)\nSean is also a Town Councillor for Lytchett Minster and Upton.\nHe previously served as a Poole Borough Councillor (2015-2019) and a BCP Councillor (2021-2023). Sean was Mayor of Poole for the civic year of 2018-2019, previously serving as Sheriff of Poole (2017-2018).",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_category_Westminster-News/content_46.html": "Prime Minister's Statement 9th September 2022 The Prime Minister's statement on the sad passing of Her Majesty Queen Elizabeth II We are all devastated by the news we have just heard from Balmoral. The... Westminster News\nMichael Tomlinson meets Assistance dog owners 4th July 2019 Michael Tomlinson MP supported a campaign to tackle discrimination against guide dog owners at an event in Parliament organised by the charity Guide Dogs. On... Westminster News\nMichael Tomlinson MP lobbies for more funding 18th June 2019 Following his meeting with school head teachers and governors, Michael Tomlinson MP organised a meeting for Dorset MPs with the Chief Secretary of the Treasury... Westminster News\nMichael Tomlinson encourages MPs to be youth friendly 17th June 2019 As part of his work with the Youth Employment All Party Group, on the 17th of June Michael hosted a drop-in session for MPs to sign the Youth Friendly MP... Westminster News\nMichael presents report to Minister 12th June 2019 In his position as chair of the Youth Employment All Party Parliamentary Group, Michael met the Minister of State for Skills and Apprenticeships Anne Milton... Westminster News\nMichael Tomlinson welcomes clear plan to stay on course to prosperity in Mid Dorset and North Poole 3rd December 2014 Michael has welcomed the Autumn Statement, echoing the Chancellor’s argument that it is only by working through the Conservatives’ long-term economic plan that... Westminster News\nPMQs and the \"ventriloquist\" 23rd November 2011 There was a curious sight at PMQs today: someone mouthing the rehearsed lines of the leader of the opposition. Find out who is was ... Westminster News\nConservative Party Conference 6th October 2011 The Prime Minister has delivered his keynote speech at the Conservative Party Conference in Manchester. Westminster News",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_map-locations/content_33.html": "Map of Mid Dorset and North Poole\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_bere-regis-and-bloxworth/content_64.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nBere Regis and Bloxworth\nTweet",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_type_Parliamentary-Candidate/content_10.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nParliamentary Candidate\nMichael Tomlinson\nParliamentary Candidate for Mid Dorset and North Poole\nParliamentary Candidate",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_lytchett-minster-and-upton/content_65.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nLytchett Minster and Upton\nTweet",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-presents-report-minister/content_75.html": "In his position as chair of the Youth Employment All Party Parliamentary Group, Michael met the Minister of State for Skills and Apprenticeships Anne Milton.\nMichael presented her with the APPG's latest report on employer support for youth employment.\nMichael said \"There’s brilliant work going on to support young people in the workplace, but more work has to be done to reach disadvantaged communities.\"",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_dinner-rt-hon-oliver-letwin-mp/content_81.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nDinner with Rt Hon Oliver Letwin MP\nTweet\nDate\nFriday, 6th March 2015\nTime\nTBA\nSave the date, more details to follow!",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_corfe-mullen/content_63.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nCorfe Mullen\nTweet",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk/content_31.html": "Mid Dorset and North Poole Conservatives\nWelcome to the website of Mid Dorset and North Poole Conservatives. On this site, you can find out more about being a Conservative, and the work we are doing in our local community. Michael Tomlinson is our candidate standing to be elected to Parliament in the coming election - please do visit his website for news about what he has been doing in our area. Please do get in touch!\nUpcoming Events\nNational News\nCandidate Photos\nNo image data found.\nContact us\nJoin or renew\nHelp us take action on local issues and build a better Britain.\nGet Updates from our Candidate\nDonate\nWe rely on the support of individuals like you.\nMap of Mid Dorset and North Poole\nThis map shows the extent of the geographical area of Mid Dorset.\nClicking on the arrow below reveals a map of events and news articles near you, that will grow over time. Individual events and news articles are represented by pins of different colours and you will be able to click on them to find out more information.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_conservative-partys-final-party-election-broadcast/content_43.html": "Tweet Tuesday, 29 April, 2025 National News Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are\nConservative response to Labour's Emergency Budget Wednesday, 26 March, 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_jane-newell/content_59.html": "Chair of Mid Dorset and North Poole Conservative Association.\nJane was elected chair of MDNPCA in October 2020. Born in East London, raised in Essex then Hampshire she moved to Dorset at the age of 18 to train as a teacher and never left! She taught in various schools in Dorset including Upton, West Moors and became deputy head teacher of a Poole school. Retired from teaching, she now retains her school links as a governor at Merley First and Portfield (Autism Wessex) schools.\nShe became involved with the association when she moved to Corfe Mullen in 1997, then Broadstone in 2002. Initially helping her husband she increased her involvement in the local party. In 2013 Jane was invited to join the then parliamentary candidate, Michael Tomlinson, target seat campaign team for the 2015 general election and was delighted to help turn the constituency blue. She has helped at every election in the constituency since 1997.\nJane served as a councillor for Merley and Bearwood, Borough of Poole council, from 2015 to 2019. Her roles included chairing the Health and Social Care Overview and Scrutiny committee, member of Children and Young People committee and Dementia Champion.\nJane has been married to David for over 30 years. They enjoy travelling and walking, especially when delivering leaflets. She is a lifelong West Ham United supporter with Bournemouth AFC as her second team.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_david-sidwick/content_61.html": "Police and Crime Commissioner for Dorset\nI was born in Bournemouth and attended St Luke's Primary School in Winton, followed by Bournemouth School. Dorset has always been my home apart from when I studied Anatomical Science at The University of Bristol. After graduating, I joined the pharmaceutical industry as a representative for Parke-Davis. My first area was Dorset and as my job involved a lot of travelling across the county, my love for the countryside was strengthened even more.\nDuring my career within the sector, I undertook many rewarding management and marketing roles, one of which was joining the UK Management Board for Parke-Davis as CNS Therapy Director (Marketing Director). During this time, I also achieved an MBA with Distinction from Manchester University.\nThroughout my various roles, I was responsible for substantial budgets and members of staff. One of my top achievements was to bring to market the first treatment for neuropathic pain in Europe against strong US opposition. This career gave me a thorough grounding in strategy, communication and resource allocation.\nWhat's more, these experiences proved to be invaluable when I subsequently decided to set up my own business. For nearly 2 decades, STAC Consultancy facilitated the education of more than 17,500 secondary care consultants in areas such as chronic pain, epilepsy, dementia and multiple sclerosis. My professional career has given me experience of large multi-national organisations as well as the needs of a small, lean business.\nI have also been the secretary of a foundation which awarded more than a quarter of a million pound of grant funding to medical professionals. I was also a Non-Executive Director for a healthcare company and was instrumental in trebling their turnover.\nFor the past decade, I have been a governor at Bournemouth School. Since becoming Vice Chair/Chair, I led a strategic review which meant a change in vision to ensure the most local community focussed and progressive admission policy in the UK which allowed the acquisition of the largest capital investment since the 1970s.\nI am happily married and a father, and hopefully in the not too distant future we will be welcoming a puppy into the family too.\nIn my spare time I enjoy playing board games with my friends and family and getting out in the Dorset countryside - it's a bonus if a pub lunch is involved too!\nDavid was elected in 2021, and re-elected in 2024.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_may-mp-news/content_20.html": "News from Westminster\nLast month I hosted a group of work experience students in the constituency office. Ten students from six different schools gave up a week of their Easter holiday to gain an insight into the world of local and national politics.\nA few years ago, I was the chairman of the All-Party Parliamentary Group on Youth Employment, and it was clear from our research that it is important that young people can have the opportunity to see first-hand how the skills and knowledge they are developing at school can be transferred into the work place.\nMy staff and I arrange a varied programme of activities which are both interesting, and reflect the types of work my staff and I do on a regular basis. This involves some of the more mundane administrative tasks like putting hundreds of letters into envelopes and delivering leaflets, as well as the highlights! During the week, the young people had the chance to ask questions of a member of the House of Lords in a virtual Q & A; chat to my staff about what it is like to work in the seat of our democracy in Parliament; find out about being a local Town or Dorset Councillor; and chat to me about their plans for their future careers. They asked me about being a local MP and Cabinet Minister, and we challenge them too - we ask them to imagine they are in charge. What laws would they change? What would they ban? How would they react to differing demands on their time? What would they do to solve various national issues? If they could be Prime Minister, who would they choose to be in the Cabinet?\nThey also take part in a Parliamentary-style debate on an issue that might particularly affect young people. This time they chose the legalisation of cannabis – a controversial topic! As expected, it was a lively debate, with well-researched arguments on both sides. They all contributed, including intervening on their colleagues, and challenging the points made, before a final vote.\nThey’ve also been drafting some news items for my email newsletter and website, learning about the media side of being an MP. All this is combined with biscuits and cake, and I will be inviting them to Parliament to see Government in action later this term.\nI hope to host another work experience week in the summer – if you want to know more about what the students did this week, and how they felt about it, please do have a look on my website where you can find their diary entries for the week.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_join/content_19.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_cllr-laura-beddow/content_71.html": "Background: Laura has a background in media and worksin Michael Tomlinson’s constituency office addressing a huge range of enquiries and sorting problems for constituents. Laura regards her blended family of 2 children and 4 step-children as lovely, although she sometimes wonders if she has added too many rescue animals and birds to her family.\nCouncillor: Elected Dorset Councillor in 2019 and 2024.\nLaura was previously elected to Purbeck District Council in 2015 taking over the Housing portfolio in 2017. In 2019 Laura was elected to the new unitary authority of Dorset Council, representing the ward of West Purbeck jointly with Peter Wharf. She was delighted to join the Cabinet as Cabinet Member for Adult Social Care & Health, one of the most complex, challenging and transformatory roles in the Council making a huge difference to local people’s lives. Laura also sits on the Dorset Council Health and Wellbeing Board and on the Joint Public Health Board covering Bournemouth, Christchurch and Poole as well as rural Dorset.\nOther: Laura is passionate about improving lives in Dorset and embedding the Council firmly within its communities, removing barriers and making services and actions truly accessible for all.\nLaura also appeared in local and national media in Summer 2020 as she played a crucial role cleaning and defending beaches around Lulworth when some visitors acted irresponsibly.\nShe was the political lead for Dorset Council’s coronavirus community response, working in partnership with the voluntary and community sector to make sure all residents in all communities were supported and no one got left behind.\nFollow Laura on social media:\nTwitter: @LBeddowDorset\nFacebook: Cllr Laura Beddow\nContact:\nMobile: 07814 569563",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people/content_21.html": "Cllr Bill Pipe Community Campaigner (The Lytchetts and Upton) President of Mid Dorset and North Poole Conservative Association CampaignerAssociation Officers",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_feed/content_29.html": null,
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_wareham-and-sandford/content_48.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nWareham and Sandford\nTweet",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_kemi-launches-our-2025-local-elections-campaign/content_27.html": "Tweet Wednesday, 26 March, 2025 National News At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_election-party-celebration-results/content_89.html": "Date\nFriday, 17th July 2015\nTime\n19:30\nFriday 17th July at 7.30 pm\nHamworthy Club, Canford Magna\nPlease join us to help celebrate the outstanding results of the general and local council elections\nTicket Price Only £8.00 (subsidised by the Association)\nTo include a delicious hot and cold buffet (pay bar)\nGrand Raffle!\nIn attendance: Michael Tomlinson MP and Elected Councillors",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_privacy/content_34.html": "This document outlines how Mid Dorset and North Poole Conservatives processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Mid Dorset and North Poole Conservatives\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Mid Dorset and North Poole Conservatives.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Mid Dorset and North Poole Conservatives, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Mid Dorset and North Poole Conservatives via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_prime-ministers-statement/content_30.html": "The Prime Minister's statement on the sad passing of Her Majesty Queen Elizabeth II\nWe are all devastated by the news we have just heard from Balmoral.\nThe death of Her Majesty The Queen is a huge shock to the nation and to the world.\nQueen Elizabeth II was the rock on which modern Britain was built.\nOur country has grown and flourished under her reign.\nBritain is the great country it is today because of her.\nShe ascended the throne just after the Second World War.\nShe championed the development of the Commonwealth – from a small group of seven countries to a family of 56 nations spanning every continent of the world.\nWe are now a modern, thriving, dynamic nation.\nThrough thick and thin, Queen Elizabeth II provided us with the stability and the strength that we needed.\nShe was the very spirit of Great Britain – and that spirit will endure.\nShe has been our longest-ever reigning monarch.\nIt is an extraordinary achievement to have presided with such dignity and grace for 70 years.\nHer life of service stretched beyond most of our living memories.\nIn return, she was loved and admired by the people in the United Kingdom and all around the world.\nShe has been a personal inspiration to me and to many Britons. Her devotion to duty is an example to us all.\nEarlier this week, at 96, she remained determined to carry out her duties as she appointed me as her 15th Prime Minister.\nThroughout her life she has visited more than 100 countries and she has touched the lives of millions around the world.\nIn the difficult days ahead, we will come together with our friends…\n…across the United Kingdom, the Commonwealth and the world…\n…to celebrate her extraordinary lifetime of service.\nIt is a day of great loss, but Queen Elizabeth II leaves a great legacy.\nToday the Crown passes – as it is has done for more than a thousand years – to our new monarch, our new head of state:\nHis Majesty King Charles III.\nWith the King’s family, we mourn the loss of his mother.\nAnd as we mourn, we must come together as a people to support him.\nTo help him bear the awesome responsibility that he now carries for us all.\nWe offer him our loyalty and devotion just as his mother devoted so much to so many for so long.\nAnd with the passing of the second Elizabethan age, we usher in a new era in the magnificent history of our great country,\n– exactly as Her Majesty would have wished, by saying the words…\nGod save the King.\nLiz Truss\nPrime Minister",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_stella-lewis/content_55.html": "Tweet Deputy Chair (Membership and Fundraising) Association Officers Contact Stella: [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_conservative-party-conference/content_72.html": "The Prime Minister has delivered his keynote speech at the Conservative Party Conference in Manchester. This rounded off the Conference for the Conservatives in Manchester.\nWill Burstow who attended the Conference said:\" It has been a good conference with much discussed and debated. I was particularly pleased with the number of younger conservatives present at the Conference and who attend the Conservative Future events.\"\nDon Collier noted: \"This year's Conference was in many ways the best I have been to. It was positive, solid, determined and optimistic for the future. Real leadership for a better Britain . Like the Prime Minster said 'We have the people, we have the ideas, and now we have a government that's freeing those people, backing those ideas.' Now its time for us to show we can.\"",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_association-dinner-merley-house-alex-burghart-mp/content_53.html": "Date\nFriday, 6th June 2025\nTime\n6:30pm\nJoin the Members of Mid Dorset & North Poole Conservative Association on Friday 6th June at 6:30pm for another sociable event at: Merley House BH21 3AA\nBoth Members and Non-Members are welcome to join the Association for a wonderful three-course dinner catered by Brown Goose Catering. After dinner, Alex Burghart will be revealing what it is like to Shadow Angela Rayner and giving us his insight into the new Conservative Manifesto that he is writing.\nTickets for this event are £50 per person, please RSVP to [email protected]",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_events_previous/content_79.html": "Police and Crime Commissioner Candidate for Dorset 6th May 2021 Why Vote for David Sidwick? I have spent more than 18 months learning about policing both within Dorset and by working with other PCCs. In addition, I have met...\nMDNPCA Annual General Meeting 18th March 2016 TBC MDNPCA Annual General Meeting St Nicholas Church Hall\nNew Year Lunch Party 31st January 2016 12:00 New Year Lunch Party 38 Greensleeves Avenue , Broadstone Contact: Liz Beeson email: [email protected]\nPunch before Lunch 13th December 2015 12:00 Punch Before Lunch Deans Court Wimborne Guest of Honour Simon Hoare, MP by kind invitation of Sir William and Lady Hanham Contact Mike Bartlett: Tel: 01202 885160 Mobile: 07847 271198 email: [email protected]\nHustings 5th May 2015 7pm Church Hustings at The Lantern, Merely All Welcome! Please come along to this FREE event and show your support for Michael.\nHustings 29th April 2015 7pm Election Hustings at St Johns Church, 13 Tudor Road, Poole All welcome! Please come along to this FREE event and show your support for Michael.\nHustings 28th April 2015 7pm Church Hustings at Corfe Mullen Baptist Church, Newtown Lane. All Welcome! Please come along to this FREE event and show your support for Michael.\nHustings 15th April 2015 7.30pm Election Hustings at Wimborne Minster Church. All Welcome! Please come along to this FREE event and support Michael.\nCampaign in Merley with Economic Secretary to the Treasury Andrea Leadsom MP 5th March 2015 3pm Come along and join us for an afternoon of campaigning with Andrea Leadsom MP for South Northamptonshire and Economic Secretary to the Treasury. Meet at The Willett Arms 3pm. All welcome.",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_people_mike-barron/content_49.html": "Skip to main content\nMid Dorset and North Poole\nConservatives\nMain navigation\nHome\nAbout Us\nNews\nPeople\nOur map\nContact\nJoin\nMike Barron\nTweet\nCommunity Campaigner (Corfe Mullen)\nCampaigner\nContact Mike:\nMobile: 07927 476148",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news_michael-tomlinson-welcomes-increased-funding-school-buildings-mid-dorset-and-north-poole/content_8.html": "Michael has welcomed the news that Corfe Hills, Poole Grammar and St Michaels, Colehill will all receive funding to improve the school buildings. This is part of an extra £367 million that the government has allocated for investment in buildings at over one thousand schools across the country. The condition improvement fund targets schools that need additional money for repairs, or to help them expand. Investment in the schools is key to our long-term plan for education - our aim is that every child will have a good-quality place in a local school. As part of this, £18 billion has been made available for investment in schools in England over this Parliament - more than double the amount Labour spent in its first two terms combined. Michael, who is a governor at a local school and helped with Corfe Hills Young Enterprise Scheme last year commented: ‘Families in Mid Dorset deserve local schools with facilities that provide the best learning environment. It is great news that, thanks to the difficult decisions this Government has taken to deal with our deficit, it has been possible to fund this boost for Corfe Hills, Poole Grammar and St Michaels, Colehill and address the needs of our children. ‘As part of our long-term economic plan, we are delivering the best schools and skills for young people, with a million more children in schools rated good or outstanding than 2010. This announcement means that pupils in Mid Dorset and North Poole will feel the direct benefit of our plan, and will get the investment in their education that they deserve.’",
  "https_www_middorsetconservatives_org_uk_people_cllr-kd-johnson/https_www_middorsetconservatives_org_uk_news/content_2.html": "May MP News Thursday, 2 May, 2024 News from Westminster Last month I hosted a group of work experience students in the constituency office. Ten students from six different schools gave up a week of their Easter holiday to gain an insight into the world of local and national politics. A few years ago, I was the chairman of the All-Party Parliamentary Group on Youth Employment, and it was clear from our research that it is important... Local News\nMichael Visits Wimborne Town FC 1st May 2024 Michael visited Wimborne Town FC, and was shown round by their club manager Jimmy Glass. Jimmy updated Michael about the club's plans for their site, and they... Local News\nMP News - March 1st March 2024 As a Minister in the Home Office, my focus has changed slightly from the legal perspective as Solicitor General, to a more overall view of crime and law and... Local News\nMP News - February 1st February 2024 If you are a regular reader of my column you will know that I very much enjoy visiting schools, or speaking to pupils when they visit Parliament (perhaps it’s... Local News\nPrime Minister's Statement 9th September 2022 The Prime Minister's statement on the sad passing of Her Majesty Queen Elizabeth II We are all devastated by the news we have just heard from Balmoral. The... Westminster News\nMike Barron joins the Conservative Group at Dorset Council 15th December 2021 Leader of the Conservative Group at Dorset Council – Cllr Spencer Flower is delighted that Mike Barron has joined the Group. It can be seen as a ringing... Local News\nDavid Sidwick's speech following declaration of results on Friday 7th May 2021 12th May 2021 Having been returned by the people of Dorset as their Police and Crime Commissioner, David Sidwick stated that he was humbled by the support he has had. He... Local News\nSean Gabriel, prospective Conservative candidate for Canford Heath Ward, BCP council election on Thursday 6th May. 5th February 2021 Local News\nMichael Tomlinson attends Remembrance Parade 10th November 2019 Michael Tomlinson was proud to take part in the Remembrance Parade and service in Wareham, as a guest of the Royal British Legion, to honour the fallen who have... Local News\nMichael Tomlinson standing for Mid Dorset and North Poole 10th November 2019 Mid Dorset and North Poole conservatives are delighted that Michael Tomlinson is standing again for election to Parliament. If you would like to get involved in... Local News\nThe Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News"
}