{
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_net-zero-immigration/content_37.html": "Our immigration system is in urgent need of radical reform. We have and always will have a proud history of welcoming genuine refugees, but our generosity is now under threat from those who treacherously exploit our generosity as gullibility\nUncontrolled mass immigration has pushed Britain to breaking point. A record 1,250,000 immigrants entered UK in 2022, that’s equivalent to a city the size of Birmingham!\nAt least 14 million more people are predicted to arrive in our country between 2021 and 2036, an astounding 1,000,000 per year. This explosion has led to depression of local wages, housing crisis, huge NHS waiting lists, and a serious threat to our ancient British Culture.\nIn 2022 over 45,000 illegal immigrants crossed the channel, the vast majority of them were young fit Asian men about whose background or intentions we know nothing. Most were allowed in without even cursory criminal checks. Over 17,000 have disappeared into our midst, and despite what we are fed by the BBC every day we see proof that foreign violent criminals and terrorists walk our streets.\nTories are unable to protect our borders and Labour has no intention to do so. They talk tough but in practice do absolutely nothing to reverse this terrifying situation.\nOnly Reform UK is prepared to stand up and be counted in this existential crisis. We have a complete plan to defend our way of life, including this 6-point plan:\nStop the illegal boat-crossings. Recognise a National Security Threat. Leave the European Convention on Human Rights (ECHR). Zero illegal immigrants to be resettled in the UK. Offshore processing for illegal arrivals. New Department of Immigration with strong powers. Pick up migrants from boats and take them back to France, (we are allowed to do this under international treaties)\nSo who will you trust to protect our way of life, the two major parties who consistently fail us, or a new and determined Party who will work for British Citizens only?",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_cars_national-show-weekend-for-mk1-cortinas/content_26.html": "It’s the time of year I enjoy the most with the gathering of the ‘clan’ at Stratford Upon Avon Racecourse. The show sort of starts Friday evening for most with people turning up and catching up with friends they literally might not have seen for a whole year. Saturday marks the start of the serious stuff with members looking for bargains and actual car parts to keep their cortina going. We also have lots of other Fords attending. Then as we move towards the evening we have a free hog roast and our AGM were you can pester the comitee about anything cortina related.\nWe then move on to quiz night, raffle, irish bingo, and dancing to the DJ sounds. Yours truly is doing the quiz this year so be prepared for errors.\nSunday is time to get out the polish and wax and put the car on show. Tim who did our virtual rally judging during the Covid crap is in attendance with family all weekend so will have an idea of what we are about!!\nVOLUNTEERS\nWe couldn’t do it without volunteers so please step up to the plate over the weeked to just help the show run smoothly. There are lots of roles, gate duty, litter picking, parking folk up on the sunday, actually assembling it all on Friday—just approach one of the committee who will be on site from Thursday evening.\nRegards\nM",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_mike-jordan/content_34.html": "Who is Mike Jordan?\nI am a councillor North Yorkshire (Camblesforth and Carlton) and passionate about Yorkshire and all it stands for. I volunteer at EVERY cycling event in the county and was born and bred in Yorkshire. I have lived in Hornsea, Huddersfield, Castleford, and Knottingley and now reside close by in Sherburn-in-Elmet, North Yorkshire.\nMarried to Sally, retired school teacher with 2 children, one of whom is a Paramedic and the other an IT specialist.\nI am now also a proud member of Reform UK—see seperate article in the political section",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_uncategorized_diversity-equity-and-inclusion-dei/content_58.html": "Early last week Ford Motor Company pulled the ‘plug’ on most of its DEI policies after a fresh look at them. The internal email went out to all employees informng them it will no longer take part in an annual survey from a LGBTQ advocacy group. As well as stopping quotas for minority dealerships and suppliers they will be making changes to corporate sponsorships.\n‘The company is mindful that our employees and customers hold a wide range of beliefs.’\nIt is brave enough to challenge the current orthodoxy. The simple fact is that the DEI fashion is a nonsense which is ending up dividing them by identities or characteristics—or whatever other difference the DEI people come up with!!! It simply doesn’t tack up economically socially or culturally.\nStay neutral and stay away from ideological issues.\nThey are not alone. Harley Davidson a motorcycle maufacturer have done this, John Deere makers of tractors, Jack Daniels the Whisky maker have also done this.\nAnd share prices for these companies have barely budged confirming this rush for DEI was a waste of time and a fad. Running such policies was actually impractical since they didn’t add up and it is to be hoped others follow suit asap.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_politics_page_4/content_39.html": "20’s Plenty\nYesterday at Full Council at North Yorkshire the 20’s plenty group did a public question in the council chamber. Following it, and under the constitution, there was a short debate and vote to progress this at the council—ie adopt it…\nYesterday at Full Council at North Yorkshire the 20’s plenty group did a public question in the council chamber. Following it, and under the constitution, there was a short debate and vote to progress this at the council—ie adopt it…\nThe A66 is a critical link in transport infrastructure, both for N Yorks and for anyone coming from further east heading to the far NW or western Scotland. It should be dualled throughout. Of course, it ties in with so…\nStretching across nearly 2,000 square kilometers, the Yorkshire Moors are home to an incredible array of flora and fauna. The moors boast a rich biodiversity, including rare species such as curlews, merlins, and adders. Additionally, the moors play a crucial…\nI have read with interest the various reports and excitement generated by the switch to electric vehicles from Internal Combustion Engines. Back in the early part of the 20th century most cars were actually electric but they were found to…\nSolar Power vs Wind Power, an ongoing saga!! We are gradually moving away from our total dependence on fossil fuels by the introduction and research into Solar and Wind Power, these being the 2 most prominent alternative energy sources at…\nLower Aire Catchment Overview The upstream catchment of the lower River Aire is vast and includes the extensive upstream moorland catchments of the upper River Aire as well as the River Calder which joins the Aire upstream of Castleford. Both…\nIncident—flooding of properties on the south side of Hirst Road at West Bank and Hirst Courtney, coupled with subsequent flooding at Snaith. River level observations.FEBRUARY—24thLeeds Crown Point—fell sharply at 4pm on the 24th. West Bank Pond rose steadily throughout the…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_report-and-observations-by-county-cllr-mike-jordan-into-the-flooding-event-at-hirst-courtney-and-west-bank-on-25th-feb-2020/content_60.html": "Incident—flooding of properties on the south side of Hirst Road at West Bank and Hirst Courtney, coupled with subsequent flooding at Snaith.\nRiver level observations.\nFEBRUARY—24th\nLeeds Crown Point—fell sharply at 4pm on the 24th. West Bank Pond rose steadily throughout the evening and into next day coupled with high tides.\nMARCH —10th\nHolbeck Flood rose above trigger level and then fell sharply late in the evening. There was a spike/rise at West Bank Pond peaking around 6am on the 11th. The river level at Carlton on the 10th was going down with the tide BUT then shot up despite the tide going out.\nI am told that the EA believe this to be irrelevant. I would need to see proof. It is clear from the levels on March 10th that anything happening in Leeds has an effect further downstream. The March actions were entirely consistent with how things should be done. I am puzzled with the timing of the release on Feb 24th and also the rate of its release—surely they were able to actually control the release rather than just dropping it as fast as possible? The level drop after the initial 4hrs period suggests they could have and why did they wait until the level had shot up so much—was anyone watching the levels at the time? I would argue a more controlled release started earlier would have reduced the large ‘slug’ of water going down.\nThere are other factors to be looked at as well.\n- There was no flooding at Brotherton wash lands or Ferrybridge Square or Hensall.\n- There was no flooding/overtopping at Newland which is further down river from Carlton.\n- The old bridge would, in my opinion, have played a part in this. It looks quite thin, but the stonework is twice as wide under water as I observed at low tide, and takes up a significant % of the width of the river. I am also informed by a resident that the river was higher by as much as a metre, upriver from it.\nAs a former chemical engineer at the chemical works at Mirfield (Dr Reddys) right alongside the River Aire I can tell you first-hand about the effect of a bridge on the flow of a river. - The timing of the event to me appeared to coincide with a high tide. Surely they had enough knowledge already ‘banked’ to know when it’s best to release to avoid such a situation.\nFURTHER OBSERVATIONS\n- No one was prepared to take responsibility for the failed flap valves on the drains, which threatened several properties on the north side of the road. Those valves have now been repaired by local residents despite paying money to the Drainage Board each year and other agencies through rates. Thankfully the Fire brigade came to the rescue with a pump long enough for residents to source some for themselves. This saved 5 properties and Yorkshire Salads depot.\n- The barrier put up by the residents at West Bank using plastic sheeting and stone/soil was cheap and very effective. They were lucky in that the community has a number of folk with diggers etc. and were able to do this. I personally think they were better as a barrier than sandbags as there are no gaps, but it is also fair to say it wouldn’t be practical everywhere.\n- There was confusion over sandbag usage and one property behind Newcoates could have been saved had they been given bags a mere 2 hrs earlier. They are very upset at everyone.\n- Pilfering, or attempts at it, were a constant threat meaning that the residents had to form a 24hrs rota to safeguard properties. The EA lost some large pumps I am informed, so had 24hrs cover themselves at Hirst Courtney.\n- I concentrated on dealing with Selby District Council and they had officers there, on the ground, regularly.\n- The EA rolled up regularly in vans. Most had no idea about the area and on the 25th we actually had a visit by 2 senior officers to observe what was going on.\n- Clean up operations went reasonably well. Tensions were high and there were some issues such as a scuffle between a resident and what transpired to be volunteers who had come to help shift stuff.\n- Rubicon were brilliant and whoever organised them wants a big thank you. They helped allsorts and I had the opportunity to inform them where help was needed and to assist with organising skips in the right locations.\n- Newcoats Farm, owned by David Leek, was saved because he had a digger and went around his property and that of his sons and made a makeshift mud bank. Longer term it needs to go round 2 other properties behind his and to that end he, and they, have applied for a grant to do just that.\nCONCLUDING REMARKS.\nThe fact we had an incident solely located in one specific area of the River Aire between Leeds and the estuary, with no incidents anywhere else to speak of, suggests we had a large body of water right at that point. It had to spill out somewhere. If the banks were the same height all along the section from Ferrybridge to the estuary then that is the point where all the water had gathered. It appears to me that it was partly held there by the old bridge, had met an incoming high tide just at that point and was a larger volume of water than would ordinarily be present due to the extra water sent down from Leeds. The cumulative effect, in my opinion must have had a bearing on this incident.\nI will be very interested in seeing the alternate report prepared by countless experts at the EA who will no doubt refute it all BUT I, and the residents, would need to see that evidence which must be laid out simply and clearly.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_farmers-unite/content_10.html": "Today I visited the Thirsk Auction House for a meeting with farmers who wished to discuss the inheritance issue amongst other things. A number of different political parties were in attendence and spoke on the panel about the issue and what to do going forward. It just about sums it up with the labour party when their spokesman, as good as he is, is based in Selby. It might be North Yorkshire but I wouldn’t call it local!! Reform members were there is force throughout the event and Mark, the local member in Thirsk spoke passionately about the subject.\nThere was a significant number of farmers present, probably 2/3 of the audience and most of their hands stayed in the air when asked if the inheritence tax would affect their family. As an example one farmer with 500 acres reckons it wil cost him £1.26m when his father passes away, and dddtha figure was arrive at by his accountant—someone who generally knows figures!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_solar-power-vs-wind-power/content_45.html": "Solar Power vs Wind Power, an ongoing saga!!\nWe are gradually moving away from our total dependence on fossil fuels by the introduction and research into Solar and Wind Power, these being the 2 most prominent alternative energy sources at the moment.\nBecause of this and the debate around which is best I thought I would throw some ideas and facts into the arena in order to aid future policy on energy. (Energy production in Yorkshire is key with the largest off-shore wind farm in the world at Hornsea and the biomass units at Drax Power Station).\nSo let us look at these 2 forms of energy from a ‘whole life’ perspective, looking also at their outputs as well.\nWIND POWER.\nWind energy is an impressive force of nature harnessed all around the globe providing a clean source of energy when up and running, it is also found to be more reliable and especially so off-shore where the prevailing winds are more or less constant. The problem comes with the construction and disposal. A typical turbine uses 1,200 tonnes of concrete, 335 tonnes of steel and 5 tonnes of copper. Dismantling causes problems as the turbine blade is a composite material and is not easy to recycle (such that in Casper, Wyoming, USA there are thousands buried).\nThat said one turbine produces some 48,000 times the energy of a solar panel per kWh and places such as Denmark, with little fossil fuel resources have over 50% of their electricity supplied by wind farms now.\nOne area where it is of limited use is on roof, so the domestic market, which did start with small ones on the ends of buildings, is now basically dead.\nSOLAR POWER.\nSolar energy is again a remarkably clean source of energy once it is up and running and is more predictable and easier to install than a wind turbines plus, in theory, can give us more capacity due to the sun.\nAgain there are problems though with the build and disposal. The panels use a great deal of silicon which is abundant but its extraction and purification poses a challenge and they also use rare metals such as silver and indium whose extraction causes further environmental issues.\nSolar farms require a lot less maintenance and generate no noise and they will last for 25-30 years. You can also put them on roofs!!\nFINAL THOUGHTS.\nGoing forward there needs to be a lot more thought going into the long term planning of these facilities. They currently also need to be close to our national grid network in order to plug in, which in itself, creates issues of cables stretching for miles usually in open countryside.\nThe other issue is land usage as Solar Farms need much more land to spread across for the same amount of energy provided and consequently also have an impact on wildlife which has to contend with it all.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_general-election-has-been-called/content_55.html": "As you will be aware the election has been called by the Prime Minister with polling day on July 4th. I will continue to campaign and my leaflet will have been delivered to most areas by this weekend. If you wish to get in touch to arrange a meeting please contact me by phone or email.\nIt is a snap election so please make sure you read what literature is around and my Facebook posts as there isn’t long to go before we have a new government to run the country for the next 5 years.\nLooks like I will not be getting much biking done this summer!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_farming-in-the-uk/content_33.html": "It would appear that having alientated pensioners the chancellor has now turned attention to farmers with the sole intention of destroying that industry and thousands of families with it. To impose an inheritance tax on the children of the farmers thus making it difficult for that person to continue the running of that farm is ridiculous in the extreme. Farmers are asset rich and very cash poor so to take some or all of that asset and ruin that farm suggests that Labour think we can simply import all our food based on the simple premise that we haven’t been self sustaining since 1750. It is bad enough that we are around 70% sustaining but the lost farms coupled with the proliferation of solar farms we will have to import so much more from places like Ukrain (which is not guaranteed!)\nWe have little hope but there are options\n- Make sure no labour candidate wins any council election in the next 5 years\n- Make sure we remove this Labour Government in 5 years time and make this one of our first reversals\nThere is a rally to be held at Westminster on Nov 16th 11am, if you can make it then be there!!\nMIKE jORDAN\nOn the side of farmers and logic",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_author_mike_page_3/content_35.html": "National show weekend for Mk1 Cortinas\nIt’s the time of year I enjoy the most with the gathering of the ‘clan’ at Stratford Upon Avon Racecourse. The show sort of starts Friday evening for most with people turning up and catching up with friends they literally…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_politics_page_2/content_40.html": "Election results\nThe dust is starting to settle down and all the new faces are appearing on the TV on Sunday and the news as we go allong, even though footy is proving far more interesting!!! (You would think one of them…\nThe dust is starting to settle down and all the new faces are appearing on the TV on Sunday and the news as we go allong, even though footy is proving far more interesting!!! (You would think one of them…\nYou’ll be aware of the current attack on all sides against Nigel Farage’s opinions of the cause of Russian aggression. The truth is far from what you’ll hear from politicians and media trying to discredit him. To give you a…\nThere’s no doubt that the NHS is in trouble despite huge inputs of funding. It’s not all about money, it’s about how NHS is administered, and you could be forgiven for thinking they’re not working for your best interests. So…\nToday I listened to a lady give a very passionate story about her husband and his illness and her selfless devotion to caring for him. It really brings it home to you what a lot of people are going through.…\nIf you choose to vote for either of the major parties you are giving power to either: a. A London Lawyer who fought hard to give more benefits to immigrants, is happy for trans-men to use female facilities and compete…\nAs you will be aware the election has been called by the Prime Minister with polling day on July 4th. I will continue to campaign and my leaflet will have been delivered to most areas by this weekend. If you…\nOur immigration system is in urgent need of radical reform. We have and always will have a proud history of welcoming genuine refugees, but our generosity is now under threat from those who treacherously exploit our generosity as gullibility Uncontrolled…\nThe headlong drive to achieve “Net Zero” is demonstrably a form of mass hysteria, with all parties vying to appear more virtuous than the others. But in real terms, how much is it likely to cost us, the long suffering…\nAre you, like so many others struggling to get an appointment with aGP, or suffering from an ailment which should have been treated veryearly but are frustrated by ridiculously long hospital waiting lists?You’re not alone, countless thousands are routinely failed…\nIt has been a welcome start to getting leaflets printed and letting residents know that I exist and am not a robot (though I keep having to tell computers that!) Various meeting have been arranged throughout the constituency in the…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_politics/content_7.html": "North Yorkshire Council\nIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\nIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\nThe party has had 2 local meetings now, both well attended and the next one is crucial. It will be the AGM at which members will elect the 5 main commitee members to continue the good work that has been…\nToday I visited the Thirsk Auction House for a meeting with farmers who wished to discuss the inheritance issue amongst other things. A number of different political parties were in attendence and spoke on the panel about the issue and…\nThose seven items above are just the start and how many of those items were in the labour manifesto and how many of those were in our Local MP leaflets? Further more as my local MP is a member of…\nYou may be aware of outline plans by the government to cancel some of the local elections next year. This will be for those areas were there is a 2 teir system of District and County. The plan would appear…\nIt’s that time of year when cllrs have to start deciding on what are the priorities for the 25/26 financial year. Cllrs at North Yorkshire have had an initial meeting with heads of services to get a flavour of where…\nSo this is where we are with this government so far. 1. Got rid of the winter fuel allowance and alienated all pensioners. 2. Introduced inheritance tax to alienate farmers. 3. Increase fees and alienating all students. 4. Increase NI…\nIt would appear that having alientated pensioners the chancellor has now turned attention to farmers with the sole intention of destroying that industry and thousands of families with it. To impose an inheritance tax on the children of the farmers…\nAs the spokesperson for the Wetherby and Easingwold Constituency I am writing to inform you of an up and coming meeting. This will be for any and all to attend, subsequent ones will be for members only. Reform UK Supporters…\nAfter the election and time to reflect it was the moment to thank helpers for their efforts during the election. Some donated to the party, some stuck boards up, some did social media work, some accepted Banners and it all…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_party-time-thanks-for-the-help/content_2.html": "After the election and time to reflect it was the moment to thank helpers for their efforts during the election. Some donated to the party, some stuck boards up, some did social media work, some accepted Banners and it all helped ensure we are now recognised throughout the country.\nI had pleasure in organising a thank you party at the Aldwark Arms and we had a great evening. Lovely food, great debate and a desire to ensure we are not now just going to sit around but keep putting the message out there and holding those in office to account. One guy even rolled up in his tractor!!\nLabour have already taken away my winter fuel allowance whilst MPs get to keep theirs and there will be more such things as they blame the outgoing government for absolutely everything.\nHere to stay and keeping busy!!!!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_cars/content_47.html": "Lotus Cortina update\nWell the Mk1 is coming along nicely. Interior trim is more or less cleaned/repainted as needed. The car is currently at the sellers workshop but is coming ‘home’ this week on a trailer so I can start working on it…\nWell the Mk1 is coming along nicely. Interior trim is more or less cleaned/repainted as needed. The car is currently at the sellers workshop but is coming ‘home’ this week on a trailer so I can start working on it…\nHaving bit the bullet and purchsed a Mk1 Lotus Cortina that has been stood some years (and lost bits on the way) it feels like dejavu in a way. The car is a 65 airflow with the plain door cards…\nIt’s the time of year I enjoy the most with the gathering of the ‘clan’ at Stratford Upon Avon Racecourse. The show sort of starts Friday evening for most with people turning up and catching up with friends they literally…\nWay back in 1957 a Japanese car manufacturer called Prince entered a Skyline in saloon car racing locally. In 1966 they merged with Nissan and continued racing with the Gt-A and B. In 1969 the GT-R arrived and it dominated…\nIt all started back in 2017. A lady from London rang me about her father’s Mk1 Cortina which he was reluctantly selling having owned it from new. Details were sent to me which I duly passed to the club editor…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_campaign-meeting/content_5.html": "As the spokesperson for the Wetherby and Easingwold Constituency I am writing to inform you of an up and coming meeting. This will be for any and all to attend, subsequent ones will be for members only.\nReform UK\nSupporters I’m back!! Lovely week on Isle of Wight, didn’t see any rafts but plenty of yachts!! It is time to meet up and do a proper branch meeting to establish ourselves as a political force. CROWN INN BOROUGHBRIDGE 7PM TUES 8th OCT YO51 9LB There is a public car park just to the east on Back Lane which has a donation box so bring loose change. £1.50. Thanks to a member I have got a good rate for the premises which is a lovely venue and you might want to consider dining there, but most certainly get yourself a drink!! It is central to the constituency which brings me nicely on to the business to be dealt with. As it will be the local branch and we want to get things moving it will be open to all for this first meeting. ALL SUBSEQUENT MEETINGS WILL BE FOR MEMBERS ONLY. I have an agenda to bring which will be ‘fluid’ and it will be an opportunity to meet our Treasurer and Campaign Manager—there is a need to fill the roles of Deputy Chair and Secretary so please approach me if interested on the night. Regards Mike Jordan",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_useful-information/content_21.html": "North Yorkshire Council\nIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region. I had a report…\nReform UK in Selby area\nThe party has had 2 local meetings now, both well attended and the next one is crucial. It will be the AGM at which members will elect the 5 main commitee members to…\nLotus Cortina update\nWell the Mk1 is coming along nicely. Interior trim is more or less cleaned/repainted as needed. The car is currently at the sellers workshop but is coming ‘home’ this week on a trailer…\nDrax Power Station news\nWe had our regular parish liason meeting with the power station and I thought it an idea to update you on their situation and some basic facts. Firstly they have received further support…\nBaby Boomers\nI am hearing a lot about this subject not least because I am one apparently!! All born after 1946 have apparently made a fortune with the cheap houses they bought now worth millions….\nLotus Cortina Restoration\nHaving bit the bullet and purchsed a Mk1 Lotus Cortina that has been stood some years (and lost bits on the way) it feels like dejavu in a way. The car is a…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_mike/content_12.html": "National show weekend for Mk1 Cortinas\nIt’s the time of year I enjoy the most with the gathering of the ‘clan’ at Stratford Upon Avon Racecourse. The show sort of starts Friday evening for most with people turning up and catching up with friends they literally…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_reform-uk-conference/content_23.html": "On Saturday 24th Feb I attended the Conference for Reform UK where around 1,500 delegates attended a packed out Doncaster Racecourse. There were great speeches from all including the Leader Richard Tice and Ann Widdecombe and Executive member.\nInstead of the dreaded manifesto idea with all the promises that just get dropped as the Labour or Tory crowd take over, a contract has been drawn up, currently in draft format for all to make comment in etc before being firmed up. This will be a contract between the party and the public and will be enacted should Reform UK get the opportunity. Some of the ideas are radical, as you would expect, and all need exploring with a bit of detail.\nSimply visit the website for more detail.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_ward-matters_camblesforth-and-carlton-ward-update/content_31.html": "It seems we are are close to turning the area into a ‘solar state’. Yet another application has been entered close to Camblesforth for a solar farm to add to the list. Companies (and probably foriegn investors) have seen the direction of travel by the new government and so will keep putting in these applications, perhaps more speculative than anything else!\nI spoke to a farmer only yesterday who is puzzled as farmers can earn a lot more money from windfarms and they don’t take up anywhere near the room. A lot of the land is also good farmland so food producion will suffer even more.\nI have also been in conversation with Active Travel England (ATE )are an organisation set up to look at and advise where planning or redevelopment is happening to help design areas to make it safe and easy to get around by walking or bike. The Transpennine Trail (I am vice chair) organised the meeting invite and ATE could be a useful organisation for a parish to contact if they are threatened with a large planning application.\nThe High School at Carlton is still looking to close but a group has been set up to try and stop that happening. They are on Facebook so please contact with your concerns.\nA planning application on Mill Lane has gone to the planning inspectorate to appeal.\nRegards",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_cars_lotus-cortina-update/content_18.html": "Well the Mk1 is coming along nicely. Interior trim is more or less cleaned/repainted as needed. The car is currently at the sellers workshop but is coming ‘home’ this week on a trailer so I can start working on it properly. It still has a lot of its parts but some have been sold over the years whilst in storage. All welding work is done so I can concentrate on the interior/ suspension / brakes etc.\nThis is going to take 2 or 3 years to sort depending on time and finding the parts that are missing but it keeps me out of mischief for the time being!!\nThe photo shows a number of parts of which the exhaust manifold is unique to this type of car.\nAs regards ‘type’ a Mk1 Lotus Cortina is, from the company Lotus, a type 28.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_uncategorized_facts-and-figures-and-how-parish-town-councils-liaise-with-north-yorkshire/content_38.html": "Some interesting facts for you that have emerged from a liason meeting last night at Selby Town Hall\n- They look after 5,753 miles of roads\n- They look after 10,000 miles of footpath\n- 97.5% of councils have less than 200 towns and parishes to serve\n- North Yorkshire has 664 inc Harrogate and Scarborough to be arranged\n- The next nearest council has 300\n- The new teams for each part of the council area are now complete and importantly we are in the South Team for planning\n- The area will be kept as the old Selby and Ainsty area for now\nAll parish and town councils have a new method of contacting North Yorkshire through a dedicated email address which they promise to respond to within 24 hours excluding weekends\nparishliaison@northyorks.gov.uk",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_up-to-date-cv/content_63.html": "Mike Jordan\n25, Garden Lane Tel: 01977 683766\nSherburn-in-Elmet Mob: 07975 695269\nNorth Yorkshire Email: jordan_wedgwood@btinternet.com\nLS25 6AT\nCouncillor/Employment/Family\nI am a councillor for North Yorkshire and passionate about Yorkshire and all it stands for. I volunteer at EVERY cycling event in the county and was born and bred in Yorkshire. I have lived in Hornsea, Huddersfield, Castleford, and Knottingley and now reside close by in Sherburn-in-Elmet.\nMarried to Sally, retired school teacher with 2 children, one of whom is a Paramedic and the other an IT specialist.\nCouncillor/Activist activities\nDesignated Roles as a councillor\n- Chaired various meetings at both Selby District and North Yorkshire\n- Work with the local LEP\n- Pension Board activity\n- Drainage Board work\nElection Work\n- Working with a number of MPs over the period 2007 to present day:\nNigel Adams MP for 2010 election and continued to support\nAndrea Jenkyns MP from 2013 onwards until elected\nAlex Shelbrooke MP until elected and then for a further 2 years to help consolidate the constituency, working with Ryan Stephenson\n- Stood as MP for Hemsworth in 2017 elections under Mrs May, took the vote from the normal 9,500 to 15,500\n- Stood for the Yorkshire Party and ran as campaign manager for the Selby District Elections were we secured 4 councillors and came close to 5. (Had we got 5 then the conservatives would have lost control)\nAdditional work on elections\n- Coordinator for the Brexit Campaign in the Selby District Area throughout the campaign\n- Chief assistant with Geoff Pickering to get Mathew Grove elected at the PFCC in Hull against John Prescot in 2012. We won ‘Best Campaign’ award and Geoff had to go to London to collect.\n- Managed the by-election for a district cllr in Selby area and won in what was previously always a labour seat.\n- Work continually on council elections and PFCC elections\nEducation and Qualifications\n1998 – 1999 UMIST\nPiat Module 8 Operations management\n1995– 1996 Wakefield College (Thornes Park)\nNVQ Level 4 management\n1970 – 1974 Huddersfield Polytechnic\nHons Degree in Chemical Engineering\n1968—-1970 Beverley Grammar School\nA and S levels in Maths and Chemistry\n1963 – 1968 Hornsea Sec School\nO-Levels: 8 including English and Maths\nMost Recent employment\nJan 2021 to July 2022 Dr Reddys Mirfield West Yorkshire\nWork Experience\nSkills\n- Manager of 2 chemical sites in Knottingley\n- Manager on shift for Top Tier Comma Chemical site\n- Expertise in organising staff and teams\n- Excellent management and organisational skills\n- Flexibility, excellent time keeping and availability at short notice\n- Considerable skills in planning (long term, mid-term, weekly and daily), organising and assessing work.\n- Providing resources of a high quality for operations\n- Excellent management skills within the work environment, ensuring a high level of motivation and engagement\n- Working as part of a team to provide an environment where all feel safe to operate\nAdditional Skills and Qualifications\n- Clean driving licence and own car\n- Certified for working with crowds (Martins Law)\n- Former School Governor\nInterests and Activities\nHobbies: I enjoy car restoration and motorcycling. I am a member of Motorcycle Action\nGroup which campaigns regularly in Yorkshire, I now manage part of an\nEvent which is held every summer at Helmsley with up to 10,000 folk.\nBusiness: I started and still manage what is now one of the largest single make Ford car clubs, the Mk1 Cortina Owner’s Club, which is wholly run by volunteers. I am Chairman of the club as well as being one of the directors.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_council-budget/content_14.html": "North Yorkshire Councillors are about to start ‘wrestling’ with sorting out the budget for the next financial year (2024/5). Approximately half its budget goes on Adult Social Care and Children and Young Peoples Services and the pressures are never ending. There are a lot more ‘statemented children’ now than there has ever been which now includes those with autism and the funind from Government does not cover the cost. On top of that general funding for children in North Yorkshire puts us down in 142nd out of 155 councils which I am told is an unmoveable state.\nSavings will be made as we are now a unitary council and I am told there will be some redundancies coming down the pipeline, plus the council will start sorting out the duplication of assets it now has (in Selby we have the old district council building and the Area 7 depot plus a number of smaller buildings scattered around in Selby).",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_net-zero-and-the-economy/content_54.html": "The headlong drive to achieve “Net Zero” is demonstrably a form of mass hysteria, with all parties vying to appear more virtuous than the others. But in real terms, how much is it likely to cost us, the long suffering taxpayers? Brace yourself, here it comes!\n“Achieving net zero will on average cost more than £50,000 for every family in the UK, or more than £32 each week, every week for the next 30 years”. These figures were provided by a major Union, which is allied to the Labour Party so the estimate could even be on the moderate size.\nDo they really believe this can be justified? Will it help to save the planet from exploding, bearing in mind the UK emits only 1% of global CO2, whilst the major culprits have absolutely no intention to reduce carbon emission?\nAre you prepared to trust the traditional parties with your hard-earned money, or will you join us to make a stand against this destructive Virtue Signalling? Only one party has the guts to expose this madness. Vote Reform UK at the next General Election",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_uncategorized_baby-boomers/content_24.html": "I am hearing a lot about this subject not least because I am one apparently!! All born after 1946 have apparently made a fortune with the cheap houses they bought now worth millions. So I thought I would have a look at current prices and costs for a mortgage taking into account where I lived when I first got a property and whats available right now.\n- My first house was in Fartown Huddersfield and I paid £3,000. It was a simple 2 up 2 down terrace house with a rear yard and small front garden sandwiched between 2 other roads. Today the similar houses around it go for £85,000—so that wouldn’t make me a millionaire.\n- Having looked on one of the premier websites I have also found near me houses for as low as £60,000 to buy right now plus some flats for £15,000 guide price.\n- A mortgage for the £85,000 would be around £460 a month, very similar to the rent for a council house.\n- All this with interest rates of 4 or 5%. Can you imagine a mortgage of 15%? Well not only did I imagine it I actually had to endure it along with all the other ‘Baby Boomers’\nSo I would argue that we are no different, it’s just that young adults now looking for a property want immediately what their parents spent a long time building up to. So I suggest buying at the bottom end, as I did, do it up, live there a while, then move up. Don’t go buying that super dooper car your parents have also got, and live within your means. In 10 or 15 years you will be in a far better position.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_uncategorized/content_41.html": "Baby Boomers\nI am hearing a lot about this subject not least because I am one apparently!! All born after 1946 have apparently made a fortune with the cheap houses they bought now worth millions. So I thought I would have a…\nI am hearing a lot about this subject not least because I am one apparently!! All born after 1946 have apparently made a fortune with the cheap houses they bought now worth millions. So I thought I would have a…\nSome interesting facts for you that have emerged from a liason meeting last night at Selby Town Hall All parish and town councils have a new method of contacting North Yorkshire through a dedicated email address which they promise to…\nAs you will probably be aware a decision has been made by the trust/academy that runs the High School at Carlton to close the school. This was requested a while ago to the Secretary of State for Education and has…\nEarly last week Ford Motor Company pulled the ‘plug’ on most of its DEI policies after a fresh look at them. The internal email went out to all employees informng them it will no longer take part in an annual…\nSolar Power vs Wind Power, an ongoing saga!! We are gradually moving away from our total dependence on fossil fuels by the introduction and research into Solar and Wind Power, these being the 2 most prominent alternative energy sources at…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_author_mike_page_4/content_36.html": "Our NHS–Reforms answer\nAre you, like so many others struggling to get an appointment with aGP, or suffering from an ailment which should have been treated veryearly but are frustrated by ridiculously long hospital waiting lists?You’re not alone, countless thousands are routinely failed…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_cars_lotus-cortina-restoration/content_13.html": "Having bit the bullet and purchsed a Mk1 Lotus Cortina that has been stood some years (and lost bits on the way) it feels like dejavu in a way. The car is a 65 airflow with the plain door cards but on leaf springs rather than A-frame with a really good body needing some work undertaken by others. I am concentrating on cleaning, painting where needed and finding those missing parts (the fun bit!). The car isn’t home yet as the estate car needs to be sold to make room and provide the funds for the missing parts but it didn’t stop me taking bits home as they are easy to take apart.\nSo, in a nutshell, work has started and like any restoration you just do a bit each day and then it suddenly all comes together. Don’t rush it, make sure the parts are right and have fun on the way.\nIncidentally the Mk1 Cortina Owners Club has lots of parts for the car and the rest can be found through contacts on the facebook page and in the magazine which drops through the letter box every 2 months if you are a member.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_decision-to-delay-a66-upgrade-is-disappointing-for-our-residents-and-businesses-transport-for-the-north/content_56.html": "Decision to delay A66 upgrade is disappointing for our residents and businesses – Transport for the North\nThe A66 is a critical link in transport infrastructure, both for N Yorks and for anyone coming from further east heading to the far NW or western Scotland. It should be dualled throughout.\nOf course, it ties in with so many other broken promises and cans kicked into the long grass.\nThe cancelling of the HS2 line beyond Birmingham was supposed to release lots of funds, but they will probably be mainly spent in seats with red-wall Conservatives. A classic start to this was the announcement of the upgrades to the station in Dewsbury for Mark Eastwood MP (who is actually one of the hard working tories!) It was actually announced the day BEFORE HS2 was cancelled—ooops!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_general-election-voting-intentions/content_52.html": "If you choose to vote for either of the major parties you are giving power to either:\na. A London Lawyer who fought hard to give more benefits to immigrants, is happy for trans-men to use female facilities and compete with real women in sports, and is edging ever closer to handing back our sovereignty to the EU.\nb. An ineffective leader, well out of his depth, who promised to slash legal immigrant numbers, prevent illegals from entering this country by boat, promised to drastically lower NHS waiting lists, and lower the tax burden. Every one of these has resulted in the exact opposite.\nBut there’s also good news, you now have a credible choice. Only Reform UK has the guts to stand up to the Woke Brigade and speak truth on behalf of the vast majority of outraged citizens who will no longer put up with being betrayed by those we pay to represent us.\nUse your vote to make a real difference. Vote for your local Reform UK candidate Mike Jordan",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_lack-of-vision-for-the-selby-area/content_62.html": "Planning in the Selby area.\nThis week sees further evidence of a lack of understanding in the Selby area by the Conservatives at North Yorkshire Council. The Selby Local Plan has progressed quite well and it was decided to continue with it and let it become part of the new Local Plan being devised by the new unitary North Yorkshire.\nSo far so good. It all goes off the ‘rails’ from then on. This week, after a discussion by the Executive at North Yorkshire, it has been decided to take a part of that plan off whilst continuing with it. That ‘part’ is the idea of a new village called Heronby which would eventually lead to a settlement of 4,000 houses over a considerable period of time. A settlement properly planned from the start (rather than a small village just having bits bolted on as and when developers want to build) with a good number of affordable homes for those on lower incomes.\nInstead we will continue to have bits added on to all the current towns and villages with no likelihood of proper infrastructure. So the pressure on certain areas will continue, including Eggborough which could end up with an extra 1,500 houses.\nNow let’s just get Eggborough into perspective here. We have a village which will turn into a town virtually the size of Tadcaster but with absolutely none of the facilities such as —bus station, 2 large car parks, good size town hall, Costa coffee, on a major bus route to the east coast, sports centre with swimming pool!!!\nYou have the Executive at North Yorkshire to thank for this and in particular a Councillor from —Scarborough 70 miles away.\nIt doesn’t end there. The Conservative Candidate for the Mayoral election is dead ‘keen’ on throwing what little budget he has to dual up the A64 to the coast from York. It only gets blocked up when folk are going to the coast in the summer, rest of the time its fine. But what the hell, it’s a vote winner apparently. Meanwhile the A19 which is clogged up EVERY DAM DAY OF THE WEEK, between Selby and York isn’t getting a ‘look in’. Make that a dual carriageway and you would please a whole world of people in the Selby area but hey ho.\nWe are and will remain the poor relatives of North Yorkshire. We have built more houses than other areas but no one is interested.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_uncategorized_solar-vs-wind/content_50.html": "Solar Power vs Wind Power, an ongoing saga!!\nWe are gradually moving away from our total dependence on fossil fuels by the introduction and research into Solar and Wind Power, these being the 2 most prominent alternative energy sources at the moment.\nBecause of this and the debate around which is best I thought I would throw some ideas and facts into the arena in order to aid future policy on energy. (Energy production in Yorkshire is key with the largest off-shore wind farm in the world at Hornsea and the biomass units at Drax Power Station).\nSo let us look at these 2 forms of energy from a ‘whole life’ perspective, looking also at their outputs as well\nWIND POWER.\nWind energy is an impressive force of nature harnessed all around the globe providing a clean source of energy when up and running, it is also found to be more reliable and especially so off-shore where the prevailing winds are more or less constant. The problem comes with the construction and disposal. A typical turbine uses 1,200 tonnes of concrete, 335 tonnes of steel and 5 tonnes of copper. Dismantling causes problems as the turbine blade is a composite material and is not easy to recycle (such that in Casper, Wyoming, USA there are thousands buried).\nThat said one turbine produces some 48,000 times the energy of a solar panel per kWh and places such as Denmark, with little fossil fuel resources have over 50% of their electricity supplied by wind farms now.\nOne area where it is of limited use is on roof, so the domestic market, which did start with small ones on the ends of buildings, is now basically dead.\nSOLAR POWER.\nSolar energy is again a remarkably clean source of energy once it is up and running and is more predictable and easier to install than a wind turbines plus, in theory, can give us more capacity due to the sun.\nAgain there are problems though with the build and disposal. The panels use a great deal of silicon which is abundant but its extraction and purification poses a challenge and they also use rare metals such as silver and indium whose extraction causes further environmental issues.\nSolar farms require a lot less maintenance and generate no noise and they will last for 25-30 years. You can also put them on roofs!!\nFINAL THOUGHTS.\nGoing forward there needs to be a lot more thought going into the long term planning of these facilities. They currently also need to be close to our national grid network in order to plug in, which in itself, creates issues of cables stretching for miles usually in open countryside. The other issue is land usage as Solar Farms need much more land to spread across for the same amount of energy provided and consequently also have an impact on wildlife which has to contend with it all!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_russia-nigels-remarks/content_53.html": "You’ll be aware of the current attack on all sides against Nigel Farage’s opinions of the cause of Russian aggression. The truth is far from what you’ll hear from politicians and media trying to discredit him.\nTo give you a better informed view here’s what a highly respected journalist and writer Simon Jenkins wrote in the Guardian (yes, that’s not a mistake).\n“An appeaser, a disgrace, an apologist for Putin, an insult to Ukraine. Farage has been called lots of things since saying NATO and the EU bore some responsibility for Russia’s invasion of Ukraine. Yet his argument that the West provoked Moscow by extending membership to countries bordering Russia is by no means crazy.\nAfter the collapse of the Soviet Union in 1991 Russians told us explicitly: “You have won but don’t push Moscow too far”. Moscow’s then leader Gorbachev pleaded with NATO not to extend its membership to nations on his border – a request that was verbally agreed by the US and others.\nWithin a decade NATO was negotiating with potential new members in the Baltic and Black Sea.\nIt’s ludicrous to suggest Nigel’s views are outlandish. And wherever you come down on the issue, the Reform Party leader is clearly arguing for peace. Heaping insults on him helps no one”. With thanks to Simon Jenkins.\nRussia has historically been invaded from all sides, starting with Gengis Khan’s hordes, Japan (briefly), Poland three times, Sweden, Napoleon and Nazi Germany. That’s why they ruthlessly formed a belt of “Soviet States” around them after WW2, believing it would slow down further invasions. Putin is very well aware that ordinary Russians still believe themselves to be under threat from European nations and has exploited that fear to try to re-instate a border between Russia and the EU/NATO, with Ukraine being the unfortunate first. Nigel Farage is the first and only politician to speak the truth about the Ukrainian conflict, he should be applauded not reviled",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_motorcycle-policy/content_42.html": "Motorcycle Policy\nThe Yorkshire Party recognises motorcycles as a valid form of transport with great potential to provide cheap, environmentally friendly and congestion-reducing benefits. With over 5 million road users qualified to ride powered two wheelers, we are determined to work with the riding community to achieve a constructive relationship that leads to sensible motorcycle and scooter related policies.\nMotorcycles reduce congestion through their agility and ability to flow through traffic jams, thereby reducing the road traffic burden. They use far fewer materials in their manufacture and take up much less room when parked.\nThe Yorkshire Party would offer the following policies:\n- We will lower motorcycle thefts by providing earmarked funds to police for the capture of motorcycle thieves.\n- To help the prevention of motorcycle thefts, we will work with the local authorities and private car parks owners to improve access to secure motorcycling facilities free of charge.\n- To aid with reducing traffic congestion, we will provide motorcycles with default access to bus lanes.\n- We are committed to working with motorcycling riders’ rights organisations such as the Motorcycle Action Group, to ensure informed policy making.\n- We will implement a low taxation regime for motorcycles\n- We will protect riders’ right to choose the form of motorcycle they want to ride, and scrap unnecessary legislation threatening to ban the sale of new petrol-powered motorcycles.\n- We will repeal the mandatory motorcycle helmet law, in line with the tenets of informed freedom of choice.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_20s-plenty-2/content_61.html": "In North Yorkshire there is no appetite in the Executive at the council to introduce a 20mph zone for all areas where people live. Debate was lost twice at Full Council recently following members of the public speaking to the Full Council.\nAnd so it will continue to be raised wherever possible until someone has listened and acted upon it. Things like:\n‘It will have a massive impact on business’\n‘It will cost a fortune to put up the new signs’\nHave all been used as excuses\nWell I have no idea where they get those ‘facts’ from but lets just take a look at it.\nI recently went to Wales, which has introduced 20mph where people live. I did 150 miles to get there and it added a whole half a minute on to my journey because 99% of it was on normal roads. Then, with regards signs, we had a change of speed limit in Carlton from 40mph to 30mph. All it needed was a few stickers on the original signs!!!\nHere’s another fact for you. The government introduced 30mph for streets in towns and cities in 1935 due to safety concerns around the amount of traffic and pedestrians!! Really?!! I believe we have a bit more traffic now some 90 years later—don’t you!?",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_how-do-we-survive/content_4.html": "- Scrappng Winter fuel allowance\n- NI imposition on all businesses including Parish Councils\n- Inheritance Tax for farmers who are assett rich but cash poor\n- WASPI ladies loss after being TOLD labour would sort it.\n- Student Fee rise\n- Complete farce over EV conditions imposed by parliament which may now change—too late for employees at Luton.\n- 1p off a pint of beer which is a complete joke–price of a pint varies from £1.79 to £13\nThose seven items above are just the start and how many of those items were in the labour manifesto and how many of those were in our Local MP leaflets? Further more as my local MP is a member of the Government (whip) who will he represent in Parliament—his constituents who voted for him to impose all the above, or the government?\nAS TO HOW WE SURVIVE ALL THIS I URGE YOU TO RING HIM UP AND ASK HIM",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_care-in-the-community/content_57.html": "Today I listened to a lady give a very passionate story about her husband and his illness and her selfless devotion to caring for him. It really brings it home to you what a lot of people are going through. The lady got a carers allowance of £82/week. She is what is know as a WASPI lady, so when she finally was allowed her state pension she had to ask why she wasn’t getting it—the response was ‘you are getting a carers allownace’!!! Needless to say that is sorted but I then went to a Care Home with a difference. It looks after those who have had a brain injury such as the result of a stroke, and the staff there are again so supportive and caring. I had a look round, the ‘inmates’ have their own private space, they can do their own cooking, there is a small ‘time out’ area, a small gym and a good size canteen area where they can all get together.\nThe outside area needs some funding to smarten it up and remove trip hazards etc and in the summer it will be a lovely area to chill.\nBig thank you to all the staff for such a warm welcome today.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_author_mike/content_17.html": "North Yorkshire Council\nIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\nIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\nThe party has had 2 local meetings now, both well attended and the next one is crucial. It will be the AGM at which members will elect the 5 main commitee members to continue the good work that has been…\nWell the Mk1 is coming along nicely. Interior trim is more or less cleaned/repainted as needed. The car is currently at the sellers workshop but is coming ‘home’ this week on a trailer so I can start working on it…\nWe had our regular parish liason meeting with the power station and I thought it an idea to update you on their situation and some basic facts. Firstly they have received further support from the current government, albeit at a…\nI am hearing a lot about this subject not least because I am one apparently!! All born after 1946 have apparently made a fortune with the cheap houses they bought now worth millions. So I thought I would have a…\nHaving bit the bullet and purchsed a Mk1 Lotus Cortina that has been stood some years (and lost bits on the way) it feels like dejavu in a way. The car is a 65 airflow with the plain door cards…\nSome interesting facts for you that have emerged from a liason meeting last night at Selby Town Hall All parish and town councils have a new method of contacting North Yorkshire through a dedicated email address which they promise to…\nJust to give folk an idea of the sorts of things I am dealing with at the moment. It never ends!! Just thought I would update you on issues I am currently wrestling with. Drax—all sorted. The wooden post lamp…\nToday I visited the Thirsk Auction House for a meeting with farmers who wished to discuss the inheritance issue amongst other things. A number of different political parties were in attendence and spoke on the panel about the issue and…\nThose seven items above are just the start and how many of those items were in the labour manifesto and how many of those were in our Local MP leaflets? Further more as my local MP is a member of…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_north-yorkshire-council/content_6.html": "It has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\n- I had a report of an abandoned car which I tried to report. In the end I succeeded but only through grit and determination. Email council staff. Told to contact police. Emailed police. Told to ring 101. Get confirmation email from police and that they are going to get the council to shift it. Get confirmation email from council it will be shifted. One month later and it’s still not moved.\n- Whilst out leafletting I discovered that there is a pile of paperwork involved in growing and selling a lettuce and future generations may no bother!!\n- We now have had the fiasco of the whole of the residents of North Yorkshire having to fund issues that are wholly made by Scarborough Borough Council. This is the Water sports facility which has cost North Yorkshire £9m and has been written off. Then we have the judgement that North Yorkshire should have collected and held locally for the harbour area in Whitby all collections. This money has been going into general funding for years—could be costing millions. And now we have the Scarborough Football Club issue. Their ground is no longer fit for purpose and all their home games will probably have to be played elsewhere. A big factor in this is the now defunct drainage system which they reckon will cost £3.5m to fix. Guess who the landlord is!!! Had these issues been dealt with BEFORE we had gone unitary SCARBOROUGH BOROUGH COUNCIL WOULD HAVE GONE BUST. Now it is ALL the residents in North Yorkshire who are having to fund this. I can see now why there was this big push to go unitary!!! LET ME BE CLEAR ON THIS. I AM NOT AGAINST SORTING THE FOOTBALL PITCH OUT (OR ANY OF THE OTHER ISSUES) I JUST WANT PEOPLE TO BE AWARE OF WHAT PREVIOUS INCUMBANTS WERE UP TO AND HOW POORLY THEY SERVED RESIDENTS.\n- And finally we have the issue of Voids in our council house stock. They didn’t pay staff enough to come and work for the council so they went out to contractors. That hasn’t worked out and we still have a lot of empty homes and that list has grown. So much so that, for instance, a 4 bed house in Carlton has been empty for 5 years!! Finally they have completely refurbished it and a family will be moving in soon. And guess what? They have gone back to employing people, paying them more and they are ‘cracking on’ with refurbishments. It is hoped a lesson has been learned and we can start to see more homes back in use.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_political/content_1.html": "Interesting Articles\nFreeports: too ‘free’ and not ‘ports’\nLatest Political Information\n- North Yorkshire Council\n- Reform UK in Selby area\n- Farmers unite!\n- How do we survive!!\n- Democracy\n- Budget setting at North Yorkshire\n- Oh dear\n- Farming in the UK\n- Campaign meeting\n- Party time!!!! Thanks for the help\nDrax Church\nTo help people understand the overview of the history this video has been produced to give visitors insight into the local area.\nThe producer Guy Schofield is part of York University but also working freelance as Overcliff Media which is who we’ve commissioned for this work from. It was kindly funded by Selby District Council Cllr Mike Jordan, and organised through the Drax social committee. Those involved in the film include local historian John Hunter, and history enthusiasts Helen Brownbridge and Fergus Kelly. Our next project is to install a device on which people can watch the film in church and then add different videos to this over time.\nGroups and individuals are welcome to visit anytime. More information is on the website at achurchnearyou.com or find on Facebook @Draxchurch.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_oh-dear/content_29.html": "So this is where we are with this government so far.\n1. Got rid of the winter fuel allowance and alienated all pensioners.\n2. Introduced inheritance tax to alienate farmers.\n3. Increase fees and alienating all students.\n4. Increase NI thus alienating business.\nFood prices are on the rise again.\nDespite the Bank of England lowering the base rate mortgages are going up.\nWas any of the 4 above items in their manifesto as it would have been a real vote ‘winner ‘!\nFor the first time since becoming a cllr in 2007 I am going to see folk all over who have requested a visit to discuss options to get rid of this awful government. I have checked my local labour MPs leaflets and there is nothing at all about this.\nWe have to ‘suck it up’ as dad on Bluey says but there will be a reckoning.\nLabour candidates in local elections will want to talk about local not national, but it is those people who are the backbone of the party and it is those people who we now must turn our attention to.\nThe price of a pint went down a penny, did anyone notice!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_author_mike_page_5/content_44.html": "Council Budget\nNorth Yorkshire Councillors are about to start ‘wrestling’ with sorting out the budget for the next financial year (2024/5). Approximately half its budget goes on Adult Social Care and Children and Young Peoples Services and the pressures are never ending.…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_politics_page_3/content_11.html": "Wetherby and Easingwold\nI have no idea when the general election will take place, that is in the gift of the government, but there is time to form sensible opposition to either of the 2 main parties and have a re-think abut how…\nI have no idea when the general election will take place, that is in the gift of the government, but there is time to form sensible opposition to either of the 2 main parties and have a re-think abut how…\nPress Release for the ReformUK PPC for Wetherby and Easingwold. 22/02/2024 Mike Jordan has been a North Yorkshire Councillor for 15 years and is now a member of Reform Party. Formerly a member of both Conservative and the Yorkshire party…\nOn Saturday 24th Feb I attended the Conference for Reform UK where around 1,500 delegates attended a packed out Doncaster Racecourse. There were great speeches from all including the Leader Richard Tice and Ann Widdecombe and Executive member. Instead of…\nPlanning in the Selby area. This week sees further evidence of a lack of understanding in the Selby area by the Conservatives at North Yorkshire Council. The Selby Local Plan has progressed quite well and it was decided to continue…\nLike many of you I’ve been extremely unsatisfied by our Tory government who seem to have abandoned their electorate, going hell-bent towards annihilation in the coming election. That led me to dally with the Yorkshire Party, who seemed at least…\nMike Jordan 25, Garden Lane Tel: 01977 683766 Sherburn-in-Elmet Mob: 07975 695269 North Yorkshire Email: jordan_wedgwood@btinternet.com LS25 6AT Councillor/Employment/Family I am a councillor for North Yorkshire and passionate about Yorkshire and all it stands for. I volunteer at…\nSometime this year there will be a general election (the date will be determined by the government) and I hope to stand in the constituency of Selby. It was to be called Selby and Kippax, however the boundary commission have…\nMotorcycle Policy The Yorkshire Party recognises motorcycles as a valid form of transport with great potential to provide cheap, environmentally friendly and congestion-reducing benefits. With over 5 million road users qualified to ride powered two wheelers, we are determined to…\nNorth Yorkshire Councillors are about to start ‘wrestling’ with sorting out the budget for the next financial year (2024/5). Approximately half its budget goes on Adult Social Care and Children and Young Peoples Services and the pressures are never ending.…\nIn North Yorkshire there is no appetite in the Executive at the council to introduce a 20mph zone for all areas where people live. Debate was lost twice at Full Council recently following members of the public speaking to the…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_election-results/content_59.html": "The dust is starting to settle down and all the new faces are appearing on the TV on Sunday and the news as we go allong, even though footy is proving far more interesting!!! (You would think one of them would have mentioned it but hey ho!!)\nAs for myself I am happy with the start we have made, 3rd place from nowhere in a general election when people on the ground didn’t know me or the party is going some!!\nReform UK are now established and although we have only 5 MPs in Parliament I am sure they will be heard. I also believe there will be movement for change in the electoral system.\nSome facts for you\n- Labour got virtually the same number of votes as when Jeremy Corbyn was in charge\n- Lib Dems got 10 times more MPs with less actual votes than Reform UK\n- We would have 100 MPs at Reform UK if we had proportional representation.\n- Proportional representation means that there are the number of MPs in Parliament that reflect how people voted in the country.\nThe problem is that we now have a party in government with a huge majority and they will try and do whatever they want regardless. There are movements out there for change and the debate needs to be had.\nRight, time to get out on the bike I haven’t ridden for 10 weeks!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk/content_9.html": "Who’s Mike Jordan\nMK1 Cortina Car Club\nPolitical\nLatest Information\n- North Yorkshire CouncilIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\n- Reform UK in Selby areaThe party has had 2 local meetings now, both well attended and the next one is crucial. It will be the AGM at which members will elect the 5 main commitee members to continue the good… Read more: Reform UK in Selby area\n- Lotus Cortina updateWell the Mk1 is coming along nicely. Interior trim is more or less cleaned/repainted as needed. The car is currently at the sellers workshop but is coming ‘home’ this week on a trailer so I can… Read more: Lotus Cortina update\n- Drax Power Station newsWe had our regular parish liason meeting with the power station and I thought it an idea to update you on their situation and some basic facts. Firstly they have received further support from the current… Read more: Drax Power Station news\n- Baby BoomersI am hearing a lot about this subject not least because I am one apparently!! All born after 1946 have apparently made a fortune with the cheap houses they bought now worth millions. So I thought… Read more: Baby Boomers\n- Lotus Cortina RestorationHaving bit the bullet and purchsed a Mk1 Lotus Cortina that has been stood some years (and lost bits on the way) it feels like dejavu in a way. The car is a 65 airflow with… Read more: Lotus Cortina Restoration\n- Facts and figures and how Parish/Town Councils liaise with North YorkshireSome interesting facts for you that have emerged from a liason meeting last night at Selby Town Hall All parish and town councils have a new method of contacting North Yorkshire through a dedicated email address… Read more: Facts and figures and how Parish/Town Councils liaise with North Yorkshire",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_cars_nissan-skyline-the-1989-car-that-changed-things/content_49.html": "Way back in 1957 a Japanese car manufacturer called Prince entered a Skyline in saloon car racing locally. In 1966 they merged with Nissan and continued racing with the Gt-A and B. In 1969 the GT-R arrived and it dominated in Japan until Mazda brought forth the RX-3. After that and the fuel crisis Nissan lost a taste for racing until 1981. Not long after they reverted to their tried and tested 6 cylinder engine with twin cams and 4 wheel steering.\nThen we had 1989 and an R32 GTR thrust upon us.\nPicture the scene if you can. News of the R32 had filtered out to the world and a group of European journalists were invited to try the car out at the Nurburgring, regarded by many as the world’s most testing circuit. They met up with a small group of Japanese journalists and, quite by chance, a German Magazine had invited a group of professional drivers to do a comparison test of the Porsche 928, Mercedes 500SL and a BMW M5. After a learning lap the journalists set off at speed and it became clear that the car was very poised in whatever circumstance they threw at it. A red 928GT with far more power was just ahead of one particular journalist and kept ahead until the twisty bits of the circuit and then at the end of a lap the 928GT pulled over with smoke billowing from it as it fell silent.\nThe car itself.\nTechnically it was on a different planet to anything anyone had seen and the subsequent revised models (R33 and R34) hardly changed. The spec runs long and deep and it’s difficult to know where to start, so I am going to start at the back and work forwards with discussion around the 4 wheel steer system. Sensors monitor speed, steering angle, the speed at which the steering wheel is being turned and feed this to a microchip which works a hydraulic actuator and thus to a pair of track rods. The rear wheels can be turned up to a max of 1 degree. These rear wheels also receive power through a wet multiplate clutch and have sensors attached to see what the wheels are doing. The reason for this is that there is a transfer box which can transfer power to the front wheels should it see the back wheels not coping. This is all controlled by a unit that also takes information from sensors to the front wheels and a lateral G force sensor. Basically power can be put to each wheel as and when needed.\nTo ensure this all works you need a good suspension system. Nissan had recently introduced multilink suspension to their 300ZX which employs unequal length upper and lower control arms which some considered to be revolutionary, coupled with huge 225/50 R16 tyres on 8J 5 spoke alloy wheels, also designed to throw a lot of air at the brakes.\nThe brakes themselves are huge 4 pot piston units with vented discs up front and coupled to an anti-lock braking system seen only on super cars of the day.\nThen we turn our attention to the engine. Nissan have massive experience with straight 6 cylinder engines and the twin cams, 24 valves are engines seen in previous models. What they added though was twin ceramic Garret turbo charges coupled to intercoolers and controlled injection and ignition systems giving them 280bhp and 353Nm of torque allowing the car to do 0-60 in around 4.5 sec but keep pulling. Nothing happens under 3,000rpm but by 4,000rpm it all smoothly hurtles you on.\nIt really was the World’s most advanced road car at the time and at a little over £10,000 in 1989 was a ‘snip’ at the time. (Escort Xr3i was not much cheaper!)\nThere are 13 versions including the GTS single turbo version with rear wheel drive only and some 4 cylinder cars. All seat 4 people. The top of the range is actually a modified GTR—what more can they do I hear you say? Well there is a V-Spec version which, in 1999 was £10k cheaper than the Porsche, BMW Alpina and Honda NSX at the time, it was also better! The engine unofficially develops more power and as its 0-60 time is under 3 sec that is understandable. It was not sold officially in the UK but cars did find their way over and Middlehurst Nissan dealers in Lancashire could help with servicing as Skyline dealers. Needless to say the electronics played a large part in its surefootedness on the road which made it such an easy car to drive fast. The final version was an M-spec which had new ‘ripple control shock absorbers’ which worked to soak up any bumps to maximise tyre contact with the road. This showed the way to go for car makers as it showed that it was not just about power. Handling improved even further.\nIn March 2002 it all came to an end with the R34 but, as with most things, it has been revived in a new form of recent times.\nTHE FACTS\nBest model —GTR V Spec\nWorst model —auto estate\nBudget buy—GTS-T\nOK for unleaded—yes, some prefer super but all run on 95\nWill it fit the garage—4600×1785\nSpares situation—Excellent, new or used\nDIY ease—fair\nClub support—www.gtr.co.uk and skyline-owners-club.com\nAppreciating asset?—not yet but thinking about it\nWHAT TO LOOK FOR\nRunning gear\n• Gearbox gets notchy in 3rd—well used gear!\n• Suspension has a lot of bushes but poly option ready available, standard front shocks difficult to find and most cars have shortened springs all round\n• Original alloy wheels will probably have long gone\n• Clutch good on all models and plenty of garages can do repair\n• Most consumables cheap as fit other models in Nissan range\nWHAT TO LOOK FOR\nBody and Chassis\n• Most cars are imports which means a lack of underseal, if it has been in the UK for a few years check it was undersealed here\n• Rear arches around the lip are first to go\n• Dash is a nightmare to get out to change radio, so look for damage\n• Rear lights let water into the boot due to ageing\n• Front and back bumpers are plastic—look behind them\n• As most have been lowered look for signs of dents underneath as they often don’t use the proper jacking points\nWHAT TO LOOK FOR\nEngine\n• Oil pressure gauge often reads low, there was a problem on early R32s with the oil pump but after that it was down to a duff sender, new ones from Nissan are over £100 but plenty of options on eBay\n• Most have slung the air filter to get more noise in the car, ask if still available as it improves long journeys!\n• All 4 cylinder and 6 cylinders good for long distances if serviced regularly\n• Check cam belt done regularly\n• ECU can be chipped to make an easy 370 bhp on top models, after that it gets expensive, ask what has been done\n• Passing emissions test is hard work as the sensor is so far from the engine, make sure its warmed up\n• A stainless exhaust system is a good idea, its usually a big bore affair\nWHAT TO LOOK FOR\nGeneral\nThere are lots of cheap ones out there on eBay and that’s because they have been thrashed to death. Walk round the car, look for bends in the large panels. If you want top of the range then be prepared to spend over £15k or even more if modified (1,000bhp not unusual or useable!)\nVery little alterations were made between the R32/3/4 but obviously the newer the model the less likely there are to be problems.\nIf you want a good low mileage example in original kit go to an importer. As an example JM Imports can bid on a car for you in Japan, arrange shipping and all alterations to UK spec with number plate and MOT and under seal.\nThe reason to do this is simple. They drive on the same side as us, they have nicer weather, it’s a small place and so a lot are not thrashed, they have very stringent emissions rules and so cars end up sold with low mileage on them.\nBecause it’s Japanese there are very few electrical issues and they are very reliable in standard form, a bonus is that the indicator stalk is in your right hand were it should be.\nAs mentioned previous, most will have been lowered. As we have an obsession with speed humps in this country check underneath for ‘grounding’, the first to suffer is usually the exhaust.\nPRICES\nAll over the place!! Some early rare models can be over £5k and even earlier ones dating back to the 60s/70s/80s are a real guess—they were also not very exciting.\nA good V-spec car will command £15k but a good useable GTS-T with low mileage will be of the order of £5k. A standard GTR will be £8k upwards depending on age and condition\nThere are some much cheaper but expect to do work on them. If you like a challenge then pay £2k and set to finding parts, there are plenty being sold for parts only on both eBay and in Auto trader.\nThe authors own example is a bit rare, it’s a R33 GTS-T Type M. What this is is a single turbo version which makes exactly the same power but in a different way using a large turbo, but being a Type M means it has all the other ‘goodies’ that the GTR has except 4 wheel drive. That means power to the rear wheels only and a car weighing 150kg less (transfer box etc. weigh a lot!) On the road price in this country was £7.5k for a low mileage car (80 km) with stainless exhaust, lowered suspension and everything else as standard—the subsequent paint job was a further £1.5k but was the owners preference!\nIMPROVEMENTS\nIf not fitted then an aftermarket stainless exhaust is a must. There are a lot of suspension tweaks one can do depending on what type of road you travel on most, if its motorways then short springs improve handling—also good for track days. The big engine is good for 280bhp anyhow unless you have a restricted version which a good garage can remove. If you want to increase power then 370 is easy with a chip, after that it costs and you can spend £10k getting it to 480bhp. There are masses of brake alterations you can do and you could spend £500 on a full poly bush kit for the suspension if inclined.\nVERDICT\nAny skyline has ‘presence’ on the street, it says Nissan on the boot but then neatly says Skyline in the corner, those that know know! They are not parked up on any street corner and an early mint original R32 will have folk asking you what it is. Just say skyline and leave them to look it up on their ‘life support system’.\nShop around, scour eBay, auto trader and talk to the importers as they also service and repair a lot of these cars. If you want a nice standard relaxing one that will not break the bank then avoid the GTR, you are looking at 18mpg whereas a single turbo car can do 25mpg.\nThey have a decent boot, a calming presence, 4 seats, Nissan reliability and street cred—what more can you ask for!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_author_creativeshedagency/content_64.html": "This Tory Government isXXXXXXXXXXXXXXXXXX\nStretching across nearly 2,000 square kilometers, the Yorkshire Moors are home to an incredible array of flora and fauna. The moors boast a rich biodiversity, including rare species such as curlews, merlins, and adders. Additionally, the moors play a crucial…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_energy_food-vs-solar/content_27.html": "We now have a potential further set of solar farms and we have new a new figure for the total poential coverage:\nCamblesforth—180 acres—already happening\nDrax————-140 acres—already happening\nHelios scheme at Camblesforth and villages—1,200 acres—in the hands of the secretary of state\nHillam——100 acres—decision to be made by NYCC\nLight Valley Solar—5 sites totalling over 2,500 acres—- just announced and probably another government decision\nSo that is around 4,200 acres. You can produce around 4 tonne of corn on an acre, so that is the amount you are potentially taking out of our food supply each year for the next 40 years. Now bearing in mind we used to get a lot from Ukraine which was the major producer in europe, where do we go for it now!!? Why do you think Russia wants Ukraine? Why are the Chinese buying up land in France? Could it be we need food in order to live?\nSo as we get busy making electricity to heat our homes and power our cars, they get busy making food.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_wetherby-and-easingwold/content_32.html": "I have no idea when the general election will take place, that is in the gift of the government, but there is time to form sensible opposition to either of the 2 main parties and have a re-think abut how the country is run.\nWe do have some form of extraction from the EU but it isn’t complete by any means and indeed the press has reported how much we, as a nation, are still paying to that union.\nIt is further complicated by the issue of the ‘border’ for Northern Island which still has to be resolved. This and the amount of people still arriving here illegally from the perfectly safe country of France adds to the pressure for resolution.\nWe have a housing crisis. The housing growth cannot keep pace with the population growth. This country built 240,000 houses last year but the population rose by 700,000, and those people need to be housed. Landlords are increasingly deciding to sell up their properties. Rent is classed as income and is taxed, house prices have soared, so it makes sense to sell up, pay the capital gains tax and not bother providing homes for those who cannot afford a deposit or mortgage.\nWe also still have an inflation issue. The papers are reporting that food inflation is down to 3%. That may well be the case BUT the cost of that food is still 20% higher than it was a year ago, it didn’t fall back down to the previous levels and in that time wages didn’t go up 20%.\nWe need reform and we need it this year before it is too late.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_general-election/content_25.html": "Sometime this year there will be a general election (the date will be determined by the government) and I hope to stand in the constituency of Selby. It was to be called Selby and Kippax, however the boundary commission have simply dropped ‘Kippax’ though it still forms part of it.\nThe other villages/towns are Allerton Bywater, Methley, Ledston and Mickletown.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_uncategorized_closure-of-carlton-high-school/content_51.html": "As you will probably be aware a decision has been made by the trust/academy that runs the High School at Carlton to close the school. This was requested a while ago to the Secretary of State for Education and has been approved.\nThere is actually no consultation with the public or parents of children at the school, just a ‘listening period’ for people to discuss. This will be the final academic year for the school which will thus close next summer.\nAny parent who has requested their child to attend the school will be offered a different choice.\nThe premises are owned by the trust/academy, the playing fields adjoining the school are owned by North Yorkshire Council.\nThe principal reason is falling numbers making the school unviable.\nMy thoughts are with the staff and pupils at this moment in time as it is not a decision anyone wants to make and it will have consequences for all involved.\n(It was a little different when Drax Primary closed as it was down to 11 pupils due to parents choosing a different school for their child).",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_mk1-cortina-owners-club/content_43.html": "MK1 Cortina Owners Club\nThe MK1 Cortina Club was formed in May 1982 by Mike Jordan (Ne. Mike Pratt) and Roger Raisey.\nMike sent a letter to Practical Classics enquiring if any person was interested in forming a club for the MK1Cortina.\nRoger contacted Mike and they arranged to meet up, it was decided that if enough interest could be found they would form a club with the aim of keeping the MK1 Cortina on the road.\nAn advert was put in Practical Classics Car Magazine that Mike and Roger wanted to form a club for the MK1Cortina, such was the interest that by June the club was formed with 25 members and in July it was inaugurated.\nIn 1983 it was decided that a bi-monthly newsletter be produced. That is now a full bi-monthly magazine distributed worldwide to around 900 members.\nThe newly formed club decided that they would meet up once a year at a suitable venue in the midland`s so the National Show was formed meeting initially at Hagley Hall in the midlands.\nIn 1984 it was agreed that a spares fund be set up. This was well supported and enabled the club to purchase spares in job lots, but also to look at getting parts remanufactured.\nCurrently we meet at Stratford upon Avon Racecourse in August and combine our event with the Mk2 Cortina Owners Club and the Ford Anglia 105E Owners Club.\nThe club now has members all over the world and anyone can join, purchase spares and regalia all on line.\nGot an interest in or own a Mk1 Cortina? Then there is only 1 club for you!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_cars_mr-orange-mk1-cortina-505-mro-restoration-and-a-half/content_73.html": "It all started back in 2017. A lady from London rang me about her father’s Mk1 Cortina which he was reluctantly selling having owned it from new. Details were sent to me which I duly passed to the club editor at the time and it was put up for sale at £4k in the April Mag (weirdly it is the only April Mag we have ever done because it should have said May!!)\nSeveral months passed and I got bored one evening and rang the number to see if it had sold. No, was the answer so I arranged to go and see it in Edmonton very close to a certain football club as I discovered! We agreed the price on condition he got it an MOT so I could drive it home. A three page failure turned into a pass and on the so on the 5th Oct 2017 I set off with a mate and a one day insurance certificate.\nTo say it was an interesting drive home would be an understatement. It had only ever done 15 to 20 miles per year for the last 10 years so it was not a surprise when the temp gauge went off the top. I got to Toddington services and rang the AA. In the meanwhile I had offers for the number plate whilst parked up. Thermostat removed, circulation checked and off I set again at a steady 50mph. I ended up with the heater on full belt all the way home as it still read high but it had an oil pressure gauge fitted and this held steady at 35psi. I hopped up the M1 and was down to 40mph by time I got to the M18 as the propshaft was making a racket, but I got home after an 8 hr drive and just switched it off and went to bed!!\nI have to say I was quite pleased with it because it is the earliest English registered car that is known of, being a preproduction car made in the first week of August for the sales launch at the end of September. When purchased you could only have a blue one, it had to be a 2 dr deluxe and it had to have a 1200 engine complete with a pile of parts used in the Anglia 105E. The gentleman who purchased it paid to have the Ford Dealership change the roof to white before collection. It still ran with the throttle linkage in the engine bay despite offers from Ford in a recall to have it changed to the more well-known system. (I have to say it has been a pain to set up and get it to work properly.)\nSo that was the first stage over. Its home, in my name with the DVLA—see, paperwork FIRST!!! It was now a case of dismantling it and negotiating with my good friend Craig to do the body work and painting in Castleford.\nThe pictures can tell the saga of what was involved with the body work. Another car was purchased for a lot of the panels—and I mean a lot!!! I also got to use the propshaft and some other bits off this other car.\nWhilst Craig and staff were on with that I turned my attention to sorting all the parts, front suspension refurb, brakes refurb, fresh back springs and loads of little bits from the club (Mk1 Cortina!) and then there was the challenge of it being an early car because by Christmas 1962, having just launched it back in September, they were changing things, in fact lots of things including holes for the slam panel, throttle linkage as discussed earlier, dashboard, back panel, wheels (early cars had Anglia wheels with larger vents), interior light, wash bottle, bonnet safety catch and the blasted holes position on the bonnet, the glove box, seat brackets and so on!!! The only straightforward bit was the engine. When I took it out I discovered it was a later 6 bolt flywheel/crank (as opposed to 4) and was a 1300 engine but with a pre-crossflow head, the distributor was off a pinto it had a 1300 carb off a mk1 Escort with a pipe running to an airbox fastened to the inner wing off a taxi. So clearly I had no second thoughts about putting in a good 1500 engine I had with its standard pistons still in it.\nI then turned my attention to the trim and as it was mainly shot to pieces I trawled the internet. A company in the midlands who prepare saloon cars for racing had the right ones that just needed painting a different colour using vinyl spray paint. It was an interesting visit as they had a Lotus Mk1 all prepared and up for sale with a lot of incorrect parts on, but I kept that to myself!! The dash was renovated as best I could as they are not exactly an off the shelf item.\nMost of the glass is as per original but for the front screen which was badly scratched, I have however kept it along with the engine, gearbox, original prop, and a spare back axle—so I have all the big stuff in case anything goes wrong!! Some spare panels however were all sold to offset the now mounting costs for the project.\nThankfully the painting etc. all went well even down to how far to run the white of the roof down the pillar, I had kept pictures! The car came home and it was now time to put it back together. I put the brake pipes in first as it’s easier than when big lumps are put in and then gently assembled it over several months. The engine was a pig and I had to get help putting it in but eventually all was ready to start putting fluids in.\nBrakes were a pain. I followed the layout in the parts book but bleeding was a nightmare, then the clutch pipe proved a challenge and I had to back bleed it from the slave. All got wired up correctly but I didn’t connect up a battery as it went back to my good friend Craig Watton to ‘commission’ as he fits a buzbar supply for the electrics with fuses etc., all discreetly held under the dash (there is only one fuse on a Mk1 Cortina for the indicator relay).\nCraig then drove it to my house and I gathered a snagging list together for all the little things that have to be sorted such as changing the temperature sender for one that doesn’t light up the whole dash, a throttle linkage that had a mind of its own, a few rattles, fit the remainder of the dash, some wipers!, mats to preserve the near impossible to find rubber mats, door adjustments, ¼ light window rubber adjustments etc.!!!\nIt was finally more or less sorted and off I went to the Motorist Hub on the industrial estate in Sherburn in Elmet for a final look at 2 items I couldn’t sort followed by an MOT which it passed.\nHome it came and the interior heater radiator promptly started to leak!! Having replaced that the engine would not now run properly so a distributor change back to an original type seems to have solved, I await the next item. In the meanwhile I am enjoying the reliable red GT this summer and Mr Orange will just get the occasional ride out to keep it happy.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_report-on-the-demise-of-ice-vehicles/content_65.html": "I have read with interest the various reports and excitement generated by the switch to electric vehicles from Internal Combustion Engines. Back in the early part of the 20th century most cars were actually electric but they were found to be inadequate going forward. As technology has improved the pendulum appears to have swung back to the use of electric, or has it?\nOne of the main attributes of the electric car, we are told, is that there is no pollution from the exhaust, because it doesn’t have one. That is absolutely correct, but should that be the deciding factor? Should we not be looking at the whole life cycle of a car, or any other vehicle for that matter? Certainly EuroNCAP reports suggest we should, and I believe that is what we need to look closely at. The carbon dioxide is not just emitted from the exhaust, there is the whole fact that the vehicle has to be built in the first place, and how it is produced must be considered. That carbon dioxide has been created somewhere, even if not right next to the road and houses, and it is thus in the air.\nI turned my attention to a report produced by Footman James Insurance, a reputable well established company, which outlines the subject of carbon dioxide as mentioned above. Here are some facts they have gathered together:\n• A typical modern car such as a VW Golf creates some 6.8Tonne of carbon dioxide by the time it has been manufactured. Clearly it then continues to create carbon dioxide as it is driven and at 12,000 miles a year would create a further 5Tonne per year thereafter.\n• A typical electric car, such as the Polestar 2 being heavily advertised at the moment, creates 26 Tonne of carbon dioxide by the time it has been manufactured, but clearly very little from then on.\n• A hybrid car seems to encompass both variants with very high claimed miles per gallon and would thus appear to be of value.\nSo now let’s look at what this actually means going forward. My thoughts are as follows.\n- If you buy an electric car you are ‘front loading’ carbon dioxide i.e. you are emitting a large amount of carbon dioxide immediately, so 2030, could produce very high emissions if we switch to total electric. Something approaching 5 times as much in fact.\n- If we continue research into improving fuel economy it could be many years before the VW Golf matches the Polestar 2 for the amount of carbon dioxide produced, and that would be spread over a number of years, not all at once.\n- Hybrid cars are an especial puzzle. Driven as an electric vehicle they are being driven like any electric vehicle but are ‘lugging’ around 200kg of unnecessary engine and gearbox. Driven as a petrol vehicle they are ‘lugging’ around 200kg of battery and electric motors. So either way they have excess weight!!\nSo my thoughts are a bit left of centre going forward. I would like to see recycling taking centre stage on a grand scale.\nCar body shells last way longer than they used to and indeed there are plenty of cars of 15 years in age still being driven around on a daily basis.\nMy plan would be to get the manufacturers to offer a refurbishment service and switch some of their factories to this end. You take your 10 year old Ford to a main dealer, they send it off to be updated, stripped out so it comes back as a new car and you either wait for it to come back and pay, or you get another that is sat in their showroom that has been done but the original owner wanted something else. Full guarantee etc. etc.\nThis would dramatically reduce carbon dioxide production and would be much more sustainable than just simply forcing all to drive an electric car regardless.\nMike Jordan\n22/08/2022",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_ward-matters_street-lighting-in-north-yorkshire/content_48.html": "I have finally come to the conclusion that the council just can’t get their act together on the simple things. They know that at his time of year it gets dark. But do they think about getting gangs of staff out to ensure all the street lights work and are fit of purpose—-? No, not at all.\nThey get gritting lorries ready for winter so whats hard about checking and sorting all the street lighs!?\nWe have issues with a whole line of lights leading to Carlton and we have a light in Drax that the council cannot make their mind up what to do with—so they haven’t done anything!!\nWe then have the clearing of gutters—I am afraid I gave up reporting them 2 years ago as they just do what the like and whats easiest.\nIf anyone else has a lighting issue in my ward then please let me know as I now have a seperate book for them all. It would also be remiss of me not to mention that in some parts of my ward lights have been done several years and they haven’t billed anyone yet!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_reform-uk/content_19.html": "Like many of you I’ve been extremely unsatisfied by our Tory government who seem to have abandoned their electorate, going hell-bent towards annihilation in the coming election. That led me to dally with the Yorkshire Party, who seemed at least to have Yorkshire’s interests in mind. Unfortunately they have not displayed any inclination or enthusiasm to achieve what we would expect them to do, so for that reason I have resigned from YP and will not be standing as their candidate for Mayor of N. Yorkshire.\nWe seem to bounce between Tory and Labour parties every 10-15 years, whilst government of both stripes think only 5 years ahead, which does no favours at all to industry whose investment plans rely on some semblance of stability.\nWe really need to see some stability from both parties with better cross party representation within both houses of Parliament to achieve their plans and goals. We’re not getting that now, so some reform is long overdue.\nFor example, we cannot prosper without access to good quality steel, but both Governments allowed our steel-making industries to be sold to overseas investors. No surprise that when they allowed cheaper Chinese steel to undercut our products the foreign owners first demanded more tax-payer subsidies, then ended up shutting plants down entirely, devastating whole communities.\nWe’re in danger of becoming a service based economy unable to manufacture vitally needed products, relying only on imports to keep us going. It shouldn’t be like this.\nAfter recently meeting a group of very enthusiastic people from a party with real vision and determination to actually serve the electorate, plus ever-rising popularity with ordinary decent people, I am now a proud member of Reform UK. A new journey and a new chapter!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_energy/content_16.html": "Drax Power Station news\nWe had our regular parish liason meeting with the power station and I thought it an idea to update you on their situation and some basic facts. Firstly they have received further support from the current government, albeit at a…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_budget-setting-at-north-yorkshire/content_30.html": "It’s that time of year when cllrs have to start deciding on what are the priorities for the 25/26 financial year. Cllrs at North Yorkshire have had an initial meeting with heads of services to get a flavour of where they think they can make savings.\nI say ‘think’ because alsorts can crop up and ruin plans, such as masses of snow, policy changes with the NHS putting more loading on the council, some major defect in a road (A19 floods and degradation of the road).\nJust to give you a flavour of the sums involved:\n- Children and Young Peoples services is a £100m budget with half going on ‘Home to School Transport’\n- Selffunders in the Care System—they tend to go into care earlier but then run out of money. It is then the council who have to pay.\n- Libraries. This is still a £4.4m budget and a restructure is being looked at\n- The Summit in Selby is a significant drain on resources with little income\n- They are looking to review the high cost packges of care and may bring ‘in house’ as some other councils have done—target to save£1.3m\n- Transfer Transport responsibilities to the Combined Authority (Mayor!), that would save £1.1m but will almost certainly there will be ‘push back’!!!! on that one\n- More energy savings on street lighting. Somehow they think they can save £2m\nWe shall see at future meetings as to how this unfoldss",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_ppc-for-wetherby-and-easingwold/content_28.html": "Press Release for the ReformUK PPC for Wetherby and Easingwold.\n22/02/2024\nMike Jordan has been a North Yorkshire Councillor for 15 years and is now a member of Reform Party. Formerly a member of both Conservative and the Yorkshire party he recently became disillusioned with both but found like-minded colleagues in Reform UK. Following a rigorous vetting process he was accepted as an Approved Candidate and is delighted to be chosen to contest Wetherby and Easingwold in the forthcoming general election.\nMike is very well known in North Yorkshire and lives in Sherburn on Elmet which is less than a mile from the new constituency border. He is Yorkshire born and bred so is over the moon with the prospect of representing Wetherby in Westminster.\nVery much down to earth, he’s a retired industrial chemist, now active in many scenarios such as Motorcycle Action Group, classic car renovation (also a director of an international car club). As a real-ale campaigner he supports numerous local hostelries, so if you spot him in a pub it would be an ideal opportunity to make your opinions on current politics known!\nFinally, there are elections in May for the Mayor of North Yorkshire and York and Mike is backing the independent Keith Tordoff MBE. We need someone independent from current Westminster tribes!\nMike Jordan\n07975 695269",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_20s-plenty/content_71.html": "Yesterday at Full Council at North Yorkshire the 20’s plenty group did a public question in the council chamber. Following it, and under the constitution, there was a short debate and vote to progress this at the council—ie adopt it as a strategy. It failed sadly but there was certainly some comfort it the fact it was ‘aired’ in the council chamber.\nThe whole ethos behind it is NOT to stifle busines but make drivers do 20mph where people live. So in the main it means in town centres and villages and estates. I recently visited Wales to go cycling, which is 150 miles by car. I only had to do 20mph for the last 200 yards as I entered the village I was staying at!!! We already have it in a number of areas—centre of Sherburn in Elmet, all Kippax (which will be part of the Selby and Kippax Constituency next year!!) so lets bite the bullet.\nOne final point—they say it would cost millions to alter all the signs. In Carlton they lowered the speed limit from 40 to 30 as you enter from the north. They just got some stickers printed and stuck them on the original signs!!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_author_mike_page_2/content_20.html": "Democracy\nYou may be aware of outline plans by the government to cancel some of the local elections next year. This will be for those areas were there is a 2 teir system of District and County. The plan would appear…\nYou may be aware of outline plans by the government to cancel some of the local elections next year. This will be for those areas were there is a 2 teir system of District and County. The plan would appear…\nIt’s that time of year when cllrs have to start deciding on what are the priorities for the 25/26 financial year. Cllrs at North Yorkshire have had an initial meeting with heads of services to get a flavour of where…\nI have finally come to the conclusion that the council just can’t get their act together on the simple things. They know that at his time of year it gets dark. But do they think about getting gangs of staff…\nSo this is where we are with this government so far. 1. Got rid of the winter fuel allowance and alienated all pensioners. 2. Introduced inheritance tax to alienate farmers. 3. Increase fees and alienating all students. 4. Increase NI…\nIt would appear that having alientated pensioners the chancellor has now turned attention to farmers with the sole intention of destroying that industry and thousands of families with it. To impose an inheritance tax on the children of the farmers…\nIt seems we are are close to turning the area into a ‘solar state’. Yet another application has been entered close to Camblesforth for a solar farm to add to the list. Companies (and probably foriegn investors) have seen the…\nWe now have a potential further set of solar farms and we have new a new figure for the total poential coverage: Camblesforth—180 acres—already happening Drax————-140 acres—already happening Helios scheme at Camblesforth and villages—1,200 acres—in the hands of the secretary…\nAs the spokesperson for the Wetherby and Easingwold Constituency I am writing to inform you of an up and coming meeting. This will be for any and all to attend, subsequent ones will be for members only. Reform UK Supporters…\nAs you will probably be aware a decision has been made by the trust/academy that runs the High School at Carlton to close the school. This was requested a while ago to the Secretary of State for Education and has…\nEarly last week Ford Motor Company pulled the ‘plug’ on most of its DEI policies after a fresh look at them. The internal email went out to all employees informng them it will no longer take part in an annual…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_category_ward-matters/content_22.html": "North Yorkshire Council\nIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\nIt has been an interesting past week from my perspective as a cllr at North Yorkshire and here is a flavour of some of the ‘happenings’ in the region.\nWe had our regular parish liason meeting with the power station and I thought it an idea to update you on their situation and some basic facts. Firstly they have received further support from the current government, albeit at a…\nJust to give folk an idea of the sorts of things I am dealing with at the moment. It never ends!! Just thought I would update you on issues I am currently wrestling with. Drax—all sorted. The wooden post lamp…\nThose seven items above are just the start and how many of those items were in the labour manifesto and how many of those were in our Local MP leaflets? Further more as my local MP is a member of…\nIt’s that time of year when cllrs have to start deciding on what are the priorities for the 25/26 financial year. Cllrs at North Yorkshire have had an initial meeting with heads of services to get a flavour of where…\nI have finally come to the conclusion that the council just can’t get their act together on the simple things. They know that at his time of year it gets dark. But do they think about getting gangs of staff…\nIt seems we are are close to turning the area into a ‘solar state’. Yet another application has been entered close to Camblesforth for a solar farm to add to the list. Companies (and probably foriegn investors) have seen the…",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_general-election-work/content_68.html": "It has been a welcome start to getting leaflets printed and letting residents know that I exist and am not a robot (though I keep having to tell computers that!) Various meeting have been arranged throughout the constituency in the larger towns starting with one in Easingwold this evening.\nAll are welcome and please contact for specific details as there will be one each week.\nIn the meanwhile the leaflet is going out .\nI would ask that people also look to vote for Keith Tordoff the independant candidate standing in the elections in May for Mayor of North Yorkshire and York. Keith will bring that independance for westminster politics we so need and bring reform to how things are done.\nOne aspect of that will be the number of deaths and serious injuries with motorcyclists in North Yorkshire. The 95 Alive approach by North Yorkshire is not yielding results and a new method of getting the message across is needed.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_this-tory-government-isxxxxxxxxxxxxxxxxxx/content_70.html": "Stretching across nearly 2,000 square kilometers, the Yorkshire Moors are home to an incredible array of flora and fauna. The moors boast a rich biodiversity, including rare species such as curlews, merlins, and adders. Additionally, the moors play a crucial role in carbon sequestration, acting as a natural buffer against climate change. The expansion of the Freeport threatens to disrupt this delicate balance and could lead to irreparable damage to this fragile ecosystem.\nThe Environmental Impacts of the Freeport Expansion\nThe proposed Freeport expansion would entail significant construction activities, including the building of infrastructure, warehouses, and transportation networks. These developments would lead to habitat destruction, fragmentation, and increased pollution levels. The disruption of natural habitats could have far-reaching consequences for the region’s wildlife, potentially driving already vulnerable species to the brink of extinction.\nFurthermore, the expansion could result in increased air and water pollution, posing a threat to the health of both wildlife and local communities. The introduction of pollutants and chemicals into the ecosystem can have devastating effects on the delicate balance of the moors, potentially leading to long-term damage.\nWhile proponents of the Freeport expansion argue that it will bring economic benefits to the region, it is crucial to question whether these gains will truly outweigh the irreversible environmental damage. The short-term economic gains from the Freeport may come at the expense of the long-term well-being of local communities and the sustainability of the Yorkshire Moors.\nAlternative Approaches to Economic Development\nRather than blindly pursuing the Freeport expansion, we must consider alternative approaches to economic development that prioritize sustainability and environmental conservation. Investment in renewable energy projects, sustainable agriculture, and eco-tourism initiatives could provide long-lasting benefits for both the local economy and the environment.\nConclusion: A Plea for Responsible Development\nThe expansion of the Freeport threatens to irreversibly alter the cherished Yorkshire Moors, jeopardising the delicate balance of its unique ecosystem. While economic development is essential, it should not come at the cost of our natural heritage. We must advocate for responsible and sustainable development practices that prioritize the well-being of our environment, local communities, and future generations.\nIt is our collective responsibility to ensure that the Yorkshire Moors remain a source of inspiration and wonder for generations to come. Let us stand together in the fight for the preservation of this invaluable natural treasure.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_our-nhs-reforms-answer/content_72.html": "Are you, like so many others struggling to get an appointment with a\nGP, or suffering from an ailment which should have been treated very\nearly but are frustrated by ridiculously long hospital waiting lists?\nYou’re not alone, countless thousands are routinely failed by the\ncurrent NHS system, not helped by politicians pledging improvements\nbut achieving nothing. It’s nothing to do with underfunding, other\ncountries have far better health outcomes with less funding than we\npour into the bottomless pit. Why don’t we learn from them instead of\nperpetuating the misery.\nYou could trust other parties to keep their promises, or you could put\nyour faith in a vibrant new party which works only for you the\nelectorate and not for its own benefit. Here’s what Reform UK is\ndetermined to do on your behalf:\n1. Transform doctor and nurse availability. Frontline medics will pay\nzero basic tax rate for 3 years, which will help retain existing and\nattract many staff who have recently left\n2. Use independent healthcare capacity. Cut waiting lists by using UK\nand overseas providers. The independent sector can provide some of the\nbest care available. Nuffield Health and Marie Curie for instance are\nnot-for-profit charities, as are so many others. They are ready and\nwilling to help but are snubbed by those who protest this will\neffectively privatise NHS. Let’s be clear, Reform UK will ensure NHS\ntreatment will always be free at time of need.\n3. 20% tax relief on all private healthcare and insurance. For those\nwho can afford a little more to have private medical care it will be a\ngood incentive. This in itself will reduce the pressure on NHS waiting\nlists. Compare this with Labour who will instead add VAT on\nindependent healthcare, which will naturally make the NHS worse off.\n4. Doctor and nurse training. End training caps for all UK medical\nstudents. Write off student fees pro rata per year over 10 years of\nNHS service for all doctors, nurses and other medical staff. It will\nreduce the damaging drain to overseas hospitals of people who we\ntrained at great expense.\nThat’s only the start. We have long-term plans to continue\nimprovements in medical care, which I’ll tell you about in future\nemails. You now have the power to revolutionise UK healthcare without\npouring even more treasure down the current NHS bottomless pit, or you\ncan continue to trust those who have failed you. The choice is yours",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_democracy/content_8.html": "You may be aware of outline plans by the government to cancel some of the local elections next year. This will be for those areas were there is a 2 teir system of District and County. The plan would appear to be to make all or most change to Unitary as we have in North Yorkhire. In order to do that the local elections would be postponed for a year in order for all those areas to devise a plan to do that.\nThe cycnic in me thinks that would be useful to the Labour Party as, due to their extreme ‘popularity’, they might wish to prevent any losses at these local elections and give themselves time to turn around their abysmal ratings in the polls (bit of wishful thinking!!)\nIt also gives them time to rethink their attacks on pensioners, business, farmers, students, so they can find others to target (I just didn’t realise they were there to serve them not us).",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_yorkshire-flooding-aire-washlands/content_66.html": "Lower Aire Catchment Overview\nThe upstream catchment of the lower River Aire is vast and includes the extensive upstream moorland catchments of the upper River Aire as well as the River Calder which joins the Aire upstream of Castleford. Both of these upstream tributaries are substantial rivers in their own right and have their own histories of flooding. The lower River Aire is also tidally influenced where high tides can further slow the flow of water for a considerable distance upstream of the tidal limit. The lower River Aire spans a number of local authority boundaries and the operational areas of several Internal Drainage Boards.\nThe lower River Aire has historic flood embankments along the length of both banks, many of which were created during land drainage and reclamation activities in the 1940s and 50s.\nLower Aire Feb 2020 Flood Event\nThe flooding on the lower River Aire at the end of February followed an autumn and winter of exceptional rainfall that had fully saturated the ground and kept river levels high for prolonged periods. February 2020 was the wettest February on record for Yorkshire, the River Aire catchment received over 3 and a half times the amount of rainfall we would expect to see for that time of year.\nRiver levels in the lower River Aire responded to the continued rainfall, the volume of water in the river and the high spring tides such that the washlands filled to capacity and overtopped.\nThe Environment Agency worked with other risk management authorities and category 1 responders to manage the impact of the flooding. This included operation of flood risk assets and the deployment of mobile pumps and temporary defences. Despite these efforts, over 100 properties were affected in the communities of Hirst Courtney, Snaith and East Cowick.\nWhat the Environment Agency has done since February 2020\nFollowing the February flooding we have:\n• Inspected 130km of river bank since the floods in February and identified more than 40 locations needing repair work due to the damage caused during last autumn and winter.\n• Developed a recovery programme of work that require approximately £10 million on the lower Aire, which will bring flood defences back to the standard they were before these floods – this includes work at Newlands, Pickhill, Poor Bank, Temple Hirst, Allerton Bywater, Heck Ings, Snaith Ings (see below for progress).\n• Cleared debris along the lower River Aire over May – June, working with contractors and the Internal Drainage Board;\n• Begun grass cutting of banks, starting downstream and working upstream to enable inspection of their condition;\n• Briefed local MPs and councillors and worked closely with Local Authorities and other professional partners;\n• Produced a ‘keeping you informed’ newsletter which has been delivered to 3800 residents and key organisations to answer the immediate questions of the community; an ‘infographic’ – showing the headlines of the work we have done since February, shared updates and photos of work happening on social media, given interviews to radio and press releases to the media. We are currently investigating non-traditional means of communication and engagement for use during the Coronavirus restrictions.\n• Held a virtual public meeting with Parish and Town Councils and partners, including North Yorkshire County Council, East Riding of Yorkshire Council, Snaith and Cowick IDB, Selby District Council and MPs . This was a chance for the Parish and Town councils to discuss their concerns, ask questions of all partners and plan together future engagement with the affected communities. We are planning future events.\n• We have attended additional Parish and Town Council zoom calls.\n• Reviewed flood warnings\n• We plan to exercise these plans with our partners and the community.\n• We are assisting the local authorities (North Yorkshire County Council and East Riding of Yorkshire Council) with their Section 19 Flood Risk Investigations, due to be delivered later this year.\n• Continue to work with partners and the community\nRecent, current and future activities\n• Asset Performance have completed the Operational Reviews of the Lower Aire washlands, this has been a significant amount of work and will inform the S19s and our exceedance planning.\n• The flood modelling is being reviewed by our consultant JBA. They are updating the models to reflect what happened in February\n• The model is critical to any future operational changes we might want to make, future changes to the washlands and long term planning.\n• Our flood maps may change as a result of the modelling.\n• Residents will receive a second Newsletter this month, it focuses on our recovery work, winter preparedness, flood warnings and resilience.\n• We are inviting residents to contact us by email so that we can speak to them directly to find out their concerns\n• Flood warnings. Following a review of the flood warnings we are making updates to the flood warning areas covering the Snaith, East Cowick and Carlton communities. These changes will mean that a further 182 properties will be added to these warning areas from the 25th November. Those affected by this will be notified by post.\n• Attended Snaith and Cowick TC and Rawcliffe PC, working with them to recruit flood wardens\n• Issued Lower Aire flood alert on 2/11/20 alongside additional comms to parish and town councils. Understandable concern among residents in Snaith, however additional messages from TC were able to manage this.\nRecovery programme\nThe Environment Agency is progressing with a £32 million programme of Recovery Works across Yorkshire to repair flood defences damaged by the winter floods. A number of these repairs are planned for the flood defences of the lower Aire at a cost of approximately £10 million. We have appointed several delivery partners from our frameworks who will be carrying out the works on our behalf.\nThe works are planned to take place throughout the remainder of this year and into early 2021. Measures will be put into place, where required, to ensure the flood defences are winter ready. It is important to note that these works are to address damage caused by the floods of last year and this and are not improvements.\nRecovery Update\n• Contractors remain on site at Poor Bank (near Gowdall) completion date is delayed slightly due to wet weather\n• Works at Pickhill complete and contractors moving away from site\n• We are at the detailed design and planning stage at Newland to replace the existing defence and due to start on site in the new year. We will be updating the community through the Parish Council and letter drop.\n• Ground investigation finished at Chapel Haddlesey / Birkin Barrier and Carlton Bridge.\n• GI ongoing at Brotherton Ings, Hensall Ings Berm, Hensall Pumping Station.\n• Minor works complete at Little Airmyn and Newbridge Dutch River, and due at St Aidans Reservoir in December.\n• Mitigation measures have been put in place by our supplier and field team to ensure that temporary solutions are winter ready, using approximately 5000 sandbags. The sites include Temple Manor, Hensall Pumping station, Eggbrough Ings, Gowdall Ings and Hensall Ings.\n• An asset monitoring programme is in place throughout the winter\n• Sloop Inn (Temple Hirst) due to start in January. We are working on a ‘keeping you informed’ note to brief the local community\nBank stability at Airmyn\nWe are entering into the Outline Business Case stage which include designs. Parish Council and ERoY are being kept informed. Works likely to commence next summer.\nRawcliffe\nDetailed site investigations/condition survey planned for the spring. The outcome of this will inform when intervention is required.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_reform-uk-in-selby-area/content_15.html": "The party has had 2 local meetings now, both well attended and the next one is crucial. It will be the AGM at which members will elect the 5 main commitee members to continue the good work that has been started. This will be held in June so if you want to get involved then join asap!!\nOur current work centres around the Harrogate Town elections. This is a new council and Labour are barely throwing anyone or thing at it.\nReform are fielding in 18 out of the 19 wards.\nIF YOU ARE LABOUR IN HARROGATE YOU ARE PRACTICALLY DENIED ANY OPPORTUNITY TO VOTE FOR YOUR CHOICE—this further shows their contempt for folk–you should always try and give supporters the opportunity even if you are not certain or likely to win.",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_energy_drax-power-station-news/content_46.html": "We had our regular parish liason meeting with the power station and I thought it an idea to update you on their situation and some basic facts.\nFirstly they have received further support from the current government, albeit at a lower level, until March 2031. Then there is the old Fluid Gas Desulpharisation plant (built to remove sulphur when they burnt coal) which has now been completely decommisioned and they are now waiting for Government approval for the Carbon Capture scheme (BECCS) before actually demolishing it.\nPart of the reasoning behind this is the simple fact that the construction of the new all singing all dancing Nuclear Power Staion at Hinckley Point is delayed and a further simple fact is we actually need electricty.\nThen some interesting little facts.\n- Actually one of the biggest CO2 producers is cement works–you build more houses, you create more of the stuff!\n- Microsoft and others are looking for really secure electricity supply for their data centres so one may be on its way locally on top of the one at Eggborough—cooling for them is also important, so the river will be useful.\n- Nationally the power station provides jobs for around 6,500 people\n- It has cost the company a staggering £4.7m to remove all the waste from the site at the golf course and there is little likelihood of them getting any of this loss back.\n- They had an inspection from the Government body that regulates and checks up on them and what they are doing (no breaches by the way). An equally staggering team of 27 people rolled up—that must be some sort of record!!!\nThey have produced a film as it’s their 50th year since starting and they do regular engagements with schools and colleges in a 10 mile radius.\nFinally—Easter event at the Skylark centre on April 16th and 17th and they have regular Charity applications for each quarter and the dealine for this year are June 2nd and Sept 1st–visit their website!!",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_ward-matters_things-a-cllr-has-to-do/content_67.html": "Just to give folk an idea of the sorts of things I am dealing with at the moment. It never ends!!\nJust thought I would update you on issues I am currently wrestling with.\nDrax—all sorted. The wooden post lamp has just been replaced with a steel thing at a cost of £1,900 (Was £1200 just 3 years ago)\nCamblesforth—Trees on road to Drax Power still causing grief for everyone and the parish have still not been reimbursed for the money they had to spend proving the land the trees sit on is owned by North Yorkshire—why no one wants to take ownership is beyond me. Then we have the lights still out between the roundabout and the bridge over the railway line to Carlton. Then we have this new system of reporting which means the clerk can’t actually pick a phone up and speak to a real breathing person. Then there is the fishing ponds on Camblesforth Straight. Built illegally but then given permission despite ripping down all the trees and a nearby neighbour still has nightmares. Then we had a tree down in the village. A workman in a NYC came down, drove off and reported it as fixed (the clerk checked the portal). The Parish got a guy down to actually sort it later that day.\nCarlton—we have millions for Kex Gill and Harrogate convention centre and Scarborough Bay but a few grand for a replacement bus shelter by the old peoples homes is out of the question.\nNewland—the new piling to keep water out is leaking like a sieve, appreciate its an EA issue but wanted to make you aware and if it fails you will be busy\nHensall—on going issue with sewage every time we have a decent amount of rain near the cottages—Yorkshire Water say they are going to do it but no idea when—suspect a different tale if an YW employee or NY employee lived there and had to put up with raw sewage in their back garden every winter. Then we have the potential for a Farm Shop on the outskirts of the village which local residents want to save them driving to Knottingley all the time for fresh veg etc, however officers are not minded to approve despite the help it will provide for parking at the primary school right at a set of traffic lights!!\nThen we have the flooding on Wand Lane making it impossible to drive along if we get heavy rain—well known issue still not fully sorted\nLong Drax—issue with the river bank which is an EA one but wanted to ensure you are aware. They say that they will be starting in March—I am not holding my breath but Drax Power Station are.\nTemple Hirst—flooding by the Care Home—every winter—to get to Selby etc they have to go east to Carlton then up Camblesforth Straight. I appreciate work is to be done but w",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_politics_nhs/content_69.html": "There’s no doubt that the NHS is in trouble despite huge inputs of funding. It’s not all about money, it’s about how NHS is administered, and you could be forgiven for thinking they’re not working for your best interests. So what can be done about it? Here’s a sample of Reform UKs solutions:\n1. End doctor and nurse shortages. We will encourage existing staff and those who recently left to return by giving them 3 years exemption from basic rate tax. Write off student fees pro rata per year over 10 years of NHS service for all doctors, nurses and medical staff.\n2. Tax relief of 20% on all private healthcare and insurance. This will improve care by relieving pressure on NHS. Those who rely on NHS will enjoy faster and better care. Independent healthcare capacity will grow rapidly, providing competition and reducing costs.\n3. NHS patients will receive a voucher for private treatment, without cost to them, if they can’t see a GP within 3 days, or a consultant within 3 weeks, or have an operation within 9 weeks.\nThis is just the beginning. Reform UK has multiple plans to improve our NHS, which it should be emphasised will remain free at the point of need, despite scaremongering you may hear from other parties. Just go to the Reform UK website and you can read the whole Contract, it’s written in clear accessible language",
  "https_mike-jordan_co_uk_political_/https_mike-jordan_co_uk_contact/content_3.html": "Mike Jordan\nCllr Camblesforth and Carlton\nChairman Mk1 Cortina O.c\nSend me an email at contact@mike-jordan.co.uk\nPhone me on 07975 695269 or 01977 683766\nFollow me:\nMike Jordan\nCllr Camblesforth and Carlton\nChairman Mk1 Cortina O.c\nSend me an email at contact@mike-jordan.co.uk\nPhone me on 07975 695269 or 01977 683766\nFollow me:"
}