{
  "https_votepaulhaslam_com/https_votepaulhaslam_com_contact/content_2.html": "Skip to main content\nSkip to footer\nDonate\nHome\nAbout Paul\nMedia\nContact\nHome\nAbout Paul\nMedia\nContact\nGet in touch\n* Required information\nI agree to the personal data conditions outlined in your\nprivacy policy\n.\nGoogle reCaptcha: Invalid site key.\nSubmit Message\nContact details\n[email protected]\n+44 7458 197320\nWoodside Farm, Bilton Lane, HG1 4DH\nSign up for my newsletter and stay up to date.\nGoogle reCaptcha: Invalid site key.\nSign up\nBy clicking this button, you consent to the use of the information you provide in alignment with our Privacy policy.",
  "https_votepaulhaslam_com/https_votepaulhaslam_com/content_1.html": "Vote Paul Haslam on the 1st MAY\nStanding for\nOLD BILTON\nHarrogate TOWN COUNCIL\nPaul Haslam\nIndependent Candidate\nBringing Local Government Closer to the Residents\nIt’s about trust - not broken promises.\nThe Town Council is the first tier of local government, focused on residents’ interests. My vision is clear: the well-being of the people of Bilton and Harrogate will guide all my actions.\nThe new council must influence North Yorkshire Council and hold public bodies like the NYC, NHS and Police accountable, ensuring our community has a voice in shaping its future.\nAbout Me\nMarried to Kath, we’ve lived in Bilton since 2006. We have two dogs, Charlie and Sidney, who I run with daily. I’m not a career politician – I’m a resident who cares deeply about Old Bilton and wants to make a difference. I’ve spent 11 years as a councillor for Bilton and Nidd Gorge in Harrogate, campaigning for improvement.\nPreviously a CEO, I’m now a Business Transformation Consultant, and Executive Coach focused on leadership and career development. I bring business acumen and a proven record of delivery, ensuring council spending benefits all.\nOld Bilton – A Fantastic Place to Live\nFree from party dogma, my loyalty lies solely with the people of Old Bilton.\nI Will Listen to You\nI will hold regular community meetings to hear your concerns and ideas. My decisions will be based on what’s best for Old Bilton.\nI Will Be Your Voice\nI will be a strong, independent voice on the council, fighting for the resources and attention Old Bilton deserves.\nI Will Get Things Done\nI am committed to working tirelessly to address the issues facing our community. I will be a proactive and effective councillor.\nVote Paul Haslam\nThursday 1st May\nHousing\nEngaging with the Local Plan\n- Ensuring the Harrogate Neighbourhood Plan is fully integrated into the Local Plan.\n- Scrutinise sites included in the Local Plan, as these are likely to be approved for development. Locals must have their say.\n- Local Plan must include strategies for transport, high-quality schools, youth facilities, healthcare and waste-water management.\nTransport and Connectivity\nImproving Local Infrastructure\n- Ensure public transport is safe, frequent, reliable and affordable.\n- Fix the No.2 bus.\n- Safer speed limits including outside schools.\n- Development of Park & Ride.\n- A train station at Claro Road/Dene Park (with capacity for up to 400k journeys a year).\n- Promoting safe cycle routes and storage to encourage active travel.\nCrime\nA safer place to live\nWork with police and Safer Communities for our area to support initiatives to deter crime including:\n- Tackle anti-social behaviour (ASB)\n- Burglary reduction – increased police presence.\n- Safeguarding young people, particularly from violence and exploitation.\n- Combat violence against women and girls.\nProtecting the Environment\n- Fight for the eradication of raw sewage discharges into our rivers by collaborating with the Environment Agency and Yorkshire Water.\n- Preserving our green spaces – especially Nidd Gorge & Bilton Triangle.\n- Cleaner air, especially outside schools, by promoting green, affordable travel alternatives.\nSupporting Local Business\nThe visitor economy contributes around £¾ billion annually to Harrogate.\n- Supporting the BID, Chamber of Commerce, and existing businesses is essential, while encouraging new businesses to drive economic growth.\n- Support modernising Harrogate’s town centre while maximising key assets like the Conference Centre (contributing £50 million annually to the local economy), Royal Hall, and Theatre as central development components.\nHelp spread the word!\nYour endorsement makes all the difference!\nIf you like what you’ve seen, please help spread the word to your friends and encourage them to vote.",
  "https_votepaulhaslam_com/https_votepaulhaslam_com_media/content_4.html": "Media & Press\nLocal Impact Articles\nMayoral Campaign Articles\nMedia Bio\nPaul Haslam is the founder of a management consultancy practice specialising in Business Transformation and Executive Coaching for Personal Change. He holds an MBA from Manchester Business School.\nMotivated by a desire to give back to his community, Paul was first elected as a councillor in 2014. Throughout his tenure, he has spearheaded several initiatives focused on improving infrastructure and promoting sustainability within the region. His pragmatic approach to development has earned him recognition and respect. Notably, he has played a key role in enhancing public amenities and advancing environmentally friendly policies. Currently, Paul serves as the Climate Change Champion at North Yorkshire Council.\nAlthough he did not secure the Mayoralty for the York and North Yorkshire Combined Authority, Paul remains committed to serving his community. His campaign for Member of Parliament emphasises transparency in governance, increased community engagement, and practical solutions to regional challenges.\nImage Gallery\nThese images are free to use without attribution.\nPlease contact [email protected] if you have any specific requirements.",
  "https_votepaulhaslam_com/https_votepaulhaslam_com_about-paul/content_5.html": "I have solar panels installed on my home -they generate around 7000 kW per year\nMeet Paul Haslam\nFormer CEO now Business Transformation Consultant and Executive Coach focussed on Leadership and personal and professional career development.\nDedicated Councillor for Bilton and Nidd Gorge in Harrogate for 11 years, – campaigner for change – successfully opposed council on a proposed relief road through an area of outstanding natural beauty; successfully tabled a motion to support bathing water status at Knaresborough Lido and now Climate Change Champion.\nAt my professional work\nI help people and businesses transform their performance through delivering sustainable, measurable improvement.\nWith clients across the world, my management consultancy provides Executive Coaching and Business Consultancy including ESG, the Circular Economy and Mergers and Acquisitions (up to £100M).\nIn recent years as a CEO, I managed the sale and acquisition for £82.5m of a retail company based in London on behalf of the owner.\nAt home\nMarried to Kath, granddaughter of a Yorkshire coal miner. We have two dogs who I can be seen running with daily, Charlie and Sidney. We love living in Bilton, Harrogate where we settled in January 2006. We have two very grown up children and 6 grandchildren. I grew up in a corner shop which my mother ran, whilst my Dad worked as a “progress chaser” at Hawker Siddeley (aerospace). I confess to having spent much of my formative years in Lancashire but can honestly say I have now been in Yorkshire for past thirty years and so hope to be considered a local. However, I have been known to watch reruns of Peter Kay to remind me of a happy past!\nAt play\nOutside my council aims which drive me, I am mainly seen running with my two dogs. I enjoy running and can often be found participating in the local park run.\nHelp spread the word!\nIf you like what you have seen, then you might consider giving more than your vote.\nPlease tell your friends about me – especially if they live locally – and help spread the word!\nIn politics\nI’ve been a councillor for 11 years, starting at Harrogate Borough Council. In 2017 as part of the fight against the relief road, I was elected to North Yorkshire County Council. I am now, the first ever the Climate Change Champion and I am promoting an environmentally friendly approach to everything the council does as part of business as usual so that it is sustainable.\nI sit on the Transport, Economy, Environment Overview and Scrutiny Committee and make it a point to attend all the fortnightly meetings of the Executive, which are in Northallerton. I like to keep my finger on the pulse.\nI am the only councillor on Food for the Future (Fix our Food) York and North Yorkshire in conjunction with the University of York\nI also represent North Yorkshire at Transport for the North and chair the Scrutiny Committee.\nIf you were to ask what I have done then I might cite:\nLeading the successful campaign against the Relief Road across the Nidd, supporting the residents around Knox Lane to get the proposed inappropriate development refused planning permission. More recently I stood in the Mayoral election as an independent candidate for York & North Yorkshire – the feedback of which encouraged me to stand as an MP candidate.\nThis year, I have used my locality grant to support:\nNew Beginnings Charity – supporting women after domestic abuse.\nResurrected Bites – reducing food waste, loneliness and food poverty.\nNidd Action Group – protecting the water quality in the Nidd.\nInstallation of VAS signs – improving road safety outside schools.\nBilton Historical Society – IT support\nBilton and Woodfield Library – contribution to refurbishment\nHenshaws – environmental project\nSt John’s Church – Youth support work provision\nRichard Taylor School – Fiction books for KS1\nOpen Country – IT support\nBilton Area Methodist Church – Family fun time\nThe Village Harrogate – Baby clothes exchange\nMy Personal Carbon Pledge\nI consider myself fortunate to be able to invest in a variety of eco-friendly solutions. As an early adopter, I am eager to evaluate their feasibility and understand the practicalities involved. I am committed to making the viable options more attainable for the wider community. Once fully developed, green energy has the potential to lower our bills and significantly reduce our carbon footprint without costing the Earth.",
  "https_votepaulhaslam_com/https_votepaulhaslam_com_privacy-policy/content_3.html": "Privacy policy\nEffective Date: 3rd June 2024\nCandidate Paul Haslam (“we”, “us”, or “our”) respects your privacy and is committed to protecting it through our compliance with this policy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you visit votepaulhaslam.com (the “Site”). By using the Site, you agree to the collection and use of information in accordance with this policy.\n1. Information We Collect\nWe collect information from and about users of our Site:\na. Personal Identification Information: Including your name, email address, telephone number, and postal address that you voluntarily give to us when you choose to participate in various activities related to the Site, such as online campaigning, making donations, signing up for information, and responding to surveys.\nb. Donation Information: When you make a donation, we collect information such as your billing address, payment information, and donation amount. Please note, for transparency and compliance with UK campaign finance laws, donor names and donation amounts may be published.\nc. Derivative Data: Information our servers automatically collect when you access the Site, such as your IP address, browser type, operating system, access times, and the pages you have viewed directly before and after accessing the Site.\nd. Data from Third Parties: Including data from third-party sites that integrate our services, like Intuit MailChimp for email campaigns, and Google ReCaptcha for spam protection.\n2. Use of Your Information\nWe use the information collected about you via the Site to:\na. Send you updates and emails via Intuit MailChimp.\nb. Process your donations and comply with legal requirements.\nc. Protect our Site from spam and abuse through ReCaptcha.\nd. Increase the efficiency and operation of the Site.\ne. Monitor and analyse usage and trends to improve your experience with the Site.\n3. Sharing of Your Information\nWe may share information we have collected about you in certain situations. Your information may be disclosed as follows:\na. By Law or to Protect Rights: If we believe the release of information about you is necessary to respond to legal process, to investigate or remedy potential violations of our policies, or to protect the rights, property, and safety of others, we may share your information as permitted or required by any applicable law, rule, or regulation.\nb. Third-Party Service Providers: We may share your information with third parties that perform services for us or on our behalf, including payment processing, data analysis, email delivery, hosting services, customer service, and marketing assistance.\n4. Opt-out\nYou may opt-out of the mailing list at any time using the unsubscribe link in the foot of the campaign emails.\n5. Cookies and Web Beacons\nWe may use cookies, web beacons, tracking pixels, and other tracking technologies on the Site to help customise the Site and improve your experience. You can manage your cookie preferences for non-essential cookies.\n6. Privacy Policies of Other Websites\nThe Site contains links to other websites. Our Privacy Policy applies only to our Site, so if you click on a link to another website, you should read their privacy policy.\n7. Changes to Our Privacy Policy\nWe reserve the right to make changes to this Privacy Policy at any time and for any reason. We will alert you about any changes by updating the “Effective Date” of this Privacy Policy.\n8. Contact Us\nIf you have questions or comments about this Privacy Policy, please contact us.\nThis Privacy Policy was created to inform you about how we collect, use, and share your personal information and to ensure transparency and compliance with legal requirements. By using our Site, you consent to our Privacy Policy and agree to its terms."
}