{
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_1134-2/content_16.html": "NHS\nNHS\nWith an ageing population and more young people creating families of their own we need a Rhondda remedy for us all.\nWhether it be GP surgery appointments, 24 hour A&E access, minor injuries without having to book an appointment or life-saving cancer treatment. It’s absolutely vital for us to know our Parents, Grandparents, and our Children are able to access the healthcare they need, wherever they need it, free of charge.\nLatest News\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...\nBanking Hub for Rhondda\nLabour will stop the decline of the great British high street and bring much-needed banking services back to communities in the Rhondda. Labour has announced it will accelerate the rollout of ‘banking hubs’ which help people deposit and take out cash as well as...\nAcquired Brain Injury Bill\nMy Acquired Brain Injury Bill will receive its Second reading on Friday 3rd December. The Bill commits the government to prepare and publish a strategy to meet the needs of children and adults with an ABI. Acquired Brain Injury is a leading cause of death and...\nSection 19 Statement\nWe would like to thank Rhondda Cynon Taf Council for their thorough investigations and robust action following the flooding events of February 2020. The much anticipated section 19 report, conducted to ascertain the cause of the flooding, confirms what we have...\nGetting There\nMost of us have to travel to get to work. For years the Treherbert service has been terrible. Two carriages instead of four. No seats. Filthy toilets. Delays and cancellations. Thanks to Chris’s campaigning, from 2022 brand-new trains will run every 15 minutes,...\nUniversal Credit\nWhen the Tories introduced Universal Credit they insisted that nobody would get any money for the first five weeks unless they applied for a loan. Chris has called on the government time and again to abolish this five week window. “People in the Rhondda aren’t looking...\nRhondda Arts Festival\nAt the last election Chris promised to help set up a Rhondda Arts Festival with Treorchy Comprehensive. True to his word the first Festival was in 2018 and this June thousands came along to the open-air cinema in Treorchy, saw the British Museum’s Japanese dragon,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_2320-2/content_8.html": "We would like to thank Rhondda Cynon Taf Council for their thorough investigations and robust action following the flooding events of February 2020. The much anticipated section 19 report, conducted to ascertain the cause of the flooding, confirms what we have believed from the very beginning, that the blockage to the culvert inlet was the primary cause of flooding and woody debris was a significant factor in blocking the culvert inlet leading to the floods of February 2020. Given the topography of the land above Pentre, saturated land on steep mountainside, and with the knowledge of watercourses and culverts in close proximity, the action taken by Natural Resources Wales (NRW) to discard timber from felled trees on the mountainside was short sighted and ultimately left 159 homes and 10 businesses flooded. We will be seeking urgent meetings with NRW to discuss the findings of the section 19 report, and exhausting all available avenues to best represent residents in Pentre.\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_mineworkers-pension-scheme-uplift/content_7.html": "Today I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto\ncommitment to return the Investment Reserve to mineworkers, handing back £1.2bn to 112,000 former miners and their families. We are delivering justice for the 1481 families here in Rhonnda and Ogmore and many\nmore across the country who have been affected by the injustice of the Mineworkers’ Pension Scheme.\nOur country owes a debt of gratitude to the mineworkers who built our national heritage and powered our country. Many local residents have shared with me their anger at the deep injustice of the Scheme, and that is why I am so pleased that today we deliver on a key pledge in Labour’s manifesto. This will mean a 32% increase to the annual pensions of mineworkers across the country, on average an increase of £29 per week for each member. I want to pay tribute to the many people here in Rhondda and Ogmore who have campaigned for justice on this\nvital issue.\nThe Labour Government also announced today the commitment to reviewing the surplus-sharing agreement to ensure a fairer deal for former miners and their families in the future, with further steps to be outlined in the coming months. With increased payments now going out to miners and their families.",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_page_3/content_20.html": "Putting you in control, get in touch\nIf it matters to you, then it matters to me –\nhere are the 4 main areas I will be prioritising for the Rhondda and Ogmore going forward.\nLatest News\nRhondda Arts Festival\nAt the last election Chris promised to help set up a Rhondda Arts Festival with Treorchy Comprehensive. True to his word the first Festival was in 2018 and this June thousands came along to the open-air cinema in Treorchy, saw the British Museum’s Japanese dragon,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_1140-2/content_2.html": "Employment\nEmployment\nJobs, Jobs, Jobs – With almost half of all Rhondda residents of working age either out of work, furloughed, or claiming support, we need a real solution for the future.\nJob security, rights at work, minimum wage, and decent holidays are what most workers want and should be entitled to. I’ll be focusing on 3 main areas going forward to ensure Rhondda workers find work, stay in work, but receive a fair amount of support if times get tough.\nLatest News\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...\nBanking Hub for Rhondda\nLabour will stop the decline of the great British high street and bring much-needed banking services back to communities in the Rhondda. Labour has announced it will accelerate the rollout of ‘banking hubs’ which help people deposit and take out cash as well as...\nAcquired Brain Injury Bill\nMy Acquired Brain Injury Bill will receive its Second reading on Friday 3rd December. The Bill commits the government to prepare and publish a strategy to meet the needs of children and adults with an ABI. Acquired Brain Injury is a leading cause of death and...\nSection 19 Statement\nWe would like to thank Rhondda Cynon Taf Council for their thorough investigations and robust action following the flooding events of February 2020. The much anticipated section 19 report, conducted to ascertain the cause of the flooding, confirms what we have...\nGetting There\nMost of us have to travel to get to work. For years the Treherbert service has been terrible. Two carriages instead of four. No seats. Filthy toilets. Delays and cancellations. Thanks to Chris’s campaigning, from 2022 brand-new trains will run every 15 minutes,...\nUniversal Credit\nWhen the Tories introduced Universal Credit they insisted that nobody would get any money for the first five weeks unless they applied for a loan. Chris has called on the government time and again to abolish this five week window. “People in the Rhondda aren’t looking...\nRhondda Arts Festival\nAt the last election Chris promised to help set up a Rhondda Arts Festival with Treorchy Comprehensive. True to his word the first Festival was in 2018 and this June thousands came along to the open-air cinema in Treorchy, saw the British Museum’s Japanese dragon,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_contact-us/content_10.html": "I am only able to respond to Rhondda and Ogmore residents.\nIf you want to know who your MP is, please click here.\nIf you have any specific queries or concerns, casework, want to know my thoughts on policy that you would like me to address or just book a surgery appointment, please get in touch below.\nGet in Touch\nThanks for getting in touch. By pressing the submit button, you agree to opt in. Where you have opted in, Chris Bryant MP and team members may contact you through the communication channels you have chosen. You can opt out of communications from Chris Bryant MP or manage your preferences at any time. To find out how to do this and for more information contact 01443 442521.\nRhondda and Ogmore\n9 Compton Road\nTonypandy\nRCT\nCF40 1BE\n01443 442521\nParliament\nChris Bryant MP\nHouse of Commons\nLondon\nSW1A 0AA\n020 7219 8315",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_banking-hub-for-rhondda/content_6.html": "Labour will stop the decline of the great British high street and bring much-needed banking services back to communities in the Rhondda.\nLabour has announced it will accelerate the rollout of ‘banking hubs’ which help people deposit and take out cash as well as get support and help with broader banking services. Labour will work with banks and, where necessary, bring in new powers for the Financial Conduct Authority to stop people being left in ‘banking deserts’, guaranteeing communities access to face-to-face banking services.\nBuffy Williams MS and I pressed for a banking hub for Treorchy LINK earlier this year after the town was left without any bank branches.\nMany individuals believe that banks are pressuring them to utilise online banking and are getting rid of in-person banking services. However, there are many people who solely rely on branch banking and are not comfortable with online banking. Moreover, local businesses require a nearby location to access funding and deposit cash without having to travel long distances. Labour’s proposal aims to bring banking services back to communities that have seen them vanish over the years. This will result in more people throughout the country being able to access the necessary services closer to their homes.\nLabour’s plan could see at least 350 banking hubs established on local high streets, and as hubs are shared by the major banks, customers from almost every bank can use the hub. The plans come as Labour reveals the shocking lack of banking services available on British high streets. Alongside the plans to bring back banking to communities, Labour will also back the great British high street with plans to:\n- Give councils the power to tackle shuttered-up shops.\n- Tackle antisocial behaviour and shoplifting through dedicated police patrols.\n- Replace business rates with a fairer system.\n- End late payments to support small businesses.",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_news/content_9.html": "Mineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...\nBanking Hub for Rhondda\nLabour will stop the decline of the great British high street and bring much-needed banking services back to communities in the Rhondda. Labour has announced it will accelerate the rollout of ‘banking hubs’ which help people deposit and take out cash as well as...\nAcquired Brain Injury Bill\nMy Acquired Brain Injury Bill will receive its Second reading on Friday 3rd December. The Bill commits the government to prepare and publish a strategy to meet the needs of children and adults with an ABI. Acquired Brain Injury is a leading cause of death and...\nSection 19 Statement\nWe would like to thank Rhondda Cynon Taf Council for their thorough investigations and robust action following the flooding events of February 2020. The much anticipated section 19 report, conducted to ascertain the cause of the flooding, confirms what we have...\nGetting There\nMost of us have to travel to get to work. For years the Treherbert service has been terrible. Two carriages instead of four. No seats. Filthy toilets. Delays and cancellations. Thanks to Chris’s campaigning, from 2022 brand-new trains will run every 15 minutes,...\nUniversal Credit\nWhen the Tories introduced Universal Credit they insisted that nobody would get any money for the first five weeks unless they applied for a loan. Chris has called on the government time and again to abolish this five week window. “People in the Rhondda aren’t looking...\nRhondda Arts Festival\nAt the last election Chris promised to help set up a Rhondda Arts Festival with Treorchy Comprehensive. True to his word the first Festival was in 2018 and this June thousands came along to the open-air cinema in Treorchy, saw the British Museum’s Japanese dragon,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_rhondda-arts-festival/content_4.html": "At the last election Chris promised to help set up a Rhondda Arts Festival with Treorchy Comprehensive. True to his word the first Festival was in 2018 and this June thousands came along to the open-air cinema in Treorchy, saw the British Museum’s Japanese dragon, designed their own dragon at school, joined the Workers Art Gallery events, attended one of fifteen concerts or watched Romeo and Juliet on the mountainside. And as Trustees we’re planning for something bigger and better next year.\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_privacy-policy/content_3.html": "Privacy Policy\nPrivacy Policy\nI am the MP for the Rhondda Constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/) for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy data protection officer can be contacted at Garethw.Hughes@parliament.uk or on 01443 442521.\nData collection and use\nThe office of Chris Bryant MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with:\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for the Rhondda Constituency, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will be retained for as long as it is necessary to resolve or otherwise complete your request and I will retain some information about closed cases in case you contact me again for help.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites:\nThis website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights:\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n- Obtain copies of the personal information I hold about you (known as a “subject access request”)\n- Request that I correct or update any personal information held about you\n- Ask that we erase or restrict the way in which I use your information\n- Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)You may opt out of receiving further communications form me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nGareth Wyn Hughes\n9 Compton Road\nTonypandy\nCF40 1BE\nGarethw.Hughes@parliament.uk\n01443 442521\nAlternatively you have right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_monthly-report/content_13.html": "Monthly Report\nWant to know what I’ve been doing in Rhondda and Ogmore?\nYou can read all about it in my latest newsletter — packed with updates on the issues that matter most to our community.\nClick the button below to open the latest report.\n📩 Sign up to my mailing list to get the latest straight to your inbox.",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_surgeries/content_18.html": "Advice Surgeries\nIf you’d like to attend one of Chris’s regular advice surgeries around Rhondda and Ogmore, please complete the form below. One of the team will contact you with more details. Alternatively, you can call 01443 442521.\nThanks for getting in touch. By pressing the submit button, you agree to opt in. Where you have opted in, Chris Bryant MP and team members may contact you through the communication channels you have chosen. You can opt out of communications from Chris Bryant MP or manage your preferences at any time. To find out how to do this and for more information contact 01443 442521.\nRhondda and Ogmore\n9 Compton Road\nTonypandy\nRhondda\nCF40 1BE\n01443 442521\nParliament\nChris Bryant MP\nHouse of Commons\nLondon\nSW1A 0AA\n020 7219 8315",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_acquired-brain-injury-bill/content_5.html": "My Acquired Brain Injury Bill will receive its Second reading on Friday 3rd December. The Bill commits the government to prepare and publish a strategy to meet the needs of children and adults with an ABI.\nAcquired Brain Injury is a leading cause of death and disability affecting over 1.3 million people and costing £15 billion to the UK economy each year. It is an issue for the Departments of Health and Social Care; Work and Pensions; Education; and Digital, Culture, Media & Sport; and the Ministries of Justice, Defence, Housing Communities and Local Government.\nThat is why a national cross-departmental strategy for Acquired Brain Injury is long overdue.\nTo find out more about the campaign and read the bill please visit www.abibill.org.uk",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_universal-credit/content_11.html": "When the Tories introduced Universal Credit they insisted that nobody would get any money for the first five weeks unless they applied for a loan. Chris has called on the government time and again to abolish this five week window. “People in the Rhondda aren’t looking for handouts. They just want to stand on their own two feet, work hard and get on in life. Many people don’t have deep pockets or savings. It’s crazy that the system pushes families into debt just when they most need help.”\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_getting-there/content_12.html": "Most of us have to travel to get to work. For years the Treherbert service has been terrible. Two carriages instead of four. No seats. Filthy toilets. Delays and cancellations. Thanks to Chris’s campaigning, from 2022 brand-new trains will run every 15 minutes, cutting the journey time by 12 minutes and there will be new connecting services in Cardiff.\nOn the buses?\nThe free bus pass is not much use if the bus routes are wrong. Chris has persuaded stagecoach to run extra buses on the Saturday 120/130 service, from Penygraig to Porth on Saturday afternoons and from Clydach to Tonypandy at 1840 on Mondays to Fridays – and install phone charging points on the 120/130 route.",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_transport/content_15.html": "Transport\nTransport\nWhen it comes to transport in the Rhondda – be it by car, bike or bus on road or rail – we are on track.\nLooking to the future, transport links will play a crucial part in the lives of Rhondda residents. With growing calls to go green, we will need significant investment in the Treherbert line, buses in both Fach and Fawr, and bike routes, making it easier to travel without the need for cars, for both business & leisure.\nLatest News\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...\nBanking Hub for Rhondda\nLabour will stop the decline of the great British high street and bring much-needed banking services back to communities in the Rhondda. Labour has announced it will accelerate the rollout of ‘banking hubs’ which help people deposit and take out cash as well as...\nAcquired Brain Injury Bill\nMy Acquired Brain Injury Bill will receive its Second reading on Friday 3rd December. The Bill commits the government to prepare and publish a strategy to meet the needs of children and adults with an ABI. Acquired Brain Injury is a leading cause of death and...\nSection 19 Statement\nWe would like to thank Rhondda Cynon Taf Council for their thorough investigations and robust action following the flooding events of February 2020. The much anticipated section 19 report, conducted to ascertain the cause of the flooding, confirms what we have...\nGetting There\nMost of us have to travel to get to work. For years the Treherbert service has been terrible. Two carriages instead of four. No seats. Filthy toilets. Delays and cancellations. Thanks to Chris’s campaigning, from 2022 brand-new trains will run every 15 minutes,...\nUniversal Credit\nWhen the Tories introduced Universal Credit they insisted that nobody would get any money for the first five weeks unless they applied for a loan. Chris has called on the government time and again to abolish this five week window. “People in the Rhondda aren’t looking...\nRhondda Arts Festival\nAt the last election Chris promised to help set up a Rhondda Arts Festival with Treorchy Comprehensive. True to his word the first Festival was in 2018 and this June thousands came along to the open-air cinema in Treorchy, saw the British Museum’s Japanese dragon,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_visiting-westminster/content_19.html": "Visiting Westminster\nVisiting Westminster\nEver wondered what it’s like to sit in the public gallery at Prime Minister’s Questions or walk through the corridors of Westminster where decisions about our valleys are made?\nChris is proud to represent the people of Rhondda and Ogmore in Parliament—and that includes helping local residents experience it for themselves.\nPrime Minister’s Questions (PMQs)\nPMQs happen every Wednesday at 12 noon, when Parliament is in session. It’s one of the liveliest half-hours in British politics—and you can be there in person to see it for yourself.\nMy office is given a small number of tickets each month, and they’re always in high demand. If you’d like to attend, it’s best to get in touch early. Tickets are limited and offered on a first-come, first-served basis. Most people can bring one guest. To apply, just drop me an email with the full names and addresses of everyone who wants to attend.\nTours of Parliament\nThe Palace of Westminster is a historic and fascinating place to visit and you can take part in free guided tours. These last around 75 minutes and give you the chance to see where laws are made, learn about the history of Parliament, and understand more about the role your MP plays. Chris can book these tours for Rhondda and Ogmore constituents, and they’re a great way to get to know how democracy works from the inside.\nGet in Touch\nIf you live in Rhondda or Ogmore and want to book a tour or apply for PMQs tickets, please email: chris.bryant.mp@parliament.uk\nMake sure to include your full name, address, and the names of anyone who would be joining you.",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk/content_1.html": "Putting you in control, get in touch\nIf it matters to you, then it matters to me –\nhere are the 4 main areas I will be prioritising for the Rhondda and Ogmore going forward.\nLatest News\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...\nBanking Hub for Rhondda\nLabour will stop the decline of the great British high street and bring much-needed banking services back to communities in the Rhondda. Labour has announced it will accelerate the rollout of ‘banking hubs’ which help people deposit and take out cash as well as...\nAcquired Brain Injury Bill\nMy Acquired Brain Injury Bill will receive its Second reading on Friday 3rd December. The Bill commits the government to prepare and publish a strategy to meet the needs of children and adults with an ABI. Acquired Brain Injury is a leading cause of death and...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_1148-2/content_14.html": "Education\nEducation\nEducation first, second and third. With more competition now than ever before for jobs, we need to make sure our future generation grow in a learning society, best equipped for the new era of work.\nWe have amazing schools in the rhondda, let’s unleash our children’s potential, shine a light on their talents and raise their ambitions to thrive in the future. Education is one of our public sector pillars, we must continue to support to ensure we are a far fairer country.\nLatest News\nMineworkers Pension Scheme Uplift\nToday I am proud to say that today the Labour Government is ending the historic injustice of the Mineworkers’ Pension Scheme. In the Budget, the Chancellor announced that we are delivering on our manifesto commitment to return the Investment Reserve to mineworkers,...\nBanking Hub for Rhondda\nLabour will stop the decline of the great British high street and bring much-needed banking services back to communities in the Rhondda. Labour has announced it will accelerate the rollout of ‘banking hubs’ which help people deposit and take out cash as well as...\nAcquired Brain Injury Bill\nMy Acquired Brain Injury Bill will receive its Second reading on Friday 3rd December. The Bill commits the government to prepare and publish a strategy to meet the needs of children and adults with an ABI. Acquired Brain Injury is a leading cause of death and...\nSection 19 Statement\nWe would like to thank Rhondda Cynon Taf Council for their thorough investigations and robust action following the flooding events of February 2020. The much anticipated section 19 report, conducted to ascertain the cause of the flooding, confirms what we have...\nGetting There\nMost of us have to travel to get to work. For years the Treherbert service has been terrible. Two carriages instead of four. No seats. Filthy toilets. Delays and cancellations. Thanks to Chris’s campaigning, from 2022 brand-new trains will run every 15 minutes,...\nUniversal Credit\nWhen the Tories introduced Universal Credit they insisted that nobody would get any money for the first five weeks unless they applied for a loan. Chris has called on the government time and again to abolish this five week window. “People in the Rhondda aren’t looking...\nRhondda Arts Festival\nAt the last election Chris promised to help set up a Rhondda Arts Festival with Treorchy Comprehensive. True to his word the first Festival was in 2018 and this June thousands came along to the open-air cinema in Treorchy, saw the British Museum’s Japanese dragon,...",
  "https_www_chrisbryant_org_uk_/https_www_chrisbryant_org_uk_page_2/content_17.html": "Putting you in control, get in touch\nIf it matters to you, then it matters to me –\nhere are the 4 main areas I will be prioritising for the Rhondda and Ogmore going forward.\nLatest News\nSection 19 Statement\nWe would like to thank Rhondda Cynon Taf Council for their thorough investigations and robust action following the flooding events of February 2020. The much anticipated section 19 report, conducted to ascertain the cause of the flooding, confirms what we have...\nGetting There\nMost of us have to travel to get to work. For years the Treherbert service has been terrible. Two carriages instead of four. No seats. Filthy toilets. Delays and cancellations. Thanks to Chris’s campaigning, from 2022 brand-new trains will run every 15 minutes,...\nUniversal Credit\nWhen the Tories introduced Universal Credit they insisted that nobody would get any money for the first five weeks unless they applied for a loan. Chris has called on the government time and again to abolish this five week window. “People in the Rhondda aren’t looking..."
}