{
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_cdn-cgi_l_email-protection/content_15.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_about-rss/content_22.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_privacy/content_8.html": "This document outlines how Iain Duncan Smith processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Iain Duncan Smith\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Iain Duncan Smith.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Iain Duncan Smith, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Iain Duncan Smith via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns_re-open-broadmead-road-bridge/content_12.html": "On the 13th of July, Redbridge Council decided to close parts of Broadmead Road, specifically the bridge, between Charteris Road and St Barnabas Road, after the results of a survey revealed structural issues with the bridge passing over the Central Line.\n5 months later, the extent of the damage to Broadmead Bridge and the progress being made on its refurbishment is still unclear. Since the bridge has been out of service, businesses across Woodford have been cut off from local customers, parents have struggled to get their children to school on time, and emergency services have had to take huge detours through residential areas.\nIn a recent letter sent to residents, Redbridge Council claimed that urgent funding from the central government was required to repair the Broadmead Road Bridge. As the local Member of Parliament, I was not informed about this urgent funding appeal before the letter was sent to residents. Moreover, I am very concerned that the Council have used their own resources to deliver a highly politicised letter to residents, at the taxpayers’ expense.\nSubsequently, I have written to the Chief Executive, reminding them of their responsibility to ensure that the Council acts in the best interest of residents, rather than with political intentions. This has become more apparent in recent years, as I have just been made aware, via a Freedom of Information request submitted by Josh Mellor, a local journalist, that as early as 2014, Transport for London (TFL) raised significant concerns about the bridge and warned Redbridge Council that failure to act would result in:\n“injury or service loss with the ensuing legal actions”.\nIt is clear to me that failure to let residents know this important fact and the Council’s failure to act on that warning has resulted in great inconvenience to residents and potential risk. I have asked the council to specify what work was carried out to improve the bridge’s safety following the concerns highlighted by TFL in 2014 and if TFL approved any such works.\nAbove all, the closure of Broadmead Road Bridge is now having a major impact on residents and local businesses. It is surely in the Council’s best interest to resolve this issue as soon as possible. I welcome any opportunity to work with the council and neighbouring MPs in bringing forward a solution and getting the bridge repaired as quickly as safely possible.\nWatch my video on Facebook here: https://fb.watch/rk--Fy4Edb/\nSurvey information can be found here: https://www.cwgca.org/broadmeadbridge",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_trumps-laudable-desire-peace-may-make-him-neville-chamberlain-our-era/content_6.html": "The speed with which the Trump administration has hit the ground and heaved executive orders and ultimatums at domestic targets and foreign states has been breathtaking. We’ve seen threatened tariffs, threatened takeovers of Greenland and the Panama Canal, the re-naming of the Gulf of Mexico/America and the freezing of all payments from key US bodies.\nBut the most important and far-reaching announcement President Trump has made so far is the statement that he had held an hour and a half telephone discussion with President Putin of Russia on the war in Ukraine.\nWhat I found worrying in all of this isn’t just that Trump didn’t speak to Ukrainian President Zelensky first, but that in this conversation he casually conceded two critical points without getting anything from Putin in return. First the Ukrainian territory that Russia has seized, which many Ukrainians have died to defend, and second, potential Nato membership for Ukraine.\nPresident Trump’s Defence Secretary Pete Hegseth, at the same time in Europe, was correct to say that European nations have for too long ridden on the coattails of America. He is also right to insist that Europeans should take on responsibility for European security and right to criticise the fact that for too long European countries made themselves dependent on Russian oil and gas while defence budgets were raided.\nEven though I agree that the US needs to shake Europe up over its failure to spend enough on defence, I don’t agree that the US should pull the plug on Ukraine. That will be a self-defeating position, and it will only increase the threat to the US, not diminish it.\nTo get this straight, Ukraine has never asked for US boots on the ground in their fight. Ukrainians have long realised it is their responsibility to fend off their brutal neighbour. What they have asked for and too often failed to get is the proper equipment to do what they must, without insane restrictions on its use. That the war has lasted three years is largely down to Western dithering and inconsistency. Ukrainian troops have been forced to fight with one hand behind their backs. The delays on everything from F-16 fighter jets and main battle tanks to 155mm artillery shells and ATACMS missiles have cost them dear in human losses and Russia’s incremental advances.\nHaving just returned from Ukraine, close to the Russian border in the Southeast, I have seen the effects of Western weakness first hand. I have also seen the incredible resolve and belief in democracy that have characterised the Ukrainian nation.\nThe real threat to the US is the rise of the totalitarian states. Russia, Iran, North Korea and of course China and their proxies across the world. You can see how coordinated these nations are, from Iran’s support for Russia and its attacks by Hamas and Hezbollah on Israel. North Korea and China’s support for Russia’s invasion of Ukraine has also been significant, while Russia’s transfer of missile technology to North Korea is now increasing the threat to the US in the Indo-Pacific.\nAll these nations have watched the failure of the free world to step up when democracy has been threatened. From South Ossetia in Georgia through the Russian Invasion of Ukraine in 2014 and the disgracefully panicky abandonment of Afghanistan, we have shown that we are weak in the face of their ambitions.\nRussia is determined to re-create the Soviet Union and China is equally determined to seize Taiwan – these ambitions are inseparable. Whether the incoming administration likes it or not, the road to Taiwan runs right through Ukraine. Abandoning Ukraine to the rapacious demands of Putin will make China’s demand for Taiwan even stronger, intensifying what the Trump administration sees as its primary foreign challenge.\nIn 1938, in Munich, Czechoslovakia was forced by France and the UK to hand over the Sudetenland to Hitler in the hope that Hitler would be appeased and end his further territorial ambitions. Sadly, like Zelensky today, the Czech Prime Minister was absent from the negotiation. Hitler went on to gobble up the rest of Czechoslovakia and then Poland. The subsequent war led to 60 million dead.\nToday, as with Germany in the 1930s, China and Russia’s territorial ambitions are undiminished while – as in the 1930s – the West looks divided and Irresolute. If the US President forces Ukraine to accept the loss of its territory Putin will have won. History will be repeated and we will have learned nothing from the past, for Putin will re-group and come back for the rest of Ukraine.\nChamberlain once said of Czechoslovakia that this is “a quarrel in a faraway country, between people of whom we know nothing.” My worry is that the same sentiment is alive and well in the US at the moment, and that in the laudable pursuit of peace in Ukraine, justice is simply abandoned.\nI ask President Trump to think again on his present course, otherwise he may well risk becoming our era’s Neville Chamberlain.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns_opposing-greater-london-boundary-charge-ulez-fee/content_23.html": "The Mayor of London, Sadiq Kahn, is trying to pass the cost of his financial mismanagement to drivers by charging up to £33 a day to drive from outside of London into the centre. Sadiq has proposed a Greater London Boundary Charge of £3.50 — or £5.50 for non-environmentally compliant cars — for cars crossing into a zone that roughly maps to the M25.\nEach year this would affect an estimated 1.3 million drivers and cost residents £1,000. The charge is in addition to the £12.50 ULEZ fee, which the Mayor is expanding to the North and South Circular at the end of this year, and the further £15 cost of driving into the congestion zone in central London.\nMany of the vehicles that cross the London boundary are essential service vehicles such as plumbers and electricians, or key workers and shift workers who can’t afford to live in the capital and the elderly attending hospital appointments, in our case travelling to Whipps Cross Hospital.\nThe taxpayer has already funded a £3.4 billion bailout for Transport for London (TfL) and yet the Mayor is astonishingly asking the Government for a further £1.4 billion despite already reducing certain services, such as buses, by 4 percent. In 2019, well before Coronavirus hit, the Mayor had already announced an above inflation hike in fare prices of 2.6 percent.\nBurdening ordinary people with high costs because of the Mayor’s failure to balance his finances is a disaster. Londoners shouldn’t have to foot the bill for Sadiq’s mismanagement.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_recommendations-taskforce-innovation-growth-and-regulatory-reform/content_27.html": "Taskforce for Innovation, Growth and Regulatory Reform: boosting jobs and levelling up through better regulation to promote the growth sectors of the future\nThe Taskforce on Innovation, Growth and Regulatory Reform (TIGRR) has today (16th June) reported its recommendations to the Prime Minister on how the UK can reshape regulation and seize new opportunities from Brexit.\nEarlier this year, the Prime Minister asked former ministers Sir Iain Duncan Smith MP, Theresa Villiers MP, and George Freeman MP to identify how the UK can take advantage of its new-found regulatory freedoms and stimulate growth, innovation and competition across the economy and level up across the United Kingdom.\nThe report sets out over 100 recommendations, identifying specific high-growth opportunities reflecting on feedback from over 75 industry meetings and roundtables. It demonstrates how, with ambition and vision on the part of the Government, the UK can deliver on the promises of Brexit without abandoning our high standards - unlocking growth and investment in technology to help level up the country.\nThe report sets out a new framework for regulation based on a UK common law approach: replacing the slow, bureaucratic and EU process reliant on negotiations between 27 countries.\nFree to set its own rules, the MPs propose that the UK adopt a bold new regulatory framework based on a new ‘Proportionality Principle’, agile, digital regulatory innovation, and new duties on regulators to consider the impact of their rules on UK competitiveness and productivity.\nThe 120-page Report sets out significant immediate economic opportunities for the UK to lead and set the international standard in areas such as pension investment, data, and clinical trials. Key proposals include:\n- Regulatory reform to allow pension schemes to invest in innovative start-up and scale-up businesses which could unlock over £100bn of investment in the high growth high tech sectors of the future, whilst still maintaining prudent protections and safeguards.\n- Replacing GDPR with a UK Data Protections Framework with enhanced rights and controls for consumers and is more proportionate for charities, smaller businesses to free small businesses from some of the 80+ working hours that around half of them report spending to sustain GDPR compliance.\n- Building on the UK success with the Covid vaccine to boost UK clinical trials - replacing the EU Clinical Trials Directive with a new UK Trials Framework built on the UK Covid trials. This will be a major boost to the UK clinical trials sector - a market worth £2.7bn - the second biggest in the world - that already supports more than 47,000 UK jobs - increasing those benefits and spreading them more evenly across the country.\nSir Iain Duncan Smith MP said: “Now that the UK has left the EU it is important to change our approach to regulation which reflects the needs of the UK. This report shows the way ahead with the move to the proportionality principle setting a more flexible and balanced approach to future regulations and changes to existing regulations. Importantly this will help new markets develop, as well as releasing significant amounts of capital from existing successful markets to help level up the UK post the pandemic.”\nGeorge Freeman MP said: “The pace of technological innovation is creating real opportunities for the UK, but too often we lead the science but fail to commercialise in the UK. We now have an opportunity to tackle that by setting the new regulatory standards key to investor and consumer confidence in new high growth sectors: from nutraceuticals to Ai, digital health and new fuels like hydrogen. This isn’t about scrapping our commitment to high agri-environmental standards or workers rights, it's about establishing UK global leadership in more agile, digital and evidence-based regulation. The ten high growth sectors we have identified can all deliver serious growth for post-COVID recovery for all parts of the UK.”\nTheresa Villiers MP said: “Taking back control over making our own laws means we can adapt regulation to reflect our national interest. We can adopt a better, more targeted, more proportionate approach because decisions on our regulations are no longer dependent on lengthy negotiations and compromises with 27 other countries. We must use this new freedom as an opportunity to get ahead in the high growth, high tech, sectors of the future. This report provides a blueprint for how we can do this, including unlocking billions of pounds of investment in start-up businesses and innovative technology.”\nThe recommendations in this report demonstrate the huge opportunities the UK has with its new-found powers to create our own laws, to lead globally on standards, and foster an approach which ensures that regulatory systems are fit for the economy of the future and have the agility to adapt to changing technology. Facilitating competition and new market entrants should be at the heart of our approach to regulation.\nSir John Bell said: “The UK Covid Recovery Trial shows what the UK can do when it is free to move at pace.\n“We were only able to do this because of the UK Life Science Strategy Reforms of 2011-16.\n“Medicine is changing fast: genomics & digital health are transforming healthcare. As this Report sets out - the UK has a huge opportunity. We need to grasp it. Or risk falling behind.” Min\nTaskforce Terms of Reference: https://www.gov.uk/government/publications/taskforce-on-innovation-growth-and-regulatory-reform/taskforce-on-innovation-growth-and-regulatory-reform-tigrr-terms-of-reference\nPrime Minister Boris Johnson responds to the Taskforce on Innovation, Growth and Regulatory Reform report",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_category_Speeches-in-Parliament/content_29.html": "Russia’s Grand Strategy Debate in the House of Commons 19th January 2023 It is a real privilege to speak in this debate and I congratulate my hon. Friend the Member for Harwich and North Essex (Sir Bernard Jenkin) on obtaining it. I... Speeches in Parliament\nMy Tribute to Her Late Majesty The Queen in House of Commons 9th September 2022 So much has already been said and I do not intend to repeat it much, but I do want to say that it is a sad day for all of us. It is tragic news, bringing to an... Speeches in Parliament\nUK GOVERNMENT BOWS TO CALLS FOR BRITISH JUDGES TO WITHDRAW FROM HONG KONG MOMENTS BEFORE KEY DEBATE 30th March 2022 The UK Foreign Secretary Liz Truss has made a statement supporting the withdrawal of British judges from Hong Kong, moments before a Westminster Hall debate on... Speeches in Parliament\nConcerns around the impact of China's National Intelligence Law on UK Telecommunications 25th May 2021 Chinese firms operating in the UK would be obliged to secretly pass on sensitive data to intelligence services if requested by the Chinese state, so have put... Speeches in Parliament\nIR35: Curb or kill umbrella company-focused Finance Bill amendments. 24th May 2021 Amendments proposed to the Finance Bill which I supported in a bid to “curb or kill” umbrella companies were unfortunately rejected. I hoped, if accepted by the... Speeches in Parliament\nFire Safety Bill vote to protect leaseholders from unfair cladding costs 27th April 2021 My speech in the Fire Safety Bill in the House of Commons. I support holding the Lords amendment. I think it is the right thing to do at the moment, although... Speeches in Parliament\nTribute paid to His Royal Highness Prince Philip, Duke of Edinburgh 13th April 2021 Tribute paid to His Royal Highness Prince Philip, Duke of Edinburgh in the UK House of Commons I rise to extend my condolences to Her Majesty the Queen on the... Speeches in Parliament\nWe need much tougher sentences for Pet Theft. Violence and theft of pets is wrong and we need to do something about it now. 15th March 2021 Speaking in the UK House of Commons in the Police, Crime, Sentencing and Courts Bill: We need much tougher sentences brought in for Pet Theft and a... Speeches in Parliament\nSir Iain Duncan Smith condemns Government for blocking genocide amendment vote 9th February 2021 Sir Iain Duncan Smith condemns the Government’s use of procedure to bundle together multiple amendments to prevent a vote on the genocide amendment to the Trade... Speeches in Parliament",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns_make-pet-theft-specific-criminal-offence/content_18.html": "2020 has been the worst ever year for dog thefts – tougher sentences are needed for pet theft.\nAlthough this may not make national news, for many, many families what is happening to their dogs is heart-breaking. 2020 has seen an increase in dog thefts of 250 per cent in some areas.\nMore time at home and limitations on social contact has increased demand for dogs, with a 168pc rise in searches for puppies for sale. Sadly, criminals have capitalised on this, as the price of dogs skyrockets.\nBut dogs are worth far more than their monetary value. As a dog owner myself I know how vital dogs are as companions, therapists and exercise buddies – not to mention the skill of working canines such as sheep dogs and medical detection dogs. They are, for many people, part of the family.\nThere has been widespread and growing public support for tougher sentences for pet thieves. Pet theft is wrongly categorised as robbery or burglary – in the same category as the theft of an inanimate object – sadly, this then leads only to minimal sentences.\nI'm hoping progress can be made to make pet theft a specific criminal offence. Currently, although the theft of a pet is already a criminal offence under the Theft Act 1968 and the maximum penalty is 7 years’ imprisonment, if a case is in fact brought to court, it would most likely go to a magistrates' court, which is normally non-custodial. This can include something like a ban and fine when related to something like drink driving to a community sentence for a crime like petty theft.\nThis isn't good enough. There has been widespread and growing public support for tougher sentences for pet thieves. Pet theft is wrongly categorised as robbery or burglary – in the same category as the theft of an inanimate object – sadly, this then leads only to minimal sentences.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_cookies/content_11.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns_join-campaign-save-south-chingford-community-library/content_2.html": "The South Chingford Community Library (SCCL) is at risk of closing permanently. I need your help to save it!\nIn 2011, Waltham Forest Council closed the Council-run Library. Leaving Chingford Mount the only town centre in the borough without one. In response, the community, local Conservative Councillors, and I campaigned for a new Community Library to be established.\nFollowing that successful campaign, the SCCL was established in 2012 and has occupied 265 Chingford Mount Road, London, E4 8LP for the last 12 years. The SCCL is a registered charity, run by unpaid volunteers drawn from the local area.\nWhile day-to-day costs are covered by SCCL donations, Waltham Forest Council were responsible for covering the cost of accommodation, currently around £40,000 a year. However, since September 2023, Waltham Forest Council has owed over £19,000 to the current landlord.\nAt the beginning of April 2024, I am delighted to announce that following pressure from local residents, councillors and myself, LBWF Council has finally paid £19,000 that was owed to South Chingford Library’s landlord.\nWhilst the rent has been paid and eviction is no longer on the cards, the future is still unclear. This is the first victory of the campaign, but we now need to redouble our efforts to ensure the Community Library has a long-term future.\nIt is vital that the community continue to show their absolute dedication to this library. Whilst the community library is saved for now, the fight continues so please sign our petition to Save Our Community Library at https://www.cwgca.org/library\nJoin me, and 1000’s of other local residents and back our campaign to Save Chingford Community Library.\nThe Conservative Group on Waltham Forest Council proposed an amendment to the budget on Thursday 29th February, which would have allocated £80,000 of the ring-fenced ‘leadership priority fund’ to save SCCL. All of the Labour Councillors’ voted against this amendment, including Labour Councillors’ in South Chingford and Highams Park.\nTo back our campaign, please share your views by filling out the attached survey. You can send it back using the freepost envelope provided or complete it online at www.cwgca.org/library and together, we can Save South Chingford Community Library.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk/content_1.html": "Safer Streets. Better schools. Control of our borders. Levelling Up.\nI'm working hard to deliver on your local community priorities. A record of delivery and a promise of more.\nIn Chingford & Woodford Green, that means campaigning for more local police and essential services - from delivering the new Whipps Cross hospital to protecting the area from over-development. If you'd like to help me, along with our hard-working councillors, London Assembly Members and hundreds of friendly volunteers, join us today. Together we will get the job done.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news/content_21.html": "Jobs are vital to welfare reform. Unemployment has been medicalised, leaving too many without aspiration or hope. Sunday, 16 March, 2025 It’s hard to get a car moving with the handbrake on. Jobs are vital to welfare reform. Unemployment has been medicalised, leaving too many without aspiration or hope. To govern is to choose and against the backdrop of an increasingly unsafe world, the need to invest significantly more in defence and a flatlining economy, further reform of welfare is a necessity. When I resigned from Cameron’s... Articles\nIf Ukraine goes down, Taiwan will be next. 24th February 2025 By appearing weak and divided, the West is sending a worrying message to its adversaries. Megaphone “diplomacy”, that feature of the Cold War, has re-surfaced... Articles\nTrump’s laudable desire for peace may make him the Neville Chamberlain of our era 14th February 2025 The speed with which the Trump administration has hit the ground and heaved executive orders and ultimatums at domestic targets and foreign states has been... Articles\nClueless Labour will turn Britain into a Chinese colony. 13th February 2025 The Cabinet’s lack of real world experience has left them vulnerable to Xi’s manipulation. As the Chinese Foreign Secretary Wang Yi arrives in the UK, following... Articles\nThis conflict is the shop window for the West's resolve. If we buckle, other dictators will unleash their war machines 2nd February 2025 A week ago I was in Ukraine, observing a programme of work to help soldiers suffering from post-traumatic stress disorder. One ex-soldier explained to me that... Articles\nUS weakness on Ukraine will only embolden China 19th January 2025 Dictators do not speak the language of appeasement. The West must not repeat mistakes of the past. When Donald Trump takes office, his greatest challenge will... Articles\nWhy Putin and Iran are the two huge losers in Syria - but UK must watch out too 9th December 2024 The speed of the takeover has taken everyone by surprise. Most thought that the Syrian forces, albeit without the scale of support once available to them from... Articles\nIt’s time to finally fix the botched Northern Ireland Brexit situation. Here’s how 5th December 2024 The Irish Sea border is a ball and chain round our ankles in other trade deals around the world. On Friday, Parliament will get a chance to finally resolve the... Articles\nMiddle-class drug users are fuelling the mayhem 1st December 2024 My good friend Noreen Oliver MBE, who died recently, was the founder of the drug charity the BAC O'Connor Centre, helping addicts through rehabilitation to... Articles\nStarmer’s Britain won’t be China’s peer, it’ll be Xi’s puppet 19th November 2024 Britain will regret getting into bed with the most brutal and unreliable of regimes. The Prime Minister’s face-to-face meeting with President Xi Jinping at the... Articles",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_category_European-News/content_28.html": "STATEMENT FROM MEMBERS OF THE INTER–PARLIAMENTARY ALLIANCE ON CHINA (UK) ON VISITING LITHUANIA 24th March 2022 We, members of the Inter-Parliamentary Alliance on China (UK), have had the privilege of meeting with Lithuanian parliamentarians, government officials and... European News",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_category_Westminster-News/content_16.html": "FCA must be investigated over failure to tackle de-banking. 31st July 2023 Letter sent to The Chancellor today from Conservative MPs and former financial industry figures raising our concerns that the Financial Conduct Authority (FCA)... Westminster News\nGovernment's commitment to building a new Whipps Cross Hospital 25th May 2023 I’m extremely pleased the Government has reconfirmed its commitment to building a new Whipps Cross Hospital, part of the £20 billion funding for the New... Westminster News\nIDS speaking to Sky News' Sophy Ridge on The Take 5th October 2022 IDS admitted the party's conference had been \"pretty awful\", but he hoped it would be \"cathartic\" after three years of challenges in government. \"The... Westminster News\nJob vacancy for a Junior Caseworker / Administrative Assistant 12th January 2022 Job Description Job Title: Junior Caseworker / Administrative Assistant Working For: Rt Hon Sir Iain Duncan Smith MP Location: London / Chingford & Woodford... Westminster News\nPolice, Crime, Sentencing and Courts Bill Amendments regarding the issue of Pet Theft. 25th June 2021 I have tabled amendments to the Police, Crime, Sentencing and Courts Bill regarding the issue of Pet Theft. As many of you know this has become a significant... Westminster News\nRECOMMENDATIONS FROM THE TASKFORCE FOR INNOVATION, GROWTH AND REGULATORY REFORM 16th June 2021 Taskforce for Innovation, Growth and Regulatory Reform: boosting jobs and levelling up through better regulation to promote the growth sectors of the future The... Westminster News\nEverything you need to know about Budget 2021 3rd March 2021 Budget delivers on commitment to provide security and stability to the British people through the pandemic – providing over £407 billion of support for families... Westminster News\nHuawei and 5G 4th March 2020 Sir Iain Duncan Smith leads a Westminster Hall debate on the security implications of including Huawei in 5G. The government’s decision to go ahead with Huawei... Westminster News\nBoris Johnson 23rd July 2019 Congratulations to Boris Johnson on winning the race today to become Conservative Party Leader and Prime Minister. I am pleased that this result was so emphatic... Westminster News",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns_save-our-suburbs-chingford-woodford-green/content_19.html": "Say no to over-development in Chingford & Woodford Green. I'm actively campaigning against out-of-scale and out-of-character high-rise blocks in our area. Hundreds of local people have already signed petitions, but we need more signatures to make sure the developers and the council listen to the genuine concerns of local residents.\nWaltham Forest is in the process of preparing a new Local Plan for the borough. When adopted it will set out the Council’s planning policy for the next 15 years.\nIt will shape developments and guide decisions on the location, amount and types of development the borough requires to meet local needs and accommodate good growth. The Council's proposals can be found here: https://walthamforest.gov.uk/content/local-plan\nThese include proposals to build 27,000 new homes in Waltham Forest by 2035, an increase of over 25% on the number of homes currently in the borough, and to add 46,000 square metres of employment space (retail, business and industry). Local Conservatives are running a petition which we will submit as part of the consultation. It can be signed here by completing your details below. It reads:\nThe draft Local Plan for Waltham Forest proposes the building of 27,000 new homes by 2035, which exceeds the target set by the Mayor of London by 3,300. We, the undersigned, call on Waltham Forest Council to re-draft its plan to:\n- Reduce the target for new homes to that set by The Mayor of London\n- Include height limits on development in North Chingford, South Chingford and Highams Park which respect the local, suburban character\n- Provide for adequate parking to be preserved to support existing businesses and provided in new developments of homes and business premises to protect existing residents’ amenity\n- Require that supporting infrastructure be provided in advance of new development being occupied\n- See that affordable homes provided in new developments are offered first to people with a strong local connection\nSome of the plans include high-rise and over-development of our local area, which will increase pressure on already stretched local infrastructure (Schools, Doctors, utilities etc), as well as no parking for new residents, so the wider community will once again bear the brunt of the consequences of over-development.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_parliament/content_5.html": "Tweet Here, you can find Iain Duncan Smith's speeches and appearances in Parliament (provided by theyworkforyou):\nNorth Korea: Cryptocurrencies | Foreign, Commonwealth and Development Office | Written Answers To ask the Secretary of State for Foreign, Commonwealth and Development Affairs, what assessment he has made of the potential implications f\nGambling | Ministry of Justice | Written Answers To ask the Secretary of State for Justice, what steps her Department plans to take to improve training across all levels of the justice syst\nGambling | Ministry of Justice | Written Answers To ask the Secretary of State for Justice, what steps her Department is taking to improve (a) awareness and (b) understanding of (i) gamblin\nDevelopment Aid | Foreign, Commonwealth and Development Office | Written Answers To ask the Secretary of State for Foreign, Commonwealth and Development Affairs, what assessment he has made of the potential impact of redu\nDeveloping Countries: HIV Infection | Foreign, Commonwealth and Development Office | Written Answers To ask the Secretary of State for Foreign, Commonwealth and Development Affairs, what plans he has for the funding of (a) the Global Fund an\nSteel Industry (Special Measures) Bill | Commons debates I will try to be brief and stay focused on the Bill.\nSteel Industry (Special Measures) Bill | Commons debates I am grateful for that, because it allows me to say something that I had not been planning to say: we sit on an island of gas, so why, for\nSteel Industry (Special Measures) Bill | Commons debates I fully understand the nature of what the right hon. Gentleman is bringing forward.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_about-iain-duncan-smith/content_9.html": "Sir Iain Duncan Smith was educated at Dunchurch College of Management, the Royal Military Academy at Sandhurst, the Universita per Stranieri in Perugia and HMS Conway in Anglesey. As part of the Scots Guards, Iain saw active service in Northern Ireland and Rhodesia (now Zimbabwe) and served in Canada and Germany. Iain later worked for GEC-Marconi, a defence company, and Bellwinch, a property company. He has also been on the board of Jane’s Information Group, a publishing company. Iain married Betsy in 1982 and they have four children – Harry, Edward, Rosie and Alicia.\nIain was elected Member of Parliament for Chingford in 1992, and he was re-elected in 1997 as Member of Parliament for the re-drawn constituency of Chingford and Woodford Green. Iain was promoted to William Hague’s Shadow Cabinet in 1997. As Shadow Secretary of State for Social Security, Iain exposed Labour’s hypocrisy and failure on welfare reform. When he was promoted to Shadow Defence Secretary, he exposed the Government’s failure to give British forces sufficient funding and equipment.\nIn 2001, Iain was elected Leader of the Conservative Party. After stepping down in 2003, he set up the Centre for Social Justice (CSJ), an independent think tank committed to tackling poverty and social breakdown. Iain worked tirelessly as Chairman of the CSJ until the 2010 General Election, when he was appointed Secretary of State for Work and Pensions. He served in this position until March 2016. Iain remains the Member of Parliament for Chingford and Woodford Green and is always happy to deal with constituents and their concerns.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_jobs-are-vital-welfare-reform-unemployment-has-been-medicalised-leaving-too-many-without/content_7.html": "It’s hard to get a car moving with the handbrake on. Jobs are vital to welfare reform. Unemployment has been medicalised, leaving too many without aspiration or hope.\nTo govern is to choose and against the backdrop of an increasingly unsafe world, the need to invest significantly more in defence and a flatlining economy, further reform of welfare is a necessity.\nWhen I resigned from Cameron’s government, welfare stood at £61.6bn, yet by the end of this parliament, it is projected to be £108.7bn. Sickness benefit alone which was £19bn in 2016 is set to rise to £32bn. So it is with disability benefits, set to rise from £11bn to some £31bn.\nSome of that rise is because judge-led tribunals in disability appeals led to 60 per cent of appeals getting approved for benefits when DWP had previously rejected their claim.\nCovid and the lockdowns have had an enormous negative impact on the welfare bill but that isn’t the whole issue. Behind these numbers are real people. They are rising because, for example, the number of workless households with children, where all adults are economically inactive, has risen by 141,000 since 2016. These are real families with real lives who no longer have the hope and purpose that comes with getting up and going to work each morning.\nGeneral Practitioners tell me that they struggle to know how to deal with the influx of patients claiming they suffer from anxiety and depression.\nIn 2023, over half of those economically inactive reported depression, bad nerves or anxiety and a quarter of a million 16- to 34-year-olds are economically inactive, up a quarter.\nA vast majority of GPs agree that society’s approach to mental health has led to the normal ups and downs of life being seen as medical problems, too often prescribing when non-pharmaceutical interventions would be more suitable, medicalising things they would prefer not to.\nThe same Centre for Social Justice (CSJ) research found that many of the mental health problems present in our young people find their roots in the breakdown of family life. Family stability is the best predictor of good mental health in children. NHS data shows, among 11- to 16-year-olds whose parents were married, 12 per cent had a mental disorder, compared with 27 per cent of 11- to 16-year-olds who had a lone parent. This is not to criticise those who struggle to bring up children on their own but to highlight the pressure such breakdown causes.\nTackling the generational changes in family structure is a long-term endeavour. We could get ahead of things immediately by putting job centre staff in schools to speak to 12- and 13-year-olds tomorrow. It’s not about career advice; it’s giving them a line of sight to a paying job in their local area. The job centre knows what kind of jobs and apprenticeships are available and explaining what their prospects are with and without qualifications to students who question the need for school in their early teens helps reset their aspirations to earn.\nShort term attempts to freeze or cut benefits for limited savings, without significant reform, as set out in the latest report by the CSJ, “How to Get Britain Working”, will not reduce the growing bill in the longer term.\nYet, with sickness benefit (ESA) coming into Universal Credit, the opportunity for radical change is there. Now for the first time claimants will have a jobs advisor with them helping and urging them with conditionality back into work. We know 700,000 claimants want to return to work and this help will reduce the overall cost of benefits and increase tax receipts to the Treasury.\nWe must then look to longer term reform of the way we do things such as the judge-led tribunal system. But unless we address some of the underlying questions of how we function as a society, we will leave too many without aspiration or hope.\nWhilst work remains the best route out of poverty, the Chancellor’s rise in National Insurance just made that route out of benefits a lot tougher. It’s much harder to get a car moving when you pull the handbrake on at the same time.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_south-chingford-community-library-letter-cllr-grace-williams/content_3.html": "Tweet Wednesday, 28 February, 2024 Local News You may also be interested in JOIN THE CAMPAIGN TO SAVE SOUTH CHINGFORD COMMUNITY LIBRARY The South Chingford Community Library (SCCL) is at risk of closing permanently. I need your help to save it!\nJOIN THE CAMPAIGN TO SAVE SOUTH CHINGFORD COMMUNITY LIBRARY The South Chingford Community Library (SCCL) is at risk of closing permanently. I need your help to save it!\nJobs are vital to welfare reform. Unemployment has been medicalised, leaving too many without aspiration or hope. Sunday, 16 March, 2025 It’s hard to get a car moving with the handbrake on. Jobs are vital to welfare reform. Unemployment has been medicalised, leaving too many without aspiration or hope.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_governments-commitment-building-new-whipps-cross-hospital/content_26.html": "I’m extremely pleased the Government has reconfirmed its commitment to building a new Whipps Cross Hospital, part of the £20 billion funding for the New Hospital Programme. This funding will deliver a brand-new hospital that’s fit for the future for my constituents across Chingford and Woodford Green, and following a short delay, work for a new multi-storey car park is expected to begin in Autumn.\nFor more than 30 years I have worked hard to get a new hospital and campaigned to ensure Whipps Cross stayed open when the previous Labour Government threatened to close it.\nWorking closely with the Secretary of State for Health and Social Care, Steve Barclay, and the local Barts Health NHS Trust team, we are on the verge of delivering my plan for better healthcare across Chingford & Woodford Green.\nThe local NHS’s preferred way forward is to build a new district general hospital at Whipps Cross, in a single-phase build. This will provide a range of patient services including emergency and maternity, on a cleared site that was formerly the nurses’ accommodation.\nI understand my constituents concerns about the Margaret Centre and I have been clear with the redevelopment team that the new hospital must provide the same end-of-life palliative care service that is currently provided by the Margaret Centre.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns_whipps-cross-hospital-redevelopment/content_24.html": "Whipps Cross University Hospital is to receive at least £350 million for massive redevelopment upgrade.\nAfter years of us making the case for a massive upgrade, I’m absolutely delighted Whipps Cross Hospital is one of six hospitals to receive at least £350 million for the Whipps Cross massive upgrade and redevelopment, securing a vibrant health, care and wellbeing campus at the heart of our community. This is very good news for both staff and patients.\nBoris Johnson and Matt Hancock have unveiled a hospital building plan beginning with a £2.7 billion cash injection for six hospitals over the next five years.\nThis funding forms part of a bigger £13 billion Conservatives long-term commitment to the health service and represents \"the largest sum that has ever been invested in the nhs.uk”,\nThe funding is the culmination of hard work campaigning over the past 27 years as your MP and working with local councillors and local residents and shows just what you can achieve working together as a community and is a fantastic vote of confidence in Whipps Cross, which will massively benefit staff and patients – who need a new hospital.\nParts of the existing Whipps Cross site date back over 100 years and the redevelopment project has been a local focus for decades, under both Conservative and Labour governments. During the 2000s the Labour government tried on more one occasion to close Whipps Cross Hospital and so the announcement is a triumph for those who have persevered in their support for this significant part of the local community.\nOver the past 12 months in particular, I have been raising the Whipps Cross Hospital case for redevelopment with both the Prime Minister and Health Secretary, inviting both Matt Hancock and Boris Johnson to visit Whipps Cross to see the hospital facilities for themselves, ensuring that it remains at the top of the agenda. Following Boris Johnson's visit to Whipps Cross I wrote to him asking for the funds to be pledged.\nMy gratitude goes the senior management, doctors, nurses and all the staff, for whom this achievement is a real vote of thanks and will in due course help them in their work. I will continue to offer my support at every stage of the redevelopment.\n**** £350 million is the amount identified by Whipps Cross Hospital Strategic Plan for redevelopment",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_contact/content_4.html": "Skip to main content\nMain navigation\nHome\nAbout Iain Duncan Smith\nCampaigns\nNews\nIn Parliament\nContact\nContact\nLeave this field blank\nWestminster Office\nHouse of Commons, London SW1A 0AA\n020 7219 2667\n[email protected]\nOn Facebook\nOn Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_us-weakness-ukraine-will-only-embolden-china/content_25.html": "Dictators do not speak the language of appeasement. The West must not repeat mistakes of the past.\nWhen Donald Trump takes office, his greatest challenge will be how he deals with the new axis of totalitarian states. This axis comprises China, North Korea, Russia, Iran, Myanmar and a growing number of others. With China at its heart, it poses the greatest threat the Free World has faced since the Cold War.\nChina is a dictatorship, committing genocide in Xinjiang to eradicate the Uyghurs, it uses forced labour, persecutes religious groups and democracy campaigners. China is now building up its military and navy at an astonishing rate, to challenge the US. It has asserted ownership of disputed strategic territories in the South China Sea. Perhaps most critical is its threat to invade Taiwan.\nThe interesting thing about brutal dictators is that they tell you in advance what their ambitions are, as in the 1930s. Leaders in the West failed to believe Hitler and tens of millions died. Vladimir Putin couldn’t be clearer about his plans for greater Russia including Ukraine (as his seizure of Crimea demonstrated). Xi Jinping has made no secret of his plans to turn China into the dominant global superpower militarily and economically. He believes democracy and human rights are an aberration and that his form of autocracy is the historical norm.\nHaving betrayed the Sino-British treaty on Hong Kong and grabbed the South China Seas, with the West barely making a whimper, now he plans to annex Taiwan too.\nYet China does not work alone.\nChina is still a very close partner of Putin’s Russia. Both observed the chaotic withdrawal of western troops from Afghanistan and will have reached the same conclusion that the West lacks the leadership and perseverance to stay the course. It was that debacle that emboldened Putin to invade Ukraine. The resulting brutal war dominated by Russian barbed wire, mines and drones has led to hundreds of thousands of dead and wounded. Even now, Ukrainian men and women fight for every inch of their precious land, paying with their lives.\nThe harsh reality is that most European countries ignored the signals and had hollowed out their defence capability, spending instead on what they saw as domestic priorities. Whilst the UK led the way early in supporting Ukraine, too many Western European countries were slow to act, dependent for their energy on Russia.\nIn December 2023 I went to Washington with a small group of Conservative MPs to discuss the proposed funding for Ukraine, which at that time hung in the balance in Congress. This was not long after the October 7 massacre. Understandably, those Congressmen and women we met said their priority was to ensure the IDF defeated this terrorist group. Their two priorities were Israel and Taiwan. My response was that these three issues cannot be separated. The attack on Israel helped both Russia and China, by taking America’s attention off Ukraine and Taiwan.\nThe resultant delay in approving vital military supplies cost Ukraine dear in lost territory. This axis will have suspected that Israel’s needs would outweigh Kyiv’s in the US, giving Russia time and isolating Ukraine at a critical moment.\nTrump’s plans to achieve some kind of peace accord between Putin and President Zelensky are on the face of it laudable. However, as Ronald Reagan and Margaret Thatcher knew, the lesson of the Second World War was that peace without justice never lasts. Remember how Hitler was given the Sudetenland by France and Britain in an attempt to appease him - a year later Hitler invaded the rest of the country.\nI have been to Ukraine on a number of occasions and seen first-hand the astonishing bravery of the Ukrainian people. Their fight should be seen as our fight in the West. Ukraine deserves more than a short-term settlement, in which Putin is rewarded for his brutality.\nI hope President Trump recognises that Ukraine’s predicament has come about because of weak leadership in the west and its appeasement of Russia and China. If Ukraine is forced to accept Russia’s hold over 20 per cent of their country, as part of a settlement, then in echoes of 1938 Putin will be back for the rest.\nAnd with China looking on, our weakness will mean Taiwan is next. I pray we do not repeat the mistakes of the past.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_what-can-mps-do/content_17.html": "Members of Parliament are elected to the House of Commons to represent the interests and concerns of all the people who live in their constituency, whether they voted for them at the General Election or not. They are only able to deal with issues raised by people who live in their constituency, called constituents.\nTo check if you are one of my constituents, please enter your postcode on the Parliament website .\nMembers of Parliament consider and vote on legislation and use their position to ask government ministers questions about current issues.\nMembers of Parliament split their time between working in Parliament and working in the constituency. In Parliament, I spend my time working for the interests of all my constituents, attending debates, scrutinise and vote on legislation, and attending meetings. I hold advice surgeries for my constituents (where a constituent can come and talk to me about any local issues and problems), attend meetings, visit schools and community events, as well as visiting local organisations and businesses across the constituency.\nWhen a constituent writes to me, I will write to the relevant department or official or the Minister involved. Many problems are solved in this way and I always aim to respond within 7 working days, although sometimes more complex cases may take slightly longer.\nAlternatively, if a constituent is happy for the issue to be made public, I can ask an oral or written question, secure a debate or even petition Parliament itself.\nOral or Written Questions\nOnce a month each minister from each government department answer questions from MPs at the Despatch Box in the Chamber of the House of Commons. There is a limit to the number of questions that can be asked but I can also table a written question to the relevant government department, which are published in Hansard .\nAdjournment Debates\nMPs may be able to raise a constituent’s issue in a half-hour Adjournment Debate. To get an Adjournment Debate, MPs must be successful in a ballot of other Members of Parliament or have the subject chosen by the Speaker. The debates are usually the last business of the day and a government minister responds at the end of the debate.\nPetition\nMembers of Parliament can present a petition to Parliament on behalf of their constituents. The format and wording of the petition need to be in a particular way. For more information or guidance, please contact:\nClerk of Public Petitions\nJournal Office\nHouse of Commons\nLondon SW1A 0AA\nhttp://www.parliament.uk/get-involved/have-your-say/petitioning/public-petitions\nWhat I cannot do, however, is have any jurisdiction over local Council decisions. I can write to on your behalf to the council and ask them to look into a problem or to reconsider an issue. In the first instance though, constituents should contact their local council or councillor directly.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns/content_13.html": "Re-open Broadmead Road Bridge On the 13th of July, Redbridge Council decided to close parts of Broadmead Road, specifically the bridge, between Charteris Road and St Barnabas Road, after the...\nJOIN THE CAMPAIGN TO SAVE SOUTH CHINGFORD COMMUNITY LIBRARY The South Chingford Community Library (SCCL) is at risk of closing permanently. I need your help to save it! In 2011, Waltham Forest Council closed the Council...\nHELP ME BRING BACK THE 505 BUS TO WALTHAM ABBEY We can bring back the 505-bus route to Waltham Abbey. But I need your help to do it. The 505 bus, running between Chingford and Harlow, is no longer in service...\nSave Our Suburbs in Chingford & Woodford Green Say no to over-development in Chingford & Woodford Green. I'm actively campaigning against out-of-scale and out-of-character high-rise blocks in our area...\nOpposing the Greater London Boundary Charge & ULEZ fee The Mayor of London, Sadiq Kahn, is trying to pass the cost of his financial mismanagement to drivers by charging up to £33 a day to drive from outside of...\nSave the South Woodford Crown Post Office The Crown South Woodford Post Office, which has survived previous attempts of closure, is set to close in the spring. The loss of this Post Office will be a...\nMake Pet Theft A Specific Criminal Offence 2020 has been the worst ever year for dog thefts – tougher sentences are needed for pet theft. Although this may not make national news, for many, many families...\nPause & Rethink the Edmonton Incinerator Rebuild I am concerned about the plans to expand the incinerator at Edmonton EcoPark. In July 2020, I presented a deputation to the NLWA (North London Waste Authority)...\nWhipps Cross Hospital Redevelopment Whipps Cross University Hospital is to receive at least £350 million for massive redevelopment upgrade. After years of us making the case for a massive upgrade...",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_news_if-ukraine-goes-down-taiwan-will-be-next/content_14.html": "By appearing weak and divided, the West is sending a worrying message to its adversaries.\nMegaphone “diplomacy”, that feature of the Cold War, has re-surfaced in the spat between Trump and Zelensky. Its winners in this can only be the authoritarian states, particularly Putin and Xi.\nI have recently returned from Ukraine and witnessed first hand the devastation. Anyone who has seen what I have will recognise the sheer brutality of the Russian invasion and understand that no one but Putin is responsible for this war. Hospitals have been targeted, as well as schools and blocks of flats. Perhaps the worst sight was Ohmatdyt, a Children’s hospital, hit by a Russian ballistic missile and to a large extent destroyed.\nWhilst I deplore President Trump’s simplistic and mistaken assumption that the absence of war is the same as peace, we shouldn’t doubt his determination to bring the Ukraine war to an end. He sees it as a sideshow and he wants to focus on China and Taiwan.\nThe attacks on Europe by his team show how little regard they have for a continent they believe has been hollowed out from within. JD Vance’s summary that Europe’s surrender to wokeism and welfare dependency, and their failure to invest in defence, contains a great deal of truth. European nations only have themselves to blame: they have ridden on the coattails of the US for too long is an irrefutable fact.\nHowever, this isn’t the most salient issue. The real concern is the risk that incorrect assumptions about the importance of defending Ukraine have been lost in this trans-Atlantic war of words.\nTrump’s belief that meeting Putin’s demand for territory and no Ukraine membership of Nato will satisfy him misunderstands the old KGB operative’s real motivation and ambition. Putin is not interested in territory but sovereignty. His desire is to recreate the Soviet Union’s sovereign territory for a greater Russia.\nUkraine’s tenacity and belief in their sovereign right to exist, aided by the incompetent Russian military, has stood in Putin’s way. And his economy could not sustain much more of this conflict: it has seen defence spending rise to levels not seen since the Cold War.\nAny belief among the new US administration that Ukraine is a side show is strategically wrong. What happens in Ukraine has a huge bearing on Taiwan. President Xi Jinping watched as the West abandoned Afghanistan in a chaotic retreat and he watches now as the US plans to abandon Ukraine.\nThat’s why President Xi has aided Moscow throughout the war, helping broker the rapprochement between North Korea and Russia, whilst buying Russian oil and gas.\nBefore the US election, I asked a senior member of Trump’s team during his first Presidency what his strategy would be over China and Russia. He replied that Trump did not do strategy, he did people. He explained that Trump likes to do deals with people he considers his equals: powerful men who can demonstrate power. This is partly because it reflects well on him and also because such people Trump believes can make fast decisions. That’s perhaps why he has some regard for Putin and Xi.\nIf Putin is seen to have succeeded, a new world order shaped by totalitarian states will grow. Democracy and the concept of freedom, much vaunted by JD Vance, will shrink whilst totalitarian states will grow in potency. A return to the concept of spheres of influence will ensure the free world will be the loser. Already the influence of China is growing as democracy is in gradual decline.\nWhen Keir Starmer goes to Washington this week, he must calmly set out that Ukraine is part of this strategic threat to us all. That if Ukraine goes down, Taiwan is next. He should remind President Trump of that last great US president Ronald Reagan’s leadership. Reagan together stood firm with Mrs Thatcher and encouraged Europe to show the resolve and unity in defence spending that eventually broke the USSR.\nThe UK has a critical role to play, to calm the angry voices and explain that as the US’s strongest ally we will lead the way in strengthening our defence capability. Most of all, Starmer must show that this is our generation’s challenge, and that the road to Taiwan runs through Ukraine.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_campaigns_help-me-bring-back-505-bus-waltham-abbey/content_20.html": "We can bring back the 505-bus route to Waltham Abbey. But I need your\nhelp to do it.\nThe 505 bus, running between Chingford and Harlow, is no longer in service. Now, not a single bus\noperates between Waltham Abbey and Chingford – this is simply unacceptable, especially when so many\nstudents, disabled persons, elderly residents, healthcare workers, and other regular commuters have relied\non this route.\nThe extension of ULEZ to the Waltham Forest boundary by Sadiq Khan has deprived many residents of the\nuse of their own cars and he has failed to deliver sufficient investment into our local bus services. How else\nare we going to encourage more people to take up sustainable forms of transport, if they are not made\nfrequent and reliable?\nI am calling on Transport for London to restore a regular, daily London Bus link between Waltham Abbey\nand neighbouring Chingford by extending route 215 (which currently terminates at the Lea Valley Camp\nSite on Sewardstone Road – just within the Waltham Abbey boundary), and route 379 (which also\nterminates on Sewardstone Road) to at least Waltham Abbey Town Centre.\nJoin me, and 1000’s of other local residents in our campaign to get better transport connections for you\nand your family.\nOver the last few years, we have worked tirelessly to deliver on your priorities - this includes building a\nWhipps Cross that is fit for the future, delivering a new Station Road Conservation area, opening a Barclay’s\nbanking hub on Station Road and securing funding to rebuild Highams Park School and upgrade Chingford\nFoundation School.\nTo make our case even stronger, please share your views on my campaign to bring back the 505 bus route\nby filling out the attached survey. You can send it back using the freepost envelope provided or complete\nit online at https://action.conservatives.com/505bus and together, we can improve transport links to\nWaltham Abbey.",
  "https_www_iainduncansmith_org_uk_/https_www_iainduncansmith_org_uk_accessibility/content_10.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}