{
  "https_richardrout_com_/https_richardrout_com_campaigns_norwich-to-tilbury-pylons/content_5.html": "I’ve been at the forefront of the campaign to find alternatives to the Norwich to Tilbury Pylon proposals and explore an ‘off-shore grid’ since 2021. Since 2018, I’ve held the responsibility for responding to Nationally Significant Infrastructure Projects in Suffolk. I know how to apply pressure to the likes of National Grid and how to change schemes like these new pylons. At my instigation, through my role at Suffolk County Council, we have recently seen two key reviews. The first of these is the Hiorns Review, commissioned jointly with Essex and Norfolk County Councils, which clearly sets out that the energy projects on which the need for Norwich to Tilbury is predicated will not be delivered on schedule. Therefore, Norwich to Tilbury is unlikely to be required until 2035, rather than 2030. This gives us time to look properly at the High Voltage Direct Current (HVDC) alternatives set out in the recent National Grid ESO review. This presents both on-shore and off-shore HVDC alternatives which, when looked at in tandem with the Hiorns Review, could be delivered in time and replace the pylons proposals.\nIn addition, with Norfolk County Council, I have ensured a proper landscape study was conducted into the special qualities of the Waveney Valley. Pressure like this has now seen proposals from National Grid to ‘underground’ through the Waveney Valley. This is a small victory and you can read more of my comments and about the special qualities of the Waveney Valley here. However, we must go further. We must pause the proposals for the Norwich to Tilbury Pylons and properly explore the HVDC alternatives. My experience dealing with this sort of scheme is second to none and I will not give up the fight to deliver a better solution for Norfolk, Suffolk and our nation.",
  "https_richardrout_com_/https_richardrout_com_campaigns_local-banking-hubs/content_9.html": "Local people, and businesses, across Waveney Valley need access to cash banking facilities. In all of our market towns it is getting harder to get access to cash and business banking. This is why I’ve launched a campaign for local banking hubs. These pull all of the major banks together under a single roof to provide that valuable access. This is a massive step up from mobile banking or pop-up facilities.\nTo make sure this campaign becomes a reality, I’ll be working with local councillors, local councils and banking providers. To stay updated on the campaign, sign up here.",
  "https_richardrout_com_/https_richardrout_com_campaigns_norfolk-suffolk-school-funding/content_2.html": "We need to drive up educational standards in Waveney Valley and look at educational funding formulas that ensure access to quality education across county boundaries.\nIn 2023, the number of pupils in Norfolk and Suffolk achieving Grade 5 and above at GCSE in English Language, English Literature, and Mathematics lagged regional and national averages. As an example, in English Language GCSEs, 43.4% of pupils in Norfolk achieved Grade 5 or above, compared with 44.1% in Bedfordshire, 46.9% in Suffolk, 48.2% in Essex, 50.2% in Cambridgeshire and 58.8% in Hertfordshire. The national average for England stood at 48%. To begin to address this, we need to revisit outdated funding formulas, based on historic deprivation indices, that disadvantage our area.\nAs an example of funding disparity, if Suffolk received the same level of High Needs Block (HNB) funding per pupil as Norfolk, there would be an extra £9.4million per annum going into education in the county. This leads to the bizarre situation where education in Ditchingham is better funded than it is a mile away, across the River Waveney, in Bungay! Moreover, Norfolk itself isn’t favorably funded.\nWe must step up the campaign at Westminster to see funding formulas reformed so that we can secure a better deal for our children.\nSince academisation, the direct levers that can be pulled locally have been reduced but local schools need to be held to account and investment made in new schools and campaigns to raise attainment levels. Having met with local teachers, many of whom have taught elsewhere previously, I have been struck by how many feel our young people in rural communities need help raising their level of aspiration and that we require more skilled job opportunities in the county. We need to work hard to increase this sense of aspiration, ensure job opportunities exist in the county and, where investment comes – like in the energy sector – ensure it has legacy benefit. In addition, we need to look closely at the pockets of deprivation in the county and work with low-income families to improve literacy skills before children reach school age. Disadvantaged students start school around 8 months behind their peers and by GCSE have fallen behind by around 18 months. To address this, early intervention is key.",
  "https_richardrout_com_/https_richardrout_com_campaigns_transport-infrastructure/content_6.html": "Investing in our transport infrastructure grows the local economy.\nThe delayed upgrades to Ely rail junction has ramifications for Norfolk and Suffolk. This £500m scheme is essential to unlock our rail network, improve East West travel, reduce commuting times and encourage investment – generating an estimated £2.2bn for the local economy. Furthermore, alongside upgrades to Haughley junction, these improvements could remove 98,000 HGV and 376,000 car journeys from our roads every year. We need to keep up the pressure for this important scheme and continue to make the case for investment.\nThese improvements would drive investment, reduce commuting times, improve safety, reduce pollution and enhance lives across our area.",
  "https_richardrout_com_/https_richardrout_com_campaigns_supporting-market-towns-rural-services/content_4.html": "Here in Waveney Valley, our market towns of Diss, Eye, Harleston, Bungay and Halesworth are at the heart of our community and their high streets a vital lifeline for so many. Similarly, many of our larger villages are home to key services. As someone with a small business, I know just how hard owners have fought to bounce back after the pandemic and to deal with high inflation, compounded by the invasion of Ukraine. We need to keep our high streets vibrant and active and ensure vital services remain available. Elsewhere on this site I talk about the need for Business Rate reform but there is more we can do. An innovative approach to ensuring banking services remain available is essential. Mobile banking is not the answer we need, instead we need to look to small hubs near high streets that can house banking services.\nTo sustain these services and local businesses, we need more people living and working in our town centres. I’ve met with architects who are frustrated by how difficult it is to bring vacant space above and around our high streets back into use. We urgently need national planning reform to enable this and to ensure that when town centre development does occur, adequate parking is provided. Alongside banking, we need to ensure proper healthcare provision – access to GPs, dentists and outreach services. For example, it is challenging for many residents to be asked to travel miles from their surgery for a simple blood test. Equally, we are all aware of just how difficult it is to access an NHS dentist. We need firm voices at Westminster advocating for further changes to NHS contracts, ensuring we’re training enough UK dentists and pushing through reforms to allow greater flexibility around international registration.",
  "https_richardrout_com_/https_richardrout_com_my-leaflets/content_15.html": "Countryside Advocate and County Councillor\nIf you live in Waveney Valley, you should have had these leaflets through your door but if we missed you or it found its way to the recycling bin too quickly, here are some copies!\nJust click on the images below to view the detail:",
  "https_richardrout_com_/https_richardrout_com___media/content_10.html": "Countryside Advocate and County Councillor\nIt seems we can’t find what you’re looking for. Perhaps searching can help.",
  "https_richardrout_com_/https_richardrout_com___campaigns/content_8.html": "Skip to content\nRichard Rout\nCountryside Advocate and County Councillor\nHome\nAbout Me\nCampaigns\nNorwich to Tilbury Pylons\nLocal Banking Hubs On Our High Streets\nEnergy Security\nTransport Infrastructure\nFood and Water Security\nLower Taxes and Supporting Business\nEducational Funding & Attainment\nBetter Insulated Homes\nSupporting Market Towns & Rural Services\nMedia\nMy Newsletter\nLeaflets\nHome\nAbout Me\nCampaigns\nNorwich to Tilbury Pylons\nLocal Banking Hubs On Our High Streets\nEnergy Security\nTransport Infrastructure\nFood and Water Security\nLower Taxes and Supporting Business\nEducational Funding & Attainment\nBetter Insulated Homes\nSupporting Market Towns & Rural Services\nMedia\nMy Newsletter\nLeaflets\nFacebook\nTwitter\nInstagram\nMy Campaigns\nNorwich to Tilbury Pylons\nMy campaigns\nLocal Banking Hubs On Our High Streets\nMy campaigns\nEnergy Security\nMy campaigns\nTransport Infrastructure\nMy campaigns\nFood and Water Security\nMy campaigns\nLower Taxes and Supporting Business\nMy campaigns\nEducational Funding & Attainment\nMy campaigns\nBetter Insulated Homes\nMy campaigns\nSupporting Market Towns & Rural Services\nMy campaigns",
  "https_richardrout_com_/https_richardrout_com_my-campaigns/content_3.html": "Skip to content\nRichard Rout\nCountryside Advocate and County Councillor\nHome\nAbout Me\nCampaigns\nNorwich to Tilbury Pylons\nLocal Banking Hubs On Our High Streets\nEnergy Security\nTransport Infrastructure\nFood and Water Security\nLower Taxes and Supporting Business\nEducational Funding & Attainment\nBetter Insulated Homes\nSupporting Market Towns & Rural Services\nMedia\nMy Newsletter\nLeaflets\nHome\nAbout Me\nCampaigns\nNorwich to Tilbury Pylons\nLocal Banking Hubs On Our High Streets\nEnergy Security\nTransport Infrastructure\nFood and Water Security\nLower Taxes and Supporting Business\nEducational Funding & Attainment\nBetter Insulated Homes\nSupporting Market Towns & Rural Services\nMedia\nMy Newsletter\nLeaflets\nFacebook\nTwitter\nInstagram\nMy Campaigns\nNorwich to Tilbury Pylons\nMy campaigns\nLocal Banking Hubs On Our High Streets\nMy campaigns\nEnergy Security\nMy campaigns\nTransport Infrastructure\nMy campaigns\nFood and Water Security\nMy campaigns\nLower Taxes and Supporting Business\nMy campaigns\nEducational Funding & Attainment\nMy campaigns\nBetter Insulated Homes\nMy campaigns\nSupporting Market Towns & Rural Services\nMy campaigns",
  "https_richardrout_com_/https_richardrout_com_campaigns_lower-taxes-and-supporting-business/content_14.html": "The tax burden in the United Kingdom is on course to hit a post-war high of 37.7% of GDP. The Covid-19 Pandemic and Putin’s invasion of Ukraine have both contributed to public sector debt approaching its highest level since 1962. This money must be repaid but in order to grow the economy we need a programme of responsible and affordable tax cuts. Lower taxes will grow the private sector and ultimately increase total tax yields. A few key areas need our immediate focus; the personal tax-free allowance, fuel duty, inheritance tax – principally the family inheritance limit, IR35 and business rates reform to enable us to level up our market town centres.\nIn 2015, the personal tax-free allowance was £10,600. Adjusted for inflation that would be £13,660 in 2023 but, instead, we have the tax-free allowance currently proposed to be frozen until 2026 at £12,570. As soon as practical, we need to raise the personal tax-free allowance to £13,660 and continue to increase it in line with inflation. This will have the biggest positive impact for those on low incomes. Fuel duty continues to be a regressive form of taxation that penalises motorists and hauliers, a cut would ease inflation, reduce pressure on households struggling with the cost of living and galvanise our haulage industry.\nInheritance tax is a further tax on assets which have already been taxed. Often referred to as a ‘death tax’ it can be planned for and avoided by the most wealthy. However, much of the UK’s middle class, who cannot afford such planning, is now being sucked into paying. As a proportion of national income, inheritance tax is a tiny fraction – representing 0.3% of all government income. Inheritance tax thresholds should be immediately increased to reflect increased property prices and inflation and its long-term abolition seriously considered.\nTax cuts can only be paid for if we grow the economy. The repeal of IR35 would remove significant tax liability risk from businesses engaging with contractors. UK business needs to be able to employ talent on a flexible basis and without unnecessary complexity. We need to immediately consult with businesses and tax professionals to devise a system that is fair for off-payroll works, fair to business and isn’t vulnerable to avoidance. Business rate reform, allowing more flexibility locally, would allow us to rejuvenate high streets and town centres. But we need to recognise that businesses are not just in towns or along main roads – behind so many hedges on so many rural roads are thriving and innovative businesses who need our support. We need to ensure they’ve the access to grid connections, fibre networks, 5G, water supply and – importantly – well managed highways.",
  "https_richardrout_com_/https_richardrout_com/content_1.html": "Your Local Campaigner\nIt was an honour to have been selected as the Conservative Candidate for Waveney Valley for the General Election, and while we were unsuccessful in our campaign, I will not stop fighting for the people who call this area home.\nAs a Conservative, I want to protect and enhance what makes our country great – be it our countryside, farming community, heritage or culture. I want to protect free markets and harness and enhance our ability to innovate. I fundamentally believe in personal freedom and the ability of the individual, and society collectively, to improve lives and prosper when not overly burdened by regulation or taxation.\nBy freeing the individual and helping them to improve their lives through their own efforts, we can focus our support on those vulnerable members of society who most need it. All whilst allowing individuals to choose how they live their lives with minimal interference from the state.\nCampaigning\nI am always busy campaigning for local issues here in our part of Norfolk & Suffolk:",
  "https_richardrout_com_/https_richardrout_com_campaigns_food-and-water-security/content_12.html": "I grew up in a farming family and my grandfather would agree, were he still with us, when I say supermarkets should never be without food that can be produced by farmers here in the UK. But agriculture in our country needs greater support. First caused by the covid pandemic, then by the war in Ukraine, the cost of energy, animal feed, fertilisers and equipment have been driven to an historic high.\nThe East of England grows more than a quarter of England’s wheat and barley, nearly a third of all potatoes and well over half of the country’s sugar beet crop. We must support this vital sector.\nAs a region, East Anglia is classified as ‘seriously water stressed’ and unless urgent action is taken the region will face severe water shortages. The risk this poses to agriculture is more acute here than elsewhere – across the UK, on average, the agricultural sector uses 1% of water supplies but in East Anglia that sits at 16%. Already, in parts of Waveney Valley, there is a moratorium on new commercial water connections – meaning new businesses either cannot open or operate due to water shortages or must establish private water supplies. This will become more commonplace across the country unless we ensure the correct infrastructure is in place to support farming.\nThe agricultural and food and drink sectors deserve guarantees over this water supply and we must, at pace, bring forward plans for new pipelines, reservoirs and water recycling facilities. Alongside this, the sector must be incentivised to continue to innovate around water use and rewarded where it does.\nBritish farmers and food producers are the finest in the world and the sector must be prioritised in all future trade deals, the establishment of the Trade and Agriculture Commission, the Food and Drink Export Council and placement at overseas embassies of agricultural attachés is a start but we must go further. We also need to further recognise the challenge of labour shortages and continually monitor and review the number of visas available through the Seasonal Agricultural Worker Scheme. In the first half of 2022 alone, £60m in fruit and vegetables were wasted due to workforce shortages. We must, of course, also encourage a homegrown workforce. There are too many people out of work in the UK who could be working but the agricultural sector must not be left in limbo and government must act with speed and flexibility to adjust the number of visas available each year while we re-establish a domestic workforce. Faced with the twin threats of a changing climate and energy and water scarcity, now is the time to double down on our support for farming.",
  "https_richardrout_com_/https_richardrout_com_campaigns_energy-security/content_7.html": "Across the western world we have become overly reliant on imported energy, all too often from regimes – like Russia – who pose an existential threat to peace and democracy here and abroad. The weaponisation of energy by the likes of Putin only has one answer – energy independence for the United Kingdom.\nI’ve led on negotiations with EDF over the £20bn+ Sizewell C plans and on our push back against vast new pylon runs. The scale of the challenge ahead of us and local communities is vast. To meet Government targets, we must go from 14GW of offshore wind to 50GW in the next seven years and – in terms of total national generation – from 108GW to 300GW by 2050. All this energy not only needs to be generated but it needs to be transmitted, often through rural and sensitive landscapes. In this context, the UK needs to build as many new grid connections in the next 7 years as it has in the last 30. The net result is that we sit on the precipice of a level of construction of infrastructure not seen in this country for generations.\nWe all want to see lower energy bills and we all want to cut off the purse strings to despotic regimes – home grown energy is the way to do this but in our haste to get there we must protect communities, businesses, agriculture and unique landscapes. My recent article on Conservative Home sets out more on this.\nI have 5 years of experience dealing with large energy projects and have spoken on the national stage on energy issues. I led on the response to Sizewell C, a myriad of off-shore wind farms, our calls for an off-shore alternative to the vast new Norwich to Tilbury pylon run (formerly known as East Anglia Green) and our opposition to the huge new Sunnica Solar Farm on the Suffolk/Cambridgeshire border. The scale of these projects is not unique to East Anglia, with coastal communities across Great Britain impacted. I’v experience not only minimising the impacts of these schemes but also maximising local benefits and investment.\nSo what do I want to see going forward?\nWe need to push forward with Great British Nuclear, seizing the opportunities of Small Modular Reactors. We must prioritise brownfield sites and protect agricultural land from vast solar schemes like the proposed Sunnica scheme in East Cambridgeshire and West Suffolk, which would span over 2,000 acres. There is a role for solar on rooftops and along infrastructure corridors but not on prime agricultural land which is vital for food production.\nWe need a fair deal for communities; if there is no alternative to a scheme proceeding, those living near large energy projects should receive a discount on their energy bills, and those in energy poverty should benefit from new connections and property improvements. Importantly, parish councils need to be properly funded to respond to these schemes and not be dominated by developers.\nWe must compel developers to work together, not deliver schemes in a piecemeal way, and transmit as much energy as possible offshore rather than across our landscape. In this respect, I have led the charge for an offshore transmission grid which would render projects like the Norwich to Tilbury Pylons unnecessary.\nFinally, we need to embrace hydrogen and the opportunities this brings to freight, industry and shipping.",
  "https_richardrout_com_/https_richardrout_com_campaigns_better-insulated-homes/content_11.html": "In the UK 8.4million households are in fuel poverty. In rural areas and many of our market and coastal towns, a combination of older housing stock and fuel poverty makes retro-fitting and better insulation of homes imperative, particularly in the face of longer, drier summers and colder winters. As examples of recent investment, Norfolk was awarded £3.9m and Suffolk £8.2m in Home Upgrade Grant (HUG) phase 2 funding from the government and this investment will make valuable inroads into improving the situation.\nSuch is the scale of the challenge that we must go further to reduce household bills, improve health outcomes and address rural fuel poverty. A clear avenue to supercharge this work is through the region’s contribution to energy generation, where communities impacted by new generation and transmission projects could benefit from community benefit packages funded by developers.",
  "https_richardrout_com_/https_richardrout_com_background-experience/content_13.html": "My Background\nI grew up in Suffolk where my father was a Consultant and my mother an Occupational Therapist at West Suffolk Hospital. My father, of whom I have no memory, died of cancer when I was little over a year old. His legacy in the community inspired me to public service. I watched my mother work hard to support us and struggled personally and academically after she remarried but fortunately found a mentor in a local businessman who encouraged me to strive for success. These challenging early years shaped much of my outlook today.\nMy grandparents were farmers and we’ve still a very small farm remaining. As a result, I’ve always been acutely aware of how our agricultural community, landscapes, countryside and wildlife all define, shape and sustain our nation. I’ve seen at first-hand how ill-conceived development, planning and energy policies can threaten these defining characteristics. Here in Waveney Valley, the importance of these issues could not be more acute. With a grandparent from Norfolk and Suffolk, I’m no stranger to the friendly rivalry between our two counties!\nFamily values are incredibly important to me. I live in Suffolk with my wife, Caroline, whose family home is in Mellis near Diss, and our five dogs.\nMy Experience\nI’ve experience across the private and public sector. My early career was spent advising Members of Parliament, parliamentary candidates and think tanks. This enabled me to learn, very quickly, how to get things done in Westminster. My work also focused on media relations and ensuring local communities benefitted from the best possible representation. Taking a break from the political sphere, I opened a gym which brought CrossFit to the community at an affordable price. During the same period, we diversified our small family farm through the creation of a wedding and events venue – now an award winning rural business. In 2017, I was elected to Suffolk County Council, where I serve as Deputy Leader.\nI have become the most experienced politician in the UK at responding to Nationally Significant Infrastructure Projects (NSIPs) in the energy sector. I have devised our strategy and response to numerous large energy projects and led negotiations with government and developers. I’ve led on our opposition to the East Anglia Green pylon run (now known as Norwich to Tilbury) and our calls for an offshore alternative, our negotiations with EDF around the delivery of Sizewell C, securing a compensation and mitigation package in excess of £200m for the region, alongside fighting proposals for the Sunnica Solar Farm. I have spoken on the national stage, and written for Conservative Home, about the importance of delivering energy security and how it must not come at the cost of good food producing land. This work requires me to meet regularly with government departments, ministers and officials to fight for the best deal for local communities.\nI am an experienced and highly visible local campaigner and have served at all council levels from parish through to county. I know how to get things done and ensure local people have confidence in their elected representative."
}