{
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_11_22_there-is-no-such-thing-as-a-christian-country/content_49.html": "There is no such thing as a 'Christian Country'.\n- Andy Fitchet\n- Nov 22, 2015\n- 3 min read\nThere is no such thing as a Christian Country.\n‘We are a Christian Country…’, ‘Last time I checked we were a Christian Country…’, ‘That should not be happening, we are a Christian Country…’.\nThese are statements I hear often, nearly always from the right-wing press or people with right-wing political leanings. For me the issue is that I do not believe you can have a ‘Christian Country’, for precisely the same reason we don’t have one church. The truth of the matter is that we simply do not agree with one another. Now of course I believe in the ‘Holy universal (catholic) and apostolic church’ – as the creed puts it – but we have so many expressions of this body because we can not agree on how this should be done.\nA ‘Christian Country’ insinuates that one knows what it means to be Christian or what a Christian believes in or should do. However it is not that simple. For as many political beliefs that there are, there are just as many, if not more, expressions of church life. Some of the things that are done in the name of God/the Church make my skin crawl, in the same way that things I preach and write (probably including this) may make some Christians say I am a heretic. That people are segregated from parts of the church based on martial status, gender, sexuality, age or ethnicity makes me angry - in the same way they make me angry when these things also happen in society. That people picket funerals with placards saying ‘Burn in Hell’ and ‘God hates Fags’ and call themselves 'church' makes me burn deeply with anger. I disagree with my Catholic brothers and sisters on the Mass and the place of Mary and Saints. I disagree with my Anglican brothers and Sisters on their establishment as a ‘state’ church. I disagree with my Pentecostal brothers and sisters about the prevalence of certain gifts of the Spirit. I disagree with my reformed brothers and sisters on the role of women in the leadership of the church. And I am sure my brothers and sisters would disagree with me on these and many more issues.\nIt is this fact that makes me question the premise of being a Christian Country. Indeed what does that mean? We hold to Christian principles? Is it that we have a state church? Is it that we have historically been a churched nation? – Because that is not the case any more. If it is the first one, that we hold to Christian principles – what exactly are ‘Christian Principles?’ ‘Love you neighbour as yourself’? ‘Do unto others as you would have them do unto you’? ‘Sell everything you have and give it to the poor’? Bit harder that principle.\nMy observation is that the phrase ‘We are a Christian Country’ is a phrase often used by sections of the right who may go to church at Christmas and for funerals but like to hide behind this statement to cover xenophobic and racist views. They will use it to spout that other shouldn’t be able to practice their religion or culture, by, for example, wearing the hijab. They will use it to say that we should not allow different religions to be taught in schools. They will use it to say that we should only allow Christian refugees into the country, the same Christian refugees who may come from churches, which says we should imprison gay people or women should not be allowed to speak.\nAs the early Baptist Pioneer, Thomas Helwys, in A Short Mistery of Iniquity (1612), puts is:\n'...for men's religion to God is betwixt God and themselves; the King shall not answer for it, neither may the King judge between God and man. Let them be heretics, Turks, Jews, or whatsoever, it appertains not to the earthly power to punish them in the least measure.'\nViews, although they may be called ‘Christian’, are always views, which we come to by reading the Bible through the cultural lens in which we live – for we can do nothing else. I am a university educated, white, British, left wing male – my reading of the Bible and what I think God is saying will be influenced heavily by these things. In the same way a 14 yr. old, Palestinian girl, will read the same thing I read in the Bible and believe it to say something completely different.\nFor me, there is no such thing as a ‘Christian Country’ – mainly because, who decides what is ‘Christian’?",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_politics/content_11.html": "top of page\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin.\nWhat is the perfect life? What does society around you project as being th\nDon't tell me I can't be angry and to pray. I can do both.\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be...\nThere is no such thing as a 'Christian Country'.\nThere is no such thing as a Christian Country. ‘We are a Christian Country…’, ‘Last time I checked we were a Christian Country…’, ‘That...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2019_03/content_51.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nMaybe I'm not a good politician?\nAnyone who is alive at this moment in time will notice that our politics is a bit messed up - to put it mildly. 'We have had enough of...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_08_07_we-are-all-human/content_55.html": "We are all human.\n- Andy Fitchet\n- Aug 7, 2015\n- 2 min read\nIt may come as a shock to some, but we don't choose where we are born. We have absolutely no control over who our parents are, what language we are taught to speak, what culture we are brought up in or the colour of our skin. As a Christian, it is a firm conviction of mine that God did know these things, but that is still out of our control. However what isn't out of our control is where we may decide to raise a family, settle ourselves and make a life for ourselves.\nDavid Cameron recently described the human beings at Calais, who happened to not be born in Britain, 'a swarm'. This could of course been just a sloppy use of language however one thinks for such a polished PM this is not the case. This was a deliberate use of language to pander to the right-wing maniacs in his party and UKIP. This language brings to mind the image of insects or horrible swarms that destroy civilisations, even like the swarms of locusts in the Plagues story of Moses and the Israelite people.\nOne thing that people seem to forget is that we are all human. We are not valuable because of what we can do or what we can provide to others, we are inherently valuable because we are. By the very fact that we are alive and human, we have dignity and intrinsic worth.\nIf your family were threatened, our livelihood taken away from you, your freedoms inhibited, would you not try to get your family to somewhere safe? Somewhere where you can live freely and provide for them? To many Britain does seem like the Promised Land and in many ways it is. It is a place where you can go about your lawful business without being hassled by the state, it's a place where you can worship the God you want to without being persecuted, it is a place where people are viewed as people and treated as such. OF course it's not perfect, we have a Tory govt. for a start! But we are blessed in more ways than many in this world.\nWe should celebrate the diversity within our communities, which broadens our understanding of our humanity, teaches us new things and helps us to become more tolerant and respectful of others.\nWe are all created in the image of God, no matter where we come from. We are all human and deserve to be treated as such.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_Christ/content_17.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_trump/content_39.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nDon't tell me I can't be angry and to pray. I can do both.\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2018_08/content_44.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nThe day my evangelicalism died.\n'You will not turn me into a liberal!' This was my exclamation to my tutor when I was training to become a minister. Indeed, liberal...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_christmas/content_56.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nStick with Christmas...for now.\nSo I have spent a long time reflecting on Christmas this year and trying to write what seems like a million sermons which all bring...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_page_2/content_16.html": "top of page\nFeatured Posts\nBlog and ramblings\nWe are all human.\nIt may come as a shock to some, but we don't choose where we are born. We have absolutely no control over who our parents are, what...\nCan Missional Communities be Baptist?\nCan missional communities be Baptist or are they by very nautre extra-denominational? Church decline in the UK has been a common pattern...\nCommunion: Who can come to the table?\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it...\nAssisted Dying bill. Can a Christian support it?\nL ord Faulkner of Thoroton is a Labour life peer in the UK’s House of Lords.[1] In June 2014 Lord Faulkner set before the House of Lords...\nWhy do Baptists ordain? Aren't we all priests?\nA key concept in Baptist understandings of church and mission is that Baptists want to claim their authority from the New Testament and...\nCan Christians be truly Pacifist in the 21st Century?\nPacifism, by which I mean the complete rejection of involvement in warfare, was a predominant view on war and violence in the early...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2015_05/content_48.html": "top of page\nFeatured Posts\nBlog and ramblings\nWhy do Baptists ordain? Aren't we all priests?\nA key concept in Baptist understandings of church and mission is that Baptists want to claim their authority from the New Testament and...\nCan Christians be truly Pacifist in the 21st Century?\nPacifism, by which I mean the complete rejection of involvement in warfare, was a predominant view on war and violence in the early...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2015_06/content_36.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nAssisted Dying bill. Can a Christian support it?\nL ord Faulkner of Thoroton is a Labour life peer in the UK’s House of Lords.[1] In June 2014 Lord Faulkner set before the House of Lords...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2017_06_15_tactical-voting-does-it-work/content_30.html": "Tactical Voting. Does it work?\n- Andy Fitchet\n- Jun 15, 2017\n- 3 min read\nThere was an awful lot of talk on social media about voting tactically to keep the Tories out, an idea I greatly agree with! There were websites dedicated to looking at past election results, both national and local, to determine who was the most likely challenger to the Tories in any given seat. There were the popular ones, tactical2017 and Best for Britain. There were the more eccentric ones and then there were the newspapers with their predictions.\nThe one major flaw in these websites is this: the electorate.\nTactical voting has its basis in the assumption that how people voted in the previous election is roughly similar to how they will vote in this election. All you need to do is persuade a few kind hearted Tories to vote Lib Dem or Labour and bobs your uncle, you have a Progressive Alliance or a Labour majority.\nIn the seat in which I stood, North West Hampshire, there has never been anything but a Conservative MP since it's creation. It was probably even a Tory seat in the Victorian times, but I'll need to check.\nMost of the websites said that the tactical option was Liberal Democrat. Some changed their mind half way through and rather than urging people to vote Labour they then urged people to vote Lib Dem. I can understand why. In the local elections just 4 weeks before the Lib Dems, much to my annoyance, did do better than Labour, but in the General Election of 2015 we received 2000 more votes than the Lib Dems.\nFast forward 2 years to the next General Election and countless times I heard people say, 'well I would vote Labour but I think the safe option to keep the Tories out is to vote Lib Dem.' Lib Dem leaflets proudly displayed graphs and headlines of 'Labour Can't Win Here' and so it goes on. I may sound bitter at this point, I promise I'm not...\nThe result then you would think would be Labour crushed and the Lib Dems sail within a whisker of beating the Conservatives to win North West Hampshire.\nThe result? Labour, 13,792. Lib Dem, 5708.\nOh.\nOne thing tactical voting websites don't take into account is the mood of the electorate.\nIn 2015 in my seat UKIP came second with 8000 votes, this time they lost their deposit. As with many places around the country that vote didn't head wholly to the Tories but seems to be split evenly amongst Labour and the Conservatives.\nWe ran a good campaign, but did it on about 40p as we had the locals a month before and we managed to achieve the highest ever Labour vote in this seat. Why? Why would that happen when all the websites predicted we would lose out to the Lib Dems?\nThe only thing I can put it down to is a successful campaign and a real choice. There was for once a real choice between what the Conservatives were offering and what Labour where offering. There was a clear difference locally in what we wanted to do for the constituency and what the Conservatives wanted to do for the constituency.\nThe difference inspired people to vote for the plan they thought was best for the country, either way.\nTactical Voting websites can only go on what had gone before and not judge the mood of the electorate at the time.\nI am sure in some places they work, close Uni seats, seats where the second place person was within 500 votes etc. But in seats like mine, where the majority was 23,000. No they don't work. You simply have to vote with your heart, so that you can go to bed with the satisfaction that you voted for the party, candidate and plan that you wanted to win.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog/content_4.html": "top of page\nFeatured Posts\nBlog and ramblings\nMaybe I'm not a good politician?\nAnyone who is alive at this moment in time will notice that our politics is a bit messed up - to put it mildly. 'We have had enough of...\nTruth is power.\nA transcript of a sermon preached at Two:23, a multi-denominational LGBT+ service based at Bloomsbury Central Baptist Church, London....\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin.\nWhat is the perfect life? What does society around you project as being th\nThe day my evangelicalism died.\n'You will not turn me into a liberal!' This was my exclamation to my tutor when I was training to become a minister. Indeed, liberal...\nMaybe you can't be Evangelical and Liberal?\nMaybe you can’t be an Evangelical and a Liberal? I am a bit confused by Tim Farron. I am a proud socialist. My politics comes out of my...\nTactical Voting. Does it work?\nThere was an awful lot of talk on social media about voting tactically to keep the Tories out, an idea I greatly agree with! There were...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_communion/content_45.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nCommunion: Who can come to the table?\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2016_06_01_does-original-sin-have-any-place-in-modern-christianity/content_25.html": "Does Original Sin have any place in modern Christianity?\n- Andy Fitchet\n- Jun 1, 2016\n- 9 min read\n‘Do you think God sends babies to hell?’ This was a question that was presented to me during a time with members of my congregation. Besides other theological points, such as what is hell? Or God’s involvement in salvation, the answer to the question will have its answer based on specific understandings of the doctrine of original sin.\nOriginal sin as a doctrine often has its origins attributed, as with so many doctrines, to Augustine. In his book On Nature and Grace (De Natura et Gratia), he writes:\n‘Man's nature, indeed, was created at first faultless and without any sin; but that nature of man in which everyone is born from Adam, now wants the Physician, because it is not sound. All good qualities, no doubt, which it still possesses in its make, life, senses, intellect, it has of the Most High God, its Creator and Maker. But the flaw, which darkens and weakens all those natural goods, so that it has need of illumination and healing, it has not contracted from its blameless Creator— but from that original sin, which it committed by free will. Accordingly, criminal nature has its part in most righteous punishment. For, if we are now newly created in Christ, we were, for all that, children of wrath, even as others, but God, who is rich in mercy, for His great love wherewith He loved us, even when we were dead in sins, has quickened us together with Christ, by whose grace we were saved.’[1]\nWe can see from this quote that Augustine views that humankind is corrupted by sin from birth due to the very fact that we are human, sin is hereditary by birth. We have free will and therefore, will, because of our flawed and sinful nature, always incline to sin and go against the will of God. Augustine’s understanding of original sin comes from reading Genesis 3, often headed in our English Bibles as ‘The Fall of Man’. In this story we read how a serpent, often understood to be Satan or the tempter of humankind, tempts the women, Eve, to eat fruit from the Tree of the Knowledge of Good and Evil, which God has specifically forbidden. The serpent persuades Eve to eat the fruit and disobey God’s command. Eve then gives the fruit to Adam, the man, and both have now disobeyed God and committed the first sin. God then throws Adam and Eve out of the garden and tells them they shall eventually die and return to the dust of the earth. In classical Theology this is the point at which death and sickness enter the world. The doctrine of original sin states that from this selfish act of disobedience by Adam and Eve, all the descendants of them, i.e. all of humanity, are inclined to sin and disobey God. This understanding is heavily weighted in a literal reading of the Genesis creation narrative. The question then begs what if the narrative is metaphorical, does this undermine any understanding that humanity is inherently sinful? Not necessarily, one could persuasively argue that it is God alone who is perfect, anything outside of God’s self is not perfect, for it is not God. Therefore humanity, although created in God’s image, is outside of God and other to God and therefore has the capacity to sin for it is not perfect, like God is. Colin Gunton also argues that there is no need for a literal understanding of the Genesis creation narrative to believe in the inherent sinfulness of humanity:\n‘We do not need to believe in a historical Adam, because the biblical story is itself too subtle to require such a naïve and literalist meaning…Whether there was a primal catastrophe from which our characteristically fallen nature descends, it remains the case that human beings choose to go backwards to what the Bible sometimes calls death rather than forwards to the perfection that is the purpose of their creation.’ [2]\nOther arguments that would flaw the understanding of a historical Adam and the event of the first sin would be the marriage of Adam and Eve’s children. According to a literal reading after the fall and exit from the Garden there are currently only 4 people on the earth; Adam, Eve, Cain and Abel. Cain kills Abel and is forced to leave, he settles in the Land of Nod, where we read:\n‘Then Cain went away from the presence of the Lord, and settled in the land of Nod, east of Eden. Cain knew his wife, and she conceived and bore Enoch.’ Gen 2:16-17\nThe glaring question of this text is, where did Cain’s wife come from, if there are only 4 people on the planet? Did God create her? If so, she would have been created apart from Adam and not come from Adam, would this mean that she is then not contaminated by the sin of Adam, as she is separate from him entirely? It seems to me that one, to hold to a view of original sin, has to hold that humanity, because it is not God, has the capacity to sin innate within us, and this is not because of one single historical act but this narrative is metaphorical of the human condition.\nWhen talking of the human condition, Augustine argues it, as already written, ‘needs a physician, for all is not sound.’[3] This is to say that because of original sin humanity is twisted away from God and is inclined to sin rather than follow God. Some have taken the idea of original sin further than Augustine and have taught not only are people born into sin and a sinful world, but that people are unable in any way to be good, for even good acts committed, without knowing God, are inherently selfish. This is known as total depravity.\nTotal depravity suggests that not only are people inclined to sin people can do nothing else, without the grace of God. People are so sinful as a result of the fall, the image of God, the Imago Dei, within humanity is so blurred and broken that there is no good in humanity, by its own strength. This idea was promoted by the reformer John Calvin. Total depravity is intrinsically linked to Calvin’s other theologies, such as the predestination of the elect. That is:\n‘By predestination we mean the eternal decree of God, by which he determined with himself whatever he wished to happen with regard to every man. All are not created on equal terms, but some are preordained to eternal life, others to eternal damnation’[4]\nIt is this understanding that some are preordained to a life and eternity without God that leads Calvin to the understanding that people are totally deprived without the grace of God and there is no goodness with humanity because otherwise those who could, would choose to follow God. Gunton, rebutting this argument writes:\n‘Total depravity…is clearly false: empirically false, because we see instances of goodness in all kinds of people, and theologically false, because it denies divine providence: his providential overruling of the full consequences of the fall and consequent presence of all kinds of goodness…’[5]\nJohn MacQuarrie also argues against totally depravity:\n‘…we must not ascribe to a doctrine of total depravity…Man does not cease to be human, but he loses the power to fulfil the potentialities of a fully human existence, and this, as we have seen, sends him in a quest of the grace…the fact that the quest for grace is aroused in man is itself a powerful testimony against any doctrine of total depravity.[6]\nKarl Barth, perhaps the greatest theologian of the 20th century, looks at original sin christologically. Rather than starting with the fall and sin entering into the world, Barth starts with Christ and the Cross and then looks backwards towards Adam. John Webster in his book Barth’s Moral theology, sums up this understanding:\n‘Barth is generally only interested in sin post Christum; questions of its ancestry are entirely subservient to the main Christological handling of the theme…this conviction means that ‘only when we know Jesus Christ de we really know that man is the man of sin, and what sin is and what it means for man’. Materially it means that Barth refuses to treat sin as other than a reality that has already been accused, condemned and abolished by Jesus Christ: its existence is that of a defeated reality…The consequent asymmetry between Adam and Christ means that the logic of Barth’s position is such that he is unlikely to be profoundly preoccupied with origins.’[7]\nBarth held that a historical Adam was not necessary for an understanding of human sinfulness because sin is a human reality. In Church Dogmatics, Barth writes:\n‘It is the name Adam the transgressor which God gives to world-history as a whole, the name Adam sums up this history as the history of mankind which God has given up, given up to its pride on account of its pride’[8]\nBarth escapes the pressures of biblical literalism to deal simply with the fact that sin is a reality for humanity which in Christ, who was before Adam, has been abolished. Barth disagreed with the understanding of the hereditary nature of original sin. Barth’s understanding of sin is that sin is wilfully committed against God, whether in thought, word or deed, not that humanity is sinful purely because it is alive:\n‘Who is Adam? The great unknown who is the first parent of the race?...But he was so as the beginner, and therefore as primus inter pares. This does not mean the he has bequeathed it to us as his heirs so that we have to be as he was. He has not poisoned us or passed on a disease…we are so freely and on our own responsibility. Although the guilt of Adam is like ours…That is Adam as seen and understood in the biblical tradition, the man who sinned at once…the one who all his successors do in fact resemble (in the fact that they all sin at once as well).[9]\nBarth realises that some of his arguments could indeed been seen to be pelagian in nature, those which Augustine was fighting against in his development of the doctrine of original sin. Pelagius believed that God’s grace was given and we all had the choice to do good or to sin. He believed that we all could all lead a perfect Christian life if we were but to try harder. God has commanded us to ‘be perfect as your Father in heaven is perfect’ Matt 5:48 and, Pelagius argues, God would not command something that was not possible. Chadwick on this view:\n‘ To tell people that their will was corroded to the point of total incapacity seemed to Pelagius fatally enervating…Certainly without the help of grace the sinner could not do all that he ought, and his duty is the imitation of Christ’s example. But grace is assisting not all-controlling. Oarsman can get their craft to their destination without wind of sail, though sail makes it easier’[10]\nAware of this connection Barth develops two universal understandings of sin. First he writes on human solidarity in sin and secondly he writes of the ‘Lordless Powers’ that come about as part of human alienation from God. Barth wants to affirm that there is a reality of sin in which we as humanity live and are tempted by but our own judgement comes not from hereditary sin by virtue of birth but by succumbing to these powers of temptation and sinning ourselves. Webster sums up Barth’s anthropology:\n‘Barth’s anthropology betrays a deep seated instinct to hold together agency, responsibility and guilt, and to refuse all forms of fatalism in which sin is viewed as anything other than what we both will and do.’[11]\nSo what of modern Christianity? What of the question posed to me, ‘Does God send babies to hell?’ One only need look around at the world to see much evil, but also much good. One sees the despicable acts of Daesh in Syria and Iraq, the shame of refugee’s coming from that area drowning in the Mediterranean because no safe passage was given. One reads daily of the murdering of human beings by one another and of the exhortation of human beings by one another. One reads of the illegal trade of human beings and the selling of women and children into the sex-trade as well as the 27 Million people thought to be in modern day slavery[12]. However one also reads of a 92 year old veteran giving his spare room to a Syrian refugee because “The scale of the problem struck me”[13], one see’s food and coffee bought for homeless people out of compassion, one knows the kindness of friends who would not call themselves Christians or claim to know the grace of God.\nIn conclusion, the concept of total depravity as taught by Calvin and taken further by followers since, I believe has no place in modern Christianity, if it ever had a place. But the understanding of sin, as taught by Barth, can teach us an insurmountable about the state of the human heart. We are inclined to sinful and selfish acts as humanity, but that is because we are other than God not because we are born into a state of sin of which there is no escape. Without a thorough understanding of atonement in Christ, one fails to miss the understanding of sin. As Barth writes:\n‘It is the Word of God (That is Christ) which fuses all men into unity with this man as primus inter pares. It is the Word of God which condemns at one his disobedience and therefore our disobedience. It is the Word of God which forbids us to dream or any golden age in the past or any real progress within Adamic mankind and history or any future state of historical perfection, or indeed to put our hope in anything other than the atonement which has taken place in Jesus Christ.’[14]\n[1] Augustine, On Nature and Grace .III, as viewed in Boniface Ramsey, Augustine, selected writings on grace and Pelagianism, .321\n[2] Gunton, C. The Christian Faith: An introduction to Christian Doctrine, .61-62\n[3] Augustine, On Nature and Grace .III, as viewed in Boniface Ramsey, Augustine, selected writings on grace and Pelagianism, .321\n[4] Calvin, Institutes, Book III, 21. V. As viewed on: http://www.reformed.org/master/index.html?mainframe=/books/institutes/ 09/09/15\n[5] Gunton, C. The Christian Faith: An introduction to Christian Doctrine, .62\n[6] MacQuarrie, Principles of Christian Theology, .266\n[7] Webster, Barth’s Moral Theology, .67\n[8] Barth, Church Dogmatics IV.1, .508\n[9] Barth, Church Dogmatics IV.1, 509-510\n[10] Chadwick, H. Augustine, 2001, .108.\n[11] Webster, Barth’s Moral Theology, .67\n[12] A21, Human Trafficking, http://www.a21.org/content/human-trafficking/gl0ryw as viewed on: 10/09/15\n[13] Withnall, http://www.independent.co.uk/news/uk/home-news/british-armed-forces-veteran-92-offers-up-his-spare-room-to-house-desperate-syrian-refugees-10494810.html?cmpid=facebook-post, as viewed on 10/09/15\n[14] Barth, Church Dogmatics IV.1, .511",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_05_10_why-do-baptists-ordain-arent-we-all-priests/content_40.html": "Why do Baptists ordain? Aren't we all priests?\n- Andy Fitchet\n- May 10, 2015\n- 11 min read\nA key concept in Baptist understandings of church and mission is that Baptists want to claim their authority from the New Testament and early church not from an understanding of apostolic succession.\nBaptists as a group in England emerged in Spitalfields, London in 1612. Thomas Helwys, after escaping persecution from the authorities for publicly dissenting from the established church, felt a call to move back from Amsterdam to London to minister to his own people and support those who were facing persecution. In that year, 1612, Helwys wrote a defense of his beliefs called A Short Declaration of the Mistery of Iniquity, in which Helwys argues that the church and state should be separate and that religion and faith is between the person who believes and their God not between the person and the state or church. Helwys writes:\n\"If the Kings people be obedient and true subjects, obeying all humane lawes made by the King, our Lord the King can require no more: for men's religion to God is betwixt God and themselves; the King shall not answer for it, neither may the King be judge between God and man.’[1]\nThis was a radical book of its time claiming that all should be free to worship God, of whatever religion, in the way they see fit not just in the way prescribed by the state and established church.\nHelwys was writing at a time when the Protestant Reformation was taking root in Mainland Europe. The Roman Catholic Church was being challenged on many of its practices from the selling of indulgences to the place of the Priest in the church. It is that latter of these points that I want to focus in on. In Roman Catholic theology ordination in itself is a sacrament[2], in which the priest being ordained becomes ontologically different and becomes the representative of Christ within the church and the intermediary between Christ and his people. Martin Luther, however, argues that there is only one priest, Jesus Christ, who intercedes, forgives and administers grace. Luther writes in Babylonian Captivity:\n‘…it says in 1 Peter 2, \"You are a chosen race, a royal priesthood, a priestly kingdom.\" In this way we are all priests, as many of us as are Christians. There are indeed priests whom we call ministers. They are chosen from among us, and who do everything in our name. That is a priesthood which is nothing else than the Ministry. Thus 1 Corinthians 4:1: \"No one should regard us as anything else than ministers of Christ and dispensers of the mysteries of God.\"[3]\nLuther clearly here argues that all those who are baptised are priests in a sense. He claims this from scripture and particularly 1 Peter 2:9 ‘You are a royal Priesthood’. This is a claim Baptists have made and clung to since our earliest beginnings. John Smyth, one of Helwys’ companions in fleeing to Amsterdam in his book ‘Differences of the church of separation’ states that all Christians are ‘Kings and Priests’[4]. It could seem then that Baptists rejected the idea of ordination as an early movement, however this seems not to be the case.\nFrom the earliest beginnings the Baptist movement has had an understanding of and practiced ordination, if not used the word. Wm. Lloyd Allen in his article, for Baptist History and Heritage, The Meaning of Ordination, writes this:\n‘Baptist churches, governed by congregational polity as dictated by the equal status of each baptized member, chose and authorized congregational leaders not as lords over them, but as servant ministers. Divine authority in Baptist beginnings did not trickle down from ordained clergy to the common Christian, but flowed upward through the members of the congregation to its chosen leaders. The very term ordination was avoided for several decades in the two original Baptist groups, Generals and Particulars, in favour of terms such as ‘set apart,’ ‘called,’ and ‘appointed.’’[5]\nMinisters were indeed set apart by the congregation to lead them and for the ministry of preaching the word of God and pastoring. It seems to me that this is in practice ordination, without using the word itself that carried with it negative associations. Baptists have historically been functionalists when it comes to the areas of ordination, communion and Baptism. In other words, nothing happens to the person when these things are done, in terms of receiving more grace. Bread remains bread, wine remains wine and the person who is ordained does not become ontologically different, but that they are set apart for the purpose of serving the congregation of God’s people in a special way. Nigel Wright in his book Free Church – Free State, uses the phrase ‘the Leadership of some and the ministry of all.’[6] This certainly seems to sum up the historical view of Baptist thought around ordination and ministry. It is the work of all Christians to do the work of Christ, to offer pastoral care to one another, to look after the widow and orphan, to do the work of the evangelist and to, when needed, administer the ordinances of Communion and Baptism to believers. Tracing the origins back to the Protestant Reformation, Baptists in the earliest days reacted against the view that somehow it was only the Priest who could preside at communion and offer Baptism. This Roman Catholic view of ordination was rejected by early Baptists who held a strong view that each believer had equal authority and equality within the body of Christ.\nBy the middle of the 17th Century Baptists has begun to regulate and standardize the theology taught within the churches and following that how churches should be overseen, this included the role of the pastor. The 1689 Baptist Confession of Faith, written down by the Particular Baptists, was written down to give a formal account of what these churches believed. In chapter 26 of the confession the role of Pastor or Bishop, as sometimes refereed to in the early Baptist churches, is recorded as being:\n‘The way appointed by Christ for the calling of any person, fitted and gifted by the Holy Spirit, unto the office of bishop or elder in a church, is, that he be chosen thereunto by the common suffrage of the church itself; and solemnly set apart by fasting and prayer, with imposition of hands of the eldership of the church…Although it be incumbent on the bishops or pastors of the churches, to be instant in preaching the word, by way of office, yet the work of preaching the word is not so peculiarly confined to them but that others also gifted and fitted by the Holy Spirit for it, and approved and called by the church, may and ought to perform it.’[7]\nWe see from this confession of faith that the focus is not on the pastor but on the church and Christ. Although the Pastor is set apart ‘with imposition of hands’ by the Eldership of the local congregation, it is the calling of Christ on that person which is pivotal. The local church itself determines who is called by Christ and then they are chosen by the local congregation to be in that role and then they ‘ordain’ them. It is not by a Bishop or a higher authority. This is key in the understanding of Baptist ordination. In early Baptist churches the local church itself called a pastor to serve them and they themselves laid hands and set them apart. The spirit of which is still reflected today in our ordination process, whereby someone who has trained for ministry cannot, usually, be ordained until a local church has called them to be their pastor.\nThere have been many views within the Baptist movement regarding ordination. Charles Spurgeon, arguably the most influential Baptist pastor of 19th Century, is to have said of ordination that is it the ‘placing empty hands on empty heads’[8]. Arthur Dakin, former principle of Bristol Baptist College, famously refused to be called ‘Reverend’ when Principle as he viewed that only can one be called ‘Reverend’ when in the pastorate of a local church.\nHaving looked at the practice of ordination within Baptist history we now look to compare modern Baptist scholars and their view of ordination. In modern scholarship there has been a split between those who want to see ordination as a function and those who want to see it sacramentally. Paul Fiddes in his book Tracks and Traces, Baptist identity in Church and Theology, argues for and leans towards a much more sacramental view of ordination and ministry. Fiddes argues that there is something inherently Christ like in the relationship between the Pastor and the congregation of the local church. He views ministry as a process of self-emptying for the sake of the church and in doing so, through serving the local church, one mediates between others and ourselves. This is significant in Fiddes’ Theology because he notes that the self of the pastor is caught up in the relationship between the Father, Son and Holy Spirit and therefore when mediating between the self and the other we are mediating also between God and the other. Fiddes writes:\n‘We understand the concept of ‘being’ as the mediation between the self and other…we follow our way of being through the participating in the interweaving of the triune God, which are a constant movement of giving and receiving in love, a self-giving Father, Son and Holy Spirit, each to the other and beyond each other.’ [9]\nFiddes’ view of the role of pastor as mediator shapes the way he views ordination. Fiddes argues that there is something significant about being called to the ‘office’ of pastor, or bishop as he also calls the pastor, compared with other callings. Fiddes, it must be noted, goes to great lengths to say that this is not a higher calling than others, just a different one. I would argue that in all actuality Fiddes does present the calling to become a pastor as a higher calling. His view of ordination is that it is a special moment, not dissimilar to baptism within the Christian walk. Fiddes’ explains:\n‘Ordination is a moment of special encounter with the triune God in which, like Baptism, there is grace to help shape heart, mind and character’[10]\nI would argue that this grace which one meets within ordination is the same grace one receives daily from Christ and that this isn’t a special grace only received by those who are ordained. Fiddes’ also wants to view the role of the pastor as equivalent to the role of episcope or ‘overseer’ within the New Testament. This is a role, Fiddes argues, is about a way of ‘being’ not a way of ‘doing’. ‘Being’ in Fiddes’ view is far more important than the doing. One is called to the ministry because of who they are not because of what they do. The ordained person has authority towards and responsibility over the local congregation and ‘stands in the shoes of the Apostles’[11] One could argue that this reflects too much the Roman Catholic theology of apostolic succession and that rather than holding that all believers are priests who can do the work of the priest, and indeed that their own work is priestly work, this separates out far to much to pastor from the congregation and confers on them special status. Fiddes’ sums up his view of the role as Pastor, Bishop or episkopos when he writes:\n‘…we may say that ministry of episkopos is characterized by being a ministry of word and sacrament’[12]\nPaul Beasley-Murray in his book Radical Believers, The Baptist Way of Being the Church, wants to focus on the understanding of the ‘ministry of all and leadership of some’. Beasley-Murray, in a stark contrast to Fiddes’ writes:\n‘Some would prefer to interpret the role of ordained ministry first and foremost with reference to the ‘ministry of word and sacrament’…However… there is not New Testament basis for such an understanding’[13]\nWe can see from this quote that Beasley-Murray takes a vastly different stance to that of Paul Fiddes, despite both being former principles of Baptist colleges, and he has a more functional view of ministry and ordination. Beasley-Murray argues in his book that all Christians are called ministry, he suggests that baptism is in itself a type of ordination. After baptism in many Baptist churches those leading the baptism, which Beasley-Murray affirms may not be the pastor but any of God’s people, will lay hands upon those who have been baptised. A prayer often said after baptism is:\n‘Lord, bless these your servants and strengthen them by your Holy Spirit as we commission them for service in the church and in the world in the name of the Lord Jesus Christ.’[14]\nMy own experience of believer’s baptism is of exactly that prayer being prayed over myself. In a sense it is indeed a prayer of ordination, all Christians are ordained in a way to do the work and will of God and to live out their calling whether that be as a teacher, politician, police officer, social worker and so on, all are called to service in the church and in the world and within all of those callings, pastor is one. Ordination, in Beasley-Murray’s point of view, is an almost celebration of a persons calling, their training and their call to serve in local pastorate. He writes:\n‘Ordination accords the formal recognition and trust of the wider church to the ordained. This marks the culmination of a lengthy period of testing and training, and is the occasion when churches together publically recognise certain individuals as called of God to exercise leadership among them.’[15]\nIt is clear to see that Beasley-Murray rejects any understanding that within ordination someone has conferred on to them extra grace or special status. He confirms this when he clearly writes that ‘ordination does not of itself bring a person nearer to God’[16] For Beasley-Murray ordination is an almost professional rite, like with physicians who take a Hippocratic oath. Beasley-Murray strongly defends his understanding of ordination within the framework of the priesthood of all believers. He does that clearly with this observation ‘Work is more than a means of earning money, it is a way of contributing to the needs of others and as such is a form of Christian ministry.’[17]\nIt seems to me that Beasley-Murray is appealing to the New Testament understanding of the priesthood of all believers where as Fiddes is appealing to a view of ordination within church history and in light of ever growing ecumenism.\nTo conclude, Baptists strongly believe in the priesthood of all believers and it is within this framework that I feel ordination should be approached. To explain then the Baptist approach to ordination, it seems to me only logical that Beasley-Murray’s view of ordination as being significant as a recognition of calling, testing, and training, but that all are called to Christian ministry in one form or another, feels more inherently Baptist than Fiddes’ view of ordination being sacramental. It is also clear to me that there is varied opinion within Baptist thought and therefore not one clear view but many views and it is for each to discern themselves, under the guidance of the Holy Spirit, which is in itself, a strongly Baptist conviction.\nBibliography\nBeasley-Murray, Paul. Radical Believers: The Baptist way of being the church, Chipping Norton: Nigel Lynn Publishing, 2006\nFiddes, Paul. Tracks and Traces: Baptist Identity in Church and Theology, Carlisle: Paternoster Press, 2003\nWright, Nigel G. Free Church – Free State: The positive Baptist vision, Milton Keynes: Paternoster Press, 2005\nHolmes, Stephen R. Baptist Theology, London: T&T Clark International, 2012\nH. Leon McBeth, A Sourcebook for Baptist Heritage, Nashville: Broadman Press, 1990\nHelwys, Thomas. A Short Declaration of the Mistery of iniquity, 1612. Georgia: Mercer University Press, 1998.\nhttps://www.paulbeasleymurray.com/books/1/. Beasley-Murray, Paul, Call to Excellence, 1995. As retrieved on 07/03/15\nhttp://www.reformed.org/documents/index.html?mainframe=http://www.reformed.org/documents/baptist_1689.html. Baptist Confession of Faith of 1689, as retrieved 05/03/15\nhttp://www.baptisthistory.org/contissues/allen.htm. WM Lloyd Allen, The Meaning of ordination, 2000. As retrieved on 05/03/15\nhttp://ctsfw.net/media/pdfs/nagelnlutherpriesthoodallbelievers.pdf. Nagel, N., Luther and the Priesthood of all Believers, Concordia Theological Quarterly, 1997\n[1] Helwys, A Short Declaration of the Mistery of Iniquity, 1612. (Mercer University Press, Georgia 1998, 53.)\n[2] By ‘Sacrament’ I mean an outward sign of an inward grace and something instituted by Christ himself.\n[3] De captivitate Babylonica ecclesiae praeludium, 112-113. As quoted in Nagel, N. Luther and the Priesthood of all Believers, Concordia Theological Quarterly, 1997. 283. Retrieved from http://ctsfw.net/media/pdfs/nagelnlutherpriesthoodallbelievers.pdf on 04/03/15\n[4] H. Leon McBeth, A Sourcebook for Baptist Heritage, Nashville: Broadman Press, 1990, 15.\n[5] WM Lloyd Allen, The Meaning of Ordination, 2000. Retrieved from http://www.baptisthistory.org/contissues/allen.htm on 05/03/15\n[6] Wright, N, Free Church – Free State, Paternoster Press, Milton Keynes, 2005, 160.\n[7] 1689 Baptist Confession of Faith, Chapter 26, Para. 9 & 10. Retrieved from http://www.reformed.org/documents/index.html?mainframe=http://www.reformed.org/documents/baptist_1689.html retrieved on 05/03/15\n[8] Michael, L. Spurgeon on Leadership, Kregel Publications, 2010. 139.\n[9] Fiddes, P. Tracks and Traces, Paternoster Press, Milton Keynes, 2003, 100.\n[10] Fiddes, P. Tracks and Traces, Paternoster Press, Milton Keynes, 2003, 101\n[11] Ibid. 104\n[12] ibid. 104\n[13] Beasley-Murray, P. Radical Believers, Nigel Lynn Publishing, Oxfordshire, 2006, 114.\n[14] Beasley-Murray, P. Radical Believers, Nigel Lynn Publishing, Oxfordshire, 2006, 113.\n[15] Ibid. 120\n[16] Beasley-Murray, P. A Call to Excellence, 1995. Retirved from https://www.paulbeasleymurray.com/books/1 on 06/05/15\n[17] ibid. 113",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2015_11/content_18.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nThere is no such thing as a 'Christian Country'.\nThere is no such thing as a Christian Country. ‘We are a Christian Country…’, ‘Last time I checked we were a Christian Country…’, ‘That...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_capitalism/content_10.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_incarnation/content_57.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nStick with Christmas...for now.\nSo I have spent a long time reflecting on Christmas this year and trying to write what seems like a million sermons which all bring...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_Eucharist/content_23.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nCommunion: Who can come to the table?\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_Socialism/content_27.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2019_03_26_maybe-im-not-a-good-politician/content_8.html": "Maybe I'm not a good politician?\n- Andy Fitchet\n- Mar 26, 2019\n- 3 min read\nAnyone who is alive at this moment in time will notice that our politics is a bit messed up - to put it mildly.\n'We have had enough of experts' declared Michael Gove MP during the 2016 EU referendum. That's not our issue. Our issue is that everyone seems to think they are an expert, often despite not knowing very much at all about the topic they are pontificating about. Everyone with a Facebook or Twitter account seems to understand incredibly difficult and complicated topics because they can produce a good sound bite in 280 characters. Obviously I'm not included in that...\nI'm not claiming to be an expert, far from it, but I am claiming to be reasonable. And we seem to have lost reasonableness from our politics. There seemed to have been a time when political decisions were made based on reason, logic and fact. Whether this time existed or not is another question entirely but it seems it may have done once. I think I'm a bit old school in my politics. I'm not an ideological purist but I am someone with strong ideals. By the strength of our common endeavour we can achieve more together than we can achieve alone. This is the Labour Party basis. Within that there is flexibility to interpret what that means within any given situation. When it comes to the railways, we clearly aren't all in it together as the trains are old, the timetables are unreliable, the companies make a mint and the passenger pays through the nose for the privilege of that. Nationalising them and putting the profit into the railways and not into the hands of a few private individuals is a logical step forward. When it comes to Trident, is it reasonable to work for a world without nuclear weapons, absolutely. Is it sensible to unilaterally disarm, probably not but I can see the logic in leading the way. Is it sensible to unilaterally disarm and not replace the jobs that Trident creates, particularly in my constituency, without other high skilled industry, absolutely not.\nWhen it comes to Brexit. Can we undo 40 years of political, economic, judicial, cultural and societal ties in 2 years or less. No. That's just not possible and if we try, it will be extremely painful. Therefore, if we are going to leave we need to do so in a way which is as frictionless as possible and that means probably having a long adjustment period to get everything in order. That just makes sense.\nWhen it comes to Facebook. Oh my, Facebook. If I share this long meme or post about a topic I am passionate about will I check everything is correct in it or just share it anyway as it backs up my argument even if it is all lies? Yes, I'll just share anyway! NO! If there was ever a time we needed truth and facts it's now. And I'm sorry to say that although everyone is entitled to their own opinion, that is not that same as everyone's opinion being valid or right.\nYou see, I try to base my arguments, thoughts, decisions in politics on reason and fact. Is this reasonable? Does this make sense? Does the weight of evidence back up this decision and if not is there a good reason why not?\nI wonder, maybe I'm not a good politician? Maybe facts are old hat? Maybe everything should be based on emotion and opinion? Or maybe the world is currently just a bit screwed up.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_bio/content_3.html": "top of page\nBackground\nAndy was raised in Andover after the family settled there with the Army. He was brought up in a single-parent family, on benefits on a council estate. He has a young son. He was a youth worker, chef, gardener and Local councillor before he went to train as a Baptist Minister in 2013. He studied theology at Regents Park College, Oxford University, alongside reviving a dwindling 362-year-old Baptist church in Hampshire.\nExperience\nAndy was elected to the newly formed Andover Town Council in 2010, aged 20. He served the council in many capacities, including being Vice-Chair (deputy mayor) of the Council between 2013-14 and being the Chair of the Staffing Sub-Committee during the same period. He was also one of the main Councillors, along with Chair of Council Cllr Geoff McBride, to push for and form the Andover Youth Council. Andy was co-opted back onto Andover Town Council in January 2016 and then re-elected in 2019. Andy was the only serving councillor to be re-elected to the Council in that election. He served on the council until his resignation in October 2019 (https://www.andoveradvertiser.co.uk/news/17929625.councillor-andy-fitchet-resign-andover-town-council/).\nHe has stood for election at all levels of government from Andover Town (2010 & 2019), Test Valley Borough (2011, 2015, 2019 and by-election 2021 and 2023 - losing by just 25 votes!), Hampshire County (2017 & 2021) and Parliament (2017). Andy achieved the highest ever Labour vote in North West Hampshire. He was Chair of the North West Hampshire Labour Party between 2015-2023.\nAndy is an authorised Minister in the Methodist church and since September 2019 he has been the Methodist Minister in Andover, bringing together the two Methodist churches in Andover into one church and overseeing a major redevelopment of the town centre church building. Andy became the Minister of Hungerford Methodist church in September 2023 also.\nAndy has worked for a number of charities, most recently for the Good Neighbours Network, helping to tackle social isolation and loneliness through acts of kindness across Hampshire. For Good Neighbours Network, he trained voluntary groups on GDPR, Safeguarding & DBS checks, Insurance, Constitutional matters, volunteer management and volunteer recruitment. Before that, he worked for the leading Disability charity, Enham Trust as a Corporate, Community and Events Fundraiser.\nAndy is often invited to preach across many denominations and invited to speak at conferences & events. He speaks on topics including social justice, political engagement, Christian engagement in public life and LGBTQ inclusion. He is a Co-Director of Affirm, Baptists Together for LGBTQ+ Inclusion and a Governor of a local primary school.\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2017_06/content_33.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nTactical Voting. Does it work?\nThere was an awful lot of talk on social media about voting tactically to keep the Tories out, an idea I greatly agree with! There were...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2017_02/content_32.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nDon't tell me I can't be angry and to pray. I can do both.\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2019_02_25_truth-is-power/content_42.html": "Truth is power.\n- Andy Fitchet\n- Feb 25, 2019\n- 4 min read\nA transcript of a sermon preached at Two:23, a multi-denominational LGBT+ service based at Bloomsbury Central Baptist Church, London.\n‘What is truth? Pontius Pilate asked Jesus this during his trial.\nJesus came, according to the writers of John’s gospel, full of grace and truth. John, being my favourite of all the accounts of Jesus’ life. I’m not going to try and define truth, because I have no idea. What I do know is that I am obsessed with it. I think that’s because I spent so much of my life running away from it. Scared of it.\nI’m also convinced that I am obsessed with truth because of my past. All of us are a product of and, let’s be honest, often a reaction to, our past.\nI had a fairly normal upbringing. I was brought up by a single Scottish disabled mother, on a council estate, living on benefits.\nMy dad would text, well not text, we didn’t have mobiles when I was a kid, but he would phone and tell my mum that he would be round on Sunday at 1pm to pick me and my sister up and take us for dinner. So 12 o’clock would come around, I’d be there getting my shoes on and my coat ready to wait for 1 o’clock. I would sit, on the wall outside, and wait. And wait. And wait. 1 ‘clock. 2 o’clock. 3 o’clock. At which point my mum would come and tell me to come inside and I could have whatever I wanted in the cupboards for tea.\nThe next weekend would come. Phone call. 1 o’clock shoes on. 2 o’clock would come and pass. 3 o’clock. 4 o’clock. My mum would come outside again.\nThe next week would come, phone call, shoes on... you get the picture.\nNow I was a cute kid: Who wouldn’t want to hang around with this kid?\nThe truth was not being told to me. It would have been nicer to say, ‘I’m not coming over’ but to do that would be to admit failure.\nTruth is a scary thing because truth demands honesty and it means you can’t hide anywhere. If you live in truth you live in light and all is open for everyone to see. The writers of John’s gospel again in chapter 3:21 ‘But whoever lives by the truth comes into the light, so that it may be seen plainly…’ and that is petrifying. Because there is no where to hide.\nIn the darkness you can create your own life, you can create the person you want to be which may, or may not, be the person you actually are. But truth, well that’s a scarier thing all together because then there is nothing but yourself, your true self, which people can accept or reject.\nTruth is risky.\nBut truth is also power.\nJesus and Pilate find themselves in an exchange about truth and power. After asking ‘what is truth?’ it is not recorded that Jesus and Pilate speak again until they have a conversation about Power. Truth and power are intrinsically linked, aren’t they?\nI remember admitting to myself I was gay and then running to become an MP a few months later. I was petrified that the truth would come out, or more accurately, petrified that someone would out me and use it against me, or worse, have power over me using my own truth against me. I was petrified. I had a life I desperately wanted to live and continue in.\nSo many people have their truth used against them to harm them, to abuse them, to wield power over them. Sometimes it's partners that use it against them, sometimes it's friends, family, sometimes it's structures and churches. Often, it’s by those we should be able to trust to protect us.\nChrist found himself having his own truth about who he was and his own power used against him in order to make him suffer and then eventually kill him.\nBut does that mean Christ was powerless?\nChrist was most powerful when he was seemingly powerless. How life works, how God interacts with the world, how we can relate to God - all of that intrinsically changed through the death and resurrection of Christ. When Christ was seemingly powerless, that’s when he changed everything.\nWhen we own our truth, when we live in our truth, when we live in the light plainly for all to see, then people cannot wield our truth against us because we own it and live it and then we are powerful.\nThen we can change the world.\nThen we are living lives like Christ.\nIt’s a world where you will still be denied, where you will still be mocked, where you will still face hostility – like the Christ we worship does – but it’s a life which is worth living. For as the generation before mine battled to enable us to live a life where same-sex marriage is possible, where civil partnerships are possible, where massive Pride events are possible, where meetings like this are possible, so we battle on.\nLiving in truth, powerful because if it.\nAnd there will be times when we find ourselves in the position of power, in the place to change things. In the place where we can be our authentic selves and do things differently. And what do we do when we find ourselves in the position of power, to do things in an opposite way to the way things were done to us?\nWe do it differently.\nWe don’t leave them with shoes and coat on waiting. We model something different. We live our truth and authentic lives and we change the world.\nWe live out the justice that we ourselves were denied.\nWe live in truth, full of grace and we are powerful because of it.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2018_09/content_6.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_press-and-articles/content_2.html": "TALKS AND SERMONS\nhttps://sohogathering.org/2017/12/11/prayer-sermon-big-queer-carols/\nhttps://www.andoverbaptist.org.uk/abc-podcasts/embed.php?p=archive&cat=all&pgn=20\nPRESS\nhttp://www.andoveradvertiser.co.uk/news/15466255.Six_Andover_parents_in_court_over_school_absences/\nhttps://www.basingstokegazette.co.uk/news/11058123.whitchurch-clerics-go-barefoot-for-lent/\nHousing Issues:\nhttps://www.andoveradvertiser.co.uk/news/15265977.do-your-job-say-picket-twenty-neighbourhood-watch/\nARTICLES\nhttps://www.christiantoday.com/article/roy-moore-and-the-day-my-evangelicalism-died/121438.htm\nhttp://www.broadmeadbaptist.org.uk/recordpdf/record201701.pdf\nhttps://issuu.com/bugb/docs/together_summer2017\nhttps://www.baptist.org.uk/Articles/484506/Dealing_with_post.aspx\nhttps://www.baptist.org.uk/Articles/528534/When_the_church.aspx",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_05_01_can-christians-be-truly-pacifist-in-the-21st-century/content_24.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\n!\nWidget Didn’t Load\nCheck your internet and refresh this page.\nIf that doesn’t work, contact us.\nFeatured Posts\nCommunion: Who can come to the table?\nRecent Posts\nMaybe I'm not a good politician?\nTruth is power.\nIs Capitalism sin?\nThe day my evangelicalism died.\nMaybe you can't be Evangelical and Liberal?\nTactical Voting. Does it work?\nDon't tell me I can't be angry and to pray. I can do both.\nDoes Original Sin have any place in modern Christianity?\nStick with Christmas...for now.\nThere is no such thing as a 'Christian Country'.\nArchive\nMarch 2019\n(1)\n1 post\nFebruary 2019\n(1)\n1 post\nSeptember 2018\n(1)\n1 post\nAugust 2018\n(1)\n1 post\nJanuary 2018\n(1)\n1 post\nJune 2017\n(1)\n1 post\nFebruary 2017\n(1)\n1 post\nJune 2016\n(1)\n1 post\nDecember 2015\n(1)\n1 post\nNovember 2015\n(1)\n1 post\nAugust 2015\n(1)\n1 post\nJuly 2015\n(2)\n2 posts\nJune 2015\n(1)\n1 post\nMay 2015\n(2)\n2 posts\nJuly 2014\n(1)\n1 post\nSearch By Tags\nNo tags yet.\nFollow Us\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2019_02/content_28.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nTruth is power.\nA transcript of a sermon preached at Two:23, a multi-denominational LGBT+ service based at Bloomsbury Central Baptist Church, London....\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_God/content_50.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2014_07_02_what-can-amos-say-to-us-today/content_19.html": "What can Amos say to us today?\n- Andy Fitchet\n- Jul 2, 2014\n- 8 min read\nAmos of Tekoa, sometimes referred to as ‘The Prophet of Justice’[1], was a shepherd in a small town in Judah, with a mighty message from God for Israel and some would suggest for today.\nIn this essay I am going to look at the historical context in which Amos is speaking and whether there are any sociological parallels in today’s globalised society and therefore whether the prophet’s message may be relevant in the 21st century.\nAmos 1:1 sets the prophet at a time of relative security for the people of Israel and Judah, around 760BCE, during some of the longest reigning monarchs in Israelite and Judean history, however it is at a time of low devotion to God, albeit observing the sacrifices, handed down by Moses, in an attempt to appease God.\nAmos was not a statesman, politician, king or nobleman, but a shepherd. He was among the lowest rungs of society. Yet God decides to use him to pass on his judgement and anger against the people. He says in 7:14-15 ‘I am no prophet, nor a prophet’s son; but I am a herdsman, and a dresser of sycamore trees, 15 and the Lord took me from following the flock, and the Lord said to me, “Go, prophesy to my people Israel.”\nAmos was one of the earliest written prophets and brought a message that would terrify the people listening to it. The first two chapters of Amos are spent giving ‘Oracles against the Nations’, all the nations around Israel. This would have been expected of a prophet of God. God telling his people that he will bring judgment against the people who are not his people. However, where Amos differs from other prophets of the day is that he then spends the next few chapters telling of God's judgement against his people. What’s more, that yhwh may not just be the God of Israel but the God of the other nations also.\nAt the time Amos is speaking religion was closely associated to the different nations, with each nation having a god or gods that they worshiped and who they sought after to protect them from other nations and gods. Israel was no exception. There was an understanding that God was only the god of Israel. Barton says that ‘YHWH was the god who was in a relationship of mutual commitment to Israel’[3], at least that’s what Israel thought. And if their god was the god who would look after them and was committed to them, then they could do almost as they liked.\nAmos however delivers a message that God was not only the God of Israel but of all nations.\n‘Are you not like the Ethiopians to me, O people of Israel? says the Lord.\nDid I not bring Israel up from the land of Egypt,\nand the Philistines from Caphtor and the Arameans from Kir?’ (Amos 9:7).\nIf then God was not only the god of Israel but was also the god of other nations, then how they acted and what their relationship with God was like, mattered. ‘They sell the needy for silver and the innocent for a pair of sandals…’ Amos describes the depths to which the nation has reached, in chapter 2. People, according to a Biblical understanding of creation, were created in the image of God (Gen. 1:27), yet the rich and powerful of society were abusing the last and least, treating them as no more than commodities to be bought and sold at will.\nOne could suggest the poorest in today’s world are treated in the same manner. On 23rd April 2013, the Savar building collapsed in Dhaka, Bangladesh, killing 1,129 people[4] and injuring approximately 2500. Target, Primark, Mango, Kmart, Wal-Mart, Tesco and Matalan[5] are just some of the many retailers who sourced clothing and fabric from this factory. Some of the world’s largest retail companies, the rich and powerful of society, sourcing goods from unsafe factories where people are paid less then £1 per day.[6] Amos was speaking to a small part of the world in the Ancient Near East, the problem of exploitation of the poor today, reaches far beyond, into every corner of the world. Amos accused the people of selling others for a pair of sandals; today people are being paid virtually nothing so we can wear sandals. Primark, a UK company that is consistently damned for their treatment of workers, was the only company to give any aid to the workers and the families of workers who had died, including food aid and 6 months’ worth of wages whilst the factory was rebuilt.[7] Whilst not condoning the treatment of workers by Primark, and others, I do draw the stark observation that a retailer that buys a t-shirt for 5p and sells it for £2.50, gives aid and help, where as others who buy clothes for the same price and sells them for £60, does not. One could suggest that this is what Amos was talking about when he said that those who trample on the head of the poor profane his holy name. Globalised companies, those with the wealth and power to change society, exploit the poor for major profit gains, rather than using some of their increasing profits to alleviate the poverty their workers.\nOne could also argue on the other hand that society today is a more just and fair society than in any other point in history. We have more democratically elected governments than ever before, a decline from 1.9 billion people living in extreme poverty to 1.3 billion people in the last 30 years.[8] Individuals such as Bill and Melinda Gates and their foundation have worked tirelessly over the last 25 years to try and eradicate polio in the world. In 1988 Polio was an epidemic in 125 countries, today, 25 years later, because of the work that they have done, it is an epidemic in only 3.[9] Much of this is off the back of entrepreneurs, like Gates, creating great wealth and multi-national companies and then using them as a force for good.\nMotyer defines justice as the ‘correct moral practice in daily personal and social life, and righteousness is the cultivation of correct moral principle for both self and society.’[10] One could argue from the examples given that society is becoming more socially just and is cultivating righteousness. Individual people and governments are taking initiative to elevate the plight of the world’s poorest. The UK on its own has dedicated to give £11.2 billion in international aid.[11] This, however, is on a backdrop of austerity where many families, even in the UK, are finding it hard to feed themselves and pay their bills. During the Parliamentary debate on the use of Food Banks in the UK on 18th December 2013, Maria Eagle MP stated that 4.8 million workers in the UK were paid less than a living wage of £7.65 and that over half a million people now rely on Food Banks weekly to feed themselves and their families.[12]\nAmos condemns policies of governments that disproportionately affect the most vulnerable in their society. Amos, in 4:11, says “Therefore because you trample on the poor and take from them levies of grain…you have planted pleasant vineyards, but you shall not drink their wine.” Wine is consistently used as a metaphor in the Jewish scriptures as a symbol of joy and Yhwh’s blessing. Amos warns the people will not receive that joy or blessing as they put themselves, their wellbeing and their comfort above that of the poorest in society. It could be argued that that message is very much applicable today. In a nation where those on the lowest income have to pay an extra 14% rent if they have a ‘spare’ bedroom and those who earn £1 million get a 5p in a pound tax cut, Amos’ message of the withdrawal of God’s protection could be particularly apt.\nWith regard to Food Banks, nonetheless, one could argue that they are the church’s response to a social injustice and that those church’s are taking the message of Amos to heart and is doing all of can to help those at the bottom of society. The Trussel Trust, a Christian Organisation, has set up 400 Food Banks around the UK. They state that they are ‘motivated by Jesus’ teaching on poverty and injustice.’[13] Jesus would have known the teachings of Amos, he was a fierce advocate of not going through the motions, as the Israelites were doing at the time of Amos, to appease God in the way other nations tried to appease their gods, but in relationship with their God.\n‘Take away from me the noise of your songs; I will not listen to the melody of your harps.’ (Amos 5:23) Yhwh is saying here that he doesn’t want offering and music for the sake of it and that going through the rituals is not enough. We could be accused of a similar attitude to God today in the UK. We have our children christened, then confirmed, we have a wedding in a church and a funeral in one too, in the hope that by going through the motions and by doing the rituals we will appease God and then when our end comes we will get a ticket to eternal life with God. ‘But let justice roll down like the waters, and righteousness like an ever-flowing stream” (Amos 5:24). ‘Like an ever-flowing stream’ suggests whole life transformation. It suggests that the pursuit of justice and righteousness should consume us, just as fierce water flowing down a mountain consume all that is in their path.\nRevelation 3:16 states that God hates lukewarmness. His people are neither hot nor cold, but lukewarm, and so God says that he will spit them out of his mouth. We see God here again condemning those who state they are rich and have prospered, without having concern for those around them. Amos is talking about lukewarmness, he is preaching about having an attitude of ungratefulness toward Yhwh and an attitude that suggests that as long as you say the right things and offer the right things to Yhwh then all is well.\nIn conclusion, looking at the evidence presented and even seeing the great works done by so many organisations, individuals and governments to tackle social injustice around the world, one would have to come to the opinion that Amos’ message can most certainly be applied to society today.\nBibliography\nBooks\nThe Oxford Bible Commentary, (Oxford, Oxford University Press, 2001)\nJ. A. Motyer, ‘The Message of Amos’, (Leicester Inter-varsity Press, 1974)\nJ. Barton, The Theology of the Book of Amos (Cambridge, Cambridge University Press, 2012)\nW.J.Doorly, Prophet of Justice: Understanding the book of Amos. (New York, Paulist Press 1989)\nJ Barton, Amos’s Oracles against the Nations: a study of Amos 1:3-2:5. (Cambridge, Cambridge University Press, 1980)\nOnline Resources\nThe Trussel Trust, Mission and Vision’, http://www.trusselltrust.org/mission-and-vision, as viewed on 07/01/14\nMaria Eagle MP, Hansard Report on the Parliamentary Debate on Food Banks, 18/12/13, p. 808-810.\nClaire Provost and Mark Tran, Aid: How much does the UK spend?, The Guardian, 20/03/13, http://www.theguardian.com/global-development/2013/mar/20/uk-aid-spend-important-works, as viewed on 07/01/14\nBill Gates Foundation, ‘Polio, the Strategy’ http://www.gatesfoundation.org/What-We-Do/Global-Development/Polio, as viewed on 01/01/14\nSimon Moss, Global Citizen, ‘Ending Extreme Poverty…in a Generation’ http://www.globalcitizen.org/Content/Content.aspx?id=c8d76971-f218-4fcd-80b3-751239ec7b2b, as viewed on 30/12/12\nHeather Saul, ‘Primark offers compensation to Bangladesh’, The Independent, 24/10/13, http://www.independent.co.uk/news/world/asia/primark-offers-compensation-to-bangladesh-rana-plaza-collapse-victims-8901572.html, as viewed on 06/01/14\nZahid Hussain, World Bank Blog, 08/03/2010, http://blogs.worldbank.org/endpovertyinsouthasia/financing-living-wage-bangladesh%E2%80%99s-garment-industry, as viewed on 07/01/14\n[1] (Doorly, Prophet of Justice)\n[2] (Dines, Amos. 582)\n[3] (Barton, The Theology of the Book of Amos. 54)\n[4] (Sarah Butler, The Observer)\n[5] (Death Toll from Rana Plaza building)\n[6] (Zahid Hussain, World Bank Blog)\n[7] (Heather Saul, Primark offers compensation to Bangladesh)\n[8] (Simon Moss, Global Citizen)\n[9] (Bill Gates Foundation, Polio, the Strategy.)\n[10] (Motyer, The Message of Amos. 129)\n[11] (Provost & Tran, Aid.)\n[12] (Maria Eagle MP, Hansard Report. 808-810.)\n[13] (The Trussel Trust, Mission and Vision)",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2018_01_10_maybe-you-cant-be-evangelical-and-liberal/content_41.html": "Maybe you can't be Evangelical and Liberal?\n- Andy Fitchet\n- Jan 10, 2018\n- 3 min read\nMaybe you can’t be an Evangelical and a Liberal?\nI am a bit confused by Tim Farron.\nI am a proud socialist. My politics comes out of my theology, I’m a socialist because of what I read of Jesus not in spite of it. Honestly I have never known how my Conservative friends, of which I have many, sit through church services praying about the poor, give to the needy, hearing about rich people/camels and needles etc. and then go from that into a polling booth and vote the way they do.\nBut Tim Farron has me confused because I can perfectly see how he can go from one to the other, or indeed combine the both as he has done so well.\nHe had success as a political leader, witty performances on the leaders debates won him accolades, although not many political leaders kept saying ‘I agree with Tim’ like they did with his predecessor. Lib Dem MP numbers up and the Party membership growing. Yes he faced tough questions about his own stance on various moral issues. Yes there were annoyances within the Party about his personal views on issues. They happen in every political party.\nAs a good evangelical, I think Tim would have won more respect had he said what we all knew anyway, that he does think Same-Sex sexual relations are sin. Then robustly affirmed his commitment to free will. That would however have been political suicide had he done that, but political suicide seems to have happened anyway for him.\nI have often made jokes about Liberal Democrats being that ‘lukewarm’ type of person that the book of Revelation describes as ‘God spitting them out of his mouth.’ Neither left nor right, neither here nor there, just comfortably in the middle. Of course, this is a joke. Promise.\nI would describe myself as an affirming Baptist (you could say Christian – but we know Christians love a good label). I agree with the tenets of evangelical Christianity: regard for the Scriptures, personal salvation, focus on the work of Christ and active faith sharing. None of these, as far as I can see, go against liberal values – unless you interpret them in a certain way. Christianity in this vein can lead to it becoming a moral guidebook rather than a world-transforming love movement kicked off by the one who is Love.\nPersonally, I am far more interested in how you vote than what you think. I am far more interested in a Prime Minister who openly states her Christian Faith and then goes and votes that houses don’t ‘need to be fit for human habitation’ or votes through cuts to disability benefits that lead to the suicide of hundreds of people. Rather than an evangelical who may think some acts are sin but that the commitment to free will far outweighs that view.\nPart of my/our Baptist heritage is a commitment to the freedom of religion. All people should be able to worship their god or not worship at all, without hindrance because, as the early Baptist’s put it; ‘Religion is betwixt God and man, not man and the King.’\nI want to extend that to say as Baptists we need to defend freedom of choice. To debate well and disagree well. Our politics is broken because we have forgotten how to disagree well by still loving people even though you are poles apart.\nHow I wish Tim had said in his statement ‘I have found it hard to reconcile being a political leader and a faithful evangelical’…rather than a faithful Christian. Because Christians like me, who love Jesus and at the same time absolutely affirm LGBTI people have now another hurdle to jump, in trying to say ‘We read the scriptures differently, we affirm your humanity/sexuality/gender.’\nIt’s a hurdle I am willing to jump, but it’s one I wish wasn’t there.\nFor Tim, he must have done what he believed he should do, for that I respect him but my hope is that rather than shying away from beliefs we can robustly defend them and continue to love one another, for in doing so, they will know who’s disciples we are.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_07_23_can-missional-communities-be-baptist/content_47.html": "Can Missional Communities be Baptist?\n- Andy Fitchet\n- Jul 23, 2015\n- 10 min read\nCan missional communities be Baptist or are they by very nautre extra-denominational?\nChurch decline in the UK has been a common pattern across nearly all denominations and churches over the last 20-50 years. Average weekly attendance at the Church of England was 1,091,484 in 2011 this is down from 1,205,000 in 2000, a decrease of over 10,000 per year in the last 10 years[1]. This pattern is similar in other Christian Denominations. Within Baptist churches membership between 2005 and 2010 dropped from 207,777 to 197,871[2]. This has lead many churches to look at how they are doing, or not doing church, to see how they can respond to the society they are in, which their current ways of doing church are not reaching. The Church of England in 2004 launched ‘Fresh Expressions’. ‘Fresh Expressions’ is a network within the Church of England and Methodist Church which seeks ‘a new form of church for a fast-changing world that serves those outside the existing church, listens to people and enters their culture, makes discipleship a priority and intentionally forms Christian community.”[3] Similarly within the Baptist Union of Great Britain, or Baptists Together as it has recently been rebranded, the ‘Pioneer Collective’ was set up in 2012 for those within Baptist structures ‘whose calling is to go beyond the walls of the church to intentionally and creatively respond to the spiritual needs of our society.’[4] Pioneer Collective has a vision of sending 400 pioneers to set up new ways of doing church.\nAs we can see, there is a growing movement within the UK across all denominations to respond to society in a different way churches have historically. My questions is then, what do these new expressions, these missional communities[5], have to do to become a Baptist church or Baptist expression?\nMany, quite rightly, may think that baptism is a key distinctive for Baptists. That baptism by immersion is one of the staples of being a Baptist church; after all, it is the name of the denomination. However, this is not something that is solely practiced by Baptist churches. Stephen Holmes in his book ‘Baptist Theology’ writes this:\n‘Most Christians in the modern West, if asked what was distinctive about Baptist church life, would probably point to believer’s baptism. However, this practice is neither unique to Baptist churches nor at the heart of their understanding of what it means to be the church.’[6]\nAlthough recognising that Believers baptism, that is Baptism for those who profess Christ as their Lord and Saviour, is vital and central for Baptists, Holmes wants to suggest that there is something about the way in which Baptists organize the church that makes them Baptist. Early Baptists reacted against the control of church teaching being dictated by the Bishops, the state and the King. Thomas Helwys in his book ‘A Short Declaration of the Mistery of Iniquity’ (1612) writes:\n\"If the Kings people be obedient and true subjects, obeying all humane lawes made by the King, our Lord the King can require no more: for men's religion to God is betwixt God and themselves; the King shall not answer for it, neither may the King be judge between God and man.’[7]\nHelwys here argues that anyone can go to God and not have to go through neither priest nor King and that faith is between the individual and God and should not be organised by the state. This understanding that the church should be wholly under Christ and not the King is worked out in the ‘First London Baptist Confession’ of 1644. The confession reads in section 10:\n‘Jesus Christ only is made the Mediator of the New Covenant, even the everlasting covenant of grace between God and man…and be perfectly and fully the Prophet, Priest and King of the Church of God for evermore.’[8]\nThis is a key understanding for Baptist life. What is claimed in this confession is that the King has no authority over the church, as Christ is the true King. In the UK, although now it is only a ‘rubber-stamping’ exercise, the Monarch appoints the Bishops and Archbishops in the Church of England. This mean that back in the time of the early Baptists the King could appoint supporters of themselves and people to the office of Bishop and Archbishop who they waned to. The Bishop may feel they owe the King for putting them in that position and so they may put the interests of the King and state first rather than that of the Church.\nEarly Baptists believed, because no one had to go through someone else to get to God, that all believers were able to discern the mind of Christ and appoint those who they felt God wanted to lead the church, rather than a higher power doing it for them. Section 36 of the London confession reads:\n‘XXXVI. That being thus joined, every Church power given them from Christ for their better well-being, to choose to themselves fitting persons into the office of Pastors, Teachers, Elders, Deacons, being qualified according to the Word, as those which Christ has appointed in His Testament, for the feeding, governing, serving, and building up of His Church, and that none other have to power to impose them, either these or any other.’[9]\nStephen Holmes sums this up in more modern language when he writes:\n‘A major ecclesiological distinctive shared by Baptists is congregational church government. This is the doctrine that the church is formed and led by mutual agreement of all its members. It does not need the authorisation (as from Bishop or presbytery) to be a true church of Christ, nor does it cede its affairs to a priest or a group of elders.’\nThis is the key distinctive of a Baptist church, established or missional. For Baptists the understanding that we are a priesthood of all believers (1 Peter 2:9), that all members of a local church has not only the right but ability to discern the mind of Christ on all matters of the church, from mission to finance, is crucial. I would argue that without this specific distinctive, of congregational government, one couldn’t claim to be a Baptist church. This leads me to the question, how would this work out in a missional community or pioneering expression of Church?\nI pastor a pioneering expression of church. I work among some of the poorest and most marginalized people in my community from various faith backgrounds and cultural backgrounds. We meet in a home church, 8-10 people gathered in a living room to share food and read the Bible and discuss it together. The community did not appoint me as their pastor, I turned up and gathered a community, the youth group did not appoint me as their youth worker, I turned up and gathered a community. This, then, doesn’t seem very Baptist. However I would argue it is it just doesn’t look like the normal model. In a traditional Baptist church, to work out their understanding of Church government, the church will normally hold members meetings, anywhere from 4 to 12 a year. During these meetings, if done well, a church will agree financial policy, missional aims, appoint leaders of the church and discuss other matters as they arise. In a missional community, this can be a difficult model to follow. Many missional communities, such as mine, have a much more fluid, diaspora community. Where people will commit for a short while then leave for a short while, before, usually repeating that cycle again. It is however my experience that in these small gatherings it is easier to enable the community to own and not just be apart of the decision-making, but be the decision makers themselves. We do not have church meetings every other month, but every week, they aren’t however labeled as church meetings. Every week we look at how we can impact the community around us, we share the teaching and leading of the group amoungst ourselves and collectively appoint people to lead certain projects within the wider community and if/when I move on, the community will hopefully continue to run in a similar way.\nOn further from that, the priority of the church meeting is to discern the mind of Christ together. In Baptist thought, the idea of the church meeting is not to express personal preference and to act in a democratic way but in a Christocratic way, that’s to say it is not the ‘rule of the people’ but the ’rule of Christ’. The purpose of the church meeting is to seek the rule of Christ for the local church. Holmes, on the church meeting, writes:\n‘The church gathers corporately to seek to hear its Lord’s voice and to commit itself to obey what it has heard. Where is it practiced, the insistence on finding consensus in a church meeting reflects this: church members are called to submit themselves to the will of Christ, not to indicate their own preference and desire’[10]\nI have experienced in church meetings, in their traditional format, that people often try to take control of the meeting or want to express their view in a way, which is not constructive but damaging. It has been clear to me that personal preferences not the mind of Christ is being promoted. This, I would argue, is because church members are only given small amounts of time to reflect and pray about the issues being discussed and they may feel that having a say on church matters only 4 times a year means they only have limited time to express corporately their feelings. Dr Nigel Wright in his series commissioned by the Baptist Union of Great Britain, ‘Baptist Basics’, writes of the church meeting:\n‘Church Members meetings do not always get things right. Since we are all limited, seeking the mind of Christ does not guarantee infallibility. We only ever operate within the light we have and that means we can be wrong’[11]\nWhenever flawed people gather to try and understand the workings of a perfect God, people will get things wrong. However I feel that in the way we conduct congregational government within our missional community, there is less damage when people do get things wrong. Upsets and disagreement, if handled badly, can lead to church splits. If though, like we do, one has constant dialogue, discussing issues frequently and openly with much time for prayer before, during and in between discussions, the mind of Christ can be discerned much more effectively than by gathering just 4 times a year.\nThe other distinctive I believe a local missional context must have to become a local Baptist church is that of a committed focus on discipleship leading to mission. This flows out of the community, as we have discussed, discerning the mind of Christ together. Holmes writes:\n‘”Visible saints, walking together in the ways of the Lord and watching over each other’: this definition of holiness is irreducibly corporate. Specifically, Baptists find sanctification within the community of the local church and not elsewhere’[12]\nHolmes argues that we have a duty as Baptist Christians to ‘walk together in the ways of the Lord’ to help one another in the faith and care for one another. This understanding is the crux of Christian discipleship in Baptist understandings. The church corporate, the body of Christ with the ability to seek the mind of Christ, is there to encourage one another and help one another into deeper discipleship of Christ. Many Christian traditions focus on withdrawal as a key element to deeper discipleship. One need only to think of the desert Fathers withdrawing into the desert for deeper times of prayer and solitary time with God or indeed the rise of retreat days and weeks over the last 10 years, where people withdraw from the day to day to spend time alone with God. Baptists, however, acknowledging that these practices can be useful, want to have a focus on the gathered body helping one another to follow Christ more closely. Holmes, writing on Baptist discipleship, writes:\n‘God, for Baptists, is encountered and known in a gathered community and, indeed, by a gathered community; the lone believer is at least profoundly disadvantaged in his or her discipleship.’[13]\nThis close community and focus on discipleship is not however just for the sake of the individual believer but so that they can be strengthened and encouraged in Mission. Paul Beasley-Murray in his book, Radical Believers, wants to argue that mission is intrinsic to what it means to be a Baptist:\n‘Evangelism is part of the Baptist way of life. It is significant that in the relatively brief ‘declaration of principle’, adopted by the Baptist Union of Great Britain as its basis of union, the third and final principle declares: ‘It is the duty of every disciple to bear personal witness to the Gospel of Jesus Christ, and to take part in the evangelization of the world’ [14]\nWe see here from the end of the Declaration of Principle the focus on being a disciple, that deep following of Christ, which leads to taking part in sharing the gospel, the focus on mission. This can and will look very different for each believer but it is still the responsibility of each believer to do. I believe that this commitment to deep discipleship and mission is in many ways much easier for missional communities to live out. It is their sole aim, usually, to be missional. At my community everything we do as a community and in our individual lives is to bring glory to Christ and introduce people to him. We have an understanding that Christ sends all his people to ‘do the work of the evangelist’ (2 Tim 4:5) and to help people once they have made a commitment to follow Jesus to do that themselves in a way which suits their personality and their gifting’s. Early Baptist William Carey, known as the pioneer of the modern missionary movement[15], saw mission as vitally important to the Baptist way of life and travelled to Kolkata, India in 1793 to preach the Gospel to the people of India, after setting up ‘The Particular Baptist Missionary Society for the Propagation of Gospel amongst the heathen’ in 1792[16]. This missionary body was formed almost 100 years before the current Baptist Union of Great Britain was formed in 1891[17]. We can see from this that Baptists from their earliest beginnings were committed to mission, to sharing the good news of Jesus anywhere they felt God wanted them to. Concluding his section on mission, Beasley-Murray writes:\n‘Baptists are unashamedly a missionary people. They have always been passionately concerned with sharing their faith and to demonstrate Gods love for all.’\nTo conclude, it is my firm belief that for any missional community to become a local Baptist church they must be committed to mission and discipleship, but that the mission of that local community must be decided by the local church and through being governed by the members of that local community they seek the mind of Christ for that local community.\n[1] ‘https://www.churchofengland.org/about-us/facts-stats/research-statistics/statistics.aspx’ as viewed on 18/03/15\n[2] http://www.ethicsdaily.com/statistician-british-churches-will-continue-to-decline-cms-18166-printer As viewed on 18/03/15\n[3] https://www.freshexpressions.org.uk/about, as viewed on 18/03/15\n[4] http://www.pioneercollective.org.uk/ as viewed on 18/03/15\n[5] When using the term “Missional Community’ I mean a community of Christians that ‘do’ church differently to an established church that generally meet in a church building on a Sunday.\n[6] Holmes, S. Baptist Theology, T&T Clark, London, 2012, 89.\n[7] Helwys, A Short Declaration of the Mistery of Iniquity, 1612. (Mercer University Press, Georgia 1998, 53.)\n[8] http://baptiststudiesonline.com/wp-content/uploads/2008/10/1st-london-1644-ed.pdf as viewed in 18/03/15\n[9] http://baptiststudiesonline.com/wp-content/uploads/2008/10/1st-london-1644-ed.pdf as viewed on 18/03/15\n[10] Holmes, 102.\n[11] Wright, N. Baptist Basics: The Church Members Meeting, BUGB, Didcot, 2009, 5.\n[12] Holmes, 155.\n[13] Holmes, 155.\n[14] Beasley-Murray, P. Radical Believers, The Baptist way of being Church, BUGB, Oxfordshire, 2006, .125.\n[15] Ibid. 125.\n[16] http://www.bmsworldmission.org/about-us/our-heritage/origins/william-carey, as viewed on 19/03/15\n[17] http://www.baptist.org.uk/Groups/220596/Baptist_History.aspx, as viewed on 19/03/15",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_christian/content_38.html": "top of page\nFeatured Posts\nBlog and ramblings\nDon't tell me I can't be angry and to pray. I can do both.\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be...\nStick with Christmas...for now.\nSo I have spent a long time reflecting on Christmas this year and trying to write what seems like a million sermons which all bring...\nThere is no such thing as a 'Christian Country'.\nThere is no such thing as a Christian Country. ‘We are a Christian Country…’, ‘Last time I checked we were a Christian Country…’, ‘That...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_sin/content_35.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_baptist/content_20.html": "top of page\nFeatured Posts\nBlog and ramblings\nDon't tell me I can't be angry and to pray. I can do both.\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be...\nStick with Christmas...for now.\nSo I have spent a long time reflecting on Christmas this year and trying to write what seems like a million sermons which all bring...\nThere is no such thing as a 'Christian Country'.\nThere is no such thing as a Christian Country. ‘We are a Christian Country…’, ‘Last time I checked we were a Christian Country…’, ‘That...\nCommunion: Who can come to the table?\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_06_10_assisted-dying-bill-can-the-bible-support-it/content_52.html": "Assisted Dying bill. Can a Christian support it?\n- Andy Fitchet\n- Jun 10, 2015\n- 11 min read\nUpdated: Oct 22, 2024\nLord Faulkner of Thoroton is a Labour life peer in the UK’s House of Lords.[1] In June 2014 Lord Faulkner set before the House of Lords his ‘Assisted Dying Bill’. This bill follows many similar Bills tabled before both Houses of the UK Parliament, most notably Lord Joffe’s ‘Assisted Dying for the Terminally Ill Bill’ tabled in 2004. All previous attempts to introduce any change in the law to allow for either Assisted Suicide or Euthanasia have been unsuccessful. Lord Faulkner’s new bill does not allow for Euthanasia, someone wishing to end their life without having a life threatening illness, it only allows for those who are terminally ill to be assisted in ending their own life. The Bill defines those who are terminally ill as those who:\n‘(a) Have been diagnosed by a registered medical practitioner as having an inevitably progressive condition which cannot be reversed by treatment (“a terminal illness”); and\n(b) As a consequence of that terminal illness, is reasonably expected to die within six months.’[2]\nThis illness must also be, under Section 3, B, i & ii, signed by two medical practitioners, one of whom must not be a relative of the patient or a colleague in the same practice or clinical team as the other practitioner[3]. The person wishing to end their own life with assistance must also be able to consent to the action being taken and must have the capacity to make the decision themselves[4]. There must also be a period of 14 days between the original declaration to a medical professional that a patient wants to end their life and the medication to do so being administered[5]. These precautions are put in place to stop either non-terminally ill people, people who may have a debilitating but non-life threatening illness or those who may just no longer wish to live, from being able to take their own lives with assistance. They are also in place to stop any patient from ending their life due to pressure put on them by any family member or healthcare professional.\nThe Assisted Dying Bill does not make provision for any medical professional to administer the medication, which will lead to the patient’s death, to the patient. The medical staff may only prepare the medication, give advice to the patient on how to take the medication or help the patient to inject or otherwise self-administer the medication.[6] One must draw attention to Section 5 of the Bill, ‘Conscientious Objection’. No medical professional will be obliged to carry out the wishes of a patient who wants to end this their life under this act if that medical professional has a ‘conscientious objection’ to it, similar rules exist within abortion legislation in the UK.\nIt is my opinion, as someone involved in local and national political structures, that whether this version of the Assisted Suicide Bill or one with amendments from the committee stages of our parliamentary processes, that within the next parliament, there will be some legislation on assisted suicide passed and receiving Royal Assent. This leads us then to see whether or not there could be any Biblical case to support such a move.\nIt has long been the case that Christians have not been in favour of suicide, assisted suicide or voluntary euthanasia. This thought comes from an understanding of the sanctity of life, whereby it is God who creates life and only God has the right to take life away. Genesis 2:7 reads ‘then the LORD God formed man from the dust of the ground and breathed into his nostrils the breath of life, and the man became a living being.’ It is this basic understanding that it is the breath of God, the very essence of God himself in humankind, that separates us from the animals and makes us capable of a relationship with God, since, as we read in the previous chapter, we ‘are made in His image’ (Gen 1:26). The sanctity of life is an argument used when discussing many issues around life and death, such as Euthanasia and Abortion.\nProponents of this view will use scriptures such as Psalm 139: 13 ‘For it was you who formed my inward parts; you knit me together in my mother’s womb’, to argue that God created our lives and therefore they are sacred so we must do all we can to protect them. Professor John Wyatt of UCL, on the sanctity of life, writes:\n‘…in Christian thought, the dignity of a human being resides not in what you can do, but in what you are, by creation. Human beings do not need to earn the right to be treated as Godlike beings. Our dignity is intrinsic, in the way we have been made’[7]\nThis sums up one the main criteria as to why many Christians are against Abortion, Euthanasia and suicide, because human life has intrinsic worth, and nobody is able to determine otherwise, not even the person who the life belongs to. It is as if, somehow, life is on loan from God and is not really our in the first place, we are only custodians of it, rather than owners of it.\nThere are times in the Bible when assisted suicide happens. Suicide as a concept is mentioned 7 times in the Bible. Abimelech in Judges 9, Samson in Judges 16, King Saul in 1 Samuel 31, Saul’s armour-bearer in 1 Samuel 31, Ahithophel in 2 Samuel 17, Zimri in 1 Kings 16 and Judas Iscariot in Matthew 27. 5 of these were conventional suicides (Judas, Zimri, Saul’s Armour Bearer and Ahithophel) and 2 were assisted suicides, Saul and Abimelech. It is the final two I will focus on. Abimelech was a son of the Judge, Gideon. Abimelech was hungry for power and wanted to become the King of his mother’s people in Shechem. He went to great lengths to gain power and even murdered his brothers so no one would challenge his position:\n‘He went to his father’s house at Ophrah, and killed his brothers the sons of Jerubbaal, seventy men, on one stone; but Jotham, the youngest son of Jerubbaal, survived, for he his himself’ Judges 9:5\nAfter this event they made Abimelech king and he ruled over Israel for 3 years (Judges 9:22). The people began to revolt against Abimelech and tried to rid him as their King. Abimelech took his army and camped outside Shechem and he ambushed his people and killed them. After this Abimelech travelled to Thebez to try and take the city, he came to the tower of city and tried to burn it to the ground. A women was in the tower and threw a rock out of the tower which struck Abimelech and crushed his skull. Abimelech would have died painfully of his injuries, but before he does he asks his armour-bearer to\n‘”Draw your sword and Kill me, so people will not say about me, ‘A women killed him’“ So the young man thrust him through, and he died’ Judges 9:54.\nNo comment is given as to whether this was a sinful act or not, simply that it happened. The writer does note that ‘God repaid Abimelech for the crime he committed against his father in killing his seventy brothers’ Judges 9:56. Here we find a King, albeit not a popular one, who has considerable injuries who will not survive for much longer, his existence from that point on, until death, will be extremely painful. We do not get the impression that Abimelech wanted to be killed because of his injuries, but more because of pride. This does however show us a time of someone asking someone else to help him or her die. What this story doesn’t do is make a clear statement on whether the death of Abimelech or the actions of the armour-bearer was sinful or not.\nThe second time we encounter an assisted suicide in the Bible is in the story of King Saul in 1 Samuel 31. Saul is fighting a battle against the Philistines; the Philistines killed all of Saul’s sons and Saul had been badly injured by the battle. Again, similarly with Abimelech, we have a king who has been injured, most probably wont survive his injuries, and is in a lot of pain. Saul asks his armour bearer, “Draw your sword and thrust me through with it, so that these uncircumcised may not come and thrust me through with it, and make sport of me” 1 Samuel 31:4. Here in 1 Samuel 31 the armour-bearer refuses so Saul ‘falls on his sword’ (1 Sam 31:4), however in the next chapter, and book, when the death of Saul and Jonathan is being reported to David we read:\n“David said to him, “How did things go? Tell me!” He answered, “The army fled from the battle, but also many of the army fell and died; and Saul and his son Jonathan also died.” Then David asked the young man who was reporting to him, “How do you know that Saul and his son Jonathan died?” The young man reporting to him said, “I happened to be on Mount Gilboa; and there was Saul leaning on his spear, while the chariots and the horsemen drew close to him. When he looked behind him, he saw me, and called to me. I answered, ‘Here sir.’ And he said to me, ‘Who are you?’ I answered him, ‘I am an Amalekite.’ He said to me, ‘Come, stand over me and kill me; for convulsions have seized me, and yet my life still lingers.’ So I stood over him, and killed him…’ 2 Samuel 1:4-10\nWe see from this account of the death of Saul that after asking to be killed, Saul indeed was assisted in being killed. Whichever account we take to be accurate, in both accounts Saul was pleading to be killed by someone else. Again, in the account, as with the Abimelech, there is no judgment given either to the person wanting to be killed or the person doing the killing. What one cannot escape that both of these deaths happened in battle. It seems that for those who would want to argue for the sanctity of life, the must also argue that war is wrong, as both end with people being killed. If one cannot kill oneself, as we are made in the image of God, or assist another person to kill oneself, then following through with that logic, one cannot agree with war, as the person we are killing is also made in the image of God.\nThe Early Church father Augustine, wrote about many areas of Christian doctrine and in his book, City of God, he writes about suicide:\n‘It is not without significance, that in no passage of the holy canonical books there can be found either divine precept or permission to take away our own life, whether for the sake of entering on the enjoyment of immortality, or of shunning, or ridding ourselves of anything whatever. Nay, the law, rightly interpreted, even prohibits suicide, where it says, “You shall not kill.” ‘[8]\nIt is also Augustine who is credited with creating a theory of Just War, whereby one, as long as in proper authority, can declare war on another for reasons of creating peace where there isn’t peace already. This seems at the very least confusing, one is able to take another’s life in the act of war, but one is not able to take ones own life, even if one is in incredible pain and has no quality of life.\nBoth accounts of assisted suicide are found in the Old Testament. One cannot look for a Biblical basis without looking at the teachings of Christ. Christ doesn’t mention suicide, he does speak, though, in length about life. Jesus says in John 14:6 says that He is life. In John 10:10 Jesus says, “The thief comes only to steal and kill and destroy. I came that they may have life and have it abundantly.” Jesus, when asked what the greatest commandment of the Law is replies that one should love God, but that also that “You shall love your neighbour as yourself.” (Matt 22:39) How then does one love one’s neighbour when one’s neighbour is in great pain and suffering, whilst at the same time, offering the hope of life in all of its abundance? For Christ, life wasn’t just about what happens when you die. Many evangelical Christians who I know are only focused on what happens to people when they die. The goal is to get people to ‘say a prayer’ by which means they will be saved for eternity. This doesn’t correlate to what I see Jesus doing during his ministry. In Matthew 14 when Jesus is speaking to a multitude, he is not just interested in their spiritual lives, but also their physical well-being, so with 5 loaves and 2 fishes he feeds them. When speaking to his disciples in Matthew 25 about the Last Judgement he says:\n‘Then the king will say to those at his right hand, “Come, you that are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world; for I was hungry and you gave me food, I was thirsty and you gave me something to drink, I was a stranger and you welcomed me, I was naked and you gave me clothing, I was sick and you took care of me, I was in prison and you visited me.” Matthew 25: 34-36\nWe see Jesus again talking about people’s physical well-being and by looking after one’s neighbours physical well-being, one is also looking after Christ himself. For Christ life in abundance was a life of contentment and joy in this life as well as the next. So what then, if someone in this life, is not capable of living life in abundance because of great illness and diminished well-being? One could argue that because we all have free will, that person is able to do with their life what they wish and that through love of ones neighbour, because it is their wish and will, one could assist that person so they will leave this life and enter another one of endless joy and abundance, within the Christian understanding of life after death. One could also argue that life was never promised to be easy, but that we would face sickness and death as part of this life. Therefore with the hope of life eternal one must live with that hope and bear all that life brings.\nOne could also argue that with the advances of medical science, particularly in the western world, we prolong life, which is, I would add, inherently good. At the time of the Biblical writers one would have simply died from illnesses we now see as minor or manageable now, such as a broken limb, contaminated water, malaria, heart attack to name but a few. The Bible never deals with complicated modern medical conundrums, it can’t. That leaves us then to look at the principles of what scripture teaches. Those principles, in this situation, for me, would be.\n1. Life is good because God creates it.\n2. Every person has free will to choose what to do in this life.\n3. Jesus wants to give us life in abundance and cares not only about our spiritual life after death but about our physical ones here also.\nIt is within the principles that one must look at situations regarding modern medical science and indeed the rights of each human being to live a life of abundance in a way that is honouring to Christ.\nTo conclude then, can one Biblically support the concept of assisted dying, yes, and in the same breath no. I believe the Bible is wholly unclear on this issue either way, as it depends on how one interprets particular scriptures and what texts are prioritized over others. On from that, can a Christian support Lord Faulkner’s Bill with confidence that they are being faithful to scripture, I believe one can because this bill is about a person’s free will and compassion for someone who will have no or very little physical well-being.\nBibliography\nBooks\nThe Oxford Bible Commentary, Oxford, Oxford University Press, 2001\nWyatt. John, Matters of Life and Death, Nottingham, IVP, 2009\nSloyan. Gerard, Interpretation; A Bible commentary for Teaching and Preaching: John, Loiusville, John Knox Press, 2009.\nGreen. Michael, BST; The Message of Matthew, Nottingham, IVP, 2000\nOnline Resources\nLord Faulkner, Assisted Dying Bill 2014-15. http://www.publications.parliament.uk/pa/bills/lbill/2014-2015/0006/lbill_2014-20150006_en_2.htm#l1g1 as viewed on 23/03/13\nAssisted Dying, Dignity in dying, http://www.dignityindying.org.uk/assisted-dying/lord-falconers-assisted-dying-bill/ as viewed on 22/03/15\nLord Faulkner, http://www.parliament.uk/biographies/lords/lord-falconer-of-thoroton/2758 as viewed on 18/03/15\nAugustine, City of God, http://www.newadvent.org/fathers/120101.htm, as viewed on 23/03/15\nChristians for Euthanasia, http://christiansforve.org.au/ as viewed on 22/03/15\n[1] Lord Faulker of Thoroton, http://www.parliament.uk/biographies/lords/lord-falconer-of-thoroton/2758, as viewed on 18/03/15\n[2] Lord Faulkner, Assisted Dying Bill 2014-15, Section 2. http://www.publications.parliament.uk/pa/bills/lbill/2014-2015/0006/lbill_2014-20150006_en_2.htm#l1g1 as viewed on 23/03/15\n[3] Ibid, Section 3, 1, B, i & ii.\n[4] Ibid, Section 3, 3, B & C.\n[5] Ibid, Section 4, 2, D.\n[6] Lord Faulkner, Assisted Dying Bill 2014-15, Section 4, 4, A-C. http://www.publications.parliament.uk/pa/bills/lbill/2014-2015/0006/lbill_2014-20150006_en_2.htm#l1g1 as viewed on 23/03/13\n[7] Wyatt J, Matters of Life and Death, IVP, 2009, .55\n[8] Augustine, City of God, book 1, http://www.newadvent.org/fathers/120101.htm, as viewed on 23/03/15",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2018_09_06_is-capitalism-sin/content_5.html": "Is Capitalism sin?\n- Andy Fitchet\n- Sep 6, 2018\n- 8 min read\nWhat is the perfect life? What does society around you project as being the idyllic lifestyle? Nice house, nice car, loving spouse, perfect children, tidy garden, laughing friends, holidays to white sandy beaches, all the latest technology…I could go on.\nThe question, Is Capitalism Sin?, seems like the perfect question for theological/political pontification. Without a practical outworking it can seem as one of those pointless questions academics debate, like how many angels can you fit on a pin head, which may have no relevance to the wider world. However, that depends on the answer. If the answer is yes, then that has ramifications for life. If no, then we keep calm and carry on, to borrow a phrase.\nCapitalism is reasonably easy to define. It’s the system of economics where primarily private enterprise owns the means of production for the creation of individual wealth. The means production being concentrated in the hands of a few, as opposed to say a socialist economic model where the means of production, and therefore the wealth created, is in the hands of those producing the goods.\nSin, though, that’s a bit more complicated to define. For 2000 years the church has debated what sin actually is, how it exists within humanity, whether it is passed down through the generations with original guilt, what it’s starting point was and indeed if there was a starting point at all. Around the 4th Century St Augustine had solidified his view that sin was passed down through the generations from Adam and Eve. This was the individuals curse which repentance would cure. In the City of God he writes, ‘Even the infants are, according to the true belief, born in sin, not actual but original, so that we confess they have need of grace for the remission of sins.’ This understanding of sin stuck within the Western Latin church (broadly from which English-speaking churches originate) and sticks through to this day, particularly within the evangelical church.\nIf we go back further to one of the earliest church fathers, Irenaeus of Lyon, disciple of Polycarp who was a disciple of John the Apostle, he had a view more much less of inherited sin but rather that sin was a choice. Sin not inherently intrinsic within humanity through sex and procreation, but by free will. In his works Against Heresies, he writes in Chapter 12 ‘Men are possessed of free will, and endowed with the faculty of making a choice. It is not true, therefore, that some are by nature good, and others bad.’ Which doesn’t seem to fit with Augustine’s later pronouncement that we are all born sinful.\nDuring recent history certain sections of the church have focussed solely on the individual nature of sin, that which the individual does wrong – and each section of the church shall define wrong in a different way. Liberation Theologians from the 1960’s onwards called out societies structural sin, manifesting itself in the oppression of the worker. This was however denounced by the Roman Catholic church, particularly by the then Cardinal Ratzinger, latterly Pope Benedict XVI, as being to close to Marxism.\nAs we can see, sin has been, and is, defined in different ways by different theologians and Christians as we try to work out life and the universe. I want to define sin as that which doesn’t look like God.\nI want to define sin as that which doesn’t look like God.\nWhatever God is like, if that doesn’t happen – that is sin. Without getting into debate about where it comes from (my essay ‘Is there any place for the doctrine of Original Sin in modern Christian anthropology?’, will give you my answer to that!) this definition of sin allows there to be both an individualistic nature to sin and a structural/societal nature also.\nSo what does sin within the individual look like? My understanding of God in Christ leads me to worship a God who is loving, kind, parental, self-sacrificing and putting the needs of others above that of self. With my definition of sin, this means that if those things don’t happen, that’s sin; hate, harm, abuse and self-centredness.\nThen what does that mean for an economic system? If God is those things; loving, kind, self-sacrificing etc. Does it follow suit that the way we organise ourselves in society need reflect that?\nThe answer seems to be multi-layered. On the one hand, of course! If we claim God to be the source of all life and perfect then why wouldn’t we want to try and create a society that looks like that? On the other hand, not everyone believes in God or in this sort of God, one cannot simply impose upon people a system based on one’s particular understanding of God. Also, we are not God. Surely, it is at best feeble to pretend we can get anywhere near that?\nEven with these arguments against, most of humanity, I would suspect, would be in favour of living in a society that lives up to the ideals of being loving, kind and putting others first, therefore creating society like that doesn’t hinge on each individual having to believe in a God like that. And feeble? Perhaps. But does that discredit attempt?\nHow does capitalism thrive? How does it work? I would argue it thrives on greed and on selling ‘idyllic’ lifestyles for people to strive towards. Think of the ‘perfect life’ from the start of this article. Major companies, like Apple, don’t really sell phones and laptops anymore. Apple were the innovative ones, the edgy ones, the pioneers but have become slaves to their own success. They can’t do ‘edgy’ anymore or they risk losing their base, getting it wrong and losing out to competitors. So what do they sell? A lifestyle. A life where everything is connected, where you look amazing running beside the beach in LA with your wireless headphones in (who needs a headphone jack anyway) and you are tanned, ripped, and beautiful. You go back to your clutter free house, drink THE best black coffee and work at a desk with nothing but the thinnest laptop on it. And life is good. Not quite the same when sat at a bus stop with your wireless headphones in, in the rain in Basingstoke, working 9-5 for a company reclaiming PPI. I mention Apple not because they are worse or better than anyone else, I just think they are the best at selling the lifestyle.\nI’m sat here, in my flat in rural southern England typing on a Japanese Laptop, checking American based social media on my Chinese phone, wear a t-shirt made in Bangladesh, before I jump into my Japanese car and drive to a German supermarket to by some French bread to have with my Italian soup. Capitalism thrives on greed. More than that though it thrives on exploitation. My question is, where did all this stuff come from?\nModern technology is incredibly difficult to make. The minerals required to sustain the batteries and the hardware are incredibly difficult to mine and incredibly dirty to mine. They also happen to be in abundance in places where there is civil and military unrest, the central belt of Africa for example. Your phone may be designed by someone who is well payed, maybe even knighted, but who it is made by? How much are they paid? Where were the resources from that phone bought from? Were they bought at all or were they ‘acquired’?\nThe same can go for classic example of chocolate or clothing. Who picked the coco beans or the cotton? How much were they paid? If we buy a cheap 100g bar of chocolate from a supermarket that’s not Fairtrade/UTZ/Rainforest Alliance or a t-shirt for £2.50, the reality is they were probably made by slaves or at least other human beings exploited in forced labour or working in life-threatening conditions. Just think of the Rana Plaza textile factory collapse in Bangladesh in 2014.\n‘I want’ is the lifeblood of capitalism and ‘I need’ is the cancer. I need this new xxx. Do we really need more stuff? Do we really need that shinier thing? Why? What is missing that makes us need to fill our lives with stuff? Within capitalism those questions are brushed aside because that would lead to the downfall of the system itself. If people stopped buying stuff they didn’t need, the system would collapse. So keep buying it, after all, you work hard, you deserve that new thing. My question is, does the person making it deserve it too?\n‘I want’ is the lifeblood of capitalism and ‘I need’ is the cancer.\nA very wise and close friend said to me recently when mulling over the state of the world over a cup of tea (don’t worry it was Fairtrade), ‘I have got to a place where I think to myself, is my need for that chocolate bar greater than the need of person who made it to be free?’\nIs my need, greater than their freedom?\nIs buying this thing being loving, kind and self-sacrificing towards the person who made it? The answer is probably no and if the answer is no, then, according to my definition, that’s sin. Why? Because that greed and desire of ours perpetuates the slavery of others.\nCapitalism also only thrives on the exploitation of others by always paying people less then the value of the goods they produce. If I am a company owner, I employ people to make something to sell, in order for me to make a profit and become rich from that, I have to pay the workers less than their value, or I won’t make a profit. I exploit my workers in order to make myself richer. I may treat them well, I may give them insurances, extra holiday, pay above the minimum wage but in order for me to make a profit I need to pay them less than the value of that which they produce. Is that fair? Just? Kind? Loving? Self-sacrificing?\nJuxtapose that to a company that employs people and makes them co-owners in the company. The profits are shared amongst the workers. One person at the top isn’t paid an obscene amount and one person on the shop floor isn’t paid a pittance. Each of the workers takes part in the decision-making process of the company. For the worker it’s ‘our company.’ That boosts morale, that increases productivity, that in turn increases turnover and so on. Yet in this model, the worker is paid at the value of what they produce.\nWhich one seems more loving, more kind, more self-sacrificing, more Godlike? And, in pure economic terms, which was seems more sustainable for a long-term productive, enthused, hardworking workforce?\nWhat, then, about you and I? You have probably drawn the conclusion already that I do think capitalism, in its very essence is sin. So what can I do about it? How can I/we live within a system based on greed and want without being complicit within it? In some ways, we can’t. The system is what it is in other ways we can be very dissenting. We can choose not to get more stuff.\nWe can choose\nto not get more stuff!\nWe can choose to buy Fairtrade only. We can choose to keep the car just that little bit longer, because it works just fine. We can choose to keep the phone with the 0.001” smaller screen than the new one…because it works just fine. I’m not advocating we all go around wearing torn clothes, driving clapped out old bangers, playing snake on a Nokia 3310, although life was simpler then, wasn’t it? I am, however, suggesting that perhaps we need to see through the lifestyle that is sold to us as ‘perfect’. Not give into the want/need/greed cycle because somewhere around the world, another human being will be suffering because of our greed. And that is something we can do something about.\nThis Christian hope, of course, is this: sin never has the final word.\nSin never has the final word.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2018_01/content_21.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nMaybe you can't be Evangelical and Liberal?\nMaybe you can’t be an Evangelical and a Liberal? I am a bit confused by Tim Farron. I am a proud socialist. My politics comes out of my...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2018_08_16_the-day-my-evangelicalism-died/content_7.html": "The day my evangelicalism died.\n- Andy Fitchet\n- Aug 16, 2018\n- 3 min read\n'You will not turn me into a liberal!' This was my exclamation to my tutor when I was training to become a minister.\nIndeed, liberal theology didn't kill my evangelicalism – evangelicalism did that all on its own.\nI realise now that what I was grappling with was the slow death of clear-cut, easy-answer, nicely packaged Christianity that I had learnt as a teenager. We had just come out of a teaching session on sacramentalism with a bigwig in my denomination, who was trying to persuade us that there is a difference in a person's very being after ordination – something I still disagree with. That session, however, felt like the culmination of a slow hammering of my faith, as I understood it, which I was not going to allow to come tumbling down.\nI stormed into my tutor's office to exclaim to him that it wouldn't work. 'Sit down Andy, let's have a chat..'We are not here to turn you into a liberal, just a nuanced evangelical.' Nuance being the unofficial motto of my college.\nReutersEvangelical Christians voted in large numbers for Roy Moore.\nThis week, on Tuesday December 12, there was a vote for the US Senate. Not something to write home about, you would think. This vote however was incredibly symbolic. There was a choice between two white men, aged over 60. One was a judge who has been accused of sexually abusing young teenage girls. The other is a lawyer who helped to imprison members of the KKK who burnt down black churches. The answer is fairly clear cut, isn't it?\nOf course, you vote for the one accused of sexual abuse because he is anti-abortion.\nNO. No, you don't. But 80 per cent of white evangelical Christians did. People who profess to worship a bearded, homeless, Palestinian refugee, born to an unwed teenage mother...I don't get it either.\nThis group, who read the same Bible as me, sing the same songs as me, go to churches that look like mine, decided that they would rather vote for someone accused of one of the most heinous crimes because he had 'good Christian morals'. Apparently being inclusive of LGBT+ people, imprisoning white men who burn down black churches, standing up for minorities and the marginalised simply isn't displaying Christian values.\nHere lies my problem. I cannot claim to have the same Christianity as that. I cannot claim to be an evangelical when that is what it looks like. I don't really think I am a very good liberal either. This I do know, however: I don't get to decide who is in and who is out – God does. And I don't get to decide who is theologically right and who isn't, God does (although I don't think God cares about doctrine half as much as we do).\nMy evangelicalism died when I realised it was us who were setting the boundaries of salvation. When evangelicals got so caught up in issues-based faith that Jesus got lost. The Jesus we read about in scripture is the homeless man who hung around with prostitutes, fraudsters, terrorists and the marginalised. He was the Jesus who only ever, as we have it recorded, got angry at the religious people for setting the boundaries of salvation, 'You white washed tombs, you sons of hell.'\nDo I agree with my liberal friends on everything? No, of course not. But do I see them being more like Jesus than those claiming to be evangelicals? Absolutely I do.\nEvangelicalism has lost its soul and it has sold it for black and white, easily repeatable religion.\n'Who are you to say you're right?' I hear you say. Well, not me, that's for sure. I'm just a bloke muddling his way through this thing called faith who has experienced the best, and the worst, of church.\nThe best currently that I see are my friends reaching out to the those on the edge of church who are told their identity or their theology or their *insert word as you see fit* means that they are not welcome.\nThe worst I currently see are those who claim to love but in reality only love as far as their understanding of theology allows them too, which in most cases stops at white, middle class, straight, married couples with nice children.\nDid liberal theology kill my evangelicalism? No. Evangelicalism did that all by itself.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_baptisttheology/content_26.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nCommunion: Who can come to the table?\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk/content_1.html": "top of page\nANDY FITCHET\nAndy is a Minister, writer, trainer and campaigner.\nAndy the Minister of the Methodist Churches in Andover and Hungerford.\nFirst elected as a councillor in 2010 and was a Labour Candidate for parliament in North West Hampshire in 2017 and 2024.\nAndy writes and delivers training resources on EDI, youth work and theology.\nAndy is regularly invited to preach and speak in churches, Cathedrals, and at events across the country.\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2015_07/content_31.html": "top of page\nFeatured Posts\nBlog and ramblings\nCan Missional Communities be Baptist?\nCan missional communities be Baptist or are they by very nautre extra-denominational? Church decline in the UK has been a common pattern...\nCommunion: Who can come to the table?\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_EU/content_54.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nDon't tell me I can't be angry and to pray. I can do both.\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_themass/content_34.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nCommunion: Who can come to the table?\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2014_07/content_9.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nWhat can Amos say to us today?\nAmos of Tekoa, sometimes referred to as ‘The Prophet of Justice’[1], was a shepherd in a small town in Judah, with a mighty message from...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_jesus/content_37.html": "top of page\nFeatured Posts\nBlog and ramblings\nDon't tell me I can't be angry and to pray. I can do both.\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be...\nStick with Christmas...for now.\nSo I have spent a long time reflecting on Christmas this year and trying to write what seems like a million sermons which all bring...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_07_22_communion-who-can-come-to-the-table/content_15.html": "Communion: Who can come to the table?\n- Andy Fitchet\n- Jul 22, 2015\n- 10 min read\nCommunion, or the Eucharist, has always been an essential and pivotal part of Christian Worship. It was Christ himself who instituted it at the Last Supper and it has been something to bind Christian communities together since the death of Christ. Chadwick in his book The Early Church notes about the importance of communion from the birth of church;\n‘The unity of the scattered Christian communities depended on two things – on a common faith and on a common ordering of life and worship…Each Sunday they met for their ‘thanksgiving’ in which the baptised ate bread and drank wine in a sacred meal…this sacred meal was so deeply felt to be the essential expression of membership of the society that fragments of the broken bread were taken round to any who were absent through illness or imprisonment’[1]\nIt is important from the outset of this essay to note that Communion, along with Baptism, has also been one of the most divisive issues within the church. Chadwick notes, in the section just read, that it was the baptised that received and shared in the sacred meal. The question of who can and cannot receive communion has been a debate in the church almost since it’s birth at Pentecost and with almost every answer, from a select few to everyone, all being conclusions that parts of the church have come to. My question then is who, today in the 21st Century, should be allowed to receive communion? And in particular, who should be able to receive within a Baptist church?\nThis debate about who can and cannot receive communion stems from the greater question of what happens within the act of communion. Communion for many centuries has been described as a sacrament. The 1662 Common Prayer book defines a sacrament is this way;\n‘Question. What meanest thou by this word Sacrament? Answer. I mean an outward and visible sign of an inward and invisible grace…’[2]\nThis is a generally accepted understanding of a sacrament. However this definition still does not define what is happening within the act of the sacrament itself. Traditional Catholic Theology, in which there are 7 sacraments: baptism, confirmation, the Eucharist, penance, marriage, ordination and extreme unction, has claimed that these sacraments are a means of God’s grace and that within the acts of the sacraments God gives his grace those who are receiving them. This view was challenged by the reformers, most notably, Martin Luther. He wrote in his book The Babylonian Captivity of the Church:\n‘There are only two sacraments in the Church of God, Baptism and the Bread; since it is in these alone that we see both a sign divinely instituted and a promise of remission of sin’[3]\nIt is clear to see that Luther believes that the Sacraments, of which he states there are only 2, convey within them some ability to connect us to the promise that Christ gives us of forgiveness of sins. The protestant church has, since the time Luther, claimed that there are indeed only two Sacraments, Baptism and Communion, as these are the only two instituted by Christ himself in the scriptures. The protestant church has generally agreed with Luther when he wrote ‘I do not say this, because I condemn the seven sacraments, but because I deny that they can be proved from the Scriptures.’[4] What has differed within the protestant tradition however is the same question posed earlier, what is going on within the Sacrament? This is a major question as if one believes that there is something happening within the sacrament itself then it could dictate who can receive that sacrament and who cannot.\nBaptists have generally been radicals within church history. Challenging the structures and practices of the established church and living on the margins of the Christian community. Baptists, from their inception, felt that the reformers, including Luther, did not go far enough in his challenging of the doctrines of the established Church. As Scott Bullard writes in the book, Gathering Together: Baptists at Work in Worship;\n‘Baptists…owe their existence in part to another group of reformers, reformers who thought that Luther, Calvin and others did not carry their reforms far enough, and indeed they often came to oppose those reformers’[5]\nBaptists took the platform of the reformers and used it to jump further than they on many doctrines, including real presence within communion. Traditional Catholic theology holds that the Bread and Wine within the Eucharist or Mass physically becomes the body and blood of Christ, often referred to as transubstantiation, taking a very literal interpretation of the John 6:53 when Christ says ‘Very truly, I tell you, unless you eat the flesh of the Son of Man and drink his blood, you have no life in you.’ The Fourth Lateran Council of 1215 defined what the Theology of the Catholic Church was when it concluded:\n‘…there is the same priest and sacrifice, Jesus Christ, whose body and blood are truly contained in the sacrament of the altar under the forms of bread and wine; the bread being changed (transsubstantiatio) by divine power into the body, and the wine into the blood’[6]\nLuther however wanted to refute this doctrine to say that the elements did not physically turn into the body and blood of Christ but that Christ was still, in some way, physically present within the act of communion, often referred to as Consubstantiation. The theological viewpoint that either grace is received through, or that the elements change substance, restricts who can or cannot receive, communion. In the Catholic tradition only Catholics may receive communion, not members or ministers of other churches. This is because the Catholic Church holds to a very literal interpretation of 1 Corinthians 11:29-30 when Paul writes ‘For all who eat and drink without discerning the body, eat and drink judgement on themselves. For this reason many of you are weak and ill and some have died.’ With the understanding of transubstantiation, Catholic’s interpret this scripture to mean that those who do not discern that the elements become the body and blood of Christ, drink judgment upon themselves. As Bishop Brom of San Diago writes:\n‘..another reason that many non-Catholics may not ordinarily receive Communion is for their own protection, since many reject the doctrine of the Real Presence of Christ in the Eucharist. Scripture warns that it is very dangerous for one not believing in the Real Presence to receive Communion; (1 Cor 11:29-30)’[7]\nEarly Baptists however held a more Zwinglian view, often called Memorialism or Real Absence. This is the theological viewpoint that, as McGrath writes, states:\n‘The bread and the wine become reminders of Christ in His absence, and a central focus for the church’s expectation that her Lord will one day return. There is no metaphysical difficulty about the presence of Christ in the Eucharist, precisely because there is no presence to discuss.[8]’\nZwingli’s view that Christ himself instituted this meal and said the words ‘This is my Body’ whilst being physically present with the disciples, which means that it of course can not be physically his body, otherwise Christ would have had to physically give them part of his flesh to eat, and therefore it has to be taken metaphorically. This understanding of communion as a memorial of Christ is the theology adopted by the Early Baptists and continues to be the predominant theology today.\nThis view, that the bread and wine remain simply bread and wine and that the purpose of the ordinance of Communion is to remind us of the sacrifice of Christ, has lead Baptists to be generally more inclusive about who may share in this meal. The early Baptists did however hold that it was only for the Baptised members of the church, in other words those who we know, that should be able to receive. Even with this predominant view though, there were still those advocating for even more inclusivity at the table. Humphreys in his essay ‘Baptists and their Theology’ writes of this discussion;\n‘In the second half of the seventeenth century, Baptists debated questions related to open membership and open communion. William Kiffin of London held the majority view that membership should be restricted to baptized believers and communion should be offered only to members. John Bunyan of Bedford argued for open membership and open communion. Bunyan wrote: \"I do not deny, but acknowledge, that baptism is God’s ordinance; yet I have denied, that baptism was ever ordained of God to be a wall of division between the holy and the holy.\"[9]’\nThis discussion around who should be able to share continues today in many parts of the Baptist church in the UK. The question posing the church today however is predominantly around the role of children in communion and whether children should be allowed to receive the bread and wine. Children play a far greater role in the life of the church than they used to. With the decline of afternoon Sunday schools and the will to involve as many people as possible in the active life of the church and in particular the worship services, there has been much reflection on who can and cannot come to the table. Holmes in his book reflects the position British Baptists have often taken when the person residing invites people to receive the bread and wine:\n‘The open communion position in British Baptist churches leads to an invitation being offered ‘to all those who love the Lord Jesus in sincerity and truth’, or similar.’[10]\nThere has however been a significant number of modern British Baptists who would and do go further in their invitation to the table. Revd. David Kerrigan, General Director of BMS World Mission, in the BMS World Mission magazine Catalyst, reflects on the role of communion in church life and mission and poses the question ‘Can we be braver and more faithful with Communion?’ he continues his reflections by speaking of Jesus who shared his first communion meal with Judas and Peter, the one who would betray him and the one who would deny him. Kerrigan reflects on the times Jesus eats with Levi and the hated Zacceus, posing the question if this is who Jesus had around the table, who should we allow around the table? Kerrigan ends his reflections as such:\n‘If we believe new truth can she break through from God’s word, which we do, dare we allow our prophetic imagination to see something new here? If this is true, can you imagine how we can wonderfully renew our understanding of Communion? To see it as a feast where we invite our neighbours and friends to share our food and, at the heart of it, break bread and drink wine, explain to them what it’s about and invite them to take part.’[11]\nKerrigan argues then for a radical inclusivity of anyone who wants to partake in the bread and wine to be allowed to. In the same Magazine Revd. Anthony Clarke, Fellow at Regents Park College, Oxford, specifically looks at the issue of children receiving communion. He, along with Kerrigan, looks at the narratives of Christ eating with various characters within the gospels and how these can shape our understanding of communion. Clarke presents the feeding of the 5000 in John’s Gospel as a Eucharistic text. Clarke argues, that within this narrative there is the blessing, breaking and sharing of bread and that within the same story we have the quote used earlier in the essay about eating the body and drinking the blood of the Son of Man, John 6:53. Clarke writes of the John 6 narrative:\n‘If John 6 fulfils the function of the institution of the Lord’s Supper [as there is no other account of the Last Supper in John’s Gospel writer input], then the context of the crowd if quite different to that of the upper room, suggesting that the invitation to the table is open and welcoming. The bread is offered to all on the basis of sheer grace[12]’\nClarke then suggests that far from there being criteria that must be met to share in communion, such as Baptism by immersion as practised by the early Baptists, the table is open to all who are willing to receive from Christ and this is based on His grace and His grace alone. Clarke also reflects on the synoptic accounts of the Last Supper. Although there is some disagreement within the narratives as to when exactly the Last Supper took place there is agreement within the synoptic accounts that it took place within the time of Passover. Clarke notes that Christ and His followers were guests within someone else’s house for Passover, they were being hosted, they were not the hosts. This may seem a trivial point however when coming to the communion table we are guests invited by Christ as the host, yet in the synoptic accounts, Christ is a guest. This could have some significance to who we allow to the partake in communion as if we look radically at this idea of guest and host one could argue that Christ was vulnerable and inclusive by being the guest of a household whilst sharing the first communion meal with his disciples. This meal took place within the Passover feast, of which Clarke writes ‘Here was a traditional meal, all-age inclusive, and in which the youngest person had a key role.[13]’ In a traditional Passover feast the youngest person will be the one to ask questions of what is going on so that the story may be recited and passed down. Clarke then is suggesting that this was not a restricted table that only certain people could be involved in but that this was to be an inclusive meal to share the story of Christ with everyone who was willing to receive.\nThroughout this essay we have looked at the traditions surrounding who can and cannot receive communion and, in part, why that is. I have to conclude; from looking at modern scholarship and the Eucharistic narratives within the scriptures that communion should be a place of radical inclusion to all those who want to receive from Christ, regardless of age or tradition. Clarke sums this up perfectly when he writes ‘Communion…should be a place of radical welcome and inclusion. Not based on the cultural basis of avoiding offence, but on the biblical and theological basis of the prevenient grace of God who offers his love in Christ, which then seeks our response’[14]\nBibliography\nMcGrath, Alistair. Christian Theology: an introduction, Oxford, Wiley-Blackwell, 2011\nWard, Pete. Mass Culture, Oxford, BRF, 1999\nHolmes, Stephen, Baptist Theology, London, T&T Clark Int., 2012\nChadwick, Henry. The Early Church, London, Penguin, 1993\nHatch, Derek & Kennedy, Rodney eds., Gathering Together: Baptists at Work in Worship, Eugene; OR, Wipf and Stock Publishers, 2013\nCummings, Brian. The Book of Common Prayer: The Texts of 1549, 1559 and 1662, Oxford, OUP, 2011\nOnline Resources\nKerrigan, David. Can we be bolder and braver with Communion?, Mission Catalyst, Volume 2, 2015, Page 2. Accessed on 22/07/15 at http://issuu.com/bmsworldmission/docs/mission_catalyst_2_2015_communion_o\nClarke, Anthony. Who is invited? Rethinking Communion, Mission Catalyst, Volume 2, 2015, Pages 9-11. Accessed on 22/07/15 at http://issuu.com/bmsworldmission/docs/mission_catalyst_2_2015_communion_o\nHumpreys, Fisher, Baptists and Their Theology, 2000. Accessed on 21/07/15 at http://www.baptisthistory.org/baptistsandtheology.htm\nBishop Brom, R. Who can receive Communion?, Aug. 2004. Accessed on 21/07/15 at http://www.catholic.com/tracts/who-can-receive-communion\nCanon 1, Fourth Lateran Council. Accessed on 22/07/15 at: http://legacy.fordham.edu/halsall/basis/lateran4.asp\nLuther, M. The Babylonian Captivity of the Church, .68. Accessed on 19/07/15 at: http://whitehorsemedia.com/docs/BABYLONIAN_CAPTIVITY_OF_THE_CHURCH.pdf\nFootnotes\n[1] Chadwick, H. The Early Church, .32\n[2] eds. Cummings, B. The Book of Common Prayer: The Texts of 1549, 1559, and 1662, .429\n[3] Luther, M. The Babylonian Captivity of the Church,.68. As viewed on: http://whitehorsemedia.com/docs/BABYLONIAN_CAPTIVITY_OF_THE_CHURCH.pdf\n[4] ibid. .49\n[5] Bullard, S. Gathering Together; Baptists at work in worship, .97.\n[6] Canon 1, Fourth Lateran Council. As viewed on: http://legacy.fordham.edu/halsall/basis/lateran4.asp\n[7] Bishop Brom, R. Who can receive Communion?, Aug. 2004. As viewed on: http://www.catholic.com/tracts/who-can-receive-communion\n[8] McGrath, A. Christian Theology: An introduction, .420.\n[9] Humphreys, F. Baptists and Their Theology, as viewed on: http://www.baptisthistory.org/baptistsandtheology.htm\n[10] Holmes, S. Baptist Theology, .147\n[11] Kerrigan, D. ‘Can we be bolder and braver with Communion?, Mission Catalyst: Issue 2 2015 .2.\n[12] Clarke, A. Who is Invited? Rethinking Communion. Mission Catalyst Issue 2 2015, .10.\n[13]. Clarke, A. Who is Invited? Rethinking Communion. Mission Catalyst Issue 2 2015, .10\n[14].Ibid. 10.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2016_06/content_22.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nDoes Original Sin have any place in modern Christianity?\n‘Do you think God sends babies to hell?’ This was a question that was presented to me during a time with members of my congregation....\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_church/content_29.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_Christiancountry/content_53.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nThere is no such thing as a 'Christian Country'.\nThere is no such thing as a Christian Country. ‘We are a Christian Country…’, ‘Last time I checked we were a Christian Country…’, ‘That...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2015_08/content_14.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nWe are all human.\nIt may come as a shock to some, but we don't choose where we are born. We have absolutely no control over who our parents are, what...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_archive_2015_12/content_46.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nStick with Christmas...for now.\nSo I have spent a long time reflecting on Christmas this year and trying to write what seems like a million sermons which all bring...\nbottom of page",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2015_12_22_stick-with-christmasfor-now/content_43.html": "Stick with Christmas...for now.\n- afitchet\n- Dec 22, 2015\n- 2 min read\nSo I have spent a long time reflecting on Christmas this year and trying to write what seems like a million sermons which all bring something inspiring and fresh this Christmas Season…a foolish thing to attempt I know!\nBut one thing that has been a constant theme throughout all my sermons and talks this year, has been the encouragement to stick at Christmas rather than jump straight to Easter - at least for now. I think this shows that I have been at Regents Park College for too long!\nOne thing I have noticed over the years of going to church Christmas services (which is now half my life!) is the the temptation for many, including myself, is to jump from Christmas to Easter in one swoop. To celebrate the joy of Jesus being born and then in the next sentence to say something like: ‘So he can grow up and die for your sins.’ The poor boy is only just been born! One of the joys of being Baptist is that I can jump into tradition and back out of it when the mood takes me. However, I do think there is something for structuring the church year around the traditional Church Calender, not rigidly and inflexibly, but so that we can pause and reflect on the different aspects of the life of Jesus and where we find ourselves in this big God story.\nOf course we cannot artificially separate the two stories of Christmas and Easter, for they are actually one story and intrinsically linked. Nor am I saying that we should only preach Easter after Easter Sunday and then leading up to Advent when we cannot preach it. But I am suggesting that just for a short while, we stick at Christmas. There is so much in the Christmas Story to be in awe of. The Christmas Story shows us a God who is willing to risk a whole lot by being born as a baby in 1st Century Palestine. It shows us a God who draws near and wants to be near not a god who is far off and distant and angry. It shows us that God chooses to use the poorest and humblest of people and settings in which to do his work, not just through Kings, Queens and the wealthiest. It shows us a God who knows what it is like to be us, to face the same temptations, the same money problems, and the same family dynamics and yet who shows us how to be in those times.\nThis Story, which of course I think is a true story, is one that is rich and full of beauty. So this Christmas, I urge you, stick with Christmas…for now anyway.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_single-post_2017_02_03_dont-tell-me-i-cant-be-angry-and-to-pray-i-can-do-both/content_13.html": "Don't tell me I can't be angry and to pray. I can do both.\n- afitchet\n- Feb 3, 2017\n- 3 min read\nAnger is a funny thing for Christians. You see we can't decide whether it's OK or not. We should be nice, shouldn't we? We should be loving and kind - not angry! Let me say this: I'm angry.\nAfter the referendum I was angry. I was a firm remainer and have become a loud remoaner! I was angry that the public were lied to and that they swallowed up the bile of 'taking back control'. Of course not all Leavers did, some where very well informed and we just have different political opinions.\nAnd now I'm angry again. The election of Trump in the US is catastrophic for those of us who want to call communities together rather than define our communities based on 'we are not them' or 'we are better than them' - yes he seems to be moderating his stance but that's not what he was elected on.\nAfter the referendum is remainers were told to 'get over it, the country has voted!' Ignoring the fact that more people didn't vote than voted to leave, I am angry that I am being, along with 16 million other remainers, striped of my EU citizenship which I value.\nAnd now I am angry again.\nThe joy of social media is that everyone has an opinion - me more than most I'll admit. But it also means people say unhelpful, glib claptrap. Things like, 'It's OK, Jesus is King.' Or 'It's OK, pray for Trump' - trust me I've been praying for Trump for 18mths - as far as I can tell, it's not working! And yes Jesus is King - but he hasn't come back yet. Therefore we are still the stewards of the Kingdom called to be the light of the world and city on the hill which shines out truth.\nIt's a bit like telling someone, after a loved one has died that 'it's OK, they are in Heaven now.' That may well be true, but it isn't helpful. Yes the greater truth is there but in that moment, often they just want the person back and not be told 'it's all OK' when for them it obviously isn't.\nThat's how I feel about the Referendum and the US election. Yes I know Jesus is King, I went to a Regents and we learnt that, but is doesn't mean I can't be angry about the way in which the world is going. Anger isn't the opposite of love, fear is.\nJesus is in charge, absolutely. However that doesn't mean it's all going to be OK now. Jesus is in charge, but Iraq and Syria is still happening. Jesus is in charge, but the Chilbok girls are still missing. I don't think it's good enough to just say, 'but it will be OK in the end' - we're not at the end, what do we do now?\nI am angry that hate is winning. I am angry that lies are prevailing over truth. I am angry that the Church seems to be involving itself in peddling this nonsense. I am angry that we don't look more like Jesus. I am mainly angry that I don't know what to do.\nChristians, in my experience, are good at theoretical answers: 'the Bible says things will get worse' etc etc. Can I implore you, that's not helpful! It doesn't do anything to elevate suffering or comfort the broken and it definitely doesn't help missionally to a generation that doesn't believe in absolute truth.\nIs it OK for me to be angry? Well, I'm still working that one through. What I do think though is that anger is a powerful emotion like love, which can compel action. The question for me is does this anger come out of love? 'Surely not!' I hear you say. In some ways I think it does. It for the love of the communities that are being ignored or oppressed that I am angry with the oppressors. It is for the love of humanity that I am angry we are subjecting parts of it to acceptable hatred. It is for the love of the downtrodden that I am angry with those who are doing the treading.\nIs it OK for me to be angry? On its own, probably not. If I do something about it, probably it is.",
  "https_www_andyfitchet_co_uk/https_www_andyfitchet_co_uk_blog_hashtags_economics/content_12.html": "top of page\nHome\nBlog\nBio\nPress and Talks\nMore\nUse tab to navigate through the menu items.\nFeatured Posts\nBlog and ramblings\nIs Capitalism sin?\nWhatever God looks like, if that doesn't happen, that is sin. What is the perfect life? What does society around you project as being th\nbottom of page"
}