{
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-24th-march-2025/content_20.html": "GOOD AFTERNOON & welcome to my weekly update no.305\nWestminster is gearing up for the Chancellor’s Spring Statement which was supposed to be a quiet affair but looks like it won’t be because she has run out of money. Locally we have a huge gala dinner on Friday to raise money for the Royal Surrey’s new Cancer and Surgical Innovation Centre.\nWHAT’S GOING ON IN WESTMINSTER\nNOT A TIME FOR TINKERING I added my twopennyworth as former Chancellor to flood of advice Rachel Reeves has been getting ahead of her Spring Statement in an article in the Sunday Times. I also spoke about it on LBC. The Autumn budget was a disaster for business but my biggest worry is that if the Chancellor is not bold enough on Wednesday, we will back in the same place later in the year. Getting the adult age welfare bill down to pre-pandemic levels would save £49 billion - a huge amount that would avoid the need for further tax rises/spending cuts and allow more money for defence. And given the pandemic is three years behind us, that does not seem an unreasonable objective for the next five years. It would also be good for business who need to fill over 800,000 vacancies in the economy at the moment.\nREFORM THE STATE Rachel Reeves told Sky News that she is confident that she can cut civil servant numbers by 10,000 although the Times reports that this number could actually be as high as 50,000. Either way it is less than the plans I left in place, which were to return the size of the civil service to pre-pandemic levels. Since the pandemic, ONS data shows that the total headcount of the civil service has increased by around 100,000 – a whopping 21% jump - which is surely unfair given the pressures the private sector are going through right now. I spoke about this issue on World at One today with Sarah Montague and also how government departments always try and fend up Treasury requests for savings with ‘bleeding stumps’ - politically impossible suggestions to scare the evil Treasury away. Bridget Philippson’s threat to cancel free meals for infants is a classic of the genre.\nNURSING NIGHTMARE Last week, Channel 4 Factcheck revealed that a worrying shortfall existed between the planned and actual number of nurses on wards around England. Most worryingly, it found that a third of neonatal units and maternity services were 10-20% understaffed. I was disappointed as you can see from this interview with Cathy Newman because I forced the NHS to collect and publish ward staffing levels as part of the government’s response to the Mid Staffs scandal. They stopped doing so after I stepped down - and now perhaps we know why. I increased the number of nurses we train by 25% in 2016 and then doubled them in 2023 as part of a new long term workforce planso the crucial issue is how we make sure wards are safe as we wait for the new nurses, doctors and midwives to come on stream.\nAND THERE’S MORE Today I warm to the theme with an article on how to make maternity services safer in a newspaper not known for giving a platform to Conservatives, namely the Guardian. I am concerned that the major upheaval currently going on in the NHS will lead to managers being distracted and more avoidable deaths. A recent report from Imperial Collegecommissioned by the charity I set up, Patient Safety Watch, found that half of our patient safety metrics are trending in the wrong direction. As I say in the article, 37 patients die needlessly each day in the NHS. More positively, if we reached the same maternity safety levels as Sweden, more than 1,000 more babies would live each year.\nSAVE US FROM SEWAGE On Thursday morning, I asked the Secretary of State for Environment, Food and Rural Affairs about the state of sewage leaksby water companies across the UK. In Godalming and Ash, there were over 1400 hours of sewage discharges in 2023, including a shocking 690 hours in the Cranleigh area alone. This is unacceptable. As Chancellor one of my very first decisions was to change the rules so the fines paid by water companies go into cleaning up rivers not back to the Treasury. Last year, Thames Water promised to invest £400m to clean up local rivers by the end of next year so I am trying to find out if, with all their other problems, this money is actually being spent.\nBEAT BRAIN TUMOURS March is #BrainTumourAwarenessMonth, an issue close to my heart after the death of my predecessor as Culture Secretary and friend Tessa Jowell. Last week I joined MPs from across the political spectrum in signing a letter to the Health Minister to ensure that those affected by brain tumours are not left behind in the government’s upcoming 10-Year Health and Cancer Plans.\nWHAT’S GOING ON LOCALLY\nUNITARY SUBMISSIONS ARE IN so now it will be up to the Government to choose their preferred option when Waverley and Surrey County Council are abolished. The decision seems to boil down to whether it’s two or three unitaries for Surrey. Surrey itself supports two unitaries whilst some of the LibDem Districts and Boroughs want three. Click here for a very useful summary of Surrey’s position which I support, mainly because I am worried we might not be able to handle Woking’s £2.2bn debt if we end up as part of a small successor authority. There was also more drama following last week’s ‘skewgate’ video by the Lib Dem Leader of Waverley as both he and the CEO came under intense scrutiny across Surrey - here is one example by the R4GV leader in Guildford’s Full council meeting.\nStatement from Surrey Leader Tim Oliver following Surrey's Full Council meeting last week.\nNATIONAL NATURE RESERVE Natural England has announced the new ‘Wealdens Heath NNR’ of 2,765 hectares of land including around Godalming and Guildford. The NNR encompasses the fantastic Thursley Common as ‘one of the last remaining fragments of Surrey heathland’ and of course it is also now home to ‘Britain's Best Path’. Fantastic to see our area getting the national recognition it deserves! Now can we be a National Park?\nStunning Thursley Common taken by winner Michelle Presley\nBROADWATER BLUES Godalming residents continue to contact me frustrated about the lack of progress on the former golf club site which has now stood vacant for over 6 years since it closed. Farncombe resident Steve Farmer recently submitted a 1,500 strong petition to Waverley for a skate park which sounds like a great idea, but he is worried about lack of action. Come on Waverley, residents want to see progress on this one!\nASH MANOR LAY-BY Ash residents and Ash Parish Councillors have contacted me following the news that the lay-by outside Ash Manor school is to be removed as part of a series of improvements. Thanks to Cllr John Tonks and Paul Spooner for flagging - I am raising this with Surrey.\nSHALFORD SPEED REDUCTION A portion of Kings Road will be closed over the Easter school break for a period of two weeks while work to reduce the speed limit to 20 Mph and safety improvements including road tables and road cushions is undertaken. The roadworks are dovetailed in with SGN’s ongoing pipe replacement in the area. I’ve raised residents' concerns with Shalford Cllr Matt Furniss who is working hard to minimise disruption. Worth a trip to the always delicious Snooty Fox soon to see the completed improvements!\nGO FOR GOLD! Brilliant to see Yaz Hasan becoming Sport Godalming’s first ever Ambassador. Yaz is a Junior International lawn bowler having represented England across the British Isles - she started playing at 8 years old at our very own Godalming & Farncombe Bowls Club. In February this year Yaz was part of the England’s winning Women’s under 25 international squad, beating Wales, Ireland and Scotland in their path to become Champions. Go Yaz! She is galvanising support for the brilliant Sport Godalming which supports and promotes sport locally.\nROLL UP ROLL UP for the superb online auction as part of Friday’s gala dinner to raise funds for the new Cancer and Surgical Innovation Centre fundraising campaign. Thanks to the unstoppable Judith Storey, tickets for the dinner have now sold out but you can bid (using the link) for some incredible prizes including a London hotel stay with afternoon tea at the Ritz, one off handmade jewellery, tickets for Henley Regatta including Michelin star dining, a golf and spa break for two at the K Club, Ireland, two Nights at the famous Lygon Arms in the Cotswolds and four ball golf sessions at Hindhead and Hankley common golf clubs.\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community. If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), Bluesky or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAND FINALLY… Volcano alert - anyone planning on taking a trip to Mont Spurr Alaska might want to rethink after signs the stratovolcano may erupt ‘within weeks’. But good news on the quake front: Santorini has now been declared safe once more for tourists following a series of minor quakes in February - may the holiday season commence!\nKnocking on doors in stunning Chiddingfold on Saturday with the Team.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_category_Local-News/content_26.html": "Royal Surrey Gala Dinner Raises £22k 11th April 2025 Friends of the Royal Surrey held a wonderful Charity Gala Dinner and Dance at the Hogs Back Hotel on Friday 28th March, with local MPs Jeremy Hunt and Greg... Local News\nJeremy writes to Transport Secretary asking for an update on step-free access at Ash Vale Station 6th February 2025 Jeremy has written to Secretary of State for Transport to request an update on Ash Vale Station and the promised feasibility study. Local News\nJeremy and Greg Stafford MP write to Secretary of State for Housing, Communities and Local Government on Community Infrastructure Levy at Waverley Borough Council 6th February 2025 MPS DEMAND URGENT ACTION ON UNFAIR CIL CHARGES HITTING HOMEOWNERS Jeremy Hunt MP, Member of Parliament for Godalming and Ash, and Gregory Stafford MP, Member of... Local News\nSurrey Hills AONB 12th December 2024 I have campaigned for years for expansion of our beautiful Surrey Hills AONB and so I read the latest report published last week on the proposed areas with... Local News\nMeeting with mobile phone signal providers 12th December 2024 One of Jeremy's 6 point plan is to improve mobile reception in Cranleigh and surrounding villages. To this end he has been meeting with representatives of the... Local News\nVAT on independent schools 12th November 2024 From January 2025 the Government will be charging VAT on independent schools including special educational needs (SEN) schools. This Labour policy will have... Local News\nJeremy Hunt runs his third London Marathon 21st April 2024 Jeremy Hunt completed his third London Marathon today (21st April). The Conservative candidate for Godalming and Ash was joined by a group of over 20 people... Local News\nThames Water Meeting Update 12th April 2024 Jeremy Hunt MP described the Thames Water meeting with the new Thames Water CEO Chris Weston as \"difficult but useful.\" The meeting hosted by Jeremy Hunt MP and... Local News\nTHAMES WATER FOLLOW-UP PUBLIC MEETING 21st March 2024 Follow-up public meeting with Thames Water, Jeremy Hunt MP and Angela Richardson MP on Friday 12th April 2024, 17:00 to 18:15. Location: Wilfred Noyce Centre... Local News",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_campaigns_step-free-access-ash-vale-station/content_31.html": "Getting on a train at Ash Vale station is impossible for wheelchair users, families with prams or buggies and older people who can’t manage the steps. This is a big issue for many people as it is the mainline to London. I secured funding for the much needed step free access at the station. Now I will work with the government, Surrey County Council and Network Rail to ensure the money is spent as promised - and quickly.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_cookies/content_21.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news/content_4.html": "Royal Surrey Gala Dinner Raises £22k Friday, 11 April, 2025 Friends of the Royal Surrey held a wonderful Charity Gala Dinner and Dance at the Hogs Back Hotel on Friday 28th March, with local MPs Jeremy Hunt and Greg Stafford acting as auctioneers for the numerous lots donated by local businesses and supporters. The event raised a staggering £22,000 for the Cancer & Surgical Innovation Centre Campaign which will open next year and enable the treatment of an... Local News\nConstituency Update 24th March 2025 24th March 2025 GOOD AFTERNOON & welcome to my weekly update no.305 Westminster is gearing up for the Chancellor’s Spring Statement which was supposed to be a quiet affair but... Newsletters\nConstituency Update 17th March 2025 17th March 2025 GOOD AFTERNOON & welcome to my weekly update no.304 A lot happening internationally, nationally and locally. As we find out if Putin will enter discussions on a... Newsletters\nConstituency Update 10th March 2025 10th March 2025 GOOD AFTERNOON & welcome to my weekly update no.303 What a glorious sunny weekend - but like the political weather the actual weather changes fast! A slightly... Newsletters\nConstituency Update 3rd March 2025 3rd March 2025 GOOD AFTERNOON & welcome to my weekly update no.302 Last week was a very fraught week in international relations which kept me busy with my former Foreign... Newsletters\nConstituency Update 10th February 2025 10th February 2025 GOOD AFTERNOON & welcome to my weekly update no.301 One more week until half term and Westminster feels a little quiet (but it is Monday). But last week was far... Newsletters\nJeremy writes to Transport Secretary asking for an update on step-free access at Ash Vale Station 6th February 2025 Jeremy has written to Secretary of State for Transport to request an update on Ash Vale Station and the promised feasibility study. Local News\nJeremy and Greg Stafford MP write to Secretary of State for Housing, Communities and Local Government on Community Infrastructure Levy at Waverley Borough Council 6th February 2025 MPS DEMAND URGENT ACTION ON UNFAIR CIL CHARGES HITTING HOMEOWNERS Jeremy Hunt MP, Member of Parliament for Godalming and Ash, and Gregory Stafford MP, Member of... Local News\nConstituency Update 3rd February 2025 3rd February 2025 GOOD AFTERNOON & welcome to my weekly update no.300...yes that’s right this is my 300th newsletter! If you are one of those who has been reading them right from... Newsletters\nConstituency Update 27th January 2025 27th January 2025 GOOD AFTERNOON & welcome to my weekly update no.299 Today is Holocaust Memorial Day - and 80 years since the liberation of Auschwitz-Birkenau. Thank you to King... Newsletters",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_jeremy-hunt-mp-south-west-surrey-responds-surrey-advertiser-piece-about-ttip-nhs/content_46.html": "See my letter below to the Editor of the Surrey Advertiser in response to the recent claim that the TTIP deal will lead to the privatisation of the NHS\nThe Editor\nSurrey Advertiser\nStoke Mill\nWoking Road\nGuildford\nGU1 1QA\n30th December 2014\nSir\nFurther to the article by Becca Taylor, 'voters call on Hunt to take NHS out\nof deal' (19th December 2014), and having not been asked for comment at\nthe time, I felt it was important for me to write as local MP for South West\nSurrey and Secretary of State for Health to set the record straight for the\nbenefit of your readers.\nThe story includes references to the TTIP deal between the US and EU\ncurrently being negotiated and an Unite the Union Poll which suggests that\nrespondents, including those from my constituency of South West Surrey,\nare concerned that the TTIP might lead to harming the NHS, changing\nexisting practices or it being 'sold off'. Of course, I would share those\nconcerns if they were true, however, the facts are that this is categorically\nnot the case.\nTo confirm, TTIP has no effect on the powers of the NHS at local level -\nlocal GPs who this government put in charge of designing decisions - will\ncontinue to decide who should best provide services for their patients. The\naccusation that the trade deal could force the privatisation of the NHS is a\ncomplete red herring, and this has been confirmed by the European\nCommission itself - former EU Commissioner, Karel De Gucht stating\nrecently on Radio 4's Today Programme that: \"It's an argument that is\nabused in your country for political reasons but it has no grounds.”\nIt’s unfortunate that people are being asked to give their opinion on the basis\nof scare stories. A new US/EU trade deal would not result in any\nchanges being made to existing practices or indeed force the privatisation of\nthe NHS. This cannot and will not happen, as confirmed by both US and EU\nnegotiators, and as Health Secretary I would never allow it. What a trade\ndeal could do though, which would be of huge benefit to the country, is\ncreate thousands of new jobs in the UK, offer improved access to the US\nmarket for our world-class pharmaceutical and medical devices sectors,\nboost the economy and create more taxes to fund the NHS.\nI completely understand people being concerned but the facts have been\nmisrepresented. As local MP for South West Surrey and as Secretary of\nState I share the passion that there is to preserve the integrity of the NHS and\ndo hope that this letter will reassure readers and alert them to the truth rather\nthan the scaremongering.\nYours sincerely\nRT Hon Jeremy Hunt\nMember of Parliament for South West Surrey\n2, Royal Parade,\nTilford Road, Hindhead,\nSurrey GU26 6TD",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-3rd-march-2025/content_5.html": "GOOD AFTERNOON & welcome to my weekly update no.302\nLast week was a very fraught week in international relations which kept me busy with my former Foreign Secretary hat on - but not so busy that we haven’t been able to make real progress, including on sewage spills in Alfold with Thames Water. This week I also have two meetings with mobile phone networks about how to improve coverage locally.\nWHAT’S GOING ON IN WESTMINSTER\nLET’S AIM HIGHER Last week was a big moment for those of us who care about defence: the prime minister finally re-committed the UK to spending 2.5% of GDP on defence. I committed to this as Chancellor but Labour initially reversed our pledge to do so by 2030 so it was a welcome announcement (although I would have preferred the money to come from welfare reform not the aid budget - see why here). The announcement was just in time for his visit to the US – which was a success as I said on LBC last week. The key issue for the UK is not just the future of Ukraine but the future of NATO, as I asked Sir Keir Starmer about last week and again this afternoon. For that we - and others - will need to match the 3.4% of GDP being spent on defence by the US. I explain how we could afford to do this without putting up taxes in this Telegraph article. In a nutshell if we reduced our spending on working age benefits to pre-pandemic levels we would save £40 billion a year, more than enough for the extra spending. Not easy for sure, but it is something that would be good for growth and good for welfare claimants themselves.\nTHE WRONG PATH TO PEACE Many were very dismayed by the Oval Office bust up between Presidents Trump and Zelensky. I have met both men. Trump is a disruptor who - however much he offends - might just get the Russians to agree to a peace deal when others couldn’t. Zelensky is, in my view, probably the bravest man on the planet. The only sliver of hope, as I said on BBC Radio 4’s Today programme, is that both men now need each other. Trump does not want to abandon Ukraine as Biden did Afghanistan and in some ways needs a deal almost as much as Zelensky. So let’s hope they both get back round the table soon. To that purpose, Sir Keir Starmer rightly gathered European leaders in the UK over the weekend and also unveiled a £1.6bn missile deal for Ukraine.\nMy question on defence spending to the PM this afternoon\nNHS MUSICAL CHAIRS Last week saw the surprise announcement that NHS CEO Amanda Pritchard had quit. I have always liked Amanda and worked with her closely to get the NHS Long Term Workforce Plan agreed when I was Chancellor. This Sunday Times article has an interesting take on why she may have left. As I am quoted as saying, every prime minister since Blair has told every health secretary to grip the NHS leading to too many targets and the most micro-managed system in the world. Let’s hope changing that really is part of Wes Streeting’s reform agenda. Talking of the NHS, on Wednesday I spoke at a Westminster Hall debate on maternity services, where I suggested that because midwives and obstetricians are often concerned about the legal ramifications of speaking out, they are not speaking out when perhaps they should be.\nWHAT’S GOING ON LOCALLY\nBETTER SIGNAL PLEASE On Saturday I tried to pay for parking at the Cranleigh Leisure Centre on RingGo which was a struggle with a 3G signal…so this week I will talk to just the people to sort it out. I'll be having the first of my follow-up meetings with Vodafone and Three to discuss the results of my mobile phone signal survey, which almost 2,000 residents across Godalming and Ash have now responded to. Cranleigh and Godalming High Streets are top of my list alongside Bramley, Shamley Green and some other villages. Thank you for arming me with the ammo I need ahead of the meetings.\nCHARLIES PROMISE As many will know, the lovely Cosser family tragically lost their 16 year old Charlie in 2023 to knife crime. This week I took Charlie's Mum and Dad Martin and Tara to meet Justice Minister Nick Dakin. They have set up a brilliant charity called Charlie’s Promise to tell literally thousands of children (and counting) about the dangers and impact of knife crime - a totally inspirational mission.\nASH LODGE PARK LAND Following my survey it is disappointing to learn this week in the Guildford Dragon Bewley Homes appear to be progressing a sale of this land for profit to a private care home. My survey shows this is NOT the use local residents want for the space, now the NHS has confirmed a GP surgery is off the table. Disappointingly Guildford Borough Council did not exercise their option for a community use for this space within the 5 year period in the S106 development agreement, which would have offered protections for the site. I am meeting both GBC and Bewley Homes to feedback residents' wishes and to ask what has gone wrong here. I will keep you posted.\nALFOLD - GRAMPIAN CONDITIONS FROM THAMES WATER A month ago I wrote to Thames Water CEO Chris Weston on behalf of Alfold residents to request an urgent directive that no further development should occur in the Alfold area until sewage infrastructure has been upgraded. Alfold has had to cope with years of awful sewage leaks and floods, the existing infrastructure just can’t cope. It was a key victory then to see the resulting comment from TW on the application for a further 400 homes. Thames Water’s request includes ‘grampian conditions’ which are about as strong as TW can be as a consultee. I will now ask Waverley to request they are robust in any negotiations with the developer.\nASH CHESTER BRIDGE HIGHS AND LOWS Brilliant to take a trip to see the new bridge but I have written to Guildford CEO Pedro Wrobel about improving diversion signage because lots of HGV’s ending up on minor residential roads - watch my video:\nAt Chester Bridge in Ash on Friday\nCRANLEIGH SWIM CLUB some of you may know I learned to swim in Cranleigh Leisure Centre so it's great that a new leisure centre is around the corner… indeed the planning application is coming before the planning committee on Wednesday. But I have been contacted by Cranleigh swim club (CASC) who are really concerned about the lower proposed spectator seating (55 seats vs 180 presently) which means they won’t be able to hold swimming galas, their main source of income. I have contacted Swim England and asked them to look into this. CASC currently has swimmers competing at national, regional and county level so I really hope the club can continue.\nSURGERY My first call was to a Sands resident about the way the debate on assisted dying has been portrayed. She is a strong supporter of the Bill but felt strongly that the proposed law bears no relation to what is happening in countries like Canada and Belgium. I then spoke to a resident in Shamley Green about some issues with Waverley regarding a fence where they feel the council has not been fair so I will raise the issue with the council.\nLAST CALL FOR GALA DINNER & DANCE TICKETS The amazing Friends of the Cancer and Surgical Innovation Centre fundraising team - led by Judith Storey, are making their last plans and preparations ahead of their Gala Dinner and Dance at the Hogs Back hotel, near Farnham on Friday 28th March. It's set to be a brilliant night - The last few remaining tickets can still be bought here.\nOSCAR-SEASON AT CRANLEIGH ARTS Cranleigh Arts has been able to get access to many Oscar-nominated films which are proving hugely popular with second and even third screenings selling out even before the new spring brochure has been distributed (don't miss out: make sure you're on their emailing list by visiting their website). Just added to the listings for Saturday 22 March is a matinee screening of the singalong version of the mega-hit WICKED (PG) so that musical theatre fans don’t just have to watch the film but can join in with it. Tickets for under-16s are just £6. Cranleigh Arts has also just installed a new hearing loop in its auditorium to help those people who need extra help with sound with a grant from Surrey County Council.\nWALK FOR UKRAINE On February 23–24, the Walk for Ukraine brought together the English and Ukrainian communities of Godalming. Marking the third anniversary of the full-scale war, Ben Rogers (Godalming Minster) and Natalia Maievska (Ukrainian Community) walked 20 miles from Weybridge to Godalming to honour the resilience of the Ukrainian people and raise funds for lifesaving medical aid. They have already made significant progress towards their goal, but their mission is not yet complete — fundraising continues for an ambulance that will support paramedics and emergency services in Eastern Ukraine. If you’d like to contribute, please click here. Slava Ukraini!\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community. If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), Bluesky or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAND FINALLY….tomorrow is Shrove Tuesday which means pancakes all round! Maybe head down to Guildford High Street 9-12am for its fantastic pancake race. Are you a fan of buttermilk american style or a crepe? Sweet or savoury Here are some recipes to inspire you. And please think of me as I give up chocolates and desserts until Easter Day…aargh!\nBest start to last Friday: the perfect flat white at Vale Café in Ash Vale",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_jeremy-hunt-runs-his-third-london-marathon/content_45.html": "Jeremy Hunt completed his third London Marathon today (21st April). The Conservative candidate for Godalming and Ash was joined by a group of over 20 people, all close friends and family of his late brother Charlie. The group raised over £100,000 for Sarcoma UK, a cancer charity which funds research into bone and soft tissue sarcoma.\nHe commented: \"thank you to the 517 people who supported me this time.\"\nJeremy Hunt is a proud campaigner for the Cancer and Surgical Innovation Centre at the Royal Surrey Hospital in Guildford. He launched a campaign to establish the centre just two years ago. Over £43,000 has been raised for the new Cancer Centre, making a grand total of £110,500 from Jeremy's three marathons.\nHe visited the site last month and said: \"it is clear just how much of a difference this centre will make, treating an extra 7,000 people each year and meaning that many more families will avoid the heartache of losing loved ones to cancer\".\nFor further information and to support the campaign see here:\nhttps://www.royalsurreycharity.org.uk/appeal/surgerycancerappeal\nIf you would like to support events for the Cancer and Surgical Innovation Centre, you can stay up to date by signing up to Jeremy's newsletter at the side of this page.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-3rd-february-2025/content_8.html": "GOOD AFTERNOON & welcome to my weekly update no.300...yes that’s right this is my 300th newsletter! If you are one of those who has been reading them right from the beginning this is my chance to say thank you…and - genuinely - that I have really enjoyed writing them. I get help with the research from my brilliant Hindhead team and then scratch my head thinking about what I really want to say to more than 9,000 local subscribers - and growing. Tell your friends they can sign up here!\nWHAT’S GOING ON IN WESTMINSTER\nTRUMP’S TRADE WAR Over the weekend, the opening salvos of Trump 2.0’s trade war were launched. I have generally been positive about Trump’s election on the basis that a strong America means a safer world. But I don’t agree with tariffs for two reasons: firstly a trade war will increase inflation and damage growth everywhere (including the UK and also including the US). And secondly because, as Gideon Rachman writes sensibly in the FT, it will divide the Western alliance when we should be uniting against our opponents. It seems like the UK may be spared (for now) but if we aren’t my view is we should avoid retaliating. Our goods exports are less than 0.5% of US GDP so Trump is hardly likely to blink first - and we have always thrived on the back of free trade. A quick fact for historians: the UK was the first country in the world to unilaterally remove all trade barriers back in 1846, something that lasted till 1931.\nBUREAUCRACY BONFIRE Last week, Wes Streeting took a step in the right direction when he halved the number of targets given to the NHS. I would have liked him to scrap all of them for reasons I explain here but this is still positive news. The NHS should learn from how our state schools became the best in Europe: improved capacity, more choice and rigorous inspections.\nASTRA DISASTER Last week was supposed to be the big ‘growth speech’ from the Chancellor but reality intervened with the terrible news that pharma giant Astra Zeneca is cancelling a £450m vaccines factory in Merseyside.Astonishingly Labour decided to renege on a deal that I personally negotiatedwith CEO Sir Pascal Soriot in 2023. Speeches don’t create jobs, Rachel, but factories do…\nWHAT’S GOING ON LOCALLY\nImage credit - @comptonphonebox on instagram\nCOMPTON CARS Today I was updated by William Bagnall and Jill Eyles about Surrey’s plans to reduce speeding in the village. Very frustratingly, having agreed alongside the police to consider an average speed check camera (as I successfully campaigned for in Witley, Chidd and Bramley), the police have now gone back on their word and ruled the option out. The Parish Council, whilst being disappointed, is also being constructive by trying to improve the current proposals - particularly when it comes to the location of speed tables and chicanes. You can see Surrey’s proposals today (Monday 3rd) 4pm-8pm or Wednesday 5th 11am-3pm in Compton Village Hall. If you can’t make it in person you can give your view here. Then there is a parish meeting for all villagers on Wed 12th Feb at the Village Club at 1930. Both I and the Parish Council will write in support of what the community wants to do.\nJUSTICE IN SIGHT Waverley Conservative Councillors last Tuesday won their vote to request a review for residents who have become victims of the unintended consequence of CIL legislation. Waverley has been charging some residents ridiculous amounts of CIL (Community Infrastructure Levy) after giving planning permission - with no right of appeal. I met Steve and Caroline Dally last autumn: they had to find a totally unexpected £70k for an extra charge imposed by Waverley for their home extension - meaning they had to remortgage to avoid the threat of imprisonment. Thanks to Conservative Group leader Jane Austin and her fellow Conservative Cllrs the council may now review these decisions. Steve Dally and Cllr Austin were on BBC Radio Surrey(Timestamp 2hrs 7mins) talking justice for those impacted this morning. .\nJustice for those impacted by the unintended consequence of CIL legislation\nHIGH STREET PAIN Last week Lloyds contacted me with the news their Godalming branch is set to close. Lloyds confirmed cash transitions can be made at the post office and they will also offer IT support for online banking. Given the success of Haslemere hub, I am looking into whether this could work in Godalming. Another bit of grim news: 69 High Street, owned by Waverley and shuttered for several years, will not reopen for at least another year.\nSURGERY CALLS My first call was to a Godalming resident about the removal of inheritance tax relief on pension pots in the budget. There has been a lot of discussion about farmers and family businesses being forced to pay inheritance tax but this is a measure that will affect many more and amounts to very unfair double taxation: your pension pot, if you leave it in your estate, gets taxed at 40% but the beneficiaries then have to pay income tax at their marginal rate to access it. For someone who has carefully built up their pension pot over many years it is particularly unfair, something I will raise with Shadow Chancellor Mel Stride. I then spoke to the Agnes Bailey, Head of Ash Manor School, about her concerns on the uniforms measure in the Schools Bill. You will remember last week I spoke to two local uniform suppliers on the same issue - and Agnes agrees: if schools aren’t allowed branded sportswear, kids will pressure their parents into buying much more expensive branded sportswear. It is a classic example of unintended consequences and wrong for another reason: uniforms are levellers in schools. Without them social backgrounds matter more. Is that really what Labour wants?\nMILFORD HOSPITAL UPGRADES On track to open before this year is out is the fantastic Milford Community Diagnostic Centre (CDC). I remember negotiating this with Sajid Javid when he was Health Secretary in 2022. Once opened MRI and CT scans will happen on site - a great step forward leading to more cancers being spotted early.\nCRANLEIGH ARTS My very first introduction to many Cranleigh residents was a Q & A two years ago in the brilliant Cranleigh Arts Centre. Thank you to Caroline Heslop and her team for making this an award winning venue and vital community resource.This is such a gem of a venue, offering every kind of live music from tribute bands to traditional classical ensembles. The main auditorium has a regular programme of films, live theatre and streamed performances from the Royal Opera House and the National Theatre. Like everywhere it needs £ to keep going so I will do all I can to support your superb efforts ahead of...drum roll...the centre's 40th birthday celebration this coming June!\nASH UNITED needs your help. Founded in 1911 this club has been an asset to the Ash community. So please support Ash Parish Council and Cllr John Tonks who have just ‘kicked off’ fundraising to raise £20,000 for much needed new floodlights - here is the link to donate.\nASH LODGE PARK COMMUNITY SPACE I've already received over 200 responses to my campaign to find the best use for this space. What use do you think would be best? Let me know what you think so we can keep this space for community use if we possibly can.\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community.\nAND FINALLY….Dreaming of summer holidays in chilly February? Take a look at this - fascinating to see Hawaii’s marine wildlife captured when divers left their go-pro cameras unattended on the ocean floor in Maui…\nSOCIAL MEDIA If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), Bluesky or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_campaigns_better-local-health-facilities/content_34.html": "In my time as MP I stopped the closure of the Royal Surrey by the last Labour government and saved Haslemere hospital from closure. This parliament I secured the new community diagnostic centre for Milford hospital and stopped the closure of Boots in Farncombe. I also persuaded the NHS to invest £25m in a new Cancer Centre for the Royal Surrey. Next I want to raise funds for world-class equipment for the new hospital, get more services delivered at Cranleigh Village Hospital and work with local GPs to get faster access to appointments for people in Ash. Good local NHS provision is your top priority - and mine too.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_contact/content_12.html": "If you would like to write to Sir Jeremy Hunt as the Member of Parliament for Godalming and Ash please use the following contact details:\nI would like to be kept up-to-date by Rt Hon Sir Jeremy Hunt MP on future issues that matter to me:",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org/content_1.html": "Is Sir Jeremy your MP? Enter your postcode Postcode Latest news Royal Surrey Gala Dinner Raises £22k Friends of the Royal Surrey held a wonderful Charity Gala Dinner and Dance at… Constituency Update 24th March 2025 GOOD AFTERNOON & welcome to my weekly update no.305Westminster is gearing… Constituency Update 17th March 2025 GOOD AFTERNOON & welcome to my weekly update no.304A lot happening… Constituency Update 10th March 2025 GOOD AFTERNOON & welcome to my weekly update no.303What a glorious sunny… Godalming and Ash Sir Jeremy on Facebook Sir Jeremy on Twitter\nRoyal Surrey Gala Dinner Raises £22k Friends of the Royal Surrey held a wonderful Charity Gala Dinner and Dance at…\nConstituency Update 24th March 2025 GOOD AFTERNOON & welcome to my weekly update no.305Westminster is gearing…\nConstituency Update 17th March 2025 GOOD AFTERNOON & welcome to my weekly update no.304A lot happening…\nConstituency Update 10th March 2025 GOOD AFTERNOON & welcome to my weekly update no.303What a glorious sunny…",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_campaigns_enhance-road-safety-measures/content_35.html": "Following recent successes securing speed cameras in 3 of our villages - Bramley, Chiddingfold and Witley. I will continue to push to ensure we improve road safety across Godalming and Ash. First on the list is pushing for enhanced speed measures in Compton following a number of dangerous road incidents. We also need better pedestrian crossing points in Milford, Shalford and Witley, particularly near schools.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_newsletters/content_2.html": "I publish a weekly newsletter where I provide updates on what has been happening in Westminster and in the constituency. If you would like to sign up, you can do so at the top of this page.\nTo access the full archive of newsletters you can do so here.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_map-locations/content_40.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_expenses/content_11.html": "I was one of the first 11 MPs to publish all my expenses online. I have always believed in greater transparency and believe all public servants - including MPs - should be fully accountable for the money they spend on behalf of taxpayers. I no longer claim for a second home and personally bear the additional cost of running a home near parliament as well as in Farnham - something that helps me to be effective both locally and on the national stage.\nYou can also see that I am one of the hundred lowest claiming MPs in parliament.\nYou can see my most up to date expenses here (just follow the step by step instructions and search for my name).\nWhen I submitted expenses I did not expect them to be made public. I must therefore apologise for the fact that some of them have been filled in messily. The first few months of any MP elected to parliament for the first time is somewhat chaotic, and filling in expenses claims was not one of my priorities. It may therefore help you to understand them by reading the following explanatory notes which answers some of the most commonly asked questions. This also lists mistakes in my expenses that have been identified to date.\nPrior to the recent election my Liberal Democrat opponent quite naturally tried to make as much of this as possible. This is politics! Quite a number of his claims were inaccurate, though. If you want to hear my side of the story, please read my rebuttals page where I rebutted some of his more outrageous claims.\nThe Committee for Standards and Privileges published its report on me in December 2009 concerning the issue of my agent's use of my Farnham home. Essentially I allowed my agent to stay free of charge mid-week to save her having to commute back to Sussex. The report concluded that I did not benefit personally from the arrangement and did not use taxpayers funds to subsidise the local Conservative party. However I accept that because someone else was using the house – albeit free of charge – I should have reduced the amount claimed and so I have offered to repay £9,558.50 accordingly. I am very relieved the investigation is now over - and particularly welcome the confirmation by the committee that this was a misunderstanding of the rules which involved no personal financial benefit to me.\nI have always campaigned for openness and transparency in politics. Read why I think the expenses scandal can be a good thing for democracy in Britain.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_jeremy-hunt-mp-south-west-surrey-announces-date-2nd-waverley-para-games/content_39.html": "Following the success of the inaugural Waverley Para Games event last April, Jeremy Hunt, MP for South West Surrey announces the second year of the Games, due to take place at Charterhouse Club on 26th March 2015.\nThe second year of the Waverley Para Games programme follows the event last April, hosted by Charterhouse Club, which saw over 100 young SEND students from all over Surrey take part & with Paralympians Rachel Morris, Claire Harvey and Kylie Grimes were in attendance, cheering the participants on. With continuing funding from COINS Foundation and support from Active Surrey the programme has continued to evolve and plans for 2015 include the support of sport's National Governing Bodies who are interested in developing more community groups for disability sport for young people in the area.\nWendy Newton, Youth Sports Development Manager, Active Surrey said \"We are delighted, for the second year running, to be involved in the Waverley Para Games project, which has now been fully embedded into the Surrey School Games programme, delivered by Active Surrey. Inclusive events like this enable us to reach more young people who would not otherwise have as many opportunities for competitive participation, especially those with special education needs and disabilities in mainstream schools.\" Ciorsdan Glass of COINS Foundation said, 'We are thrilled to be supporting the second Waverley Para Games. COINS Foundation supports a wide range of projects aimed at influencing others to think differently about poverty, disability and injustice. We are delighted that more young people are able to access inclusive sport in their schools and communities as a result of this initiative.'\nThe Games will again be hosted by Charterhouse Club, based in Godalming, Surrey. The facilities include a sports hall, several studios, a pool and outdoor athletics and and astro pitches, and the use of the venue has afforded the opportunity to further expand the Waverley Para Games breadth and reach from increasing the number of participants, diversifying the programme of sports on offer to increasing the breadth of delivery to include a more significant and specialist element of teacher training for local teachers. Tim Ostle, Commercial Director at Charterhouse, commented “We are delighted that the Charterhouse Club has been chosen to host this fantastic event once again in 2015. We look forward to welcoming youngsters from around the area and helping them to gain the most from this wonderful opportunity to participate in sport”\nLocal Paralympian Rachel Morris has been a supporter of the games since its beginnings. A Bronze medallist in the 2012 Olympics in hand cycling and now part of the GB Para Rowing team and in training for Rio she said,’I'm delighted to help launch the second year of the Waverley Para Games programme. Last year's inaugural event was really important for the area and for supporting SEND youngsters in gaining better access to sport. Just because your body doesn't work in the way it ideally should it doesn't mean you can't have the same dreams and achieve the same goals as your peers but it is vital that teachers, schools and communities can enable youngsters to access the right clubs and training and create these opportunities. I believe initiatives such as the Waverley Para Games are just what we need in the area and ultimately nationally to increase the chances for any young person with a disability to achieve excellence in sport.'\nJeremy Hunt said,'We have been working hard with Active Surrey planning next March's event and continuing to further our aim to increase regular participation in sport for SEND youngsters in the area. The 2015 event will be bigger and better, with new sports scheduled along with the teacher training and new for this year an elite talent spotting element integrated into the programme. We are keen for the Waverley Para Games to continue to make an impact in Surrey, building on the legacy of 2012 and ensuring that there is a meaningful and lasting benefit for the young people who take part.'",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_category_Articles/content_24.html": "Car Parking Success At Haslemere Station 20th April 2015 Parking Success At Haslemere Station Articles\nJeremy Hunt, MP for South West Surrey attends Waverley Para Games 2015 27th March 2015 Following the success of the inaugural Waverley Para Games event last April, Jeremy Hunt, MP for South West Surrey and Sport Minister Helen Grant MP visited the... Articles\nJeremy Hunt MP announces DFN Charitable Foundation as co-sponsor for the Waverley Para Games 5th March 2015 Jeremy Hunt, MP for South West Surrey, announces DFN Charitable Foundation as co-sponsor for the Waverley Para Games Articles\nRt Hon Jeremy Hunt MP's response to the recent People's NHS campaign in SW Surrey about TTIP & the NHS 3rd February 2015 Rt Hon Jeremy Hunt MP's response to People's NHS campaign about TTIP & NHS Articles\nRt Hon Jeremy Hunt signs Holocaust Educational Trust Book of Commitment 27th January 2015 Rt Hon Jeremy Hunt MP sings the Holocaust Educational Trust's Book of Commitment Articles\nJeremy Hunt MP for South West Surrey responds to Surrey Advertiser piece about TTIP & the NHS 9th January 2015 See my letter here to the Editor of the Surrey Advertiser in response to the recent claim that the TTIP deal will lead to the privatisation of the NHS Articles\nJeremy Hunt, MP for South West Surrey Announces the date for the 2nd Waverley Para Games 19th December 2014 Jeremy Hunt MP for South West Surrey announces the date for the second Waverley Para Games Articles\nJeremy Hunt MP hears from Waverley Infrastructure Resilience Group members about their Winter Plans for Godalming and South West Surrey 14th November 2014 Jeremy Hunt MP hears from Waverley Infrastructure Resilience Group members about their Winter Plans for Godalming and South West Surrey Articles",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_category_Media/content_15.html": "Jeremy Hunt attends Canadian WWI event in Milford 7th September 2018 Jeremy Hunt attended a memorial event today on Milford Common to recognise the contribution the Canadian Army made during World War I. At the event a new war... Media\nJeremy Hunt signs Holocaust Educational Trust's Book of Commitment 27th January 2017 This week Jeremy Hunt MP for South West Surrey signed the Holocaust Educational Trust’s Book of Commitment, in doing so pledging his commitment to Holocaust... Media",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_greenspaces/content_41.html": "The results of Jeremy Hunt’s constituency surveys regularly show that the protection of our beautiful local countryside is one of the top priorities for constituents in South West Surrey. As such, Jeremy has launched a Green Spaces campaign with four key priorities that we can work on together, to protect and improve our local environment.\nFirst, remove sewage from the River Wey. Jeremy has long been a campaigner for improvements in our local water quality and his number one priority is to remove sewage from our waterways. The Constituency Survey conducted last year showed that 93% of people signed his petition asking Thames Water and Southern Water to urgently reduce sewage discharges into the river Wey and to produce a plan to eliminate all such discharges over time. At his public meeting in November, Thames Water and Southern Water committed to imminent investment that will mean an 80% reduction in discharges by 2030. Thames Water has already shared its plans to invest £38 million this year, and more than £423 million by the end of 2026, which can be viewed by clicking on the attachment below.\nSecond, reduce the use of single plastics. Again, more than 90% of survey responses asked local supermarkets to increase the availability of proper recycling. Whilst the Government has already announced new plans to ban single-use plastics, as well as the introduction of a deposit return scheme which he has long been campaigning for. With clear backing from his constituents, Jeremy wrote to the CEOs of every supermarket in South West Surrey to ask what they are currently doing to ensure that we can recycle easily and effectively in-store, and also what further steps they will be taking to allow a wider variety of waste to be recycled.\nThird, make the Surrey Hills National Landscape a National Park. National Parks enjoy the highest level of protection in terms of landscape and scenic beauty. Following an intervention by Jeremy, Natural England announced last year that the Surrey Hills AONB was being considered for a boundary extension. The last phase of the process is for Natural England to now submit the final increased Surrey Hills AONB to the Secretary of State for final confirmation. You can read more about the Surrey Hills AONB expansion and other candidates areas for inclusion HERE.\nFourth, protect the neighbourhood plans. Jeremy has long supported more local involvement in planning decisions and is concerned about the number of applications being upheld on appeal because Waverley has not secured a five-year planning supply. Jeremy has met Michael Gove on numerous occasions to press for more of a local say in developments and better protection for neighbourhood plans.\nFinally, please do take a look at the leaflet below to see more of what Jeremy is doing to protect our wonderful Green Spaces. You can also read the letter from the Minister for Environmental Quality and Resilience, Rebecca Pow MP, explaining the Government’s position and confirming that the Secretary of State will be visiting South West Surrey soon!\nIf you would like more information or to get involved, please get in touch by emailing [email protected].",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_privacy/content_13.html": "This document outlines how Rt Hon Sir Jeremy Hunt MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Rt Hon Sir Jeremy Hunt MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Rt Hon Sir Jeremy Hunt MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Rt Hon Sir Jeremy Hunt MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Rt Hon Sir Jeremy Hunt MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_about-rss/content_42.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_about-sir-jeremy/content_3.html": "Sir Jeremy was born on 1 November 1966 and grew up in Surrey. He went to Charterhouse school in Godalming, a town where two different generations of his family have lived for nearly 60 years.\nAfter leaving school, Sir Jeremy studied at Oxford University, where he graduated with a first class honours degree in Politics, Philosophy and Economics. He then went on to work for a management consultancy firm before going to Japan for two years where he taught English and learnt Japanese. On his return to the UK, Sir Jeremy set up his own educational publishing business, Hotcourses. The company, which he no longer owns, employs over 200 people and has become the UK's largest publisher of guides and websites to help people find the right course or college (http://www.hotcourses.com). He also set up a charity to help AIDS orphans in Africa in which he continues to play an active role www.nyumbani.org.uk\nSir Jeremy was re-elected as Member of Parliament for South West Surrey in May 2010, increasing the Conservative majority from 5711 to 16,318. On first becoming an MP in 2005 he increased the Conservative majority from 861 to 5711. He is well-known locally for his supermarket surgeries and has campaigned actively on local issues including overdevelopment and local NHS services. He was closely involved in the successful fights to prevent the closure of the Royal Surrey and Milford Hospitals.\nYou can download Sir Jeremy's candidate declaration form below.\nIn December 2005 he was appointed Shadow Minister for Disabled People, where he successfully campaigned for the BBC to increase the amount of subtitling on its programmes. He also campaigned strongly for simplification of the benefits system for disabled people and individual social care budgets. In July 2007 he was appointed to the Shadow Cabinet as Shadow Secretary of State for Culture Media and Sport where he has campaigned for more philanthropy for the arts, local TV, superfast broadband, a schools Olympics and a strengthened domestic tourism industry.\nIn May 2010, Sir Jeremy was appointed Secretary of State for Culture, Olympics, Media and Sport in the new Conservative - Liberal Democrat coalition. From September 2012 to July 2018, Sir Jeremy held the position of Secretary of State for Health. He was reappointed in the role in January 2018 with the added responsibility of Social Care. In June 2018, Sir Jeremy became the longest serving Secretary of State for Health in British history.\nIn July 2018, Sir Jeremy was appointed Secretary of State for Foreign and Commonwealth Affairs, a position he held until July 2019.\nFrom January 2020 - October 2022, Sir Jeremy was elected Chair of the Health and Social Care Select Committee with cross-party support.\nOn 14 October 2022, Sir Jeremy was appointed Chancellor of the Exchequer https://www.gov.uk/government/people/jeremy-hunt\nOn 4th July 2024, following Parliamentary boundary changes, Sir Jeremy has been elected as the Member of Parliament for the new Godalming and Ash constituency. He served as Shadow Chancellor of the Exchequer from July to November 2024.\nSir Jeremy divides his time between Westminster and his constituency home in Hambledon. He married his wife Lucia in July 2009 and they have a son and two daughters.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-27th-january-2025/content_25.html": "GOOD AFTERNOON & welcome to my weekly update no.299\nToday is Holocaust Memorial Day - and 80 years since the liberation of Auschwitz-Birkenau. Thank you to King Charles for representing us on this sober and sad occasion which I discuss below alongside other national and local news.\nWHAT’S GOING ON IN WESTMINSTER\nNEVER AGAIN Many of us will watch the commemoration of the liberation of Auschwitz-Birkenau this evening. As a new MP I visited Auschwitz Birkenau nearly 20 years ago with young people from Godalming College. What I could not get out of my mind then was the way efficiency, normally a virtue, was twisted and harnessed for such a murderous purpose. What worries me now is something different, namely that democracy and freedom can no longer be taken for granted because of the recent rise of autocratic regimes. 80 years on, history must never, ever be repeated. One of the most extraordinary Holocaust survivors is Edith Eger, an American psychologist who wrote about how she survived with sheer mental willpower in a book called The Choice. She said, in words I can never forget, ‘the biggest prison you will ever live in is the prison you build inside your own mind.’\nREEVES HOBNOBBING The Chancellor is in fightback mode this week with a growth speech on Wednesday and hints she will approve a new runway at Heathrow. Many will say it’s a bit rich to be talking about growth after she has hammered small businesses with her national insurance increases - indeed all three of my surgery calls today were on just that. Planning rules do need overhauling, so if she is serious that is to be welcomed. But rather than killing businesses with tax rises, can she please fund public services by confronting the ballooning welfare budget and public sector productivity, still 6% below pre-pandemic levels? There was a recent Chancellor who made a start on that in case she wants to dust down some plans…\nTHE TRUMP KEIR CALL Yesterday Prime Minister Sir Keir Starmer had a phone call with President Donald Trump. Based on the reporting that followed, it was rather friendlier than many feared. In my experience the special relationship tends to get prioritised by US Presidents as soon as they start thinking about global security. So memo to Keir: cancel the Chagos deal, increase defence spending and don’t cosy up too much to China.\nNHS UPDATE For health buffs, last week’s Patient Safety Watch newsletter is worth a read. In particular I look at whether you can (as the government seems to want to) ignore A & E waiting times to focus exclusively on elective care. Unfortunately if the beds fill up with emergency patients, there are none left for hips and knees so the whole system has to be considered.\nWHAT’S GOING ON LOCALLY\nGUILDFORD HORROR SHOW Shocking news from Guildford Borough Council last week with the release of the investigative report by Heminsley Law into the £13.5m alleged fraud within their housing account. The report confirms numerous major financial and governance failings which allowed the fraud despite 13 red flags which officers ‘could or should’ have picked up. The LibDem imposed merger - or ‘collaboration’ - of GBC with Waverley has been a distraction which many believe meant the fraud was not picked up - and Waverley council tax payers are understandably worried they may now be on the hook. Guildford Opposition Leader Cllr Philip Brooker has called for the resignation of the LibDem leader and a criminal investigation is ongoing. Well done to the Guildford Dragon who have been forensic in their investigation on this for over a year.\nCHESTER BRIDGE OPENING DRAWS NEAR More positively we are perilously close to the bridge opening which will be a complete game changer for Ash residents. Signs for the next phase of work post bridge opening went up last week which prompted some concern that the level crossing might close before the new bridge is opened. I raised this with Cllr Matt Furniss and Cllr John Tonks who have confirmed that GBC is now waiting for the permit from Network Rail to close the level crossing in order to then open the bridge… really not long now!\nSURGERY CALLS My first call was to a Nick Harris, Godalming resident who represents the UK’s craft baking retailers. He wanted to talk about the way bakery shops have been hit with a triple hammer blow in the budget with the national insurance rise, the increase in the minimum wage and the reduction in business rates relief - alongside a massive blow on inheritance tax. We did not need these tax changes for public finances - welfare reform and public sector productivity improvements could have delivered just as much. I then spoke to an Ash resident and a Cranleigh resident, both with school uniform businesses which will be negatively impacted by another government initiative to simplify uniforms in the Schools Bill. They pointed out that the unintended consequence will be schools moving away from uniforms with a very detrimental impact on the school environment as well as costing parents more. It will also be bad for shops in the schoolwear sector, much of which is small family businesses trying to compete with the big clothing retailers.\nNO MORE GODALMING SAINSBURYS CAFE Sainsburys café is to close as one of the last 61 hot food counters and cafes (and 3,000 resulting job losses) are set to close due to Sainsbury’s nationwide cost cutting measures which many have linked to the budget national insurance rises. I am particularly sad as I used to do surgeries there. I have written to Sainsbury CEO Simon Roberts to ask if he is willing to rethink - and if not offer to another café operator. We know there is unlimited demand for coffee in Godalming!\nASH LODGE PARK COMMUNITY SPACE What should we do with the land that the NHS do not now want for a health facility? Last week I launched my campaign to find out resident views - and amazingly over 100 have already responded!). GBC unwisely did not progress the option for a community space on the lot and so the 5-year window in the s106 planning agreement has now lapsed. This means effectively the space is handed back to the developer. The latest from GBC is that Bewley Homes are looking into a sale to a residential care home provider, but I question if this is the community space local people envisaged…. Let me know what you think so we can keep this space for community use if we possibly can.\nClick on the image to watch the video...\nALFOLD SEWAGE A productive first meeting with TW’s Head of Waste Steve Crabb together with David Harding and Alice Keeping on the awful recurring sewage overflows. TW confirmed what Alfold residents are all too aware of - high groundwater and flooding are putting huge pressure on the sewage system following rainfall. This, together with leaky pipes and much needed upgrades, is causing these horrible (and unacceptable) sewage leaks. 'Infiltration' (seeping in) of groundwater into TW's sewage pipes is a major issue and so encouraging TW are about to reline sections of the main sewer. But with the Clappers Meadow pumping station running at capacity, Southern Water (who deal with sewage the southern half of the village) at capacity and now concerns over deliverability of the new homes at Dunsfold Park - we agreed that revisiting TW's plans is the next step. Meeting again in a few weeks - will keep you posted.\nCRANLEIGH HEALTH AND WELLBEING EVENT Thank you to Rosemary Hurtley and team for a brilliant event last Friday. A packed room of NHS healthcare providers, community groups, local Councillors and caregivers all came together to progress how the community can improve the health and wellbeing of the 33,000 Cranleigh and nearby villages population. Great speakers talking all things from social prescribing to fostering community connections. Please have your say and do fill out this survey the Cranleigh Villages group have put together.\nOPERA GALA AT THE GRANGE. The brilliant Meath Epilepsy Charity will be holding an unmissable evening of opera this summer. This star-studded Gala event promises a unique evening of opera at The Grange Festival, Hampshire on Sunday, 15 June 2025, at 4 pm. For more information or to book your tickets, visit: www.meath.org.uk/events/opera-at-the-grange Don't miss out - tickets are selling fast!\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community.\nAND FINALLY…You may be feeling chilly today but spare a thought for the crew of this cargo ship trapped in the ice on frozen Lake Erie. The coastguard are working around the clock to free them!\nSOCIAL MEDIA If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), Bluesky or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAs always, if you know anyone (a friend or neighbour perhaps?) who might like to receive this email, please do forward it on. Anyone can sign up here to receive them and can unsubscribe at any time by clicking on the box below or emailing me.\nThank you Altitude Cranleigh for another delicious coffee",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_jeremy-hunt-attends-canadian-wwi-event-milford/content_43.html": "Tweet Friday, 7 September, 2018 Media Jeremy Hunt attended a memorial event today on Milford Common to recognise the contribution the Canadian Army made during World War I. At the event a new war memorial was unveiled on the common.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-20th-january-2025/content_23.html": "GOOD AFTERNOON & welcome to my weekly update no.298\nA lot happening in the world - in Israel and the US in particular - and hugely emotional to see British-Israeli hostage Emily Damari reunited with her family. Locally fully 1,800 people have now replied to my mobile phone survey and - for the mobile operators - the results are not pretty!\nWHAT’S GOING ON IN WESTMINSTER\nWELCOME TO THE DONALD As you read this on Monday evening President Trump will have just been inaugurated in the most extraordinary political comeback of the century. There are lots of things people will disagree with him about but I do believe the world is safer with a strong America and he will be a strong President, as I said on Sky News this morning. How the Labour government should ‘deal’ with Trump? My advice to the PM would be threefold: put ideology aside and concentrate on common ground; remember that we are America’s closest security ally so cancel the Chagos Islands deal; and set an example to other European countries by increasing defence spending, as we should. If we do that there is every chance that the special relationship will go from strength to strength.\nDARE WE HOPE FOR PEACE? With the ceasefire seeming to go ahead, we finally seem to be getting some good news from Gaza, something I talked about on ITV's Peston show. (timestamp 31:20). There is speculation this is not a good deal for Israel but I would question that: if the remaining, living hostages are returned, it has surely massively strengthened its position. Hamas and Hezbollah are desperately weakened (if not eliminated), Assad has gone and Iran has lost nearly all its regional influence. It is just possible, with President Trump’s encouragement, we could be on the verge of a more peaceful era. Famous last words of course because as Jeremy Bowen said this morning the Middle East always proves the pessimists right. But I do believe things have changed - let’s hope so after all the terrible agony and bloodshed.\nBABY DEATHS IN THE NHS Last Friday I spoke on Radio 4’s Today show(time stamp 1:40:14) about the state of maternity safety in the UK. Speaking just before me was Fiona Winser-Ramm, who shared the heart-breaking story of how she lost her first baby daughter Aliona at Leeds General Infirmary just minutes after delivery. There is clearly an issue across the NHS where baby deaths have started rising again since the pandemic (having fallen 25% when I was health secretary after a huge effort by staff). We need to get on and implement the recommendations made in numerous inquiries, not least recruiting the 2000 midwives and 500 obstetricians we are still short of.\nWHAT’S GOING ON LOCALLY\nROYAL SURREY CANCER CENTRE Fantastic to see the build on track for completion late 2026. Once completed this will be one of Europe’s leading surgical centres able to perform surgery on an extra 7,000 patients every year. It’s also fascinating to learn about the build process: 180 pre-built modular units will be constructed in Hull and transported to site of which 57 units have been completed so far! So we should start seeing the centre taking shape by Spring. Meanwhile epic fundraising to equip the centre continues organised by the dedicated team at Royal Surrey Charity including the upcoming fun run on March 2nd. - can I tempt you to take on a challenge?\nMOBILE PHONE SURVEY Hundreds more of you have filled in my surveyfollowing mention in my newsletter last week - thank you! Follow my social media as the results for each area go out via local Facebook community boards. So far, over 430 Godalming and 602 Cranleigh residents have given their view (and no surprises people are confirming pretty dire reception across the whole of Cranleigh). Great ammunition for me to go back to the phone companies whom I am now meeting for the second time armed with the results.\nNO GAS IN GOMSHALL After learning on Friday many residents were still without gas (and water in some cases) days after a burst water main caused water to get into the gas pipes, I raised my concerns with the CEO of SGN Simon Kilonback who today confirmed supply has been restored to remaining homes over the weekend. But even a day without heating/hot water in January is no fun.\nWAVERLEY HOUSING CRISIS Very concerning news that the only new village in the borough, Dunsfold Park, is now not deemed by WBC as ‘deliverable’ which will put huge pressure on other areas. When you add in Labour’s recent doubling of housing targets, the five year housing supply drops to just 1.5 years meaning there is little hope of the local plan being afforded due weight and every chance of developers winning on appeal approval for entirely inappropriate development, as Councillor Austin makes clear in this article. Come on LibDem Waverley, you have had your eye off the ball on this for far too long…\nALFOLD SEWAGE Poor Alfold residents have had to endure raw sewage and toilet roll in their gardens and shockingly this is a repeat occurrence. I went to see them last week and have been on the case with Thames Water for months about this as it is totally unacceptable. Sewage upgrades here are due to be delivered via Dunsfold Park S106 so I am now entering discussions with Thames Water re alternative plans. I’m meeting with TW’s head of waste later this week. In the meantime take a look at my video below with brilliant County Councillor Kevin Deanus:\nClick on the image to watch.\nPLANNING BREACHES I’ve been contacted by Wanborough Parish Councillors over recent months frustrated at Guildford Borough Council’s lack of progress with planning enforcement issues over the agricultural land in Wanborough Fields. Good therefore to receive confirmation from GBC last week notices have been served pre-Christmas and more breaches identified - work ongoing! Thanks to Cllrs Matt Furniss and Sallie Barker (who is also Guildford Mayor) for pushing on this. I have also been pushing for an update from Waverley on Stovolds Hill breaches. They say they are working on serving notices to occupiers and say they continue close liaison with the Police.\nSURGERY CALLS My first call today was to a senior nurse about one of my biggest concerns which is patient safety in the NHS. She has responsibility for deteriorating patients at a major trust (not local) and like me thinks we should be doing much more to reduce preventable harm. She is going to help me understand how to improve the learning from deaths programme that I set up as Health Secretary. I then spoke to a Puttenham resident who has a medical condition which means her mother was one of her carers. Unfortunately her mum became unwell and she has been struggling to get the support she needs from Surrey so I will go into bat on her behalf.\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community.\nAND FINALLY…Today is Blue Monday, purported to be the most depressing day of the year, so chin up! But good if you are a travel agent because they actually invented the date to entice you to purchase a holiday! You will be pleased to learn scientists confirm this is nonsense - 2025 it's all up from here!\nSOCIAL MEDIA If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAs always, if you know anyone (a friend or neighbour perhaps?) who might like to receive this email, please do forward it on. Anyone can sign up here to receive them and can unsubscribe at any time by clicking on the box below or emailing me.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-13th-january-2025-0/content_9.html": "GOOD AFTERNOON & welcome to my weekly update no.297\nWitnessing the devastating wildfires in LA has been sobering and all our thoughts are with those who have lost loved ones. Keir Starmer and Rachel Reeves have not had the happiest of new years but locally lots has been happening including the early results of my mobile coverage survey.\nWHAT’S GOING ON IN WESTMINSTER\nBOND BLUES Rachel Reeves is currently learning an important lesson: the bond markets are totally impervious to political spin. Currently borrowing costs have risen to their highest level since the global financial crisis in 2008, partly because they expect interest rates to be higher in the US but partly also because of the budget which ramped up borrowing here by a massive £30 bn a year. When I was doing budgets one of the most important advisers was the Treasury’s Chief Economist, first someone called Claire Lombardelli (now Deputy Governor of the Bank of England) and then Sam Beckett. Both were excellent but had the terrifying job of advising me how markets would be likely to react. I wonder if Rachel Reeves had similar conversations. For the sake of all of us, she needs to come up with a growth strategy that makes sense - and that markets trust.\nMUSK VS STARMER Last week we also saw an escalation in the spat between Labour and Elon Musk – this time over the government’s refusal to hold another national inquiry into grooming gangs. Normally there would only be limited interest in the musings of a Californian tech billionaire but this is different: firstly he owns X (formerly Twitter) so in some ways is like a traditional media baron, the Rupert Murdoch of the age if you like. And secondly he has the ear of the man who will be President in a week’s time. Most Brits are unimpressed with what he has said but that doesn’t make it any less of a challenge for the PM, not least given it has dominated his first week back. In case you wanted to remember a time when he was more friendly to the UK government, here is a pic of him meeting a certain former Chancellor.\nTHIRLWALL INQUIRY Last Thursday I travelled up to Liverpool to present evidence to the Thirlwall Inquiry. I took the opportunity to put on record my apology to the families of Lucy Letby’s victims for any omissions on my watch as health secretary. It was a thoughtful exchange in which I discussed at length how difficult it is for the government and NHS to implement the literally hundreds of recommendations received from public inquiries, Royal Colleges and regulators. I was pretty conscientious about implementing the Francis Inquiry recommendations into Mid Staffs but even some of those took a long time including getting a second medical opinion about every hospital death which I only managed to push through when I was Chancellor.\nAI SUPERPOWER Today the prime minister launched his plan to secure the UK’s position as a global leader in AI. They are good recommendations by someone called Matt Clifford who I have a lot of time for. The question is whether they are ever going to get implemented. They could transform public services - if the government is willing to take on the unions. And if we had them before the budget, maybe we would not have needed those damaging tax rises.\nWHAT’S GOING ON LOCALLY\nTHE RESULTS ARE IN! Thank you to over 1,500 of you who responded to my mobile phone signal survey (which is still live so please continue to fill it in as we crunch the numbers). The results confirm what we have suspected - over half of us think the reception outside our homes is POOR. It is particularly bad in Cranleigh and in many of our villages. But the data has also thrown up a few surprises and so armed with this vital information I am now reverting to the four main phone signal providers, EE, O2, Three and Vodafone so we get the upgrades we urgently need across the constituency. More details to follow in posts in the coming weeks, but for now here is the overall picture….\nNO GAS IN GOMSHALL At possibly the coldest possible time of year hundreds of Gomshall residents have no gas supply after a burst water main leaked into the gas network yesterday. All of the water must be removed from the network before SGN can turn the gas back on - hopefully later today. Shere division Councillor Bob Hughes is on the case locally and I am keeping a close eye on this - email me on [email protected] if you need assistance.\nALFOLD SEWAGE IN FRONT GARDENS I caught up with Alfold residents last week with Cllr Kevin Deanus and Cllr Jane Austin. Absolutely shocking to see how locals have had to cope with raw sewage spewing up in their front gardens… and in some cases inside their homes. To add insult to injury Thames Water haven’t even cleaned up properly, with toilet roll (and worse) still visible. This is just not acceptable - as regular readers will know I’ve been onto Thames Water since I became an MP and will be asking CEO Chris Weston to urgently get on the case (again). The current Alfold sewage system is ancient and groaning following the addition of so many homes in the area. Upgrades needed urgently!\nCRANLEIGH LOTTERY FUNDING SUCCESS Fantastic news last week of the £780,000 grant for Cranleigh Village Hospital. Amazing to think this was England’s first cottage hospital and an inspiration for the NHS. The historic 1447 building will now be restored so it can be used by the local community as a hub for health, wellbeing, education and by community groups. Huge congratulations to Trevor, Howard and the entire team at Cranleigh Heritage Trust who have worked so hard to ensure this important building is recognised and will be preserved.\nCLEAN ENERGY FROM AMMONIA Dunsfold Park which is home to one of the most innovative clean energy companies in the world. AFC Energyproduces the world's most advanced ammonia to hydrogen converters. Ammonia is much easier to transport than hydrogen and with their machines to convert it into hydrogen overcomes the problem of distribution. Thanks to John, Mike and the team for inviting me and also for giving me an excuse to go and purvey the array of jumbo’s parked up on the airfield.\nBARLEY MOW REOPENING When The Barley Mow in The Sands closed last year 117 local investors clubbed together and raised the cash to buy it for the community. The pub reopened in October 2024 and is doing a roaring trade - what a fantastic local success story. Huge congrats to new Landlords Lee and Helen; the official reopening was jam-packed and gave me the opportunity to exercise my vocal chords (hence my frown!).\nGUILDFORD TO GODALMING GREENWAY Work begins this week on upgrades to the Old Portsmouth Road A3100. Work includes widening the western footway for a shared footway/cycleway, a much needed new signal crossing near Tilthams Corner Road and road tables at the entrances to the Rugby Club and Broadwater Lake. Pain ahead with traffic lights between now and March - but the improvements will be well worth it for pedestrians and cyclists. For more detail take a look at Shalford Cllr Matt Furniss’ post.\nPHYLIS TUCKWELL shops are an incredible success story with £3m of sales annually and extremely high quality merchandise. Good to catch up with CEO Sarah Church and her Godalming team on Friday - and thank them for the superb care the organisation provides to so many people locally.\nBRAMLEY - YET MORE PAIN This time it's Scottish Gas Networks digging up the roundabout because they are (as a precaution following the fuel leak) double lining their pipework. Small quantities of methane have been detected in the area which are possibly natural. Three way traffic lights and major queues on the A281 - avoid if you possibly can! Thames Water is also threatening to put lights further up at Gosden Common but Cllr Jane Austin is already on the case to get these moved.\nA3 CLOSURE Slightly outside Godalming and Ash but relevant, the A3 will be closed this coming weekend near Wisley for the installation of the first ever healthland bridge over the motorway to link Ockham to Wisley Commons as a wildlife corridor. The 3 year project to upgrade the Wisley interchange is due to be completed Summer 2025 …… and it can’t come a day too soon!\nDUST OFF YOUR DJ Never mind talk of Blue Monday....it's time to book your tickets for the first Friends of the Cancer and Surgical Innovation Centre (CASIC) Gala Dinner Dance. Taking place on Friday March 28th at the Hogs Back Hotel, the event will include a live pianist, magician and dancing to swing band, 'Freddy and the Fedoras'. All proceeds will go to the campaign to raise funds for the new Centre at the Royal Surrey. They cost £80 each to include welcome fizz and a delicious 3-course meal. Don't miss out, get your tickets from: tickettailor.com/events/friendsofrschcasic/1507619\nSURGERY My surgery call today was to an Ash resident about reforming the process of making a will. She has encountered what looks like deception in the writing of a relative's will and had some excellent suggestions about how to improve the system which I will raise with the Lord Chancellor. Let me know if you have had similar issues.\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community.\nAND FINALLY …. Humbling to watch LA firefighters battling the flames on the ground and see huge clouds of water and fire retardant being dropped by aircraft.\nSOCIAL MEDIA If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAs always, if you know anyone (a friend or neighbour perhaps?) who might like to receive this email, please do forward it on. Anyone can sign up here to receive them and can unsubscribe at any time by clicking on the box below or emailing me.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_cancer/content_29.html": "New centre will meet growing demand for cancer surgery for people in Surrey and across the South East.\nRoyal Surrey NHS Foundation Trust is planning a new Cancer and Surgical Innovation Centre with the latest treatments and technology at its Guildford site. The Trust has confirmed today that it plans to invest £25 million into the new centre, with further funding sought through fundraising.\nRoyal Surrey is a nationally leading specialist cancer centre, with renowned expertise in the use of minimal access surgery and robotics combined with high-quality enhanced recovery peri-operative care. Demand for cancer surgery is growing as earlier cancer diagnosis opens up opportunities for effective surgical treatment of cancers at an earlier stage than has typically been possible in the past. Advances in oncology treatments have also improved the opportunity for effective surgical treatment. The new surgical facility will meet this demand and save lives.\nThe new centre is expected to include:\n- A redesign of Royal Surrey’s theatres to support modern pathways of care for a high volume of cancer surgery as well as benign specialties such orthopaedics and ophthalmology;\n- New spaces for patients to prepare, rest and recover from surgery;\n- New equipment and technology, including new robotic surgical equipment - surgical robots are predominantly used for cancer surgeries and benefits include fewer complications and faster recovery times;\n- New theatres to increase capacity - several thousand more patients will receive surgical procedures every year, including life-saving cancer surgery, lowering waiting times at a time of unprecedented demand;\n- A focus on ambulatory care (less than 24 hour stays) with a redesigned short stay surgery unit; and\n- Enhanced training and education facilities to support innovation and to train the next generation of surgeons.\nBy creating dedicated ‘green’ areas for surgery – areas that are protected from the risks of Covid – the new centre will also put the Trust in a stronger position to continue surgery uninterrupted in future pandemic or crisis scenarios.\nThe Trust has set aside £25 million in capital investment for the project and is seeking to raise additional funds through fundraising to enhance the design further and ensure the best possible range of new equipment can be procured\nLouise Stead, CEO, Royal Surrey said:\n“We are investing in the health of our community and the future of our Trust. This new centre will be a pioneering institute for innovation and excellence for a wide range of surgical specialities, including a high volume of cancer surgery. We are looking forward to working on this new centre with our colleagues and community so that people in Surrey and the South East region can access the latest treatments in an innovative, modern setting.\n“Jeremy Hunt’s support for this project will make a real difference to this project and we’re looking forward to working together on this campaign.”\nJeremy Hunt MP has campaigned to support the Centre and is leading a fundraising campaign for the crucial additional funds. He said:\n“Royal Surrey is already a leading light in cancer care but this new centre will be a game changer locally and further improve the cancer services and care on offer. With the challenge of early cancer diagnosis and the demands of the Covid backlog, this news could not have come at a better time so I want to make sure we finish the job by raising the extra funds necessary to make sure the centre reaches its full potential. Today's news is a fantastic first step, though, and given half of us will get cancer in our lifetimes is one that is relevant to every family locally. Please support the campaign with a donation however large or small.”\nSir Simon Stevens, former Chief Executive of the NHS said:\n\"Improving cancer survival rates was a big priority for both Jeremy and I when we worked together. Jeremy's high-impact campaigning has spotlighted the need for the Royal Surrey's new Cancer and Surgical Innovation Centre, so it's great that NHS funding has now been agreed.\"\nThe centre will serve not only the population local to Royal Surrey but also the wider catchment area (up to 3 million) served by networked surgical specialties. The final scheme when developed will be subject to usual planning and NHS processes. Work on the centre is expected to begin in 2022.\nRoyal Surrey is a leading specialist cancer centre integrated with all the services of an acute general hospital, meaning that cancer patients receive the full range of care needed in the one place.\n- How to donate: anyone can support this fantastic initiative. You can find out more by visiting: https://www.royalsurreycharity.org.uk/appeal/surgerycancerappeal or by calling the Royal Surrey Charity on 01483 464146.\n- Clinical services that will use the new centre include: general surgery, colorectal, hepatobiliary, oesophagogastric, breast, skin, trauma and orthopaedics, urology, gynae-oncology, gynaecology, ophthalmology, ear, nose and throat (ENT), maxillofacial, pain, cardiology and interventional radiology.\nhttps://www.royalsurreycharity.org.uk/appeal/surgerycancerappeal",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-10th-march-2025/content_14.html": "GOOD AFTERNOON & welcome to my weekly update no.303\nWhat a glorious sunny weekend - but like the political weather the actual weather changes fast! A slightly quieter Westminster week as all eyes peeled on the Ukraine talks in Saudi Arabia. Locally I met with mobile phone company Three to discuss network coverage and we have - finally - some good news for Bramley on broadband.\nWHAT’S GOING ON IN WESTMINSTER\nWILL 2.5% BE ENOUGH? Most of us locally strongly supported Keir Starmer’s decision to raise defence spending (although I would have preferred the savings to come from the welfare bill). But how can we use the money to grow the economy? Last week in the Daily Mail I argued that if we spend it cleverly we can become the world’s next Silicon Valley meaning that one day our investment into defence could pay for itself. But only if we channel some of the money to exciting high tech start ups like those at the University of Surrey where I spoke to students recently.\nWELFARE REFORM AT LAST? In fairness the government is finally talking about it, more to fill in black holes in public finances than for defence. But why only £5bn or so of savings? By 2029 we could save £40 billion in real terms if we reduced the working age benefit bill to - merely - 2019 levels. That is enough money to avoid tax rises and increase defence spending and doesn’t feel unreasonable now the pandemic is behind us. Check out this recent Telegraph article written by my former chief of staff Adam Smith on the topic.\nVAT ON SCHOOLS DEBACLE Today it has emerged that large numbers of private school teachers are being made redundant by this unnecessary and punitive new tax. Thanks to a petition, in parliament a Westminster Hall debatewas held, frustratingly at the same time as the PM’s Ukraine statement so I could not attend. No sign of any blinking on the policy by the government which is very disappointing.\nWHAT’S GOING ON LOCALLY\nMOBILE PHONE UPDATE Last Thursday I met with mobile phone company Three to present the results of my mobile phone signal survey and push for investment into the right areas in Godalming and Ash. Our constituency coverage data is now brilliant - over 2,000 of you responded to my survey (thank you) which means I can really hold the networks to task. Some specific examples we raised include paying for parking via apps in Cranleigh and Godalming High Street, and the lack of signal along the B2128 through Wonersh and Shamley Green on the way to Cranleigh (plus many more). It was too early for Three to go into detail re network improvements as their merger with Vodafone is now confirmed but to get the merger over the line they promised £12bn of network investment so I am hopeful.\nBRAMLEY FUEL LEAK UPDATE Last week Cllr Jane Austin met the Openreach team for an update and for once the news is positive; Openreach engineers are onsite reconnecting customers (now down to 180 impacted from 350), but there is still fuel and fuel vapour in the ground which is entering Openreach’s network. Asda and the Bramley Recovery Group continue working on the clean-up, and Bramley residents and businesses are working hard to bounce back following the huge disruption. Restoring WIFI and phone connections will be a huge win for those who have had to cope for nearly a year without it.\nInside an Openreach cable. These are lined with paper which has become saturated with fuel in places and each of the 4,800 wire carries 50 volts. Now I understand why they have been so concerned.\nA GAS LEAK IN ASH on Shawfield Road has meant more traffic carnage locally. SGN team were working overnight last night but it looks like the road closure and diversion is in place 24/7 until the 17th. More detail from Cllr John Tonks here.\nNO CALL-IN FOR BLACKWELL SOLAR FARM. Last year I supported Compton Parish Council in the call-in because it's a hugely prominent site plus a portion of the land has been recommended for inclusion in the Surrey Hills National Landscape in the recent expansion consultation. Unfortunately the Secretary of State has decided it will not be ‘called in’ and so the permission stands. Meanwhile, we still await further news of the National Landscape (AONB) expansion areas since the consultation closed in December - keeping everything crossed.\nPLANNING FOR YOUR FUTURE Age UK Surrey are holding an event to provide information to facilitate people having early conversations about their future and those around them, including support available to look after loved ones, financial planning and more. Event on 11th March Church, Mill Mead, Guildford 11am – 1pm and one to be held online 7pm – 8.30pm on the same day. Well worth attending - to register click here.\nSUPPORT THE BRILLIANT PHYLLIS TUCKWELL As you may know, only 25% of their funding comes from the NHS and they rely on the generosity of the community to raise the rest. Local residents Michelle and Graham are supporting this cause by fundraising and collecting raffle prizes for tombolas and events throughout the year - can you help them with donations of any kind of gift – perfume, wine, beer, or any new, unopened items? If so email Michelle at [email protected].\nSURGERY CALLS My first call was to a local resident about the social care provision for his wife who is bed bound. The domiciliary care is costing him huge amounts of money at a level that is totally unsustainable. He is also having to spend hours trying to get through NHS bureaucracy to make the case for continuing care which I will support him with. I then spoke to a Witley resident who has a business (seqrd.com) which makes superb platforms that help schools and parents keep their children safe online. I have been talking to DfE to see if it could get adopted nationally. I then spoke to a Cranleigh resident about an issue with Thames Water (yet again). Her concern was that the huge leak she had to deal with was not put on the TW website so there was no publicly accessible information.\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community. If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), Bluesky or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAND FINALLY…Thank you to Nicholas Grant for posting these amazing shotsof 7 red kites flying in Shalford. Once hunted to almost extinction, the population has recovered and red kites can now be seen all over the UK. So impressive with their distinctive wingtips.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_sir-jeremys-business-background/content_19.html": "Before entering Parliament, Sir Jeremy was an entrepreneur who set up two successful businesses following a period living in Japan.\nHis first business was a marketing consultancy firm based in the technology field. With his business partner, Sir Jeremy built the company up to 27 people before leaving it to start up his second business. The business was eventually sold to the Farnham-based Whiteoaks consultancy.\nSir Jeremy's second business was a publishing firm, Hotcourses. Having taught English in Japan, he believed there was an opportunity for a publisher to produce guide books to help students who wish to study abroad. The first guide he produced was in Japanese. It was designed to help Japanese students choose the right school or college in the UK.\nHotcourses has subsequently become the UK's largest publisher of guides and websites to help people find the right course or college. It now publishes in 8 languages and employs over 200 people. It has a foundation that funds education for children affected by HIV/AIDS in Kenya.\nSince being elected as a Member of Parliament, Sir Jeremy has stepped aside from all management responsibilities in the company he set up in order to focus on his parliamentary duties.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_category_Newsletters/content_7.html": "Constituency Update 24th March 2025 24th March 2025 GOOD AFTERNOON & welcome to my weekly update no.305 Westminster is gearing up for the Chancellor’s Spring Statement which was supposed to be a quiet affair but... Newsletters\nConstituency Update 17th March 2025 17th March 2025 GOOD AFTERNOON & welcome to my weekly update no.304 A lot happening internationally, nationally and locally. As we find out if Putin will enter discussions on a... Newsletters\nConstituency Update 10th March 2025 10th March 2025 GOOD AFTERNOON & welcome to my weekly update no.303 What a glorious sunny weekend - but like the political weather the actual weather changes fast! A slightly... Newsletters\nConstituency Update 3rd March 2025 3rd March 2025 GOOD AFTERNOON & welcome to my weekly update no.302 Last week was a very fraught week in international relations which kept me busy with my former Foreign... Newsletters\nConstituency Update 10th February 2025 10th February 2025 GOOD AFTERNOON & welcome to my weekly update no.301 One more week until half term and Westminster feels a little quiet (but it is Monday). But last week was far... Newsletters\nConstituency Update 3rd February 2025 3rd February 2025 GOOD AFTERNOON & welcome to my weekly update no.300...yes that’s right this is my 300th newsletter! If you are one of those who has been reading them right from... Newsletters\nConstituency Update 27th January 2025 27th January 2025 GOOD AFTERNOON & welcome to my weekly update no.299 Today is Holocaust Memorial Day - and 80 years since the liberation of Auschwitz-Birkenau. Thank you to King... Newsletters\nConstituency Update 20th January 2025 20th January 2025 GOOD AFTERNOON & welcome to my weekly update no.298 A lot happening in the world - in Israel and the US in particular - and hugely emotional to see British... Newsletters\nConstituency Update 13th January 2025 13th January 2025 GOOD AFTERNOON & welcome to my weekly update no.297 Witnessing the devastating wildfires in LA has been sobering and all our thoughts are with those who have... Newsletters",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-6th-january-2025/content_36.html": "GOOD AFTERNOON & welcome to my weekly update no.296\nHappy New Year! I hope you all enjoyed a relaxing Christmas break. In Westminster MP’s are back at work with Keir Starmer hoping for a New Year reset after a rocky first 6 months as PM and Elon Musk continues his X rampage. On Friday I returned to LBC as guest presenter taking calls on their morning show, plus lots of discussions about Surrey devolution over the weekend.\nWHAT’S GOING ON IN WESTMINSTER\nGUEST PRESENTING ON LBC Last Friday I sat in for James O’Brien as guest presenter on LBC. During my slot I spoke to a number of callers about topics ranging from government efficiency to the war in Ukraine. Now that President Trump has appointed Elon Musk to cut spending and improve efficiency in the US, should we try to do the same here? The answer may seem quite academic (lots of callers hated the idea of billionaires advising the government) but if we don’t, Rachel Reeves is highly likely to come back with more tax rises. On Ukraine, we discussed the shape of the peace deal Trump is likely to impose on Ukraine. If it is based on current de facto borders, how do you stop Putin coming back for another bite? I suspect Keir Starmer will have to decide whether he is prepared to commit British troops (perhaps alongside French and German ones) - one of the biggest foreign policy calls he will have to make.\nNO MORE DOOM AND GLOOM I also recently spoke with the Financial Timesabout the state of the UK’s economy. I argued that instead of fuelling a mood of “declinism” Labour should be more confident in our strengths – and we have plenty of them including services, tech, and life sciences. Labour’s strategy to talk down the UK’s economic situation is a political ploy to blame their predecessors for difficult decisions - but is doing more harm than good as today’s figures from the British Chamber of Commerce show.\nPATIENT SAFETY Today we had a big announcement on government plans to reduce waiting lists - but how do we make sure more targets don’t lead to another Mid Staffs scandal? As some of you may know, my return to the backbenches has meant that I have been able to return to my campaign to reduce avoidable death in the NHS by improving what is called patient safety. This includes occasionally guest writing a fortnightly newsletter for Patient Safety Watch - a charity of which I am the current chair. In the most recent edition, I covered topics such as how UK patient safety compares with other countries, safety vs targets in A&E, young people’s wellbeing, how staff shortages and ‘toxic’ culture has led to mothers and babies being harmed, and the compounded harm experienced by patients following safety incidents. I suggest anyone interested in these issues having a read.\nCARE REFORMS Last week the government announced plans for a review into social care. Like Paul Johnson in today’s Times, this felt like kicking the can down the road. The issue is not agreeing to a plan (there was cross-party support for the Dilnot reforms and the care fees cap which I put into law) but getting the Treasury to fund them. The previous Conservative government delayed implementation by 2 years because of the energy shock but Rachel Reeves cancelled them altogether. Louise Casey will report in 2028 so nothing will now happen this parliament - something bitterly disappointing for the sector.\nWHAT’S GOING ON LOCALLY\nFLOODING AND FREEZING Following the sleet and rain over the weekend Flood alerts are in place on the River Wey especially around Elstead and flood warnings remain in place forUpper River Wey, Tillingbourne, Cranleigh Waters, River Blackwater and Cove Brook. There are numerous flooded roads and sadly Wey Court car park in Godalming is flooded once again. Please do take care given the freezing temperatures forecast overnight and there is moresnow/rain/ice forecast later this week.\nSURREY ELECTIONS POSTPONED? Labour’s plans to replace Surrey’s two tier council system with a single tier of unitary authorities are moving forward and Surrey wants to be in the first wave. I agree with Surrey leader Tim Oliver who says we would benefit massively from a unitary authority and elected mayor. But I also want to make sure we don’t end up carrying the can for Woking’s £2 bn debt so will be watching this one like a hawk. This week Tim will respond to the government requesting postponement of Surrey’s May 25 local elections to 2026, with Mayoral elections for the new authority in 2027. Postponing any election is never ideal but it would avoid the scenario of three sets of elections in as many years (and avoid the huge resulting costs). Over to Angela now…\nALFOLD SEWAGE Unbelievably residents of Alfold have been hit once again with sewage overflowing in gardens especially in the Clappers Meadow area - thanks to Cllr Kevin Deanus and Alfold Clerk Julie Flenley for keeping me updated. This is completely unacceptable and keeps on happening - my most recent exchange with Thames Water on this issue was only back in December - with Thames Water CEO Chris Weston. We have a meeting lined up to discuss this and Thames Water's wider programme to address sewage issues, but in the meantime I have asked for solutions for Alfold residents again today. We need action - not sticking plasters. On a different note we were all incredibly sad to learn of the untimely death of Ed Mcudden, Chair of Alfold PC, on Christmas morning. Ed was a lynchpin of his community and will be sorely missed.\nCHRISTMAS IN CRANLEIGH I spent Christmas lunch with the Hunt kids in Cranleigh Village Hall at a charity lunch organised for people who would have been on their own. What a lovely occasion - thanks so much to Marc and Fiona Scully and Natasha Victor for organising it.\nWHAT A HOOT Watch out Godalming residents for the newest feathered resident about town. Can you find this plus the three other installations across Godalming? Amazing work Waverley Chainsaw Woody - thank you!\nCRANLEIGH REPAIR CAFE A huge well done to Caroline and the team for a very successful morning yesterday at Cranleigh Repair Cafe with around 60 repairs carried out. The next session is Saturday 1st February at the Bandroom so please email on [email protected] to book in your slot as the team are usually very busy. What a fantastic successful enterprise.\nUNWANTED CHRISTMAS GIFTS? From time to time we all receive a gift that perhaps we don't need or isn't quite to our taste. But, don't despair...as the Friends of the Royal Surrey will happily collect the item and use it to raise funds for the Cancer and Surgical Innovation Centre... where we are raising funds for six new operating theatres which will enable 7,000 more patients to be treated each year. Simply call 07932 411108 or email [email protected]\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community.\nAND FINALLY ...We were treated to a truly fantastic display in the skies last Friday with Venus and the Moon shining very close together - here are some spectacular images in case you missed it.\nSOCIAL MEDIA If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAs always, if you know anyone (a friend or neighbour perhaps?) who might like to receive this email, please do forward it on. Anyone can sign up here to receive them and can unsubscribe at any time by clicking on the box below or emailing me.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-10th-february-2025/content_22.html": "GOOD AFTERNOON & welcome to my weekly update no.301\nOne more week until half term and Westminster feels a little quiet (but it is Monday). But last week was far from quiet: Waverley and Guildford Borough Councils are to be abolished and replaced with 2-3 ‘unitary’ authorities across Surrey with a Surrey Mayor on top. Surrey elections will not now happen on 1st May but we will elect councillors for the new authorities in a year’s time…perhaps the first time for a while I have agreed with something the government has done although the devil will be in the detail as I explain below…\nWHAT’S GOING ON IN WESTMINSTER\nMORE RESEARCH, LESS CANCER Last week was World Cancer Day and I was pleased to announce that I have a new job - as an Ambassador for Cancer Research UK. They are the world’s largest independent, non-governmental cancer research charity and have been responsible for groundbreaking research into early diagnosis, immunotherapy and new medicines which have helped to double cancer life expectancy since the 1970s. I accepted the role at a dinner in the House of Lords last week. Details here of the amazing use they will put the money to - hopefully some of it at the amazing new Cancer and Surgical Innovation Centre we are fundraising to build at the Royal Surrey.\nFURIOUS FARMERS Today farmers from across the country gathered outside Westminster to demonstrate and show their support for the Westminster Hall debate on the really damaging family farm tax. See my equally furious exchange last week with Secretary of State Steve Reid asking him to justify it. I cannot believe it was thought through but doubt we will see any kind of u-turn - at least until the November budget when hopefully a reverse-ferret will be buried thick in the undergrowth.\nMy question to Steve Reid\nDON’T RETALIATE Just in case you think I only talk to the right wing press, check out my interview last week on n the Guardian’s Politics Weekly podcast, where we covered a range of topics including last year’s Godalming and Ash election, winning back trust, and critically, Trump’s tariffs. My advice to the government, for what it’s worth, is not to retaliate if we are hit. Timely because today we have indeed been hit with 25% steel tariffs. We have always flourished as an open free-trading economy - indeed were the first country in the world to abolish tariffs unilaterally in 1846. If others stop listening to Adam Smith and David Ricardo there is no reason for us to!\nWHAT’S GOING ON LOCALLY\nSURREY ELECTIONS DELAYED Last Wednesday Angela Rayner confirmed Surrey will be included in the first wave of councils to undergo local government reorganisation and devolution. In order to do this the Government has confirmed Surrey elections are to be delayed to allow the 12 Surrey Councils to agree and put forward an outline business case for a unitary structure by mid March. It’s a very short timescale and we are likely to end up with 2-3 Surrey unitaries with Guildford and Waverley councils either joining up with Woking or a larger West Surrey unitary. I am in favour of unitary authorities and elected Mayors. But the big issue is what happens with Woking’s £2 bn debt which could overwhelm us. We should not and MUST NOT pick up the tab for another council’s irresponsibility…watch this space.\nCIL LEVY LUNACY Last week I reported on Waverley residents erroneously being hit with huge CIL fines by Waverley Borough Council and the successful motion by Waverley councillors - brilliantly orchestrated by Cllr Jane Austin - to help them get the money refunded. Following up on this my fellow Farnham MP Greg Stafford and I escalated via parliament writing to the Housing Secretary to urge the Government to investigate. Good to see our campaign already garnering national attention because this has been hugely distressing for those impacted. CIL is really important mechanism for developers to contribute towards local infrastructure, but this legislation was never intended for householders to pay. Listen to Greg on BBC Radio Surrey this weekrepresenting residents.\nCHESTER BRIDGE OPENS! Great news … but residents have faced a couple of chaotic days with traffic queues and complaints about poor signage leading to lots of vehicles u-turning at the former crossing. Come on Guildford Borough Council - sort this out please. Phase 5 of the bridge work is now underway so watch out for bus diversions. Residents are also wondering what is happening with the originally planned pedestrian crossing bridge. Cllr Matt Furniss has confirmed the plan is now for pedestrians to continue to cross via the level crossing.\nWAVERLY PLANNING FREE FOR ALL Last week Alfold residents faced the grim news of an application for 400 homes by developer Thakeham plus a consultation for a further 80 homes by Wates. Both have understandably caused widespread concern: sewage and other infrastructure in the greater Alfold area is already exceeding capacity. Waverley is now very exposed to speculative development. It is partly because Angela Rayner has doubled housing targets to 1,481 homes per year (which over 20 yrs would equate to a new Farnham plus a new Godalming) but it’s also because the current Waverley administration has consistently under-delivered housing with only 1.3 years housing supply instead of the 5 years it is supposed to have. For more on this take a look at my post.\nNO SWIMMING IN CRANLEIGH Cranleigh pool has been closed for one month and counting because the ceiling tiles became saturated with condensation and risked falling into the pool. We are now one month into the pool closure and frustrations are increasing, not least in Cranleigh Swim Club because they can’t train properly. The closure also means no children's swimming lessons or fitness classes. Waverley are telling us it will be 5-7 weeks until the pool can reopen, but I am also seeking reassurance the centre will be kept going until the new leisure centre opens scheduled for Autumn/winter 2026 (we hope).\nST EDMUNDS, BUSBRIDGE VISIT What are your hobbies? Your daily routine? What would you like to do next? The best questions today from the brilliant school council. Thank you for a lovely visit and to Mrs Higgins for inviting me.\nFantastic visit to St Edmunds in Busbridge\nSURGERY Today’s first call was to an Ash Green resident about the increasing number of older people without children to rely on for their care, estimated at 1.2m people over the age of 65. Because of the lack of informal family care, they are 25% more likely to enter residential care and die two years sooner. She sensibly asked whether the Office for National Statistics were planning to collect accurate data on the number of people in this situation as recommended by the House of Lords Select Committee. I will find out. I then spoke to a couple whose son is at the Meath and has had his physio package withdrawn by the NHS after over 30 years. It really does sound like a crazy decision so I will raise it with Surrey Heartlands NHS.\nBROOK - NETWORK RAIL WORK More long road diversions in place. But glad to see Network Rail are engaging and Cllr Bob Hughes is on the case.\nGODALMING CHAMBER OF COMMERCE does a superb job representing businesses who are finding things pretty tough at the moment - thank you for inviting me to your lunch and enduring my endless anecdotes about starting my own small business!\nSHALFORD The brand new Mill Court Care Home in Shalford looks fantastically comfortable with very caring staff - congratulations to Maria on being employee of the month!\nCOMPTON MEETING Have your say on the planned traffic calming measures in Compton: my video below.\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community. If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), Bluesky or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAND FINALLY…. interesting to read about the new study from the University of Surrey about the impact of these ultra-processed foods (UPFs) on mental health, finding a surprising link to higher depression risk. But no judgement from me on plant burgers described in the article!\nThat’s it for this week. I will be back after the half term break",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_vat-independent-schools/content_28.html": "From January 2025 the Government will be charging VAT on independent schools including special educational needs (SEN) schools. This Labour policy will have wide reaching and deeply concerning implications across both our private and state school sectors. Jeremy, Gregory Stafford MP and Damian Hinds MP had a a big public meeting in Farnham about this after which Jeremy co-signed a letter to Rachel Reeves with Greg Stafford MP calling her out on this.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_constituency-update-17th-march-2025/content_33.html": "GOOD AFTERNOON & welcome to my weekly update no.304\nA lot happening internationally, nationally and locally. As we find out if Putin will enter discussions on a ceasefire, we could also see the schools bill pass through the Commons unpicking years of rising standards (read this shocking article by the former Chief Executive of Ofsted). Locally the LibDems have got into a pickle after being found out trying to rig the new unitary council structures for political advantage.\nWHAT’S GOING ON IN WESTMINSTER\nBONFIRE OF THE QUANGOS The biggest news in Westminster law week was the government’s announcement that the UK’s biggest quango, NHS England, is to be scrapped. In what is probably one of the biggest reforms in recent history, NHS England is to be brought back into the Department of Health. As I said on Sky News, even though I was Health Secretary when NHS England came into being, it is the potentially right thing to do. The NHS is failing because it is micro-managed from the centre. So if this leads to greater autonomy, it could work. If, however, we just move from bureaucratic to political centralisation, the new structure will fail. In Parliament on Thursday, I asked Wes Streeting which it was going to be - and he gave an encouraging response.\nPANDEMIC PLANNING Speaking of the NHS, last week I wrote an article in the Express about key lessons learned from the pandemic. Our Covid deaths were around the international average - but the price we paid was having to switch off too much other NHS care - leading to today’s long waiting lists. The lesson is more capacity in the system - and making sure the rest of the NHS (cancer care for example) is able to function even if A & E's are overwhelmed.\nPUTIN’S PLAY News broke last week that Ukraine would agree to a 30-day ceasefire, admittedly after pressure from Trump which made many of us wince. But if Putin is now pressured to do the same, it could be the start of something no one previously thought possible, namely a 1953-style Korean ‘freezing’ of the conflict. I talked about this during a Channel 4 interview The challenge is that unlike in Korea, the US is not willing to provide security guarantees and European countries may not be able to - but full marks to Keir Starmer for trying to put such a ‘coalition of the willing’ together.\nWHAT’S GOING ON LOCALLY\nUNITARY SHENANIGANS This week Councillors across Surrey will give their view on the best structure for Surrey. Surrey County Council believe a two unitary format is best and some of the 11 Districts and Boroughs are expected to support three… but it will be Labour’s local government Minister Jim McMahon who makes the ultimate call. I support two unitaries (East Surrey and West Surrey) for a simple reason: I am worried that Woking’s £2.2bn debt is too much for us to absorb if we were just Guildford/Waverley/Woking without impacting on council tax bill. The Lib Dems are trying to rig the process to create three because they think they would control the smaller units, as revealed in this rather shocking video in which the Waverley LibDem leader asks the Council Chief Executive to ‘skew’ the report (and the supposedly apolitical CEO responding ‘this had already been done’.) Many councillors across Surrey have called for his resignation citing breach of the code of conduct. Take a look at the clip… what do you think?\nClip just prior to Waverley's Executive Council meeting last week.\nMOBILE MISSION Broadband for Surrey Hills, known as B4SH, is a totally remarkable community organisation that has now sorted full fibre connections to over 600 homes in remote locations in the Surrey Hills. What I didn’t realise, until I met them on Friday, is that the fibre they have laid can also help mobile phone reception. So I am going to put them in touch with the networks and the Minister, Chris Bryant, who has agreed to visit Cranleigh. I worked closely with BT when I was doing the broadband rollout as Culture Secretary but when you meet B4SH you see that small really is beautiful!\nBroadband 4 Surrey Hills\nCRANLEIGH PRIMARY Cranleigh CofE Primary has been through a tough period but is really turning a corner under Head Kate Pelazza. Brand new playground, refurbished classrooms and highly motivated staff...thank you for your brilliant work and an excellent visit.\nSHERE Always delightful to pay a trip home to Shere and have lunch at the Dabbling Duck. I love planters - but aren’t these ones just a bit oversized? Take a look at my video...\nClick to watch\nCANCER CENTRE GALA DINNER TICKETS SOLD OUT! But fear not, you can still get involved and support the brilliant fundraising campaign for the new Cancer and Surgical Innovation Centre by bidding on something in their fantastic auction. Everything from gin and wine tours to one off jewellery, fine dining and holidays... check it out here: Friends of Royal Surrey Charity Gala Dinner\nSUPPORT FOR NATASHA Many of you will know I lost my brother Charlie to sarcoma some 18 months ago. This truly awful disease is a vicious form of cancer and I continue to support Sarcoma UK, a charity that funds vital research. My constituent, Zoe Ruffley’s lovely step-daughter Natasha has been living with Myxoid liposarcoma for over four years now. Zoe is climbing Kilimanjaro for Natasha and to support Sarcoma UK. Please join me in supporting her - go Zoe!\nOut in beautiful Chilworth with the team on Friday\nJOIN ME Want to get more involved with my brilliant election-winning team locally? Email me at [email protected] to help support our work in our community. If you would like more regular updates of my work locally and nationally, do follow me on Facebook, X (Twitter), Bluesky or Instagram. Please don’t always assume I will see every comment on a post - email is a more reliable way to ensure a reply.\nAND FINALLY…we are all frustrated with roadworks and utility company traffic lights at every turn - what about an air-taxi under development by this Californian firm? A short trip would be zero emission and can fit four passengers - perfect!",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_jeremy-and-greg-stafford-mp-write-secretary-state-housing-communities-and-local-government/content_18.html": "MPS DEMAND URGENT ACTION ON UNFAIR CIL CHARGES HITTING HOMEOWNERS\nJeremy Hunt MP, Member of Parliament for Godalming and Ash, and Gregory Stafford MP, Member of Parliament for Farnham and Bordon, have called on Housing Secretary Angela Rayner to urgently investigate current legislation around the Community Infrastructure Levy (CIL) after multiple homeowners were hit with devastating, unexpected financial demands.\nCIL is meant to ensure developers contribute to infrastructure, but exemptions exist for self-builders, annexes, and small extensions. However, in Waverley, a growing number of residents have faced life-changing bills due to incorrect paperwork, confusion over retrospective applications, and no legal right to appeal works have started.\nLocal Conservatives have exposed seven cases of homeowners blindsided by CIL demands ranging from £45,000 to £235,000. In one instance, Mr. and Mrs. Dally of Godalming were hit with a £70,000 charge in 2020, forcing 65-year-old Mr. Dally to increase his mortgage payments by £400 a month until he turns 70. He now fears he will have to sell his home to pay the debt.\nA Conservative-led motion at Waverley Borough Council has triggered a discretionary review for those affected, but MPs insist the problem demands national action.\nHunt said: “This unintended consequence of CIL legislation has been a completely traumatising experience for Waverley residents hit with these huge levies, seemingly from nowhere. Those impacted now have a route to getting the money repaid – but they should not have had to fight for five years in some cases to be listened to.”\nFarnham and Bordon MP Gregory Stafford added: “The enforcement of this charge in Waverley has been devastating. One of my constituents is unable to pay and is accruing enormous interest on a debt they should be exempt from. While there is now cross-party support locally to fix this, I will keep standing up for residents and urging Labour to act nationally.”\nThis issue extends beyond Waverley. West Berkshire Council recently identified similar problems, leading to 18 cases being addressed and £200,000 set for repayment. MPs fear this is part of a wider national failing, with cases also emerging in Horsham and Bracknell Forest.\nCllr Jane Austin, Leader of the Conservative Group at Waverley, said: \"More cases are coming to light - and we are talking about huge sums. We’ve forced the council to act at the local level, but if national legislation is failing homeowners, it must be reviewed.\"\nHunt and Stafford are now demanding urgent government intervention to ensure CIL does not unfairly penalise homeowners. They have also pressed Waverley Borough Council to follow West Berkshire’s lead in rectifying these errors immediately.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_campaigns_clean-sewage-our-rivers/content_38.html": "We’ve had lousy service from Thames Water and the amount of sewage in our rivers is unacceptable. As your MP I had three different CEOs down for public meetings, secured over £200m of more investment and secured a public promise from OFWAT that we will not have to pay for their management failures in our bills. As Chancellor I changed the rules so the money from river pollution fines goes back into cleaning up rivers.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_jeremy-writes-transport-secretary-asking-update-step-free-access-ash-vale-station/content_27.html": "Jeremy has written to Secretary of State for Transport to request an update on Ash Vale Station and the promised feasibility study.\nJeremy has written to Secretary of State for Transport to request an update on Ash Vale Station and the promised feasibility study.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_myplan/content_16.html": "As local MP for SW Surrey, I have spent nearly 20 years working with local residents to get things done. And our work has paid off. Together we’ve:\n- Secured £25m to build a new Cancer and Surgical Innovation Centre at the Royal Surrey;\n- Got £4.5m invested for new flood defences in Godalming to stop the Wey fooding local homes;\n- Made the roads safer with average speed cameras secured for Bramley, Chiddingfold and Witley\n- Held Thames Water to account - with three successive CEOs coming to public meetings and committing to compensation and £206m of new investment to stop sewage overflows by the end of next year.\nGreat progress - but there’s much more to do… here’s my 6 point plan to make a positive difference in Godalming and Ash:",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_jeremy-hunt-signs-holocaust-educational-trusts-book-commitment/content_17.html": "This week Jeremy Hunt MP for South West Surrey signed the Holocaust Educational Trust’s Book of Commitment, in doing so pledging his commitment to Holocaust Memorial Day and honouring those who were murdered during the Holocaust as well as paying tribute to the extraordinary Holocaust survivors who work tirelessly to educate young people.\nToday marks the anniversary of the liberation of the Nazi concentration and death camp Auschwitz-Birkenau, the site of the largest mass murder in history.\nIn the lead up to and on Holocaust Memorial Day, thousands of commemorative events will be arranged by schools, faith groups and community organisations across the country, remembering all the victims of the Holocaust and subsequent genocides. The theme for this year’s commemorations is ‘How can life go on?’\nAfter signing the Book of Commitment, Jeremy Hunt MP commented:\n“Holocaust Memorial Day is an important opportunity for people from South West Surrey and across the country to reflect on the tragic events of the Holocaust. As the Holocaust moves from living history, to just history, it becomes ever more important that we take the time to remember the victims and also pay tribute to the survivors. I would encourage my constituents to show their support for such an important day.\nKaren Pollock MBE, Chief Executive of the Holocaust Educational Trust, said:\nOur mission is to educate young people from every background about the Holocaust and its contemporary relevance. We are very grateful to Jeremy Hunt for signing the Book of Commitment, signalling a continued commitment to remembering the victims of the Holocaust as well as challenging antisemitism, prejudice and bigotry in all its forms.",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_category_Blog/content_44.html": "Regular constituency update - October 19 19th October 2020 Good afternoon and welcome to my regular South West Surrey update No. 78. As of today, we have a total of 722,409 positive cases of COVID-19 with 43,646... Blog\nRegular constituency update - October 12 12th October 2020 Good afternoon and welcome to my regular South West Surrey update No. 77. As of today, we have a total of 603,716 positive cases of COVID-19 with 42,825... Blog\nRegular constituency update - October 8 8th October 2020 Good afternoon and welcome to my regular South West Surrey update No. 75. As of today, we have a total of 544,275 positive cases of COVID-19 with 42,515... Blog\nRegular constituency update - October 5 5th October 2020 Good afternoon and welcome to my regular South West Surrey update No. 74. As of today, we have a total of 502,978 positive cases of COVID-19 with 42,350... Blog\nRegular constituency update - October 1 1st October 2020 Good afternoon and welcome to my regular South West Surrey update No. 73. As of today, we have a total of 453,264 positive cases of COVID-19 with 42,143... Blog\nRegular constituency update - September 24 24th September 2020 Good afternoon and welcome to my regular South West Surrey email update No. 72. As of today, we have a total of 409,729 positive cases of COVID-19 with sadly 41... Blog\nRegular constituency update - September 21 21st September 2020 Good afternoon and welcome to my regular South West Surrey email update No. 71. As of today, we have a total of 394,257 positive cases of COVID-19 with sadly 41... Blog\nRegular constituency update - September 17 17th September 2020 Good afternoon and welcome to my regular South West Surrey email update No. 70. As of today, we have a total of 378,219 positive cases of COVID-19 with sadly 41... Blog\nRegular constituency update - September 14 14th September 2020 Good afternoon and welcome to my regular South West Surrey email update no. 69. As of today, we have a total of 368,504 positive cases of COVID-19 with sadly 41... Blog",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_accessibility/content_32.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_royal-surrey-gala-dinner-raises-ps22k/content_6.html": "Friends of the Royal Surrey held a wonderful Charity Gala Dinner and Dance at the Hogs Back Hotel\non Friday 28th March, with local MPs Jeremy Hunt and Greg Stafford acting as auctioneers for the\nnumerous lots donated by local businesses and supporters.\nThe event raised a staggering £22,000 for the Cancer & Surgical Innovation Centre Campaign which\nwill open next year and enable the treatment of an additional 7,000 patients.\nLouise Stead, CEO of Royal Surrey NHS Foundation Trust, said: “The gala dinner was a fantastic event,\nand wonderful to see so many people coming together to support Royal Surrey Charity’s Cancer and\nSurgical Innovation Campaign. This campaign, has now raised over £570,000, which is a huge\nmilestone. These funds will help bring cutting-edge surgical equipment and technology to the new\nsurgical centre at the Royal Surrey, ensuring patients receive the very best care.\n“A huge thank you to community fundraising group, Friends of Royal Surrey Charity and Jeremy Hunt\nMP who initiated this campaign from the start. Their unwavering dedication, generosity and\nenthusiasm to this cause is to be commended and truly makes a big difference.\n“The surgical centre is due to open in late 2026. It will add six state-of-the-art operating theatres, a\nrecovery area, and dedicated short-stay wards. Importantly, it will enable us to perform 7,000\nadditional surgeries annually.”\nJeremy Hunt, MP for Godalming and Ash said:\n\"What an amazing event by the Friends of the Royal Surrey Charity. Huge thanks to organiser, Judith\nStorey and her team for all their hard work and to the event sponsors: CHD Living and Surrey AI. This\nis a considerable boost to our fundraising campaign.\"\nJudith Storey, Friends of the RS Chair, said\n“ We are thrilled to be marking 30 years of the hospital Trust’s charity supporting extraordinary care. We are very grateful to everybody who bid and won\nprizes in our first on-line auction run by Superstars. The lots were varied - from golf games to\njewellery, to F1 British Grand Prix tickets. There was even a hand painted Nepalese illustration made\nusing one cat’s hair as the brush!We were honoured to have the Deputy Mayor and Deputy Mayoress of Guildford join as our guests.\nThank you to everyone for their support, and thank you for believing in the power of kindness and\ncompassion. Let’s remember that Generosity Saves Lives.”\nGreg Stafford, MP for Farnham and Bordon said:\n\"It was a privilege to attend the Royal Surrey Charity Gala Dinner and witness\nsuch generosity and community spirit in support of one of our local hospitals.\nThe funds raised will make a meaningful difference to patients and their families. I pay tribute to\neveryone who contributed and to those who worked tirelessly behind the scenes to make the evening\nsuch a success.\"\nThe event was made possible through the generous support of our sponsors CHD Living and Surrey AI\nCentre, which will mean funds raised can go directly to enhancing the new centre, which aims to\nrevolutionise cancer surgery in Surrey and the Southeast. Building work began last year on the centre,\nwhich will house six new operating theatres and help to build on Royal Surrey’s world-class services in\nrobotic and non-robotic surgery. As a regional centre for cancer services, the Royal Surrey supports a\npopulation of up to 3 million (around 4.5% of the UK’s population) and is home to the fourth largest\ncancer centre in the country.\nFor further information\nContact Judith Storey Chairperson\nMobile 07932 411108\nFriends of the RSCH Cancer and Surgical Innovation Centre\nIn support of Royal Surrey Charity, Egerton Road, Guildford, GU2 7 XX\nRegistered as a charity in England and Wales. Charity number 1049776",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_campaigns_make-surrey-hills-national-park/content_30.html": "I secured the first expansion of the Surrey Hills AONB in 50 years - meaning more green space will be protected locally than ever before. I now want an even higher level of protection: to turn the Surrey Hills into a National Park, meaning it will get funding from DEFRA and become its own planning authority. I grew up in the Surrey Hills around Shere and I want to ensure it remains special for future generations of children as it was for me.\nFor more information visit: https://www.jeremyhunt.org/news/surrey-hills-aonb",
  "https_www_jeremyhunt_org_/https_www_jeremyhunt_org_news_category_Reports/content_37.html": "Jeremy Hunt's Annual Report 2022 20th January 2023 Please click on the report for a round up of 2022. Reports"
}