{
  "https_www_richardgraham_org_/https_www_richardgraham_org_e-news/content_19.html": "Skip to main content\nRichard Graham\nMain navigation\nAbout Richard\nAbout Gloucester\nNews\nCampaigns\nIn Parliament\nContact\nRichard Graham\ne-news\nTweet\nRichard regularly sends out his enews. You can sign up to receive it\nhere\n.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_about-gloucester/content_5.html": "Gloucester is 5.5 square miles of culturally diverse city with an unrivalled history. We are known for our manufacturing capabilities, from matches to ice cream to valves, dental drills, nuclear, energy, cyber and components for the defence industry – we have always been making things!\nGloucester also has many regeneration challenges and a lack of real confidence.\nBut we have a great Cathedral, a world class rugby team, a university campus, a new Business School in 2018 and many high quality schools.\nWe may be a small city but small can be beautiful and Gloucester certainly punches above its weight!",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_voting-eu-withdrawal-bill/content_27.html": "Many of my constituents have been in touch with me recently on issues to do with the European Union and the Withdrawal Bill amendments. What is the Bill about and what are the main issues about the amendments?\nMany of my constituents have been in touch with me recently on issues to do with the European Union and the Withdrawal Bill amendments. What is the Bill about and what are the main issues about the amendments?",
  "https_www_richardgraham_org_/https_www_richardgraham_org_all-party-parliamentary-china-group/content_18.html": "I’m the Chair of the All Party Parliamentary China Group (APPCG) which was established in 1997 to widen the parliamentary contribution to the UK-China bilateral relationship. The APPG aims to ensure parliamentarians are kept well informed on China, and to act as a platform for discussions on all issues of importance to the UK-China relationship.\nThe APPCG has continued to offer parliamentarians opportunities to visit China and see first hand the opportunities and challenges on the mainland and in Hong Kong. The APPCG membership has risen to 312, with 10 new members from the 2017 intake. You can find out more about the APPCG on its dedicated website: http://appcg.org.uk/",
  "https_www_richardgraham_org_/https_www_richardgraham_org/content_1.html": "Latest News The underestimated value of persistence Over the last 14 years I’ve been incredibly fortunate to have three… What’s new in Gloucester's schools I know the announcement of a General Election dominates the news, but schools… What’s happening at GP surgeries? What’s happening at GP surgeries? One of the most popular urban myths at the… Find me on Facebook Campaigns Which route for cyclists in Gloucester City Centre? The old (current) Sustrans cycling route through Gloucester City Centre takes… Spiking After a case of spiking raised by his constituent, Maisie Farmer, Richard laid… Environment From ivory to recycling, bees to renewables, there is plenty going on to…\nThe underestimated value of persistence Over the last 14 years I’ve been incredibly fortunate to have three…\nWhat’s new in Gloucester's schools I know the announcement of a General Election dominates the news, but schools…\nWhat’s happening at GP surgeries? What’s happening at GP surgeries? One of the most popular urban myths at the…\nWhich route for cyclists in Gloucester City Centre? The old (current) Sustrans cycling route through Gloucester City Centre takes…",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_rights-british-citizens-europe/content_33.html": "It's important for British citizens living in Europe to be absolutely clear that the British Government's starting point in the EU withdrawal negotiations was to settle citizens' rights at the beginning, seperately and first. The European Union rejected this and insisted that \"nothing is agreed until everything is agreed\". Yesterday I questioned representatives from various groups representing British citizens in Europe.\nThe retention of freedom of movement for British citizens living in Europe would be an absolutely crucial outcome from our exit from the EU and it has got to be a key negotiating objective in the EU withdrawal negotiations.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_useful-contacts/content_9.html": "Councils\n- Gloucester City Council – www.gloucester.gov.uk – 01452 396396\n- Gloucestershire County Council – www.gloucestershire.gov.uk – 01452 425000\nHelpful Numbers\n- Alzheimer’s Society – 0300 222 11 22\n- Citizens Advice Bureau (CAB) – www.gloucestercab.org.uk/\n- Gloucester Law Centre – www.gloucesterlawcentre.co.uk\n- Free law clinic – 01454 720827 or 07977 597709\n- Legal ombudsman – 03005 550333\n- Gloucestershire Royal Hospital – www.gloshospitals.nhs.uk – 0300 422 2222\n- Gloucestershire Self Harm Helpline – 0808 801 0606\n- Guide and Pals – 08456 583888 or 08000 151548\n- Gloucestershire Constabulary – http://www.gloucestershire.police.uk or 101\n- Listening Post Counselling Service – 01452 383820\n- Samaritans – 08457 909090\n- NHS Dentist Locator – http://nhsdentistlocator.co.uk/\n- Job Centre Plus helpline and benefit enquiries – 0345 608 8545\nMore detailed information on all benefits can be found at www.direct.gov.uk\nHomelessness\nGloucester City Mission: http://www.gloscitymission.org.uk/\nJobs & Training\n- Youth Support Team – http://www.whatnowglos.co.uk/ – 01452 426900\n- Job Search – http://www.glosjobs.co.uk/\nPublic Transport\n- Public Transport – www.travelinesw.com\n- Stagecoach – http://www.stagecoachbus.com/ – 01452 418630\nAttractions\n- Cinema – www.cineworld.co.uk/cinemas/gloucester-quays\n- Gloucester Rugby – www.gloucesterrugby.co.uk\n- Folk Musem & Glos City Musem – http://venues.gloucester.gov.uk/freetime/museums/\n- Marketing Gloucester – http://www.thecityofgloucester.co.uk/about-us\n- Aspire Leisure – http://www.aspiretrust.org.uk/ – 0845 643 4203\nUseful Links\n- Gloucester Conservatives\n- The Conservative Party\n- Houses of Parliament\n- Gloucestershire County Council\n- Gloucester City Council\n- Gloucestershire Constabulary\n- Abbey Ward Conservatives\n- Gloucester Citizens Advice Bureau\n- Gloucestershire Association for Voluntary and Community Action\n- Volunteering Gloucestershire\nConstituents please be aware that anyone who has paid an Employment Tribunal Fee between 29 July 2013 and July this year can now apply for a refund under a new scheme. Ministers committed to reimbursing fees after a Supreme Court judgement on them. See more online: https://www.gov.uk/employment-tribunals/refund-tribunal-fees.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_category_Articles/content_37.html": "The underestimated value of persistence 29th May 2024 Over the last 14 years I’ve been incredibly fortunate to have three different perspectives of the greatest challenges we’ve been through. Locally being... Articles\nWhat’s new in Gloucester's schools 23rd May 2024 I know the announcement of a General Election dominates the news, but schools matter. A few months ago I wrote to you on improvements seen across Gloucester’s... Articles\nWhat's happening to the Walls Club in Barnwood? 1st May 2024 This is something slightly different: not a big global or national issue but a very specific local one: what’s happening at Gloucester’s Walls Club? The Walls... Articles\nA big day for pensioners 10th April 2024 Some residents have said they were surprised there was nothing in the 2024 Budget about pensions. And in one sense they’re right - because the two main... Articles\nWhat’s new and exciting in Gloucester Docks? 5th April 2024 The recent story of Gloucester Docks can so far crudely be divided into three phases: 1: Regeneration of Victorian Warehouses as offices and accommodation... Articles\nWhat's happening with Rwanda? 28th March 2024 I’m sometimes asked why I voted for the Rwanda Bill, or even how could I have done so. So in one sentence: as part of actions to reduce the number of immigrants... Articles\nEducation - a remarkable success story 7th March 2024 Talking to the Head Teacher and pupils at Field Court Infants, asking Grange Primary pupils to get involved in tree planting and visiting Altus School’s pupils... Articles\nWhat’s New in Dentistry? 16th February 2024 It has been a bad time for anyone trying to see a dentist. The post-pandemic continuation of a huge backlog of dental work and an outdated NHS/dentists contract... Articles\nWhat are we doing to protect our pets and animals? 16th February 2024 The idea that a pet was ever only an object, a possession like a chair, was never one anyone signed up to. But that’s how it was in law until 2022. We changed... Articles",
  "https_www_richardgraham_org_/https_www_richardgraham_org_campaigns_spiking/content_8.html": "After a case of spiking raised by his constituent, Maisie Farmer, Richard laid a Ten Minute Rule Bill that seeks to make the act or intent to spike a specific and individual criminal offence.\nThe Spiking (Offence) Bill was heard on Wednesday 26th January 2022. Richard withdrew the second reading after the Home Secretary agreed to look into making spiking an individual offence with a report due back by Autumn 2022.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_cdn-cgi_l_email-protection/content_31.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_banning-electric-shock-collars-dogs/content_34.html": "Dog owners know training a dog, especially a young puppy, takes time and patience. But I don’t think trying to take a short cut by using electric shock collars is a good idea at all.\nAnd I agree with the Kennel Club that electric shock collars used to punish certain sorts of behaviours in training dogs is bad for their welfare. This is backed by DEFRA research.\nSo I’m supporting the call to ban electric shock collars. They’re already banned in Denmark, Austria, Germany and Sweden and should be here too.\nAnyone looking for help training a dog can try local classes in Gloucester - there are details on the Kennel Club website or via google: https://www.thekennelclub.org.uk/…/dog-training-clubs-in-g…/\nBut let’s look after dogs properly and ban electric collars. If you agree then comment below.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_campaigns_environment/content_14.html": "My commitment to the environment\nGloucester, and Gloucestershire in a wider sense, has an intrinsic appreciation for the countryside and our beautiful green spaces. To ensure we do not lose this wonderful aspect of our community, we must look to protect, regenerate, and create areas of green space. Such examples can be seen in how I regularly help clean local brooks, creating new community gardens, and supporting the creation of a new green energy park in Hempsted.\nPlease find more in-depth links to my various Environmental campaigns here:\nhttps://www.richardgraham.org/news/sudbrook-community-garden-opening",
  "https_www_richardgraham_org_/https_www_richardgraham_org_exiting-eu-select-committee/content_25.html": "Richard Graham was a member of the Work and Pensions Select Committee from May–November 2010, and July 2015-June 2017.\nSince June 2017 he has been a member of the Select Committee on Exiting the EU.\nRichard Graham was a member of the Work and Pensions Select Committee from May–November 2010, and July 2015-June 2017.\nSince June 2017 he has been a member of the Select Committee on Exiting the EU.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_what-are-we-doing-protect-our-pets-and-animals/content_41.html": "The idea that a pet was ever only an object, a possession like a chair, was never one anyone signed up to.\nBut that’s how it was in law until 2022. We changed it to reflect what we all know - pets are part of the family, they’re sentient, and they’re incredibly important to us.\nSo this is a roundup of what’s changed on animal welfare in general and pets in specific, but let me first give some family context.\nI was lucky to grow up with pets - a tortoise (Tonks) in Africa, rabbits and dogs in England. My first dog, a King Charles Cavalier, was called Crispin as he was born on St Crispin’s Day (date of the Battle of Agincourt for those sensibly aware of history). He was, as for so many children, everything.\nIn Kenya, as a diplomat, Anthea and my Jack Russells went with us everywhere we went, and the same back here in Gloucester with Twiglet, who some readers may remember.\nShe lived until 19, and surely watched more cricket than any other dog (she never came on the pitch, except at the end of a game to congratulate me on dropping a crucial catch).\nTwiglet had an interesting relationship with our cat, which is something other families will have been amused by. They tolerated each other in public, but were closer in private: and she grieved when the cat died much earlier.\nIt is also rumoured that Twiglet used to go to the Cathedral for evensong on a Friday.\nHer successor, Tamu, also black and tan, half Jack Russell half long haired dachshund and now four months old, is equally keen on Robinswood Hill, Tredworth Cemetery and other favourite haunts for dog lovers. She hasn’t yet met a dog as small as her, but as I keep telling her diamonds come in small packages.\nYou get the point: I’m keen on animals in general - we had sheep before coming to Gloucester - and pets and dogs in particular.\nI have written on this issue several times over the years on https://www.richardgraham.org/news/gloucester-mp-welcomes-government-draft-bill-animal-sentience and https://www.richardgraham.org/news/animal-cruelty-cctv-slaughterhouses-and-microbeads.\nSo I was keen for and strongly supported legislation over the last 14 years which has:\n- Banned the live exports of farm livestock for fattening and slaughter to outside the British Isles\n- Recognised many animals as sentient beings\n- Banned the importing of hunting trophies to the UK\n- Banned the use of electric shock collars\nLike many of you I also felt it was time to tighten up laws on puppy farming, and voted for Lucy’s Law in 2020 which banned the third-party commercial sale of puppies and kittens. Now, anyone wanting to get a new puppy or kitten must buy direct from a breeder or adopt from rescue shelters.\nIt was incredibly disappointing therefore that the first person in the city to be convicted of this new offence was Gloucester Councillor, Alastair Chambers.\nHe was sentenced in December 2023 to 150 hours (18 months) of community payback and has been banned from dealing with animals for 10 years. I hope this sends a clear message that illegal puppy farming is a serious crime.\nDuring and after the pandemic we all became more aware of the importance pets had on our mental wellbeing. This is one reason why we are also changing the law, through the Renters (Reform) Bill, to allow renters to have their pets live with them without special permission from landlords.\nMore controversially there has been the consultation over XL Bully dogs, and the results convinced the government to implement a ban on XL Bully dogs on 31st December 2023. It was possible to get a certificate of exemption after neutering the dog but that process has now expired and anyone now seeking one should contact the police.\nI know this isn’t universally popular with my constituents but there was a strong national feeling that something must be done after a number of very aggressive attacks on both other dogs and humans – including earlier this month in Essex.\nSome feel we haven’t gone far enough on Animal Welfare: it is true that the original wide-reaching ‘Kept Animals’ Bill proposed has been shelved because of concerns that the Lords would amend the Bill in new ways unhelpful (for example) to British farmers.\nHowever, the King’s Speech made clear that we intend to bring forward measures from that bill as single-issue legislation – we have already seen this with the Livestock Exports Bill and the Pet Abduction Bill (whose scope is narrow).\nIn a nutshell we’ve made or proposed a lot of changes on animal welfare: too many for some and not enough for others. This may be a sign we’ve got it about right, but you are the judges – I know many pet owners would like to see loud fireworks banned, for example, but it is hard to see how this could be enforced effectively.\nUltimately you are the judges of whether these changes made through the law are helpful. Do let me know your thoughts by e mail on [email protected]\nBest regards",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_week-parliament-brexit-and-trade/content_36.html": "Richard Graham was a member of the Work and Pensions Select Committee from May–November 2010, and July 2015-June 2017.\nSince June 2017 he has been a member of the Select Committee on Exiting the EU.\nIn Autumn 2012 I was appointed as the Prime Minister’s Trade Envoy to Indonesia, then in August 2015 and in January 2016 to the ASEAN Economic Community, Malaysia and the Philippines.\nTrade Envoys are a network of Prime Minister appointed Parliamentarians in the Lords and Commons, drawn from across",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_gloucesters-new-green-energy-park-and-new-100000-tree-hempsted-woods/content_20.html": "Gloucester’s new green energy park and new 100,000 tree Hempsted Woods\nWe’ve put a few toes in the water on renewable energy in Gloucester before. The City Council put up a small wind turbine on Alney Island in 2008. The Gloucestershire Solar Co-op was created in 2010. I tried to get a leading insurance company to provide solar panels on all our schools in 2011-12. That proved too complicated legally. Most promisingly Tidal Lagoon in Power relocated to Gloucester in 2014 to launch its case for a Tidal Lagoon in Swansea.\nI spent a huge amount of time supporting this campaign as Chair of the Marine Energy All Party Group, and launching the positive Hendry Review. But eventually that project failed, largely on the cost to the taxpayer as offshore wind prices tumbled.\nBut this time I can report to you on something that is very big and definitely happening. Here’s the summary:\nGloucester will soon produce bio mass, solar and wind power and possibly hydrogen energy as well: a new wood with (eventually) more than 100,000 trees. How?\nThis is an aerial view of the c.360 acre Enovert owned Recycling Centre in Hemspted. The City Centre is at about one o’clock off this view.\nOn it I’ve marked the main ingredients of the plan (and rough acreage involved). Basically almost all of this site will now become a generator of green energy and compost or form part of the new Hempsted Woods so we now have an outline plan, a committed business, the land and the scope to achieve more homegrown renewable energy of our own than any other city in Britain.\nThis has all been made possible by stopping landfill of waste from the county going into the ground at Hempsted. By transferring Gloucestershire’s residual waste (ie black rubbish bags) to the waste to energy plant at Javelin Park, the old tip on the edge of the River Severn at Hempsted has become a pure Recycling Centre - and the land of this enormous c.360 acres site instead of landfill is now available for something much more creative.\nThe owner - Enovert - is an operator of waste resource facilities around England. They have already transformed former landfill sites into country parks (Lyme and Wood Pits Country Park in Liverpool) with public open spaces and strong community ties. Ours will now be the first to be transformed into renewable energy generation alongside an ecopark.\nIn September 2019 I organised the first meeting with Enovert and the City Council and wrote in an e news then that: “The goal of a Greener Gloucester for residents, with green energy opportunities for our city and a biodiversity park is a real one, and something I will do all I can to help bring about.” That became one of my six pledges in the snap General Election of 2019 and this is now the implementation of that pledge.\nSince then we’ve had many meetings and 15 months later Enovert CEO Mark Silvester, City Council Leader Richard Cook and I yesterday planted 73 of the first 2,000 willow trees around the Household Recycling Centre with 4,000 more to come - from which to generate coppiced biomass directly into the existing Western Power Development (WPD) grid connection, which already generates 4MW a year of gas from landfill.\nOver the next week Enovert will formally apply for planning permission for the first phase of 8,000 solar panels (or 2MW) of solar energy for local businesses and all the energy needs of Enovert’s operation at Hempsted and the Household Recycling Centre operated by Ubico. Once phase two is finished (another 8,000 panels and 2MW) the solar farm is intended to cover 98 acres of land on the site.\nSo our Recycling Centre’s energy consumption will be entirely provided by green energy generated there - a great example of what can be achieved in the Net Zero Challenge by business. Meanwhile alongside the site in Spinnaker Park a recent investor are expanding and consolidating their presence in our city, not least because their energy will now be provided from Gloucester’s Green Energy Park.\nThis shows that producing our own green energy can not only help business be greener, but boosts inward investment as business looks for green solutions.\nEnovert's next plan is to consider two wind turbines - all subject to rigorous environmental and planning laws.\nThe last and perhaps most exciting phase will then be looking at generating hydrogen - with the possibility (for example) of providing hydrogen powered buses around our city and county. This would heavily reduce the current fumes from diesel powered buses and Gloucester’s carbon emissions and improve air pollution as well. That could be a reality within three years if all goes well.\nAt the same time Enovert will develop a new c.250 acre Hempsted Woods with 100,000 native tree species planted, left to wild but partly accessible to walkers and school groups. Enovert will have further discussions with organisations like the Woodland Trust, the Glos Wildlife Trust and the Woodland Carbon Trust to develop this vision which will include a chance for businesses and individuals to offset our carbon emissions by paying for trees here in Hempsted.\nRichard Cook, Mark Silvester and I discussing the Gloucester Green Energy and EcoPark\nIf it works then Enovert will have a model to export elsewhere to their other 13 sites. In fact there are over 2,000 landfill sites in England alone where similar action could happen. So we need Gloucester’s Green Energy Park to succeed.\nThat means above all City Council support - particularly for planning - which Leader Richard Cook (who has been planting trees for years) and officers are committed to provide. But it also means business and community support and we’ll all be involved in that. There would have been school children with us yesterday if it wasn’t for the pandemic: but they will be soon. I want every child in Gloucester to plant a tree here.\nIn the year of the UK hosting the Climate Change summit COP26 there could be nothing that shows my and our commitment more than launching Gloucester’s Green Energy Centre & Eco Park. This whole project is financed by the business itself, not the taxpayer, and it could not happen without Enovert and its CEO’s huge drive to see this happen - setting a precedent that will transform their business, and help transform Gloucester.\nI believe this is an incredibly exciting environmental and green energy development in Gloucester, and will transform perceptions of our city as well as make giant leaps to meet our city’s Net Zero targets. Making Gloucester Britain’s Greenest Small City is an achievable goal not hyperbole.\nPS Let me know your reactions and what more we can do to be a greener city on [email protected]",
  "https_www_richardgraham_org_/https_www_richardgraham_org_privacy/content_3.html": "This document outlines how Richard Graham processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Richard Graham\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Richard Graham.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Richard Graham, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Richard Graham via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_my-statement-sue-gray-report/content_28.html": "Dear Constituent,\nThank you for your mail following the Gray Report, and I hope you will forgive me for answering you all with the same statement (which will also go on my website, www.richardgraham.org)\nSue Gray’s interim report into the Alleged gatherings on Government Premises was published on Monday and the Prime Minister then answered questions for two hours.\nLet me summarise the key points from both, give my reaction and summarise what could happen next:\n- The Report\nThe 9 page report (‘the investigative work is now essentially complete’) covers 14 alleged events on 12 different days. Sue Gray states that the Metropolitan Police (‘the Met’) has decided to investigate 10 events. She notes that ‘it is not for me to make a judgement on whether the criminal law has been broken: that is properly a matter for law enforcement’.\nSome constituents have asked me if this is the first time a Prime Minister has been caught up in a police enquiry. It isn’t: there was a police enquiry on a cash for honours issue when Tony Blair was PM.\nHer main points on the context:\n- Government officials and special advisors supporting the PM or other Ministers ‘continued to attend their offices.. as permitted by an exemption under the regulations’\n- ‘Tight knit groups of officials and advisors worked long hours under difficult conditions in buildings that could not be easily adapted as Covid secure workplaces..the PM’s flat and the Downing St garden are in close proximity to the offices and serve a dual office and private purpose’\n- ‘These challenges, however, also applied to key and frontline workers across the country who were working equally, if not more, demanding conditions, often at risk to their own health’\n- ‘The hardship under which citizens across the country worked, lived and sadly died while observing the Government’s regulations and guidance rigorously are known only too well’\nHer general findings:\n- ‘Some of the behaviour surrounding these gatherings is difficult to justify..some of the gatherings in question represent a serious failure to observe..the high standards expected of those working at the heart of the Government’\n- ‘There were failures of leadership and judgement by different parts of No10 and the Cabinet Office at different times.’\n- Steps needed to be taken about the consumption of alcohol in the workplace\n- Using the garden as an extension of the workplace during the pandemic ‘was a sensible measure..but the garden was also used for gatherings without clear authorisation and oversight. This was not appropriate’\n- Staff who wanted to raise concerns ‘at times felt unable to do so..there should be easier ways for staff to raise such concerns informally’\nHer conclusion:\n- The gatherings were spread over a 20 month period ‘unique..in terms of the complexity and breadth of demands on public servants and indeed the general public’\n- Ministers, special advisors and civil servants ‘were a key and dedicated part of that national effort’\n- But some of these gatherings should not have happened or been allowed to develop as they did\n- There are lessons to be learnt ‘which must be addressed immediately across government’ and this does not need to wait for police investigations to be concluded\n- The PM’s statement\n- He apologised profusely and accepted all the recommendations from Sue Gray (greater control and process over events, use of the garden and consumption of alcohol: greater clarity about who is in charge of what: an informal process for concerns: in essence changes in the structure at No10 and changes to the Code of Practice for SPADs and civil servants there\n- He announced the setting up of a new Office of the Prime Minister in No 10\n- ..and encouraged questioners to await the Police investigation before pre-judging events\n- My reaction\n- This report is extremely uncomfortable reading, and would be for any PM or government\n- It was not long ago that we were told there was no question of anything done that had broken the law: now there is a police investigation covering 10 events\n- The PM has accepted all the Gray Recommendations, including new structures at No 10 (and by implication probably some new personnel)\n- Only the police will decide whether the law was broken and if so by whom and whether prosecution should follow\n- I believe many of these issues – particularly about the dual function of No10 as both home and office/government dept with large numbers of workers - would have been difficult for any PM during the pandemic\n- But there are also real non legal questions on leadership and judgement for which the PM has to take overall responsibility, including answers to questions which have changed over the last few months\n- What happens next?\n- The reactions of the general public, my colleagues and the police are key\n- Many will have already made up their own minds, and some of you have already written (hence this reply), but other constituents are welcome to mail me your thoughts and reactions (or wait to see the police report first rather than pre-judging any legal outcome)\n- Conservative MPs can send in letters of no confidence to the Chairman of the 1922 Cttee (effectively the union of Conservative back bench MPs) which would (if a minimum of 54 were sent in) trigger a formal vote of no confidence. Were that to happen, and the PM to lose that vote of confidence, then a new selection process for the Leader of the Party would follow\n- Some MPs will choose to go public on whether they have sent a letter or not: I believe this should be a private not a public matter\nThis issue is not over yet. The interim Gray Report recommendations are clear and have been accepted. That is a good step in the right direction, as is the PM’s apology. But the verdict of the court of public opinion is now open, before the police report and the complete Sue Gray report (which will be published in full). The conclusions of each are important, as are your views\nSo please do mail me any thoughts on [email protected]\nThank you\nBest regards\nRichard",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_my-question-prime-minister-brexit/content_10.html": "The underestimated value of persistence Wednesday, 29 May, 2024 Over the last 14 years I’ve been incredibly fortunate to have three different perspectives of the greatest challenges we’ve been through.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_whats-happening-gp-surgeries/content_17.html": "What’s happening at GP surgeries?\nOne of the most popular urban myths at the moment is ‘I can’t get to see my GP’: sometimes followed by ‘our NHS is broken’. Both resonate and neither is fair. So let me unravel the situation by starting at the beginning.\nMost of us (if we’re honest) don’t know much about how our health system works: I didn’t before I became an MP. And most of us (again if we’re honest) don’t want to know. We just want to know that our GP surgery is there when we need them.\nFair enough – up to a point. Because the word ‘need’ can be very elastic and health needs especially. So let me try and summarise very simply what GP surgeries are, how they’re paid, what the strains in the system are and how we can – collectively – make best use of our surgeries or primary care, in Q&A format.\nWhat is a General Practice (GP) surgery?\nIt’s a business partnership of more than one doctor which is effectively licensed by the Integrated Care Board (ICB), which represents the NHS in Gloucestershire, to build a list of constituents who then use that surgery for Primary Care (i.e., non-Accident and Emergency) health issues. We then access specialist services via our GP.\nAre GPs employed by the NHS?\nNo: they have been separate since the creation of the NHS in 1948, and will strongly resist nationalisation.\nBut they’re paid by the NHS?\nYes, like a contractor.\nThe NHS pays the GP surgery a sum each year per patient on their list. The amount was determined by what is thought reasonable for 3 x 10 minute appointments per patient per year.\nIs that a ration of how many appointments we can get each year?\nNo: there is no limit; it depends on each individual’s health.\nA person on the list who does not need to see their GP at all in the year helps enable the GP to see someone else with greater need more often.\nSo what is the average number of visits per patient per GP a year?\nIt has shot up since the pandemic to over 7 visits a year per patient, on average.\nHow does this affect the surgery?\nBadly, because the same number of doctors (and other members of the practice team) are seeing the same number of patients much more often.\nWhy can’t they recruit more doctors to cope?\nThey can a) if there are doctors waiting to be recruited and b) if the surgery can afford it.\nHow could a surgery not afford to recruit more?\nBecause the surgery (as above) is paid per patient, not by the number of times they go to their surgery or by the number of doctors/nurses employed.\nIf everyone (on average) sees a GP more often, the numbers of patients are the same or more and the numbers of doctors is the same, then people can’t see their surgery so quickly – does the waiting list grow?\nIt can do. On average GPs in Gloucestershire are seeing 25% more patients than they did pre-2019, they’re using technology for virtual visits where appropriate to save time and increase productivity. However, the majority of appointments are still face to face. Practices have also beefed up their IT systems so information is quicker to access, record and share e.g. with specialist consultants / the GRH or mental health services.\nThat all improves productivity and means we get more out of the system. But it also puts stresses on individuals and the system.\nBoxes and boxes of individual files at the GRH: a productivity improvement opportunity.\nWhat does that mean in practice?\nDoctors have to see more patients as quickly as possible, that puts off some from becoming a GP and encourages some to become a ‘locum’ who accepts work when they want to, like supply teachers.\nThat’s not the same as a full-time doctor, and it’s more expensive for the surgery. We have 100 locum doctors in Gloucestershire.\nCan’t the surgeries and the NHS plan for how many doctors they need?\nThey can now because the government recently agreed to a Workforce Plan (the first since 1948) as it became clear that we’ve become increasingly dependant on recruiting nurses and doctors from overseas to fill the gap.\nWhat will be the benefits of a Workforce Plan for someone who lives in Gloucester?\nIt should enable the ICB to target their recruitment to make sure we have enough health professionals for all residents.\nHow bad is the gap at the moment?\nThere are different ways to measure it, but there are seven doctor vacancies advertised in Gloucestershire practices now, and there would be more if surgeries could afford to recruit more.\nDoes that mean the NHS needs to give surgeries more funding to attract more doctors?\nYes, one way or another. There is some currently ring-fenced funding that could, in my view, be widened. There may need to be a higher payment per constituent to recognise that some patients present more often.\nIs it all about money?\nNo: if secondary (i.e. hospital) care (e.g. cancer / elective surgery) was working as best as possible, in line with previous targets then primary (i.e. GP) care would benefit.\nAnd what could change things longer term?\nThe smoking ban. Currently 75,000 GP appointments a month are smoking related. It’s a major cause of lung and heart cancer. Everyone in the health sector knows this. It would be the biggest game changer that legislation can achieve for better health.\nWhat about productivity?\nYes, this is another elusive potential gain, which the government hopes will be led by IT, Artificial Intelligence (AI) and digital transformation. At its most simple, this would reduce paperwork, which (as I saw volunteering in GRH Archives) is still a constantly moving mountain.\nBut our Hospitals Trust has also already used robotics for complicated operations, the diagnostics centre by Shire Hall is quicker and more efficient, and will go on speeding up diagnosis and treatment.\nGHAC now offering GP appointments everyday from 08:00 0 20:00 to all\nOkay all very interesting. But can I see my GP?\nYes! Latest data in our city/county shows 40% of appointments were the same day and a further 25% seen within a week. For routine appointments you can (in Gloucestershire, not everywhere) book quite far ahead – which appears to increase the waiting time.\nBut it’s also true some surgeries struggle and if demand spikes up, and a doctor is off or on holiday, then backlogs can build up and waiting times increase.\nVery useful roundtable with GPs from 3 practices in Gloucester\nAre you saying the ‘I can’t see my GP for 6 weeks’ phrase is not true?\nIf one of my constituents is looking ahead for a routine e.g., age-related check-up then that is different and sensible.\nBut it would not be right for anyone who needs immediate access to a GP, and I do not believe that is at all the situation.\nIf anyone does have that experience, they should write to their practice manager and copy me.\nWhat else could a frustrated constituent do?\nYou can check your healthcare options at www.asapglos.nhs.uk or use the ASAP Glos NHS app. They can guide you step by step and provide details of services in the county, such as the GP led Gloucester Health Access Centre, open 7 days a week (08:00 – 20:00), ring 01452 336 290. NHS 111 can also book you into local services to meet your needs.\nQuick summary please now of the situation\nBig backlog post-pandemic: NHS contract for GPs out of date for scale of demand: recruitment planning needs improvement along with secondary care and technology improvements: government looking at funding flexibility and longer-term society changes (especially smoking); and GP surgeries need to be an attractive career opportunity.\nBut there is no need for anyone to wait 6 weeks for a non-routine check-up – reality is, as so often, better than the myth.\nBest regards\nPS. Do let me know what your experience is at [email protected]",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_publishing-eu-impact-assessments/content_40.html": "Tweet Thursday, 21 December, 2017 Westminster News The four reasons why the government shouldn't publish the EU impact assessments. You may also be interested in Exiting the EU Select Committee Richard Graham was a member of the Work and Pensions Select Committee from May–November 2010, and July 2015-June 2017. Since June 2017 he has been a member of the Select Committee on Exiting the EU.\nExiting the EU Select Committee Richard Graham was a member of the Work and Pensions Select Committee from May–November 2010, and July 2015-June 2017. Since June 2017 he has been a member of the Select Committee on Exiting the EU.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_whats-new-gloucesters-schools/content_4.html": "I know the announcement of a General Election dominates the news, but schools matter. A few months ago I wrote to you on improvements seen across Gloucester’s schools. Today a quick update on some new or changing school structures.\nOn the 1st May both Hatherley Infant School and St James' Church of England Junior School became separate academies within the same Diocese of Gloucester Academies Trust.\nI’m sure they will both benefit from the shared resource and back office synergies as well as the values, experience, scale and access to a wider pool of teachers through the Diocese Multi-Academy Trust (MAT). I have happy memories of recent visits to both schools and know how committed the Heads and Chairs of Governors are to providing a great start for all their pupils - so congratulations to both.\nA Hatherley Infant School class: the school will benefit from the resources and support of the Diocese MAT.\nNot far away, in Linden, Calton Primary School will join the SAND Academies Trust over the summer.\nSAND Academies Trust currently consists of six schools in Gloucestershire - five special schools and Willow Primary Academy, which is a mainstream school in Tuffley (formerly Tuffley Primary) with The Piper Centre, a specialist resource centre catering for 30 pupils.\nI was very impressed when I went round Willow Academy in 2022. It’s good to see the SAND Trust expanding and (given the increased number of pupils with SEN challenges) their experience, led by Chair Lyn Dance (previously longtime Head of Milestones School), will be a great help to Calton Primary - as well as all the other benefits of scale from a MAT alluded to earlier.\nVisiting Willow Academy: it has thrived as part of the SAND Trust.\nLastly a change at secondary Barnwood Park School, as the school's Board of Governors and Greenshaw Learning Trust (GLT) MAT have agreed the school will join GLT.\nThe project was publicised and following a period of consultation, governors have confirmed the academisation will go ahead.\nThey will now work closely with GLT over the coming weeks to ensure a smooth transition.\nPupils at Barnwood Park School (rated good by Ofsted) have seen great improvements and joining GLT should provide extra support and depth.\nOf course there is no guarantee that becoming an Academy or joining a MAT results in success. But there is plenty of evidence that it greatly increases the likelihood of that, and the percentage of good-rated schools which are academies is high.\nCrucially MATs are not just good at managing business costs better, and so enabling more money to go on educational achievement. They also have access to a much deeper pool of teachers to help if eg a key subject like maths needs more focus. MATs also offer more career development opportunities for teachers without changing employer.\nAll the schools involved above are determined to offer a great learning experience for their pupils, and I believe these changes, if well managed and communicated, will boost results and opportunities for them. The fact that the SAND Trust, the Diocese of Gloucester Academies Trust and Greenshaw are all actively running primary schools also offers comparative data and styles of teaching which parents and future parents could and should consider.\nSo a busy time this summer preparing for change.\nBest regards\nP.S. Do let me know your thoughts at [email protected]",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_what-next-british-trade-and-exports/content_12.html": "It is a conundrum for all of us involved.\nDespite huge efforts by David Cameron’s government – large trade missions led by him as PM and other senior ministers, innovations like Trade Envoys, the hugely successful GREAT campaign, training funding for an enormous increase of apprentices, money invested in hi tech sectors like aerospace, Growth Fund awards locally, reductions in corporate tax and tax breaks for business on R&D and capital allowances – our productivity has not increased and exports aren’t growing fast enough to cover our appetite for foreign goods: and our trade deficit has recently widened again.\nPrime Minister Theresa May will want to see our exports grow, but we now also have the new challenge of re-negotiating our trade relations with Europe, destination for 44% of our exports. Tough times ahead?\nI see the situation like the two Chinese characters for crisis: wei ji or ‘danger opportunity’. On the one hand we need to protect crucial exports to the EU like our cars, aerospace, whisky and services, which might otherwise suffer: and on the other we need to be nimble and seize the opportunity of no longer outsourcing our trade deals to a third party.\nThat requires increasing the numbers of our trade negotiators, opening informal dialogue now with close Commonwealth and Growth Market allies on the potential for bilateral deals and adopting a more entrepreneurial approach across business and government. Ministers can again lead on the trade diplomacy the FCO was once famous for, armed with cyber, fin tech and creative media expertise: more Trade Envoys could be recruited to support relationships in key markets and our beefed up Prosperity Fund deployed in markets most willing to expand bilateral trade.\nAlready there are encouraging noises in ASEAN, and this region should be one priority, but there are plenty of others. For those frustrated by our inability as EU members to launch wider Commonwealth trade agreements (I created the APPG for the Commonwealth), a mooted Commonwealth Trade Ministers meeting in London early next year and the 2018 CHOGM (in the UK) take on an exciting new dimension. We should start by identifying a coalition of the willing to kick start informal talks.\nBIS Secretary Sajid Javid and Trade Minister Mark (Lord) Price, with their business backgrounds, are aware of both the dangers and opportunities, but the machinery of government will need to drop some of its institutional caution and enfranchise Heads of Mission and Trade Envoys to work even more closely with business and get things moving.\nInevitably the government will have to look at the FCO budget, which is slightly lower than the level of fraud in the DWP. There may also be opportunities for DFID to fund (for example) all of the BBC World Service, freeing up more money. I feel there is no time to be lost in expanding our trade diplomacy, for business generates almost 75% of taxation directly and indirectly: our public services depend on our business growth.\nThe good news is that good business is being done. Last week BP signed off on a giant further $8 billion investment in Indonesian offshore gas – creating 10,000 jobs there and generating long term earnings that support many pensioners here. Likewise the Malaysian investment in the former Battersea Power Station is the biggest single regeneration project of its kind in Europe. Big, bold bilateral projects like these – invariably needing government support – show the way forward, and we must focus as much on seizing the opportunities across the seas as managing the risks closer to home.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_bottle-deposit-scheme-fight-plastic/content_23.html": "Gloucester MP Richard Graham has encouraged the government to introduce a deposit return scheme to increase recycling rates and slash plastic waste pollution.\nRichard said, “local and national support to cut waste in general and plastic waste in particular, and increase recycling is growing fast. The government has introduced a consultation on a deposit return scheme and I support that - but there must be no doubt about the direction: we need such a scheme to prevent 3 billion plastic bottles a year being burnt or going into landfill.”\nThe MP noted similar schemes already operate in Denmark, Sweden and Germany, with a refundable deposit when the container is returned. An alternative is a cash reward for returning drinks containers without an upfront deposit through ‘reverse vending machines’, where plastic or glass bottles are inserted and the machine returns money. Businesses are then responsible for the recycling – which has led to a 97% recycling rate in Germany.\nRichard said, “under Michael Gove the government has banned plastic microbeads and this follows the successful plastic bag charge. This is the next step, alongside a move which I’m championing in Gloucester to encourage all food and beverage outlets to allow visitors to refill their water bottles for free. The city council is showing leadership on their use of plastics, and I hope that these government initiatives will lead to less plastic waste, more recycling and less landfill - and a cleaner city and country. We cannot just leave this to the next generation.”\n- Options for a deposit return scheme will be considered alongside other policies to improve recycling rates. The government will only take forward options from the consultation which demonstrate that they offer clear benefits and are resistant to fraud, and costs on businesses, consumers and the taxpayer are proportionate.\n- The consultation will take into account views from producers, suppliers and consumers to ensure that any system introduced works across the country.\n- Last year, the government launched the first Litter Strategy for England. This strategy sets out how we will work with different local groups, local authorities, Highways England and businesses to clean up the country, to change attitudes towards littering, and strengthen enforcement powers.\n- HM Treasury’s call for evidence on using the tax system or charges to address single-use plastic waste is currently live on GOV.UK",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_protecting-police-dogs-and-horses/content_29.html": "Gloucester MP Richard Graham has said that the dogs and horses serving our police around the country are “much more than Police property - they’re partners in catching burglars, detecting drugs and helping to save lives. In turn these brave animals deserve better protection from abuse and violence - and that’s why I support Finn’s Law to make that happen.”\nFinn’s Law is a proposed Bill to increase protection for service animals including police dogs and horses that Conservative MP Sir Oliver Heald has brought forward.\nRichard joined Gloucestershire Constabulary dog handlers and the mounted unit last weekend at the Cadet Tattoo in Quedgeley to show his support. He said, “PC Claire Todd told me how important this was to help ensure her dogs PD Stella and PD Quest in the line of duty and the mounted unit with Police Horses Boris and Teddington had the same views. We know it won’t stop everyone being violent, but it will deter some - and any sentences imposed will have their impact too. Serving animals should be better protected as a result.”\nGloucestershire's Chief Constable Rod Hansen, who is also the national lead for police dogs and mounted policing, said: \"Our service animals are very important in policing and therefore as a Constabulary we support Finn's Law in trying to help protect them in their duties. Our Police and Crime plan has a commitment to 'a compassionate approach' and ensuring we look after our own animals is part of that. I believe that appropriate legislation and sanction is needed but that is a matter for Members of Parliament and of course the courts to guide us accordingly.\"\nRichard said the Animal Welfare (Service Animals) Bill will be read for the second time in Parliament tomorrow (Friday 6th July) and will go forward as it now has government support.\nThe Bill relates to the campaign named after Police Dog Finn who was stabbed whilst pursuing a suspect with his handler PC David Wardell. The Bill will remove a section of the current law where a defendant accused of causing unnecessary suffering to an animal can claim they were protecting themselves and justified in using physical force against a service animal.\nSee Richard interviewing PC Claire Todd here: https://www.facebook.com/richard4gloucester/videos/1230470557089698/",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_weeks-brexit-votes/content_39.html": "In light of this week’s Brexit votes I am writing to update you on what has taken place and how I see things.\nI think the stars are beginning - just - to align. On Wednesday Parliament voted to take No Deal off the table. I’ve made it clear throughout in numerous emails, tweets, and articles on my website, that while I recognised the value of keeping No Deal on the table for negotiations, there would come a time when that leverage was over - and it has. No-one pretends that the EU has anything more to give after the important legally binding changes on the backstop last Monday.\nAnd yesterday Parliament took the Second Referendum off the table (important that others at the other end of the spectrum saw this wasn’t possible).\nSo the options remaining have narrowed considerably:\n- On one hand there is the known certainty of the amended Withdrawal Agreement which has already been agreed with the EU, and if passed, would enable us to leave the EU soon after 29th March.\n- The alternatives are all more complicated because they all have specific asks, such as EEA membership or permanent Customs Union membership, which many citizens would not be in favour of.\nIn any case it is important to remember that without a Withdrawal Agreement we cannot to proceed to the next stage of negotiations, ie trade.\nThe real question is whether the Attorney General can reassure the DUP and some of my Conservative colleagues that this solution would represent the least worst option.\nIn my view the legally binding changes agreed with the EU are important but there may be added reassurance needed from the UK government to the DUP and I expect that is what they will be working on over the weekend.\nI remain convinced that it is vital that we get behind the government and ensure that the Withdrawal Agreement Bill is passed and that is what I shall be working for next week.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_useful-information-job-hunting/content_6.html": "One of the great myths in 2010 was young people wandering around at my early Jobs Fairs and saying ‘there’s nothing here for me’. Well there is if they look more closely – the opportunities for chefs in the Army, for photographers in the RAF, for IT staff in the NHS, for care home assistants at several local companies, and for Business Admin apprentices in several sectors.\n“I’m looking for a job – what do I do?”\nThe Citizen\nThe most obvious thing is to look in The Citizen newspaper or online on websites like http://www.thisisgloucestershire.co.uk/jobs, http://www.glosjobs.co.uk/ or http://www.gavca.org.uk/charity-jobs/, but at different times in your life you may need extra advice and support to help you into work. Whether you are a lone parent, disabled, leaving school or college, over 50, or simply out of work, there’s practical help available.\nJobCentre Plus\nThe JobCentre Plus has one of Britain’s largest databases of job vacancies, which is updated constantly. Thousands of new jobs are available every week. You can also look for voluntary work which can help you develop and learn new skills while you’re looking for a job. There are hundreds of jobs currently available in and around Gloucester on the JobCentre Plus website: CLICK HERE to be taken to where they are listed.\nGlosJobs\nGlosJobs is the one stop shop for jobs in Gloucester and regularly has thousands of opportunities available across all different sectors.\nPersonalised job support\nYou can get personalised support, tips and advice to find your next opportunity through JobHelp.\n“What benefits can I claim while I’m looking?”\nYou can claim Job Seekers Allowance (JSA) online if you are:\n- actively looking for work or working less than 16 hours per week\n- over 18 but below State Pension age\n- living in England, Scotland or Wales\n\"What should I do at a jobs fair?\"\nI have organised jobs fairs in different parts of the city. My tips for anyone going to a Jobs Fair are:\n- Remember first impressions matter so consider your clothing.\n- Bring a CV and if you know what you’re looking for focus on those employers in that sector\n- Introduce yourself with a handshake and ask about what sort of jobs the company has available, and what sort of skills are relevant.\n- If you’re less sure of what you’re looking for talk with the JobsCentre Plus or GlosJobs.co.uk teams first\n- Try and leave with a contact name and e mail address and a clear idea of how to follow up chasing a job. If you think that your CV needs tweaking for that employer make notes and adapt it at home before sending it off.\n- If you find your skills are short of what an employer needs, talk with TABS, Prospect and other training companies about what is available.\n- Above all – you’ll get as much out of the Jobs Fair as you put in.\n“I need help on my CV, interview techniques and confidence. How can the government help?”\nThere are many government funded training schemes which can help you. There is a huge amount of information on the Direct.gov website CLICK HERE or locally TABS Training , Connexions and Bridge Training provide courses.\n“I’m looking for an apprenticeship – where do I start?”\nThere were over 1000 new apprenticeship starts in Gloucester last year (50% up from the year before) and 2011/12 will be better again. Not all employers advertise apprenticeships but many that offer then use them use the National Apprenticeship Service. Also talk to training providers like Glos Col , Prospect Training , South West Apprenticeship Company and Gloucestershire Training Group about their courses and employers who use them. Word of mouth and visiting local employers is also a good way of finding out more. Look at the specific employers websites eg EDF Energy, Renishaw, Gloucester City Council, Delphi are useful.\nGloucestershire’s FESTival Of MANufacturing, Engineering, Digital & Cyber is also a great opportunity to meet apprenticeship providers and look out for opportunities: https://www.festomane.co.uk/\nGlosCol\nGloucestershire College has a range of courses at different levels (eg BTEC, Apprenticeship and Degree).\nThere are offers for both those leaving school as well as adults looking to re-train. They also run the JobSmart Programme to support jobseekers re-enter work.\nDo take a look at GlosCol's website for more details\n“Who can help on work or career advice?”\nTraditionally schools have done this, with mixed results. The Government’s new National Careers Service offers advice for people of any age. Feedback on how well this works is welcomed! Many people looking for work struggle with confidence. Jobs Clubs can provide expert support on writing CV’s, interview technique and help searching for jobs.\nClaim tax relief on work-related expenses\nFind out how to claim tax relief on money you’ve spent on things like work uniform and clothing, tools, subscriptions or business travel.\nClaim Income Tax relief for your employment expenses (P87)\n“What about work experience?”\nGovernment funded voluntary work experience is for anyone aged 16 to 24 and is receiving Job Seeker Allowance. It gives you the opportunity to take part in a work placement with a real employer. It could be helpful if you have little or no recent work experience. For more information contact the Jobs Centre by CLICKING HERE\nInformally ask anyone in your family for help with work experience in the school holidays. Some companies offer part time work at weekends or in the evenings.\nA friend, Marcus Grant, who was out of work for a long time last year has analysed the five stages like this –\n- A good place to be: Everyone needs the basics of life before they can get a job. A roof over their head, safety and food. Once that’s sorted the process of getting a job can start.\n- Making contact with the outside world: This could be going to a workshop or going for some training – getting mentally prepared to work.\n- Volunteering: Helping the Salvation Army for an hour, the Cathedral breakfast for the homeless or a GCH litter pick up. Getting used to work, building confidence and boosting your CV are the key things at this stage.\n- Part time work: Part time jobs, especially at supermarkets, are a good way of taking the next step towards a full time job. Supermarkets give good training, they’re social places to work, and they understand the process of brining unemployed back into work – with good opportunities for converting part time jobs into full time and even management jobs.\n- Full time job: Marcus stresses commitment to the search, and understanding basic human psychology to improve their chances – and writing polite letters to show their interest and commitment. Persistence and an assumption that finding the right job takes time is key.\n“I’ve been out of work for over a year and need more help”\nThere is now some specific help for you. The Government’s “Work Programme” is a scheme to help the long-term unemployed claiming Jobseeker’s. Around 2.5 million people are expected to be supported through the new ‘Work Programme’ over the next five years.\nFor more information on the Work Programme CLICK HERE",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_reappointed-pms-trade-envoy/content_21.html": "Pictured: Richard with Ultra Electronics who won a contract to modernise Indonesian Navy warship\nGloucester MP Richard Graham, who spoke out in Parliament last week about the importance of growing our exports, has been reappointed as the Prime Minister’s Trade Envoy to Indonesia, Malaysia, the Philippines and the ASEAN Economic Community.\nRichard said, “I’m delighted to have been asked to continue this important role to promote British exports to and inward investment from these key South East Asian markets. Although our exports have increased there is a lot more that we can do, boosted by a weaker currency, on both goods and services. The countries of SE Asia together (ASEAN) represent our third biggest non EU market, and have only just begun to invest institutionally in the UK. I’ll be back out there later this summer to pursue opportunities for greater co-operation in several sectors including maritime, aerospace and further education as well as seeing what more our expertise in running major sporting events can do to help make a success of the Asian Games. This is something I have a particular interest in as I once represented Indonesia at squash, one of the sports in the Games.”\nRichard noted that Gloucester and Gloucestershire both have some remarkable exporters and Queens Award winners – including Severn Glocon, Prima Dental, Helipebs, Avon Metals, Advanced Insulation and Renishaw, as well as Fluid Transfer, Poetons, Neon Play, Only Natural products, BAe systems and Ultra. “And we shouldn’t forget our two universities,” Richard noted: “today we export more in Education than from Insurance and both the University of Gloucestershire and the Royal Agricultural University play a part in that. In a variety of different sectors Gloucestershire has a good record already in certain Asian markets”, said Richard, “but there is even more potential ahead. I hope other Trade Envoys will be appointed by the Prime Minister to help our national mission of building exports.”\nRichard Graham is the longest serving Prime Minister’s Trade Envoy in the House of Commons. He was appointed Trade Envoy to Indonesia in 2012, to the ASEAN Economic Community in 2015, and to the Philippines and Malaysia in 2016.\nThere are currently 21 Trade Envoys covering around 50 markets. Trade Envoys engage with countries and markets where substantial trade and investment opportunities have been identified by UK. They build on the UK’s existing relations with these markets and maximising bilateral trade, aiming to generate real and long term benefits for the UK.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_gloucester-mp-celebrates-gloucester-exporter-helipebs-receiving-first-queens-award/content_26.html": "Gloucester’s MP Richard Graham MP says that HRH The Duke of Kent presenting Helipebs Controls with a Queen’s Award for Enterprise for the first time shows how far the company’s exporting success has come since the financial crash in 2008: ‘this is a Phoenix like recovery for the Elmbridge based engineering company, based on quality and service’.\nHelipebs Controls are to be presented with the Queen’s Award for Enterprise International Trade 2016 by HRH the Duke of Kent, accompanied by the Lord Lieutenant of Gloucestershire Dame Janet Trotter on Wednesday 26 October at 2pm.\nRichard first went round Helipebs in early 2007, later taking then Shadow Secretary of State for Communities and Local Government Eric Pickles to visit. He said, “I saw immediately the potential for the business – they make the cylinder in every Dyson vacuum cleaner, parts for Jaguar Land Rover and testing equipment for Saffran Messier Dowty.”\nThe City MP, who is also the Prime Minister’s Trade Envoy to much of South East Asia, added “there is no higher honour for any business than being awarded a Queen’s Award for Enterprise. What a great company we have tucked away on Sissons Road in Elmbridge – huge congratulations to Chairman Geoff, MD Andrew and all the team.”\nThe award was presented by HRH the Duke of Kent. Helipebs Controls have grown their overseas sales by 142% from 2013 to 2015 by extending their product range and servinga variety of industries across the world.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_update-leaving-eu/content_13.html": "This is a general note to all who’ve e mailed or otherwise contacted me about the issue of our Leaving the EU, which I’m making available to ALL my constituents via my website and Twitter accounts.\nThat way everyone gets the same reply, has the same knowledge of my views and the same analysis of options. I am sorry there simply isn’t enough time to answer you all individually.\nFirstly thank you very much for contacting me. I’ve read all your mails, as I always do.\nThey divide into the following broad categories:\n- Your views, without questions. These in turn generally divide into:\n- MPs are a disgrace and the lot of you should be sacked since 86% were elected on manifestos to respect the Referendum but haven’t done so\n- Parliament is a shambles because it can’t make its mind up and the way to solve things is for the People to decide and have a Second Referendum\n- I am a disaster or a traitor either because I voted Remain and have since respected the Referendum result, but should have ‘stayed true to the cause,’ and tried to prevent Brexit: or a traitor because I have voted to leave the EU on March 29th three times, supporting the government Deal, whereas I should have supported a No Deal Brexit: or because I twice voted against the government on different procedural aspects and shouldn’t have done so: or because I didn’t support a second Referendum or Revocation of Article 50 last week (and won’t do so this week)\n- The PM is a disgrace because she’s the leader who hasn’t succeeded after 3 attempts, and leaders who fail should be dismissed: and she should realise either that the people should have a second vote or that No Deal is No Problem\n- The PM’s troops are a disgrace for not supporting her, especially those who think they would themselves be a better PM, because if they had showed unity we would have left already. Some of the ERG are risking Brexit altogether by voting against her\n- Labour is a disgrace because Corbyn has no policy except not to have a policy: and locally Labour seem to pretend the Referendum never happened, judging from the monastic silence of its reps\nI sympathise with all of these views: and perhaps especially with 1), 2), 5) and 6). It HAS been a collective failure of Parliament, and we all hold some responsibility. I am very sorry about this.\nBut we also mirror the divisions of the land, and the different, passionately held views both in Gloucester or elsewhere. Although some of the e mails are aggressive, few are direct personal threats, and on the doorstep my constituents are always kind, even when they disagree. Electronic communication though can be a very blunt tool, and anonymous tweets or Facebooks from obviously fake accounts don’t add anything positive to the debate - and risk putting off put off younger potential (particularly female) candidates from getting involved. But that is a different issue..\nYou’ll agree that there is no conceivable way of satisfying you all, whatever my views. Many believe their view is the right (if not the only) one, supported by every sensible thinking person, and definitely a majority of the nation, even where there’s little evidence for this. I keep in my mind a lot at the moment Cromwell’s words about imagining the possibility that I may be wrong..\nTo my most frequent flyers, who’ve sent me more than 20 variations of the same e mail since the New Year about what is needed (mostly No Deal or Second Referendum), I know exactly where you are coming from and you know my reply. Let me share the points I usually make with others:\n- It is the easiest thing to urge a course of action on someone else who has responsibility for it when you don’t. After all YOU aren’t accountable. There is no shortage of armchair experts at Kingsholm when Gloucester plays: and the same is true x 100 for politics. But if the NHS, NFU, CBI, FSB, intelligence agencies, pharmaceutical association, engineering federation, automobile sector, Trade Unions, Gloucester manufacturers and traders all (pretty well unanimously) tell me that No Deal would be either a disaster or a major disaster, and in any event will lead to job losses – then just dismissing the whole lot as scaremongers doesn’t work for me. My responsibility to city and nation is a serious one.\n- To those of you who continue to think that leaving on WTO terms (40% duty on lambs and 10% on cars FYI) is a piece of cake and don’t worry about tearing up our Free Trade with the EU (44% of our total exports), because we can sort that out overnight once we’ve left, I say sorry: but life is a lot more complicated than that. Do not underestimate how domestic issues like European elections influence how eg Macron would respond.\n- Equally many of those who argue we should have a second referendum must come clean about their aim, as the People’s Vote now has: their goal is to overturn the first People’s Vote. I understand that many across the country voted remain and still want that view to triumph. After all Referendum votes have been overturned in Continental Europe, when Denmark, France and Ireland got the answer wrong. Why not here?\n- Because the government’s advice in 2016 to every household was clear: ‘we will implement what you decide’, with no Second Referendum, no second chance and no complaining about a small winning majority. A one off decision. ALL political parties told the media that this was the case – no second go. And I take the simple view that politicians who promise such things should stick with them – which was why I accepted the result. Not Leaving the EU at this stage would, I believe, be a disaster not just both for our democracy and trust in politics but for democracy worldwide. In an exercise of direct democracy you should implement a promise to implement.\n- Lastly your MPs have had several votes, so why can’t we have a second one? As above but with this comment. Your elected representatives often have many votes on the same issues. All Bills have an iterative process and go back and forth between Commons and Lords. Some votes (like abortion or assisted dying) quite frequently come back many, many times. There is nothing unusual on a controversial bill in a hung Parliament taking time and several votes. That process, even though (and perhaps because) we believe – most of the time – in the flexibility of no Constitution, should make Parliament more likely to arrive at the compromise we need. It is likely to be, as I said at the beginning of the debates, something ‘few will love, but most could live with’.\n- Your views, with questions (or instructions). These in turn generally divide into:\n- I don’t like the PM’s Deal: it’s a dreadful Deal and please vote against it\n- I do think the government compromise is the right (or the least worst) way forward: do support it\n- Why did you vote in favour of none of the indicative motions last week?\n- This is how I would like you to vote next week – will you?\n- Obviously I most sympathise with 2) and especially do not agree with 1). This assertion usually comes short of evidence about why it is so bad, perhaps because there isn’t much. Of course if you want No Deal or No Brexit there are flaws with any Deal.\n- On 3) I voted last week against the options at the two margins ie No Deal and Revocation (No Brexit), and did not vote at all on the options for EAA/ EFTA (Europe 2.0 or what was called Norway +) plus the Customs Union (CU) or the CU alone. (The latter was only 6 votes off having a positive vote and a second referendum only 29 votes off). My reason was simple: I wanted to vote positively for the Withdrawal Agreement Bill the following day, and didn’t want to help another (weaker) option to be seen as a better solution.\n- Monday will be different: we have to find another solution if those who voted against the WAB would do the same again. So I will look closely at the options the Speaker selects, and will probably support the Deal plus a Customs Union as the quickest and most trouble free solution. Why?\n- Because staying in the CU resolves at one stroke the Northern Ireland issue: enables us to leave the EU’s political direction, its fishing and agricultural policies, its Freedom of Movement and most annual payments. It would prevent us from having our own trade deals: but this is not an area of easy wins – the big potential Free Trade Agreements (US, China and India) would be fraught with difficulties for UK negotiations, and Free Trade with the EU is an important and underestimated export market (146,000 UK companies export only to the EU).\n- Of course I would rather a Customs partnership, that has those benefits but only ties us to the rules of goods and agriculture, not for services where our regulators would like more flexibility to have different rules on some things. This should enable us to pursue our Trade Deals as well as maintain frictionless trade with the EU. But if Parliament won’t support the Deal or Bill then we have to find the next least worst option. Which for me is the CU. The EEA means losing control of freedom of movement, mostly being a rule taker (though not Fish and Agr) and paying a biggish sub.\n- Some colleagues continue to vote against the WAB because they want No Deal and believe this helps their goal. They vote alongside Jeremy Corbyn, who does so because he wants No 10, and believes this helps his goal. It is impossible for both to be right. In my view the ERG has got this badly wrong, and further failure by Parliament this week to coalesce on a solution risks bringing the decision back to the people – either through another Referendum or a General Election. Who knows what would then happen to Brexit.\n- I don’t think many people want either a Referendum or a Revocation: they just want decisions made and Brexit delivered, by and large. I don’t think a Second Referendum would help anything. Doubtless, it would, like the Second Civil War, be even more divisive and bloody than the first. The Second Civil War achieved nothing then, and I’m not sure a Second Referendum would now). Prof Sir John Curtice (most respected academic pollster) has said that his analysis shows people wouldn’t vote much different to how they did last time.\n- Some of you have e mailed me a further round robin survey, from a socialist lobbying company, asking you to decide how you would vote on Monday, and tell me to take account of it. The problems with this are:\n-\n- Some of these quasi instructions arrive after the vote (as they did last week): some are views on options not chosen by the Speaker on the day: why should 70 odd such instructions have any more sway than the 87,000 who do not instruct me how to vote: and what does this say about representative democracy – in which your MP should make up his or her mind on what is best for their constituency, clean of lobbyists. So I would encourage any subscribers to urge their lobbyist group to consider whether the effect of looking like telling me how to vote might be negative.. But you know that I will not be supporting No Deal, No Brexit or a Second Referendum: and I would take a lot of persuading to support Norway+\n- Whatever the future agreement with the EU on eg Trade or Customs, it needs first a ratified agreement on the WAB (and then the EU Parliament) for the Second Phase. Even No Deal wouldn’t last long without sorting that out. And that is what I hope we achieve this week. There is no excuse at all for Labour not to support it: not a single comma in it anywhere their front bench disagrees with. And if all of the ERG wants Brexit, it needs to get a lot less fussy about what type of Brexit. Leave Director Dominic Cummings said this week ERG were ‘useful idiots’ for Corbyn and his plans for a radical Marxist inspired government. Each MP must use our judgement carefully.\n- In the Civil War key ingredients in that disaster were mission creep, unintended consequences, a failure to think strategically about the outcome and many of the participants overplaying their hands. All featured in the failed negotiations between King, Army and Parliament – and the radicals drove forward the execution of the King, did away with the Lords, expelled the Commons and installed Cromwell as Lord Protector. A far cry from the banners of ‘For King and Parliament’ a handful of MPs started with. Likewise there was NO mention of No Deal in Vote Leave literature before the Referendum, and its leadership was always clear about leaving in an orderly way. WE should continue to work to leave responsibly.\n- So let’s surprise ourselves, the country and the EU: get the WAB through, get EU agreement to allow us to leave on May 22nd ie before European elections and then let’s make sure we get the legislation through in time (probably using an extra week from the Easter recess). It’s possible, if everyone puts aside party and personal ambitions..\n- If Parliament fails again our reputation, already tattered, will weaken further. For the mother of Parliaments, in a world where authoritarian leadership is growing in popularity, that would not be a good sign.\nAfter twenty years of Civil War, disease and quasi dictatorship 20% of the male population 14-45 was dead (a higher % than WW1), and families all around the country ruined. Not long after the Restoration, in 1662, the Earl of Berkshire wrote: “We will none of us with satisfaction be able to explain what it was we fought over all those long years”.\nPray we can bring these disagreements to a close, on at least Phase 1, sooner rather than later.\nBest regards\nRichard\nPS If you’d like to hear more from me then please sign up here to my regular e-newsletters.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_brexit-update-future-relationship-and-irish-border/content_32.html": "On Brexit there are 2 things that we're trying to achieve: getting an agreement on the implementation stage and getting an agreement on the future relationship. The Irish border is also on everyone's mind, see:\nOn Brexit there are 2 things that we're trying to achieve: getting an agreement on the implementation stage and getting an agreement on the future relationship. The Irish border is also on everyone's mind, see:",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news/content_24.html": "The underestimated value of persistence Wednesday, 29 May, 2024 Over the last 14 years I’ve been incredibly fortunate to have three different perspectives of the greatest challenges we’ve been through. Locally being Gloucester’s MP puts me at the heart of city and county issues: and I’ve had a national perspective especially from the Joint Committee on National Security Strategy. For an international view I’ve been both the PM’s Trade Envoy for almost all this... Articles\nWhat’s new in Gloucester's schools 23rd May 2024 I know the announcement of a General Election dominates the news, but schools matter. A few months ago I wrote to you on improvements seen across Gloucester’s... Articles\nWhat’s happening at GP surgeries? 17th May 2024 What’s happening at GP surgeries? One of the most popular urban myths at the moment is ‘I can’t get to see my GP’: sometimes followed by ‘our NHS is broken’... Local News\nWhat's happening to the Walls Club in Barnwood? 1st May 2024 This is something slightly different: not a big global or national issue but a very specific local one: what’s happening at Gloucester’s Walls Club? The Walls... Articles\nA big day for pensioners 10th April 2024 Some residents have said they were surprised there was nothing in the 2024 Budget about pensions. And in one sense they’re right - because the two main... Articles\nWhat’s new and exciting in Gloucester Docks? 5th April 2024 The recent story of Gloucester Docks can so far crudely be divided into three phases: 1: Regeneration of Victorian Warehouses as offices and accommodation... Articles\nWhat's happening with Rwanda? 28th March 2024 I’m sometimes asked why I voted for the Rwanda Bill, or even how could I have done so. So in one sentence: as part of actions to reduce the number of immigrants... Articles\nEducation - a remarkable success story 7th March 2024 Talking to the Head Teacher and pupils at Field Court Infants, asking Grange Primary pupils to get involved in tree planting and visiting Altus School’s pupils... Articles\nAction on Rough Sleeping in Gloucester City Centre 23rd February 2024 Engaging with rough sleepers in Gloucester – this man is no longer sleeping on the streets. Three things I dislike are litter, violence and homelessness. Litter... Local News\nWhat’s New in Dentistry? 16th February 2024 It has been a bad time for anyone trying to see a dentist. The post-pandemic continuation of a huge backlog of dental work and an outdated NHS/dentists contract... Articles",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_why-brexit-no-deal-problem/content_16.html": "I sometimes get emailed asking me to substantiate my strong belief that, from where we are now, No Deal would be a disaster.\nOne way to do this is to list all the organisations who’ve contacted me to say how negatively it would affect them: all the main business organisations (CBI, IOD, FSB), the Bank of England, most sectoral groups (engineering, manufacturing, chemical, nuclear, financial, legal, logistics, haulage, aviation, pharmaceutical, aerospace etc), plus the NFU and the NHS.\nThen there's the defence, cyber, police, agencies etc. The details are telling. For example a European Arrest Warrant brings a criminal back here within 10 days: outside the EAW club and with No Deal it can be 40 weeks.\nLocally lots of SMEs, our FE College and our University have also flagged up their deep concerns. A neighbour, for example, who sells flowers says he would have to close within weeks.\nTo all of which some simply say ‘they’re scare mongering aren’t they?’\nMy answer is ‘not deliberately no’: though they have to make assumptions. But most importantly if I make a decision that No Deal is No Problem, because I was arrogant enough to assume that all these well informed people and organisations were ALL wrong - then I alone really would be responsible for what follows in Gloucester.\nIt is easy to say ‘don’t worry it’ll all be fine’ when you have no responsibility for what happens. Those of us who are responsible cannot be so blithe about constituents’ lives, jobs and living standards.\nAnd there is one thing more - the government’s own analysis. This has been little commented on. But it’s worth seeing what a summary of the analysis shows:\nQuotes from Government no deal analysis\n\"...as a result of French\nchecks and lack of business readiness, the flow of goods through the Short\nChannel Crossings (Dover and Eurotunnel) could be very significantly reduced for\nmonths.\"\n\" HMRC has estimated that the\nadministrative burden on businesses from customs declarations alone, on current\n(2016) UK-EU trade in goods could be around £13bn p.a.\"\n\" the UK economy would be 6.3-9% smaller in the long term in a\nno deal scenario (after around 15 years) than it otherwise would have been when\ncompared with today’s arrangements, assuming no action is taken. There would\nalso be significant variation across the UK (Wales -8.1%, Scotland -8.0%, Northern\nIreland -9.1% and the North East of England -10.5%). This analysis does not\naccount for any short term disruptions, which would be likely to have additional\nshort and long run economic impacts in an immediate no deal scenario.\"\n\"the latest internal Government-wide delivery reporting reveals the scale of risk remaining in\nthe limited time available. In February, Departments reported being on track for just\nunder 85% of no deal projects but, within that, on track for just over two thirds of the\nmost critical projects.\"\n\"In the absence of other action from Government, some food prices are likely to increase, and there is a risk that\nconsumer behaviour could exacerbate, or create, shortages in this scenario. As of\nFebruary 2019, many businesses in the food supply industry are unprepared for a\nno deal scenario.\"\n\"Industries would need to respond to the application of EU tariffs. These would vary\nby sector. While for some sectors (such as life sciences or electronics) the effect of\nany tariffs would be minor, other sectors would be more affected. For example, the\nEU would introduce tariffs of around 70% on beef and 45% on lamb exports, and\n10% on finished automotive vehicles. This would be compounded by the challenges\nof even modest reductions in flow at the border. Given the unprecedented nature of\nthe sort of economy-wide adjustment that would be required in a no deal scenario, it\nis impossible to accurately predict the ability of businesses to adapt. The second\norder effects on local economies dominated by a small number of industries, or on\nbusinesses in the supply chains for those companies, is also hard to predict with\nprecision, although it would be likely to be uncertain and costly.\"\n\"In a no deal scenario there is an expectation of disruption to closely interwoven\nsupply chains and increasing costs that would affect the viability of many\nbusinesses across Northern Ireland. There is a risk that businesses in Northern\nIreland will not have sufficient time to prepare. This could result in business failure,\nand/or relocation to Ireland with knock-on consequences for the Northern Ireland\neconomy and unemployment.\"\n\"The Single Electricity Market (SEM)\nbetween Northern Ireland and Ireland is integrated more than any other cross-\nborder wholesale market. In the first instance, even in a no deal scenario, the UK\nwould seek to agree with Ireland a continuation of the SEM, which would minimise\nimpact on exit. This relies on cooperation with Ireland and the EU, which is not\nwithin the UK’s gift to unilaterally control or mitigate.\"\n\"The service sector (which makes up around 80% of UK GDP) is supported by free\nmovement of people and a range of cross-cutting regulation such as mutual\nrecognition of qualifications. In a no deal scenario, UK businesses would be treated\nas third-country service providers by the EU. The UK would risk a loss of market\naccess and increase in non-tariff barriers. UK businesses would face barriers to\nestablishment and service provisions in the EU which they had not previously faced,\nincluding nationality requirements, mobility, recognition of qualifications and\nregulatory barriers when setting up subsidiaries in EU member states.\"\n\"a) The chemicals sector is the UK’s second largest manufacturing exporter by\nvalue, exporting £28.3bn in 2017, £17bn of which was exported to the EU. The\nsector has four main clusters of operations in the North of England and\nScotland, and is an important contributor to the local economies. Supply chains\nare highly integrated within the EU, and products will cross borders a number of\ntimes before becoming final products, making them vulnerable to delays at the\nborder.\nb) Currently, businesses who manufacture or import substances into the EU need\nto register them with the central European Chemicals Agency. As of August\n2018, UK businesses held over 12,000 of these registrations. Following a no\ndeal scenario, UK companies would only be able to sell into the EU providing\nthey have transferred their existing registration to an EU-based entity. The\nEuropean Chemicals Agency transfer fee for a single registration is around\n£1,500, excluding admin costs. Businesses would need to meet both UK and\nEU requirements when they register new chemicals or seek authorisation to sell\ninto both markets, creating duplication of registration fees and additional\nadministrative burdens. EU WTO tariffs of on average 5% would also apply.”\nI hope every reader can now see why in my view no MP should support No Deal at the end of March 2019. It’s why I will strongly support the government Deal, with whatever amendments can be successfully negotiated, in both sides’ interests, to reassure Northern Ireland MPs and colleagues about the temporary insurance policy no-one wishes to use.\nBut if parliamentary colleagues from both main parties did not support that I would certainly then vote to take No Deal off the table, and the government would then have to propose a delay of Article 50.\nAll of which would then bring uncertainty to the Brexit process and outcome, whereas what we need is to respect the Referendum, and deliver Brexit and certainty.\nAll the more reason therefore for both Conservative and Labour to support the government Deal and provide that certainty. There would be no reason in that situation for MPs in either party not to do so: both should fulfil their shared manifesto pledge to respect the Referendum.\nIt may not happen on March 29th but it can still happen, sensibly, and close to March 29th. We need a new agreement with the EU on a legally binding annex, revised advice from the Attorney General, DUP buy in and ERG support. It would be good for the EU and the UK. Then it needs to pass Parliament.\nI remain optimistic (as Churchill said of the USA) that Parliament will do the right thing - after exhausting all other options.\nBest regards\nRichard",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_guy-verhofstadt-exiting-eu-committee/content_38.html": "I'm encouraged that the European Parliament's stance means Brits working in the EU can still transfer around Europe after Brexit. Watch my questions to Guy Verhofstadt, the European Parliament's Brexit Coordinator here:\nI'm encouraged that the European Parliament's stance means Brits working in the EU can still transfer around Europe after Brexit. Watch my questions to Guy Verhofstadt, the European Parliament's Brexit Coordinator here:",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_pass-plastic/content_22.html": "Sky Ocean Rescue's plastic whale outside Parliament symbolises the amount of plastic that ends up in the ocean every second. This is why we're trying to reduce plastic use, but we all know that we need to do more.\nSky Ocean Rescue's plastic whale outside Parliament symbolises the amount of plastic that ends up in the ocean every second. This is why we're trying to reduce plastic use, but we all know that we need to do more.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_prime-ministers-trade-envoy/content_11.html": "In Autumn 2012 I was appointed as the Prime Minister’s Trade Envoy to Indonesia, then in August 2015 and in January 2016 to the ASEAN Economic Community, Malaysia and the Philippines.\nTrade Envoys are a network of Prime Minister appointed Parliamentarians in the Lords and Commons, drawn from across the political spectrum. We engage with markets where UK Trade and Investment (UKTI) has identified substantial trade and investment opportunities.\nWe support the drive for economic growth by building on the UK’s existing relations with these markets and maximising bilateral trade, thereby generating real and long term benefits for the UK. There are currently 24 Trade Envoys covering roughly 50 key nations.\nASEAN Economic Community\nThe Association of South East Asian Nations (or ASEAN) Economic Community was created in 2015 and forms a single market of $2.6 US trillion and over 622 million people. The group consists of ten countries and you can see more about it here .\nAs Trade Envoy, I encourage and develop trade and investment for mutual benefit in every area from tourism and education, to cyber, fintech and aerospace. Investment from the areas I cover into the UK include Whyte and Mackay Whisky, the Battersea Power Station and Igene (digital autopsies).\nThe UK is the largest European investor in many ASEAN markets and our education links are particularly strong in Malaysia, while aerospace, defence and cyber relationships are important in all.\nI wrote an article on the importance of ASEAN after Brexit, read here: https://www.prospectmagazine.co.uk/economics-and-finance/eastern-promise\nIndonesia\nI lived and worked in Indonesia years ago as an airline manager, and speak Bahasa Indonesia. As the Prime Minister’s Trade Envoy I help UK businesses with high level contacts, where they have something to offer that meets Indonesian needs – project management or engineering design skills for the Asian Games 2018 or national infrastructure projects, for example – as well as encouraging Indonesian businesses to set up in the UK.\nI am also Chairman of the Indonesia All-Party Parliamentary Group (APPG) which exists to promote interest in and understanding of Indonesia among parliamentarians and to develop contacts with parliamentarians and others in Indonesia.\nMalaysia\nIn January 2016 I accompanied the Prime Minister to Malaysia and was appointed as the Prime Minister’s Trade Envoy there.\nSince then I have met Malaysian ministers, officials and businesses both in Kuala Lumpur and London, where I have opened the Khazanah (Sovereign Wealth Fund) office, opened an Education Initiate, and chaired a Commonwealth Enterprise and Investment Council session on Malaysia.\nMalaysian businesses are also interested in our infrastructure – where it dovetails with their relevant experience.\nPhilippines\nI was general manager of an airline in the Philippines from 1984-6 and travelled widely there; I also learned Tagalog. In August 2016 I went back to the Philippines as the Prime Minister’s Trade Envoy. I had discussions with President Duterte and key ministers on trade, investment, infrastructure, the rule of law and more widely how our two countries can work more closely together. Direct flights from Heathrow to Manila on Philippines Airlines (PAL) literally helps to bring us closer, and Brexit offers potentially good news for sugar cane producers.\nIt was great to be back in Manila, Cebu and seeing UK businesses like Prudential thrive. Infrastructure is crucial to Cebu’s continued success, as Governor Davide told me. The Public-Private Partnership Centre is key for projects like the Mactan-Cebu Airport. You can read more about my trip on the ABS-CBN news channel website here or watch below.",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_sudbrook-community-garden-opening/content_30.html": "For those who remember the abandoned Norville specs factory on Hatherley Road in Tredworth of a generation ago, followed by an arson attack a decade ago - leaving a half burnt down crumbling mess of red brick – it’s now a new community garden.\nBurnt out Norville Factory and now new Community Garden as viewed across the Sudbrook\nWhat is now the garden - on the other side of the Sudbrook - hasn’t been open to the public for at least 100 years, and it could have stayed unused and unloved for decades more.\nThe modern part of the journey started with me encouraging Frank Norville to put the site to good use and him reaching an agreement with Markey for housing. Then Rooftop Housing Association came in and now own and manage the site, having completed a development on a difficult sloping site that provides badly needed social housing.\nSince I first saw the site I saw the potential for a garden there. Barton & Tredworth has the least green space of any ward in Gloucester so there was definitely a need for more, but dreams are one thing and realising them another. I was keen to reclaim this area and see something green and attractive created for residents and their children.\nLuckily in Boris Worrall, Rooftop has a CEO who sees the benefit of great community work in a city where they already work in close partnership with Gloucester City Council. So when both these partners were convinced by my Chief of Staff Jennie Watkins of the merits of investing in something special, and encouraged by a visit from then Environment Minister Rebecca Pow, we had the beginnings of the right ingredients for success.\nThen County Councillor Saj Patel contributed from the County Council’s Build Back Better Fund, Markey's who went the extra mile on the building elements, garden design from Andre at BM3 Architects, survey help, planning approval, and lots of site visits by Andy and David from Rooftop.\nLast of the ingredients Jennie arranged a call for artists run by the Gloucester Culture Trust for murals. Julie and Sam’s brilliant design by the entrance on Hatherley Rd won and marks a symbolically cheerful change from the bolted door of the past. My Senior Researcher Dan and I then did a clean-up of the brook a few days before. Dan’s film of this is here: https://fb.watch/e-qSR7DBlT/\nWinning art design by Sam Davies and Juliet Duckworth and cleaning out the Sudbrook\nThe icing on the opening cake was provided by Tony Farmer of the B&W Group in Brunswick Rd. He funded the opening, the gazebos, bouncy castle, drinks and ice creams. Why? Well he started life close to the Sudbrook and wanted to put back into his community. (Also true I once found and returned his wallet, but that’s another story).\nTony Farmer of Black & White Group, sponsors of the opening and community gathered for ribbon cutting\nTony added a bit of class to our opening, and we invited lots of near by residents to join all the partners.\nSo to everyone who has made the creation and opening of the Sudbrook Community Garden space possible- a big thank you.\nIt’s a big deal precisely because it’s small and community focused. This isn’t funded by some great big government bid: but by several partners coming together - co-ordinated by my office, supported by the City Council, Rooftop, and the two local councillors Saj Patel and Shams Zaman Litu. Residents reactions? Like the Mock Mayor of Barton, Hash Norat, they love it- and hope that a few troublemakers don’t spoil this new asset for the many.\nWhen the planting is finished and grown, and the local community have decided how best to make best use of the garden for eg children’s birthday parties, the Sudbrook Community Garden will be even better.\nOf course there will be questions - eg ASB. There are extra steps on security to consider and fly tipping (especially in the brook) to resolve.\nKeeping the garden a happy place for families will require effort and ongoing commitment - but this is a well overlooked and easily monitored site, not a good place for trouble makers and law breakers.\nIn life we all travel with optimism, and I’m convinced that Sudbrook Community Garden is good in its own right for residents near by, good for Tredworth as an increase of green space and good for Gloucester because it shows the MP, Council and Rooftop do not ignore any part of the City. In fact I believe this is as good as a micro example of what a grizzly Brownfield site can be turned into as can be found anywhere in the Country. I love it when Gloucester delivers positive surprises.\nBest regards\nPS do let me know your reactions and thoughts!",
  "https_www_richardgraham_org_/https_www_richardgraham_org_contact/content_2.html": "Richard is no longer the MP for Gloucester. If you are looking for help, please contact Alex McIntyre MP: https://www.alexmcintyre.co.uk/support\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_category_European-News/content_7.html": "Update on Leaving the EU 1st April 2019 This is a general note to all who’ve e mailed or otherwise contacted me about the issue of our Leaving the EU, which I’m making available to ALL my constituents... European News\nThis week's Brexit votes 15th March 2019 In light of this week’s Brexit votes I am writing to update you on what has taken place and how I see things. I think the stars are beginning - just - to align... European News\nBrexit Update 13th March 2019 Tuesday 12th March I voted with the government for the Withdrawal Agreement Bill that is the necessary first negotiated step for leaving the EU. Had we... European News\nWhy is a Brexit No Deal a problem? 5th March 2019 I sometimes get emailed asking me to substantiate my strong belief that, from where we are now, No Deal would be a disaster. One way to do this is to list all... European News",
  "https_www_richardgraham_org_/https_www_richardgraham_org_news_category_Opinions/content_15.html": "Mr Bates v Post Office Ltd: How do we sort this out? 2nd February 2024 Toby Jones as Alan Bates in the ITV Drama I recommend everyone watch Mr Bates v Post Office Ltd ( https://www.itv.com/watch/mr-bates-vs-the-post-office/10a0469... Opinions\nWhat hope for Israel and Gaza? 24th November 2023 Strike on Ashkelon, southern Israel Rubble of building in Gaza City The appalling, ghastly events in first Israel and then Gaza bring alive the fragility of the... Opinions\nWhat’s Happening to NHS Dentistry? 7th February 2023 The main health focus at the moment is largely on waiting times for GP appointments, ambulances and treatment at the Gloucestershire Royal Hospital (GRH). There... Opinions\nWhat do you think of teacher strikes? 2nd February 2023 Yesterday the National Education Union (NEU) was out on strike across the country. What are the details, why are they on strike and what does it mean? The... Opinions\nEnews: What help for homes, businesses, schools, charities etc 30th September 2022 There’s a lot coming from a new government in a hurry to solve some big economic problems. Not all of it has gone very well and some changes need to be... Opinions\nWar in Ukraine: where do we go from here? 7th March 2022 “There are decades when nothing happens and there are weeks when decades happen.\" - Lenin \"I remember standing on the Berlin Wall the day it fell and believing... Opinions\nMy statement on Sue Gray Report 1st February 2022 Dear Constituent, Thank you for your mail following the Gray Report, and I hope you will forgive me for answering you all with the same statement (which will... Opinions\nMy statement on events at No10 18th January 2022 To all of you who’ve written - thank you. To you, and to all who haven’t yet written (to [email protected]) but have been thinking about the issue... Opinions",
  "https_www_richardgraham_org_/https_www_richardgraham_org_events-gloucester/content_35.html": "[Action required] Your RSS.app Trial has Expired. Your trial has expired. Please update your subscription plan at rss.app. - (j49k2xdizyJKK6hb)\nPhotos from Gloucester's post There are only a few more weeks to see the Titanic Honour and Glory Exhibition at the Museum of Gloucester This incredible exhibition expl\nRoman Venus at the Museum of Gloucester Check out this video from the Museum about the 'Venus' Statue that was discovered! 'Venus' will be on display at the Museum of Gloucester f\nPhotos from Gloucester's post On Thursday 15th September 2022, The Real Greek will open a brand new location in bustling shopping and dining destination Gloucester Quays!\nbetsysbooktok on TikTok A couple of weeks ago, betsysbooktok on Tiktok visited Gloucester and our Waterstones! We were able to give her a Gloucester Gift Card to u\nTimeline photos Gloucester Goes Retro was a great day for the city! We would love to have your feedback to ensure that the day is even better next time!\nTimeline photos The AJ Bell Tour of Britain is heading to Gloucestershire on Friday 9 September! Why not turn it into a staycation in Gloucester?\nPhotos from Gloucester's post Green Flag Success for Gloucester's Parks! Barnwood Park and Arboretum; Saintbridge Pond and Allotments; and Robinswood Hill have all again\nPhotos from Gloucester's post Happy Ukrainian Independence Day! Last night we lit up our buildings in blue and yellow to show support for our Ukrainian friends!"
}