{
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_09_06_green-minds-meet-at-august-social/content_51.html": "On Monday 21 August, Chichester & Arun Green Party hosted a Green Social for members and apolitical but green-minded people alike at Reina Kitchen in Chichester. It was a lovely venue for a Green gathering. With our own space reserved upstairs, dedicated service and a lovely menu to choose from, people came from Bognor, Rustington, Yapton, Littlehampton, Arundel and of course Chichester and surrounding areas, to enjoy each other’s company and put the green world to rights with lots of informal conversation and debate. Especially enjoyable was the presence of some who are also involved in other activist groups and campaigns, including Switch Off The Lights, Extinction Rebellion and Just Stop Oil. Also great especially for new faces, was a chance to meet local councillors Sarah and Tim (from CDC), Carol (Arun DC) and Grainne (Havant).\nWe are keen to hear from members on subject areas people would most like to have a talk and debate about. So far we are suggesting topics such as: ‘How can we persuade people out of their cars much more?’; ‘Food security, quality and farming’; ‘Climate breakdown – mitigation & adaptation’; and ‘War and the ubiquitous normalisation of it in the media’. In discussing any of these areas we must of course be mindful of what we can most have an influence on and be clear about how we will go about it, both as individuals and in our groups.\nDeborah Smith, Arun area co-coordinator and organiser of the August social, said: “After the talking, it MUST be, and it was, heartening to hear about all the street-based and on-line campaigns, legal cases, local democratic participation in development consultations and council meetings that are going on. NOW is the time for all the groups and tribes to come together, enhance democratic processes, sift out the verbiage and not be deflected from priorities by too much bureaucracy!!”\nOur next Green event is a wonderful talk that will take place on Tuesday 26 September entitled: ‘How can we get government policies changed?‘ The Chichester and Arun Green Party has invited three speakers who are deeply involved in legal actions opposing oil and gas drilling: Sarah Finch, Sue Taylor and Lorraine Inglis. Everyone is welcome to join us, to discuss these issues and hear more about our speakers’ experiences with the legal system. The talk will take place at Chichester Quaker Meeting of the Religious Society of Friends, Priory Road Chichester PO19 1NX. You can read further details and register your intent to attend on the Eventbrite event page.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_03_28_greens-arundel-south-downs-candidate-ready-to-take-on-conservatives-at-general-election/content_82.html": "A hard-working community champion and environmentalist with a wealth of knowledge on local issues has been selected by the Green Party as its MP candidate for Arundel & South Downs.\nSteve McAuliffe is an ex-British Army Air Corps soldier whose 20-year career in ecology and environmental management consultancy has spanned both industry and politics. He represents Arundel & Walberton on Arun District Council, is a board member of South Downs National Park, and recently completed his Masters, focusing on protected species legislation and anthropogenic impact mitigation.\nMcAuliffe has already shown that he is a viable option for many Conservatives. In the last 15 months he has won two elections in the affluent and ‘safe’ Tory ward of Arundel & Walberton – the second of which secured a further two Green seats and a clean sweep.\n“I believe we have a chance of taking this constituency from the Conservatives for the first time in decades1. Life-long Conservative voters have voted for Green candidates in unprecedented numbers at recent local elections,” says McAuliffe.\n“Our current systems and policies are failing to secure a sustainable and affordable future for the people of Arundel & South Downs, our wildlife and the wider world. A green technology and infrastructure transition is viable, economically prudent and in all our best interests and I believe Green politics is in tune with the values and views of the majority of Arundel and South Downs constituents.”\nMcAuliffe has a solid track record of delivering on campaign promises demonstrating hard work and an ability to get things done. A key campaign pledge last May was to prevent the development of an Air BnB ‘party house’ in River Road, Arundel. By September McAuliffe got the plan scrapped following significant work to discredit the financial basis of the project, the erroneous income predictions and unrealistically optimistic build costs.\nLocal party spokesperson Faye Mackenzie says: “I’m delighted Steve has been selected to represent communities across Arundel & South Downs in the much-anticipated election this year. Like the rest of the country, people in Arundel & South Downs are fed up of sewage, flooding, inappropriate development and the lack of investment in essential services like the NHS. Steve is the change candidate the people of Arundel & South Downs need as their representative in parliament.”\nDid you know? Arundel and South Downs has been held by the Conservatives since it was created in 1997. Previous iterations were also a Conservative stronghold.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_06_08_great-big-green-week-2023/content_45.html": "This Great Big Green Week, Councillor Sarah Sharp (Chichester South) and the wider Chichester & Arun Green Party are hosting a series of activities for local members and residents alike.\nSaturday 10th June – Selsey Litterpick\nBus trip to litter pick in Selsey on the beach. Meet at the Cathedral to take the 51 to Selsey at 10.15 am.\nTuesday 13th June – Florence Park Orchard\nWork on the mini orchard on Florence Park from 9am. Wear sturdy shoes and sensible clothes. Bring tools if possible. Refreshments will be provided.\nWednesday 14th June – Whyke/Kingsham Litterpick\nLitterpick in the Whyke/Kingsham area of Chichester. Meet at 4pm at the Bandstand on Whyke Oval. After litterpicking we will meet again at 5.30 pm to have some refreshments and to make some community art with the litter.\nFriday 16th June – Letters to Tomorrow\nJoin us at the Earth Cafe in the Guide Hut, Whyke Lane, 11- 1pm to get your creative juices flowing and write some Letters to Tomorrow. You can find out more details here: Home – Letters to Tomorrow. This is a national campaign about writing letters about your hopes and fears for the future to your future self, or to your grand-children.\nFriday 16th June – Plant-Based Dinner\nJoin us on a bus trip to Midhurst for a plant-based dinner in the Old Library. We will be taking the no 60 bus from the Cathedral at 5.55pm . You need to book your tickets for the dinner here: Sustainable, Plant-Based Dinner, in The Old Town Hall, Midhurst Tickets, Fri 16 June 2023 at 19:00 | Eventbrite\nSarah Sharp said: “I very much hope that residents in Chichester can get involved in the national Great Big Green Week brought together under the umbrella of the Climate Coalition. I am very excited to be taking part in two bus trips, working on the mini orchard on Florence Park and litterpicking in Selsey as well as in Whyke! Please register in advance by phoning or texting 07789 843556 or emailing GreenSarahSharp@gmail.com if you would like to get involved. Ideally every week should be a green week for us all to look after our environment but this ‘Great Big Green Week’ focuses our mind on championing and protecting the natural world around us. I hope that residents will have fun and enjoy getting involved in the community events that have been planned to make our environment cleaner and greener.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_01_29_ellie-chowns-grills-ed-miliband-over-airport-expansion/content_35.html": "The Independent reports on Ellie Chowns’ grilling of Ed Miliband over airport expansion at the Environmental Audit Committee yesterday. Ellie asked the energy and climate change secretary: “Would you agree that major infrastructure investment decisions or permission decisions such as, for example, airport expansion should not be taken before we get the forthcoming advice this month from the [Climate Change Committee] and that such policies such as airport expansion are, as the [Climate Change Committee] previously said, incompatible with meeting the targets we already have?” After being pressed further, Ed Miliband said: “I just want to provide this element of reassurance to you, which is, 100% any aviation expansion must be justified within carbon budgets, and if it can’t be justified, it won’t go ahead.” The exchange was also covered in the Mail and the Telegraph.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_01_18_no-excuse-for-delaying-elections/content_18.html": "Green MP Siân Berry said expense “should never be used as an excuse” to delay democracy during a debate on local government re-organisation on ITV Meridian. Sian added: “There is a good argument for a devolution of powers down to a local level but this reorganisation will put a lot of powers higher up – take it away from the districts and boroughs – and introduce these super large councils. Delaying elections that are due this year in order to make that happen quicker isn’t the right answer. We need to do this carefully, we need to have a democratic mandate for it and that means going ahead with [May’s local elections].” Watch the full programme here.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_12_12_climate-adaption/content_57.html": "In the Commons, Green MP Ellie Chowns challenged the government on adaptation in light of the havoc wreaked by Storms Darragh and Bert. She asked, “Given the strong evidence that links increasing frequency and severity of storms to climate change, can I ask what’s the minister’s response to the comments of Emma Pinchbeck, the new chief executive of the climate change committee, who said at the weekend that the UK is not ready for these increasingly severe impacts of climate change… What will the government do to make adaptation an urgent national priority? See the full clip and answer on BlueSky.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_03_13_arundel-bypass-deferred/content_68.html": "Members of Chichester & Arun Green Party were delighted to hear that plans for the divisive and unpopular bypass ‘grey’ route have been put on hold by the government. Local Green activists and councillors have stood alongside residents for the past four years, as the community has been torn apart and put under enormous stress by the incompetent antics of National Highways.\n“We have always opposed all Bypass routes, except for the Arundel Alternative, put forward by local people that would work at a fraction of the cost,” said Cllr Isabel Thurston, Green leader at Arun District Council and long-time road campaigner. “A green solution would also include measures such as improved public transport, safe active travel routes, smart travel measures and better management of freight.”\nArundel and Walberton councillor, Steve McAuliffe, said: “The past few years have been very difficult for local residents in the whole Walberton, Fontwell and Binsted area, as they have feared so much for their homes and quiet way of life. Now we are going to carry on campaigning to make sure the landscape and community is properly protected in case the destructive proposals are brought back in the future. I have worked hard to raise the profile of the wildlife and habitat damage that would be done, and I’m glad the Secretary of State for Transport has highlighted the same issues.”\nGreen Party Deputy Leader, Zack Polanski, visited Arundel recently to express solidarity with local people. Speaking to a packed room in Arundel, he addressed many issues dear to local residents, such as the bypass and inappropriate housing developments. From local councillors to party leadership, Greens are confident they have better solutions to transport issues and will continue to work hard to ensure that any future government will listen.\n“We would like to pay tribute to all the people involved in the fight against the ‘road to nowhere’,” said Cllr Thurston. “While we celebrate the reprieve we have been granted, the fight will continue to protect this landscape and communities.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_videos/content_3.html": "Please see our Chichester and Arun Green Matters YouTube resource for local Green Party video content\nFaye Mackenzie, our Arun Area Coordinator & Social Media Officer, set up the YouTube channel named Chichester and Arun Green Matters where our local party videos are now being posted.\nTo access the channel you may either follow this link or alternatively you may enter the channel name into the YouTube search bar “@Chi_and_Arun_Green_Matters”.\nWe recommend clicking the subscribe button if you wish to conveniently follow our local Green Party’s video content as soon as it is created.\nOur most recent videos are from talks and discussions held at Barnham Community Hall on the evening of April 19th 2024.\nJonathan Kent began with a talk explaining why he is standing as a candidate to become the Sussex Police and Crime Commissioner. He described the kind of policing he believes the county deserves.\nJonathan’s talk is available to view on the embedded YouTube video shown below.\nSue Wallsgrove, Paul Ayling, and Anita Lawrence are the Green councillors representing Barnham area. They held a discussion with the residents covering community concerns over sewage, flooding, the deluge of new housing development and anti social behaviour. Astronomer John Mason (who is not politically aligned) gave a good account of the problems of local flooding and explained the long term causes of these issues.\nThe discussion chaired by Sue Wallsgrove is available to view on the embedded YouTube video shown below.\nBiodiversity Net Gain talks that Arun and Chichester Green Party were organised at the Friends Meeting House in Chichester on the 24th January 2024.\nSteve McAuliffe who is an Arun District Councillor gave the first of four BNG talks.\nAlex Briggs spoke on behalf of Weald to Waves and gave the second of four BNG talks.\nThe third talk was by Oliver Gammon (of Chichester District Council) who shared his broad knowledge of environmental planning matters and delivered the third BNG talk. His talk can be viewed from the embedded YouTube video below.\nTony Whitbread, President of the Sussex Wildlife Trust gave the final of four BNG talks.\nThe event finished with a questions and answers session where our expert panel addressed the audiences concerns and queries.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_tag_refugees/content_71.html": "Our Work with Chichester Welcomes Refugees 5 April 2024 / 5 April 2024 by Anandamayi Mem For the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the […] Read more » Chichester Racism Refugees Rwanda",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_09_27_arundel-chord/content_50.html": "Chichester & Arun Green Party has responded to Southern’s West Coastway consultation to express disappointment that the proposed changes are a further erosion of local rail services and direct train travel through West Sussex. [1] Equally disappointing is that once again, despite overwhelming public and political support, the provision of a 500-metre ‘Arundel Chord’ addition (which would provide direct services to Brighton without having to change trains at Barnham) has not been considered.\nLocal Greens say simplifying the journey between Arundel, Worthing and Brighton stations, thereby negating the need to ‘change trains and double-back’ at Barnham or Littlehampton, would encourage greater local rail use. This provision of a viable alternative to car travel, especially for daily commutes, along the West Coast corridor would facilitate a reduction in local road traffic and air pollution and is far preferable to an expansion of the local road network. An Arundel Chord may also prove a boost to the local economy by providing direct rail connectivity between the two major tourist destinations of Arundel and Brighton.\nArun District Councillor Steve McAuliffe (Arundel & Walberton), who submitted the response on behalf of Chichester & Arun Green Party says: “Changing trains mid-journey reduces train travel desirability and increases car travel preference. This is especially the case in winter months when ‘platform time’ is particularly unwelcome. While we welcome service improvements and enhancements, transformational change like the addition of a chord – as well as improvements to timetables and service frequency – is required to promote practical alternatives to car use.”\nFewer car journeys through the Arundel area would alleviate local congestion and trunk road pinch-points. Road traffic impacts within Arundel, Crossbush, Lyminster and the surrounding villages would be lessened whilst the current A27 impasse is resolved. During academic terms, when car use increases for student ‘drop off’ and ‘pick up’, a move to efficient rail travel between Arundel and the campuses at Worthing, Brighton and Chichester would be improved. Ford Road, currently used by school and college students, would see fewer car journeys, thereby reducing road hazards and student risk whilst concurrently improving the traffic situation for local residents.\nCllr McAuliffe continues: “Healthier local air and improved river water quality would result as vehicle pollution levels drop. Active travel enhancements are considered likely to follow via an expansion of inter-connected rail, cycle, mobility and walking routes. Public wellbeing, environmental improvements, student safety and rail network resilience are all foreseeable positive consequences of an Arundel Chord addition.”\n[1] Direct services between Bognor and Littlehampton, Bognor to London Bridge and Brighton to Portsmouth are subject to further cuts and deterioration.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_05_11_arun-greens-election-success/content_58.html": "Greens in Arun are celebrating a successful set of results in Thursday’s local elections. The party now has six seats on Arun District Council, with four new councillors elected and two successfully defending their existing seats.\nThe new councillors elected are Paul Ayling (Barnham), Anita Lawrence (Barnham), Carol Birch (Arundel & Walberton) and Melanie Penycate (Arundel & Walberton). The Green councillors who held their seat are Steve McAuliffe (Arundel & Walberton) and Sue Wallsgrove (Barnham).\nLocal Green Party spokesperson, and newly elected councillor, Carol Birch said:\n“We’re delighted! These great results show that people here in Arun have put their trust in the Green Party – they know we do politics differently and put local people and our environment first. They know how hard we work and that we will give our all to address the issues that matter most to our residents.”\nSteve McAuliffe, who successfully defended the Arundel & Walberton seat he won in the December 2022 by-election, said:\n“Our aim is to strongly influence ADC decisions in a positive way. With more Greens on the council we will work on introducing enhanced policies and measures that protect our residents and the environment from unsustainable development. We acknowledge that critical infrastructure is needed across Arun. But with more Greens on the council we will have a stronger chance of ensuring that where these projects are delivered it will be done as sensitively as possible, in line with the highest environmental standards and ready to meet the needs of a low carbon economy.\n“Thank you to every voter and campaigner who helped get Greens elected here. Our councillors will work tirelessly for a fairer, greener community in Arun.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_06_27_greening-steyning-climate-hustings/content_19.html": "Green Parliamentary Candidate Cllr Steve McAuliffe wins hearts and minds at the Greening Steyning Climate Hustings\nLast night, Wednesday 26 June, all six candidates for the Arundel and South Downs constituency participated in a ‘Question Time’-style Climate Hustings, organised by Greening Steyning. The audience in the packed Drama Hall at Steyning Grammar School heard a variety of views, from serious concern and the need for real action on the climate and ecological emergency, to scepticism about the issue from the Reform candidate. Perhaps unsurprisingly, the applause for Steve McAuliffe, Green parliamentary candidate for Arundel and South Downs, was notable.\nThe questions challenged candidates in ways many had clearly not considered. Did candidates hold shares or investments in fossil fuels? This question proved tricky to answer for all except McAuliffe. Other candidates were unable to confirm if their pension pots were ethical or that they had no such investments. McAuliffe confirmed he had an ethical bank account and invested his money in a scheme to promote green projects across the world.\n“This is one really important thing we can all do,” McAuliffe said in a clear message to the audience. “Check your pensions, ask your providers about where your money is being invested and beware of greenwashing.”\nIn response to a question from a Horsham District councillor about solar farms, McAuliffe took a very different line to former Arundel and South Downs Conservative MP, who had called in the recent decision by Horsham Council’s Planning committee to pass a solar farm near Cowfold to the Secretary of State for review. McAuliffe, a retired ecologist, said that, while solar panels are best on buildings, warehouses and supermarkets, allowing them on farmland for a limited time has huge benefits in both allowing soil to regenerate and providing local, affordable clean green energy. He acknowledged that they can be an eyesore but emphasised the importance of giving some certainty of income to farmers beleaguered by unpredictable weather patterns and depleted soil.\nAfter the meeting McAuliffe met local people who had been impressed by his knowledge, expertise and views on key climate and nature issues. The positive feedback is further confirmation that Arundel and South Downs, often reported as a ‘safe seat’ for the Conservatives, is ready for change. Looking at votes cast in the 2023 local elections across the constituency and covering the new boundaries, the picture places the Green Party in a strong second place.\nThe event was filmed by Greening Steyning and will be available to watch here.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_05_25_west-sussex-hydrocarbons-policy-requires-review/content_83.html": "To continue to allow oil and gas extraction in West Sussex – in a way that adds significant amounts of carbon dioxide and methane to the atmosphere – or to conduct a formal review: that is a decision West Sussex County Councillors will be faced with this week. The five-yearly Assessment of the Joint Minerals Local Plan is on the agenda at this Friday 26 May’s West Sussex County Council meeting (Item 11). Despite the fact that it is clear that climate change is escalating and is affecting West Sussex in many ways, the accompanying officer’s report concludes that the plan remains effective and that no formal review is needed.\nCllr Sarah Sharp (Green, Chichester South) will urge councillors to oppose this recommendation and call for an urgent review into the Joint Minerals Local Plan, particularly Policy M7 on hydrocarbons, which does not take adequate account of the urgent issue of climate change, and will continue to allow oil and gas extraction in the county in a way that adds significant emissions to the atmosphere.\n“Only in the last week the news has included the update issued by the World Meteorological Organization (WMO) predicting we are likely to exceed 1.5ºC within the next five years, a significant milestone for climate tipping points,” says Cllr Sharp. “We hear more and more about extreme weather, including droughts and catastrophic storms and the recent devastating floods in northern Italy. The consequences of these are getting closer to us; they include consequences on our food supplies, and we are starting to feel these already in our shops.\n“Therefore, the need to reduce emissions has to be an essential part of planning policy generally, but specifically the Minerals Policy because it includes policy on oil and gas. Scientific opinion is quite clear that it is the use of oil and gas that is the main driver of climate change, so much so that in 2018 the International Energy Agency warned that there should be no more investment into new oil and gas[1]. In the light of this urgency, it is unacceptable that the present Minerals policy does not include a need to consider climate change as part of the policy.”\nThe officer’s recommendation that no formal review is needed is even more surprising as the strategic objectives in other parts of the policy, such as Policy M19 on Flood management and M20 on transport include the objective, ‘To minimise carbon emissions and to adapt to, and to mitigate the potential adverse impacts of, climate change’. However, there is no similar strategic objective for the extraction of hydrocarbons.\nThis is important for a number of reasons as local Green spokesperson Ann Stewart explains: “The singleton oil site in West Sussex flares by far the largest amount of methane of all the onshore oil sites[2]. Flaring means that methane (the gas used in our heating systems) is burned in a flare and turned into carbon dioxide. Including a requirement in the minerals policy to collect and use this gas rather than waste it would reduce local emissions as well add to our national energy supplies.\n“However, by far the greater climate impact comes from the use of oil and gas. While there is no doubt that we will still be using these hydrocarbons up to 2050, our national net zero target date, we have to dramatically reduce their use in that time; if we are to keep within the Paris climate target we have to reduce emission by about 50% by 2030, seven short years from now.”\nElsewhere, councils are becoming involved in legal actions over their planning decisions. Recently residents of Balcombe won the right to appeal against the Government’s decision to overthrow the WSCC decision to refuse further drilling at the Balcombe site[3].\nSurrey County Council, has been through the court system over their decision at Horse Hill, and the case has now reached the Supreme Court where it is due to be heard this June[4]. This case is based on the need to consider all the emissions from any new oil production, including the use of the oil.\n“A minerals policy that does not include climate change as part of the policy on oil and gas is likely to result in legal challenges in the future,” says Ann Stewart. “The sensible course of action is to review the policy now.”\nReferences\n[1] https://www.reuters.com/business/environment/radical-change-needed-reach-net-zero-emissions-iea-2021-05-18/\n[2] https://drillordrop.com/2023/03/09/offshore-flaring-halves-in-four-years-but-onshore-hits-record-high/\n[3] https://drillordrop.com/2023/05/07/residents-get-go-ahead-for-court-challenge-to-balcombe-oil-test\n[4] https://news.sky.com/story/amp/horse-hill-court-battle-could-set-precedent-that-triggers-beginning-of-the-end-of-new-fossil-fuel-projects-in-uk-12881348",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_category_uncategorised_page_2/content_93.html": "2 January 2025 / 2 January 2025 by adrianmorris\nRead more »\n17 December 2024 / 17 December 2024 by adrianmorris\nThe government’s new planning framework, “fails to tackle the housing crisis head on and instead panders yet further to the interests of private developers whose main interest is lining their pockets,” Green Party co-leader and MP Adrian Ramsay has warned. Read our response in full here.\nWelcome to our December 2024 newsletter Thanks for your support in 2024… See you in 2025! A huge thank you to everyone who has supported the Green party this year. Every action makes a difference: from talking to others about the green issues that matter, to being one of our local volunteers or councillors. This […]\n12 December 2024 / 12 December 2024 by adrianmorris\nIn the Commons, Green MP Ellie Chowns challenged the government on adaptation in light of the havoc wreaked by Storms Darragh and Bert. She asked, “Given the strong evidence that links increasing frequency and severity of storms to climate change, can I ask what’s the minister’s response to the comments of Emma Pinchbeck, the new […]\nArun and Chichester Green Party have responded to the consultation on Southern Water’s “Water Resources Management Plan”. You an read our response at https://docs.google.com/document/d/1UO4g00yUIoomgHqmzsjWDS8ztPzeT8XDXLMjfj9T2iw/edit?usp=sharing You can watch our guest speaker, Tracey Viney, give her excellent presentation on the plans here.\n15 November 2024 / 15 November 2024 by adrianmorris\nWelcome to our November 2024 newsletter! Your local Green team We’re delighted to have elected a fantastic team of local party officers at our recent AGM. Please see our website for more details, or come along to our next branch meeting and say hello! Without major donors and funders, the Greens rely on the time […]\n16 October 2024 by adrianmorris\nWelcome to our October 2024 newsletter! Making a difference We already have many hard-working Green councillors in both Arun and Chichester. Next year, the West Sussex County Council elections are taking place, and we plan to get even more Greens elected. Greens believe in supporting all our communities across the region. We offer Real Hope […]\n11 October 2024 / 14 October 2024 by adrianmorris\nOctober 2024 : Issue 14 https://chichesterarun.greenparty.org.uk/wp-content/uploads/sites/212/2024/10/Autumn-newsletter-2024.pdf Can you help with newsletter delivery? We will be delivering this newsletter to Chichester doorsteps from now. If you can help please email contact@chichesterarun.greenparty.org.uk Lunch and tea provided!\n16 September 2024 / 16 September 2024 by adrianmorris\nWelcome to the September 2024 newsletter from your local Green Party. Thank you for being part of our positive campaign for Real Hope and Real Change. Green Talk – housing and planning A huge area of concern for all of us is the need for sustainable and appropriate planning developments. What is the current situation […]\n21 August 2024 / 21 August 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! We have all been shocked and saddened by the tragic events in Southport, and the exploitation of this by far right groups across the country. Please see here […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_11_15_november-2024-newsletter/content_28.html": "Welcome to our November 2024 newsletter!\nYour local Green team\nWe’re delighted to have elected a fantastic team of local party officers at our recent AGM. Please see our website for more details, or come along to our next branch meeting and say hello! Without major donors and funders, the Greens rely on the time and commitment of passionate volunteers. There’s always something for everyone to get involved in, so please do get in touch if you’re able to spend some time helping out.\nOur friends in Horsham are currently running a by-election campaign for the Denne ward. The response so far has been incredibly positive, and we’d all love to see another Green on the Horsham District Council. The election is taking place on Thursday 21 November – and it’s all hands on deck! If you’re able to pop over and help out, the friendly team will be door knocking and delivering literature from now right up until election day. To get involved, please request to join the “Jen for Denne” WhatsApp group. Thank you for any assistance you can give – every bit helps!\nCouncil news\nLast year, our hard-working Arun Green Group in the district council introduced the Rights for the River Arun Motion. Although the local council has very limited powers in this area, the aim of the Motion is to find creative ways to support the River Arun. This includes protection and enhancement mechanisms for areas such as river water quality, wildlife value, and flood defences.\nTo support this, our councillor Steve McAuliffe recently took a boat up the river between Arundel and Houghton Bridge – looking at the condition of existing flood defences and land drainage assets. Along the way, riverbank erosion was discussed with concerned local residents, and leaks in the embankments were pointed out. River litter was also counted, as funding plans are being developed for river cleaning and invasive species removal.\nVisiting at low-tide allowed for some impressive wildlife spotting along the route. Including this young seal, hauled out in the autumnal sun on a fallen tree! This is a reassuring indication of a functional food web on this stretch of the Arun. Additional protections via the Rights for the River Arun Motion would allow us to build on the current health of the river, help prevent future significant pollution, improve flood defences for local communities, protect the creatures that have made the Arun their home, and create improved habitat for the future. It certainly gets our councillors’ Seal of Approval!\nGrowing the next generation of Green councillors\nOur next electoral focus is the West Sussex County Council elections in May 2025, and promoting the best Green candidates to win more local seats. All our members will have recently received an email with further details, and please look out for more information coming soon. If you’re not yet a member, but are interested in finding out more, please contact us.\nOver the next few months we’ll be supporting our selected candidates in their local campaigns. This will include delivering leaflets, canvassing and fundraising – please remember to sign up above to get involved. With many of us disappointed at recent negative political news, it’s now more important than ever that we work together for Real Hope and Real Change. For all of our sakes’ – the future needs to be Green.\nImportant event on our local water – this Tuesday!\nWe’re pleased to be hosting an urgent online talk on Southern Water’s Resource Management Plan on Tuesday 19 November, 7pm, with guest speaker, Tracey Viner.\nSouthern Water’s previous draft plan was rightly rejected by public response. Unfortunately, their new effort is little changed – aside from an extra proposal to tanker water all the way from Norway. Some of our concerns include: instead of plans for efficient rainfall storage, they are proposing an energy and carbon hungry project of effluent recycling; instead of plans to plug leaks quickly, they project to still be leaking 10% of all the water they treat by 2050; and there continues to be a lack of planning around connecting up the network – leading to many good options for water security and safety being missed.\nPlease come along if you can, to find out more details, and ways to respond to the consultation. The consultation deadline is 4 December.\nCome and meet other Greens\nOn the last Sunday of every month, local members join the regular litter pick on Littlehampton beach, followed by a coffee and a chat in The Beach Cafe, Sea Road, Littlehampton (opposite The Wave leisure centre). To join us on the beach clean, please meet at 9.30am by the Shack, where the grabbers, gloves and bags are all provided by the Cafe (as part of Surfers Against Sewage). A member of the Beach team usually leads the clean. Afterwards, we’ll have a coffee in the cafe, from around 11am. Please sign up below – see you there!\nMembers updates\nEach month we hold an online policy discussion for members. It’s a chance to look at an important and topical area in more depth, in a relaxed and respectful setting. Our next topic is local transport (Friday 15 November). In particular, we’ll be looking at the ongoing talks around the A27. You are welcome to join in our members’ discussion by registering here.\nChichester & Arun Greens Festive Party will be held on Friday 6 December at Barnham Community Hall. We invite all new and old friends to help us celebrate the successes of 2024, and look forward to 2025 with renewed purpose. Please look out for an email with more details coming soon!\nOur final branch meeting for 2024 will be on Monday 9 December, 7pm on Zoom. All members are welcome to join us, and non-members can also be admitted by prior arrangement. We look forward to seeing you there!\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok and Threads\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work.\nWe are currently fundraising for the May 2025 county elections\n– please give if you can:\nAll support is very gratefully received. Please always include your last name and postcode as a reference, so we know who to thank.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_georgiearmourglasius_page_3/content_95.html": "8 February 2023 / 13 March 2023 by Georgie Armour\nRead more »\n30 January 2023 / 13 March 2023 by Georgie Armour\n19 January 2023 / 13 March 2023 by Georgie Armour\n3 January 2023 / 13 March 2023 by Georgie Armour\n2 December 2022 / 13 March 2023 by Georgie Armour\nLast night Arundel & Walberton voters rewarded Green candidate Cllr Steve McAuliffe with an astounding 48% of their votes. Cllr McAuliffe received 873 votes to the Conservatives 549. Labour received 407 votes. It is the Green Party’s second win in 12 weeks. Cllr Sue Wallsgrove won the Barnham by-election on September 8, 2022. Arun District […]\n18 November 2022 / 13 March 2023 by Georgie Armour\nNational Highways has released the latest consultation documents on the controversial Grey Route, and the news for Fontwell and West Walberton is concerning local residents. National Highways own figures show Fontwell Village and Eastergate Lane in particular will experience rat-running, increased traffic flows on narrow roads and all of the associated air pollution this causes […]\n22 October 2022 / 13 March 2023 by Georgie Armour\n28 September 2022 / 13 March 2023 by Georgie Armour\n9 September 2022 / 13 March 2023 by Georgie Armour\nParish Councillor Sue Wallsgrove has won the Barnham by-election, joining another Green Councillor – Isabel Thurston – to represent Barnham ward on Arun District Council. Sue has lived in the villages of the Barnham ward all her life. Following her career in the Social Services Finance Team at West Sussex County Council she has been […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_01_03_bus-fare-cap-doesnt-go-far-enough/content_59.html": "Chichester and Arun Green Party welcomes the decision to cap single bus fares in England at £2 on local and regional journeys this January to March, but are disappointed that it is only a temporary measure and doesn’t go far enough.\nGreen Party Councillor, Sarah Sharp, who represents Chichester South on the county, district and city councils said:\n“This fares cap policy should be matched by massive public investment to provide a genuine bus revolution which would mean everybody had access to an expanded bus network. It’s no good having cheap fares for buses that don’t exist. In the countryside it wouldn’t be possible to run a full timetabled service like in an urban area. Community transport, demand-responsive bus systems or dial-a-ride services would be a key way to make bus services work for more people in our rural areas and would be a very sensible way to deliver more services to more people in a cost-effective and sustainable manner.”\nCllr Isabel Thurston (Green, Barnham) added: “I would like to see this go further. £2 for a single means £4 return, and that’s still a lot of money for a regular journey. Green councillors would like to see the price of bus travel reduced further instead of huge budgets gobbled up by new roads. Congestion from new builds will bring gridlock unless more of us use public transport instead of driving where possible. We are backing WSCC’s planned bus infrastructure improvements, to include new signage, more inclusive access and at least one new route in Arun district.”\nBuses are vital to creating fairer, greener communities. Not everyone drives, and in rural areas buses can serve as a lifeline, especially to the elderly, the young and the disabled. Greens have called for the cap on fares to be permanent, not just for three months over the winter. They say diverting £27bn away from road building could pay for huge improvements to public transport services.\n“Affordable bus services, along with other public transport and active travel, is the only way to tackle the interlinked crises of toxic air pollution, traffic congestion, the cost of living and a reliance on fossil fuels playing a central role in climate breakdown,” says Cllr Sharp.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_02_10_devolution-reorganisation/content_36.html": "Labour look set to push ahead with their version of devolution. There are threats and opportunities for\nGreens. This briefing provides some Green principles as apply to devolution, and provides some ways\nfor us to respond.\nIt is our role to both work to shift the plans as they emerge – promoting a better way to genuinely\ndevolve and democratise power – and to maximise the benefits to communities and to future\ngenerations that can be won within the likely outcomes from Labour’s plans.\nSee the following for more information on the Green Party view, while we wait to see Labours detailed plans:",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_01_19_green-party-councillors-stand-with-st-richards-nurses/content_20.html": "Among the Green Party councillors and members who joined the picket line at St Richard’s Hospital this week was Chichester City Councillor and retired nurse, Debbie Carter.\nCllr Carter said: “It was difficult in my day. Now we have an exhausted, worn-down workforce and nurses who are not paid enough to the point that some have to use food banks to feed their families, access hardship funds or walk away from their profession. This is all a far cry from Sunak’s promise in 2020 that the NHS would get “whatever it needs” to deal with the country’s impending health crisis1. That’s why I’m here in solidarity for the nurses, and all public sector workers in their quest for better conditions and better pay.”\nCllr Sarah Sharp - County, District and City Councillor for Chichester South – also joined the action. “It was important to me to join the nurses today and support their strike,” she said. “Probably all of us owe our lives, or those of people we love, to those working in the NHS – I know I wouldn’t be here if it weren’t for the NHS. Nearly 13 years of Conservative understaffing, underfunding and undervaluing the NHS must come to an end. We need to make sure that nurses get decent pay and conditions. They work incredibly long hours and deserve more for their dedication and service to us all. We all stood on our doorsteps and clapped the NHS a few short years ago but clapping is not enough. Fair pay and conditions are a necessity.”\nIn Chichester, and nationally, the Green Party is proud to support those on strike and vehemently opposes the anti-strike bill. The Green Party believes trade unions and other forms of workers’ organisation are essential to upholding and expanding the rights of all people. The right to organise in trade unions has historically underpinned social progress of all forms, enabling people to win advances in prosperity and social equality for all. Attacks on this right to strike – along with the new powers to shut down peaceful protest – set the stage for social progress to be rolled back.\nNotes\n1 https://www.ft.com/content/f16d2b16-63a6-11ea-a6cd-df28cc3c6a68",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_12_17_governments-new-planning-frameworknew-planning-framework-panders-to-profit-driven-private-housing-developers-say-greens/content_30.html": "The government’s new planning framework, “fails to tackle the housing crisis head on and instead panders yet further to the interests of private developers whose main interest is lining their pockets,” Green Party co-leader and MP Adrian Ramsay has warned. Read our response in full here.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_02_15_zack-polanski-visits-arundel/content_79.html": "Zack Polanski, Deputy Leader of the Green Party of England and Wales, spoke to a packed room in Arundel last Monday night, as he addressed many issues dear to local residents, such as road building and inappropriate housing developments. He also spoke passionately about the concern shared by many – and certainly judging by the nodding heads in the room – that people are losing faith in our democratic system, that there was a feeling that “politicians are listening a lot less”; a sense that “decisions are not made in the community’s interest but in the interests of politicians or their vested interests”.\nPolanski explained why Greens’ integrity and independence are part of the reason why they’re winning at local elections across the country, and why the Party’s focus on people and planet are inseparable.\n“What are we protecting the planet for if we are then going to have injustice, mass inequality and communities that don’t look out for each other?” said Polanski. “You could turn that round on me and say what’s the point of compassion and kindness if the planet is burning, and I agree with you too. We need both of those things.”\nMany see the popularity of what might have been seen as a niche talk from a Green Party figure as further proof of the ‘Green Wave’ that is building in traditionally Conservative constituencies. Polanski’s visit to Arun comes after the success of the Greens locally. Greens beat the Conservatives in both 2022 Arun District Council by-elections: Arundel & Walberton ward (December 2022) and Barnham ward (September 2022).\nThe talk and Q&A at Arundel Museum kick-started Polanski’s West Sussex tour. On Tuesday 14 February, Polanski visited Goring (Worthing) – a key target ward in which the Greens came second in the last elections – where he joined candidate Claire Hunt to talk to local residents. A lunchtime event saw him give a talk in Bramber, Steyning (Horsham) to promote the Horsham campaign.\nPolanski has been Deputy Leader of the Green Party of England and Wales since September 2022. He is a London Assembly Member and chairs London’s Environment Committee. Polanski has campaigned for years on Proportional Representation and is working on a Universal Basic Income pilot.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_tag_fmh/content_91.html": "Watch the Biodiversity Net Gain (BNG) talks 4 February 2024 / 7 February 2024 by Mark Record Biodiversity Net Gain (BNG), Nature Opportunity or Planning Fig Leaf? Watch or listen to the Jan 24th 2024 talks on BNG held at the Friends Meeting House, Priory Road to find out what impact this new planning legislation will have. National housing targets are leading to urban development expanding deeper into the countryside. Government says […] Read more » FMH Talk Video",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2022_12_02_another-win-for-arun-greens/content_29.html": "Last night Arundel & Walberton voters rewarded Green candidate Cllr Steve McAuliffe with an astounding 48% of their votes. Cllr McAuliffe received 873 votes to the Conservatives 549. Labour received 407 votes.\nIt is the Green Party’s second win in 12 weeks. Cllr Sue Wallsgrove won the Barnham by-election on September 8, 2022.\nArun District Council now has three Green councillors as Cllr McAuliffe joins Cllr Wallsgrove and Cllr Isabel Thurston (both Barnham).\nCllr McAuliffe said:\n“Voters are yearning for greener, fairer communities and strong local advocates. I am delighted they have placed their trust in me. I will stand up for Arundel and Walberton against the constant threat of excessive house building and unnecessary road building that puts our unique environment, and residents’ health, at risk.”\nThe Chichester & Arun Green Party is delighted to hold the seat of Arundel and Walberton after the previous Green councillor was forced to step down due to ill health. Carol Birch, Arun Election Agent, said:\n“We are delighted with the result, Steve McAuliffe will be a brilliant councillor. It is also a clear no to the proposed A27 Arundel Bypass ‘Grey Route’. With important Arun roads flooded during the campaign we can see that the money needs to be diverted to make Arun resilient to climate change.”\nCllr McAuliffe is an environmental scientist with many years’ experience. He has lived in Fontwell since 2019 and became a Walberton Parish Councillor in 2021. He previously held a Councillor post in Hailsham, East Sussex where he was oversight Councillor for Environmental Matters and Vice Chair of the Planning Committee. Steve will use his expertise to fight the devastating ecological and environmental impact that will result from the proposed A27 Arundel Bypass ‘Grey Route’.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_04_16_april-2024-newsletter/content_69.html": "| Welcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local news A number of our members took part in the successful campaign to get the Broadford Bridge borehole extension refused. West Sussex County Council planning meeting listened to detailed and informative submissions from two of our members, Ann Stewart (pictured) and Philip Maber. The Council then proceeded to vote to refuse the company’s unnecessary request. This was a great achievement, and showed the strength of feeling about leaving fossil fuels in the ground. Our local party worked with many other organisations across the surrounding area, and we’re all delighted with the outcome. You can read more about the campaign here and watch a recording of the meeting here. We are encouraging all of our supporters to share with us what the local environment means to you. By making short videos for TikTok we aim to spread the Green message to more people! Please contact Faye to get involved. A new non-partisan MP Watch group is being set up for the Arun and Chichester area. MP Watch is an umbrella campaign made up of local groups that hold MPs to account on integrity and climate issues. This local group is initially “keeping an eye on” the MPs for Arundel & South Downs (Andrew Griffith), Bognor Regis & Littlehampton (Nick Gibb) and Chichester (Gillian Keegan). They’re currently looking for interested local people (from any or none political party!) to get involved – more details here. Election news The Sussex Police and Crime Commissioner election is coming up on Thursday 2 May. We are delighted to have an excellent Green candidate running – Jonathan Kent from Rother. All Sussex residents on the electoral register are eligible to vote. Jonathan says: “We know what the best policing looks like because so many officers deliver that day-in day-out. I want everyone who lives in Sussex to be able to expect that, regardless of the colour of their skin, background, gender or orientation, I will focus on preventing crime and violence, women’s and girls’ safety and support better funding for youth services while working to ensure we have excellent officers who are welcomed to the heart of every community and every home.” Did you know? With the new rules around photo ID for elections one of the easiest things to do is to register for a postal vote. Anyone on the electoral register can apply for a postal vote and automatically get the papers for every election delivered – no ID or trips to the polling station required! The deadline to register to vote for the Police and Crime Commissioner elections is 17 April, and it’s quick to do here: https://www.gov.uk/register-to-vote. We’re excited to now announce the full list of our local MP candidates: Arundel & South Downs: Steve McAuliffe Bognor Regis & Littlehampton: Carol Birch Chichester: Tim Young West Worthing: Sonya Mallin Thanks to these candidates everyone locally will have the chance to vote Green at the general election. We will also be able to challenge and push all the other party candidates on their climate credentials. In order to campaign we need to raise more funds! If you can contribute, please click here to support our candidates – thank you! There will be more details of fundraising activities, hustings, and campaigning over the next few months. If you have experience in fundraising, or are keen to help out – please contact us. We’re also regularly supporting Siân Berry’s campaign in Brighton Pavilion. Greens from across the south east are coming together to help keep our first Green MP seat. There are many ways to get involved, and it’s a great chance to meet lots of enthusiastic campaigners! If you’re interested in attending any Brighton events, and want to go along with other local Green Party members, please let us know. News from our local councillors Three of our Arun councillors recently took part in an event, speaking to school children about their local council. They enjoyed hearing their questions, and listening to the concerns of the younger generations in Arun. Councillor Steve McAuliffe has met with senior planning officers at Arun Council, to discuss the adverse impact of developments within 500 metres of ‘irreplaceable habitats’ (such as ancient woodland). Both direct and indirect effects were covered, and it was acknowledged that procedures must be improved in line with the guidance from Natural England and the Forestry Commission. Councillor Tim Young was the first parliamentary candidate for Chichester invited to visit the Bosham Association. On his visit he discussed some of the most pressing issues facing the village, including new homes development and pollution in the harbour. Councillor Steve McAuliffe was invited to unveil the newly installed House Martin Tower at the Arundel Community Orchard. The event was part of the annual wassail ceremony and celebration. The state-of-the-art tower has been funded through the South Downs Sustainable Communities Fund, and is part of the broader “Bring Back the Birds” campaign run by Greening Arundel. As a member of the South Downs National Park Authority, councillor Steve McAuliffe has sent a letter regarding the Rampion 2 plans, requesting that the reasons and justifications for routing the onshore cables through the Park be set out in detail by the developer. This has been taken up by the Inspector, and this question will inform the Development Consent Order decision. Please contact us if you want to get in touch with our councillors, or are interested in standing for election in the future. Upcoming events and actions Over the coming months we are going to be focused on getting our positive Green message out to local people. Can you help? Our candidates, councillors and volunteers will be delivering leaflets, distributing 60 second surveys, and canvassing across our wards. If you can help, please sign up here. Friday 19 April. Green Talk in Barnham Community Hall, Yapton Road, Barnham, PO22 0AY. What’s happened to Barnham? We are arranging a meeting to discuss the flooding and sewage crisis that our local areas have been experiencing, plus the recent problems with anti-social behaviour. One of our Green councillors, Sue Wallsgrove, will be speaking about the ongoing situation, her experiences working on the frontline, and the recently established Arun Flood Forum. We also hope to have our Police and Crime Commissioner candidate Jonathan Kent joining us. All welcome – RSVP here. Sunday 28 April, 9.30am. Beach clean in Littlehampton. Local Green Party members will be joining The Beach Cafe on their monthly litter pick along the coast. This is part of the Surfers Against Sewage Million Mile Beach Clean project, and is not organised by the Party. Come along and join us to support them. We will be having coffee in the cafe afterwards. Meet 9.30am at The Beach. To attend with other Green Party members, please contact Sarah. Thursday 2 May. Don’t forget to vote for Jonathan Kent for Police and Crime Commissioner! Thursday 2 May, 7pm. Going WILD about your GARDEN event in Arundel. One of our Green councillors, Steve McAuliffe, is one of the guest speakers at this free event organised by Greening Arundel. The talks aim to help Arundel residents learn how to attract, protect and nurture wildlife in their own gardens. More details here. Sunday 19 May. Action Day supporting Siân Berry’s campaign in Brighton. A group of local party members will be travelling to Brighton by train, and we’d love you to join us. This will be a great opportunity to meet more Green supporters from across the south east. Please get in touch if you’d like to come with us. If you can, please plan your journeys on public transport. If you are able to offer / require a lift share to any of the events, please contact the relevant organiser. Next branch meeting: Wednesday 1 May, 7pm on Zoom. Click here to RSVP Can we help you? Want to join us? Have skills to share? Keep in touch with your local Chichester and Arun Greens Join the party: join.greenparty.org.uk Ask a question: contact@chichesterarun.greenparty.org.uk Keep up to date: Find us on Facebook, You Tube, TikTok and X (formerly Twitter) Help us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. If you can help out, please click here or follow the QR code. All support is very gratefully received. Please include your last name and postcode as a reference, so we know who to thank. A big thank you to everyone that has worked so hard over the last month on all Green causes! We look forward to seeing you soon |",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_people/content_37.html": "Local Councillors\nCllr Mel Penycate\nArundel & Walberton (Arun District)\nLiterature Coordinator\nCllr Sarah Sharp\nChichester South (County, District)\nCllr Paul Ayling\nBarnham (Arun District Council)\nCllr Sue Wallsgrove\nBarnham (Arun District Council)\nCllr Steve McAuliffe\nArundel & Walberton (Arun District)\nCllr Tim Young\nChichester South (District)\nCllr Carol Birch\nArundel & Walberton (Arun District Council)\nElection Agent (Arun)\nCllr Anita Lawrence\nBarnham (Arun District Council)\nLocal Officers\nFaye Mackenzie\nSocial Media Officer Arun\nDuncan Lambe\nTreasurer\nGeorgie Armour Glasius\nPress Officer\nCate Matters\nPublicity Officer\nPhilip Maber\nGeneral Communications\nSarah Kirk-BrownE\nMembership Secretary\nMark Record\nElection Agent (Chichester)\nArun Councillors\nElection Officer (Arun)\nAnn stewart\nSecretary\nDistrict & Chichester Coordinator (acting) & Election Officer Chichester (Acting)\nAdrian Morris\nWebsite Officer\nSam Proudlock\nFundraising Officer (Acting)\nLilias CHeyne\nArun Coordinator\nWe are also looking for further help from volunteers in the following roles:\nFundraising Officer\nEvents Coordinator\nIf you are interested please contact contact@chichesterarun.greenparty.org.uk",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_georgiearmourglasius_page_2/content_94.html": "8 June 2023 / 12 June 2023 by Georgie Armour\nRead more »\n25 May 2023 / 25 May 2023 by Georgie Armour\n11 May 2023 by Georgie Armour\n11 May 2023 / 11 May 2023 by Georgie Armour\n15 April 2023 by Georgie Armour\n25 March 2023 / 10 April 2023 by Georgie Armour\n15 March 2023 / 15 March 2023 by Georgie Armour\nTake an afternoon stroll around the Whyke area of Chichester this Saturday 18 March, 2023 and you may notice it’s a little bit tidier. That’s because Saturday morning between 10.30am and 12.30pm local residents will be out in force for a community litter pick around the Whyke area. Everyone is welcome and hot drinks and […]\n13 March 2023 / 13 March 2023 by Georgie Armour\n15 February 2023 / 13 March 2023 by Georgie Armour\nZack Polanski, Deputy Leader of the Green Party of England and Wales, spoke to a packed room in Arundel last Monday night, as he addressed many issues dear to local residents, such as road building and inappropriate housing developments. He also spoke passionately about the concern shared by many – and certainly judging by the […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_news/content_4.html": "April 2025 Newsletter 27 April 2025 / 27 April 2025 by adrianmorris Welcome to our April 2025 newsletter! Your local Green team has been busy campaigning in two upcoming by-election areas over the last few weeks: 24 April – Marine ward (Bognor Regis) for Arun District Council. Green candidate: John Erskine. 1 May – Midhurst (Chichester) for Chichester District Council and West Sussex County Council. Green candidates: […] Read more »\nCHICHESTER GREEN news Winter 2024/2025 : ISSUE 14 16 March 2025 / 16 March 2025 by adrianmorris Read more »\nHelp us build the next generation of leadership 5 March 2025 / 5 March 2025 by adrianmorris Later this week, 30 young activists will be coming together for the Young Greens flagship training programme, 30 Under 30. This programme is essential for equipping the next generation of Green leaders with the skills and knowledge needed to organise in their communities and lead the way for real change. But it can only happen […] Read more »\nGreen Party demands ambitious action in wake of Climate Change Committee report 5 March 2025 / 5 March 2025 by adrianmorris As the Climate Change Committee publishes its 7th carbon budget [1], the co-leader of the Green Party, Adrian Ramsay MP, has demanded the Government ensure ambitious climate action isn’t delayed any further – and for polluters to pay the highest price, not the poorest in our communities. Adrian Ramsay MP said: “Today’s advice from the Climate […] Read more »\nParliamentarians urged PM to show “basic humanity” for Gazans after he said he would close a “loophole” 21 February 2025 / 21 February 2025 by adrianmorris More than 30 parliamentarians urged Prime Minister Keir Starmer to show “basic humanity” for Gazans after he said he would close a “loophole” That allowed a Palestinian family to remain in Britain, says the Morning Star. The letter was signed by Labour, independent, Green and Lib Dem MPs, including former Labour leader Jeremy Corbyn and […] Read more »\nFebruary 2025 Newsletter 21 February 2025 / 21 February 2025 by adrianmorris Welcome to our February 2025 newsletter Greens win extra protections for Arun waterways On 30 January, the Environment Committee of Arun district council (chaired by Green councillor Sue Wallsgrove), passed a motion to explore ways to improve river health, water quality and biodiversity. This motion was originally introduced to the council by Green councillor Steve […] Read more »\nDevolution / Reorganisation 10 February 2025 / 10 February 2025 by adrianmorris Labour look set to push ahead with their version of devolution. There are threats and opportunities forGreens. This briefing provides some Green principles as apply to devolution, and provides some waysfor us to respond. It is our role to both work to shift the plans as they emerge – promoting a better way to genuinelydevolve […] Read more »\nEllie Chowns grills Ed Miliband over airport expansion 29 January 2025 / 29 January 2025 by adrianmorris The Independent reports on Ellie Chowns’ grilling of Ed Miliband over airport expansion at the Environmental Audit Committee yesterday. Ellie asked the energy and climate change secretary: “Would you agree that major infrastructure investment decisions or permission decisions such as, for example, airport expansion should not be taken before we get the forthcoming advice this […] Read more »\nJanuary 2025 Newsletter 26 January 2025 by adrianmorris Welcome to our January 2025 newsletter Changes planned for local democracy In December, the government published a ‘devolution’ white paper, which would see sweeping changes to how local democracy is organised. These include abolishing district councils (e.g. Arun and Chichester), to be replaced by one much larger authority. Is it happening here? West Sussex County […] Read more »\nNo Excuse for Delaying Elections 18 January 2025 / 18 January 2025 by adrianmorris Green MP Siân Berry said expense “should never be used as an excuse” to delay democracy during a debate on local government re-organisation on ITV Meridian. Sian added: “There is a good argument for a devolution of powers down to a local level but this reorganisation will put a lot of powers higher up – […] Read more »",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk/content_1.html": "Your local Green Party for all of Chichester & Arun.\nHere in Chichester & Arun, we have one County Councillor and five District Councillors as well as representation on Chichester City Council and on Parish Councils around the local area. Our Green Councillors add a much needed voice to the Council chamber to address the critical issues that the older parties are not even discussing.\nWe’re working progressively on local issues; to improve the lives of all people in Chichester & Arun, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Chichester & Arun.\nEach month, local Green Party members meet for an informal online chat, related to Green Party policy. You are invited to join us for the next discussion:\nAldingbourne Wildlife\nPlease join us on Thursday, May 1st in Felpham for a talk by local experts from the West Sussex Rivers Trust, and local wildlife and foraging expert, Gillian Edom. Also take this opportunity to meet the representative from Final Straw. Please share. Thanks. Look forward to seeing you.\nWelcome to our April 2025 newsletter! Your local Green team has been busy campaigning in two upcoming by-election areas over the last few weeks: 24 April – Marine ward (Bognor Regis) for Arun District Council. Green candidate: John Erskine. 1 May – Midhurst (Chichester) for Chichester District Council and West Sussex County Council. Green candidates:… Read more: April 2025 Newsletter\nLater this week, 30 young activists will be coming together for the Young Greens flagship training programme, 30 Under 30. This programme is essential for equipping the next generation of Green leaders with the skills and knowledge needed to organise in their communities and lead the way for real change. But it can only happen… Read more: Help us build the next generation of leadership\nAs the Climate Change Committee publishes its 7th carbon budget [1], the co-leader of the Green Party, Adrian Ramsay MP, has demanded the Government ensure ambitious climate action isn’t delayed any further – and for polluters to pay the highest price, not the poorest in our communities. Adrian Ramsay MP said: “Today’s advice from the Climate… Read more: Green Party demands ambitious action in wake of Climate Change Committee report",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_04_27_barnham-green-talk/content_76.html": "Chichester and Arun Green Party held a series of talks and discussions at Barnham community hall on the evening of the 19th April including Jonathan Kent our Green Party Sussex Police and Crime Commissioner candidate.\nJonathan Kent began with a talk explaining why he is standing as a candidate to become the Sussex Police and Crime Commissioner. He described the kind of policing he believes the county deserves.\nJonathan’s talk is available to view on the embedded YouTube video shown below.\nSue Wallsgrove, Paul Ayling, and Anita Lawrence are the Green councillors representing Barnham area. They held a discussion with the residents covering community concerns over sewage, flooding, the deluge of new housing development and anti social behaviour. Astronomer John Mason (who is not politically aligned) gave a good account of the problems of local flooding and explained the long term causes of these issues.\nThe discussion chaired by Sue Wallsgrove is available to view on the embedded YouTube video shown below.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_about-us/content_11.html": "About Us\nThe Green Party is growing fast. We now represent people in Westminster and in a record number of local councils, as well as in the London Assembly.\nHere in Chichester & Arun, we have one County Councillor and five District Councillors as well as representation on Chichester City Council and on Parish Councils around the local area. Our Green Councillors add a much needed voice to the Council chamber to address the critical issues that the older parties are not even discussing.\nWe’re working progressively on local issues; to improve the lives of all people in Chichester & Arun, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Chichester & Arun.\nThe Green Party Political Programme sets out what Greens are in politics to do: to end the system that keeps hurting the environment and all of us who rely on it – and to build a better alternative.\nThis Programme isn’t like other parties’ manifestos, it has not been squeezed through focus groups and stripped down according to the latest polling. Instead it has been built from policies proposed and voted on by our members, looking to secure the long term future of the places and people they love.\nIt’s a vision of a better world, and together we can deliver it.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_11_03_agm-pesticides-action-network-talk/content_74.html": "The Chichester & Arun Green Party 2023 AGM will be held at Murrells Hall, Barnham Community Centre on Thursday 16 November.\nThe formal business of the AGM (for members only) will take place from 6.30pm to 7pm. This will include voting in our new officers for 2023/24. Could you share some of your skills with the local party? Please consider standing for a role. Members are entitled to one vote on each of the motions and proposals put forward. If you have a motion you would like to table, please contact Deborah by 7th November.\nFrom 7pm, all other guests are welcome to join us for a talk from an expert speaker and the hustings for our two parliamentary candidates.\nFirst up Josie Cohen from Pesticide Action Network will be discussing the egregious and pernicious effects of pesticides on our soils, rivers, seas, wildlife, crops and health. Josie’s talk and a Q&A will run from around 7.15pm – 8.15pm.\nFrom 8.30pm, we will hold a hustings with the nominees to be our local MP candidates for Chichester, and Bognor Regis & Littlehampton. There will be an opportunity to ask questions on the night, but if you would like to send something in advance, please contact Deborah.\nTea, coffee and refreshments will be available by donation. Plus plenty of time to meet and chat with other local Greens. Come and help us celebrate a successful year, and make even bigger plans for the year ahead.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_02_08_deputy-leader-of-the-green-party-to-visit-arundel-next-week/content_44.html": "Zack Polanski, Deputy Leader of the Green Party of England and Wales, will visit Arundel next week, demonstrating the confidence the Party has in widening its base further in the May elections. Polanski’s visit to Arun comes after the success of the Greens locally (Greens won both recent by-elections).\nOn Monday 13 February, in a talk and Q&A at Arundel Museum from 7.00-8.15pm, Polanski will discuss how together we can create an ethical shift away from politics as usual. He will speak on key issues such as the democratic deficit, as well as what the sustainability of jobs, infrastructure and wellbeing really means, and how Greens aim to make that happen. (This is a free event but tickets are limited so those interested in attending should register promptly to avoid disappointment. So Register Now!)\n“I’m very much looking forward to visiting Arundel on Monday 13 February,” said Polanski, announcing the event on Twitter. “We’ll be discussing all things Green and celebrating two recent by-election successes for the Chichester and Arun Green Party!”\nArun Councillor and leader of the Green group, Isabel Thurston said, “I am delighted to be welcoming Zack to Arundel. He is an inspiring figure, showing how Green politics works. I hope lots of local people who are interested will come along and find out about what sort of change we can make with more Green councillors.”\nThe tour of constituencies where the Greens are confident of winning in May continues on Tuesday 14 February when Polanski will visit Goring (Worthing) – a key target ward in which the Greens came second in the last elections – where he’ll join candidate Claire Hunt to talk to local residents. A lunchtime event will see him give a talk in Bramber, Steyning (Horsham) to promote the Horsham campaign.\nPolanski has been Deputy Leader of the Green Party of England and Wales since September 2022. He is a London Assembly Member and chairs London’s Environment Committee. Polanski has campaigned for years on Proportional Representation and is working on a Universal Basic Income pilot.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_08_16_a-response-to-far-right-political-violence/content_23.html": "Like so many in our beloved country we have been appalled to see the recent outburst of far-right racist and political violence in towns and cities all over England. The attacks on mosques and hotels accommodating asylum seekers have been especially shocking. For a good summary of how the political violence developed in the aftermath of the devastating murder of three little girls (Beebee King, Alice Dasilva Aguiar and Elsie Dot Stancombe) in Southport please click here. In response, local Green Party branches released Unity Statements to express our disgust at the violence and misinformation and to express solidarity with the communities affected. You can read our branch’s Unity Statement below.\nWe were also disturbed at Elon Musk’s contribution to the misinformation and his provocative tweets which could arguably have contributed to the unrest playing out on the streets of the UK. Because of this alarming behaviour we will soon be deleting our X account and have taken the executive decision to move to Meta’s Threads platform. We have released the following post on our current social media channels:\nYou can support us by following us on Threads: https://www.threads.net/@chi_and_arungreenparty\nIf the events of the last few weeks have one redeeming feature it is the surge in numbers of people who have come out to counter protest against the far-right and to protect their communities from racist violence. Stand up to Racism and other grass roots anti-racism and community groups have done an outstanding job in mobilising and coordinating thousands of people to oppose the far-right and send a message of love and inclusion to groups who have been targeted and put at risk. Greens have, of course, been involved and taken part in the pro-immigration and pro-refugee counter demonstrations all over the country. You can read more about how Chichester and Arun Green Party have supported Stand up to Racism and Chichester Welcomes Refugees here. You can see some of the footage of the pro-refugee counter-demonstrations from across the south on our glorious.greens TikTok channel: https://vm.tiktok.com/ZGecq3B6u/ and why not give us a like and a follow while your there? If you are a Green Party member you can access our policy statement on Racism on the member’s site here. For non-members you can read our stances on racism below:\n- Racism is unacceptable and should be opposed in all of its forms and in all areas of society. Any society based on racism is abhorrent, and unacceptable even if presented as ecologically sustainable.\n- Racism can only be tackled effectively through local scale community-based and community-led initiatives to tackle racism’s social and economic causes and to increase awareness of the value of diverse cultures.\n- The UK Government must take a lead in tackling racism by implementing non-discriminatory immigration, nationality and criminal justice policies and ensuring that anti-discrimination measures in employment and the provision of services are effective.\n- The Green Party will not mount joint campaigns or policy initiatives on any issues with groups who endorse racial, ethnic or national hatred.\n- Speakers and Officers of The Green Party will only share platforms with groups who endorse racial, ethnic or national hatred at a public or private meeting where that offers an opportunity to confront and oppose racism.\n- Investigation, prosecution and sentencing practices by public bodies in relation to incidents of racial harassment must be effective and be seen by the victims of racially motivated crimes to be effective. Where racial motivation in committing a crime is shown, particular care should be taken to ensure that the sentence given to the offender involves sufficient protection from further racially motivated crimes to the victims and to the community.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_adrianmorris/content_13.html": "27 April 2025 / 27 April 2025 by adrianmorris\nWelcome to our April 2025 newsletter! Your local Green team has been busy campaigning in two upcoming by-election areas over the last few weeks: 24 April – Marine ward (Bognor Regis) for Arun District Council. Green candidate: John Erskine. 1 May – Midhurst (Chichester) for Chichester District Council and West Sussex County Council. Green candidates: […]\nRead more »\n16 March 2025 / 16 March 2025 by adrianmorris\n5 March 2025 / 5 March 2025 by adrianmorris\nLater this week, 30 young activists will be coming together for the Young Greens flagship training programme, 30 Under 30. This programme is essential for equipping the next generation of Green leaders with the skills and knowledge needed to organise in their communities and lead the way for real change. But it can only happen […]\nAs the Climate Change Committee publishes its 7th carbon budget [1], the co-leader of the Green Party, Adrian Ramsay MP, has demanded the Government ensure ambitious climate action isn’t delayed any further – and for polluters to pay the highest price, not the poorest in our communities. Adrian Ramsay MP said: “Today’s advice from the Climate […]\n21 February 2025 / 21 February 2025 by adrianmorris\nMore than 30 parliamentarians urged Prime Minister Keir Starmer to show “basic humanity” for Gazans after he said he would close a “loophole” That allowed a Palestinian family to remain in Britain, says the Morning Star. The letter was signed by Labour, independent, Green and Lib Dem MPs, including former Labour leader Jeremy Corbyn and […]\nWelcome to our February 2025 newsletter Greens win extra protections for Arun waterways On 30 January, the Environment Committee of Arun district council (chaired by Green councillor Sue Wallsgrove), passed a motion to explore ways to improve river health, water quality and biodiversity. This motion was originally introduced to the council by Green councillor Steve […]\n10 February 2025 / 10 February 2025 by adrianmorris\nLabour look set to push ahead with their version of devolution. There are threats and opportunities forGreens. This briefing provides some Green principles as apply to devolution, and provides some waysfor us to respond. It is our role to both work to shift the plans as they emerge – promoting a better way to genuinelydevolve […]\n29 January 2025 / 29 January 2025 by adrianmorris\nThe Independent reports on Ellie Chowns’ grilling of Ed Miliband over airport expansion at the Environmental Audit Committee yesterday. Ellie asked the energy and climate change secretary: “Would you agree that major infrastructure investment decisions or permission decisions such as, for example, airport expansion should not be taken before we get the forthcoming advice this […]\n26 January 2025 by adrianmorris\nWelcome to our January 2025 newsletter Changes planned for local democracy In December, the government published a ‘devolution’ white paper, which would see sweeping changes to how local democracy is organised. These include abolishing district councils (e.g. Arun and Chichester), to be replaced by one much larger authority. Is it happening here? West Sussex County […]\n18 January 2025 / 18 January 2025 by adrianmorris\nGreen MP Siân Berry said expense “should never be used as an excuse” to delay democracy during a debate on local government re-organisation on ITV Meridian. Sian added: “There is a good argument for a devolution of powers down to a local level but this reorganisation will put a lot of powers higher up – […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_tag_video/content_70.html": "Watch the Biodiversity Net Gain (BNG) talks 4 February 2024 / 7 February 2024 by Mark Record Biodiversity Net Gain (BNG), Nature Opportunity or Planning Fig Leaf? Watch or listen to the Jan 24th 2024 talks on BNG held at the Friends Meeting House, Priory Road to find out what impact this new planning legislation will have. National housing targets are leading to urban development expanding deeper into the countryside. Government says […] Read more » FMH Talk Video",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2022_09_28_a-safer-smoother-smarter-a27/content_47.html": "The Chichester & Arun Green Party is encouraging local residents to join it in demanding the transformation of the A27 around Chichester into a safer, smoother, smarter road. This could involve investigating the use of traffic lights at the roundabouts, managing speed and introducing smart technologies that are proven to reduce congestion by a more efficient use of road space. The aim is to safeguard existing and future residents from noise and pollution, and to reduce crashes resulting in injuries and death.\nSarah Sharp - County, District and City Councillor for Chichester South – who has compiled a detailed report on the options says:\n“The speed on the A27 has long been of concern to residents. The speed limit is currently set at 70mph but there are five junctions to negotiate around the city. I believe a speed limit reduction from 70mph to 50mph would smooth the flow of traffic, and improve quality of life for residents while not delaying motorists. Counterintuitively, such limits don’t add substantially to the end-to-end travel time precisely because the traffic flows more smoothly.”\nThis kind of traffic-smoothing approach is already in operation on trunk roads around UK cities with geography not dissimilar to Chichester, such as Salisbury, Guildford and Bristol. Faster limits are set in the countryside on either side of the city, and lower ones for a short stretch skirting the city. Driving at slower speeds (at or near the engine’s optimal design speed) and driving more smoothly – instead of stop start – reduces fuel consumption and pollution, beneficial in light of the cost-of-living and climate crises.\nCllr Sharp has launched a petition calling on the A27 National Highways team to carry out a full viability study into a smooth speed limit around Chichester (limiting speed dependent on traffic conditions and avoiding excessive speeds). Residents can sign the petition here: https://actionnetwork.org/petitions/chichester-a27-a-safer-smoother-smarter-road\nRevising speed limits would certainly address problems surrounding the new exit from the Shopwyke Lakes development, which is proving to be a particular concern to residents, as Cllr Sharp explains:\n“This exit serves not only the new residents but also the residents of Oving Parish as their main access to Chichester. As councillors have been made aware, it is proving to be a tricky junction to manoeuvre through, particularly for vehicles that need to cross lanes in a very short distance. Currently drivers joining the A27 here are often forced by other traffic to make their manoeuvre at high speed. Reducing the speed here would reduce the safety risks involved.”\nCllr Sharp acknowledges the frustration of drivers stuck in traffic that might be opposed to the idea but concluded: “Traffic lights that can manage flows with the help of AI can help to smooth the traffic and help to move more vehicles through junctions more safely and reduce waiting times and queues. We are asking National Highways to look into this and run a feasibility study to provide residents with more evidence of whether this concept would make things better and actually cut back on time wasted in queues.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_02_21_parliamentarians-urged-pm-to-show-basic-humanity-for-gazans-after-he-said-he-would-close-a-loophole/content_6.html": "More than 30 parliamentarians urged Prime Minister Keir Starmer to show “basic humanity” for Gazans after he said he would close a “loophole”\nThat allowed a Palestinian family to remain in Britain, says the Morning Star. The letter was signed by Labour, independent, Green and Lib Dem MPs, including former Labour leader Jeremy Corbyn and Green Party co-leader Carla Denyer. It said: “The family in question is a mother, father and their four children aged 18,17, eight and seven who were displaced from their home in Gaza in September when it was destroyed by an Israeli air strike. As you know, there is still no resettlement route for Palestinian fleeing the bloodshed, starvation and bombardment that has devastated Gaza for over 15 months.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_09_15_taking-legal-action-for-the-environment/content_77.html": "How worried are you about government policies? Policies on climate change, air quality, water quality, sewage discharges, housing policies, road building, airport expansion, walking and cycling… the list goes on.\nHow can we get government policies changed?\nFor some it is to protest, others sign petitions, some work locally to at least get some local change, but at some point we often start to wonder if we should challenge in the courts. But how difficult might this be, how expensive, how do you get a legal team together, and how scary is it?\nThe Chichester and Arun Green Party has invited three speakers to talk to us about legal actions opposing oil and gas drilling: Sarah Finch, Sue Taylor and Lorraine Inglis. Please see below for their short biographies. Everyone is welcome to join us, to discuss these issues and hear more about our speakers’ experiences with the legal system.\nThe event will take place on Tuesday 26 September 2023 at the Friends Meeting House on Priory Road in Chichester at 7pm and the guest speakers are:\nSarah FinchIn 2019 Sarah challenged Surrey County Council (SCC), on behalf of the Weald Action Group on their decision to allow the drilling of four oil wells at Horse hill, near Gatwick airport, shortly after they had declared a climate emergency. Her main case was that the emissions from burning any of the oil extracted were not considered when the planning was granted. If she won the case, it would have huge implications for all drilling and mining applications in the country.\nSarah’s case went to the High Court in 2020 but the decision went against her. Her case went to the Appeal Court in 2021, where one of the three judges agreed with her case. In June this year her case was heard in the Supreme Court. The judgement will be issues later this year. Find out more.\nSue TaylorSue is a founder member of the Frack Free Balcombe Residents Association (FFBRA). Balcombe hit the headlines in 2013 because of the anti-fracking protests there and the huge police pushback. The FFBRA challenge to the planning permission in 2014 failed.\nHowever, in 2021 West Sussex County Council voted unanimously to reject a planning application for a new well test at Balcombe. The oil company, Angus Energy, appealed and earlier this year the communities secretary, Michael Gove, overruled this council decision. In July this year a statutory review of this decision was heard in the Royal courts of Justice.\nLorraine InglisLorraine is the co-founder of Weald Action Group, an umbrella group of anti-drilling groups in the South of England.\nLorraine has been a driving force in supporting legal campaigns. As well as the current legal cases she was central to the legal challenge to the UK Oil and Gas (UKOG) injunctions against “Persons Unknown”. This would have effectively made protest at oil and gas sites a contempt of court offence for anyone and everyone who attended or even publicised a protest. Contempt of court convictions can result in large fines and even prison sentences. Three Sussex sites, Balcombe, Broadford Bridge and Markwells Wood were included in this injunction. This legal challenge resulted in significant reductions in the scope of the injunctions.Lorraine has developed a considerable expertise, both in the legal challenges and liaising with law firms, as well as fund raising and generally keeping “the wagon on the road”. She is a Steering Committee member of Netpol (The Network for Police Monitoring) and has been the lead coordinator in Frack Free Sussex, Frack Free Surrey and Frack Off London.\nCome and join us on Tuesday 26 September, 7pm at the Friends Meeting House, Priory Road, Chichester, PO19 1NX. Registration is free but we would ask for a small donation to help cover the costs for this event. Click here to reserve a spot.\nIf you can, please plan your journey on public transport. You can contact Ann on arunchigreen@gmail.com if you are able to offer, or would like to request, a lift share. We look forward to seeing you there.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_news_page_5/content_26.html": "West Sussex hydrocarbons policy requires review 25 May 2023 / 25 May 2023 by Georgie Armour Read more »\nWhyke Area Community Litter Pick 15 March 2023 / 15 March 2023 by Georgie Armour Take an afternoon stroll around the Whyke area of Chichester this Saturday 18 March, 2023 and you may notice it’s a little bit tidier. That’s because Saturday morning between 10.30am and 12.30pm local residents will be out in force for a community litter pick around the Whyke area. Everyone is welcome and hot drinks and […] Read more »",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_12_10_protecting-people-and-plants-from-pesticides/content_49.html": "At the Chichester & Arun Green Party 2023 AGM on Thursday 16 November Josie Cohen from Pesticide Action Network gave an excellent talk on the egregious and pernicious effects of pesticides on our soils, rivers, seas, wildlife, crops and health. Those who missed it can watch Josie’s talk and a Q&A below.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_events/content_8.html": "Each month, local Green Party members meet for an informal online chat, related to Green Party policy. You are invited to join us for the next discussion:\nAldingbourne Wildlife\nPlease join us on Thursday, May 1st in Felpham for a talk by local experts from the West Sussex Rivers Trust, and local wildlife and foraging expert, Gillian Edom. Also take this opportunity to meet the representative from Final Straw. Please share. Thanks. Look forward to seeing you.\nOur next policy discussion meetings\n- Friday 21 March, 7pm-8.30pm: local rivers\n- Friday 18 April, 7pm-8.30pm: TBC\n- Friday 16 May, 7pm-8.30pm: TBC\n- Friday 20 June, 7pm-8.30pm: TBC\nSign up here\nhttps://actionnetwork.org/forms/online-policy-discussions-2025\nGreen Social Meet-ups and Littlehampton Beach Cleans\nLocal Green Party members will be joining the Littlehampton monthly beach clean on:\n- Sunday 27 April\n- Sunday 25 May\n- Sunday 29 June\nEveryone is welcome to join the Beach Cafe for a stroll along the beach, picking up some litter along the way. The Beach Cafe will supply gloves, litter pickers and bags – they would just love a few extra hands to keep our coast looking beautiful.\nMeet at 9.30am to join the beach clean.\nand / or\nMeet at 11.00am, for a coffee in the Beach Cafe afterwards.\nThis is a great chance to meet other local members in a friendly and relaxed setting. The cafe can get busy, so please do let us know you’re coming! If you have any questions, please contact Sarah.\nThe address for the Cafe is: Sea Road, Littlehampton, BN16 2NA. Please note it is the cafe opposite the Wave leisure centre, not the one on East Beach Green! If you can, please plan your journey on public transport.\nVolunteering for the Local Party\nPlease also sign up here if you’re interested in getting more involved with local volunteering.\nThanks for your interest and support – we look forward to seeing you soon!\nChichester & Arun Green Party Branch Meetings\nGreen Party members will be meeting to discuss the latest news and actions in the local area on:\n- Tuesday 8 April, 7pm – 8pm\n- Wednesday 14 May, 7pm – 8pm\n- Monday 9 June, 7pm – 8pm\n- Tuesday 8 July, 7pm – 8pm\nThese events will be held online, and all members will receive the Zoom link to join by email.\nIf you have any questions, or any items you would like to add to the agenda, please contact Ann in advance of the next meeting: contact@chichesterarun.greenparty.org.uk",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_05_11_greens-hold-chichester-south/content_73.html": "Sarah Sharp with 1287 votes and elected\nTim Young with 943 votes – more votes than the Tories, Labour and Lib Dems combined! (C 266, L 281, LD 303.)\nSarah Sharp said: “Thank you to everyone in Chichester South who voted yesterday and supported Tim and myself. We are now your District Councillors and will work hard to represent everyone in the area, whoever you voted for. And thank you to our team who worked so hard on our behalf.\n“Our overwhelming lead shows that people in Chichester South have put their trust in the Green Party – they know we do politics differently and put local people and our environment first. They know how hard we work and that we will give our all to address the issues that matter most to our residents.”\nWhile many are positive about the change of control at Chichester District Council having a strong opposition will be more important than ever. The Liberal Democrats have had very fine words to say on environmental issues in their campaign promises, so your Green councillors will remind them of those if, or some may say when, they follow in their predecessors’ footsteps and prioritise development over our local environment. We will have a close eye on whether they support the bulldozing of the countryside for car-dependent housing developments and new roads that will only encourage more traffic instead of prioritising safe walking and cycling routes. This is why it is so essential there is a strong Green voice on the council. We may be in the minority, but Green councillors play a crucial role in influencing decisions made at a local level when it comes to climate and the environment. We know these are central issues which are fast rising up residents’ lists of concerns and we will ensure those concerns are heard loud and clear.\nThank you to every voter and campaigner who helped get Sarah and Tim elected in Chichester South. They will work tirelessly for a fairer, greener community in Chichester.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_donate/content_2.html": "Please donate to Chichester & Arun Green Party\nHelp us make a difference in upcoming by-elections\nChichester & Arun Green Party have had considerable success in the local council elections, and at the General Election we increased our vote share in Arundel & South Downs to 10.1%. We are now looking to build on this success in upcoming by-elections, including to Bognor Town council, but we need your help to elect more councillors to fight for a green agenda and continue making Chichester & Arun a fairer, greener society.\nPlease scan the QR code or use the link below and donate as much as you can afford, You will have the option to set up a regular payment or a one off payment. Your donations will directly help us work towards a sustainable, greener and fairer Chichester & Arun. Thank you in advance for your support.\nhttps://givealittle.co/c/2s0K54nCd3yzqge67x6ki4\nOR donate by card payment via Stripe\nOr Make a bank transfer or standing order\nThe details provided here allow you to make a donation by bank transfer to your local Green Party at Chichester and Arun.\nA one off payment or regular standing order helps cover the cost of our local campaigns.\nOur bank details are:\nAccount name: Chichester & Bognor Green Party\nSort Code: 08-92-99\nAccount: 65428407\nPlease use your last name and postcode as a reference so we know who to thank.\nDonations above £500\nUnder the Political Party Elections and Referendums Act 2000 (PPERA) you must be on the electoral register in the UK ‘excluding the Channel Islands and the Isle of Man’ in order to make a donation of more than £500.\nBecause we’re a political party we’re required to run electoral register checks for making donations above £500, and if you donate over £1,500 during a year, we are required to let the Electoral Commission know, who will make this available on their website. All donations go to Chichester & Arun Green Party.\nData Protection Act. The information you supply us with will be treated by Chichester & Arun Green Party in the strictest confidence, in accordance with the Data Protection Act 1998 and will not be passed on to any third parties.\nPublished and promoted by Duncan Lambe (Treasurer), on behalf of Chichester and Arun Green Party, The Pump House, Stanstead Park PO9 6DZ",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_03_16_chichester-green-news-winter-2024-2025-issue-14/content_14.html": "Skip to content\nSkip to footer\nChichester & Arun\nMenu\nNews\nEvents\nPeople\nAbout us\nVideos\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nCHICHESTER GREEN news Winter 2024/2025 : ISSUE 14\nCHICHESTER GREEN news Winter 2024/2025 : ISSUE 14\n16 March 2025\n/\n16 March 2025\nby\nadrianmorris\nCounty newsletter 2025\nDownload\nTo top",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_04_05_our-work-with-chichester-welcomes-refugees/content_88.html": "For the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the hotel for this purpose. At that time, misinformation circulated in leaflets and local Facebook groups claimed that the hotel would be housing 300 male economic migrants. A large group of people protesting the housing of asylum seekers in the hotel grew outside the hotel in response to the misinformation. Chichester District Council released its own statement and FAQ regarding the hotel in an attempt to educate locals about the repurposing of the hotel. Chichester Cathedral also released a statement in support of the refugees. A large group of pro-refugee counter protestors, led by Stand Up to Racism Portsmouth also developed to peacefully counter the anti-refugee protestors. Members of Chichester and Arun Green Party were very happy to be part of this group which also included activists from many trade unions, Chichester Quakers, Transition Chichester, Sanctuary in Chichester, Littlehampton and Bognor Labour Party, Chichester vs. Oil and many others.\nThe organisations and people who came together to support the refugees, including members of Chichester and Arun Green Party, went on to form a non-partisan coalition called Chichester Welcomes Refugees who continue to support the asylum seekers and refugees in many ways including organising community events, obtaining essential donations and providing emotional support.\nCountering Hate\nAnti-refugee demonstrations outside the hotel have now largely stopped in response to the campaigning efforts of all members of Chichester Welcomes Refugees and their partners. Some members of Chichester Welcomes Refugees have been working very closely with Hope Not Hate, an organisation dedicated to countering the rise of the new far right in the UK. They have been monitoring the involvement of Patriotic Alternative in Chichester and their role in spreading misinformation and organising anti-refugee protests. Collectively we welcome the governments categorisation of Patriotic Alternative as an “extremist group” under the new terminology but are concerned that this term is largely rhetoric and would prefer the categorization of Patriotic Alternative as a proscribed group.\nShock at the Governments Treatment of Refugees and Asylum Seekers\nAs a local Green Party branch many of us have been shocked and horrified at this governments treatment of refugees and asylum seekers. We condemn the government’s inhumane segregation of asylum seekers into large segregated camps such as RAF Wethersfield, RAF Scampton and the Bibby Stockholm barge. We have joined in with our colleagues from Care4Calais and Stand Up To Racism to actively campaign against this form of asylum seeker accommodation which is widely reported as being inhumane and is proving to be damaging to the mental and physical health of the people housed within them. On 12th December 2023 this issue became a very real and public concern following the death of Leonard Farruku who died by suicide while being housed on the Bibby Stockholm barge. In response to this tragedy, local greens with members of Chichester Welcomes Refugees, The Red Rebels and other partner organisations held a vigil at The Cross in Chichester city centre to show solidarity with Leonard, his family and refugees who have tragically died while crossing the channel or whilst being housed in the UK asylum system while waiting for their asylum claim to be processed. When Leonard died the coroner in charge gave the UK government 6 weeks to produce a statement on Leonard’s death. To this date, no such statement has been released and Leonard’s family are getting ready to take legal action to force the government to launch an independent inquiry.\nFor more information on the Green Party of England and Wale’s policies on racism, migration, asylum and the Rwanda Plan please see the links below:",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_category_uncategorised/content_42.html": "27 April 2025 / 27 April 2025 by adrianmorris\nWelcome to our April 2025 newsletter! Your local Green team has been busy campaigning in two upcoming by-election areas over the last few weeks: 24 April – Marine ward (Bognor Regis) for Arun District Council. Green candidate: John Erskine. 1 May – Midhurst (Chichester) for Chichester District Council and West Sussex County Council. Green candidates: […]\nRead more »\n16 March 2025 / 16 March 2025 by adrianmorris\n5 March 2025 / 5 March 2025 by adrianmorris\nLater this week, 30 young activists will be coming together for the Young Greens flagship training programme, 30 Under 30. This programme is essential for equipping the next generation of Green leaders with the skills and knowledge needed to organise in their communities and lead the way for real change. But it can only happen […]\nAs the Climate Change Committee publishes its 7th carbon budget [1], the co-leader of the Green Party, Adrian Ramsay MP, has demanded the Government ensure ambitious climate action isn’t delayed any further – and for polluters to pay the highest price, not the poorest in our communities. Adrian Ramsay MP said: “Today’s advice from the Climate […]\n21 February 2025 / 21 February 2025 by adrianmorris\nMore than 30 parliamentarians urged Prime Minister Keir Starmer to show “basic humanity” for Gazans after he said he would close a “loophole” That allowed a Palestinian family to remain in Britain, says the Morning Star. The letter was signed by Labour, independent, Green and Lib Dem MPs, including former Labour leader Jeremy Corbyn and […]\nWelcome to our February 2025 newsletter Greens win extra protections for Arun waterways On 30 January, the Environment Committee of Arun district council (chaired by Green councillor Sue Wallsgrove), passed a motion to explore ways to improve river health, water quality and biodiversity. This motion was originally introduced to the council by Green councillor Steve […]\n10 February 2025 / 10 February 2025 by adrianmorris\nLabour look set to push ahead with their version of devolution. There are threats and opportunities forGreens. This briefing provides some Green principles as apply to devolution, and provides some waysfor us to respond. It is our role to both work to shift the plans as they emerge – promoting a better way to genuinelydevolve […]\n29 January 2025 / 29 January 2025 by adrianmorris\nThe Independent reports on Ellie Chowns’ grilling of Ed Miliband over airport expansion at the Environmental Audit Committee yesterday. Ellie asked the energy and climate change secretary: “Would you agree that major infrastructure investment decisions or permission decisions such as, for example, airport expansion should not be taken before we get the forthcoming advice this […]\n26 January 2025 by adrianmorris\nWelcome to our January 2025 newsletter Changes planned for local democracy In December, the government published a ‘devolution’ white paper, which would see sweeping changes to how local democracy is organised. These include abolishing district councils (e.g. Arun and Chichester), to be replaced by one much larger authority. Is it happening here? West Sussex County […]\n18 January 2025 / 18 January 2025 by adrianmorris\nGreen MP Siân Berry said expense “should never be used as an excuse” to delay democracy during a debate on local government re-organisation on ITV Meridian. Sian added: “There is a good argument for a devolution of powers down to a local level but this reorganisation will put a lot of powers higher up – […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2022_11_18_latest-grey-route-consultation/content_27.html": "National Highways has released the latest consultation documents on the controversial Grey Route, and the news for Fontwell and West Walberton is concerning local residents. National Highways own figures show Fontwell Village and Eastergate Lane in particular will experience rat-running, increased traffic flows on narrow roads and all of the associated air pollution this causes – not to mention the increased risk of dangerous collisions as cars weave through country lanes. Traffic on Arundel Road in Fontwell is projected to increase by 60%. The situation in Walberton is not much better with Eastergate Lane seeing a projected increase of 53%. These extra traffic figures will be felt on all the roads in the area including though Barnham. Barnham residents were told the by-pass would take traffic away, but it is now set to increase on already burdened main roads and the village high street.\nSteve McAuliffe, the Green Party candidate for the upcoming Arun District by-election says: “The latest National Highways consultation aims to outline how the design has been altered ‘to keep traffic on the A27 and reduce the impacts on The Street [in Walberton]’ but the plans fail impressively. The irony is astonishing: Introduction of measures to reduce traffic in the centre of Walberton has resulted in the conscious degradation of other parts of the Parish. This isn’t a solution to adverse Grey Route traffic impacts, it’s merely shifting the impacts around.”\nMcAuliffe is an environmental scientist who has used his expertise to assess the devastating ecological and environmental impact that will result from the proposed Grey Route. A significant impact is the damage to wildlife. The new plans attempt to mitigate for the rare bats known to live in the Fontwell area, but it is not possible to do this effectively and the bats face extinction. Yet in the emerging ecological studies for ADC’s Local Plan Review, this area would be given the highest protection due to the presence of the Bechstein bat colony.\nThe A27 Grey Route is a controversial choice of route with just 7% of consultation respondents supporting it. It is suspected (though up-to-date cost estimates have not been provided) that the cost of the project is now in the region of £1billion – a price tag grossly disproportionate for a best-case scenario journey time improvement of just six minutes.\n“And this six-minute saving estimate is spurious,” McAuliffe, a Fontwell resident explains. “When you consider that traffic will then sit in knock-on delays at the Fontwell roundabouts or have to wind its way through rat runs to avoid them.”\nAnother eye-catching update is that large sections of the proposal are now set to 50mph speed limits.\n“The need for a 70mph speed limit was given as a main reason for rejecting the Arundel Alternative or online improvements such as traffic flow smoothing,” says Cllr Isabel Thurston (Green, Barnham). “So it is infuriating that we’re now seeing 50mph speed limits. Surely this indicates alternative suggestions should be reviewed.”\nThe Chichester & Arun Green Party maintain that the whole project is an absurd response to traffic issues at Arundel. The suggested A27 options simply move traffic problems from Arundel to elsewhere in the area, and the continued prioritisation of new roads across the country threatens the UK’s climate targets.\nOther solutions can address the key bottle-necks and traffic volumes in Arundel but these are sadly not being considered. The party calls on National Highways to go back to the drawing board and look at online improvements. Any highway interventions need to focus on making improvements for efficient and affordable public transport, and active travel, not increasing expensive road capacity that drives up traffic and emissions.\nFurther information\nhttps://nationalhighways.co.uk/our-roads/south-east/a27-arundel-bypass/\nhttps://www.arundelbypass.co.uk/why-the-grey-route-is-not-good-value-for-money",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_06_07_analogue-landline-switch-off/content_84.html": "Green Party Parliamentary Candidate for Arundel & South Downs has raised concerns for vulnerable residents in rural communities after Ofcom and the UK government agreed to let BT switch off landline services leaving only broadband services available.\nSteve McAuliffe, Arun District Councillor, is leading calls for BT to engage with villages and vulnerable rural residents over the planned analogue switch off.\n“In many of our small villages and isolated homes across the Arundel & South Downs Constituency, the broadband signal isn’t currently reliable enough,” says McAuliffe. “Many residents across the constituency completely rely on landlines and do not have a mobile phone or a broadband connection. We’re leaving these people uncertain and concerned about how they will raise help in an emergency.”\nBT has told broadband providers that the landline network will end by December 2025. It is unclear what this means for customers in areas with poor signal. McAuliffe has spoken with affected residents in many villages and the overwhelming message has been that before any switch off is decided, BT need to recognise that the postcode system of determining which areas have good broadband, and therefore marked for switch off, is not a suitable and reliable method for many areas.\n“We are told that the broadband signal in the village is good,” one resident and Parish Councillor for the village of Slindon, Andrew Foakes, told McAuliffe. “But this is based on an assessment of the postcode. The postcode covering the village also covers areas 2 miles from here that do have good signal. Ours though, here in the village, is intermittent and patchy with some houses not having any broadband signal at all.”\nAccording to McAuliffe, a further problem is that many villages in the constituency do not have reliable electricity networks. Extended blackouts when trees fall on overhead supply cables are a regular occurance. So even in areas where there is a reasonable broadband connection, it won’t work when the electricity is out for longer than an hour.\n“We need BT to engage with affected villages and homes and explain how vulnerable people will be safeguarded and how those working from home will be able to run their businesses after 2025,” says McAuliffe. “So far, we haven’t even been able to contact a BT project manager to explain the issues with the postcode system and the exacerbating impacts of intermittent power cuts.”\nWhilst it is technically possible for people to convert properties so that they have back-up systems, conversion can be complicated and expensive so McAuliffe believes it is unfair that customers are expected to foot the bill and manage the complexity of converting their homes and businesses without financial support or technical help.\nMcAuliffe concludes: “This is not a reasonable way to treat people and I want BT managers to come to the affected villages to positively engage with the residents well before any homes are switched off and left unable to contact friends and loved ones should they need to.”\nMore about Steve\nGreen Party Parliamentary Candidate for Arundel & South Downs, Cllr Steve McAuliffe is an ex-British Army Air Corps soldier whose 20-year career in ecology and environmental management consultancy has spanned both industry and politics. He represents Arundel & Walberton on Arun District Council, is a board member of South Downs National Park, and recently completed his Masters, focusing on protected species legislation and anthropogenic impact mitigation. McAuliffe has a solid track record of delivering on campaign promises demonstrating hard work and an ability to get things done. A key campaign pledge at last May’s local elections was to prevent the development of an AirBnB ‘party house’ in River Road, Arundel. By September McAuliffe got the plan scrapped following significant work to discredit the financial basis of the project, the erroneous income predictions and unrealistically optimistic build costs.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_01_26_january-2025-newsletter/content_5.html": "Welcome to our January 2025 newsletter\nChanges planned for local democracy\nIn December, the government published a ‘devolution’ white paper, which would see sweeping changes to how local democracy is organised. These include abolishing district councils (e.g. Arun and Chichester), to be replaced by one much larger authority.\nIs it happening here? West Sussex County Council recently decided to volunteer our area for the fast-track version of these changes. This decision was made by the cabinet, not the full council.\nWhat does this mean locally? We’re still waiting to hear if the County Council elections scheduled for May this year will be postponed. If so, the Conservatives will cling to power locally for at least another year – and way past their mandate. We’re concerned that important decisions about the future shape and structure of our local government will then be led by an out of touch, unpopular council.\nBut is the reorganisation a good idea? Some parts of the White Paper look promising e.g. control over local transport and cycle lanes, and community rights to purchase local facilities. But there’s little detail at this stage, and we’re worried that changes will be rushed through without proper scrutiny and important public debate.\nDon’t the Greens support devolution? The Green party are strong supporters of local, grassroots action – as can be seen through our network of parish, district, town and county councillors across England. We stand for:\n- taking decisions as close as possible to the people most impacted;\n- trusting local communities to know what is best for them;\n- supporting them with investment to deliver real change;\n- and fair voting for local elections using proportional representation.\nBut these plans risk moving power away from local councils to huge remote super councils and regional mayors. And we want the May elections to go ahead as planned!\nWhat are Greens doing locally? We continue to encourage all our members and supporters to get involved in their local areas – whether this be parish councils or neighbourhood groups. So we’re still campaigning and getting the Green message out as enthusiastically as ever! We’d love you to join us, Adrian, please get in touch to help out:\nCome and meet other Greens on Littlehampton beach\nOn the last Sunday of every month, local members join the regular litter pick on Littlehampton beach. This is followed by a coffee and a chat in The Beach Cafe, Sea Road, Littlehampton (opposite The Wave leisure centre).\nTo join us on the beach clean, please meet at 9.30am by the Shack, where the grabbers, gloves and bags are all provided by the Cafe (as part of Surfers Against Sewage). A member of the Beach team usually leads the clean. Afterwards, we’ll be in the cafe, from around 11am.\nPlease note: We won’t be meeting if there is a weather warning in place!\nMembers updates\nEach month we hold an online policy discussion for members. It’s a chance to look at an important and topical area in more depth, in a relaxed and respectful setting. Our next topics are: solar power (21 February), and local rivers (21 March). You are welcome to join in our members’ discussion by registering here.\nOur next branch meeting will be on Wednesday 12 February, 7pm on Zoom. All members are welcome to join us, and non-members can also be admitted by prior arrangement. We look forward to seeing you there.\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok and Threads\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work.\nAll support is very gratefully received. Please always include your last name and postcode as a reference, so we know who to thank.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_01_02_greens-respond-to-ofwat-price-rise-green-light/content_56.html": "Skip to content\nSkip to footer\nChichester & Arun\nMenu\nNews\nEvents\nPeople\nAbout us\nVideos\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nGreens respond to Ofwat price rise green light\nGreens respond to Ofwat price rise green light\n2 January 2025\n/\n2 January 2025\nby\nadrianmorris\nGreens respond to Ofwat price rise green light\nTo top",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_04_05_district-election-2023-campaign-launch/content_31.html": "Today the Green Party officialy launched the campaign to #GetGreensElected in the upcoming elections on Thursday 4 May. In Arun, a total of 18 Greens will stand across 13 wards. Sue Wallsgrove and Steve McAuliffe will defend their seats in Barnham and Arundel & Walberton respectively. Joining them to contest all three available seats in each of those wards are Anita Lawrence, Paul Ayling, Carol Birch and Mel Penycate.\nCandidates standing in a further 11 wards are: Adam Bell (Aldwick East), Tony Coates (Aldwick West), Helen Justice (Angmering and Findon), Deborah O’Reilly (Courtwick with Toddington), Liz Hammond (East Preston), Linda Lancaster (Felpham West), Kerstin Sonnemann (Ferring), Liam Warren (Middleton), John Erskine and Paul Wyatt (Pevensey), Lilias Cheyne (River) and Faye Mackenzie-Faithful (Rustington West).\nLocal party spokesperson and Green Councillor for the past four years, Isabel Thurston, said: “I’m delighted to unveil our team of fantastic Green Party candidates ready to diligently represent communities across Arun in the elections on Thursday 4 May. It is crucial for more Greens to have seats at ADC, so that they can continue to stand up for social justice and environmental issues across the council’s work.”\nThe Green Party currently has 563 councillors on 172 principal authority councils in England and Wales. It will be defending 281 seats in this year’s local elections in May and will be looking to make further gains across the country.\nOne key area that affects everyone is the cost, quality and availability of housing. Arun Area Greens are calling for Arun District Council and the government to sign up to a new Right Homes, Right Place, Right Price Charter to beat the housing crisis and ensure green spaces are protected. Greens have already made a difference in Mid Suffolk where developers are now expected to provide EV points, not connect to the gas grid and provide heat pumps as standard.\nCarol Birch, social housing expert and Green candidate for Arundel & Walberton, said:\n“We need councils and national government to work together to deliver the homes people need and can afford to rent and buy. Residents in Barnham and Walberton in particular are facing the same problems as much of the rest of the country: developers being allowed to ride roughshod over the needs of communities and the environment in order to build houses local people often can’t afford to buy or rent and failing to ensure local services like buses and GP surgeries get the investment they need. Everyone deserves a place that they can call home. The Green Party’s Right Homes, Right Place, Right Price Charter would deliver the change we want to see across the housing sector and create fairer, greener communities.”\nThe Greens’ Right Homes, Right Place, Right Price Charter would:\n- End the housing crisis by creating enough affordable homes – including 100,000 new council homes a year built to the Passivhaus or equivalent standard\n- Empower local authorities to bring empty homes back into use\n- Transform the planning system to:\n- Incentivise renovation and improvement of existing buildings to reduce the environmental impact of new construction\n- Incentivise local authorities to spread small developments across their areas, where appropriate, rather than building huge new estates\n- Protect valuable green space for communities\n- Require new developments to be accompanied by the extra investment needed in local services, such as providing extra school and GP places and better bus services\n- Transform building regulations to ensure:\n- all new private and public sector housing meets Passivhaus or equivalent standards\n- house builders include solar panels and heat pumps on all new homes.\n- Ensure all new developments will be located and designed to ensure that residents do not need cars to live a full life\n- Introduce rent controls\n- End no-fault evictions",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2022_10_22_warm-spaces-in-bleak-times/content_40.html": "County, District and City Cllr Sarah Sharp (Green, Chichester South) is working with the Chichester Community Network to coordinate a selection of ‘Warm Spaces’ available to residents in need this winter.\nAmong others, Chichester Festival Theatre (CFT) is throwing open its doors Monday to Saturday from 10am til late, offering co-working desks, free WiFi, beanbags, books and toys, and a warm welcome to all in the community.\nCFT said: “Knowing the challenges that will be faced by many in our community over the coming Winter months, Chichester Festival Theatre is very happy to be offering our foyer as a Warm Space.”\nOther spaces include churches and libraries, for example, Chichester Library on Tower Street, where advice, support and internet access are also available as well as free activities – such as Rhyme time, Story Time, Knit and Natter.\nRevd Martha Weatherill, Rural Dean of Chichester said: “Churches in Chichester and the surrounding area are working in partnership with Chichester Churches Together to ensure that there are enough warm spaces for people to come together in the colder months. Churches across Chichester will be able to continue to offer hot food and activities and provide a much-needed service thereby making a big difference to people’s lives.”\nCllr Sharp expressed disappointment that the Chichester Community Network had to lead on this rather than local and national government but was delighted that such an extraordinary group of volunteers and organisations were pulling together to help vulnerable residents this winter.\nShe said: “Like many other parts of the country, people in and around Chichester are already relying on foodbanks and now have to face the cold this winter. The government are responsible for this cost of living crisis but it’s local people who are dealing with the fallout. There are some really good models of partnership working for example between Hunston Parish Council, the Church in Hunston and the community group that run the village hall and I think we can be really proud of these examples where the community is pulling together to counter social isolation as well as offering a warm welcome.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_09_16_september-2024-newsletter/content_43.html": "| Welcome to the September 2024 newsletter from your local Green Party. Thank you for being part of our positive campaign for Real Hope and Real Change. Green Talk – housing and planning A huge area of concern for all of us is the need for sustainable and appropriate planning developments. What is the current situation locally? What is your local Green Party’s position? And how can you get involved in the National Planning Policy Framework consultation? Please join us on Zoom, Friday 20 September at 7pm, to hear from our hard-working local councillors, and join in the discussion. Yes – I can join on Friday 20 September Local campaigning Over the coming months we’ll be getting our positive Green message out to as many people as possible. We’ll be listening to local concerns, providing feedback and support to our constituents, and encouraging new voters to consider Green. We’re already looking forward to the West Sussex County Council elections next year – where we expect to elect many more Green representatives! Want to know more about standing as one of our County Councillors? Please contact us, and have a look at the West Sussex County Council website. Can you help? Our councillors, members, and volunteers will be delivering leaflets, distributing 60 second surveys, and canvassing across many of our wards. You can expect a warm welcome, and full training will be provided. Yes – I want to help my local Greens Social events Come and join us for the monthly litter pick on Littlehampton beach, and / or a coffee and a chat in The Beach Cafe, Sea Road, Littlehampton (opposite The Wave leisure centre). To join the beach clean, please meet at 9.30am by the Shack, where the grabbers, gloves and bags are all provided. A member of the Beach team will lead the clean. Afterwards, we’ll have a coffee in the cafe, from around 11am. It can get busy, so please sign up to let us know to look out for you! Yes – I can join on Sunday 29 September Several members will also be attending the great line up of films showing at A Greener Screen festival in Chichester. If you’d like to meet with others before one of the screenings, please contact us in advance. Tickets are selling fast, so you’ll need to book! Members updates A reminder that our next branch meeting is Tuesday 8 October, 7pm on Zoom. All members are welcome to join us, and non-members can be admitted by prior arrangement.~ We’re now starting to plan ahead for our Annual General Meeting. Are you interested in helping out as a local officer? We’re a friendly team and there’s definitely a role for you! Please get in touch if you’d like more details. Can we help you? Want to join us? Have skills to share? Keep in touch with your local Chichester and Arun Greens Join the party: join.greenparty.org.uk Ask a question: contact@chichesterarun.greenparty.org.uk Keep up to date: Find us on Facebook, You Tube, TikTok and Threads Help us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. Donate All support is very gratefully received. Please include your last name and postcode as a reference, so we know who to thank. |",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_georgiearmourglasius/content_78.html": "7 June 2024 / 8 June 2024 by Georgie Armour\nForget tactical voting and send a message to the next government says Cllr Tim Young, Green Party parliamentary candidate for Chichester, who is urging voters to use this election to demand immediate action on the climate before it’s too late. Whilst Chichester has long been considered a safe Conservative seat, there is a growing sense […]\nRead more »\nGreen Party Parliamentary Candidate for Arundel & South Downs has raised concerns for vulnerable residents in rural communities after Ofcom and the UK government agreed to let BT switch off landline services leaving only broadband services available. Steve McAuliffe, Arun District Councillor, is leading calls for BT to engage with villages and vulnerable rural residents […]\n28 March 2024 / 8 June 2024 by Georgie Armour\nA hard-working community champion and environmentalist with a wealth of knowledge on local issues has been selected by the Green Party as its MP candidate for Arundel & South Downs. Steve McAuliffe is an ex-British Army Air Corps soldier whose 20-year career in ecology and environmental management consultancy has spanned both industry and politics. He […]\n10 December 2023 / 7 February 2024 by Georgie Armour\nAt the Chichester & Arun Green Party 2023 AGM on Thursday 16 November Josie Cohen from Pesticide Action Network gave an excellent talk on the egregious and pernicious effects of pesticides on our soils, rivers, seas, wildlife, crops and health. Those who missed it can watch Josie’s talk and a Q&A below.\n19 November 2023 / 10 December 2023 by Georgie Armour\nOn Thursday 16 November the Chichester & Arun Green Party met for the 2023 AGM, which included a hustings for our parliamentary candidates for the next general election for Chichester (Tim Young) and Bognor & Littlehampton (Carol Birch). For those members who couldn’t make it in person or virtually on the night you can watch […]\n3 November 2023 / 11 December 2023 by Georgie Armour\n10 October 2023 by Georgie Armour\n27 September 2023 / 27 September 2023 by Georgie Armour\n15 September 2023 / 11 December 2023 by Georgie Armour\n6 September 2023 by Georgie Armour",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_adrianmorris_page_3/content_15.html": "11 July 2024 by adrianmorris\nYour part in the Green success story After months and weeks of campaigning, we were all delighted to see four Green MPs elected to parliament and a massive show of support for all our local candidates. And we want to say a HUGE THANK YOU to every one of you, for your support. From voting, […]\nRead more »\n27 June 2024 / 1 July 2024 by adrianmorris\nGreen Parliamentary Candidate Cllr Steve McAuliffe wins hearts and minds at the Greening Steyning Climate Hustings Last night, Wednesday 26 June, all six candidates for the Arundel and South Downs constituency participated in a ‘Question Time’-style Climate Hustings, organised by Greening Steyning. The audience in the packed Drama Hall at Steyning Grammar School heard a […]\n24 June 2024 / 27 June 2024 by adrianmorris\nArundel & South Downs not a ‘safe seat’ say Greens Having been pulled out of the BBC Radio 4 PM programme’s Election Tombola last week to feature on this week’s episodes, the constituency of Arundel & South Downs located in rural West Sussex, often reported as a ‘safe seat’ for the Conservatives, will be in […]\n17 June 2024 / 17 June 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Finally the General Election has been called – and we’re ready for Real Hope and Real Change Your Green candidates We are proud to be standing three excellent Green candidates in the General Election. On Thursday 4 July you will be able to vote for […]\n13 May 2024 / 13 May 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local news We had a fantastic turnout for our recent Green Talk in Barnham. Local residents, Green councillors and members all got together to speak, listen, and share […]\n16 April 2024 / 16 April 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local newsA number of our members took part in the successful campaign to get the Broadford Bridge borehole extension refused. West Sussex County Council planning meeting listened to […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_05_11_le-monde-interview/content_86.html": "Le Monde interviewed Green Party Councillor for Chichester South, Sarah Sharp, regarding the local elections. Here’s what she had to say. (Translation to English courtesy of Bill Sharp, original article in French can be found here.)\nIn Chichester, the Tory ‘blue wall’ is being fought overIn the affluent south of England, the local elections of 4 May are a test for the Sunak government. REPORT by CECILE DUCOURTIEUX\nUnited Kingdom special correspondent\nA beautiful 11th century cathedral, shops decked out in Union Jacks in anticipation of Charles III’s coronation on 6 May, friendly pubs, thatched roofs and rose gardens: Chichester, in Sussex, is a cliché of a rich and happy England. On the eve of the local elections on 4 May, this enchanting city of about 23,000 people, 100 kilometres from London, is one of the most contested areas of the ‘blue wall’ – the south of the country normally won by the Conservatives.\nSome 8,000 local councillors are up for re-election in England, and the opposition parties (Labour, the Greens and the Liberal Democrats) intend to take advantage of the setbacks of the former governments of Boris Johnson and Liz Truss to gain the advantage. This election is also the first facing the Prime Minister, Rishi Sunak, since he took over from Liz Truss in October 2022, and the last before the UK’s scheduled 2024 general election.\nAdrian Moss, a Liberal Democrat (LibDem) politician in Chichester, is hoping to retain his position on the district council and believes in his party’s chances. “The Tories have the majority on the council, with seventeen out of thirty-six elected members, we have eleven [the other parties share the remaining six seats]. But we can turn this around and become a majority. This will make us credible to win the MP seat [held by Gillian Keegan, Mr Sunak’s education minister] next year,” says the elected representative from the party’s office, a stone’s throw from the cathedral.\nThe main concern of Chichester residents, he said, is the pollution of rivers and beaches, aggravated by agricultural discharges, but especially by sewage, a particularly acute problem in Chichester, located near a natural harbour renowned among water sports enthusiasts and bird lovers. “People are fed up with the s*** in the water. Many people don’t allow their children to swim in the water to avoid getting sick,” says Adrian Moss.\nAt issue are water companies, privatised under Margaret Thatcher’s government, which preferred to pay dividends rather than invest in under-resourced infrastructure. Sewers often date from the Victorian era and still collect both rainwater and sewage. As soon as it rains, they become overloaded and the water companies (Southem Water in Chichester) dump the overflow into rivers and onto beaches.\nSo far the Tories have ignored the problem, refusing to impose deterrent fines on the companies. In Chichester, angry residents have set up a “citizen science” group to monitor water quality themselves. “If we win a majority on the district council, we’ll put pressure on Southem Water to change things,” promises Kate o’Kelly, another LibDem elected member of the council and the party’s local coordinator.\nThe other major concern of residents, which could cost the Conservatives, in power since 2010, is the cost of living. Here, as elsewhere in the country, people have seen their energy bills double and food prices rise by around 15 per cent over a year. “This is a wealthy community, but many are struggling. A lot of businesses have gone out of business in the city centre because of high rents. In my school we have set up a food bank for some parents,” says James Field, who has just left his “very stressful” job as headmaster of a Catholic school to become an executive with the NAHT, the main national union of headteachers.\nIn the semi-rural township of Chichester, which has only one Labour elected member on the district council, Field is confident of his chances: “People are still angry about the Johnson and Truss Tory governments. Next year’s parliamentary elections could be a big surprise with well-known Tory MPs losing their seats,” the Labour candidate predicted.\nThe deplorable state of the National Health Service (NHS) is also on everyone’s mind, aggravated by the lack of staff – in Chichester too, getting an appointment with your family doctor is an obstacle course. “But Brexit is no longer an issue here, even though it’s why we’ve lost foreign staff from the NHS,” says Sarah Sharp, a Green member of the district council.\nMrs Sharp is also campaigning for more cycle paths and better public transport. The rail network, meanwhile, is in a state of disrepair: the direct train to London rarely runs smoothly. “Trains are often cancelled, there are not enough buses, people are dependent on cars,” she said, underlining another failure of the Conservative policies of privatisation and budget cuts.\nGreg Hands, the Conservative chairman, has warned that his party could lose up to 1,000 elected positions on 4 May. Experts believe that this pessimism is exaggerated: after the scandals of the Johnson era and the catastrophic economic programme of Liz Truss, hope has returned to the Tory side. The serious, hard-working Rishi Sunak seems to have reassured voters: in the polls, Labour’s lead over the Conservatives is now only about 15 points. The left-wing party is counting on the local elections to make gains in the south of the country, and to regain ground in the Midlands and the North, where it suffered a historic setback in the 2019 general election.\nBut the prospect of a Labour government, which seemed inevitable a few weeks ago, is no more than a prospect and nervousness seems to be spreading among the party’s staff. Its leader, Keir Starmer, is constantly positioning himself in the centre, at the risk of blurring his image. On Tuesday 2 May, he even announced that he was abandoning a promise to abolish the enormous weight of university tuition fees, which he made in 2020 during the campaign to replace his predecessor, Jeremy Corbyn.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_05_13_may-2024-newsletter/content_64.html": "| Welcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local news We had a fantastic turnout for our recent Green Talk in Barnham. Local residents, Green councillors and members all got together to speak, listen, and share their views on the current situations around sewage and anti-social behaviour in the area. Thank you to everyone who came along. You can see videos from the evening on our YouTube channel. These issues are ongoing, and our Green team are working hard to find long-lasting and sustainable solutions. Remember to stay in touch – at Arun District Council, the Green councillors representing Barnham are: Sue Wallsgrove, Paul Ayling, and Anita Lawrence, and our Green MP candidate for Arundel & South Downs is: Steve McAuliffe. In Bosham, our Press Officer Georgie has been leading on campaigns for safer streets and active travel. She has been working with other local residents to encourage a ‘walk bus’ and a ‘bike bus’ for school children. Please get in touch if you want to get involved. At the local elections on 2 May, our Green candidate for the Police and Crime Commissioner post, Jonathan Kent, received over 43,000 votes – thank you to everyone who voted Green! We were delighted to see our share of the vote increase again this time. And more positive news from our neighbouring wards, with new Green councillors elected in Havant, Worthing and Adur. Across the country, the Green movement continues to grow! News from our local councillors In Arun district council, councillor Steve McAuliffe met with the senior management team to establish that the current Climate Change and Biodiversity working plan should be reviewed and improved. The most important addition, put forward by Steve, is a new section on climate change resilience and adaptation – this was accepted and agreed. Further major additions to be considered will be the introduction of specific measures and targets, and identifying key areas of activitity around carbon reduction, waste and biodiversity. These will be passed to the committee for further debate. Councillor Carol Birch, who is Chair of the Housing and Wellbeing Committee at Arun, helped to open the latest Changing Places toilet facilities in Arundel. These facilities are vital to allow people with certain disabilities to live a more fulfilling life as they often find their needs are not being met with standard toilets. This is the fifth Changing Places toilet to be installed in the Arun district, with more to follow in the future. Councillor Carol Birch also attended a fundraising event for St Mary Magdalene church in Madehurst, who are raising money for maintenance. This South Downs church is a popular venue for community events, and Carol is also helping them to look for further options where they can apply for more funding. Arun councillors have recently attended briefings about the new Housing Regulations. These should make social housing safer for residents. Councillors have also been busy helping local residents with their individual issues, including around planning and development. Chichester Councillor Tim Young was invited to speak with students at the Politics society at Chichester university. He enjoyed the chance to talk to the next generation of voters – and hear their hopes and concerns for the future. As well as representing these young people at a local level, Tim will also be our Green MP candidate for the Chichester constituency in the upcoming General Election. We’re proud to say that our councillors have signed up to a pledge to support refugees if the government try to remove them under the awful Rwanda scheme. The national party have been clear in their objection to the Rwanda Bill, which co-leader Carla Denyer has described as “a very expensive way to be cruel”. Please contact us if you want to get in touch with our councillors, or are interested in standing for election in the future. Upcoming events and actions Over the coming months we are going to be focused on getting our positive Green message out to local people. Can you help? Our candidates, councillors and volunteers will be delivering leaflets, distributing 60 second surveys, and canvassing across our wards. If you can help, please sign up here. Calling all Green crafters! We have several events coming up over the summer where we want to have a colourful Green Party presence. Would you like to join us to help create some new beautiful banners? Do you have any spare fabric or crafting materials? Please contact Faye to get involved. Picture: “Craftivism, Peas and love” by Campaign Against Arms Trade is licensed under CC BY-SA 2.0. Saturday 18 May. Paddle Out with Surfers Against Sewage in Brighton. All over the country people will be coming together to take a stand against sewage polluters. Local party members will be heading to our nearest group in Brighton to pledge our support. Find out more details here, and if you’d like to join us travelling to the event please get in touch. Sunday 19 May. Action Day supporting Siân Berry’s campaign in Brighton. A group of local party members will be travelling to Brighton by train, and we’d love you to join us. This will be a great opportunity to meet more Green supporters from across the south east. Please get in touch if you’d like to come with us. Saturday 25 May. Chichester Pride in Chichester. This year Chichester Pride will hold their first parade through the city centre – and local Greens will be there in support and unity! The parade will start from Priory Park at 10.30am, please contact Faye for details of when and where to meet. The third annual Pride festival will then take place from 12 noon to 7pm at Chichester college. Sunday 26 May, 9.30am. Beach clean in Littlehampton. Local Green Party members will be joining The Beach Cafe on their monthly litter pick along the coast. Meet by the shack, where the Beach will provide grabbers, gloves and bags. A member of the Beach team will lead the clean. To attend with other Green Party members, please contact Sarah. Tuesday 28 May, 6.30pm. Greening Felpham in Bognor Regis. One of our fantastic local members has organised this free event to help residents attract, protect and nurture wildlife in their own gardens and urban spaces. Local speakers on topics including pesticide-free gardening, soil health and helping hedgehogs. Book your ticket here. Saturday 22 June. Restore Nature Now march in London. We are planning to get together a local group to travel up to London and take part in this event. This will be a family-friendly and accessible march – calling for the political and policy changes desperately needed for nature. Find out more details here. Why not come with us? Please get in touch if you’re interested! If you can, please plan your journeys on public transport. If you are able to offer / require a lift share to any of the events, please contact the relevant organiser. Next branch meetings: Monday 10 June, 7pm on Zoom. Click here to RSVP Tuesday 9 July, 7pm on Zoom. Wednesday 7 August, 7pm on Zoom. Monday 9 September, 7pm on Zoom. Tuesday 8 October, 7pm on Zoom. Wednesday 6 November, 7pm on Zoom. Can we help you? Want to join us? Have skills to share? Keep in touch with your local Chichester and Arun Greens Join the party: join.greenparty.org.uk Ask a question: contact@chichesterarun.greenparty.org.uk Keep up to date: Find us on Facebook, You Tube, TikTok and X (formerly Twitter) Help us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. If you can help out, please click here or follow the QR code. All support is very gratefully received. Please include your last name and postcode as a reference, so we know who to thank. A big thank you to everyone that has worked so hard over the last month on all Green causes! We look forward to seeing you soon |",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_tag_talk/content_89.html": "Watch the Biodiversity Net Gain (BNG) talks 4 February 2024 / 7 February 2024 by Mark Record Biodiversity Net Gain (BNG), Nature Opportunity or Planning Fig Leaf? Watch or listen to the Jan 24th 2024 talks on BNG held at the Friends Meeting House, Priory Road to find out what impact this new planning legislation will have. National housing targets are leading to urban development expanding deeper into the countryside. Government says […] Read more » FMH Talk Video",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_12_12_southern-waters-water-resources-management-plan/content_54.html": "Arun and Chichester Green Party have responded to the consultation on Southern Water’s “Water Resources Management Plan”.\nYou an read our response at\nhttps://docs.google.com/document/d/1UO4g00yUIoomgHqmzsjWDS8ztPzeT8XDXLMjfj9T2iw/edit?usp=sharing\nYou can watch our guest speaker, Tracey Viney, give her excellent presentation on the plans here.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_06_17_chichester-and-arun-green-party/content_67.html": "Welcome to the monthly newsletter from your local Green Party. Finally the General Election has been called – and we’re ready for Real Hope and Real Change\nYour Green candidates\nWe are proud to be standing three excellent Green candidates in the General Election. On Thursday 4 July you will be able to vote for a Green candidate in the following local constituencies:\nArundel & South Downs: Steve McAuliffe\nSteve is a councillor in Arun, and also sits on the South Downs National Park Board. He has had a 20-year career in ecology and environmental management. In the 2023 local election he received the highest vote share of any candidate in Arun. Support Steve!\nBognor Regis & Littlehampton: Carol Birch\nCarol is a councillor in Arun, and Chairs the Housing and Wellbeing committee. She has lived in Bognor for nearly 25 years, and works in social housing. With no incumbent MP in this constituency now is the time for real change. Support Carol!\nChichester: Tim Young\nTim is a councillor in Chichester, and sits on the Environment Panel. He has lived in the area all his life, and works in solar energy. In 2020 he came a close second in the county election, receiving more votes than Labour and the Lib Dems combined. Support Tim!\n- You can read more about our candidates on our website, and please let your family, friends and neighbours know they have a Green candidate.\n- If you’re able, please sign up to help us with leafleting or to display a Vote Green board, and see below for more details on how to help our candidates.\nGetting Sian elected in Brighton\nOur local party are also actively supporting Sian Berry’s campaign in Brighton Pavilion.\nThe hard-working Brighton team are hosting Green supporters from across the country – with different campaign actions happening every day. It’s a fantastic atmosphere, with lots to get stuck into, and a chance to make an important difference.\nIf you’re able to spare any time, please do try and make a trip to Brighton. Find out more here\nHelp the local Green vote\nOver the next few weeks we will be knocking on doors, delivering leaflets and meeting as many local constituents as we can. The positive Green message is one of real hope and real change. Can you help?\n- Delivering leaflets in your local area. We can provide you with a bundle of leaflets and a map, and with the warmer, lighter evenings this is great way to help out.\n- Displaying a ‘Vote Green’ board. We have several sizes to choose from, and if you live on a busy road this will be really useful.\n- Donating to our Crowdfunder campaigns. Elections cost money, and we rely on member’s donations – please give if you can. Arundel & South Downs fundraiser and Chichester and Bognor Regis & Littlehampton fundraiser.\n- Share our social media posts, and talk to your friends and neighbours about their Green candidate. Find us on Facebook, You Tube, TikTok and X (formerly Twitter)\nIf you can help with leafletting, displaying a board, or anything else – please reply to this email or contact us here. Thank you!\nEvery Green vote is important\nSome people may be wondering about tactical voting in this election. By voting Green you will have the following important impact:\nYou send a message to the next government: The Tories are toast, and all signs point to a new administration. The next government needs to get to grips with the climate and nature emergency we are facing – and fast. A large national vote share for the Greens shows this urgency, and also puts on the pressure for a fairer voting system.\nYou send a message locally: We might be excited for the national election now, but we have already made significant changes at local and regional level. The county elections will be coming soon, and positive results for our local Greens put us in an even stronger position.\nYou support our national party: For every vote received, an opposition party is allocated ‘short money’. This is funding to assist with carrying out parliamentary business and expenses, and equals around £40 per year for every 200 votes.\nYou support our local party: We are not bankrolled by big business or billionaires – the funds for our campaigning come from our local supporters. Any funds and returned deposits will automatically go into our next campaign (the county election!)\nEvents\nPlease note these important election dates:\n- Tuesday 18 June: deadline to register to vote\n- Wednesday 19 June: deadline to register for a postal vote\n- Wednesday 26 June: deadline to register for a proxy vote\n- Wednesday 26 June: apply for a Voter Authority Certificate (photo ID)\n- Thursday 4 July: Vote Green! (find your polling station)\nHustings\nTuesday 18 June, 7.30pm. Hustings in Our Lady of Sorrow’s Catholic Church, Clarence Road, Bognor Regis. With our Bognor Regis and Littlehampton candidate Carol Birch.\nThursday 20 June, 7.30pm. Hustings hosted by Sussex Online, Zoom. With our Bognor Regis and Littlehampton candidate Carol Birch. Register here.\nWednesday 26 June, 7pm. Climate hustings in Steyning. With our Arundel & South Downs candidate Steve McAuliffe. Book tickets (£3) here.\nWednesday 26 June, 7pm. Hustings in Chichester Cathedral, Chichester. With our Chichester candidate Tim Young. Register here.\nFriday 28 June, 6pm. Education hustings in Chichester. With our Chichester candidate Tim Young. Venue TBC.\nTuesday 2 July, 6pm. Climate hustings in St Mary Magdalene Church, Midhurst. With our Arundel & South Downs candidate Steve McAuliffe.\nIf you can, please plan your journeys on public transport. If you are able to offer / require a lift share to any of the events, please contact us.\nNon-election events\nSaturday 22 June. Restore Nature Now march in London. We are planning to get together a local group to travel up to London and take part in this event. This will be a family-friendly and accessible march – calling for the political and policy changes desperately needed for nature. Find out more details here. Why not come with us? Please get in touch if you’re interested!\nSunday 30 June, 9.30am. Beach clean in Littlehampton. Join The Beach Cafe on their monthly litter pick along the coast. Meet by the shack, where the grabbers, gloves and bags are all provided. A member of the Beach team will lead the clean. To attend with other Green Party members, please contact Sarah.\nPlastic-Free Picnic. Date in July and location TBC. After the campaigns have finished, it will be time to celebrate our election results and relax together. Our local party will be hosting a family picnic to say thank you for all your support, and to enjoy the summer! Look out for more details in the next e-newsletter.\nNext branch meetings:\nTuesday 9 July, 7pm on Zoom. Click here to RSVP\nWednesday 7 August, 7pm on Zoom.\nMonday 9 September, 7pm on Zoom.\nTuesday 8 October, 7pm on Zoom.\nWednesday 6 November, 7pm on Zoom.\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok and X (formerly Twitter)\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. If you can help out, please click here or follow the QR code.\nAll support is very gratefully received. Please include your last name and postcode as a reference, so we know who to thank.\nA big thank you to everyone that has worked so hard over the last month on all Green causes! We look forward to seeing you soon",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_category_uncategorised_page_3/content_75.html": "16 August 2024 / 16 August 2024 by Anandamayi Mem\nLike so many in our beloved country we have been appalled to see the recent outburst of far-right racist and political violence in towns and cities all over England. The attacks on mosques and hotels accommodating asylum seekers have been especially shocking. For a good summary of how the political violence developed in the aftermath […]\nRead more »\n11 July 2024 by adrianmorris\nYour part in the Green success story After months and weeks of campaigning, we were all delighted to see four Green MPs elected to parliament and a massive show of support for all our local candidates. And we want to say a HUGE THANK YOU to every one of you, for your support. From voting, […]\n27 June 2024 / 1 July 2024 by adrianmorris\nGreen Parliamentary Candidate Cllr Steve McAuliffe wins hearts and minds at the Greening Steyning Climate Hustings Last night, Wednesday 26 June, all six candidates for the Arundel and South Downs constituency participated in a ‘Question Time’-style Climate Hustings, organised by Greening Steyning. The audience in the packed Drama Hall at Steyning Grammar School heard a […]\n24 June 2024 / 27 June 2024 by adrianmorris\nArundel & South Downs not a ‘safe seat’ say Greens Having been pulled out of the BBC Radio 4 PM programme’s Election Tombola last week to feature on this week’s episodes, the constituency of Arundel & South Downs located in rural West Sussex, often reported as a ‘safe seat’ for the Conservatives, will be in […]\n17 June 2024 / 17 June 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Finally the General Election has been called – and we’re ready for Real Hope and Real Change Your Green candidates We are proud to be standing three excellent Green candidates in the General Election. On Thursday 4 July you will be able to vote for […]\n7 June 2024 / 8 June 2024 by Georgie Armour\nForget tactical voting and send a message to the next government says Cllr Tim Young, Green Party parliamentary candidate for Chichester, who is urging voters to use this election to demand immediate action on the climate before it’s too late. Whilst Chichester has long been considered a safe Conservative seat, there is a growing sense […]\nGreen Party Parliamentary Candidate for Arundel & South Downs has raised concerns for vulnerable residents in rural communities after Ofcom and the UK government agreed to let BT switch off landline services leaving only broadband services available. Steve McAuliffe, Arun District Councillor, is leading calls for BT to engage with villages and vulnerable rural residents […]\n13 May 2024 / 13 May 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local news We had a fantastic turnout for our recent Green Talk in Barnham. Local residents, Green councillors and members all got together to speak, listen, and share […]\n27 April 2024 / 8 June 2024 by Mark Record\nChichester and Arun Green Party held a series of talks and discussions at Barnham community hall on the evening of the 19th April including Jonathan Kent our Green Party Sussex Police and Crime Commissioner candidate. Jonathan Kent began with a talk explaining why he is standing as a candidate to become the Sussex Police and […]\n16 April 2024 / 16 April 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local newsA number of our members took part in the successful campaign to get the Broadford Bridge borehole extension refused. West Sussex County Council planning meeting listened to […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_07_11_july-2024-newsletter/content_66.html": "| Your part in the Green success story After months and weeks of campaigning, we were all delighted to see four Green MPs elected to parliament and a massive show of support for all our local candidates. And we want to say a HUGE THANK YOU to every one of you, for your support. From voting, to putting a poster in your window, to walking miles in all weathers to deliver the Green message! There have been tens of thousands of leaflets delivered across Arun and Chichester, hundreds of Vote Green boards on gateposts and in gardens, and innumerable Green conversations with our neighbours, friends and colleagues. They all helped, they all count – thank you Adrian! All of the feedback was incredibly positive, and given us great confidence to build on for future elections. Next stop: West Sussex County Council elections in 2025! Please sign up here, if you’d like to get involved. Local results We had three excellent and energetic local candidates. How did this translate to votes? In Arundel & South Downs we received over 5,500 votes and 10.1% share. Compared to 2019 this vote share is up 6.1%, the biggest increase of all the major parties (Conservative -20.2%, Lib Dems -1.0%, Labour +2.2%). In Bognor Regis and Littlehampton we received over 2,000 votes, which was a 4.6% share. This was an increase in vote share from 2019 of 1.3%, despite tactical voting locally. In Chichester we received over 1,800 votes and 3.5% of the total vote share. Although this percentage is slightly down compared to 2019, this was a target seat for the Lib Dems who campaigned hard for tactical votes. A message from Carol, our Bognor Regis and Littlehampton candidate: “A big thank you to everyone who voted for me. With 4 Green MPs elected to get a Green voice for you in Parliament every vote will support them. Myself and many of our local members have helped to achieve this, I have been in Brighton and Suffolk. With almost 2 million votes it shows the support for the party and the clear need for a fairer voting system in the UK.” A message from Steve, our Arundel and South Downs candidate: “Heartfelt thanks is extended to all those who have supported the Arundel & South Downs Campaign in recent weeks. Your exceptional efforts with leafletting, putting up boards, canvassing and making financial contributions led to Greens more than doubling any previous vote share in this area. This is a fantastic platform to build on. County elections next year will allow us to develop our presence across the constituency even further. Your support will allow Greens to speak up with an even louder and growing voice for social equality and environmental protection. Thank you all for the faith you placed in me. It was a truly humbling experience and I will continue to speak up on your behalf and on behalf of nature at any level of local authority to which I am elected. Thank you all.” A message from Tim, our Chichester candidate: “Thank you so much to the Chichester voters who supported the Green Party in this election. The local Green party put a tremendous amount of work into the campaign and members’ support and donations made it possible to fight a full campaign. I was proud to be your candidate and to meet so many party members on the doorstep. It was really motivating to have such a strong Green Party manifesto to speak about: I could see voters getting excited about Green policies for transport and the NHS as well as new policy ideas for the climate. Our nearly 2 million Green votes across the country sends a clear message to the new government that we want them to be bold, think big and do better for the environment.” An invitation to you… Please come to a party to celebrate our achievements and thank our wonderful Green friends and supporters on Sunday 14 July from 1pm. Did you vote (or want to vote) Green on 4th July? Then PLEASE JOIN US this Sunday. You (and any partners, friends and family) are all invited to a Green celebration from 1pm till the evening at Humphrey’s Homestead, Greatham Road, near Pulborough, RH20 2ET. This will be a potluck picnic so (if it’s easy) bring a vegan or veggie contribution (there’ll be some food provided along with tea, coffee, soft drinks and maybe a bit of fizz). If the weather’s good we’ll be on the lawn. If it’s not, we’ve got use of the library and we’ll build a roaring fire. If you play tennis please wear trainers, we’ve got rackets and balls. If you can manage a dip in an unheated pool bring your cossie (we’ve got towels). We’ll be celebrating our incredible Green results this May and July right across Sussex, Surrey and Hampshire (as well as nationally) and, most importantly, EVERYONE who helped made these extraordinary results possible in whatever way – even by just voting Green, putting up a poster or being a member or supporter. So many of you put in such hard work. Others stood as non-target candidates or donated or wished us well or put up a poster or a board. You ALL helped and you are ALL welcome to join us for the day or just an hour or two on 14th July. No obligation to RSVP or to join us. If you can’t make it or something comes up, we’ll miss you but there’ll be a next time. Can’t wait to see you!!! More detailed directions here: The What3Words location is: shots.loudness.covertly. If coming by train the nearest station is Pulborough, and we can pick you up. Any questions please call Claudia: 07970 813248. Events After the excitement of the General Election we want to keep the Green momentum going! Over the coming months we’ll be getting our positive Green message out to as many local people as possible. Can you help? Our councillors, members and volunteers will be delivering leaflets, distributing 60 second surveys, and canvassing across all our wards. If you can help, please sign up here. Monday 15 July, 7.30pm. Green Party General Election celebration event. Online on Zoom. The national party recognises that many of you gave up weekends, weekdays and booked holiday to help all across the country. In addition to our local celebration (see above!) they are hosting an an online party to celebrate our collective win. They hope to be joined by at least one of our exceptional new MPs, and there will also be an opportunity to chat to members from across the country in smaller breakout rooms. Sunday 28 July. Beach clean and meet-up in Littlehampton. Join The Beach Cafe on their monthly litter pick along the coast. Meet at 9.30am by the shack, where the grabbers, gloves and bags are all provided. A member of the Beach team will lead the clean. And / or join us for a coffee afterwards, from around 11am. To attend with other Green Party members, please contact Sarah. If you can, please plan your journeys on public transport. If you are able to offer / require a lift share to any of the events, please contact us. Next branch meetings: Wednesday 7 August, 7pm on Zoom. Click here to RSVP. Monday 9 September, 7pm on Zoom. Tuesday 8 October, 7pm on Zoom. Wednesday 6 November, 7pm on Zoom. Can we help you? Want to join us? Have skills to share? Keep in touch with your local Chichester and Arun Greens Join the party: join.greenparty.org.uk Ask a question: contact@chichesterarun.greenparty.org.uk Keep up to date: Find us on Facebook, You Tube, TikTok and X (formerly Twitter) Help us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. If you can help out, please click here or follow the QR code. All support is very gratefully received. Please include your last name and postcode as a reference, so we know who to thank. A big thank you again to everyone working so hard on the Green campaign! |",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_10_16_october-2024-newsletter/content_39.html": "Welcome to our October 2024 newsletter!\nMaking a difference\nWe already have many hard-working Green councillors in both Arun and Chichester. Next year, the West Sussex County Council elections are taking place, and we plan to get even more Greens elected.\nGreens believe in supporting all our communities across the region. We offer Real Hope and Real Change in the face of climate and biodiversity emergencies.\nWe’re now looking for passionate people who want to help us make this difference. Could it be you?\nIf you want to find out more about standing as one of our Councillors, there are Green Party training sessions (Fri 25 Oct, 12pm, Weds 30 Oct, 7pm, Sat 9 Nov, 10.30am), information on the West Sussex County Council website, and you can contact the local party here:\nCould you lend a hand?\nOur local team is busy getting our positive Green message out to as many people as possible. This means delivering leaflets and surveys, and canvassing across many of our wards. And we’re always looking for extra help! If you’re able to join us, even for just an hour or so, we promise a warm welcome and full training.\nWe are currently delivering the latest issue of Chichester Green News to local residents. Our next planned delivery dates are: Wednesday 16 October and Saturday 19 October. Please click here for more details of how you can help.\nAnd perhaps you might consider being a local officer in our small, friendly team? If you’re interested in sharing and developing your skills, and helping out more in your local party, please get in touch for details:\nBeach clean and coffee\nNew to the Greens? Or a long-time supporter thinking of getting more involved? Why not come and meet us on Sunday 27 October? Local members will be joining the monthly litter pick on Littlehampton beach, then having a coffee and a chat in The Beach Cafe, Sea Road, Littlehampton (opposite The Wave leisure centre). To join the beach clean, please meet at 9.30am by the Shack, where the grabbers, gloves and bags are all provided. A member of the Beach team will lead the clean. Afterwards, we’ll have a coffee in the cafe, from around 11am. Please sign up below:\n“Cycleoke” – entertaining environmentalism\nWe are excited to be hosting a Chichester Cycleoke session on Thursday 7 November, 6:30pm.\nOur party are teaming up with local organisation ChiCycle to deliver this fun event in the Chichester University Student Union. Cycleoke is similar to karaoke – except the energy is entirely powered by bicycle! As well as providing all the equipment for students, members will be there to give information about the Greens, and advise on running future active travel and sustainability activities at the university. No need to book, and everyone is welcome – see you there!\nSave the date\nChichester & Arun Greens Christmas Party will be held on Friday 7 December at Barnham Community Hall. More details coming soon…\nMembers updates\nA reminder that our next branch meeting will be combined with our AGM on Friday 8 November, 7pm on Zoom. All members are welcome to join us, and non-members can be admitted by prior arrangement. Please note, only members can vote at the AGM. The full agenda will be emailed to members nearer the time.\nEach month we hold an online policy discussion for members. It’s a chance to look at an important and topical area in more depth, in a relaxed and respectful setting. Our next topics are the Assisted Dying Bill (Friday 18 October), and local transport (Friday 15 November). Join in the discussions by registering here.\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok and Threads\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work.\nWe are currently fundraising for the May 2025 county elections\n– please give if you can:\nAll support is very gratefully received. Please always include your last name and postcode as a reference, so we know who to thank.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_mark-record/content_53.html": "27 April 2024 / 8 June 2024 by Mark Record\nChichester and Arun Green Party held a series of talks and discussions at Barnham community hall on the evening of the 19th April including Jonathan Kent our Green Party Sussex Police and Crime Commissioner candidate. Jonathan Kent began with a talk explaining why he is standing as a candidate to become the Sussex Police and […]\nRead more »\n4 February 2024 / 7 February 2024 by Mark Record\nBiodiversity Net Gain (BNG), Nature Opportunity or Planning Fig Leaf? Watch or listen to the Jan 24th 2024 talks on BNG held at the Friends Meeting House, Priory Road to find out what impact this new planning legislation will have. National housing targets are leading to urban development expanding deeper into the countryside. Government says […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_category_uncategorised_page_4/content_92.html": "5 April 2024 / 5 April 2024 by Anandamayi Mem\nFor the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the […]\nRead more »\n28 March 2024 / 8 June 2024 by Georgie Armour\nA hard-working community champion and environmentalist with a wealth of knowledge on local issues has been selected by the Green Party as its MP candidate for Arundel & South Downs. Steve McAuliffe is an ex-British Army Air Corps soldier whose 20-year career in ecology and environmental management consultancy has spanned both industry and politics. He […]\n4 February 2024 / 7 February 2024 by Mark Record\nBiodiversity Net Gain (BNG), Nature Opportunity or Planning Fig Leaf? Watch or listen to the Jan 24th 2024 talks on BNG held at the Friends Meeting House, Priory Road to find out what impact this new planning legislation will have. National housing targets are leading to urban development expanding deeper into the countryside. Government says […]\n10 December 2023 / 7 February 2024 by Georgie Armour\nAt the Chichester & Arun Green Party 2023 AGM on Thursday 16 November Josie Cohen from Pesticide Action Network gave an excellent talk on the egregious and pernicious effects of pesticides on our soils, rivers, seas, wildlife, crops and health. Those who missed it can watch Josie’s talk and a Q&A below.\n19 November 2023 / 10 December 2023 by Georgie Armour\nOn Thursday 16 November the Chichester & Arun Green Party met for the 2023 AGM, which included a hustings for our parliamentary candidates for the next general election for Chichester (Tim Young) and Bognor & Littlehampton (Carol Birch). For those members who couldn’t make it in person or virtually on the night you can watch […]\n3 November 2023 / 11 December 2023 by Georgie Armour\n10 October 2023 by Georgie Armour\n27 September 2023 / 27 September 2023 by Georgie Armour\n15 September 2023 / 11 December 2023 by Georgie Armour\n6 September 2023 by Georgie Armour",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_12_17_december-2024-newsletter/content_38.html": "Welcome to our December 2024 newsletter\nThanks for your support in 2024… See you in 2025!\nA huge thank you to everyone who has supported the Green party this year. Every action makes a difference: from talking to others about the green issues that matter, to being one of our local volunteers or councillors.\nThis year we’ve seen a record-breaking FOUR MPs elected, and huge increases in Green votes. What’s next, Adrian? It’s clear that we desperately need more Green voices in the rooms where it matters most… Could you make it a new year’s resolution to get more involved with your local party? Why not come along to a social meet, online talk, or branch meeting – you can be sure of a warm welcome.\nClimate and Nature Bill – please contact your MP\nIn 2020, Caroline Lucas introduced the Climate and Nature Bill to parliament. Written by scientists, experts and campaigners it put forward the measures we need to properly address the climate and biodiversity crises. Finally, the CAN bill is heading to its Second Reading on 24 January 2025.\nAfter a devastating year that the UN Secretary General called “a masterclass in human destruction” we have a chance to make 2025 the year that the UK adopts this world-leading legislation. The CAN bill will make the UK’s existing international agreements on climate and nature (made at the Paris climate COP in 2015 and the Montreal biodiversity COP in 2022) legally binding and ensure that we achieve these key commitments by 2030. At present we’re not on track and this government is the last one that can deliver them before the deadline.\nIn order for the cross-party Bill to succeed on 24 January it needs 102 supporting MPs to vote for it. Please email your MP and ask them to attend the debate and back the Bill. To tell us more, and answer any questions, we’re delighted to have a guest speaker from Zero Hour at our webinar on Friday 17 January.\nPlease come and join us – let’s make 2025 the year the CAN Bill becomes the CAN Act.\nCome and meet other Greens\nStorm warnings permitting, on the last Sunday of every month, local members join the regular litter pick on Littlehampton beach. This is followed by a coffee and a chat in The Beach Cafe, Sea Road, Littlehampton (opposite The Wave leisure centre). To join us on the beach clean, please meet at 9.30am by the Shack, where the grabbers, gloves and bags are all provided by the Cafe (as part of Surfers Against Sewage). A member of the Beach team usually leads the clean. Afterwards, we’ll be in the cafe, from around 11am. Please sign up below – see you there!\nMembers updates\nEach month we hold an online policy discussion for members. It’s a chance to look at an important and topical area in more depth, in a relaxed and respectful setting. Our next topics are: the CAN Bill (Friday 17 January), solar power (February), and local rivers (March). You are welcome to join in our members’ discussion by registering here.\nOur first branch meeting for 2025 will be on Tuesday 14 January, 7pm on Zoom. All members are welcome to join us, and non-members can also be admitted by prior arrangement. We look forward to seeing you there.\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok and Threads\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work.\nWe are currently fundraising for the May 2025 county elections\n– please give if you can:\nAll support is very gratefully received. Please always include your last name and postcode as a reference, so we know who to thank.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_10_11_chichester-green-news/content_24.html": "October 2024 : Issue 14\nhttps://chichesterarun.greenparty.org.uk/wp-content/uploads/sites/212/2024/10/Autumn-newsletter-2024.pdf\nCan you help with newsletter delivery?\nWe will be delivering this newsletter to Chichester doorsteps from now.\nIf you can help please email contact@chichesterarun.greenparty.org.uk\nLunch and tea provided!",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_aledmorris/content_60.html": "Skip to content\nSkip to footer\nChichester & Arun\nMenu\nNews\nEvents\nPeople\nAbout us\nVideos\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\naledmorris\nHome\nPosts by \"aledmorris\"\nArun District Election 2023 Campaign Launch\n5 April 2023\n/\n11 May 2023\nby\naledmorris\nRead more »\nTo top",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_04_27_april-2025-newsletter/content_87.html": "Welcome to our April 2025 newsletter!\nYour local Green team has been busy campaigning in two upcoming by-election areas over the last few weeks:\n24 April – Marine ward (Bognor Regis) for Arun District Council. Green candidate: John Erskine.\n1 May – Midhurst (Chichester) for Chichester District Council and West Sussex County Council. Green candidates: Adrian Morris and Philip Maber.\nOur excellent candidates and volunteers have been working hard, delivering leaflets and speaking to local people about their concerns. With just a short time left before the votes – could you join us? This is a fun way to get more involved with your local party, and meet other members too.\nWith the postponement of the county council elections, and the future shape of our local democracy still to be decided, it’s more important than ever to have Green voices heard. We’re expecting more councillors to stand down over the next few months, and the Greens are prepared to step up and be a positive local voice.\nCan you help us?\nIf you can spare a couple of hours to join us, please get in touch for more details:\nVolunteering isn’t always for everyone, but a regular or one-off donation could also make a huge difference. We don’t have billionaire backers and dodgy business relationships to call on for our resources! Your local party relies on supporters just like you. Thank you for anything you can give.\nUpdate from our District councillors\nCarol Birch, one of our Green councillors and Chair of Arun’s Housing and Wellbeing Committee says there is great news for local social housing. Arun has successfully been given a provisional award of £3.3m, which with additional £4.5m, will be used to upgrade the least efficient homes in the current housing stock. The money will come from the Warm Homes: Social Housing Fund. This programme provides grants to social housing providers to help make properties warmer, reduce carbon emissions and tackle fuel poverty – by installing insulation, alternative heating systems and solar PV panels on roofs. These steps will improve the household’s thermal comfort (a term that describes the temperature, air flow, and humidity, amongst other factors, in a property so that residents are neither too hot or too cold throughout the year), whilst saving money on energy bills. As we move into spring and summer, it’s also good to see that this work will help keep homes cooler in the hotter months too. Whilst this is great news, it also illustrates the enormous effort that would be needed to improve all housing across the country. So as Rampion 2 also gets the go ahead, our priority should be to use our energy wisely.\nBeach clean and social meet-up\nLocal members join the regular litter pick on Littlehampton beach on the last Sunday of every month. This is followed by a coffee and a chat in The Beach Cafe, Sea Road, Littlehampton (opposite The Wave leisure centre).\nThe next meet will be: Sunday 27 April\nTo join the beach clean, please meet at 9.30am by the final beach hut before the cafe. All the grabbers, gloves and bags are kindly provided by the Beach (as part of Surfers Against Sewage), and a member of their team usually leads the clean. Afterwards, we’ll be in or outside the cafe, from around 11am.\nWe’d love to see you – please sign-up here so we know to look out for you:\nMembers updates\nEach month we hold an online policy discussion on a topic close to Green hearts. These are an opportunity to consider an important area in more detail, in a relaxed and respectful setting. Tonight Friday 18 April our topic is: being a town / parish councillor. We will be talking about this important role in our local communities, the support the Green party can give councillors, and answering any questions you might have about standing.\nOur next branch meeting will be on Wednesday 14 May, 7pm on Zoom. All members are welcome to join us, and non-members can also be admitted by prior arrangement. We look forward to seeing you there.\nLinda Lancaster, a good friend of Arun & Chichester Green Party, very sadly died recently. A ceremony celebrating her life was held on 9 April, attended by many Green Party activists and friends who wanted to share their sadness and show their respect for this remarkable and compassionate person.\nDespite battling chronic illnesses for several decades, Linda was a trooper, who adopted wholeheartedly many humanitarian and environmental causes and went out of her way to consistently campaign for a better world – for animals (she was a vegan), for the environment, for refugees, for peace and against racism. Linda was usually on the frontline of marches and sit-ins, with a legendary ability to diffuse tense situations and win people over with her gentle charm and feisty wit. She helped out with leafleting and canvassing for several local Green constituencies and stood as a paper candidate in her own home area, Felpham East. She was also presented with an award for her activism at the Greens’ Xmas celebration in Barnham last December. She will be remembered with huge affection and admiration by many.\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok, Threads and BlueSky\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. All support is very gratefully received. Please always include your last name and postcode as a reference, so we know who to thank.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_category_uncategorised_page_6/content_63.html": "15 February 2023 / 13 March 2023 by Georgie Armour\nZack Polanski, Deputy Leader of the Green Party of England and Wales, spoke to a packed room in Arundel last Monday night, as he addressed many issues dear to local residents, such as road building and inappropriate housing developments. He also spoke passionately about the concern shared by many – and certainly judging by the […]\nRead more »\n8 February 2023 / 13 March 2023 by Georgie Armour\n30 January 2023 / 13 March 2023 by Georgie Armour\n19 January 2023 / 13 March 2023 by Georgie Armour\n3 January 2023 / 13 March 2023 by Georgie Armour\n2 December 2022 / 13 March 2023 by Georgie Armour\nLast night Arundel & Walberton voters rewarded Green candidate Cllr Steve McAuliffe with an astounding 48% of their votes. Cllr McAuliffe received 873 votes to the Conservatives 549. Labour received 407 votes. It is the Green Party’s second win in 12 weeks. Cllr Sue Wallsgrove won the Barnham by-election on September 8, 2022. Arun District […]\n18 November 2022 / 13 March 2023 by Georgie Armour\nNational Highways has released the latest consultation documents on the controversial Grey Route, and the news for Fontwell and West Walberton is concerning local residents. National Highways own figures show Fontwell Village and Eastergate Lane in particular will experience rat-running, increased traffic flows on narrow roads and all of the associated air pollution this causes […]\n22 October 2022 / 13 March 2023 by Georgie Armour\n28 September 2022 / 13 March 2023 by Georgie Armour\n9 September 2022 / 13 March 2023 by Georgie Armour\nParish Councillor Sue Wallsgrove has won the Barnham by-election, joining another Green Councillor – Isabel Thurston – to represent Barnham ward on Arun District Council. Sue has lived in the villages of the Barnham ward all her life. Following her career in the Social Services Finance Team at West Sussex County Council she has been […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_anandamayi-mem/content_80.html": "16 August 2024 / 16 August 2024 by Anandamayi Mem\nLike so many in our beloved country we have been appalled to see the recent outburst of far-right racist and political violence in towns and cities all over England. The attacks on mosques and hotels accommodating asylum seekers have been especially shocking. For a good summary of how the political violence developed in the aftermath […]\nRead more »\n5 April 2024 / 5 April 2024 by Anandamayi Mem\nFor the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_08_21_august-2024-newsletter/content_21.html": "Welcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green!\nWe have all been shocked and saddened by the tragic events in Southport, and the exploitation of this by far right groups across the country. Please see here for the national Green party’s statements from Amanda Onwuemene (Green Party Spokesperson for Policing and Domestic Safety) and Sian Berry (MP for Brighton Pavilion).\nIn response to the growing toxicity in some areas of social media, we have recently taken the decision to remove our local party’s X (formerly Twitter) account. Please find us instead on Facebook, You Tube, TikTok and Threads.\nLocally, our councillors and party officers have released a full Unity Statement on our website.\nLocal news and campaigns\nAfter the excitement of the general election, we are now focusing on the 2025 West Sussex county elections. We’re hoping to build on our recent successes, and continue to increase the number of representatives from the Green party. The more Greens elected, the stronger the voice for our environment! If you’re interested in getting involved, please contact us.\nThe new government are running a consultation on reforming the National Planning Policy Framework, with a deadline of 24 September. Our local councillors are looking closely at the proposals, and are particularly concerned about statutory housing targets – as both Arun and Chichester have real difficulties finding land for new builds. In addition, we want to emphasise that inadequate social housing cannot continue – we need sustainable, future-proofed and affordable housing for everyone.\nOur councillors are also concerned about the government announcement on dropping the Winter Fuel Allowance unless you have claimed a means tested benefit. This is likely to cause an increase in poverty amongst pensioners, as being just £1 over means you miss out on the whole Allowance. In addition, about 1 million pensioners do not claim – so will also miss out. When you are older or recently bereaved it can be hard to understand the complex system and make a claim. We will continue to push for a better and fairer system, including a universal basic income.\nWe were pleased to hear that the long proposed and delayed A27 bypass plans have now been scrapped by the new government. Our local councillors and members have fought hard against this proprosal, and we champion both sustainable, affordable, active travel schemes and the re-nationalisation of public transport. We’re pleased that this expensive and damaging road-building project has finally been cancelled.\nEvents\nOver the coming months we’ll be getting our positive Green message out to as many local people as possible. Can you help? Our councillors, members and volunteers will be delivering leaflets, distributing 60 second surveys, and canvassing across all our wards. If you can help, please sign up here.\nWe also have two social events coming up, to encourage members – new and old – to come and say hello. Why not join us Adrian, we’d love to see you!\nSunday 25 August, 9.30am / 11am.\nSocial meet-up in Littlehampton.\nCome and join us for a coffee and chat in The Beach Cafe, Sea Road, Littlehampton, BN16 2NA (opposite The Wave leisure centre). Some of us will also be helping with their monthly litter pick along the coast beforehand. To join, please meet at 9.30am by the Shack, where the grabbers, gloves and bags are all provided. A member of the Beach team will lead the clean. After the beach clean we’ll have a coffee in the cafe, from around 11am. It can get busy, so please sign up to let us know to look out for you!\nFriday 20 September, 7pm.\nSocial meet-up / Green policy discussion online.\nJoin us from the comfort of your own home, via Zoom. We will choose a different area of Green interest to discuss each month, and this will be a relaxed and welcoming space to get together. The topic for our next discussion is: housing and planning. Our local councillors will provide some relevant context on issues in Arun and Chichester, and everyone is welcome to contribute their ideas and experience. Please sign up here for the Zoom link.\nAnd some Green events further afield:\nFriday 6 – Sunday 8 September.\nGreen Party autumn conference in Manchester and online.\nFind out more details, and book your tickets on the national party website. This will be a great chance to get together with other national members, following our fantastic election results.\nSaturday 14 September, 10am – 4pm.\n“We need to talk about water” in Havant.\nEvent organised by our friends in Havant Green Party at Havant Pallant Centre, The Pallant, Havant, PO9 1BE. To engage, inform and facilitate networking between groups who are concerned about the various challenges around water from the pollution and over abstraction of the Ems, on the Hampshire / West Sussex border, the project to build an effluent recycling water treatment plant and the pollution of the three harbours, Chichester, Langstone and Portsmouth. More details and tickets here.\nIf you can, please plan your journeys on public transport. If you are able to offer / require a lift share to any of the events, please contact us.\nNext branch meetings:\nMonday 9 September, 7pm on Zoom.\nTuesday 8 October, 7pm on Zoom.\nWednesday 6 November, 7pm on Zoom.\nAll members are welcome to join us, and non-members can be admitted by prior arrangement.\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok and Threads\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. If you can help out, please click here or follow the QR code.\nAll support is very gratefully received. Please include your last name and postcode as a reference, so we know who to thank.\nA big thank you again to everyone working so hard on the Green campaign!",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_news_page_2/content_9.html": "Greens respond to Ofwat price rise green light 2 January 2025 / 2 January 2025 by adrianmorris Read more »\nGovernment’s New Planning FrameworkNew planning framework “panders” to profit driven private housing developers say Greens 17 December 2024 / 17 December 2024 by adrianmorris The government’s new planning framework, “fails to tackle the housing crisis head on and instead panders yet further to the interests of private developers whose main interest is lining their pockets,” Green Party co-leader and MP Adrian Ramsay has warned. Read our response in full here. Read more »\nDecember 2024 Newsletter 17 December 2024 / 17 December 2024 by adrianmorris Welcome to our December 2024 newsletter Thanks for your support in 2024… See you in 2025! A huge thank you to everyone who has supported the Green party this year. Every action makes a difference: from talking to others about the green issues that matter, to being one of our local volunteers or councillors. This […] Read more »\nClimate Adaption 12 December 2024 / 12 December 2024 by adrianmorris In the Commons, Green MP Ellie Chowns challenged the government on adaptation in light of the havoc wreaked by Storms Darragh and Bert. She asked, “Given the strong evidence that links increasing frequency and severity of storms to climate change, can I ask what’s the minister’s response to the comments of Emma Pinchbeck, the new […] Read more »\nSouthern Water’s “Water Resources Management Plan” 12 December 2024 / 12 December 2024 by adrianmorris Arun and Chichester Green Party have responded to the consultation on Southern Water’s “Water Resources Management Plan”. You an read our response at https://docs.google.com/document/d/1UO4g00yUIoomgHqmzsjWDS8ztPzeT8XDXLMjfj9T2iw/edit?usp=sharing You can watch our guest speaker, Tracey Viney, give her excellent presentation on the plans here. Read more »\nNovember 2024 Newsletter 15 November 2024 / 15 November 2024 by adrianmorris Welcome to our November 2024 newsletter! Your local Green team We’re delighted to have elected a fantastic team of local party officers at our recent AGM. Please see our website for more details, or come along to our next branch meeting and say hello! Without major donors and funders, the Greens rely on the time […] Read more »\nOctober 2024 Newsletter 16 October 2024 by adrianmorris Welcome to our October 2024 newsletter! Making a difference We already have many hard-working Green councillors in both Arun and Chichester. Next year, the West Sussex County Council elections are taking place, and we plan to get even more Greens elected. Greens believe in supporting all our communities across the region. We offer Real Hope […] Read more »\nChichester Green News 11 October 2024 / 14 October 2024 by adrianmorris October 2024 : Issue 14 https://chichesterarun.greenparty.org.uk/wp-content/uploads/sites/212/2024/10/Autumn-newsletter-2024.pdf Can you help with newsletter delivery? We will be delivering this newsletter to Chichester doorsteps from now. If you can help please email contact@chichesterarun.greenparty.org.uk Lunch and tea provided! Read more »\nSeptember 2024 Newsletter 16 September 2024 / 16 September 2024 by adrianmorris Welcome to the September 2024 newsletter from your local Green Party. Thank you for being part of our positive campaign for Real Hope and Real Change. Green Talk – housing and planning A huge area of concern for all of us is the need for sustainable and appropriate planning developments. What is the current situation […] Read more »\nAugust 2024 Newsletter 21 August 2024 / 21 August 2024 by adrianmorris Welcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! We have all been shocked and saddened by the tragic events in Southport, and the exploitation of this by far right groups across the country. Please see here […] Read more »",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_category_uncategorised_page_5/content_85.html": "8 June 2023 / 12 June 2023 by Georgie Armour\nRead more »\n25 May 2023 / 25 May 2023 by Georgie Armour\n11 May 2023 by Georgie Armour\n11 May 2023 / 11 May 2023 by Georgie Armour\n15 April 2023 by Georgie Armour\n5 April 2023 / 11 May 2023 by aledmorris\n25 March 2023 / 10 April 2023 by Georgie Armour\n15 March 2023 / 15 March 2023 by Georgie Armour\nTake an afternoon stroll around the Whyke area of Chichester this Saturday 18 March, 2023 and you may notice it’s a little bit tidier. That’s because Saturday morning between 10.30am and 12.30pm local residents will be out in force for a community litter pick around the Whyke area. Everyone is welcome and hot drinks and […]\n13 March 2023 / 13 March 2023 by Georgie Armour",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_06_07_forget-tactical-voting-and-send-a-message-to-the-next-government-says-greens-chichester-candidate/content_46.html": "Forget tactical voting and send a message to the next government says Cllr Tim Young, Green Party parliamentary candidate for Chichester, who is urging voters to use this election to demand immediate action on the climate before it’s too late.\nWhilst Chichester has long been considered a safe Conservative seat, there is a growing sense of disappointment with the status quo and politicians who are out of touch and under delivering.\n“As a coastal community, we are already experiencing the negative impacts of the current government’s failure to act on the environment,” says Young. “In the past year alone, residents have experienced devasting flooding in their homes and seen beaches polluted with raw sewage. Gillian Keegan is supposed to represent the interests of Chichester residents. And yet her voting history shows she doesn’t share their priorities at all. Perhaps the most famous example is the fact that she voted to allow water companies to discharge sewage into our rivers and seas. The Green Party on the other hand is pushing for water companies to be brought back into public hands to prevent this from happening.”\nAs well as climate and nature, the Green Party will be fighting to protect the NHS, leading the drive for a safe, warm home for everyone and pushing for immediate measures to address the alarming increase in the cost of living.\nYoung continued, “I would urge anyone looking for change to forget about tactical voting and think about the message they want to send to the next government. The Labour Party have abandoned their environmental promises. Every Green vote counts as a reminder that the electorate cares deeply about a cleaner, fairer future for all.”\nA father of two from Midhurst, Young works for a provider of solar projects for industry and has represented Chichester South on Chichester District Council since May 2023. A keen runner, Young has completed several marathons.\n“We live in a beautiful part of the world and I am passionate about protecting it,” says Young. “As a green energy expert, working in the renewables sector, I can assure you that not only is a green future our only chance of survival – it can also be an exciting and prosperous one.“\nLocal Green Party Spokesperson, Ann Stewart says: “As a hard-working Chichester District Councillor with a 100% attendance record, Tim is a very strong candidate. He will apply the same energy and commitment to representing the Chichester constituency in Parliament as he does at a local government level. Tim and the Green Party are promising real hope for real change.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_02_04_watch-our-biodiversity-net-gain-bng-talks/content_48.html": "Biodiversity Net Gain (BNG), Nature Opportunity or Planning Fig Leaf?\nWatch or listen to the Jan 24th 2024 talks on BNG held at the Friends Meeting House, Priory Road to find out what impact this new planning legislation will have.\nNational housing targets are leading to urban development expanding deeper into the countryside. Government says that planning rules aimed to prevent increasing loss of nature, whilst also permitting development, can be achieved via BNG legislation. So will BNG work? If so, how well could it work? And if we build it, will wildlife come?\nCouncillor Steve McAuliffe is an ex-British Army Air Corps soldier and a retired ecologist, arborist and environmental management consultant. He graduated from the University of Sussex with a BSc (Hons) in Ecology and Conservation and recently attained a Master of Research Degree from the University of Brighton where Steve studied Behavioural Ecology specialising in protected species legislation and anthropogenic impact mitigation. Steve also represents Arun District Council on the South Downs National Park Authority. Steve gave the first talk on BNG which is available from the embedded YouTube video below.\nAlex Briggs kindly gave the second of four BNG talks and spoke on behalf of Weald to Waves. Alex’s talk can be viewed from the embedded YouTube video below.\nOliver Gammon (Environment Officer at Chichester District Council) shared his broad knowledge of environmental planning matters and delivered the third BNG talk. His talk can be viewed from the embedded YouTube video below.\nWe were delighted to also be joined by Tony Whitbread (President of Sussex Wildlife Trust). Tony gave the final of the four BNG talks. Tony’s talk can be viewed from the embedded YouTube video below.\nAll the speakers provided valuable insights and knowledge on the topic of local biodiversity. The event finished with a questions and answers session where our expert panel addressed the audiences concerns and queries. The Question and Answer session can be viewed in the embedded YouTube video below.\nNature cannot survive in fragments. We are establishing a 100-mile nature recovery corridor across Sussex. Connecting our fragmented landscape will boost biodiversity, capture carbon, enhance food production and enrich our rural economy. Please hear more about this Sussex network of farmers, land managers, councils, researchers, wildlife charities, schools, gardeners and community groups by watching or listening to the content provide in the embedded videos above.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_01_30_response-to-local-plan/content_52.html": "Chichester & Arun Green Party is frustrated by the lack of ambition in the local plan with regard to the climate crisis and the local environment. Local Greens point to the lack of properly adequate walking and cycling provision to prevent us from building anything but car-dependent enclaves, and to the ‘solution’ to tanker away the sewage from developments without facing up to bigger truths about sewage pollution.\nBut perhaps more worryingly, Green councillors are also concerned that the huge gap between what is happening on the ground and what the vision sets out means the plan bears little relation to the reality that residents experience or that the planners are aiming for.\nCllr Sarah Sharp (Green, Chichester South) said: “Whatever the fine words in the plan, I am not convinced the vision will achieve anything like what it aims for. Growth north of Chichester has been ruled out in order to ‘maintain the rural nature of the area’. Sadly, this rule doesn’t seem to apply to communities in the south. I am concerned that this strategy won’t prevent coastal squeeze, and our harbour will continue to be damaged by development. Meanwhile what is described as ‘sustainable growth close to the city at the east of Chichester’ will be far from sustainable. We are already building effectively car-dependent dormitories with few facilities at their heart. There is nothing in the Spatial Strategy that encourages me to believe that this will change. Along the A259, despite best efforts, we are losing prime-grade fields and the sense of separate villages. Effectively, on our watch, we are sitting back and allowing large tracts of rural Sussex to become a long line of urban sprawl.”\nLocal Greens question whether enough has been done to urgently reduce emissions in line with keeping below 1.5 degrees of global warming; to ensure we have enough renewable energy; and to meet biodiversity commitments. They fear our recent experience of road closure and disruption due to flooding may become the norm. Air pollution is another concern.\n“My residents in Chichester South are concerned by air and noise pollution from traffic and would like stronger policies than this plan can deliver,” said Cllr Sharp. “While this Plan is consistent with UK statute, this lags well behind World Health Organisation standards.”\nPointing to realities not yet acknowledged, Greens believe we simply don’t have enough resources to go on consuming in the way we are and that we need to be planning for more reuse centres/repair cafes and sharing via means such as a Library of Things.\nConcluding and acknowledging all the suggestions not taken up and opportunities missed, Cllr Sharp said: “I just wish the plan could go a little bit further to protect and enhance the special area we live in and prepare our children and grandchildren more in the light of all that climate change might throw at our district.”\nLocal Greens’ objections and Cllr Sharp’s excellent comments regarding the Chichester District local plan are featured in this article by Sussex World (Observer series).",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_tag_rwanda/content_90.html": "Our Work with Chichester Welcomes Refugees 5 April 2024 / 5 April 2024 by Anandamayi Mem For the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the […] Read more » Chichester Racism Refugees Rwanda",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_03_05_green-party-demands-ambitious-action-in-wake-of-climate-change-committee-report/content_10.html": "As the Climate Change Committee publishes its 7th carbon budget [1], the co-leader of the Green Party, Adrian Ramsay MP, has demanded the Government ensure ambitious climate action isn’t delayed any further – and for polluters to pay the highest price, not the poorest in our communities.\nAdrian Ramsay MP said: “Today’s advice from the Climate Change Committee (CCC) makes clear that a climate safe future is still within our grasp – and that the cost of not reducing climate emissions will be far higher for our economy than the cost of investment in net zero. Crucially, we need to see the Government make investment choices that result in households benefiting financially from climate action too – both by ensuring everyone can access renewables and energy efficiency and because they are paying lower bills. The public are clear that they want to see the worst climate polluters pay, and we need to make sure that the costs of climate action never fall on those least able to afford it.\n“A thriving green economy is also vital if we are to prevent climate deniers, like Reform, from weaponising the mass destruction of climate chaos. Instead, we must help the most vulnerable and build resilience in communities to adapt to climate breakdown.”\nHe continued: “Without an immediate acceleration of climate ambition, our economy, national security and environment are all at serious risk. That’s why we are disappointed not to see the CCC go even further on measures to reduce energy demand. In the face of impending airport expansion decisions by this Labour government, more ambitious policy is urgently needed to keep the aviation sector in check. Their advice shows strong public support for limiting airport expansion and introducing a frequent flier levy where the small percentage of the population who take the vast majority of the flights have to pay more .\n“The CCC have shown that a positive, fairer, jobs-rich, greener future is possible, and they have set a clear pathway for the Government to follow. Now, we need the Government to step up, stop the vested interests who are intent on delaying, and show the ambition and leadership this moment demands.”\nNotes",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_11_19_parliamentary-candidate-hustings/content_55.html": "On Thursday 16 November the Chichester & Arun Green Party met for the 2023 AGM, which included a hustings for our parliamentary candidates for the next general election for Chichester (Tim Young) and Bognor & Littlehampton (Carol Birch). For those members who couldn’t make it in person or virtually on the night you can watch the hustings below before casting your vote. As we only have one candidate for each constituency the options are to vote for that candidate, or to vote to reopen the nomination process. Members should have received a voting link from OpaVote through which to cast their vote.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_tag_racism/content_72.html": "Our Work with Chichester Welcomes Refugees 5 April 2024 / 5 April 2024 by Anandamayi Mem For the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the […] Read more » Chichester Racism Refugees Rwanda",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_02_21_february-2025-newsletter/content_7.html": "Welcome to our February 2025 newsletter\nGreens win extra protections for Arun waterways\nOn 30 January, the Environment Committee of Arun district council (chaired by Green councillor Sue Wallsgrove), passed a motion to explore ways to improve river health, water quality and biodiversity.\nThis motion was originally introduced to the council by Green councillor Steve McAuliffe, who was also invited to speak in support.\nAll the main rivers in Arun, including the River Arun, are currently classed as having moderate or poor condition by the Environment Agency. Likewise, our streams and rifes face daily pressure from sewage pollution, urban and agricultural runoff and fly tipping.\nAlthough there are limited legal powers for district councils to improve rivers, there are many things that can be done at department level. This motion now means that officers, committees and council partners will be encouraged to come up with a wide range of simple ideas for positive impacts.\nWhat next for county council elections?\nThank you to all the concerned members who have contacted us about the upcoming changes to local government. Although we have now had confirmation that Sussex will be a ‘fast-track’ area, the actual details of this are still to be worked out. Please be wary of some of the scare-mongering that is going on in various places!\nAs your local Greens, we will be pressing for local voices to be heard throughout the process. We’ll be working hard to ensure that we can all benefit from a more positive and democratic vision of devolution, rather than being subsumed into a huge unitary authority.\nThe May 2025 elections will NOT be going ahead. But we will continue to campaign, and encourage members to get involved in their local areas too. Please get in touch for more details:\nLocal litter pick and social meet\nOn the last Sunday of every month, local members join the regular litter pick on Littlehampton beach. This is followed by a coffee and a chat in The Beach Cafe, Sea Road, Littlehampton (opposite The Wave leisure centre).\nThe next meet will be: Sunday 23 February\nTo join us on the beach clean, please meet at 9.30am by the Shack, where the grabbers, gloves and bags are all provided by the Cafe (as part of Surfers Against Sewage). A member of the Beach team usually leads the clean. Afterwards, we’ll be in the cafe, from around 11am. Please RSVP so we know to look out for you!\nMembers updates and events\nEach month we hold an online policy discussion for members. It’s a chance to look at an important and topical area in more depth, in a relaxed and respectful setting. On Friday 21 February our next topic is: solar power and we are delighted to have Tom Broughton (from Meadow Blue) and our own councillor Tim Young talking with us. They both have a wealth of experience and knowledge on this subject. Solar is an important topic locally, with controversial plans for the South Mundham Solar Farm. It’s important that we understand and discuss these issues as a local party. Please click here to register.\nLocal councillors and members will be helping to plant a new wildlife hedge in Bognor Regis on Wednesday 19 February. This is to celebrate the fourth year of the Arun district council’s tree planting strategy, and will help increase wildlife corridors and biodiversity in the area. More details on the council website, or please contact us.\nOur next branch meeting will be on Monday 10 March, 7pm on Zoom. All members are welcome to join us, and non-members can also be admitted by prior arrangement. We look forward to seeing you there.\nAs spring slowly arrives, members are getting involved with their nearest Toad Crossing Patrols. Would you like to help? More details here, or please contact us.\nWe were very sorry to hear of the sad loss of local campaigner Philip Davidson. Many of you will have known him for his activism and support for green causes across our local area. Our thoughts are with his loved ones.\nCan we help you? Want to join us? Have skills to share?\nKeep in touch with your local Chichester and Arun Greens\nJoin the party: join.greenparty.org.uk\nAsk a question: contact@chichesterarun.greenparty.org.uk\nKeep up to date: Find us on Facebook, You Tube, TikTok, Threads and NEW: now on BlueSky!\nHelp us grow: We rely on one off donations or regular standing orders to help us cover the cost of our local campaign work. All support is very gratefully received. Please always include your last name and postcode as a reference, so we know who to thank.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_contact/content_16.html": "Skip to content\nSkip to footer\nChichester & Arun\nMenu\nNews\nEvents\nPeople\nAbout us\nVideos\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nGet in touch\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_news_page_4/content_41.html": "Our Work with Chichester Welcomes Refugees 5 April 2024 / 5 April 2024 by Anandamayi Mem For the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the […] Read more » Chichester Racism Refugees Rwanda\nGreens’ Arundel & South Downs candidate ready to take on Conservatives at general election 28 March 2024 / 8 June 2024 by Georgie Armour A hard-working community champion and environmentalist with a wealth of knowledge on local issues has been selected by the Green Party as its MP candidate for Arundel & South Downs. Steve McAuliffe is an ex-British Army Air Corps soldier whose 20-year career in ecology and environmental management consultancy has spanned both industry and politics. He […] Read more »\nWatch the Biodiversity Net Gain (BNG) talks 4 February 2024 / 7 February 2024 by Mark Record Biodiversity Net Gain (BNG), Nature Opportunity or Planning Fig Leaf? Watch or listen to the Jan 24th 2024 talks on BNG held at the Friends Meeting House, Priory Road to find out what impact this new planning legislation will have. National housing targets are leading to urban development expanding deeper into the countryside. Government says […] Read more » FMH Talk Video\nProtecting People and Plants from Pesticides 10 December 2023 / 7 February 2024 by Georgie Armour At the Chichester & Arun Green Party 2023 AGM on Thursday 16 November Josie Cohen from Pesticide Action Network gave an excellent talk on the egregious and pernicious effects of pesticides on our soils, rivers, seas, wildlife, crops and health. Those who missed it can watch Josie’s talk and a Q&A below. Read more »\nParliamentary candidate hustings 19 November 2023 / 10 December 2023 by Georgie Armour On Thursday 16 November the Chichester & Arun Green Party met for the 2023 AGM, which included a hustings for our parliamentary candidates for the next general election for Chichester (Tim Young) and Bognor & Littlehampton (Carol Birch). For those members who couldn’t make it in person or virtually on the night you can watch […] Read more »\nAGM & Pesticides Action Network talk 3 November 2023 / 11 December 2023 by Georgie Armour Read more »\nArundel ‘Chord’ would be transformational, local Greens tell Southern 27 September 2023 / 27 September 2023 by Georgie Armour Read more »\nGreen Talk: Taking legal action for the environment 15 September 2023 / 11 December 2023 by Georgie Armour Read more »",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_news_page_3/content_32.html": "A Response to Far-Right Political Violence 16 August 2024 / 16 August 2024 by Anandamayi Mem Like so many in our beloved country we have been appalled to see the recent outburst of far-right racist and political violence in towns and cities all over England. The attacks on mosques and hotels accommodating asylum seekers have been especially shocking. For a good summary of how the political violence developed in the aftermath […] Read more »\nJuly 2024 Newsletter 11 July 2024 by adrianmorris Your part in the Green success story After months and weeks of campaigning, we were all delighted to see four Green MPs elected to parliament and a massive show of support for all our local candidates. And we want to say a HUGE THANK YOU to every one of you, for your support. From voting, […] Read more »\nGreening Steyning Climate Hustings 27 June 2024 / 1 July 2024 by adrianmorris Green Parliamentary Candidate Cllr Steve McAuliffe wins hearts and minds at the Greening Steyning Climate Hustings Last night, Wednesday 26 June, all six candidates for the Arundel and South Downs constituency participated in a ‘Question Time’-style Climate Hustings, organised by Greening Steyning. The audience in the packed Drama Hall at Steyning Grammar School heard a […] Read more »\nArundel & South Downs not a ‘safe seat’ say Greens 24 June 2024 / 27 June 2024 by adrianmorris Arundel & South Downs not a ‘safe seat’ say Greens Having been pulled out of the BBC Radio 4 PM programme’s Election Tombola last week to feature on this week’s episodes, the constituency of Arundel & South Downs located in rural West Sussex, often reported as a ‘safe seat’ for the Conservatives, will be in […] Read more »\nJune 2024 newsletter – Election Special 17 June 2024 / 17 June 2024 by adrianmorris Welcome to the monthly newsletter from your local Green Party. Finally the General Election has been called – and we’re ready for Real Hope and Real Change Your Green candidates We are proud to be standing three excellent Green candidates in the General Election. On Thursday 4 July you will be able to vote for […] Read more »\nTactical voting? Vote Green instead. 7 June 2024 / 8 June 2024 by Georgie Armour Forget tactical voting and send a message to the next government says Cllr Tim Young, Green Party parliamentary candidate for Chichester, who is urging voters to use this election to demand immediate action on the climate before it’s too late. Whilst Chichester has long been considered a safe Conservative seat, there is a growing sense […] Read more »\nLocal champion fighting to save telephone service for rural residents 7 June 2024 / 8 June 2024 by Georgie Armour Green Party Parliamentary Candidate for Arundel & South Downs has raised concerns for vulnerable residents in rural communities after Ofcom and the UK government agreed to let BT switch off landline services leaving only broadband services available. Steve McAuliffe, Arun District Councillor, is leading calls for BT to engage with villages and vulnerable rural residents […] Read more »\nMay 2024 Newsletter 13 May 2024 / 13 May 2024 by adrianmorris Welcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local news We had a fantastic turnout for our recent Green Talk in Barnham. Local residents, Green councillors and members all got together to speak, listen, and share […] Read more »\nBarnham Green Talk Videos 27 April 2024 / 8 June 2024 by Mark Record Chichester and Arun Green Party held a series of talks and discussions at Barnham community hall on the evening of the 19th April including Jonathan Kent our Green Party Sussex Police and Crime Commissioner candidate. Jonathan Kent began with a talk explaining why he is standing as a candidate to become the Sussex Police and […] Read more »\nApril 2024 Newsletter 16 April 2024 / 16 April 2024 by adrianmorris Welcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! Local newsA number of our members took part in the successful campaign to get the Broadford Bridge borehole extension refused. West Sussex County Council planning meeting listened to […] Read more »",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_author_adrianmorris_page_2/content_34.html": "2 January 2025 / 2 January 2025 by adrianmorris\nRead more »\n17 December 2024 / 17 December 2024 by adrianmorris\nThe government’s new planning framework, “fails to tackle the housing crisis head on and instead panders yet further to the interests of private developers whose main interest is lining their pockets,” Green Party co-leader and MP Adrian Ramsay has warned. Read our response in full here.\nWelcome to our December 2024 newsletter Thanks for your support in 2024… See you in 2025! A huge thank you to everyone who has supported the Green party this year. Every action makes a difference: from talking to others about the green issues that matter, to being one of our local volunteers or councillors. This […]\n12 December 2024 / 12 December 2024 by adrianmorris\nIn the Commons, Green MP Ellie Chowns challenged the government on adaptation in light of the havoc wreaked by Storms Darragh and Bert. She asked, “Given the strong evidence that links increasing frequency and severity of storms to climate change, can I ask what’s the minister’s response to the comments of Emma Pinchbeck, the new […]\nArun and Chichester Green Party have responded to the consultation on Southern Water’s “Water Resources Management Plan”. You an read our response at https://docs.google.com/document/d/1UO4g00yUIoomgHqmzsjWDS8ztPzeT8XDXLMjfj9T2iw/edit?usp=sharing You can watch our guest speaker, Tracey Viney, give her excellent presentation on the plans here.\n15 November 2024 / 15 November 2024 by adrianmorris\nWelcome to our November 2024 newsletter! Your local Green team We’re delighted to have elected a fantastic team of local party officers at our recent AGM. Please see our website for more details, or come along to our next branch meeting and say hello! Without major donors and funders, the Greens rely on the time […]\n16 October 2024 by adrianmorris\nWelcome to our October 2024 newsletter! Making a difference We already have many hard-working Green councillors in both Arun and Chichester. Next year, the West Sussex County Council elections are taking place, and we plan to get even more Greens elected. Greens believe in supporting all our communities across the region. We offer Real Hope […]\n11 October 2024 / 14 October 2024 by adrianmorris\nOctober 2024 : Issue 14 https://chichesterarun.greenparty.org.uk/wp-content/uploads/sites/212/2024/10/Autumn-newsletter-2024.pdf Can you help with newsletter delivery? We will be delivering this newsletter to Chichester doorsteps from now. If you can help please email contact@chichesterarun.greenparty.org.uk Lunch and tea provided!\n16 September 2024 / 16 September 2024 by adrianmorris\nWelcome to the September 2024 newsletter from your local Green Party. Thank you for being part of our positive campaign for Real Hope and Real Change. Green Talk – housing and planning A huge area of concern for all of us is the need for sustainable and appropriate planning developments. What is the current situation […]\n21 August 2024 / 21 August 2024 by adrianmorris\nWelcome to the monthly newsletter from your local Green Party. Including updates on our Councillors’ hard work, members’ campaigning, dates for your diary, and all things Green! We have all been shocked and saddened by the tragic events in Southport, and the exploitation of this by far right groups across the country. Please see here […]",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2025_03_05_help-us-build-the-next-generation-of-leadership/content_12.html": "Later this week, 30 young activists will be coming together for the Young Greens flagship training programme, 30 Under 30. This programme is essential for equipping the next generation of Green leaders with the skills and knowledge needed to organise in their communities and lead the way for real change. But it can only happen with your support.\nTo make sure we are holding a lacklustre Labour to account and combatting the division and harmful politics of Reform, we need to have organised and committed activists on the ground across the country. This is why we need 30 Under 30. Through it we have developed a strong and lasting network of changemakers delivering for climate and social justice. Counted amongst the programme’s graduates are campaigners, councillors, and now, an MP: “My time on 30 Under 30 was a valuable step in my journey within the Green Party. When I started the programme I was a councillor, and by the time it ended, I was part of the leadership team of my councillor group in Bristol. Throughout that time I was developing skills in public speaking, gaining valuable lessons in policy-making and learning more about how the Government and the Green Party work. 30 Under 30 introduced me to a diverse range of people from across England and Wales who came together with the joint ambition of developing as an activist within the party. This programme has also helped countless other Young Greens to go on to make an impact inside and outside of the Green Party. From our Migrant & Refugee Support Spokesperson Benali Hamdache, to cllr Tor Pingre in Worcester. Each year the Young Greens train up activists to become leaders and represent their communities and our party. It is truly one of the most inspiring parts of our party and I am excited to see where it goes next!” Carla Denyer MP\nBuilding a strong movement of dedicated, progressive activists is crucial if we are to continue the success we saw in 2024. We cannot wait whilst billionaires buy their way into politics and climate deniers organise in the name of ever increasing profit. We need your support now more than ever.\nTo make 30 Under 30 more successful than ever before, we are raising enough to fund 10 people through the programme. Every bit of your generosity goes on to have an immeasurable impact in communities across the country and helps to ensure the future of the Green movement in England and Wales.\nImagine if we had 10 more Carla Denyers, Benali Hamdaches and Tor Pingrees. Only with your help can we make this happen.\nMany thanks, Callum Clafferty, Luanne Thornton & Olli Watkins Young Green Co-Chairs & Young Green Treasurer",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_10_10_green-councillor-supports-evicted-residents/content_81.html": "At the end of August 2023, the residents of a group of properties in Freeman Close, just off Eastergate Lane in Walberton, were given three months’ notice before eviction by Home Farm Trust. This cluster of small bungalows is home to a community of 23 residents with mixed and varied needs, some of whom have lived there all their adult lives. During the day, they are joined by up to 50 others who occupy themselves on site, helped by staff members and one another. They run an orchard as a commercial venture, selling apple juice, and at this time of year local people can take apples for pressing.\nMel Penycate, Green District Councillor for Arundel and Walberton, is supporting the residents, their families and many members of the local community who are deeply upset about this unprecedented sudden decision.\n“One lady has lived there for fifty years, since the site was first obtained for its present use,” says Cllr Penycate. “The notice of eviction has caused great panic and distress. It came completely out of the blue.”\nCllr Penycate and those fighting this injustice are lobbying for extra time, and for the Home Farm Trust to consider offers from other social care providers who would keep the residents in their homes.\n“We understand there is an offer of this kind on the table and hope that those running the Home Farm Trust will act with kindness and generosity towards these vulnerable members of our community,” says Cllr Penycate.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2022_09_09_another-green-for-arun-district-council/content_22.html": "Parish Councillor Sue Wallsgrove has won the Barnham by-election, joining another Green Councillor – Isabel Thurston – to represent Barnham ward on Arun District Council. Sue has lived in the villages of the Barnham ward all her life. Following her career in the Social Services Finance Team at West Sussex County Council she has been working hard for the community as a Barnham & Eastergate Parish Councillor. Sue is passionate about protecting the unique character and interests of the local area.\nCllr Wallsgrove says: “Our precious Arun villages are incredibly special places. We are lucky enough to have strong communities, but our area feels neglected and under threat from money-making ventures. I will speak up against plans for unsustainable developments in our area: like 4,000 new houses without adequate infrastructure! This will massively impact our lives. We must address the noise, air pollution, traffic and speeding that blight our villages and only build sustainable affordable houses in the right places.”\nThe choice for local voters was Sue Wallsgrove or a Conservative. Cllr Wallsgrove will bring much needed balance to the Council and add to a desperately needed fresh Green outlook. Unlike the Conservatives, Greens aren’t told how to vote so she’ll be free to be an independent voice, able to speak up for her area.\nCommenting on the win, Arun Area Green Party coordinator, Carol Birch said: “Following the landmark local election results in May, where Greens gained 78 seats, from both Tories and Labour, the Green Party has become credible alternative to the Conservatives up and down the country. Voters are looking for a positive alternative to the establishment parties, and finding it in the Green Party. Sue will put forward fresh thinking and bold solutions for the problems facing Barnham and work hard for her community.”\nCllr Wallsgrove, and her two rescue Springer Spaniels, Rolo and Nico, love to walk in Slindon Woods. She is a keen vegetable gardener and an active environmental campaigner. Organised and hardworking, she loves getting things done within the community.\n“Through working with Sue at Barnham and Eastergate Parish Council, I’ve got to know her really well,” said Cllr Isabel Thurston. “Sue’s strong community links and experience of working with different groups of people, both in her professional and volunteering capacity, means that I have no doubt she would make an excellent councillor.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_03_25_enough-is-enough/content_65.html": "Members of the Chichester and Arun Green party joined residents lining the A259 today as part of the Mayday Action Group-organised protest against the destruction of Chichester Harbour and its villages from overdevelopment and the regular release of raw sewage into the harbour, among other threats.\nCllr Sarah Sharp (Green, Chichester South), cycled along the route with members of Chi Cycle, before stopping at Highgrove Farm, the proposed site for 295 houses that is much hated by most local people, to chat with residents and the co-chairs of the Bosham Association.\nChichester and Arun Green Party shares local campaign groups’ belief that the area of outstanding natural beauty (AONB) is under severe threat.\nPress officer for the Chichester and Arun Green Party, and candidate for the Harbour Villages ward, Georgie Armour Glasius said: “It’s great to see so many people lining the road today in recognition of what the Green Party has been highlighting for a long time. The prioritisation of profits over people and our environment has led to the shocking pollution of our waterways, to roads ever more congested and to wildlife in peril. Tinkering around the edges isn’t going to cut it. We need a wholesale change of perspective and we need it now.”",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_tag_chichester/content_62.html": "Our Work with Chichester Welcomes Refugees 5 April 2024 / 5 April 2024 by Anandamayi Mem For the last six months activists from Chichester and Arun Green Party have been working with partner organisations to support refugees and asylum seekers who are being accommodated at the Chichester Park Hotel on the Westhampnett Road in Chichester. Reports started to circulate in late September 2023 that the Home Office had started loaning the […] Read more » Chichester Racism Refugees Rwanda",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_03_15_whyke-area-community-litter-pick/content_33.html": "Take an afternoon stroll around the Whyke area of Chichester this Saturday 18 March, 2023 and you may notice it’s a little bit tidier. That’s because Saturday morning between 10.30am and 12.30pm local residents will be out in force for a community litter pick around the Whyke area. Everyone is welcome and hot drinks and snacks will be provided.\nThe meeting point is the Guide Hall, 29 Whyke Lane, Chichester, PO19 7US. Equipment will be provided by participants should wear suitable clothing, sturdy shoes and gardening-like gloves.\nIt will be a great opportunity to meet your local Green representatives and other like-minded people.\nThe litter pick is being organised by Cllr Debbie Carter (Green, Chichester City Council) on behalf of the Chichester & Arun Green Party. Green councillors and members work progressively on local issues to to improve our local environment and improve the lives of all people in Chichester & Arun.\nChichester & Arun Green Party has one County Councillor and five District Councillors as well as representation on Chichester City Council and on Parish Councils around the local area, adding a much-needed voice to the Council chamber to address the critical issues that affect the local environment, as well as working closely with community on events such as this litter pick.\nNeed to know\nWhen: Saturday 18 March, 2023 – 10.30am to 12.30pm\nWhere: Guide Hall, 29 Whyke Lane, Chichester, PO19 7US\nWear: Suitable clothing, sturdy shoes and gardening-like gloves.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2023_04_15_chichester-district-election-campaign/content_61.html": "Chichester Area Greens have finalised the candidates standing in the upcoming elections on Thursday 4 May. A total of 13 Greens will stand across 12 wards. Cllr Sarah Sharp will defend her seat of Chichester South and joining her is candidate Tim Young, who if elected will replace Cllr Heather Barrie who is standing down.\nAs Green councillor for the past four years on Chichester District Council, Sarah has worked tirelessly for the best interests of the people of Chichester South. She worked with local families to save Rumboldswhyke School from closure; helped organise 35 volunteers to support elderly and vulnerable people during the pandemic; collaborated with UK Harvest and St George’s Church to establish a Community Food Hub; and secured tree-planting projects in the area. She holds regular surgeries and has helped many residents who have contacted her with individual problems. Sarah also represents Chichester South at City and County level.\nHoping to join Sarah in representing Chichester South is Tim Young. Tim will be a councillor who will speak up to power, who will speak the truth and get things done. His degree in Politics and career in business has prepared him for the pressure of council business. His current job is selling large-scale solar energy projects, which gives him an extra level of insight when speaking about the environment and energy issues. He is passionate about local issues and tirelessly campaigns for a Greener, fairer future, persuading and influencing decision makers, whether it’s against oil drilling in the Downs or sewage in our rivers and harbour. Tim will be the kind of Councillor who reaches out to people; who listens to people’s concerns and acts on the issues that affect us day to day.\nCandidates standing in a further 11 wards are: Mark Record (Chichester Central), Lee Holmes (Chichester West), Leo Holmwood (Easebourne), David Goss (Fittleworth), Philip Maber (Goodwood), Georgie Armour (Harbour Villages), Stephanie Carn (Petworth), Jack Olley (Selsey South), Andrew Swain (Siddlesham and Selsey North), Derrick Johnson (Southbourne) and Ann Stewart (Westbourne).\nThe Green Party currently has 563 councillors on 172 principal authority councils in England and Wales. It will be defending 281 seats in this year’s local elections in May and will be looking to make further gains across the country.",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_news_page_6/content_17.html": "Zack Polanski visits Arundel 15 February 2023 / 13 March 2023 by Georgie Armour Zack Polanski, Deputy Leader of the Green Party of England and Wales, spoke to a packed room in Arundel last Monday night, as he addressed many issues dear to local residents, such as road building and inappropriate housing developments. He also spoke passionately about the concern shared by many – and certainly judging by the […] Read more »\nDeputy Leader of the Green Party to visit Arundel next week 8 February 2023 / 13 March 2023 by Georgie Armour Read more »\nGreen Party councillors stand with St Richards nurses 19 January 2023 / 13 March 2023 by Georgie Armour Read more »\n£2 cap on bus fares doesn’t go nearly far enough say local Greens 3 January 2023 / 13 March 2023 by Georgie Armour Read more »\nAnother win for Arun Greens! 2 December 2022 / 13 March 2023 by Georgie Armour Last night Arundel & Walberton voters rewarded Green candidate Cllr Steve McAuliffe with an astounding 48% of their votes. Cllr McAuliffe received 873 votes to the Conservatives 549. Labour received 407 votes. It is the Green Party’s second win in 12 weeks. Cllr Sue Wallsgrove won the Barnham by-election on September 8, 2022. Arun District […] Read more »\nBye bye bats, hello 60% more traffic 18 November 2022 / 13 March 2023 by Georgie Armour National Highways has released the latest consultation documents on the controversial Grey Route, and the news for Fontwell and West Walberton is concerning local residents. National Highways own figures show Fontwell Village and Eastergate Lane in particular will experience rat-running, increased traffic flows on narrow roads and all of the associated air pollution this causes […] Read more »\nAnother Green for Arun District Council! 9 September 2022 / 13 March 2023 by Georgie Armour Parish Councillor Sue Wallsgrove has won the Barnham by-election, joining another Green Councillor – Isabel Thurston – to represent Barnham ward on Arun District Council. Sue has lived in the villages of the Barnham ward all her life. Following her career in the Social Services Finance Team at West Sussex County Council she has been […] Read more »",
  "https_chichesterarun_greenparty_org_uk/https_chichesterarun_greenparty_org_uk_2024_06_24_arundel-south-downs-not-a-safe-seat-say-greens/content_25.html": "Arundel & South Downs not a ‘safe seat’ say Greens\nHaving been pulled out of the BBC Radio 4 PM programme’s Election Tombola last week to feature on this week’s episodes, the constituency of Arundel & South Downs located in rural West Sussex, often reported as a ‘safe seat’ for the Conservatives, will be in the spotlight. But there are other reasons this constituency has started to catch the eye of observers. Looking at votes cast in the 2023 local elections across the constituency and covering the new boundaries, the picture places the Green Party in a strong second place:\n- The Green Party received 21,493 votes compared with 24,011 for the Conservatives, 13,803 for the Liberal Democrats and 2838 for the Labour Party. It should be noted that this result was with 8 seats with no Green candidate, whereas the Conservatives stood in all available seats.\n- Across the council wards making up the constituency, the Green Party has 15 councillors, compared with 9 for the Conservatives, 8 for the Liberal Democrats and 0 for Labour.\nAs the incumbent ramps up efforts, perhaps a little too late, the Green Party has been campaigning hard for months. The appetite for new ideas and new energy can be seen in the boards and posters that have been popping up across the new boundaries of the constituency, which now stretches as far west as Midhurst. At the time of writing, a Green Party spokesperson said more than 200 boards had been erected, with more to follow.\nMany people assume that the Liberal Democrats are the obvious challengers in the “blue wall” but the seat is not a target for the Liberal Democrats, who placed 4th in a recent Survation poll, although with Reform taking votes from the Conservatives on the right, they are likely to slip to 5th place. While Labour placed second in the same poll, Labour are not campaigning in Arundel & South Downs and people in the constituency are not accustomed to voting Labour. And with many disaffected Tories vowing to stay home, word on the ground is that the Green Party is set to storm to second place or perhaps better on polling day. Here is a link to the stats behind the Survation poll, which clearly show Greens vying for second place with Labour.\n“It really is all to play for,” says Steve McAuliffe, Green MP candidate for Arundel & South Downs. “I believe we have a chance of taking this constituency from the Conservatives for the first time in decades. Life-long Conservative voters have voted for Green candidates in unprecedented numbers at recent local elections and on the doorstep the response is very positive.”\nA hard-working community champion and environmentalist with a wealth of knowledge on local issues, McAuliffe has already shown that he is a viable option for many Conservatives. In the last 15 months he has won two elections in the affluent and ‘safe’ Tory ward of Arundel & Walberton – the second of which secured a further two Green seats and a clean sweep."
}