{
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_cookies/content_11.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403PF",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_Transport/content_45.html": "Everyone should be able to get from A to B quickly and safely.\nThat's why Graham works hard to make sure we all have the transport links we deserve - whether that's with trains, roads or buses.\nGraham's campaigns on this include bus fares, restoring York to Hull Rail and getting £40m from the Government in improvements for the Jock's Lodge junction.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-stands-parents-parliament/content_27.html": "Speaking in the House of Commons, Graham mounted a defence of families having choices in their children’s education as the Labour government attempts to squash academies, free schools and home schooling.\nIn a speech attacking Labour’s attempts to deny parental choice by slashing standards in academies, stopping the creation of new free schools and putting impossible burdens on home schoolers, Graham made a stand for parents.\nGraham spoke powerfully about the freedom of parents to choose the best possible education for their children, be that through the expansion of the academy system to trusting parents to home-school their children.\nGraham is concerned that Sir Keir Starmer’s government is pursuing an ideological attack on parental choice and the education of England’s children.\nEducation in England has been transformed by successive governments, both Labour and Conservative, taking England from 27th in the world for reading to the best in the world last year.\nMeanwhile in Wales, where academies were blocked by the Labour administration, education levels have stood still since 2010, with Welsh pupils performing only as well as disadvantaged pupils in England.\nIn 2010 only 68% of schools in England were rated Good or Outstanding. Now it stands at 90% following a concerted consensus that the best way to improve education is to get the bureaucrats out and let teachers teach.\nThe government has already acknowledged one error in its original legislation, scrapping its proposed pay cap for teachers.\nGraham served as Chairman of the House of Commons’ Education Select Committee from 2010 to 2015.\nGraham Stuart, Member of Parliament for Beverley and Holderness, commented, “I may be old fashioned, but I’ve always thought education is about getting the best start for our young people and giving parents the ability to choose the school that provides that.\n“This government seems to believe that the people to look after are the bureaucrats and the teachers’ unions – at the expense of our children.\n“It was astonishing to hear Labour MPs in the House of Commons give long speeches about how the Unions hate academies while not even giving a mention to children.\n“Labour wants to destroy education because it doesn’t believe in our schools and our children – it only believes in trendy theories and its cheques from the trade unions.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-meets-pole-campaigners-beverley-street-surgery/content_46.html": "Graham met campaigners against the proliferation of telegraph poles to deliver broadband competition to KCOM at one of his regular street surgeries in Beverley.\nCampaigners came to see Graham following the news that he is to meet Minister for Digital Infrastructure at a round table discussion in Parliament on 25th March.\nThe campaigners pressed Graham on their view that telegraph poles should be removed from Permitted Development regulations in the Electronic Communications Code 2013 to save towns and villages like Hedon, Beverley and Preston from the blight of poles being erected on their streets without their consent, where underground ducts already deliver high speed broadband to homes.\nLast Friday morning it was announced that KCOM has made an offer to share its infrastructure with Connexin. This has been months in the making following significant pressure on the Hull provider from Graham.\nWhile this is a welcome development, the time scales (with infrastructure sharing a possibility only in 2025) are considered to be far too long by campaigners, and Graham is in full agreement.\nGraham will be pressing the Minister to force KCOM to open up at the earliest possible opportunity and, in the meantime, is encouraging Leader of East Riding of Yorkshire Council, Cllr Anne Handley, to enter into a Voluntary Charter with the telecommunications companies, as recently agreed in Hull.\nIn addition to finding a long-term solution to the proliferation of poles in the East Riding, Graham has been working closely with MS3 and Connexin to encourage greater community engagement, which has given residents the chance to put their concerns to companies directly.\nThis commitment is enshrined in the voluntary charter in Hull.\nGraham will continue to fight for residents of Beverley and Holderness, and continues to put concerns from residents about pole placement to MS3 and Connexin on a weekly basis.\nBeverley and Holderness MP Graham Stuart said: “People are incredibly frustrated with the ongoing saga of telegraph poles in towns and villages across the East Riding.\n“I heard their views at my street surgery and have heard them loud and clear.\n“These are first class campaigners who are deeply concerned at what’s happening to their communities, and I’m doing all I can to stop the proliferation of ugly and unnecessary poles in Beverley and Holderness.\n“KCOM has now recognised that it has to work with competitors following pressure from the Government but it has to move much more quickly to sort out this sorry situation.\n“I’m continuing to work with all companies to get a resolution and will be putting forward to the Minister in person next week the concerns of the hundreds of residents who have been in touch.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_tours-parliament/content_53.html": "Free guided tours of Parliament are available to constituents. The walking tour of the Palace of Westminster lasts approximately 1 hour and 15 minutes and during your visit you will see:\n- Westminster Hall, the ancient hall where the Queen lay in State\n- The House of Commons Chamber, including the Speaker's Chair, the famous green benches and the voting lobbies\n- The House of Lords, including the Royal Throne\n- The Queen's Robing Room, Royal Gallery and many other fascinating parts of the Palace of Westminster\nIf you are a constituent and would like a tour, please email me at [email protected] with the name of the attendees and your postal address and I will be happy to arrange this for you.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_surgeries/content_10.html": "What’s a Street Surgery?\nMy Street Surgeries take place outdoors in the middle of Beverley, Withernsea, Skirlaugh and Hedon on Saturday mornings. They provide an informal opportunity for you to meet me and share a problem, and also to ask about the work I am doing on your behalf. You don’t need to make an appointment and our conversation will be private if necessary.\nStreet Surgery times (unless stated otherwise):\nBeverley: 10am – noon\nHedon and Withernsea: 10.30am – noon\nSkirlaugh: 11am - noon\nStreet Surgery dates:\n2025\nSaturday 26th April - Toll Gavel, Beverley\nSaturday 7th June - Market Place, Hedon\nSaturday 21st June - Outside Aldi, Withernsea\nSaturday 5th July - Toll Gavel, Beverley\nSaturday 19th July - Patrington (exact location to be confirmed)\nSaturday 13th September - Market Place, Hedon\nSaturday 11th October - Outside Aldi, Withernsea\nSaturday 25th October - Toll Gavel, Beverley\nSaturday 15th November - Opposite the Duke of York, Skirlaugh\nSaturday 29th November - Market Place, Hedon\nSaturday 13th December - Toll Gavel, Beverley",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_cadey-campaign-discussion-another-potential-funder/content_49.html": "Graham Stuart, MP for Beverley and Holderness, and founder of the CADEY campaign welcomed Esh Construction to Parliament to discuss its potential involvement in providing defibrillators around the constituency.\nThe Queen’s Award-winning construction firm’s ‘Constructing Local’ strategy is predicated on supporting local communities through improving education, providing employment opportunities, buying local, and most pertinently supporting community programmes that have a direct effect on those near to their construction sites.\nGraham said, “It was great to meet up with Ross Markwell and Stephen Wilkie of Esh Construction’s Civils division to discuss how we could work together to help achieve CADEY’s aim – to achieve full coverage of defibrillators throughout the communities of Beverley and Holderness.\n“We need to see these life-saving devices in every village and hamlet. Every second counts when trying to save the life of someone in cardiac arrest and the more seconds we can shave off the time it takes to get a defibrillator on someone raises the likelihood that we can save their life.\n“Esh has an outstanding commitment to social responsibility and does excellent work funding and supporting community projects. Ross and Stephen are enthusiastic about CADEY’s potential and I’m excited at the prospect of working with them.”\nStephen Wilkie, executive director of Esh Group said: “We look forward to exploring ways of working together with Graham and CADEY, our business continues to invest in our social value programme, we have the ability to support initiatives which make a real difference in the areas Esh Construction operates – CADEY is a great initiative, is of great interest and we discussed a number of ways of supporting the campaign going forward.”",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_contact/content_5.html": "Skip to main content\nMain navigation\nHome\nNewsletter\nNews\nMy Plan\nMy Views\nStreet Surgeries\nAbout Me\nContact\nContact\nLeave this field blank\n9 Cross Street, Beverley HU17 9AX\n01482 679 687\n[email protected]\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_myplan/content_9.html": "Graham has been the MP for Beverley and Holderness since 2005, and in that time he has worked hard to deliver for its residents.\nWhether it's healthcare or transport; education or crime; broadband or our communities, Graham is always working to make our communities the best they can be.\nYou can see some of Graham's proudest achievements since 2005 here, and you can look at his current campaigns here.\nAnd why not sign up to get Graham's newsletter and see what he's been doing for your community in the past month,",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news/content_4.html": "Northern Powergrid Commits to Improving Power Supply in Easington, Skeffling and Kilnsea Tuesday, 29 April, 2025 Following concerns from Easington Parish Council and a number of residents, Graham, Cllr Sean McMaster and Cllr Lyn Healing met Northern Powergrid to raise concerns about persistent short power cuts in the area. During the meeting with the local MP, councillors and Northern Powergrid, the company acknowledged that, while power cuts are inevitable in rural areas, they need to do more to provide... Local News\nGraham and South East Holderness Councillors pushing for answers on power cuts 23rd April 2025 People in Easington, Kilnsea, Out Newton and Aldbrough have been suffering from regular power cuts over the past year leaving elderly people vulnerable... Local News\nGraham on TalkTV with Jeremy Kyle 23rd April 2025 Graham appeared on TalkTV with Jeremy Kyle on Tuesday 22nd April 2025. Opinions\nGraham Celebrating Our Finest Pubs as Reeves hammers the Local 23rd April 2025 With pubs facing the toughest circumstances since the COVID-19 pandemic shut down all forms of hospitality, local MP Graham Stuart is celebrating local pubs in... Local News\nPubs facing £21,000 Tax Bombshell 9th April 2025 Following Labour’s October Budget of Broken Promises and March’s Emergency Budget, pubs are having to make difficult decisions as the cost of Rachel Reeves... Local News\nGraham Calls for Chancellor to be Sacked 26th March 2025 Rachel Reeves has reached the end of the road. She said she had a plan for growth. Our growth forecasts have been halved. She said she would protect working... Local News\nFirst Class HGV Training in Leconfield 25th March 2025 Defence School of Transport (DST) Leconfield has prepared 617 civilians to get their HGV license as part of the HGV Skills Boot Camp since 2021. Skills... Local News\nMPs joining forces to support people with Down Syndrome 20th March 2025 Three years after becoming law, the landmark Down Syndrome Act 2022 is still to be delivered by the government. Following a debate led by senior Conservative MP... Local News\nGraham's Speech for World Down Syndrome Day 20th March 2025 It is a pleasure to serve under your chairmanship, Mr Turner. I assume that the Minister responsible for this area of policy is still the Minister for Care, the... Speeches in Parliament\nGraham Stands Up For Parents in Parliament 18th March 2025 Speaking in the House of Commons, Graham mounted a defence of families having choices in their children’s education as the Labour government attempts to squash... Westminster News",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-presents-jordan-moor-award-prime-minister/content_44.html": "Local MP Graham Stuart was delighted to present Jordan Moor with a Points of Light Award from the Prime Minister.\nGraham nominated Jordan for this prestigious national award for his tireless work campaigning and fundraising for new defibrillators across Beverley and Holderness.\nSince the sudden and unexpected death of his much-loved stepfather, Dr Alan Sykes, Jordan has worked tirelessly to ensure local people have access to a defibrillator should the worst happen.\nIn his memory, Jordan has raised a staggering £45,000 by holding pub quizzes, coffee mornings and auctions across our area. This money has paid for 21 defibrillators in a number of communities including Leven, Catwick, Long Riston and New Ellerby.\nGraham has worked with Jordan to install these defibrillators as part of his CADEY (Community Access Defibrillators for East Yorkshire) campaign. He has found his ideas for how to obtain new funding and wider knowledge on the subject truly invaluable as they work together to ensure every community in the constituency has a defibrillator.\nThe Points of Light awards was first established by President George H.W. Bush in 1990 to recognise the outstanding voluntary work that individuals are doing every day in our communities. The UK Government launched their own version of this project in April 2014 and Jordan is the 2311th recipient of this award.\nJordan Moor commented: “I am delighted to receive this award in memory of my stepfather Dr Alan Sykes. To date I have raised nearly £50,000 towards installing 21 defibrillators across Yorkshire to help save lives.”\nGraham Stuart said: “Jordan is a truly inspirational young man and I am privileged to work with him as part of my CADEY (Community Access Defibrillators for East Yorkshire) campaign. I am very proud to see him recognised by the Prime Minister for his sterling work and I am sure his stepfather, Dr Alan Sykes, would have been very proud of him too.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_YorkHullRail/content_22.html": "Hull and Beverley are linked with Market Weighton, Pocklington, Stamford Bridge and York by the increasingly congested A1079. The Minsters Rail Campaign believes that the former 47-mile link between York and Hull (closed in 1965), which branched off the existing Hull-Scarborough line at Beverley and served these places, should be reinstated as a new railway.\nThe track was closed in 1965 following recommendations in the Beeching Report two years earlier which results in approximately 6000 miles of railway lines being axed on cost and efficiency grounds.\nRestoring the railway line between Beverley and York will contribute substantially to the long-term economic and social future of East Riding, improving public transport, reducing car dependency and encouraging sustainable development. Regionally, the line will contribute to the Government’s ‘Northern Powerhouse’ initiative and fulfil its promise to ‘Levelling Up’ the country by improving east-west connectivity between East and North Yorkshire.\nGraham will continue to make the case on behalf of the residents of Beverley and Holderness to ensure they get the high-quality transport infrastructure they deserve.\nNEWS May 2024\nRail Minister Huw Merriman announces that £168 million Local Transport Fund could fund York to Hull Rail study.\nNEWS October 2023\nNEWS March 2023\nYorkshire MPs Join Forces to Fight for York to Hull Rail Link\nNEWS December 2022\nGraham Stuart MP launches a survey to give residents their say on the York to Hull Rail Link\nNEWS September 2022\nThe Strategic Business Case has been submitted to the Department for Transport\nNEWS December 2021\nGraham Stuart MP raises the York to Hull Rail Link with Chancellor Rishi Sunak\nNEWS October 2021",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_Health/content_20.html": "Working with NHS East Riding of Yorkshire to make sure our GPs, hospitals and dentists are all providing us with the healthcare we deserve; and working to get defibrillators in every community in the East Riding through the CADEY campaign.\nGraham Stuart, Member of Parliament for Beverley and Holderness, has secured upgrades to the x-ray facilities at Withernsea Community Hospital, which have the potential to deliver an extra 520 x-ray appointments in the town each year.\nA series of improvements have been introduced to increase the ca\nGraham visited Beverley Grange Nursing Home to celebrate its 25th birthday.\nLocated on Lockwood Road in the town, Beverley Grange is a high-quality nursing home which provides residential, nursing and palliative care as well as short-term respite for its residents.\nLocal MP Graham Stuart was delighted to present Jordan Moor with a Points of Light Award from the Prime Minister.\nGraham nominated Jordan for this prestigious national award for his tireless work campaigning and fundraising for new defibrillators across Beverley and Holderness.\nSince t\nGraham was very pleased to open the newest CADEY defibrillator located at Hedon Methodist Church.\nThis purchase was made possible thanks to the strong partnership between the church and CADEY (Community Access Defibrillators for East Yorkshire).\nGraham has visited East Riding Community Hospital to see the hospital’s progress over ten years after opening, and to see the hospital’s new diagnostic facilities, made possible by the Government’s Community Diagnostic Centre programme.\nThis was a particularly poignant visit for Graha\nLocal MP Graham Stuart has written to Dame Andrea Leadsom MP, Minister for Primary Care, to request that a Mobile Dental Van comes to Withernsea.\nIn February Graham met the Minister to stress the need for more NHS dental appointments across Beverley and Holderness.\nLocal MP Graham Stuart has welcomed the news that almost 8000 extra medical appointments took place at East Riding Community Hospital in Beverley in recent months.\nGraham often hears from constituents that they want to access a medical appointment sooner and without needing to travel to\nGraham met Andrea Leadsom, Minister for Primary Care, to discuss residents' concerns about being unable to see an NHS dentist.\nGraham requested that the Minister look into a mobile dental unit being available for the people of Withernsea and deliver an improved service for everyone in Beverley and\nGraham Stuart, Member of Parliament for Beverley and Holderness, is encouraging the 3000 people in Withernsea who are being offered a free lung health check to attend their appointment.\nSince November, over 1300 former and current smokers aged 55 to 74 years old living in the town have\nGraham Stuart, Member of Parliament for Beverley and Holderness, visited Hornsea First Aid Centre to thank the volunteers for their tireless work in the community.\nThe Centre was founded in 2018 following the closure of the Minor Injuries Unit in the town, with over 30 volunteers including we",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_first-class-hgv-training-leconfield/content_35.html": "Defence School of Transport (DST) Leconfield has prepared 617 civilians to get their HGV license as part of the HGV Skills Boot Camp since 2021.\nSkills Bootcamps were set up in April 2021 to help the UK build its base of qualified people for key jobs, including business, digital and HGV drivers.\nThe Bootcamps are intensive courses of up to 16 weeks for people returning to HGV driving, those looking to upgrade their licenses, novices and more besides.\nDST Leconfield was formed in 1996 to provide driver training for the Army, Royal Marines and Royal Air Force. It is the largest residential driving school in the world, with 4.75 million miles driven by its students. It has a permanent establishment of 173 military and 546 civilian staff.\nDST Leconfield is a visible reminder of East Yorkshire’s Armed Forces community and regularly engages with the local community, including its annual Armed Forces Day events.\nGraham Stuart, MP for Beverley and Holderness, said, “DST Leconfield is doing a fantastic job for both our military and, now, our civilian drivers.\n“It’s a huge employer locally and puts so much back into our local economy and community including supporting our blue light services.\n“It was a great pleasure to meet Mark and Nigel and see some of the first class training that they provide.”\nMark Smith, Director of Mainstream Training, said “Welcoming Graham today has been fantastic. Getting him into the driver's seat and working with our instructors allowed him to experience firsthand the excellent driver training we provide at our Skills Bootcamps.\n“Many of our students go on to secure high-paying roles in the transport and logistics sector, and we’re proud to equip them with the skills and knowledge they need to succeed. Efficient transport is the lifeblood of the economy, and we part of keeping it moving forward.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_yorkshire-mps-join-forces-fight-york-hull-rail-link/content_36.html": "A group of MPs representing York, the East Riding and Hull have come together to campaign for a new rail link between York and Hull.\nGraham Stuart, MP for Beverley and Holderness, has long been pushing to connect these great Northern university cities.\nGraham, Dame Diana Johnson (Lab, Hull North), Sir Greg Knight (Con, East Yorkshire), David Davis (Con, Haltemprice and Howden), Emma Hardy (Lab, Hull West and Hessle), Julian Sturdy (Con, York Outer) and Rachael Maskell (Lab, York Central) have announced that they will work together to get this project to the point where it can be considered as one of Britain’s new railways under the Restoring Your Railway Fund.\nThe proposed link, closed in the Beeching cuts in 1965, will connect York and Hull to create new opportunities for collaboration between the cities, and create a new corridor of opportunities in places like Beverley, Pocklington and Market Weighton.\nWith partnerships only increasing between these two Northern Powerhouses, such as the Hull York Medical School, it is only right that the journey time between York and Hull is slashed from the current hour to traverse the 47 mile route by road.\nThe cross-party group of MPs have agreed a common course of action to work together to ensure this route is on the Department for Transport’s radar.\nThe next phase for the new line will be an engineering study to investigate what the route would be, since much of the old Minsters’ Line has now been built over.\nCommenting, Graham said: “York and Hull are two of the North’s greatest cities and linking them is vital for our region and for Yorkshire.\n“That’s why I’m working with MPs from across the region to make a new rail line between York and Hull a reality.\nMy Yorkshire colleagues, Labour and Conservative, and I are united in our shared goal to improve Yorkshire’s transport connectivity.”\nDame Diana Johnson, MP for Hull North, said, “Restoring the rail line between York and Hull via Beverley would boost the Humber economy.\n“I’m working cross-party with MPs in our region to make this great idea a reality.”\nCommenting, Roy Begg, spokesman for Minsters Rail campaign group, said: “We can make this no-brainer of a line a reality, and I’m so grateful to Graham and all the MPs for everything they’re doing to keep this on the Government’s plate.\n“We need this new line to link York and Hull and provide new opportunities for everywhere in between.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-stands-ps2-bus-fares-fair-fares-buses-campaign/content_8.html": "Graham has pledged to protect our rural buses which could be at risk in this month’s budget following reports that the Chancellor is considering scrapping the previous government’s scheme.\nHe has launched a petition to maintain affordable bus fares, which constituents can sign at www.grahamstuart.com/FairFares.\nA voluntary £2 cap on bus fares was introduced by the previous Conservative government with the goal of increasing bus use following the Pandemic.\nThe policy was extended to December 2024 by the previous government, but now it seems that the Chancellor will scrap fair fares for buses.\nGraham asked the Secretary of State for Transport whether she would commit to retaining the £2 fare cap, but the government has failed to confirm that it will.\nGraham is a great supporter of buses in the East Riding, and transport more generally. At the beginning of the year he helped improve the timetable of the 75 bus, delivering shorter journeys between Hull and Withernsea.\nHe is in regular contact with ward and parish councillors about improving bus routes, such as recently in Withernwick with Cllr Samantha Whyte.\nHe was also influential in the award by the last government of £168 million to improve transport in the East Riding and started a campaign for safer roads in the constituency.\nGraham Stuart said: “People who rely on the buses don’t deserve for their fares to almost double, which is what could happen if the bus fare cap is removed.\n“The £2 bus fare cap has helped bus users keep more of their hard-earned money in their pockets.\n“That’s why I’ve launched my campaign for Fair Fares for Buses – to make sure bus fares continue to be capped.\nI don’t want to see people who use the bus losing out, and that’s why I’ve always been a firm supporter of the £2 bus fare.\n“Fair fares have been a lifeline to the pockets of the thousands of people in Beverley and Holderness who use the buses every day.\n“That’s why I’ve launched my Fair Fares campaign – to make sure the government commits to maintain a cap on bus fares.\n“This government claims to be on the side of working people, so I’m surprised and disappointed that the Chancellor is considering scrapping the bus fare cap.\n“I simply don’t see how increasing fares for people in rural areas who depend on buses is fair, and I’ll do all I can to keep fair fares for buses.”\nCllr Samantha Whyte (Con, Mid Holderness) said, “Rural bus services extend beyond basic transportation, offering everyone, regardless of age or mobility, the chance to engage in social activities, access employment, school, and key services like shops and healthcare.\n“They are vital for fostering community well-being and social inclusion.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_campaigns/content_13.html": "The Great East Yorkshire Pub Our pubs are great. I don’t need to tell you why. In fact, as pubs are facing an ever-tougher time with tax hikes, rising bills and staffing costs increasing, I...\nSmall Business Survey Small Business Saturday is taking place on 7th December. Graham is inviting all local businesses - whether they be wholesalers, corner shops, manufacturers...\nStop The Farm Tax Labour's Family Farm Tax will stop farms being passed to the next generation. Threatening our food security Risking jobs Leading to food prices rising. STOP...\nFair Fares for Buses In January 2023 the Conservatives brought in a £2 cap on bus fares to increase use of buses. And it worked. In East Yorkshire, patronage increased and...\nKeep the Single Person Discount People living alone, of all ages, currently benefit from the Single Person Discount on Council Tax - worth 25% of a council tax bill or around £400 a year. The...\nProtect Our Pensioners The Government is proposing to means test the Winter Fuel Payment this winter - and only those on Pension Credit will be eligible. Pensioners on just £220 a...\nKeep Pensioners Warm We all deserve dignity - not least in retirement. For those who have paid into the system for so long, it simply isn't right to remove the Winter Fuel Payment...\nPot Holes in Humbleton East Riding Council has £168 million to spend on improving local transport. Let's spend some of that on fixing pot holes in Humbleton.\nGraham's Crimestoppers From Summer 2022 to Summer 2023, we cut anti-social behaviour around St. Nicholas Green by 43%. With summer coming, we can't let up now. As a community, we can...\nPreston Preston is a beautiful village, but traffic is a long-standing issue. Graham has been working with Cllrs John Dennis and Sue Steel for years to press for...\nEast Riding Transport Fund How would you spend £168 million on transport in your area? That's the question Graham is asking, now that the Government has made £168,269,000 available to...\nDiagnostic Tests It's not right for people to have health problems but not get the care they need. That's why I'm working with the local NHS to make sure we can get more...",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_TelegraphPoles/content_28.html": "We all deserve access to fast, reasonably priced broadband – and competition is the best way to achieve that.\nBut it’s not right for telegraph poles to go up in places that are wrong for a local community – be it a private road, a front garden or a conservation area.\nThat’s why I’m working with the Council to make sure that broadband poles are erected with the support of local communities, in places where they don’t disrupt peoples’ right to a quiet and peaceful life.\nI'll be working with MS3, Connexin and KCOM to make sure that these companies work together, as required by regulations, to make sure that we all have access to the best possible broadband.\nAnd I'm working with the Government to make sure these regulations are enforced properly, with the Council given any necessary powers to enforce it.\nWhat I've Done\n- I’ve arranged a meeting with MS3, ERYC and Ward Councillors to open dialogue between the community, council and MS3. Since that meeting I’ve spoken to MS3 on many occasions to press the concerns of residents.\n- I’ve written to Ofcom about KCOM’s monopoly and have encouraged MS3 to report KCOM to Ofcom if they have complaints about not being able to get quick and reasonably priced access to their infrastructure.\n- I’ve received confirmation that MS3 will not go into conservation areas without local consent. Indeed, its CEO has told me that it will go beyond what it is required to do in terms of consultation.\n- I’m encouraging MS3 and Connexin to work together to reach agreement on sharing infrastructure. If agreement can’t be reached with KCOM to share their ducts and poles I do not want multiple sets of overhead cables.\n- I’ve raised this with the minister for digital infrastructure to encourage changing regulations to compel companies to share overhead cables.\n- I've asked the Council if they can look at delaying permits while discussions continue.\n- I've welcomed Hedon's campaigners against poles to Parliament.\n- Alongside Beverley Civic Society, I secured a commitment that Connexin will not build in Beverley's conservation areas.\n- I met Ofcom to inform the watchdog about KCOM's market position and discuss practical avenues going forward.\n- I met CEOs of KCOM, MS3 and Connexin to discuss a way forward.\n- I lobbied the Minister for Digital Infrastructure Julia Lopez to close the loopholes that allow broadband poles to be erected anywhere, without getting input from local councils.\n- I've written to Anne Handley, Leader of East Riding Council, to request that East Riding Council adopt a voluntary charter for broadband providers.\n- I attended a round-table meeting of MPs with the Minister for Digital Infrastructure, Julia Lopez.\n- Alongside Emma Hardy and Dame Diana Johnson, I wrote to the Minister to put forward residents' concerns.\n- I met Chris Bryant to press the case for regulation of broadband infrastructure, and to see for himself the harm this is doing to our communities.\nWhat's next?\n- I'll work with East Riding of Yorkshire Council to make sure it gets the support it needs to put residents first.\n- I'll continue to push the Government to end permitted development where telegraph poles or underground exist.\nFor updates, please sign up below.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_CADEY/content_17.html": "If you suffer a Sudden Cardiac Arrest, a defibrillator could save your life. For every minute your heart isn't restarted by a defibrillator, your chances of survival would decrease by 10%.\nSo in rural communities, a sudden cardiac arrest could be a death sentence when it doesn't need to be.\nThat's why I started CADEY alongside Yorkshire Ambulance Service and HEY Smile - to help complete our defibrillator network in the East Riding.\nWorking together with businesses and individuals, we've installed twelve defibrillators so far, and are on the hunt for locations in more villages.\nMaybe you can help us? Get in touch with the form below if you know somewhere in your community where a defibrillator could go, and maybe it will save a life.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-calls-chancellor-be-sacked/content_16.html": "Rachel Reeves has reached the end of the road. She said she had a plan for growth. Our growth forecasts have been halved. She said she would protect working people from tax rises. Her jobs tax has led to 80,000 more people without jobs. She has increased borrowing by £18bn. She said she would build homes for the future. Today she cut 200,000 homes from her target. All this while we now see tax hit 37.7% of GDP.\nThe Chancellor inherited the fastest growing economy in the G7 with inflation at 2%. She took to the floor of the House of Commons today to tell us that she squandered that inheritance and has made our economy weaker and less secure.\nWe simply can’t afford the cost of Labour.\nRachel Reeves needs to go. She simply isn’t up to the job of being Chancellor and in these times we need somebody at the helm who knows what they’re doing.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_CADEY_Locations/content_30.html": "Tweet Elstronwick Hornsea Mappleton Molescroft Skeffing South Dalton Sunk Island Thearne Thorngumbald West Newton Woodmansey",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-tells-minister-digital-infrastructure-we-need-action-poles-now/content_43.html": "Graham attended a meeting of MPs with Julia Lopez, Minister for Digital Infrastructure, to make it clear that residents of Beverley and Holderness deserve an end to the saga of ugly and unnecessary poles being erected to provide broadband competition.\nIn the well-attended meeting, Minister Lopez was clear that the Government has heard the frustration about poles being erected under permitted development rules, but Graham, Dame Diana Johnson (Lab, Hull North) and Emma Hardy (Lab, Hull West and Hessle) made it clear that the situation in Hull and the East Riding deserves special attention.\nGraham has seen over two hundred complaints about poles, all of which have been passed to the respective companies. He has made residents’ views clear to the Government and had met campaigners on several occasions, both in Parliament and at his regular street surgeries.\nThe MPs were united in their clear call for the Government to act by ending permitted development of poles for the delivery of broadband where infrastructure, be it poles or ducts already exists.\nGraham, alongside Dame Diana and Emma Hardy, also pressed the minister to make mandatory the Code of Conduct under the Electronic Communications Code 2003.\nMinister Lopez said that she has written to KCOM, Connexin and Ofcom about the situation, and has stated that there is progress in Hull and the East Riding. She stated that, following a request from Ms Hardy, that she would look into limits on the number of poles that can be introduced.\nMinister Lopez will be meeting broadband providers in the coming weeks to draw up the new code of conduct.\nGraham, Emma Hardy and Dame Diana Johnson immediately wrote a joint letter to Minister Lopez and will continue to work closely with other MPs in the area who are affected.\nFor over a year, poles have been erected in streets across the KCOM area where underground infrastructure to deliver broadband already exists.\nGraham has been pushing competitors to work together to find a solution and earlier this month KCOM made an offer to Connexin about pole sharing, the first sign of progress. He has secured commitments that Connexin and MS3 will not erect poles in conservation areas and has encouraged the companies to improve their engagement with communities.\nGraham said: “People are fed up to the back teeth with poles being erected in front of their houses, with very little notice and hardly any possibility of recourse.\n“It’s a complete mess. We deserve better than this.\n“I’m doing all I can to stop these ugly and unnecessary poles. It’s incredibly frustrating when companies can’t work together for the good of residents of Beverley and Holderness.\n“I’m very grateful, as ever, to the first-class campaigners who have done so much to keep this important issue at the top of the agenda.\n“I know the Minister has heard our concerns and, alongside Dame Diana Johnson MP and Emma Hardy MP, I’ll be holding her feet to the fire to get a resolution to this, quickly.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_parliament/content_12.html": "Tweet Here, you can see Graham Stuart's speeches and appearances in Parliament, provided by theyworkforyou:\nEnergy Efficiency: Council Leaseholders and Social Homes | Energy Security and Net Zero | Commons debates I know how on top of her brief the Minister is, so will she confirm that fewer than a third of council homes had an energy performance certi\nEnergy Efficiency: Council Leaseholders and Social Homes | Energy Security and Net Zero | Commons debates I know how on top of her brief the Minister is, so will she confirm that fewer than a third of council homes had an energy performance certi\nFootball Governance Bill [Lords] | Commons debates My right hon. Friend will be aware that the new chairman of the Labour football regulator gave £5,000 to the hon.\nFootball Governance Bill [Lords] | Commons debates This is not a Labour-leaning businessperson who is generally independent but decided to support Labour; this is someone who was a director o\nFootball Governance Bill [Lords] | Commons debates This is not a Labour-leaning businessperson who is generally independent but decided to support Labour; this is someone who was a director o\nFootball Governance Bill [Lords] | Commons debates My right hon. Friend will be aware that the new chairman of the Labour football regulator gave £5,000 to the hon.\nFootball Governance Bill [Lords] | Commons debates My right hon. Friend will be aware that the new chairman of the Labour football regulator gave £5,000 to the hon.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_category_Opinions/content_15.html": "Graham on TalkTV with Jeremy Kyle 23rd April 2025 Graham appeared on TalkTV with Jeremy Kyle on Tuesday 22nd April 2025. Opinions",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_news_graham-stuart-mp-welcomes-3-month-extension-ps2-single-bus-journeys-beverley-and-holderness/content_56.html": "Graham Stuart, Member of Parliament for Beverley and Holderness, welcomes the great news that most single bus journeys in Beverley and Holderness will be capped at £2 for another 3 months until 30th June.\nAs part of the Government’s ‘Help for Households Campaign’, the Government is investing up to £75 million to introduce a fare cap on over 130 operators in England, outside London.\nThey estimate that because of this investment in our bus network, over 95% of single bus journeys will cost no more than £2. This cap was scheduled to end on 31st March, however thanks to additional Government funding this has been extended by 3 months until 30th June.\nThis will mean that people travelling from Beverley to Hull on the 23/X46/121 routes will save £3.10 on each journey, those travelling from Withernsea to Hull on the X7/75 routes will save £3.90, and if you travel from Hornsea to Beverley on the 25 route you will save £5.30 on a single ticket.\nStuart Fillingham, Head of Commercial at East Yorkshire Buses, commented: “We’re glad to support the £2 fare cap, especially when the cost of living is such a relevant issue for many of our customers. Travelling by bus is often the more inexpensive option, but with the introduction of this great-value fare cap, we’re looking forward to welcoming new and returning customers on board.”\nFollowing this announcement, Graham Stuart MP said: “Everyone deserves to travel around Beverley and Holderness and the surrounding towns affordably, whether it be to get to the shops, doctors’ appointments or to visit friends and family. It is great news that the Government is extending the £2 fare cap which will continue to make a great deal of difference to everyone who uses our buses.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-celebrating-our-finest-pubs-reeves-hammers-local/content_38.html": "With pubs facing the toughest circumstances since the COVID-19 pandemic shut down all forms of hospitality, local MP Graham Stuart is celebrating local pubs in his Beverley and Holderness constituency as Chancellor Rachel Reeves chooses to hammer pubs across the UK.\nHe is encouraging people to share what makes their locals great on his website. He has also written to all 97 pubs in Beverley and Holderness to offer his personal support for their businesses.\nPubs play a vital role in our communities, providing not just food and drink but employment and increasingly social events such as karaoke, quizzes and much more besides.\nRachel Reeves’ October Budget of Broken Promises has seen pubs lose hospitality rates relief, which gave hospitality businesses a 75% reduction in their business rates, has been reduced to 40%. This was available up to a £110,000 cap.\nThis measure was introduced by the Conservative government as part of its efforts to keep businesses going during the pandemic. It was extended ever since due to its success in keeping successful pubs, restaurants and cafes open.\nReeves has further hammered pubs by increasing the Minimum Wage (which is paid by businesses, not the government), in particular a 16.3% increase for 18-20 year olds.\nAlongside the Jobs Tax, which not only increases the rate by almost 9% but reduces the threshold on which National Insurance is paid to £5,000 from £9,000 – a move which penalises employers, like pubs, which make use of part time labour.\nWith 200,000 businesses already closed since the Budget, Graham hopes to see great pubs across East Yorkshire celebrated and promoted.\nGraham has been a leading critic of Rachel Reeves’ Budget in the House of Commons, attacking it for axing pensioners’ Winter Fuel Allowance, hiking Stamp Duty (particularly for First Time Buyers), introducing the Family Farm Tax and hiking the Jobs Tax.\nGraham Stuart, Member of Parliament for Beverley and Holderness, commented, “The Local is one of Britain’s greatest cultural assets and people love their pubs.\n“As Rachel Reeves is hammering our locals, I’m determined to celebrate and promote pubs which do great things for the local area.\n“So if you love your local, let me shout about it by letting me know here.”",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_news_yorkshire-mps-join-forces-fight-york-hull-rail-link/content_52.html": "A group of MPs representing York, the East Riding and Hull have come together to campaign for a new rail link between York and Hull.\nGraham Stuart, MP for Beverley and Holderness, has long been pushing to connect these great Northern university cities.\nGraham, Dame Diana Johnson (Lab, Hull North), Sir Greg Knight (Con, East Yorkshire), David Davis (Con, Haltemprice and Howden), Emma Hardy (Lab, Hull West and Hessle), Julian Sturdy (Con, York Outer) and Rachael Maskell (Lab, York Central) have announced that they will work together to get this project to the point where it can be considered as one of Britain’s new railways under the Restoring Your Railway Fund.\nThe proposed link, closed in the Beeching cuts in 1965, will connect York and Hull to create new opportunities for collaboration between the cities, and create a new corridor of opportunities in places like Beverley, Pocklington and Market Weighton.\nWith partnerships only increasing between these two Northern Powerhouses, such as the Hull York Medical School, it is only right that the journey time between York and Hull is slashed from the current hour to traverse the 47 mile route by road.\nThe cross-party group of MPs have agreed a common course of action to work together to ensure this route is on the Department for Transport’s radar.\nThe next phase for the new line will be an engineering study to investigate what the route would be, since much of the old Minsters’ Line has now been built over.\nCommenting, Graham said: “York and Hull are two of the North’s greatest cities and linking them is vital for our region and for Yorkshire.\n“That’s why I’m working with MPs from across the region to make a new rail line between York and Hull a reality.\nMy Yorkshire colleagues, Labour and Conservative, and I are united in our shared goal to improve Yorkshire’s transport connectivity.”\nDame Diana Johnson, MP for Hull North, said, “Restoring the rail line between York and Hull via Beverley would boost the Humber economy.\n“I’m working cross-party with MPs in our region to make this great idea a reality.”\nCommenting, Roy Begg, spokesman for Minsters Rail campaign group, said: “We can make this no-brainer of a line a reality, and I’m so grateful to Graham and all the MPs for everything they’re doing to keep this on the Government’s plate.\n“We need this new line to link York and Hull and provide new opportunities for everywhere in between.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_category_Local-News/content_32.html": "Northern Powergrid Commits to Improving Power Supply in Easington, Skeffling and Kilnsea 29th April 2025 Following concerns from Easington Parish Council and a number of residents, Graham, Cllr Sean McMaster and Cllr Lyn Healing met Northern Powergrid to raise... Local News\nGraham and South East Holderness Councillors pushing for answers on power cuts 23rd April 2025 People in Easington, Kilnsea, Out Newton and Aldbrough have been suffering from regular power cuts over the past year leaving elderly people vulnerable... Local News\nGraham Celebrating Our Finest Pubs as Reeves hammers the Local 23rd April 2025 With pubs facing the toughest circumstances since the COVID-19 pandemic shut down all forms of hospitality, local MP Graham Stuart is celebrating local pubs in... Local News\nPubs facing £21,000 Tax Bombshell 9th April 2025 Following Labour’s October Budget of Broken Promises and March’s Emergency Budget, pubs are having to make difficult decisions as the cost of Rachel Reeves... Local News\nGraham Calls for Chancellor to be Sacked 26th March 2025 Rachel Reeves has reached the end of the road. She said she had a plan for growth. Our growth forecasts have been halved. She said she would protect working... Local News\nFirst Class HGV Training in Leconfield 25th March 2025 Defence School of Transport (DST) Leconfield has prepared 617 civilians to get their HGV license as part of the HGV Skills Boot Camp since 2021. Skills... Local News\nMPs joining forces to support people with Down Syndrome 20th March 2025 Three years after becoming law, the landmark Down Syndrome Act 2022 is still to be delivered by the government. Following a debate led by senior Conservative MP... Local News\nTop Holiday Park Kicking Off Tourist Season in Withernsea With 150 Jobs 17th March 2025 Withernsea Sands is expanding its award-winning holiday park in Withernsea, which is marking the start of the new holiday season with the opening of its new... Local News\nPatrington Champions Come to Parliament 13th March 2025 Humber Police Lifestyle Award Winners, The Patrington Champions, visited local MP Graham Stuart in the Houses of Parliament as part of their prize of a trip to... Local News",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_events_feed/content_34.html": null,
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-fighting-protect-our-ps168-million-local-transport-fund-government/content_51.html": "In response to a recent question by Graham, the new government has refused to confirm that the transformational Local Transport Fund will be awarded to Beverley and Holderness.\nGraham will now be re-doubling his efforts to save this fund in the wake of the new government seemingly ignoring the needs of rural communities like Beverley and Holderness.\nThe £168 million Local Transport Fund was introduced by the previous Conservative government to transform transport in rural communities in the north following the cancellation of the Northern leg of HS2.\nGraham saw this as a great opportunity for the area and over 750 people responded to his call for ideas – with ideas ranging from funding a new study to build a new railway link between York and Hull to covering bus stops and filling in pot holes.\nNow, it’s under threat from the government. In response to a question from Graham, asking the Department for Transport to confirm how much the East Riding would receive, the answer was non-committal.\nThere is a history of Labour figures opposing the Local Transport Fund while in opposition.\nGraham has written to the new Secretary of State, Louise Haigh, to clarify why the government is even reconsidering this funding, which could transform transport in the East Riding for generations to come.\nGraham is a champion of improving transport in the local area. He has helped lead the charge for the proposed York to Hull Rail, supported the Council in getting government funding for improvements to the Jock’s Lodge junction south of Beverley and led the case for halving tolls across the Humber Bridge.\nGraham Stuart commented: “If anywhere needs government investment in transport, it’s Beverley and Holderness.\n“That’s why I fought to secure this funding to improve our roads, railways, cycleways footpaths and buses; and it’s why I set up my survey to get local ideas for local transport.\n“If this £168 million is taken away from us we’ll be left with scraps from a government party which has always prioritised big cities.\n“I’m disappointed that I’ll have to prove to the government once again that local transport priorities are best understood by local people.”\nRoy Begg, Project Manager of Minsters Rail Campaign, said, “We were delighted to hear that East Riding Council would be receiving funding to invest in local transport projects, and it is vital that the new Government keeps that promise.\n“The York to Hull via Beverley railway would be transformational for the area, unlocking the huge potential of the towns along the route.\n“Graham has long been a friend of the Minsters Rail Campaign, and we know he’ll make the case to the Government to deliver this vital funding.\n“We knew that Levelling Up was dropped from the Department’s name, but it now seems as though Levelling Up is being completely abandoned by a government which will always put the big cities first.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_rail-minister-beverley-york-railway-has-potential/content_47.html": "Graham Stuart, MP for Beverley and Holderness and parliamentary sponsor of a bid for funding to help restore the direct rail route from Beverley to York, has said that he remains ‘optimistic’ about the project’s future, despite the proposal being initially turned down by the Government.\nBack in June, the MP submitted a bid to restore the 32-mile length of track from Beverley to York to the Department for Transport’s Restoring Your Railway Fund. Billed as an opportunity to reduce traffic along the A1079 – boosting job opportunities and tourism in the area – the project has been rejected at the second round of funding.\nIn total, 111 bids have been submitted by 219 MPs, all of which have been evaluated by a panel chaired by the Rail Minister, Chris Heaton-Harris MP, which also included the Chair of Network Rail, Sir Peter Hendy, and Isabel Dedring – the former London Deputy Mayor for Transport.\nDespite this setback, the Rail Minister has described the proposal as having ‘potential’, and there will be an opportunity to strengthen the bid before submitting a revised case to the next round of funding. There remains strong local backing for the scheme in the area with East Riding of Yorkshire, City of York, Hull City and North Yorkshire County Councils all expressing their support, as have York MPs Julian Sturdy and Rachael Maskell and Humber MPs Dame Diana Johnson and David Davis.\nGraham said, “This is of course disappointing news, particularly after the hard work of the Minsters Rail Campaign and East Riding Council to work up and submit the bid back in the summer.\n“But this is definitely not the end of the line. Support for the project is still there, and there’ll now be opportunities to strengthen our bid and submit an even better case in a future funding round with the help of feedback and workshops from the Government.\n“I will continue to do all I can to support this bid as I want to see greater investment into infrastructure in our area.”\nSuccess in the Government fund would mean the Department for Transport covering up to 75% of the costs of carrying out extensive transport and economic studies so that a comprehensive business case can be created. Future funding to develop projects would be subject to agreement of the business case.\nThe proposed Beverley-York line would branch off the existing Hull-Scarborough route which runs through Beverley, with stops at Market Weighton, Pocklington, Stamford Bridge and Haxby – which has just been successful in the Government’s New Stations Fund.\nGraham added, “The most recent census indicated that about a quarter of East Riding residents commute to either Hull or York, so I really think this train service would provide a popular alternative to the congested roads and sparse bus services we have at the minute.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_cdn-cgi_l_email-protection/content_14.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_FairFares/content_7.html": "In January 2023 the Conservatives brought in a £2 cap on bus fares to increase use of buses.\nAnd it worked. In East Yorkshire, patronage increased and interurban routes have grown.\nNow the government has put the fare cap at risk.\nThat's why Graham is campaigning to keep the £2 bus fare cap - fair fares for bus users.\nSign the petition, and let me know about your bus use, below.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_defibrillator-campaigner-graham-stuart-mp-joins-calls-local-schools-sign-restart-heart-day/content_42.html": "Graham Stuart, MP for Beverley and Holderness, has written to secondary schools in his constituency to encourage them to register for Yorkshire Ambulance Service’s (YAS) ‘Restart a Heart Day’, which is taking place on Friday 16th October.\nGraham said, “I think there’s a fear about performing CPR, or using defibrillators, especially when people feel they don’t know exactly what to do. It’s actually very easy, and Restart a Heart Day is an opportunity to become familiar with the techniques.\n“Every minute without CPR or a defibrillator reduces someone’s chances of survival by about 10%, while generally only about 8% of people survive an out-of-hospital cardiac arrest in the UK – so it genuinely is a case of life and death.”\nRestart a Heart Day is run in conjunction with the Resuscitation Council, the British Heart Foundation and St John Ambulance, with the equipment provided free of charge. Over the last 6 years, it has provided training to over 151,000 children at 82% of secondary schools across Yorkshire.\nGraham is the Chair of the CADEY (Community Access Defibrillators for East Yorkshire) campaign, which brings together local health professionals including YAS, with the aim of reducing the number of communities in Beverley and Holderness that are without a publicly accessible defibrillator.\nHaving started the campaign in Spring 2018 with approximately 60 communities without a publicly accessible defibrillators, this has been cut nearly in half since. CADEY aims to have full coverage of all rural communities in Beverley and Holderness by the end of 2020.\nGraham added, “Not only does CADEY aim to achieve full defib coverage of the rural communities in Beverley and Holderness, but we will increase awareness of how to use these live-saving machines and where they are, which is why it’s so important that schools sign up to Restart a Heart Day.\n“CADEY is offering match funding schemes, or even full-funding, with the help of our partners like the Smile Foundation, Help for Health, NURSE and Esh Construction and we are working with parish councils, local community groups, businesses and farmers to get public access defibrillators in every community across the constituency.\n“If your community doesn’t have a defibrillator yet, then please get in touch with me and we’ll get one organised. Over the summer I’m planning to cycle to visit the communities in Beverley and Holderness which still don’t have a defib – so the fewer I have to visit the better as it means we’ll be making good progress.”\nMartha Hogg’s lifesaving story has been celebrated in a video released by YAS to mark the launch of their Restart a Heart Day campaign, at youtu.be/H94mSj1Gs-8. The deadline for schools to apply is Friday 3rd April.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-talktv-jeremy-kyle/content_48.html": "Following concerns from Easington Parish Council and a number of residents, Graham, Cllr Sean McMaster and Cllr Lyn Healing met Northern Powergrid to raise concerns about persistent short power cuts in the area. During the meeting with the local MP, councillors and Northern Powergrid, th",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_news_graham-presses-broadband-pole-concerns-minister/content_31.html": "Graham has written to Julia Lopez, Minister for Digital Infrastructure, to put the demands of residents forward.\nGraham laid out five demands regarding the ‘ugly and unnecessary’ telegraph poles, which have blighted Hedon since September and Beverley since December, with poles erected by MS3 and Connexin where underground ducts owned by KCOM already exist.\nOver the past few months, Graham has been in regular contact with the companies, ministers, Ofcom, other MPs in the area, the Council, welcomed campaigners to Parliament and more besides.\nGraham’s letter makes five requests of the minister, following appeals from over 200 residents.\nHe asked for the Department for Science and Technology to remind KCOM of its responsibilities to provide fair access to its ducts. While KCOM has contended that it does provide access, MS3 and Connexin claim that it is economically unviable to use their ducts when compared with Openreach’s pricing, which they use elsewhere in the country.\nHe has requested that the Department create a code of conduct for the erection of broadband poles, so that they are not erected in egregious places like a few feet in front of peoples’ front rooms.\nHe has requested a review into permitted development, which is what allows the poles to be erected. Graham contends that while poles could be appropriate in areas where there is no economic case for ducts, in areas where they already exist sharing of infrastructure should be the only available option to network builders.\nHe has also requested that the code of conduct in the Electronic Communications Code be made mandatory for network builders to follow. He is concerned that companies have no incentive to engage with the community, and that engagement should be enshrined in the code.\nBeverley and Holderness MP Graham Stuart said: “Residents are fed up with the poles nightmare.\n“I’m against these ugly and unnecessary poles, and it’s disappointing that the situation hasn’t changed since September last year.\n“Most residents don’t want to see these poles close to their front gardens, even if they are desperate for cheaper broadband bills.\n“My conversations with ministers are ongoing, but the people of Beverley and Holderness demand action now, and I will continue to press the Government to provide that action.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_FarmTax/content_39.html": "Labour's Family Farm Tax will stop farms being passed to the next generation.\nThreatening our food security\nRisking jobs\nLeading to food prices rising.\nSTOP THIS. SIGN THE PETITION:\nLabour's Family Farm Tax will stop farms being passed to the next generation.\nThreatening our food security\nRisking jobs\nLeading to food prices rising.\nSTOP THIS. SIGN THE PETITION:",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_accessibility/content_26.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_its-all-tricks-and-no-treats-todays-halloween-budget-broken-promises/content_18.html": "Graham has branded the first Labour Budget delivered since the election as a Budget of Broken Promises, which will create new burdens on working people despite Labour’s repeated promises not to.\nChancellor Rachel Reeves used today’s Budget to u-turn on many promises made in their manifesto and make life harder for the working people many voted for them to protect.\nThe Chancellor announced £40 billion of tax rises – the highest increase in over thirty years.\nLabour has let down farmers by removing family farms from inheritance tax, potentially leading to the end of the family farm.\nThrough measures such as increasing employer National Insurance Contributions, Labour is throwing away the legacy of 4 million jobs created under the previous Conservative government.\nHard-working people face a 1.2% rise in Employer National Insurance Contributions, which the Office for Budget Responsibility says will be passed on ‘entirely’ to working people.\nCapital Gains Tax will increase by 8% - hitting working people’s hard-earned savings and investments hard.\nThe Prime Minister, Sir Keir Starmer, had previously pledged, on the floor of the House of Commons, that Labour ‘Made an absolute commitment not to raise tax on working people’.\nThis has now been comprehensively broken with £40 billion in tax rises.\nThe government had already announced, that the Winter Fuel Payment will be cut for tens of thousands of pensioners across Beverley and Holderness.\nLabour had pledged not to cut pensioner benefits during the election campaign.\nLabour promised not to increase borrowing and to follow the strict borrowing rules put in place by the Conservatives – a promise now broken by Rachel Reeves, who has created a new set of fiscal rules, enabling Labour to borrow more – a clear broken promise.\nBus fares will increase by 50% - meaning working people who use the bus will now have to find an extra £500.\nThe Office for Budgetary Responsibility has been clear in its view of the Budget – downgrading growth forecasts until 2029.\nGraham has been at the forefront of opposing the worst of the Government’s plans, including campaigning against the cut to the Winter Fuel Payment and this week’s announcement that the government will hit bus users with a 50% fare hike – a £500 cost to bus users.\nGraham Stuart MP said, “This Budget will go down in history as the Budget of Broken Promises.\n“People didn’t vote Labour to hike National Insurance Contributions, abolish the family farm, make pensioners freeze or add a £500 extra expense to anyone who takes the bus.\n“It’s just wrong for Labour to play fast and loose with the public finances, targeting working people, older people, farmers, bus users, drivers, and so many more besides.\n“The mask has slipped in this Halloween Budget. Sir Keir Starmer and Rachel Reeves always planned to raise taxes, let borrowing rip and break their promises.\n“It’s the working people of Beverley and Holderness who will pay the price.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com/content_1.html": "Putting Our Kids First Strengthening our Communities Getting Us Around Healthcare We Deserve Rural Fair Share Tough on Crime Northern Powergrid Commits to Improving Power Supply in Easington, Skeffling and Kilnsea 29th April 2025 Read full article Graham and South East Holderness Councillors pushing for answers on power cuts 23rd April 2025 Read full article Graham on TalkTV with Jeremy Kyle 23rd April 2025 Read full article Northern Powergrid Commits to Improving Power Supply in Easington, Skeffling and Kilnsea Following concerns from Easington Parish Council and a number of residents,… Graham and South East Holderness Councillors pushing for answers on power cuts People in Easington, Kilnsea, Out Newton and Aldbrough have been suffering from… Keep Pensioners Warm Fair Fares for Buses Protect Our Pensioners My map Am I your MP? Enter your postcode to confirm that Graham Stuart MP is your candidate. Postcode York to Hull Railway Telegraph Poles CADEY Contact Me Our Councillors\nNorthern Powergrid Commits to Improving Power Supply in Easington, Skeffling and Kilnsea 29th April 2025 Read full article\nGraham and South East Holderness Councillors pushing for answers on power cuts 23rd April 2025 Read full article\nNorthern Powergrid Commits to Improving Power Supply in Easington, Skeffling and Kilnsea Following concerns from Easington Parish Council and a number of residents,…\nGraham and South East Holderness Councillors pushing for answers on power cuts People in Easington, Kilnsea, Out Newton and Aldbrough have been suffering from…",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_new-york-hull-rail-link-would-boost-connectivity-opportunities-and-environment-say-people-east/content_50.html": "Graham Stuart, Member of Parliament for Beverley and Holderness, today announces the results of his survey about the proposed new York to Hull Rail Link, which he has long advocated.\nIn his survey of 196 residents of the East Riding of Yorkshire, 98% of respondents expressed support for the scheme, which was awarded £50,000 by the Department for Transport to fund an initial study into the line.\nAs anyone who lives in Beverley or Market Weighton and Pocklington know, access to York and Hull can be difficult, with insufficient bus links and an over-capacity road in the A1079. 20% of respondents to Graham’s survey cited road congestion as a reason for supporting the new rail link.\n27% cited connectivity as an important factor in their support for the new rail link, with the prospect of access to the wider rail network an important reason for backing the proposed line.\nThe environmental impact of taking cars off the road wasn’t lost on the almost 200 respondents, with 12% citing it as an important reason for creating the new line.\nAn AECOM study, completed in August 2022, indicates that a direct rail link could substantially increase journeys to work across the line, and significantly enhance access to the jobs markets in York and Hull.\nGraham has written to the rail minister, Huw Merriman, to request a meeting to advocate for funding for an engineering study, which would create a new route between the two cities (which preserves the popular bridleway along the old Minsters Line).\nBeverley and Holderness MP Graham Stuart said:\n“It’s not right that the two great Northern cities of York and Hull are separated by a journey of over an hour.\n“Creating a new York to Hull Rail Link, echoing the old Minsters Line, would unlock the East Riding’s potential.\n“My petition shows demand exists, and over a wide area, and this line would hugely improve the lives of people in Beverley, Market Weighton and Pocklington hugely.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_Humbleton/content_29.html": "East Riding Council has £168 million to spend on improving local transport.\nLet's spend some of that on fixing pot holes in Humbleton.\nEast Riding Council has £168 million to spend on improving local transport.\nLet's spend some of that on fixing pot holes in Humbleton.",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_news_funding-success-beverley-york-rail/content_54.html": "A bid to restore a 40-mile direct rail route between Hull and York has today been given the green light by Government Ministers.\nThe bid, sponsored by Beverley and Holderness MP Graham Stuart, will now receive support from officials at the Department for Transport as well as funding for 75% of the cost of creating a business case, up to a maximum of £50,000.\nThis business case is the first step towards developing more detailed proposals, which may lead to the Government and the private sector providing financial support for the delivery of the project.\nThe bid is one of 89 submitted during the third round of the fund, and one of almost 200 across all three rounds so far. Before today, only 25 bids have been given the go-ahead after being analysed by an expert panel including the Rail Minister, Chris Heaton-Harris, and Sir Peter Hendry, the Chair of Network Rail.\nCommenting on the success, Graham said: “This is fantastic news for the local area, and although this is only the first step it demonstrates there is recognition of the benefits this project could bring.\n“If we were in the South East, there’s no way that two cities as important as Hull and York wouldn’t have a decent rail link to help boost tourism and make it easier for commuters to get into work. It’d give my constituents in Beverley and Holderness more frequent services into the city centre and let them travel westwards without having to change at Hull.\n“Of course there will be kinks to work out, some people who’ll benefit from the scheme more than others, but that’s what the feasibility study and business case is for: to iron these out.\n“We’re lucky to have the cross-party support of local MPs and councils along the length of the line and I will be looking to build on this support as work progresses.”\nMPs who’ve written to support the bid include Dame Diana Johnson (Hull North), Emma Hardy (Hull West & Hessle), David Davis (Haltemprice & Howden), Julian Sturdy (York Outer) and Rachael Maskell (York Central).\nThe bid is also being supported by the international engineering firm AECOM, who have been brought in to advise on the line of route. AECOM have also been involved with the redevelopment of the Northumberland Line, connecting Newcastle and Ashington via Blyth.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_northern-powergrid-commits-improving-power-supply-easington-skeffling-and-kilnsea/content_25.html": "Following concerns from Easington Parish Council and a number of residents, Graham, Cllr Sean McMaster and Cllr Lyn Healing met Northern Powergrid to raise concerns about persistent short power cuts in the area.\nDuring the meeting with the local MP, councillors and Northern Powergrid, the company acknowledged that, while power cuts are inevitable in rural areas, they need to do more to provide consistent power to Easington, Skeffling and the surrounding areas.\nThe power cuts, which have been short but persistent over the course of several months, have been causing residents of the Holderness villages, especially the elderly, to be concerned.\nThese outages are caused by routine failures of poles and vegetation encroaching on the power lines.\nNorthern Powergrid has committed to a schedule of works over the coming months to improve the resilience of the power grid.\nGraham said, “Having power is the basis for more or less everything in the twenty-first century.\n“That’s why it’s so disappointing to hear that people in Easington, Skeffling, Kilnsea and beyond are having regular power cuts.\n“Alongside your local councillors Lyn Healing and Sean McMaster, I’m working closely with Northern Powergrid to make sure the works to improve the power network are done and I’m pleased we now have a deadline.\n“We’ll be keeping a close eye on how it progresses.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-welcomes-hedon-poles-campaigners-parliament/content_55.html": "Graham Stuart, MP for Beverley and Holderness, yesterday (8th November 2023) welcomed campaigners from Hedon to Parliament to discuss next steps in their campaign to rid Hedon of the scourge of MS3’s telegraph poles, designed to deliver low-cost, high-speed broadband to the town.\nThe campaigners set out their stall over a range of different concerns to the MP, including the role of regulations in this case, companies sharing infrastructure and much more besides.\nFollowing the meeting, campaigners met Emma Hardy MP (Lab, Hull West and Hessle) to press concerns about a similar proliferation of poles in Hessle and Hull.\nFollowing the meeting with Graham, he wrote immediately to Sir John Whittingdale, Minister for Digital Infrastructure, to request answers to the campaigners’ questions and provide greater clarification on the regulations campaigners believe have been exploited by MS3.\nTime is of the essence, with poles going up around Hedon and the possibility of other towns and villages having these poles.\nGraham has been working on this matter since September, when he became aware of the protests beginning. He met with MS3, East Rising of Yorkshire Council and campaigners.\nHe has lobbied Sir John via letter and in person and has written to Ofcom to highlight the sorry state of broadband competition in the East Riding following meetings with MS3 and KCOM.\nHe has also worked with East Riding of Yorkshire Council and the police regarding concerns about work practices by MS3’s contractors, including erecting poles overnight.\nEast Riding Council issued a Stop Works Notice following reports of out-of-hours working on 1st November. Graham hopes the Council will continue to use the powers granted to it under the Electronic Communications Code 2003 where required to ensure the safety of residents and workers.\nCommenting, Graham said, “It was a pleasure to welcome campaigners to London, and I hope they found our meeting as productive as I did. I think they’re doing a great job highlighting this issue and I’m keen to continue to help them in any way I can.\n“What I’ve done immediately is to take their points to the Minister to see what can be done to tighten up the regulations and guidelines to encourage the companies to work together for the interests of the residents.”\nRepresentatives of the Going Underground Campaign Group said, “In the end, somebody had to intervene and take matters to a legislative level, and Graham Stuart MP helped facilitate getting the campaigners a voice at a national level.\n“The trip to Parliament has helped identify some of the problems that have allowed MS3 Networks to ride roughshod over communities.\n“And we feel that the balance of power is starting to shift from those who have 'permitted development' rights to plant poles, to those communities who have not given their permission for telegraph poles.”\nCllr Steve Gallant (Lab, South West Holderness) said, \"Good to meet with Graham Stuart and Emma Hardy to press our concerns. The nub of the problem is the regulations set by the Government last year are letting our community down.\nThey need tightening up to give Planning Authorities the power to intervene and insist infrastructure goes underground wherever possible. I hope the Minister takes this on.\"",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-and-south-east-holderness-councillors-pushing-answers-power-cuts/content_58.html": "People in Easington, Kilnsea, Out Newton and Aldbrough have been suffering from regular power cuts over the past year leaving elderly people vulnerable\nEasington Parish Council got in touch with local MP Graham Stuart, as well as their ERYC Councillor Sean McMaster, to see whether they could influence supplier Northern Power Grid to get their act together and provide a reliable electricity supply.\nGraham and Cllr McMaster are meeting Northern Power Grid on Thursday to demand answers from the power supplier, including a detailed schedule of works to upgrade the transformers, faults on underground power cables and other factors that are affecting the overhead power network.\nGraham and Cllr McMaster have often worked together, including recently to repair flood defences at Humber Bank.\nGraham, as the MP for Beverley and Holderness, has helped thousands of residents in his twenty years representing the area in Parliament. He holds regular street surgeries (https://www.grahamstuart.com/surgeries) where any resident is available to meet him with problems small or large and is available via email at [email protected].\nGraham Stuart, Member of Parliament for Beverley and Holderness, said, “It’s pretty basic to have reliable power in our homes, but some people in Easington, Aldbrough, Kilnsea and beyond aren’t getting that at the moment.\n“I’m grateful for all the residents who have got in touch, as well as Easington Parish Council.\n“I’ll be demanding answers from Northern Power Grid, on your behalf, with your local councillors.”",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_CADEY/content_23.html": "If you suffer a Sudden Cardiac Arrest, a defibrillator could save your life. For every minute your heart isn't restarted by a defibrillator, your chances of survival would decrease by 10%.\nSo in rural communities, a sudden cardiac arrest could be a death sentence when it doesn't need to be.\nThat's why I started CADEY alongside Yorkshire Ambulance Service and HEY Smile - to help complete our defibrillator network in the East Riding.\nWorking together with businesses and individuals, we've installed twelve defibrillators so far, and are on the hunt for locations in more villages.\nMaybe you can help us? Get in touch with the form below if you know somewhere in your community where a defibrillator could go, and maybe it will save a life.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-fighting-against-pms-ps500-bus-fare-hike/content_19.html": "Graham has called on the Prime Minister to reverse his decision to increase the £2 bus fare cap by 50% to £3, a £500 tax on working people.\nIn a speech in the West Midlands yesterday, the Prime Minister confirmed reports in the media that the government would not maintain the £2 bus fare following its expiry in January, instead choosing to hike it by 50% to £3.\nGraham launched a petition to save the £2 bus fare last week, and over 650 people have already signed his Fair Fares petition, available at www.grahamstuart.com/FairFares.\nGraham is outraged, with working people using the buses to get to and from work facing a £480 annual increase in their commuting costs alone, not to mention going to and from the shops or visiting families.\nHe has long been a champion of bus travel, particularly the need for rural and coastal communities to be better connected.\nHe supported the Council’s efforts in improving the 75 bus timetable between Hull, Hedon and Withernsea last year and is working with Cllr Samantha Whyte (Mid Holderness, Con) to improve connectivity to and from Withernwick.\nGraham Stuart MP said, “Working people are apparently at the heart of this government’s thinking, yet one of its first concrete acts is to increase the bus fare cap by 50%, costing working people in Beverley and Holderness more than £500 a year.\n“It’s outrageous to assume that working people can just find that money behind the sofa and will only result in working people feeling the pinch even more.\n“In less than a week, over 650 people have signed my petition to save the £2 Fair Fare for buses. I’ll continue to be a loud voice for the thousands of people in Beverley and Holderness who depend on buses.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_contact/content_2.html": "Skip to main content\nMain navigation\nHome\nNewsletter\nNews\nMy Plan\nMy Views\nStreet Surgeries\nAbout Me\nContact\nContact\nLeave this field blank\n9 Cross Street, Beverley HU17 9AX\n01482 679 687\n[email protected]\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_campaigns_diagnostic-tests/content_57.html": "It's not right for people to have health problems but not get the care they need.\nThat's why I'm working with the local NHS to make sure we can get more diagnostic tests, in a way that doesn't overwhelm our GPs.\nWhat I've Done\nSupported the NHS's drive for 3,000 lung health checks in Withernsea.\nVisited East Riding Hospital's new Community Diagnostic Centre.",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_news_hull-east-yorkshire-mps-meet-telecoms-executives-about-telegraph-poles/content_33.html": "Yesterday, Hull and East Riding Members of Parliament met with the chief executives of KCOM, MS3, and Connexin.\nThe meeting, organised by Sir David Davis MP and held in Parliament with local MPs including Dame Diana Johnson, Graham Stuart and Karl Turner, sought to find a resolution to the issue of duplicate poles being erected in streets across East Yorkshire by entrants to the local broadband market.\nThe meeting saw a very frank exchange of views and strong cross-party condemnation of the behaviour of the telecom firms.\nAll MPs attending the meeting were clear that the failure to share infrastructure was having an unacceptable impact on their constituents, who are seeing their areas blighted by a proliferation of telegraph poles.\nA clear request was made to the chief executives to come together to find a solution to sharing infrastructure and prevent further disruption being caused to residents.\nTo that end, a meeting is taking place between Connexin's chief executive, Furqan Alamgir, and KCOM's chief executive, Tim Shaw, on Monday 22 January intending to resolve the outstanding issues.\nThe MPs have requested the chief executives attend a further meeting after Connexin's meeting with KCOM to provide MPs with an update.\nSpeaking after the meeting, Graham Stuart MP said:\n“It’s good to have MS3, Connexin and KCOM in a room together to explain their actions regarding poles in the East Riding and Hull.\n“All MPs in the area have had significant public concern about the erection of these poles, and the public is very clear: they deserve better than to be pawns in telecommunication companies’ network rollouts.\n“I’ll continue to encourage companies to engage better with the public and take complaints seriously, while MPs work with the Government and Ofcom to find a long-term solution to providing broadband competition in our area.\n“I’m clear that the right place to deliver broadband is underground – and all companies should be working together to achieve that.”\nSir David Davis KCB MP said:\n\"The meeting brought a real focus to the issue.\n“Residents have, for far too long, felt like their concerns are not being heard and they are simply being swept aside by companies doing what best suits them.\n“KCOM and the new entrants to the market now need to work together to start sorting this out.\n“Working with colleagues in Parliament, we will raise this with the Secretary of State and Ofcom to find a long-term solution to the broader issues affecting the local broadband market.\"\nDame Diana Johnson MP said:\n\"Unwanted telegraph poles have been cluttering Hull streets, appearing in often inappropriate places and without consultation, following changes to the law made a decade ago.\n\"Hull and East Riding MPs had a frank exchange of views with the Chief Executives of KCOM, Connexin and MS3 to look for a solution for residents in our constituencies.\n\"We will continue working together cross-party on this issue.\"\nKarl Turner MP said:\n\"I have long been working on this important issue on behalf of residents in East Hull, therefore I was pleased to see KCOM, MS3, and Connexin coming together yesterday to work to address the concerns of the residents regarding the placement of poles in the Hull and the wide area.\n“Many local residents have been vocal about their dissatisfaction with how telecommunications companies prioritise their own interests over the needs of the community. Therefore, it is imperative that these companies work together to find a resolution to this issue.\"\nKCOM Chief Executive, Tim Shaw said:\n“I was more than happy to meet with our local MPs and other broadband providers yesterday to discuss the issue of telegraph poles which is affecting so many local communities. Indeed, I have been in regular contact with all local stakeholders for the past year. It was a great opportunity to publicly restate our position that we stand ready to work with other providers to provide fair and reasonable access to our infrastructure should they apply in the correct manner, which has always been the case. I look forward to the meeting with Connexin on 22 January, to discuss the request for infrastructure access they made, just before Christmas.\"\nConnexin Chief Executive Furqan Alamgir said:\n\"Connexin has for years tried working with KCOM to service broadband demand in Hull and the East Riding. This is evident in Connexin being KCOM’s largest wholesale partner providing residential broadband connections in the Humber region. However, this relationship has been challenging with behaviour, which we feel has been anti-competitive.\n\"This incumbent behaviour has meant we have had no option but to build our own infrastructure. We, and others, have tried to challenge KCOM, but like all monopolies, we feel KCOM is not sufficiently incentivised nor motivated to share. This is not new. The same problem existed with BT/Openreach and the only solution was regulation.\n\"We are therefore very supportive of Sir David Davis and the MPs across the Humber region who are pushing for more effective regulation of KCOM's network sharing just as Openreach is regulated across the rest of the UK. Only then will customers see lower prices for faster broadband using existing ducts and poles in the areas covered by KCOM.\"",
  "http_www_grahamstuart_com_/https_www_grahamstuart_com_news_graham-welcomes-hedon-poles-campaigners-parliament/content_37.html": "Graham Stuart, MP for Beverley and Holderness, yesterday (8th November 2023) welcomed campaigners from Hedon to Parliament to discuss next steps in their campaign to rid Hedon of the scourge of MS3’s telegraph poles, designed to deliver low-cost, high-speed broadband to the town.\nThe campaigners set out their stall over a range of different concerns to the MP, including the role of regulations in this case, companies sharing infrastructure and much more besides.\nFollowing the meeting, campaigners met Emma Hardy MP (Lab, Hull West and Hessle) to press concerns about a similar proliferation of poles in Hessle and Hull.\nFollowing the meeting with Graham, he wrote immediately to Sir John Whittingdale, Minister for Digital Infrastructure, to request answers to the campaigners’ questions and provide greater clarification on the regulations campaigners believe have been exploited by MS3.\nTime is of the essence, with poles going up around Hedon and the possibility of other towns and villages having these poles.\nGraham has been working on this matter since September, when he became aware of the protests beginning. He met with MS3, East Rising of Yorkshire Council and campaigners.\nHe has lobbied Sir John via letter and in person and has written to Ofcom to highlight the sorry state of broadband competition in the East Riding following meetings with MS3 and KCOM.\nHe has also worked with East Riding of Yorkshire Council and the police regarding concerns about work practices by MS3’s contractors, including erecting poles overnight.\nEast Riding Council issued a Stop Works Notice following reports of out-of-hours working on 1st November. Graham hopes the Council will continue to use the powers granted to it under the Electronic Communications Code 2003 where required to ensure the safety of residents and workers.\nCommenting, Graham said, “It was a pleasure to welcome campaigners to London, and I hope they found our meeting as productive as I did. I think they’re doing a great job highlighting this issue and I’m keen to continue to help them in any way I can.\n“What I’ve done immediately is to take their points to the Minister to see what can be done to tighten up the regulations and guidelines to encourage the companies to work together for the interests of the residents.”\nRepresentatives of the Going Underground Campaign Group said, “In the end, somebody had to intervene and take matters to a legislative level, and Graham Stuart MP helped facilitate getting the campaigners a voice at a national level.\n“The trip to Parliament has helped identify some of the problems that have allowed MS3 Networks to ride roughshod over communities.\n“And we feel that the balance of power is starting to shift from those who have 'permitted development' rights to plant poles, to those communities who have not given their permission for telegraph poles.”\nCllr Steve Gallant (Lab, South West Holderness) said, \"Good to meet with Graham Stuart and Emma Hardy to press our concerns. The nub of the problem is the regulations set by the Government last year are letting our community down.\nThey need tightening up to give Planning Authorities the power to intervene and insist infrastructure goes underground wherever possible. I hope the Minister takes this on.\"",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_about-rss/content_24.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_pubs/content_21.html": "Our pubs are great. I don’t need to tell you why. In fact, as pubs are facing an ever-tougher time with tax hikes, rising bills and staffing costs increasing, I want you to help me celebrate them.\nAnd we have a lot of them to celebrate. 97 in Beverley and Holderness alone.\nSo, what is the favourite thing about your local? It could be the beers on cask, the garden or the locals. Maybe it sponsors the local football team or has a quiz night.\nOur pubs are part of what makes Yorkshire, Yorkshire. So, let’s celebrate them together.",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_mps-joining-forces-support-people-down-syndrome/content_41.html": "Three years after becoming law, the landmark Down Syndrome Act 2022 is still to be delivered by the government.\nFollowing a debate led by senior Conservative MP Graham Stuart to commemorate World Down Syndrome Day on 21st March, various Down Syndrome campaigners and MPs are calling on the government to implement the Down Syndrome Act now and ensure that everyone receives the support they need.\nDespite the Down Syndrome Act passing through the Houses of Commons and Lords with unanimous support, three years on the Act is still yet to come into force.\nGraham is concerned that other groups are seeking to use the provisions of the Act to support those with learning disabilities unrelated to Down Syndrome, causing delays to guidance being issued relating specifically to the needs of those with Down Syndrome.\nThe Act requires the government to issue specific guidance on how to support people with Down Syndrome.\nMPs were disappointed in the Minister’s response to numerous heart-felt speeches in Westminster Hall on Wednesday evening, which failed to commit the government to issue guidance to institutions or even commit to a meeting with concerned MPs.\nThe Down Syndrome Act, which became law in April 2022, compels schools, employers, healthcare providers and other organisations to give appropriate, tailored support to those with Down Syndrome.\nSir Liam Fox, sponsor of the Down Syndrome Act, said: “A hugely disappointing response which looks as though the Civil Servants are in charge at the Department of Health rather than Ministers.\n“That is why we need the Health committee to launch an enquiry to ensure those with Down Syndrome get the specific help they need.”\nMillie Anna, Advisor for the National Down Syndrome Policy Group, who attended the debate weighed in, “What I want to say to the government is please let’s all put our heads together to make sure this guidance is truly meaningful and robust.\n“I know you can do this and for the sake of all of us with Down Syndrome, let’s get this done!!”\nGraham Stuart, Member of Parliament for Beverley and Holderness, said, “People with Down Syndrome deserve to have the support they need to thrive, and Liam Fox’s Down Syndrome Act sought to do just that.\n“Three years on, I don’t understand how the government continues to drag its feet on issuing guidance, as required by the Act.\n“The Down Syndrome Act was passed unanimously, with support from the Conservatives, Labour and all other parties.\n“Successive governments have failed to implement the guidance needed to implement this act, despite it being the will of Parliament. The political will is there, but it seems to be blocked in the corridors of Whitehall.\n“People with Down Syndrome deserve better.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_news_graham-and-east-yorkshire-farmers-join-forces-against-family-farm-tax/content_40.html": "Following the government’s announcement that it will introduce a new Family Farm Tax, a group of local farmers met Graham at his regular street surgery in Skirlaugh on Saturday.\nIn a good-natured demo, Graham and the farmers received support from across the community, including Skirlaugh institution the Lazy Bean Café, which provided hot drinks to the farmers while car horns sounded in support.\nThe farmers presented the campaigning MP with a list of demands, including:\n- Reversal of the changes made to APR (Agricultural Property Relief) and BPR (Business Property Relief).\n- Recognition that the government figures of only 27% of farms being affected is incorrect and based on historic, skewed data.\n- Review of the acceleration of the phase out of farming support schemes until satisfactory replacement schemes are made available.\nGraham has been at the forefront of opposition to the changes to APR, which would have an untold impact on small farms. The National Farmers Union suggests that almost no working farms have a value of under £1 million.\nThe new tax is expected to raise £230 million in 2026-27, approximately 0.023% of the government’s total tax take.\nOver 700 people have already signed Graham’s petition against the tax, available at www.grahamstuart.com/FarmTax.\nGraham is very concerned about the government’s data leading to the £1 million threshold, which will see inheritance tax imposed on small, family farms. He has asked the Chancellor to explain her figures.\nIn the Budget, the government announced plans to end the Basic Payment Scheme early, leaving recipients losing 76% of their subsidy. A farmer who was to receive £100,000 from the Basic Payment Scheme this financial year will now only get £8,000.\nGraham said, “I’ve represented a rural constituency for almost twenty years, and our farmers are very close to my heart.\n“I’ve never seen a government attack on farmers like this – not only their subsidies but to attempt to end the Family Farm is a blatant attack on our farming community.\n“Sir Keir Starmer promised to protect the family farm, and that promise is now in tatters.\n“Farmers expect better, and I’m looking forward to meeting many of them in Parliament on Tuesday to make as much noise as possible.”",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_east-riding-yorkshire-ward-councillors/content_3.html": "(Image credit: Nilfanion/CC-BY-SA-3.0)\nThese are the Conservative councillors serving wards in the Beverley and Holderness constituency.\nSOUTH EAST HOLDERNESS WARD\n____________________________________________________________________________________________\nEmail: [email protected]\n____________________________________________________________________________________________\nCllr Lyn Healing\nPhone: 07724 901 527\nEmail: [email protected]\n________________________________________________________________________________________\nMID HOLDERNESS WARD\nCllr Samantha Whyte\nEmail: [email protected]\n____________________________________________________________________________________________\nCllr Amanda Talbot\nPhone: 07957 241326\nEmail: [email protected]\n____________________________________________________________________________________________\nCllr John Holtby\nPhone: 01964 562235 / 07710 354616\nEmail: [email protected]\n____________________________________________________________________________________________\nSOUTH WEST HOLDERNESS WARD\nPhone: 01482 899214\nEmail: [email protected]\n____________________________________________________________________________________________\nCllr Sue Steel\nMobile: 07754 298952\nEmail: [email protected]\n____________________________________________________________________________________________",
  "http_www_grahamstuart_com_/http_www_grahamstuart_com_privacy/content_6.html": "This document outlines how Graham Stuart MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Graham Stuart MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Graham Stuart MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Graham Stuart MP, or public interest. These cover processing to conduct casework and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in schedule 1 of the Data Protection Act, covering elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Graham Stuart MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302PF"
}