{
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_zoees-campaigns_fairer/content_25.html": "Fairer\nEveryone deserves to make the most of their potential. I want to create more equitable opportunities for residents in Guildford and our villages.\nDemanding health services are properly funded\nI am demanding more support for overstretched local GPs, better access to dental care and properly funded mental health support that is available and accessible to everyone when they need it.\nI have been pushing the Government to increase funding for hospices so that those who need these services can access them.\nFair learning opportunities for everyone\nI am passionate about high quality life-long education. I am campaigning for catch-up funding and proper investments in schools, colleges and universities as well as improving access to apprenticeships and vocational training.\nYears of neglect under the previous Conservative Government have left too many families across Guildford and our villages desperately struggling to get their children the support they need. Cash-strapped schools are doing their best to provide complex SEND support, but too many vulnerable children are being failed. Families and schools are crying out for help.\nThat’s why the Liberal Democrats and I are calling for a National Body for SEND - making sure that young people with the highest needs can receive the education they need.\nI have also voted against the Government's decision to introduce VAT on independent school fees. I believe that parents should have the choice to select the type of education most appropriate to their children and that this poorly thought through policy will only make the crisis in SEND provision worse.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_page-1/content_6.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nAs the Liberal Democrat MP for Guildford constituency, I am a committed advocate for the liberal values of inclusivity, opportunity, and equality. I am proud to be the voice of our communities across Guildford in Westminster, working hard on behalf all my constituents.\nSign up below for Zöe Franklin MP's regular newsletter\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_18th-october-2024-newsletter-first-100-days/content_31.html": "18th October 2024 Newsletter - First 100 Days\nIt’s hard to believe it’s been more than 100 days since I was elected as Guildford constituency’s new MP! I am honoured to represent the residents of Guildford and our villages and I am committed to being a voice for every corner of our vibrant constituency. Here's a brief update on what I’ve been up to during my first months in Westminster and beyond.\nMaking My Mark in Parliament\nOn the 11th September, I had the honour of delivering my maiden speech. I took the opportunity to express my deep pride in Guildford, its history, modern high-tech industry, and natural beauty. I pledged to fight for all residents by addressing the cost-of-living crisis and working to clean up our rivers. I also expressed thanks to my friends & family for their encouragement and support & my predecessors for their dedication and service.\nSince then, I’ve been actively participating in debates on key issues, including SEND provision, energy, and rail fares—pressing the government for urgent action to support our most vulnerable. I was proud to vote against the Labour government’s Winter Fuel Payment cuts and stand up for the needs of our community.\nFocused on Local Issues\nI’ve met with Thames Water, alongside the other five Surrey Liberal Democrat MPs, to address serious concerns about water infrastructure, bills and sewage pollution in our rivers. I’m committed to ensuring that we get a fair deal for Guildford residents.\nI’ve also been tackling rail travel issues, speaking up in Parliament to push for a freeze on rail fares and improvements to service, and I have met with Transport for the South East to discuss our wider transport infrastructure.\nMeeting the Community\nIt’s been a pleasure to engage with so many residents through virtual surgeries and regular door-knocking. Hearing your concerns firsthand helps me prioritise the issues that matter most. I’ve also had the privilege of visiting local landmarks such as Yvonne Arnaud Theatre to view progress on its refurbishment and attending community events such as the Guildford in Bloom awards and Pride in Surrey, which Guildford had the privilege of hosting this year.\nSupporting Local Charities\nIn constituency, I’ve had the opportunity to visit several fantastic charities, including Challengers and Cherry Trees UK, and attended numerous drop-ins in Westminster, learning about the critical work they do to support those in need. I’ll continue to advocate for these organisations, which are vital to our community.\nClimate and Nature\nEnvironmental issues remain at the forefront of my agenda. I joined fellow Liberal Democrat MPs (and other parties) in delivering the Zero Hour petition at 10 Downing Street, pushing for urgent action on the Climate and Nature (CAN) Bill. This is just the start of our work to protect our planet for future generations. (I am delighted that my Lib Dem colleague Dr Roz Savage is taking forward the CAN Bill as a Private Members Bill.)\nAnd Finally…\nI have been privileged to meet so many inspiring other local people since being elected. From hosting surgeries to participating in local forums like the Eastern Villages Flood Forum, I am here to listen and take action on your behalf. I look forward to many more months and years serving you, tackling issues both big and small.\nThank you for placing your trust in me as your MP. There is much more to come!",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_news/content_17.html": "Surrey Lib Dem MPs slam Thames Water as stats reveal an average of 591.9 MILLION litres of water wasted every day due to leaky pipes\nHelen Maguire MP, Al Pinkerton MP, Chris Coghlan MP, Monica Harding MP, Zöe Franklin MP and Will Forster MP have said “Ofwat must go” as new stats paint a terrible picture about just how much water is wasted every day because of leaky pipes.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_page-1/content_24.html": "Surrey Lib Dem MPs slam Thames Water as stats reveal an average of 591.9 MILLION litres of water wasted every day due to leaky pipes\nHelen Maguire MP, Al Pinkerton MP, Chris Coghlan MP, Monica Harding MP, Zöe Franklin MP and Will Forster MP have said “Ofwat must go” as new stats paint a terrible picture about just how much water is wasted every day because of leaky pipes.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_zoee-franklin-mp-to-attend-community-events-at-zero-on-26th-april/content_21.html": "Zöe Franklin MP to Attend Community Events at ZERO on 26th April\nZERO Carbon Guildford is excited to announce that Zöe Franklin MP will be attending two inspiring community events at ZERO on Saturday, 26th April. The events offer a unique opportunity for residents to get involved in impactful local initiatives - and to meet their local MP.\nZöe Franklin MP says: “I look forward to visiting these two great initiatives at ZERO Carbon’s new location on the 26th April.\nAs a parent I am all too aware of the incredible cost of dressing our children, especially when they were very small. Through the positive environmental impact of recycling and loaning out baby clothes, the Surrey Hills Baby Clothes Library has saved an incredible amount of waste from landfill while supporting local families through their free to use lending model.\nAs an environmental community hub, ZERO Carbon Guildford drives local action on issues including in this instance water quality. Their commitment to supporting sustainability initiatives is making a real difference in our community.\nI hope many of you will join me at these events.”\nWater Quality Blitz – River Testing Project\n📍 ZERO, Riverside Business Centre, Walnut Tree Close, Guildford, GU1 4UG\n🕒 10:00 AM – 12:00 PM\nResidents of Guildford are rolling up their sleeves on Friday, 26th April, to take part in a Water Quality Blitz hosted by ZERO Carbon Guildford, a local hub for environmental and community action.\nThe initiative aims to tackle rising concerns over pollution in Surrey’s waterways and contribute real data to national eff orts tracking river health highlighting environmental challenges and driving positive change.\nCommunity Baby Shower & Baby Clothes Library\n📍 ZERO, Riverside Business Centre, Walnut Tree Close, Guildford, GU1 4UG\n🕒 10:00 PM – 12:00 PM\nCelebrate new beginnings at our heart warming community baby shower! Families are invited to connect with others, go behind the scenes of the library, pick up essential items from the baby clothes library, and learn about sustainable parenting.\nThese events showcase the power of community-led action and highlight the work being done locally to support both people and the planet. Zöe Franklin MP’s attendance underscores her continued commitment to environmental and social sustainability in Guildford.\nDon’t miss this opportunity to get involved, meet your community, and chat with your MP. Everyone is welcome!\nFor more information, visit: www.zerocarbonguildford.org",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_15th-february-2025-newsletter/content_33.html": "15th February 2025 Newsletter\nA word on the local elections...\nI was deeply disappointed by the Government’s announcement that May’s local elections in Surrey would be cancelled as the county will be in the first wave of local government reorganisation.\nWhile I broadly support the proposals for reorganisation and devolution, I believe that the county needs more time to prepare given the myriad problems faced by Surrey County Council, from potholed roads to the crisis in Special Educational Needs and failings in child safeguarding.\nI also believe that the people of Surrey should have had the opportunity to hold their county councillors to account and chose who they wanted to lead the work to create new councils to serve them.\nOn top of this, there is the significant issue of debt held by local authorities across Surrey. I spoke in Parliament on Wednesday 5th February to raise this concern. Local organisations are justifiably concerned about the impact of this reorganisation on their finances as a result.\nI asked for a meeting between all Surrey MPs and the Minister for Local Government and English Devolution to discuss the issue of Surrey’s finances and I am very pleased that the Government agreed. I will keep you updated on the outcome of this meeting in due course.\nYou can watch my speech in full here.\nAddressing flooding issues across the constituency\nAs MP, I chair the local flood forums - Worplesdon, Eastern Villages and Burpham – which bring together residents and agencies such as Surrey County Council, Thames Water and the Environment Agency to address ongoing flooding problems. It has become clear that communities across the constituency are experiencing flooding problems and I am looking at ways to ensure that the whole constituency gets the support it needs to address them.\nPart of the problem with tackling flooding is funding, and on Thursday February 6th, I asked the Government to provide further details about how it will ensure communities like ours get the funding they need to address current flooding and mitigate for the growing issues we are experiencing in a holistic and sustainable way.\nCommunity News\nGuildford Flood Alleviation Scheme event\nA public event for the Guildford Flood Alleviation Scheme is being held on Saturday, 22nd February, from 12–5pm at The Electric Theatre. You’ll be able to learn about progress on the project in the past year, next steps, and share your views.\nThere will also be members of the project team there to answer any of your questions. An online event follows on Wednesday, 26th February, 7:30–8:30pm. More information is available on the project website and you can sign up for the project newsletter by emailing guildfordfloodscheme@environment-agency.gov.uk.\nUpdate on the North Street regeneration\nWork is underway on the North Street regeneration project with more preparation work set to take place over the next few months.\nWoodbridge Road has closed, with diversions expected to remain in place until approximately April 2026, at which people Leapale Road will be made two way.\nMeanwhile, utility diversion work has begun on North Street and Leapale Road, laying the groundwork for the next phase of the project.\nSt Edward has begun installed hoarding and scaffolding in preparation for the first demolition. This will create space for the new town square that will form the centrepiece of the regeneration.\nOn Monday 3 February, demolition work began. The first buildings to be removed will be the Old Post Office and others fronting North Street and Woodbridge Road. As this work progresses, pedestrian zones and hoarding lines will be put in place to ensure safety for all.\nThe final service diversions are taking place along North Street and at the junction with Woodbridge Road.\nDespite the scale of the work, local businesses outside the development site will remain open as usual, so residents are encouraged to continue supporting them.\nWith each step, North Street is moving closer to a vibrant new future. Further updates will follow as the project continues.\nTransport for the South East public consultation\nLast month, Transport for the South East (TfSE) published its Draft Transport Strategy, outlining a vision for the region’s transport future based on five key missions: strategic connectivity, resilience, inclusion and integration, decarbonisation, and sustainable growth.\nA public consultation on the strategy is now open until March 7th, and your feedback would be greatly valued. You can share your thoughts here.\nRail replacement buses over the February half term\nEngineers will be working between Portsmouth Harbour, Havant and Fareham between Saturday 15th and Friday 21st February. All routes into Portsmouth will be affected, with rail replacement busses in operation. Please check before you travel and plan accordingly. You can learn more on the South Western Railway website.\nAnd finally...\nThank you for taking the time to read my latest update. If you have any friends or family that you think might be interested in hearing from me, please encourage them to sign up via my website.\nI'm here to work for you. If you need my help, have any comments or suggestions, or if you feel there is a pressing issue you’d like me to raise, I’d love to hear from you. You can reach me at zoe.franklin.mp@parliament.uk.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_links-resources_cost-of-living-crisis-resources-help-and-advice/content_19.html": "Government Advice & Information\nThe latest government advice for households and businesses can be found by following the link here.\nIt is important to note that if you receive a text, email, or other form of communication asking you to apply for the new Energy Price Guarantee, it will likely be a scam. The discount is applied automatically, and there is no need to contact your energy supplier to ensure it is applied properly. You can report any suspicious messages by clicking the link here.\nWinter Fuel Payments\n- If you were born on or before 26 September 1955 you could get between £100 and £300 to help you pay your heating bills.\n- You will get your Winter Fuel Payment automatically (you do not need to claim) if you’re eligible and either:\n- Get the State Pension\n- Get another social security benefit (not Housing Benefit, Council Tax Reduction, Child Benefit or Universal Credit)\n- If you do not get either of these, or if you live abroad, you may need to make a claim\nWarm Homes Discount\n- A discount for some people getting Pension Credit or some people in low-income household.\n- This scheme will reopen in November and will allow households to secure a discount of up to £140 on their energy bills.\n- There are 2 ways to qualify for the Warm Home Discount Scheme:\n- you get the Guarantee Credit element of Pension Credit - known as the ‘core group’\n- you’re on a low income and meet your energy supplier’s criteria for the scheme - known as the ‘broader group’\n- When the scheme reopens you will be able to find information on how to apply here.\nLocal Support & Advice\nCAP Debt Advice\nFree help and support to get out of debt, budgeting, make your money go further, or finding a job.\nNorth Guildford Food Bank\nProvides temporary help to individuals and families struggling in the form of food parcels. To access this, you will need to get a referral from one of the organisations listed here.\nWhere: St Clare's Church, Park Barn\nWhen:\n- Mondays (for Donation Drop-Offs Only) 8:45 am – 10:30 am\n- Tuesdays 1 pm – 2 pm\n- Wednesdays 9:30 am – 10:30 am\n- Fridays 5:00 pm – 6:15 pm\nSalvation Army Food Bank\nThe Guildford Salvation Army Food hub operates is open twice a week at Woodbridge Road Church and Community Centre.\nYou can pick up or donate non-perishable food. Contact by email or phone to arrange a pick up time.\nWhere: Woodbridge Road, Guildford, Surrey, GU1 4QQ\nWhen: Monday and Tuesday 9.30am to 11.30am\nThe Hive\nThe Hive is nestled behind the trees along Park Barn Drive, just by Kings College School. The centre is an accessible space, open to everyone of all ages. The Hive celebrates bringing people together and providing communities with somewhere to get together, enjoy and be inspired.\nServices offered at The Hive:\n- community transport\n- community meals on wheels\n- activities hub\n- free play zone\n- community fridge\n- community pantry\n- The Honeypot Cafe\n- hairdressers\n- Thrive at The Hive: a shop of pre-loved items\nWhere: The Hive, Park Barn Drive, GU2 8EN\nWhen: Monday to Thursday: 9am to 4pm and Friday: 9am to 3.30pm\nAccessibility: Disabled access, disabled toilets, car parking\nNational Support & Advice\nNational Energy Action (NEA)\n- For advice and support for heating your home, click here or call 0800 304 7159\n- For steps to help you manage your energy bills and keep your home warm this winter, click here\nSmart Energy GB\n- For tips on how to make small changes to improve the energy efficiency of your home, click here\n- To find out how to use a smart meter to save money, click here\nSimple Energy Advice\n- For advice on how to reduce your energy bills, make your home warmer, plan home improvements and make your home greener, click here",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_page-2/content_28.html": "Zöe Franklin MP Welcomes CEO of Leading Software Engineering Firm Relocating to Guildford\nZöe Franklin MP has welcomed PE Ltd and their CEO Greg Grimshaw to Guildford constituency with a visit to the company’s new headquarters next to the University of Surrey’s Guildford campus.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_analysis-by-guildford-mp-zoee-franklin-reveals-latest-figures-showing-thames-water-sewage-dumping-more-than-tripled/content_29.html": "Analysis by Guildford MP Zöe Franklin Reveals Latest Figures Showing Thames Water Sewage Dumping More Than Tripled\n“Not only a scandal, but an insult” on the day Thames Water bills increase by 31%.\nGuildford Constituency MP Zöe Franklin has analysed the Environment Agency’s latest figures and is “horrified” by her findings.\nThe latest figures, covering 2024, show Thames Water dumped sewage in our local waterways:\n- 94 separate times\n- for a total of more than 944 hours\n- the equivalent of 39 continuous days\n- three times more than 2023 figures\nStatistics from 2023 showed 38 separate spillages, covering 300 hours.\nZöe Franklin MP said: “I was horrified to see the appalling increase in the amount of sewage dumped in our waterways, and on the day everyone in Guildford and our villages is seeing their water bills increase by 31%, it is an even bigger insult.\n“Failing Thames Water is still paying bonuses to senior executives and shareholders while taking on even more debt on top of the £19bn it already owes its creditors.\n“We are all seeing our bills going up from today. And a third of what we pay is spent on repaying the interest on the company’s debt.\nMs Franklin continued: “One lifelong Guildford resident wrote to me saying how sad he is to have seen the countryside decline so far since his youth. And it has been heartbreaking reading all the letters from schoolchildren, some still at primary school, who are worried about the damage Thames Water is doing to our environment.\n“One family told me their bill from today will be going up to £670 a year, an increase for them of nearly 50% since last year. “Is this a sort of joke?” they asked. Of course, they know it’s not. It’s a reality for all of us.\nThe Liberal Democrats are campaigning for failing Thames Water to be made a “public benefit company”, where profit is no longer put ahead of serving its customers and protecting the environment. It is calling for OFWAT to be scrapped and replaced by a new regulator with the powers and the determination to hold water companies to account.\nZöe Franklin added: “These latest figures are scandalous. The harm that Thames Water has caused to the waterways and countryside of Guildford and our villages is a disgrace.\n“Thames Water’s environmental vandalism cannot be allowed to continue.\n“I’d invite the company’s senior executives to look these schoolchildren in the eye and have to explain that because of their failures, in years to come those children may well be looking back with regret, just as that gentleman is already doing.”\nEnvironment Agency Event Duration Monitoring figures can be found here.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_donate_zoefranklin/content_10.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowDonations made from this page will go to support Zöe Franklin MPs campaign to represent the people of Guildford.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_links-resources_crisis-support-mental-health/content_11.html": "Crisis Support: Mental Health Helplines & Resources\nYou and your family's mental health matters. Here are some ways you can get help and support.\nContact your GP or Care Coordinator if you have one. They are your first port of call if you are feeling worse, both physically and mentally, or if you feel you require medication or need to change your medication. Ask for an urgent/emergency appointment if necessary.\nSurrey Heartlands Mental Health Support\nIf you are experiencing a mental health crisis, please telephone 0800 915 4644 (365 days a year, 24 hours a day).\nIf you have speech or hearing difficulties, you can contact the helpline through:\n- SMS 07717 989 024 (this service is only available to adults aged 18 years and over)\n- Relay UK service\n- Call 18001 0800 915 4644 from your text phone or smart app\nFor more information, go to the Surrey & Borders website here.\nGuildford Safe Haven\nAn evening and weekend drop-in service for anyone experiencing a mental health crisis or their carer.\nWhere: Oakleaf Enterprise, 101 Walnut Tree Close, Guildford, GU1 4UQ\nWhen: 6-11pm every day, 365 days a year\nDrop-in only (no phone line available) – no appointment needed.\nYou can also get virtual support during these times by going to: https://nhs.vc/sabp/safe-haven-guildford\nOther Support\nPapyrus\nPapyrus for children and young people aged under 35 years old a confidential support and advice service for those concerned about someone who is feeling suicidal and for those thinking about suicide.\nLink to website here.\nCall: 0800 068 4141 Text: 07860 039 967\nEmail: pat@papyrus-uk.org\nShout\nA 24/7 text support service.\nText Shout to 85258\nhttps://giveusashout.org/\nSaneline\nSaneline offers specialist emotional support and information to anyone affected by mental health difficulties, including family, friends and carers.\nTel: 0845 767 8000 (every evening, 6pm – 11pm)\nSupport forum: www.sane.org.uk\nSamaritans\n24/7 telephone and email chat anyone who's struggling to cope, who needs someone to listen without judgment or pressure.\nhttps://www.samaritans.org/how-we-can-help/contact-samaritan/",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed/content_2.html": "Surrey Lib Dem MPs slam Thames Water as stats reveal an average of 591.9 MILLION litres of water wasted every day due to leaky pipes\nHelen Maguire MP, Al Pinkerton MP, Chris Coghlan MP, Monica Harding MP, Zöe Franklin MP and Will Forster MP have said “Ofwat must go” as new stats paint a terrible picture about just how much water is wasted every day because of leaky pipes.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_zoees-campaigns/content_13.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_page-2/content_26.html": "Taking on Trump & Farage – and fixing church roofs\nLeader's Speech to Spring Conference 2025\nAs the Liberal Democrat MP for Guildford constituency, I am a committed advocate for the liberal values of inclusivity, opportunity, and equality. I am proud to be the voice of our communities across Guildford in Westminster, working hard on behalf all my constituents.\nSign up below for Zöe Franklin MP's regular newsletter\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_clips/content_14.html": "Calling on the Government to take immediate action to address the justice system backlog (House of Commons 22/04/25)\nSpeaking on the impact of the M25 Junction 10 Redevelopment on Local Businesses (House of Commons 08/04/25)\nQuestioning the Minister on Universal Credit and Cost of Living Challenges (House of Commons 08/04/25)\nCalling on the Government to strengthen housing support for domestic abuse survivors (House of Commons 07/04/25)\nSpeaking on the need to end the use of abusive Non-Disclosure Agreements in the creative industries (House of Commons 02/04/25)\nCalling for railway electrification to support sustainable travel (House of Commons 27/03/25)\nDemanding Action for Veterans Struggling to access PTSD Compensation (House of Commons 24/03/25)\nSpeaking to James Cannon about May 2025's local election cancellations in Surrey\nQuestioning the Government on funding to tackling flooding threats in semi-rural and urban communities (House of Commons 06/02/25)\nSpeaking on the impact of devolution in Surrey (House of Commons 05/02/25)\nSpeaking on the need to support the creative arts industry more widely and ensure its continued growth (House of Commons 27/01/25)\nSpeaking on the New Homes (Solar Generation) Bill (House of Commons 17/01/25)\nQuestioning the Minister on the switch to Internet Protocol Television (House of Commons 08/01/25)\nQuestioning Jane Featherstone on whether the British film and high-end television industry has what it needs to develop the UK talent pool (CMS Committee 07/01/25)\nQuestioning the Minister on Child and Adolescent Mental Health Support (House of Commons 06/01/25)\nSpeaking on the crisis in Special Educational Needs (House of Commons 19/12/24)\nSpeaking on Local Digital Television Programme Services (Legislation Committee 17/12/24)\nSpeaking on railway accessibility issues (House of Commons 19/11/24)\nResponding to the Autumn Budget (House of Commons 04/11/24)\nSpeaking to Peter Gordon about the weir restoration in Guildford (BBC Radio Surrey 01/11/24)\nSpeaking on Children's Hospice Funding (Westminster Hall 30/10/24)\nSpeaking to James Canon about the upcoming budget (BBC Radio Surrey 30/10/24)\nQuestioning the Minister about a European wide exemption from visas, work permits and trucking restrictions for UK music artists (House of Commons 22/10/24)\nSpeaking on rising rail fares (House of Commons 10/10/24)\nSpeaking on SEND provision & VAT on private school fees (House of Commons 8/10/24)\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_1st-february-2025-newsletter/content_35.html": "1st February 2025 Newsletter\nClimate and Nature Bill Update\nYou may have heard about recent developments in Parliament concerning the Climate and Nature Bill. Unfortunately, the Labour Government signalled that they were not prepared to let the Bill pass under any circumstances.\nI was proud to be part of the group of MPs who handed over the CAN Bill Zero Hour petition to 10 Downing Street in the summer of 2024. I was delighted when my Liberal Democrat colleague, Dr Roz Savage MP, submitted the bill as a Private Members Bill.\nDespite the bill not passing through Parliament on this occasion, Dr Savage was able to secure some key commitments from the Government during the debate. These include a commitment to meet with her to discuss how some of her demands could be included in future Labour bills, and the reaffirming of commitments on nature restoration, including pledges on oceans, more reporting on consumption emissions, more engagement with climate NGOs and a more joined-up approach to climate and nature rather than treating them separately.\nThe Liberal Democrats remain fully committed to tackling both the climate and nature crises. Our 2024 manifesto sets out ambitious targets, including cutting greenhouse gas emissions to net zero by 2045, protecting 30% of UK land and sea for nature by 2030, and doubling the size of the Protected Area network by 2050.\nGiven Labour’s views on the bill, rather than forcing the debate to close prematurely, a compromise was reached. This resulted in an Adjournment Vote, which simply delays the debate to another date, now set for 11 July.\nThis keeps the bill alive and ensures Roz’s negotiations with the Government can continue. It is unfortunate that the Labour Government will make us all wait to pass such an important bill, but at least we have a date to work towards.\nI know how important tackling the climate and nature crises is to residents across Guildford constituency, and I will continue to work hard in Parliament to ensure these issues remain at the top of the agenda. Thank you again for writing to me on this vital topic.\nStanding Up for our Creative Industries\nOn 27th January 2025, I had the privilege of speaking in Parliament about something I care deeply about—the UK’s creative industries.\nGuildford is a fantastic and varied creative hub for the South East that is often described as the Hollywood of the UK gaming industry. Our studios have had extraordinary success, producing world-renowned games like Little Big Planet, Baldur’s Gate 3, and No Man’s Sky.\nHowever, there is much more we can do to support this sector and the creative arts industry more widely and ensure its continued growth. UK gaming companies tell me they are increasingly struggling to find people with the skills they need.\nThat’s why I’m backing calls for a Digital Creativity GCSE—a vital step in ensuring our education system prepares young people for careers in gaming, visual effects, and other digital creative fields.\nI also spoke in support of the many creatives who have raised concerns with me that the government’s proposed changes to an opt out copyright model in order to support the development of AI in the UK will undermine creatives’ intellectual property right. We need to take the global lead on this issue because our other nations are watching the approach we take on it and will follow.\nCommunity News\nGuildford Cathedral welcomes its new Dean!\nOn Sunday, 26th January, I was delighted to attend the installation of Guildford Cathedral's new Dean, the Venerable Bob Cooper. It was a fantastic afternoon, and I wish Bob all the best in his new role.\nNationwide Building Society Dementia Nurse Clinics\nI recently visited Nationwide in Guildford to learn more about the specialist dementia support they are offering in over 200 branches through their partnership with Dementia UK.\nAdmiral Nurses will provide health and financial guidance in branch or over the telephone.\nYou can learn more about the support they are offering here.\nOpportunity for survivors to share their experiences with GP care after domestic abuse\nHealthwatch Surrey wants to better understand access to and experience of GP practices for people who have experienced, or are experiencing, domestic abuse. If you have been affected and feel comfortable doing so, please share your experience through this online survey.\nRailway Engineering works\nFrom the 1st to 16th February, railway engineering works will be taking place between Guildford and Reigate.\nThese works include renewing the tracks over a bridge on the River Wey in Shalford, stabilising an embankment in Gomshall and renewing the signalling and level crossings along the line.\nThis will include closures to the level crossings that are being upgraded, and signed diversions will be in place.\nDuring full road closures, pedestrians won’t have access to the crossings, but minibuses will be arranged to help any pedestrians around the closure.\nJourneys will be affected. You can learn more about the works here.\nIf you need me...\nIf you would like to get in touch or need my help, then I would love to hear from you. You can reach me at zoe.franklin.mp@parliament.uk.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_zoee-franklin-reacts-to-chancellors-spring-statement/content_3.html": "Zöe Franklin MP Reacts to Chancellor's Spring Statement\nChancellor's Spring Statement leaves Guildford constituency MP Zöe Franklin \"fearful\" for vulnerable people and local businesses.\n“Today was the opportunity for the Chancellor to make a positive change to Guildford's future. She did not deliver.”\nZöe Franklin MP said: “We are all going to see our household bills go up in the next few days.\n“We’ll be paying more for our gas and electricity, as well as our water bills, and increases in car tax and stamp duty will also take effect in the new Tax Year on 6th April.”\nMs Franklin continued: “Today’s statement confirms that disability welfare payments will be cut when people who need them can least afford it.\n“They are a lifeline to so many people. The letters I see every day are heartbreaking. PIP payments help with the extra costs of managing a health condition and enable people to maintain as much dignity and independence as possible. PIP can pay the costs of getting to work. One constituent told me without it, the journey would be impossible. The constituent wants to work and wants to contribute to their community. Taking away this sense of pride and achievement is devastating.”\nThe Spring Statement made no change to the planned increase in Employers’ National Insurance due from 6th April.\nZöe Franklin said: “The local businesses which have weathered fourteen years of the Conservatives’ economic vandalism, on top of the burden the pandemic brought, wanted to see the Chancellor review the increase in employers’ national insurance payments, due from 6th April.\n“This extra cost will place a huge extra burden on business, which are already under immense pressure.\n“The Liberal Democrats believe the big banks, social media and gambling companies should pay their fair share. Instead, local employers, the hospitality sector and of course our GP surgeries, care homes and hospices, will be facing increased costs.\n“The Spring Statement was a chance to bring positive change to people and businesses across the Guildford constituency. I am deeply disappointed, and I fear for the impact this will have on people who need the support of welfare, on businesses, jobs and our communities.”",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_18th-january-2025-newsletter/content_36.html": "18th January 2025 Newsletter\nBack to Westminster\nI was pleased to get my feet back under the desk in Westminster on 6th January, when Parliament returned from the winter recess. While our hard work did not stop over the festive period, it was wonderful to enjoy some quality time with friends and family.\nSince returning I have hit the ground running, here is my latest update...\nChild and Adolescent Mental Health Services\nBefore Christmas I shared in the House of Commons chamber the issues affecting constituents across Guildford and our villages who are struggling to access SEND support and the pressure this puts on families.\nSince returning, I have already raised the problems of Child and Adolescent Mental Health Services which is directly linked to the issues in SEND provision. Yet, because of the significant input required from NHS specialists, CAMHS sits in the remit of health, not education.\nCAMHS referrals can take up to 3 years, leaving young people without support or a diagnosis. This wait has wide ranging implications and can have a deeply damaging effect on a young person's mental health.\nI have heard too many stories from local residents of young people and their families are being failed by the current system and it is time that this comes to an end.\nThis is why I asked the Minister how this Labour government will be working to recruit and train more professionals to clear the CAHMS backlog and ensure that going forward the service is able to response in good time to requests for assessments and support.\nYou can watch my speech in full here.\nFighting for local democracy\nAs I am sure you may have heard, Surrey County Council are moving to postpone May’s local elections. I find this deeply concerning and I’ve hear from many of you who feel similar.\nWith so many issues facing Surrey County Council - from the appalling state of our roads to the crisis in Special Education Needs and serious failings in Child Safeguarding – residents across Guildford constituency and Surrey as a whole deserve their democratic right to hold elected officials to account.\nWhile I acknowledge the problems within local government, and understand the need for urgent and meaningful change, Surrey County Council has not developed plans that address the significant and complex issues that we face locally.\nAlongside the 5 other Surrey Liberal Democrat MPs, I have written to the Government to ask that the Surrey County Council elections go ahead as planned and give us more time as a county to thoroughly consider any changes.\nOur position is supported by all members of the Surrey Leaders Group, which is a cross-party group that brings together the leaders of all the Districts and Boroughs of Surrey, as well as the MPs representing the residents and businesses of Surrey.\nCommunity News\nGuildford’s Show Racism the Red Card winning entry!\nI would like to congratulate Royal Grammar School student, Aahan, on his winning entry to the Show Racism the Red Card competition – the largest anti-racism education competition for schools in the UK.\nAahan was one of 25,000 entrants and came 2nd overall in the All Ages T-Shirt Design Category. I was pleased to be able to visit RGS on 9th January to congratulate him in person. (attach photo)\nCrowdfund Guildford Spring round now open!\nCrowdfund Guildford provides funding for community projects, offering support for ideas that really matter to our community. You can find out more about Crowdfund Guildford and the projects supported by the scheme so far.\nIf you have an idea that you think could benefit Guildford, the deadline for project submissions is Wednesday 12 March.\nYou can also register for a place at a free online workshop on 28th January aimed at equipping fundraisers with the know-how, tools, and confidence you need to start your crowdfunding campaign.\nNominations for The Mayor of Guildford's Award for Service to the Community 2025 are now open\nThis award recognises those who have gone above and beyond to serve the local community.\nIf you're know any individuals, groups or organisations that are doing outstanding work in the community to improve the lives of others and foster good relationships in Guildford borough, please help celebrate their achievements by nominating them for the award.\nCall for views on housing strategies\nGuildford Borough Council are asking residents to give their views on two new housing strategies. These comprehensives strategies cover housing and homelessness and the plans aim to address current challenges, meet future housing needs, and ensure that every resident has a safe and suitable place to call home.\nYou can give feedback that will be considered as part of the annual review of the strategies by following this link.\nTravel updates\nLine closure between Guildford and Gatwick Airport from Saturday 1 to Sunday 16 February 2025\nWhilst engineers complete a number of critical upgrades on the North Downs Line, rail replacement buses will be running from Saturday 1 to Sunday 16 February between Guildford and Redhill (stopping at all stations) and Guildford and Gatwick Airport (running direct). You can stay up to date with the works progress here.\nA3 Closure January 2025\nThe A3 is closed again in both directions this weekend between the M25 junction 10 Wisley Interchange and the B2215/A247 at Send whilst the beams for the seventh of eight bridges are installed. This closure is in force from 9pm Friday 17 January to 6am on Monday 20 January.\nLane closure North Street\nA lane closure is now in place for the right-hand lane of North Street (between Leapale Road and Woodbridge Road) for several weeks to enable utilities work.\nIf you have any concerns or questions regarding this lane closure, more information is available from Surrey County Council.\nAnd finally...\nI’m really excited by what 2025 has to offer and I look forward to my first full year as Guildford constituencies Member of Parliament.\nIf you need my help, have any comments or suggestions, or if you feel there is a pressing issue you’d like me to raise, I’d love to hear from you. You can reach me at zoe.franklin.mp@parliament.uk.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_zoees-campaigns_thriving/content_8.html": "Thriving\nOur lives revolve around our local communities, and we want to feel strong and supported in them. I am on a mission to make our communities happy and thriving.\nFinding solutions to the cost of living crisis\nI have been visiting food banks and community centres to learn about their work, as well as running a cost of living survey to gauge the scale of the crisis across the constituency.\nSocial mobility is key to economic growth. I have been actively speaking in debates in Parliament about the need to reduce rail fares and the need to maintain the £2 bus fare cap, to ensure that all our local residents have access to the transport they need in order to thrive.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_contact-zoee/content_12.html": "Contact Zöe\nIf you have any opinions or questions for me, I would love to hear from you!\nYou can contact me by:\nEmail: zoe.franklin.mp@parliament.uk\nPost: Zöe Franklin MP, House of Commons, London, SW1A 0AA\nI receive a lot of correspondence, but always attempt to reply in as short a time as possible.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_donate/content_23.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowDonations made from this page will go to support Zöe Franklin MPs campaign to represent the people of Guildford.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_surrey-lib-dem-mps-slam-thames-water-as-stats-reveal-an-average-of-5919-million-litres-of-water-wasted-per-property-every-day-due-to-leaky-pipes/content_22.html": "Surrey Lib Dem MPs slam Thames Water as stats reveal an average of 591.9 MILLION litres of water wasted every day due to leaky pipes\nHelen Maguire MP, Al Pinkerton MP, Chris Coghlan MP, Monica Harding MP, Zöe Franklin MP and Will Forster MP have said “Ofwat must go” as new stats paint a terrible picture about just how much water is wasted every day because of leaky pipes.\nAn average of 3 billion litres of water is wasted every day in England and Wales (between 2020/21-2022/23) due to leaky pipes, House of Commons Library research commissioned by the Liberal Democrats has revealed.\nThis is the equivalent of 1,200 Olympic sized swimming pools of water being lost every day due to leakages in England and Wales.\nApproximately 591.9 million litres is lost every day because of these leakages caused by Thames Water, more than any other water company in England and Wales.\nThe data also reveals the impact this is having on households across England and Wales. On average, a total of 146 litres is leaked per property served by Thames Water every day.\nThe Liberal Democrats have calculated these water leaks are costing customers in England and Wales approximately £396 million per year in total.\nThe Liberal Democrats are calling for the government to abolish Ofwat in favour of a new regulator with real power to hold water companies accountable, protecting customers and the environment. The party has also called on the government to implement a single social water tariff to protect the most vulnerable customers from excessive bill increases, and for bonuses to water bosses of these failing companies to be banned.\nIn a joint statement by Surrey Liberal Democrat MPs Helen Maguire, Al Pinkerton, Chris Coghlan, Monica Harding, Zöe Franklin & Will Forster, they said:\n“It is scandalous that Thames Water are allowing millions of litres of water to be wasted every year, while our constituents are forced to pay outrageous water bills to a company that simply keeps failing its customers.\n“The Conservatives did nothing to tackle the issue, and now Labour continues to drag its feet, while Thames Water causes untold damage to our waterways and our constituents pay the price.\n“The Government cannot keep sitting idly by, whilst water companies exploit the system and pollute our waterways. Ofwat must go, and we must replace it with a regulator that finally holds these polluting companies to account.\n“Here in Surrey, we Liberal Democrats will continue to stand on the side of customers who have been taken for granted by water companies for far too long.”",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_links-resources/content_27.html": "Latest government advice and information\nThe latest government advice for households and businesses can be found by following the link here.\nIt is important to note that if you receive a text, email, or other form of communication asking you to apply for the new Energy Price Guarantee, it will likely be a scam. The discount is applied automatically, and there is no need to contact your energy supplier to ensure it is applied properly. You can report any suspicious messages by clicking the link here.\nGovernment Support\nWinter Fuel Payments\n- If you were born on or before 26 September 1955 you could get between £100 and £300 to help you pay your heating bills.\n- You will get your Winter Fuel Payment automatically (you do not need to claim) if you’re eligible and either:\n- Get the State Pension\n- Get another social security benefit (not Housing Benefit, Council Tax Reduction, Child Benefit or Universal Credit)\n- If you do not get either of these, or if you live abroad, you may need to make a claim\nWarm Homes Discount\n- A discount for some people getting Pension Credit or some people in low-income household.\n- This scheme will reopen in November and will allow households to secure a discount of up to £140 on their energy bills.\n- There are 2 ways to qualify for the Warm Home Discount Scheme:\n- you get the Guarantee Credit element of Pension Credit - known as the ‘core group’\n- you’re on a low income and meet your energy supplier’s criteria for the scheme - known as the ‘broader group’\n- When the scheme reopens you will be able to find information on how to apply here.\nLocal Support\nCAP Debt Advice\nCAP provide free help and advice to get out of debt, find a job, manage your money or gain vital life skills.\nFind out more here.\nGuildford Salvation Army Food Bank\nThe Guildford Salvation Army Food hub operates is open twice a week at Woodbridge Road Church and Community Centre, Woodbridge Road, Guildford, Surrey, GU1 4QQ.\nOpening times: Monday and Tuesday 9.30am to 11.30am\nYou can pick up or donate non-perishable food. Contact by email or phone to arrange a pick up time.\nNorth Guildford Food Bank\nThey provide temporary help for individuals and families through food parcels. To access it, you will need a referral from a partner organisation - you can find a list here.\nThe Hive (Park Barn Drive, GU2 8EN)\nThe Hive is nestled behind the trees along Park Barn Drive, just by Kings College School. The centre is an accessible space, open to everyone of all ages. The Hive celebrates bringing people together and providing communities with somewhere to get together, enjoy and be inspired.\nServices offered at The Hive:\n- community transport\n- community meals on wheels\n- activities hub\n- free play zone\n- community fridge\n- community pantry\n- The Honeypot Cafe\n- hairdressers\n- Thrive at The Hive: a shop of pre-loved items\nOpening times: Monday to Thursday: 9am to 4pm and Friday: 9am to 3.30pm\nAccessibility: Disabled access, disabled toilets, car parking.\nNational Advice & Support\nNational Energy Action (NEA)\n- For advice and support for heating your home, click here or call 0800 304 7159\n- For steps to help you manage your energy bills and keep your home warm this winter, click here\nSmart Energy GB\n- For tips on how to make small changes to improve the energy efficiency of your home, click here\n- To find out how to use a smart meter to save money, click here\nSimple Energy Advice\n- For advice on how to reduce your energy bills, make your home warmer, plan home improvements and make your home greener, click here",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_4th-january-2025-newsletter-happy-new-year/content_32.html": "4th January 2025 Newsletter - Happy New Year\nHappy New Year!\nSending my best wishes to all, I hope 2025 brings you many blessings!\nI believe this year is one full of opportunities for Guildford and our villages. As part of it, I’m looking forward to meeting as many of you as possible out and about in the constituency over the course of the year. More on that when I’m back in Westminster, today I wanted to share an end of year-round up.\nBefore I do, I see being MP as a partnership with local people and I’d love you to be part of the team working with me – you can find out how here and further down this email.\nWhat I’ve been up to\nI have been working hard to deliver the greener, fairer, more thriving Guildford constituency that I promised during my election campaign. Here is a flavour of what I have been up to in the final months of the year...\nGreener\n- Addressing the need for step-free train access - I recently spoke in Parliament to urge the government to use the nationalisation of the railways to end accessibility deserts and ensure that anyone who wants to use the train, can use the train. Too many people in our villages are prevented from doing so due to a lack of step-free access.\n- Discussing need for new stations - I met with South Western Railway to discuss the prospect of two new railway stations in Guildford – Merrow and Guildford West\n- Calling for government to keep bus travel affordable – called on the government to keep the bus fare cap at £2 rather than increasing it to £3 which will have big impact on anyone who has to get multiple buses in one day.\n- Seeking action on the Tumbling Weir - I met the National Trust to get an update on their weir repairs – good news is coming.\nFairer\n- Action to fix the crisis in Special Educational Needs (SEND) provision - a top issue in my inbox is the problems with SEND support across Surrey. In a speech on 19th December I shared the stories of some of the families I’ve spoken with and asked the Minister to meet me to discuss.\n- Spoken about the challenges faced by Children’s Hospices – having visited our local children’s hospice a number of times I used a debate to highlight the challenging financial position hospices are facing, with only one third of their funding coming from the NHS and central government.\nThriving\n- Called for Labour to scrap the rise in Employer’s National Insurance Contributions (NICs) - I’ve heard from residents made redundant because of the rise and business owners worried about their financial viability. Watch my speech here.\n- Visited numerous local charities and businesses – we are fortunate to have a healthy economy locally, and this creates a positive environment for local organisations. It’s also encouraging new businesses to move to Guildford, such as the UK National Measurement Laboratory, which is moving to the Surrey Business Park later this year. There will always be challenges too and as MP I am working tirelessly to provide support and a voice.\n4 ways you can get involved!\nI would love you as part of my team making Guildford constituency a greener, fairer, more thriving place for everyone. Here are some ways you can do that:\n- Sign up for my newsletter and stay up to date with my latest news, activities, campaigns and more. Why not share with friends, family and coworkers who live locally and encourage them to sign up too.\nYes, sign me up - Join my amazing team of volunteers – there's a role for everyone no matter your skills or time. From delivering to helping organising events, to speaking to people on the phone and office admin.\nYes, I can help - Make a donation - big or small, every donation goes towards helping me to do my work supporting local people and keeping them up-to-date with my work.\n- Join the Liberal Democrats – we live in difficult times and we need Lib Dem values more than ever (have a read here)\nAnd finally...\nIt is an honour and a privilege to serve our amazing communities across Guildford and our villages. I want to thank you for placing your trust in me and I look forward to serving you in the months and years ahead. Don’t forget, if you need my help, you can reach me at zoe.franklin.mp@parliament.uk.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_zoees-campaigns_greener/content_30.html": "Greener\nClimate change is the biggest threat to our existence, as Guildford's Member of Parliament, I am here to steer us into a greener future.\nTackling pollution and climate change\nI am demanding water companies be held to account for polluting our rivers and waterways - something our government is failing to do. I have already met with Thames Water and I will continue to hold them to account in the coming months and years.\nI am also challenging the Government on their decision to scrap the £2 bus fare cap, so vital for our local communities.\nI am pushing for real reform of our railways, including on ensuring step free access for our rural stations. If we are serious about tackling climate change and promoting economic growth, we need to make our railways accessible and reliable for all.\nDetermined to see appropriate, future proof housing\nI understand that people need housing, but I want to see all new builds being made future proof, environmentally sound and meet community needs, not just what developers want.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk/content_1.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nAs the Liberal Democrat MP for Guildford constituency, I am a committed advocate for the liberal values of inclusivity, opportunity, and equality. I am proud to be the voice of our communities across Guildford in Westminster, working hard on behalf all my constituents.\nSign up below for Zöe Franklin MP's regular newsletter\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_page-3/content_7.html": "Free To Be Who You Are\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nAs the Liberal Democrat MP for Guildford constituency, I am a committed advocate for the liberal values of inclusivity, opportunity, and equality. I am proud to be the voice of our communities across Guildford in Westminster, working hard on behalf all my constituents.\nSign up below for Zöe Franklin MP's regular newsletter\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_space-enterprise-lab-touches-down-at-surrey-research-park/content_4.html": "Space Enterprise Lab Touches Down at Surrey Research Park\nGUILDFORD, SURREY – Surrey Research Park, part of the University of Surrey, has strengthened its capabilities as a ‘launchpad’ for space innovation with the arrival of a new Space Enterprise Lab (SEL).\nThe state-of-the-art facility was opened by Guildford MP Zöe Franklin at the Park’s flagship Surrey Technology Centre, expanding the reach of the UK’s network of Space Enterprise Labs.\nDesigned to provide cutting-edge technology and collaboration tools for businesses and researchers, the SEL will play a vital role in driving innovation in satellite applications, non-terrestrial networks, and space communications.\nThe SEL is part of the Satellite Applications Catapult’s UK-wide network of 14 innovation hubs and supports Surrey Research Park’s \"Go Beyond Space\" campaign which showcases how the Park offers much more than just an office address for space-sector companies.\nWith a proven track record in supporting successful space businesses, including industry leaders like Surrey Satellite Technology Ltd (SSTL) and early-stage innovators in the SETsquared Surrey incubator, the arrival of the SEL will support the Park’s mission of supporting industry-academia collaboration and business growth.\nAfter touring the SEL for the first time, Zöe Franklin MP said:\n\"Guildford has long been a hub for cutting-edge research and innovation, and I am incredibly excited to support the opening of the new Space Enterprise Lab at Surrey Research Park. Facilities like this play a vital role in attracting future-focused technology businesses to our town, driving inward investment, and creating highly skilled jobs for our community. As space technologies continue to evolve, it’s essential that we provide the right support, like Surrey Research Park offers, for businesses to grow, innovate, and collaborate.\n“This new Space Lab will help local companies tap into national and global opportunities, strengthening Guildford’s position as a leader in the UK and global space and technology markets. I can't wait to see the impact this initiative will have on both our local economy and the wider space industry.\"\nA ‘Launchpad’ for Space Innovation\nSurrey Research Park is home to around 200 science and technology businesses, including a growing cluster of space-focused companies. The new Space Enterprise Lab adds to the Park’s thriving space and satellite community, reinforcing its role as a centre for cutting-edge research and industry collaboration.\nCaroline Fleming, Director of the Surrey Innovation District at the University of Surrey, said:\n\"We are delighted to welcome the Space Enterprise Lab to Surrey Research Park. This new facility strengthens both the University of Surrey’s and the Park’s role in space innovation, providing new capabilities for supporting space businesses and enhancing collaboration.\n“Our region has a rich heritage in space technology and the opening of the SEL at the Park enables us to better connect our thriving innovation community in Guildford with the wider UK space ecosystem. We’re grateful to the Satellite Applications Catapult and Space South Central regional cluster for enabling us to join this fantastic network of SELs across the UK.”\nAn Innovation Hub for Space Businesses\nThe Space Enterprise Lab at Surrey Research Park joins 13 other SELs across the UK, including locations in Harwell, Leicester, and Glasgow. The nationwide network aims to connect space entrepreneurs, researchers, and businesses, ensuring they have the tools and support needed to drive space technology advancements.\nEach SEL offers users free-to-access to an innovation space with advanced technology to support their space business by using:\n- VR headsets to visualize and interact with space data\n- Interactive collaboration tools for hybrid meetings and demonstrations\n- Flexible, modern workspaces designed to inspire innovation\nTo learn more about the Space Enterprise Lab and how to access its facilities, visit www.sa.catapult.org.uk/sel or contact sel@spaceenterprise.uk.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_page-4/content_18.html": "Britain must lead on defence and aid\nThe UK needs to strengthen both our Armed Forces and our soft power.\nAs the Liberal Democrat MP for Guildford constituency, I am a committed advocate for the liberal values of inclusivity, opportunity, and equality. I am proud to be the voice of our communities across Guildford in Westminster, working hard on behalf all my constituents.\nSign up below for Zöe Franklin MP's regular newsletter\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_volunteer/content_37.html": "Help me make a real difference in Guildford\nYou could join my fantastic team of volunteers, donate to my campaign, subscribe to my newsletter or join the party.\nYou could join my fantastic team of volunteers, donate to my campaign, subscribe to my newsletter or join the party.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_zoee-franklin-mp-welcomes-ceo-of-leading-software-engineering-firm-relocating-to-guildford/content_34.html": "Zöe Franklin MP Welcomes CEO of Leading Software Engineering Firm Relocating to Guildford\nPE Ltd, with a global client base, chooses “Vibrant” Guildford for “Excellent Infrastructure and Skilled Talent Pool” and plans to support local schools to “Ignite children’s curiosity.”\nZöe Franklin MP has welcomed PE Ltd and their CEO Greg Grimshaw to Guildford constituency with a visit to the company’s new headquarters next to the University of Surrey’s Guildford campus.\nThe company is relocating from Edinburgh and has chosen “vibrant” Guildford for its new base as it works towards expanding its market-leading business into new sectors, including healthcare and banking.\nZöe Franklin, Liberal Democrat MP for Guilford constituency, said:\n“I am thrilled to see this leading software engineering company choosing Guildford as the perfect location to grow its business. It’s no secret to everyone across Guildford and our villages that our area has so much to offer, and I am delighted to see our wonderful town and our local talent being recognised by a company which already has a global client base, and which is preparing to expand.\n“Intending to grow from 100 to 300 employees will be a very welcome boost to the local economy. It also is a vote of confidence in Guildford. We are proudly forward thinking, with ambition and an excellent pool of talent.”\nGreg Grimshaw, CEO PE Ltd invited Guildford’s MP, Zöe Franklin “to share with her our plans for collaboration with other Guildford enterprises; we value the support and insight that local representatives bring to the business community.\n“We look forward to discussing how we can contribute to Guildford’s economic and technological landscape.” Zöe Franklin added: “The company’s commitment to collaboration with local businesses and other innovators as well as working with children to encourage their curiosity is so refreshing.\n“I warmly welcome this exciting news and look forward to Guildford and PE Ltd working well together.”",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_stay-informed_article_zoee-franklin-mp-urges-chancellor-to-review-jobs-tax-threatening-high-streets/content_15.html": "Zöe Franklin MP Urges Chancellor to Review “Jobs Tax” Threatening High Streets\n“For our High Streets to thrive, our businesses need support. The Chancellor must review the increase in National Insurance and overhaul business rates.”\nZöe Franklin said: “Businesses across Guildford constituency have told me about their worries surrounding the increase in employers’ national insurance, due from 6th April.\n“I am urging the Chancellor to rethink this. For our high streets to thrive, we need our local businesses to thrive. There are already far too many empty shops in what should be the vibrant community centres of Guildford and our villages.\n“The Chancellor must review this, as well as overhaul the business rates system, to trigger the growth that our high streets desperately need.\n“The businesses that weathered 14 years of economic vandalism under the Conservative government need support to thrive again.\n“We risk losing some of our oldest and much-loved businesses which are part of what makes our high streets such a valuable asset, and such a valued part of local communities.”",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_get-involved/content_9.html": "Help me make a real difference in Guildford\nYou could join my fantastic team of volunteers, donate to my campaign, subscribe to my newsletter or join the party.\nYou could join my fantastic team of volunteers, donate to my campaign, subscribe to my newsletter or join the party.",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_winter-help-support/content_5.html": "Winter help & support\nThe winter months can be challenging for many local residents, but there is help and support available.\nGuildford Borough Council\n01344 949371 – Out of hours emergencies\n01344 949371 – Flooding and sandbags\n01483 532122 – Emergency housing repairs (Council tenants)\n01483 517898 – Homelessness/emergency housing situations\nOther\n999 – Police/Ambulance/Fire\n101 – Non-emergency police issues\n111 – Urgent medical help for non-emergency situations\n0300 200 1003 – Surrey County Council\n01483 517898 – Social Services\n105 – UK Power Networks\nNHS winter ready - www.surreyheartlands.org/winter-ready\nSurrey winter night shelters - www.connecttosupportsurrey.org.uk/information-and-advice/essential-services-over-the-festive-period/winter-night-shelters/\nHelp and advice for older and vulnerable people in bad weather and winter - www.surreycc.gov.uk/community/emergency-planning-and-community-safety/winter-advice/how-adult-social-care-can-help-in-severe-winter-weather",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_search/content_20.html": "News\nHelen Maguire MP, Al Pinkerton MP, Chris Coghlan MP, Monica Harding MP, Zöe Franklin MP and Will Forster MP have said “Ofwat must go” as new stats paint a terrible picture about just how much water…\nView\nNews\nOpen Letter to Karin Smyth, Minister for Medicines Supply\nWill co-signs an open letter, alongside Pancreatic Cancer UK, to raise awareness over the alarming shortages of Pancreatic Enzyme Replacement Therapy.\nView\nNews\nZERO Carbon Guildford is excited to announce that Zöe Franklin MP will be attending two inspiring community events at ZERO on Saturday, 26th April. The events offer a unique opportunity for residents…\nView\nNews\nThe Middle East: My thoughts on the conflict\nWill visited Israel and Palestine because he wanted to understand more about the conflict. \"I wanted to push for peace, and I wanted to see how both myself and the UK can help to achieve this.\"\nView\nNews\nEarly Years and Childcare Providers\nWill signs letter to support private and voluntary providers in early years childcare\nView\nNews\nWill's response to constituents who have gotten in touch about the Terminally Ill Adults (End of Life) Bill ahead of its 3rd reading in Parliament.\nWill has responded to many constituents who have gotten in touch with him over the Terminally Ill Adults (End of Life) Bill ahead of its 3rd reading in Parliament.\nView\nNews\nStanding Up for Animal Welfare: Will Forster Responds to Calls to End Animal Testing\nWill has responded to constituents' concerns about the use of animals—particularly dogs—in scientific testing. Will calls for greater transparency, investment in alternatives, and the full…\nView\nNews\nWill's response to constituents about the government proposals to scrutinise bank accounts of benefit claimants.\nWill Forster has spoken out against government plans to let the DWP access benefit claimants’ bank accounts, warning of serious privacy concerns.\nView\nNews\nMP launches ‘Buy Woking, Back Britain’ campaign in the wake of Donald Trump’s tariffs\nLocal Liberal Democrat MP, Will Forster, has launched a ‘Buy Woking, Back Britain’ campaign to support local businesses in the wake of Donald Trump’s tariffs announced this week.\nView\nNews\nPlanning: Concern Over the Removal of Statutory Consultees\nWill co-signs letter to the Deputy PM about the removal of Statuary Consultees in the planning process, meaning graded properties could be at risk\nView",
  "https_www_zoefranklin_co_uk_/https_www_zoefranklin_co_uk_about-zoee/content_16.html": "Zöe Franklin\nZöe Franklin has been the Liberal Democrat Member of Parliament for Guildford since July 2024.\nZöe grew up in Farnham and moved to Guildford in 1999, to study Music at the University of Surrey, and has lived there ever since.\nAfter graduating from the University of Southampton with a Master of Musicology in 2005, Zöe worked in the creative sector before becoming involved politically. She was elected as a Guildford Borough Councilor for Stoke ward in a by-election in October 2008. She served as a councillor until 2015.\nZöe first stood for parliament in the 2017 General Election, coming second to Anne Milton. Zöe stood for a second time in 2019, achieving a 12.5-per-cent swing to the Lib Dems against the backdrop of a substantial Conservative majority nationally, before winning the 2024 General Election, with a 47.5 per cent of the vote and a majority of 8,429.\nZöe is the fourth successive woman to represent Guildford constituency and only the second non-Conservative MP to hold the seat."
}